{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "liveproxies.io",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "IMHUSTLNGAMIN IMHUSTLNGAMIN",
          "Nb_Reviews": 3,
          "Date": "2023-09-06T05:28:26.000Z",
          "Titre": "Don't buy proxies are 9/10 won't work",
          "Contenu": "I bought proxies for a Supreme drop 30 mins after purchase I plugged them in and they didn't work. I tried them through out the day and next morning still didn't work on Supreme atleast they tried to say it was a user error which that's what most proxy companies will say when it's their fault avoid at all cost DaHennyGawdPS i tried to proxies serval different times with the same results and my IP wasn't white listed its just what u scummy proxies dealers say to cover ur a$$ 15+ people had the same problems"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dmt",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T22:24:21.000Z",
          "Titre": "got trash proxies every time",
          "Contenu": "Everytime I bought these they were banned on everything not one checkout came out of them and when I questioned it I was told it’s not the proxies…it was definitely the proxies. All my other providers for checkouts. Customer service sucked as well"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jesse g",
          "Nb_Reviews": 2,
          "Date": "2022-11-29T20:42:50.000Z",
          "Titre": "Management team/support team are very…",
          "Contenu": "Management team/support team are very rude, not very understanding and very inconsiderate of their actions towards users and the impacts their choices have. Would not recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Avi Friedman",
          "Nb_Reviews": 2,
          "Date": "2022-12-09T00:52:35.000Z",
          "Titre": "The owner is a clown",
          "Contenu": "The proxies are good but the owner is a complete clown. Just know that anytime you have an issue with Live, all you will get is a discount code so he can make more money off of you. Then he will threaten you if you post bad about him. The dude is a terrible businessman and buyers should beware."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T16:49:44.000Z",
          "Titre": "Most of my proxies were down during a…",
          "Contenu": "Most of my proxies were down during a release. They're just not reliable. Update: As per the answer below. No, it had nothing to do with my internet. My internet was actually very reliable that morning."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daddy",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T19:26:00.000Z",
          "Titre": "overpriced netnut garbage",
          "Contenu": "youre overpriced netnut garbage with an ego even wilder than your prices"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "EHh",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T19:25:08.000Z",
          "Titre": "Support is awful",
          "Contenu": "Not the biggest fan of how support operates and/or carries themselves"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Simon Zimbo",
          "Nb_Reviews": 1,
          "Date": "2022-11-20T20:43:41.000Z",
          "Titre": "This product sucks… they charge the…",
          "Contenu": "This product sucks… they charge the moon for proxies that cost them probably 15% of what they sell them for… There making 400-500% ROI. and the proxies crash a lot."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mkho",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T05:58:37.000Z",
          "Titre": "Never hit a single drop",
          "Contenu": "Never hit a single drop, couldn't tell if it was the bot or the proxies but I never hit with stellar and project destroyer"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Your dad",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T05:14:05.000Z",
          "Titre": "Needs reminder data running out or auto…",
          "Contenu": "Needs reminder data running out or auto renew I’ve lost so much this way and live doesn’t give a sh$t just says too bad"
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "OIL BQD",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T05:29:00.000Z",
          "Titre": "overlord clause",
          "Contenu": "If I forget to renew for one day, the remaining traffic will not be saved. This is the overlord clause."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "keaton hamin",
          "Nb_Reviews": 2,
          "Date": "2022-11-30T07:45:00.000Z",
          "Titre": "awful customer service",
          "Contenu": "awful customer service, you can tell they are only in it for money and don't care about customer experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Khalsa Singh",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T05:05:56.000Z",
          "Titre": "Proxies are terrible never work"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jss",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T05:10:47.000Z",
          "Titre": "Never hit using them charlimit"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JR",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T14:21:43.000Z",
          "Titre": "Prices are good but price is ridiculous…",
          "Contenu": "Prices are good but price is ridiculous too expensive"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "E. Meyers",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T19:25:55.000Z",
          "Titre": "Expensive Business Model",
          "Contenu": "Business model makes it almost a necessity to continue purchasing plans/data. Performance is good but in most cases is not worth the hundreds of dollars to continously keep your plans active for when you do need them. Also, read the Live Proxy Team's responses to the low star reviews, they are going so far as to track down people's emails and review their account purchases, then post their activity on a public forum? What reason would you have to do that on a multitude of occasions? Make what you would like of that."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rashad Golden",
          "Nb_Reviews": 2,
          "Date": "2022-12-14T05:14:26.000Z",
          "Titre": "I stopped using live because it became…",
          "Contenu": "I stopped using live because it became over saturated and over priced.  I noticed dishonesty as well.  Live isnt even top 5 any more and  i got a plan and it worked well so then i increased my plan and i guess i got a bad range and was stuck with it but it was pure Koala dookie."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christopher Sanders",
          "Nb_Reviews": 2,
          "Date": "2022-11-29T19:25:24.000Z",
          "Titre": "The proxies were good, but overpriced and expire too fast.",
          "Contenu": "The proxies were good. Just overpriced and I don’t like how they expired when I only got to use 10% of them bc there was no drops. Plus there are too many rules when using them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jay Lor",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T19:32:21.000Z",
          "Titre": "Doesn't work on footsites"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "walter J Morales",
          "Nb_Reviews": 2,
          "Date": "2022-11-29T20:48:18.000Z",
          "Titre": "Slow proxies"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Luvberto",
          "Nb_Reviews": 2,
          "Date": "2022-12-01T22:32:02.000Z",
          "Titre": "Proxies never fail, but overpriced",
          "Contenu": "Proxies never fail. Honestly would rate them higher if there prices was lower."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Vicky bhatia",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T11:03:29.000Z",
          "Titre": "Live",
          "Contenu": "Proxies are pretty fast compared to other residentials however there’s a lot of connection/service issues that I’ve been facing. The CA plan gives a lot of errors on Footlocker CA and also I noticed the proxies have been burning faster than usual as well, I don’t know if that’s a datadome thing but 8gb would last me a month+ however it’s only been about 2 weeks and 4gb is gone already"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-06-04T12:51:55.000Z",
          "Titre": "Sooo it was a little confusing dash but…",
          "Contenu": "Sooo it was a little confusing dash but they worked for the onyx 350 n pirate but other than that I was getting errors everywhere"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "sastri ramkissoon",
          "Nb_Reviews": 4,
          "Date": "2023-03-01T23:10:50.000Z",
          "Titre": "Just my 2 cents",
          "Contenu": "Have been using Live proxies for quite a while now and for the most part the proxy works well. My biggest problem would be the fact that users have to purchase brand new plans each month when they still have multiple gigs remaining on the current data plan. I understand that you guys are running a business, but every good business needs to adjust their operations to the ever changing times and to best server their customer. To this issue you guys have been unwilling to make any changes. A simple option to top up would be wildly appreciated Thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JM",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T05:57:43.000Z",
          "Titre": "I would like to see a loyalty program…",
          "Contenu": "I would like to see a loyalty program or incentive for users that use the product. Also would like for the longer period before expiration (60 days) to return being that profitable drops are spread out and there’s slow periods ."
        },
        {
          "Note": 3,
          "Lieu": "HK",
          "Pseudo": "cc c",
          "Nb_Reviews": 2,
          "Date": "2023-04-01T05:37:12.000Z",
          "Titre": "extend the validity period",
          "Contenu": "There are very few releases recently, I suggest extending the validity period, otherwise the traffic will not be used up, and the more you stack up, the more you will get."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charlie",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T07:55:47.000Z",
          "Titre": "Need to extend the 30 day period",
          "Contenu": "Proxies work well for what I’m using them for (Shopify) but I never need the full amount of data. I buy the $100/month option and only use about half. I wish it would extend now that YS and retail stores aren’t needed."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Megapreme",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T20:01:38.000Z",
          "Titre": "Live proxies",
          "Contenu": "Have been my top provider for about 2 years… recent footsite changes made running hard now… ip banned , datadome , region lock ….."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Vicky bhatia",
          "Nb_Reviews": 2,
          "Date": "2022-11-29T19:24:26.000Z",
          "Titre": "Ftlca geoforce",
          "Contenu": "Live only seems to perform best when geoforce is down on ftlca even though we have ca isps designated but works decently well on shopify sites"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "This one",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T04:44:23.000Z",
          "Titre": "Proxies drain so quickly",
          "Contenu": "Proxies drain so quickly. Lots of excuses on why but Live is the only company that it keeps happening with."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T20:03:12.000Z",
          "Titre": "Proxies work great but the amount of…",
          "Contenu": "Proxies work great but the amount of IPs for the price is really just not sustainable or worth it in this market."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Henry",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T19:23:26.000Z",
          "Titre": "Too expensive for 30 days"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Joel McCurdy",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T08:42:26.000Z",
          "Titre": "ALMOST 5 ⭐️",
          "Contenu": "this rating would be 5 stars if longer plans were available!!!"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Mike N",
          "Nb_Reviews": 1,
          "Date": "2022-12-04T02:51:01.000Z",
          "Titre": "Decent quality proxy",
          "Contenu": "In general the proxy works well for most sites. However, it does not perform well on hype drops. Hopefully it could be improved in the near future."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Vavity",
          "Nb_Reviews": 2,
          "Date": "2022-12-03T00:29:51.000Z",
          "Titre": "solid quality",
          "Contenu": "Prices quite high, but there's a history of quality. Can be quite reliably and issues are usually resolved as soon as possible."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Botboy",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T17:33:54.000Z",
          "Titre": "Proxies are decent",
          "Contenu": "Proxies are decent, still expensive for what it's worth. Owner gives random discounts. Hit or miss with Nike/FS."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Martin Torres",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T09:11:04.000Z",
          "Titre": "Did not work on initial drop but worked…",
          "Contenu": "Did not work on initial drop but worked for restock"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adham A.",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T23:31:30.000Z",
          "Titre": "Gets the Job Done",
          "Contenu": "Great product, excellent customer service. Wish the pricing was a bit more reflective of current market conditions. The discounts help a little bit, but still on the expensive side."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Payas Shah",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T18:18:37.000Z",
          "Titre": "The proxies are awesome works best",
          "Contenu": "The proxies are awesome works best. It even workes where other proxies fail, just the sad part is they are pricy and sometimes some bots tend to eat up proxies and the buyer has to suffer the loss. Customer support is awesome and they respond to any queries on priority basis."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Lil Johnny",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T05:32:45.000Z",
          "Titre": "Quality Proxies",
          "Contenu": "Probably the best proxy provider in the game. Only reason I didn’t give a 5 star was because they are quite costly and they expire within a month. Would be nice if leftover data rolled over onto your next plan. But I guess they have to go about it this way because of the unique IPs they provide. Overall, great proxies but I don’t purchase often because of the reasons stated above."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fernando— Luiggi",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T01:21:49.000Z",
          "Titre": "Live proxies my To-Go tool…",
          "Contenu": "Live proxies has been my to-go mainly when YS was a thing, wasted so little data it was worth the investment. Only small hiccup was maybe to have added some sort of reminder for when plans were going to expire. Had around 40gb lost due to it. Hard to keep up with cg renewals, bot renewals etc. but for the most part has been great. Now that foots/Shopify and Nike are slowly picking up I’ll be getting a new plan once a nice code drops. Keep it up 💯"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fernando castro",
          "Nb_Reviews": 2,
          "Date": "2022-11-30T01:20:38.000Z",
          "Titre": "Live proxies has been my to-go mainly…",
          "Contenu": "Live proxies has been my to-go mainly when YS was a thing, wasted so little data it was worth the investment. Only small hiccup was maybe to have added some sort of reminder for when plans were going to expire. Had around 40gb lost due to it. Hard to keep up with cg renewals, bot renewals etc. but for the most part has been great. Now that foots/Shopify and Nike are slowly picking up I’ll be getting a new plan once a nice code drops. Keep it up 💯"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Butter dog",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T03:19:53.000Z",
          "Titre": "Live",
          "Contenu": "Worked fantastic on every site that I ran, never had any issues with them going down, only reason for 4 stars is that I never had enough time to use all of my data ever since yeezy supply went away, maybe a plan with less Ips, less data but more time to use would be a good idea, like for shopify because that Is what I mainly use live for now"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "niloy",
          "Nb_Reviews": 2,
          "Date": "2022-11-30T03:05:11.000Z",
          "Titre": "Live proxies offers premium quality IPs",
          "Contenu": "Live proxies offers premium quality proxies with a good amount of success. The reason why I don’t focus my set up on LiveProxies is due to its cost. I am not saying the cost isn’t worth the product per say, but the way drops are done recently makes not too beneficial for me. Despite all this, the premium quality gives it at least 4 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Max L",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T03:42:08.000Z",
          "Titre": "Really great product",
          "Contenu": "I really love Live Proxies as they are my Go-To for anything with proxy protection, etc, I'm sure the only valid complaint anyone can have about Live Proxies is the pricing. It is one of the more expensive proxy plans out there. Nevertheless, I still always keep a plan handy as its very useful to me. I just wish there was some loyalty system or some way that let me renew at a good discount without having to wait for codes or people to react to get 1% more on the discount."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "akopa",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T02:55:32.000Z",
          "Titre": "Live Proxies Review",
          "Contenu": "Best resi provider I've used, I mainly use on shopify and it has very good success there. Even though it is a little pricey, I believe the amount of IPs it comes with makes it worth it especially for new domain drops. I would 100% recommend buying from live as I will continue to for the rest of my botting career."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JWA",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T03:13:59.000Z",
          "Titre": "Product works well",
          "Contenu": "Product works well, better than most other proxy providers.  Wish the plan duration was longer, or a renewal option without adding data was available.  I have so much unused data and it hurts thinking I'd be burning money by not renewing... Please add a renewal option for plan extensions without adding data."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Miguel lopez",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T02:50:33.000Z",
          "Titre": "Proxies work fine but the prices are…",
          "Contenu": "Proxies work fine but the prices are expensive and I feel there aren't enough incentives in this current market.Edit: I decided to bump up to a 4 star only because I remember how much I used to cook with these proxies, but at the moment prices need to be lowered or given more incentives hence the 4 star"
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "LenGary",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T04:06:25.000Z",
          "Titre": "Live is recommended",
          "Contenu": "I have been using Live for a long time, because I am very troubled by the traffic problem of resi, Live has solved it very well, because everyone can obviously feel that the traffic loss is very small, and the quality is very highBut I also want to give my opinion. Some good discount codes are usually issued during special periods, but we may not need to use them at that time. I suggest that the plan can be frozen until I need to use it and activate it again, which can prevent me from losing unnecessary time"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jean",
          "Nb_Reviews": 2,
          "Date": "2022-11-30T03:37:41.000Z",
          "Titre": "Great experience with Live",
          "Contenu": "Great experience with Live, one of the best I've used. Team has always been transparent to my knowledge. Proxies have been amazing from experience and has been great for me in terms of botting much of every site. I guess my reason from this review being a 5 star, is not having a bit of a higher percentage of coupons more often, I think the lowest I saw was low 30 something and that was recently, hope to see more, maybe in the 40s of discount of possible. Great team and great response to tickets overall."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chuck Liv",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T03:44:22.000Z",
          "Titre": "Great quality proxies",
          "Contenu": "Great quality proxies. You can sort of tell from the pricing that this is a premium product. It is on the expensive side, but it does work. Generally I've had less issues with Live IPs than other providers. Some of my IPs do have trouble, but the support in the server is responsive in dealing with it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tj",
          "Nb_Reviews": 3,
          "Date": "2022-11-30T02:50:18.000Z",
          "Titre": "Great product, with almost no downside",
          "Contenu": "Solid, I’m a huge fan, the only negative I could point out is the fact that if you do not buy a renewal plan your data will expire. Some companies will give you the data back when you purchase a plan, so that way if your plan expires the data is not gone forever if you purchase another plan in the future"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 4,
          "Date": "2022-11-30T03:06:55.000Z",
          "Titre": "The best resi provider I have used",
          "Contenu": "I have been using this provider for almost a year. The proxies are never down and have been the best residential proxies I have ever used. Un throttled and fast as well.  Price is a little high but competitive and with the success I have had I cant complain. Will continue to use Live proxies."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Guest",
          "Nb_Reviews": 16,
          "Date": "2022-11-30T03:04:09.000Z",
          "Titre": "Finally got access to the product after…",
          "Contenu": "Finally got access to the product after 6-7 months of trying. Some real good Shopify success my first weekend, but not so much on Footsites and Hibbett as of yet. Burned through a lot of data my first week, so need to work on better management. Good discounts when you pay attention to them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dooley",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T02:56:38.000Z",
          "Titre": "Good company with excellent proxies",
          "Contenu": "Good company with excellent proxies. Been a long time customer of theirs. 95% of the time I've been happy with them. They've had MINOR outages and I feel like there were times I could have been taken better care of when I ran into issues. Other than that I recommend them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MicGyver",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T05:33:16.000Z",
          "Titre": "They just work",
          "Contenu": "From my experience they’ve been more consistent than other proxies across different types of sites. I’ve used them for retail, Shopify, YS (rip) and sometimes foots and some raffles. My only problem really was trying to burn thru my data by the end of the month. Some months wished they offered a lesser gig plan for those slow months. I’m great full I got to run with them as often as I did."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Phandar",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T04:58:06.000Z",
          "Titre": "The GOAT at it's peak",
          "Contenu": "At its peak, the most reliable and goated proxies in the market. I have used them before and they were always working and always copped me pairs. Since the introduction of CA proxies, I was able to test them out for a month but I had mixed reviews as they didn't seem to perform as well on Footlocker CA, and with its high price tag for a limited amount of proxies I had to move away from Live.On the upside though, I found that the staff team are very dedicated to your success and experience and the data always burned slower compared to other companies as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mitch J Moody",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T23:21:55.000Z",
          "Titre": "Back when footsites was a thing",
          "Contenu": "Back when footsites was a thing, I used to have great success with live. Had some success on yeezy supply also up until it’s last days of releases. Every now and again I would hit on Shopify but that was extremely rare. I didn’t bot this year like I had but that’s due to obvious reasons caused by the changes this year. Overall I was satisfied. Had a decent run. I’m seeing current success on Nike for others but I’ve yet to try it myself."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Derrick Lin",
          "Nb_Reviews": 2,
          "Date": "2022-11-29T19:39:58.000Z",
          "Titre": "Proxy is good but expensive",
          "Contenu": "Proxy is good, nothing to complain about. With the current market no point of having so much data. My plans kept rolling over. I used to have one extra plan on a burner but I let 13-15gb exp. Or else that is another $150 every 45 days.  Main account still got 40gb with no big drop in sight. Increasing the duration is better than giving bigger discount imo. Helps the returning customer more."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "adi",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T18:18:10.000Z",
          "Titre": "Live Proxies",
          "Contenu": "Ive used live proxies before and they are undoubtedly the best proxies on the market. They work for everysite and always give good results. The only thing is that they are very expensive and not really affordable unless you hit on a high scale."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "NsK",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T03:06:13.000Z",
          "Titre": "Live been working great due to the…",
          "Contenu": "Live been working great due to the quality of the proxies and the fact that they burn way less than other providers is a plus as well. I hope to continue to use your product but if there are no drops, it is hard to justify the renewal."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Loyal Custy",
          "Nb_Reviews": 2,
          "Date": "2022-11-29T19:39:11.000Z",
          "Titre": "Proxies are amazing but…",
          "Contenu": "Proxies are amazing but the 30 day expiry that I previously had didn’t make the proxies cost efficient and therefore became too expensive to keep renewing. I was loosing money and not using a lot of data due to resell margins shrinking and not running for as many drops as I had previously."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kio",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T03:23:38.000Z",
          "Titre": "The product works very well",
          "Contenu": "The product works very well. So well that the durable is quite short. I find myself buying new set before coming to using any data. Given the lack of drops recently, I been accumulating quite a bit of data."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sudz",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T03:05:30.000Z",
          "Titre": "Good but expires too fast",
          "Contenu": "I use Live proxies off and on and they are especially good for Shopify and I use to use them a lot for SNKRS. My only issue with Live is that I can never use my plan up before it expires."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Devin",
          "Nb_Reviews": 3,
          "Date": "2023-01-07T20:38:45.000Z",
          "Titre": "Great Proxies",
          "Contenu": "I am happy to say that the product Live Proxies delivers is very good. The only downside is the cost, and most of the time people try to get the cheapest product in order to maximize margins. I just wish it wasn't so expensive as the average price per GB is higher than most competitors. Regardless they work on pretty much anything if you don't abuse them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jp",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T20:06:27.000Z",
          "Titre": "0 downtime and great support",
          "Contenu": "I purchased live proxies for the intent of using them on Yeezy supply, but I was unaware that they weren't working properly on this website at the time. That's why I took off a star. They were great on everything else and the data didnt burn fast. Proxies were always up and support is always there if you need anything"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven Rivadeneira",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T16:35:09.000Z",
          "Titre": "Live proxies has made me money over the…",
          "Contenu": "Live proxies has made me money over the past months, my only concern is the price or the proxies however I do believe that they are clean ranges as I almost never have issues with bans. I’m looking forward to see how their static resis do and what their prices will be."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dewin Diaz",
          "Nb_Reviews": 2,
          "Date": "2022-11-29T20:57:07.000Z",
          "Titre": "Proxy’s are great but I’m stuck with…",
          "Contenu": "Proxy’s are great but I’m stuck with 174 ip which staff says is good, but it’s really not , planning to let my sub expire and see if I can get a better ip cause they do b cooking"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "nolister",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T04:48:56.000Z",
          "Titre": "Great proxies, not as good price",
          "Contenu": "Proxies are wonderful but can sometimes be a little on the pricey side. With a good discount code however, they are wonderful! Highly reccomend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Trenton Gowins",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T21:54:12.000Z",
          "Titre": "Before I started using live proxies I…",
          "Contenu": "Before I started using live proxies I couldn't even log on to all my Nike accounts. But after using live I was able to log in all 100 account with swiftness and in a timely manner. They have the perfect speed so your accounts don't get flagged for bot activity. The only problem I ever have is that the data burns very quickly. But other than that they are one of the best proxy companies out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Galaxia",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T20:55:15.000Z",
          "Titre": "Great overall clean IP and fast speeds",
          "Contenu": "Great overall clean IP and fast speeds, only issue is constantly having to regenerate new proxies for Nike sessions and the slow updating of the data used UI"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dingle Berry",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T20:39:28.000Z",
          "Titre": "While the cost of Live is more than…",
          "Contenu": "While the cost of Live is more than these other proxy service providers, none are as reliable. They don't burn through data as quickly as other providers and are definitely a lot quicker."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J.Sneaks",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T02:55:38.000Z",
          "Titre": "Product works great",
          "Contenu": "Product is great, works on almost all sites I run. Wish Prices were cheaper but its what I pay for. Thanks for the Proxies!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "rr",
          "Nb_Reviews": 2,
          "Date": "2022-11-30T02:48:21.000Z",
          "Titre": "gotta pay to play in this game",
          "Contenu": "If im being honest its a tad bit over priced but i still pay it so that should say a lot about the quality of the proxies."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Lucas",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T12:11:15.000Z",
          "Titre": "Good but pricey",
          "Contenu": "The product works well, and is better than a lot of competitors. The pricing is a bit high considering how the market currently is."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Xiangwei Chen",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T05:14:24.000Z",
          "Titre": "Does work well",
          "Contenu": "Does work well, but sometime it would burn a lot of data without any notice. adding a threshold would be nice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kang",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T03:09:30.000Z",
          "Titre": "Reliable and cook worthy",
          "Contenu": "Live is reliable and has helped me acquire items in the past. Love the use of proxies to secure purchases"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Risan",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T23:41:22.000Z",
          "Titre": "What I would do if I owned live. PS hire me.",
          "Contenu": "I do like the proxies and I especially like the limited IP's concepts that Live pioneered. For almost, every site live has been the go to. I think the fact of running a max of 350 tasks for 1:1 sites helps to limited data waste but in the end I end up with left over data and no time to use it during the limited windows. Not everyone is running a hundred instances for YS anymore and using a lot of data is a thing of the past. At this point all I use live for is for domain change shopify releases and times I need ips for proxy protected sites. Meaning I can not use all the data in the required time. I think that this makes people not want to buy the product in fear of losing value they are paying for and I think the Live team should instead of with-holding users unused data to be sold to the next customer plans should be changed to have increased ips and unlimited time frames. I understand this is a business that needs to make profit but with this solution people will inevitably use data at a faster rate with more ips and you will get people renewing and buying standby plans more often. Also just sell the product at bottom dollar and until your out of stock instead of having buying windows with discounts. If you sell the 350ip plan for 150 all the time instead of making less and giving out discount codes. You could make more if not the same and have happier customers with an incredibly high customer repurchase rate."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Miti",
          "Nb_Reviews": 3,
          "Date": "2022-11-30T03:55:00.000Z",
          "Titre": "The proxies work well on all sites",
          "Contenu": "The proxies work well on all sites. A bit pricey but very reasonable!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Khurram Javed",
          "Nb_Reviews": 2,
          "Date": "2023-01-09T04:41:54.000Z",
          "Titre": "Great proxies but price is a bit high…",
          "Contenu": "Great proxies but price is a bit high may need to adjust prices based on customers needs/drops"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mrcobb",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T03:04:11.000Z",
          "Titre": "Good Experience",
          "Contenu": "Great proxies and experience with the staff for assistance."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Clay",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T03:02:52.000Z",
          "Titre": "Best proxies around but to expensive…",
          "Contenu": "Best proxies around but to expensive with current markets."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brittany Vo",
          "Nb_Reviews": 2,
          "Date": "2022-11-30T04:44:46.000Z",
          "Titre": "They provide good proxies",
          "Contenu": "They provide good proxies. And good customer support"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shaders",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T01:12:00.000Z",
          "Titre": "Solid proxies",
          "Contenu": "Solid proxies, price is high but worth it, especially considering how slow data burns"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bart",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T23:35:31.000Z",
          "Titre": "Experience with Live",
          "Contenu": "Had a great experience with Live and their server. Easy to navigate as well"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Timothy Hyun",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T01:24:40.000Z",
          "Titre": "Wish for bigger plans",
          "Contenu": "Overall smooth, wish I could look into bigger bulk plans with more IPs/Data."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kyle Riquelme",
          "Nb_Reviews": 2,
          "Date": "2023-01-13T23:04:57.000Z",
          "Titre": "pretty solid proxy company",
          "Contenu": "pretty solid proxy company. havent had much issues at all and if I did they were addressed pretty quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Boreas",
          "Nb_Reviews": 4,
          "Date": "2023-11-02T20:44:18.000Z",
          "Titre": "Works well enough"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BK",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T18:11:53.000Z",
          "Titre": "Great company with clean resis!",
          "Contenu": "I use this proxy company for everything. Great performance on all sites with clean resis!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T19:30:17.000Z",
          "Titre": "Great quality proxies and ease of…",
          "Contenu": "Great quality proxies and ease of stanby usage"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "xiang ke",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T06:33:23.000Z",
          "Titre": "The quality of both proxy and server is…",
          "Contenu": "The quality of both proxy and server is good just wish that proxy can last longer since slow releases"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hestu Korok",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T21:47:32.000Z",
          "Titre": "Great Stuff",
          "Contenu": "Legit company, solid products (if a bit expensive). No major complains - would recommend."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Bob Smith",
          "Nb_Reviews": 2,
          "Date": "2023-07-28T07:08:37.000Z",
          "Titre": "Great ISP and residential proxies",
          "Contenu": "Great ISP and residential proxies, a little expensive but good quality"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Manny",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T23:47:29.000Z",
          "Titre": "Product Justifies the Price",
          "Contenu": "Prices are high but the quality mostly makes up for it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "R. D.",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T05:53:43.000Z",
          "Titre": "Great Proxies!",
          "Contenu": "Proxies work well and rarely have problems 👍🏽"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Farhar",
          "Nb_Reviews": 4,
          "Date": "2023-01-07T20:33:08.000Z",
          "Titre": "More proxies yeah"
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "RYO",
          "Nb_Reviews": 3,
          "Date": "2022-12-05T07:15:25.000Z",
          "Titre": "Amazon comfort!",
          "Contenu": "Amazon comfort!I was able to buy what I was aiming for!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cameron Ortiz",
          "Nb_Reviews": 2,
          "Date": "2022-12-05T03:55:27.000Z",
          "Titre": "I love Live!",
          "Contenu": "I love Live Proxies due to how reliable they usually are as far as not getting throttled, speed, etc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rho",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T21:50:53.000Z",
          "Titre": "Quick Review",
          "Contenu": "I applaud the owner and staff's transparency in how their proxies are priced and how they operate. However, I believe they can do better in listening. Listening not just to community feedback, but also the greater macroeconomic factors that play into supply and demand and adjust their pricing to be competitive relative to the times. That said, they provide phenomenal proxies that mostly excel."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "saha collins",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T08:45:01.000Z",
          "Titre": "Had tons of success using the product",
          "Contenu": "Had tons of success using the product, when things would go wrong support was always there to assist me in ticket and check my logs"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fake",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T01:20:49.000Z",
          "Titre": "Good Proxy",
          "Contenu": "definitely a more pricey solution, but they’ll work well on virtually every site, with very high quality IPs. best resi you can get on the public market."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pretzel",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T00:34:31.000Z",
          "Titre": "The proxies are solid, servers could be better…",
          "Contenu": "The proxies are solid and overall priced a bit high, but somewhat fair.The servers are a bit over priced for what you get. So many other alternatives are available for much lower cost.Product support is overall very good, responsive, and effective. Incredibly helpful when in a crunch or feeling lost.I'll continue to be a proxy buyer, hands down."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ericc",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T02:16:43.000Z",
          "Titre": "Proxy Rating",
          "Contenu": "Most reliable proxy during a domain change drop & they have proxy protection which throttles a lot of other IPS but Live is usually very good in that department. Prices could use some working because their proxy barely burns and there's barely any drops now that would burn all of that. But I know Live has a fixed cost so can't always expect them to bend. Overall had a great time and don't regret it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rayyan Khan",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T01:01:55.000Z",
          "Titre": "Perfect Proxies",
          "Contenu": "Live works perfectly on every single site it supports. I remember back in the day when retail botting was at its prime, most proxies would not work at all on Walmart. Live would be the only one getting me and countless other clips. Similarly, there was a time when performance on YeezySupply was lackluster, however, the Live team was determined to change that and before we knew it, their performance was up to par. The only thing preventing 5 stars is the pricing, I just wish there was a cheaper plan in the $40-$50 range as I would rarely use up all my data by the end of the renewal."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerkobe",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T22:35:05.000Z",
          "Titre": "Top proxies",
          "Contenu": "Able to get access and grab the product I need without problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff L",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T20:55:35.000Z",
          "Titre": "Great product and does exactly as…",
          "Contenu": "Great product and does exactly as advertised. I switched over to Live after trying many proxy companies and finally finding a company that knows what sites they support.  Owner and staff are very helpful, active, and understanding, they try their best to resolve any problems, even if it is out of their control.  Personally I loved the support and would easily give it a 5/5, the owner was transparent, responded quickly, and addressed my problem without any issues.  The only gripe I have would be the expiration dates, the only way to keep my remaining data to is to purchase even more data and so it becomes a monthly expensive to keep my data from expiring which becomes a problem when it starts to accumulate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Jerez",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T09:02:55.000Z",
          "Titre": "Great reliable proxies",
          "Contenu": "Great proxies and almost always reliable on dropdays. The only thing that I would say can be better for the customer, and the reason why I didn't give it 5 stars, is the expiry date of plans. There are times in which I don't use all the data but I'm forced to buy another plan so that I Don't lose the data that I didn't use."
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "…To",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T19:49:04.000Z",
          "Titre": "Good product, a bit too expensive",
          "Contenu": "Good product. A bit too expensive in the current sneaker market. Would love to see cheaper prices or more plan duration"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nava",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T19:00:04.000Z",
          "Titre": "Reliable Product",
          "Contenu": "Really great product, only wish the prices were lowered or more extended time. But overall proxy performance are great"
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Dyelo",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T11:28:23.000Z",
          "Titre": "Works well!",
          "Contenu": "Works well. I wish they would add some smaller packages."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "aao",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T07:51:40.000Z",
          "Titre": "good product",
          "Contenu": "good product, expensive but if there are good drops i always get this product. I wish we wouldn't lose IP right away if we burn all data. Sometimes big drops you burn more data than anticipated, causing you to lose IP and buy new plan. Overall good product, no issues with downtime, works on all sites flawlessly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "indicud",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T20:31:52.000Z",
          "Titre": "Overall good proxies."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "qi lin",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T17:02:13.000Z",
          "Titre": "work on nike and shopify drop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JB Grails",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T22:02:28.000Z",
          "Titre": "Always the best for PP sites which is…",
          "Contenu": "Always the best for PP sites which is why they’ve been dominating the residential proxy game for years now."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg Jones",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T04:27:43.000Z",
          "Titre": "I hit 2 BOGOS because you guys have…",
          "Contenu": "I hit 2 BOGOS because you guys have consistently brought the best product to us runners. Thank you!  Anyone who rates you all any lower has zero clue what they are doing nor have they used other proxies and REALLY taken a true L"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "XSOLE",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:36:30.000Z",
          "Titre": "Unleash the Power of Seamless Connectivity with Live Proxies!",
          "Contenu": "Live Proxies not only met but exceeded my expectations with impressively swift speeds that stand on par with Data Center proxies. Paired with unwavering reliability, top-tier security, and user-friendly features, Live Proxies is essential for those seeking a premium residential proxy service. The reasonable cost, coupled with its dependability during high proxy protection during drops, ensures an elevated and successful botting experience. Opt for Live Proxies to unlock a new level of connectivity, performance, and success."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Weston",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T18:54:01.000Z",
          "Titre": "Live proxies exceeds my expectations…",
          "Contenu": "Live proxies exceeds my expectations every time! Always trust them for what I need! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan  Estrada DirtyKicks",
          "Nb_Reviews": 2,
          "Date": "2023-11-12T19:59:24.000Z",
          "Titre": "These proxies are high quality",
          "Contenu": "These proxies are high quality . I haven’t purchased proxies from any other provider ever since I started buying from live . Live has never failed me when it comes to shoe drops . Another thing I appreciate is their constant proxies giveaways ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nikil Patel",
          "Nb_Reviews": 4,
          "Date": "2023-12-16T19:49:47.000Z",
          "Titre": "Great quality at reasonable price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Alvarado",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T06:52:37.000Z",
          "Titre": "Live Proxies is the Real Deal!",
          "Contenu": "I have used many different proxy companies and Live is by far the best. They are fast, reliable, and I have never had an issue with proxy protection.  I have and will continue to use Live proxies for the foreseeable future and I will recommend them to anyone that inquires.  You can't go wrong with this company and support is always available. Not to mention, there has never been down time for my proxies. Thanks Live!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam Hayt",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T08:19:31.000Z",
          "Titre": "The Live team has built a great product…",
          "Contenu": "The Live team has built a great product here. so many other providers just reselling proxies. I'm happy to use the Live service in that I know they have built out infrastructure on the backend to deliver a quality product. Live doesn't get enough credit for that. Just look at some of the other providers and the struggles they are having because they can't keep up with demand and rotate proxies on the fly. Anyway, keep up the great work and happy to be a customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JohnylitRblx",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T10:06:19.000Z",
          "Titre": "Proxies Review",
          "Contenu": "I use this thing for almost everything, works fine no problem and customer service is always good no matter. Buy now and they will get you right!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K Lee",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T06:31:32.000Z",
          "Titre": "It's similar to other proxies, but it shines at the decisive check-out moment"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "fijiwaterjunior",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T08:05:46.000Z",
          "Titre": "Best proxies known to man kind",
          "Contenu": "Best proxies known to man kind. I say this with experience. Don’t hesitate to try out. Staff members are also super professional and friendly , highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Skadi",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T22:58:47.000Z",
          "Titre": "Live Proxies helped me get the EDGE!",
          "Contenu": "Live Proxies helped me get the EDGE!I think live proxies have helped me tremendously over the years where it was a great one safe haven for proxy related issues.  The speed is great, the product is not flagged and it had a sense of assurance.  Highly recommended for anyone who has never tried to take a leap of faith."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shaan",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T22:20:07.000Z",
          "Titre": "High Quality",
          "Contenu": "I love how there is no downtime and these proxies are very reliable. Data burns really slow compared to other providers and has hit me more pairs than all of the other providers that I’ve tried."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ducee' DropTop",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T06:56:21.000Z",
          "Titre": "Love live proxies 🤞🏾"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S . C",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T17:54:37.000Z",
          "Titre": "Consistently great proxies",
          "Contenu": "I've been using Live for about 2 years now and I'm always extremely satisfied with performance of their proxies. They may be priced higher than competition but you're paying for QUALITY proxies that aren't usually blocked or banned by targeted site. I'll continue to use Live so long as they keep providing same great product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Drew",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T22:08:26.000Z",
          "Titre": "The products work amazing for…",
          "Contenu": "The products work amazing for everything, and if you have any issues at all the customer service is quick and very good with communication. Live is my go-to for proxies!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chun Yang",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T22:04:17.000Z",
          "Titre": "Best proxy company",
          "Contenu": "This is probably one of the best proxies out there. It works great on multiple different sites and haven't let me down yet. In case if you have issues or problems, their support staff is ready to help you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Cheng",
          "Nb_Reviews": 3,
          "Date": "2023-11-06T22:08:21.000Z",
          "Titre": "Always has been reliable the past 3…",
          "Contenu": "Always has been reliable the past 3 years of service! Would and have highly recommend to everyone who are looking for a proxy solution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SNKRS",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T20:38:34.000Z",
          "Titre": "Support + Product",
          "Contenu": "Support staff is great and always responds in a reasonable time frame. Product is also great and really never had any issues"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darek",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T15:11:50.000Z",
          "Titre": "Best in the Game! Period!!!",
          "Contenu": "I’ve been using Live Proxies for everything. They are my go to provider. It’s a no brainer. Why go anywhere else when Live is the top provider and on-top of their game?!? I will continue using Live for all my needs."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "anup chauhan",
          "Nb_Reviews": 4,
          "Date": "2023-11-08T01:51:59.000Z",
          "Titre": "most consistent product ever,",
          "Contenu": "most consistent product ever,Been in the game for the most and have success like no other,Satisfaction guaranteed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Johnny P",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T02:07:49.000Z",
          "Titre": "I love Live Proxies",
          "Contenu": "I love Live Proxies. They are unique.  Very fast ISP-like resis! Very nice roll-over feature for unused data too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DoubleЯ",
          "Nb_Reviews": 3,
          "Date": "2023-09-13T15:16:59.000Z",
          "Titre": "Love LIVE but with how slow everything…",
          "Contenu": "Love LIVE but with how slow everything is I’m finding myself having to buy standby plans over and over and not really using data please allow 1GB purchase for standby 🙏🏼"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "bg",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T22:51:29.000Z",
          "Titre": "Proxies work great when needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Basil Regy",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T16:38:20.000Z",
          "Titre": "I have been a customer since Live…",
          "Contenu": "I have been a customer since Live launched a few years ago and their product is beyond awesome. The quality of their proxies and thus the number of sites they work on really help out the vast majority of users. Also, the quick response from their support team really needs to be appreciated as well. I will definitely recommend them to anyone who is looking for high-quality proxies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al Bots",
          "Nb_Reviews": 60,
          "Date": "2023-04-26T21:07:20.000Z",
          "Titre": "Receipt #1901-9197 plug#4730",
          "Contenu": "Receipt #1901-9197 plug#4730 . One of the few legitimate everyday grinders left in this industry. Announcements almost if not daily as well as consistent network upgrades. Thank you Live Proxies! 100% satisfied every time I purchase from Live Proxies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "truexh",
          "Nb_Reviews": 3,
          "Date": "2023-07-27T16:13:53.000Z",
          "Titre": "Only RESI you will ever NEED",
          "Contenu": "LIVE is the only RESI proxies you will ever need. They're very accommodating when it comes to making sure you can be successful. I purchased one of the plan but come to realization that what I purchase wouldn't work out for my use case so they worked with me and provide me a solution that get me back up and running. Thank you LIVE!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "topcooker",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T16:38:03.000Z",
          "Titre": "Great Proxies",
          "Contenu": "Proxies were always great only had issues one time and it was something no one could expect. You def get what you pay for. It cooked for me made the money back times 10."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 3,
          "Date": "2023-03-01T20:31:26.000Z",
          "Titre": "Honestly the best proxies in the game",
          "Contenu": "Honestly the best proxies in the game. Works on pretty much any site imaginable and burns extremely slow. Highly recommend if you’re considering some proxies that work on Foots and Shopify Proxy Protection (my two faves)."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sainii",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T18:36:15.000Z",
          "Titre": "goat proxy company",
          "Contenu": "Very honest proxy company, from the beginning they have it kept it real and great proxy’s allow me to cop anything even better than most popular ISP! Live is different you gotta try them."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Ojisan",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T09:56:13.000Z",
          "Titre": "This is the one of the best proxies I…",
          "Contenu": "This is the one of the best proxies I have been used. It works great on multiple different sites and I got great success with live."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shuki",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T00:28:47.000Z",
          "Titre": "Reliable, Fast, and Amazing Proxies",
          "Contenu": "Simply put, these are my go to Proxies and nothing even comes close. I have used many proxy providers and none compare to Live in reliability, speed and overall service. I will continue to use Live for the foreseeable as long as they keep up the consistently fast & reliable Proxies they currently have."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "David Farfan",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T23:45:49.000Z",
          "Titre": "The Services provided are top tier",
          "Contenu": "The Services provided are top tier. Stable during peak and off peak situations. Whenever questions are needed, chat and support tickets are answered quickly with concise solutions. I am thankful for great service in a complex automation environment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sephen Curney",
          "Nb_Reviews": 2,
          "Date": "2023-03-26T09:01:37.000Z",
          "Titre": "More than a provider.. More than just a brand…",
          "Contenu": "Live proxies have been the longest withstanding proxy company I have trusted since I got serious with botting.  Many companies have come and go.. Many have had success but Live is more than just a proxy service but a great brand.. They go above and beyond to upkeep their standard of service and have been more reliable than even my ISP providers.. I can say that I am most loyal due to them always thinking of the customer first.. Even when bs happens , they make sure to make things right even if it means they lose out on profit.. Forver will be a customer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vincent Liang",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T08:18:05.000Z",
          "Titre": "very trustworthy and good support team…",
          "Contenu": "very trustworthy and good support team ever since friend rec these too me been using it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T03:41:22.000Z",
          "Titre": "By far the best residential proxy…",
          "Contenu": "By far the best residential proxy provider in the industry. Ive been trusting Live with all my proxy needs for 3 years and will continue.  Great support also. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "TheDoBox",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T01:07:52.000Z",
          "Titre": "The team at Live have done an amazing…",
          "Contenu": "The team at Live have done an amazing job with allocating a set list of proxies for Canadian users to use. This list has helped and produced many successful purchases and has helped me combat a lot of obstacles in the sneaker world."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roderick Penn",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T19:16:34.000Z",
          "Titre": "Live has been great and is all I need!",
          "Contenu": "Live has been great when used on Nike and Shopify sites with PP. They have become my go to and will probably not change. Havent had any issues!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "craig spialek",
          "Nb_Reviews": 3,
          "Date": "2023-02-07T19:07:41.000Z",
          "Titre": "By far the best proxy company I have…",
          "Contenu": "By far the best proxy company I have ever used in the years I have been in this field. Not only is the quality superb, but the customer service is also extremely transparent and always taking innovative measures to improve their products. Glad to be with Live from the beginning and will continue to support them until the end."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "NL",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T18:00:48.000Z",
          "Titre": "New user but great experience so far",
          "Contenu": "I've only been using Live Proxies for around a week but my experience has been great. All other proxies I've used were not working up to my expectation, and Live Proxies have been good so far. Data usage is also great - After a week or so, I've only used up 0.06 GB and it was used on automation + releases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "nike shoes",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T05:51:40.000Z",
          "Titre": "Live Proxies Are As Good As It Gets",
          "Contenu": "Live Proxies are as good as it gets and always professional when it comes to customer service and their products.I have been using Live Proxies for around 4 years and they have always been my go to.Live provides True Quality Proxies and not cheap crap that may or may not work and burn fast.I can't tell you how much Live has helped me over the years and how much trusting their proxies have provided for me and my family. Thanks Again Live"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bilal Khan",
          "Nb_Reviews": 2,
          "Date": "2023-05-15T19:43:50.000Z",
          "Titre": "Most Consistent Proxies Ever!!!",
          "Contenu": "I started using Live proxies early when I started botting and I never expected to have that many hits since I'm not a good botter, just ran for fun. I decided to try Live, only bought the cheapest 200 Ips plan and on my first footlocker release I hit so 20 pairs right off the bat and it was so surprised. Ever since I joined Live its been working out great for me, whether it is Shopify release where they turned proxy protection On or its hibbett where PX flags proxies, Live Proxies would go thru any type of proxy protection. I have made so much profit using these proxies and its just been consistent for me since the beginning. In addition, their help is always active on discord and help center so if you ever get stuck with a error or something then they would help me out always on time. I really appreciate Live for making it easier for me. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Affordabledad",
          "Nb_Reviews": 2,
          "Date": "2023-03-02T21:54:57.000Z",
          "Titre": "I know you never say never",
          "Contenu": "I know you never say never. I’ve never had any issues with Live Proxies. Not one, no offline proxies, no downtime any of that crap other providers give you and tell you. They are pricey I will admit that but you get what you pay for. I bot on and off and since I came back I found out about Live and I think I’ll stick around for awhile I don’t see myself taking off anytime soon, just because of how good Live proxies are. Thanks Live keep up all your hard work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashraf Joya",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T22:56:37.000Z",
          "Titre": "Awesome proxy company!",
          "Contenu": "Have been using live proxies for over a year now and have never had a bad experience. Even when some other proxy companies fail for me live proxy always pulls through and that's why I will continue to support this company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam Levine",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T12:03:26.000Z",
          "Titre": "Legitimate Residential Proxies for Price Monitoring",
          "Contenu": "These proxies have proven to be reliable, with 0 downtime and 0 blocked IPs. They are a perfect fit for price monitoring, ensuring that you are always up to date and able to make informed decisions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SR",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T01:34:16.000Z",
          "Titre": "Cook With Live",
          "Contenu": "Live features some of the highest quality proxies available on the market, at a reasonable price point. The team constantly listens to feedback from the community, and provides transparent updates on the status of the product and new features in the pipeline."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SUNIL NAYAK",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T20:15:15.000Z",
          "Titre": "Great product and great service",
          "Contenu": "Great product and great service all around. Ive been using their products for a couple years now and dont plan on switching to another brand. Thank you for all youve helped accomplish the past couple years - blackoutcity"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "UmmJosh",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T23:49:02.000Z",
          "Titre": "Great Company!",
          "Contenu": "Provides the most trustworthy proxies on the market! Kind of expensive, but they offer different plans at different price ranges. Its definitely a staple in your setup and well worth it."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "MW",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T21:46:18.000Z",
          "Titre": "Great proxy quality",
          "Contenu": "The quality of the proxies are great & not having to worry about that on drop time is crucial. Any issue you are having can easily be resolved in the discord."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emendez",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T23:35:14.000Z",
          "Titre": "Great!",
          "Contenu": "I have been using multiple providers for the last couple of years. The provider hands down is the most consistent. At times I give other providers a shot, but end up coming back to these due to the consistency."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-07-28T07:09:57.000Z",
          "Titre": "Don't expect it's lightening fast",
          "Contenu": "Don't expect it's lightening fast, but live proxies is stable and less ip banned . You can choose CA ips as well you are preferred . It's really good for Canadian users."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Ecroyd",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T22:02:07.000Z",
          "Titre": "Live customer for life",
          "Contenu": "Live has been the best for the longest time. With their change for pricing plans it has solidified them. Live is my Go To for success"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "slipp",
          "Nb_Reviews": 2,
          "Date": "2023-02-03T21:46:09.000Z",
          "Titre": "Best proxy company",
          "Contenu": "Although these proxies may be on the pricey side there the best out there. You’ll never find better quality proxies. Everytime I purchase these proxies I make my money back every single time. The customer service is also great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Chieu",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T23:33:19.000Z",
          "Titre": "I always appreciate Live proxies",
          "Contenu": "I always appreciate Live proxies, they have good products and I end up copping almost every drop because of that. I recommend them to everybody that asks what proxies they should get."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Whisper",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T17:17:19.000Z",
          "Titre": "Amazing Company",
          "Contenu": "The quality of everything that is provided is top notch and very good at a reasonable price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "noah",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T18:41:02.000Z",
          "Titre": "The no brainer choice",
          "Contenu": "You guys are THE proxy choice for me. Have always been there to help me be successful. From the old ys days to consistent supreme/shopify success. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Young_Bongos",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T00:10:15.000Z",
          "Titre": "Worth the price",
          "Contenu": "They are very good proxies never had an issue with them being down or using alot of data but thats why they have that price point."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Song Xie",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T17:12:51.000Z",
          "Titre": "Great quality for affordable price",
          "Contenu": "I’ve been using the for almost 2 years now and has never let me down. Great customer support and resolves any issues fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Donnie lama",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T04:36:34.000Z",
          "Titre": "Hands down the best proxies for shopify…",
          "Contenu": "Hands down the best proxies for shopify pp.  Nothing compares."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Li",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T01:19:26.000Z",
          "Titre": "One of the best proxy provider in the…",
          "Contenu": "One of the best proxy provider in the game right now. Giving the best experience and proxy to allow sneakers hotter like us to cop exclusive sneakers. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samer Zeeshan Mohsin",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T00:00:31.000Z",
          "Titre": "Top-Quality Proxies",
          "Contenu": "In my experience using and discovering proxies for reselling, live proxies are considered to be the best. For individuals who bot sneaker websites with strong proxy protection, live proxies are a great option. They offer quick, consistent and reliable connections, top-notch security tools, and the ability to function as an ISP. Even though it's important to choose a trustworthy service, live proxies can be an effective tool for many sneaker botters."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "wti",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T16:33:18.000Z",
          "Titre": "thank you",
          "Contenu": "copped lots of bogos"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robo Kop",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T02:20:57.000Z",
          "Titre": "Very reliable",
          "Contenu": "Live proxies have always been the most reliable proxies during any drops for me. A little pricey but worth every penny. Support is always top notch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Issac James",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T21:34:01.000Z",
          "Titre": "Amazing!!",
          "Contenu": "Onboarding is great! Easy to get a plan, works as expected, and the documentation is superb.Customer support didn't flinch to provide a clarifying question as well. all around great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edcruz",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T21:59:30.000Z",
          "Titre": "good prices always on point takes care…",
          "Contenu": "good prices always on point takes care of his Customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jose cruz",
          "Nb_Reviews": 2,
          "Date": "2023-03-24T00:34:33.000Z",
          "Titre": "Best proxies company hands down",
          "Contenu": "Best proxies company hands down. You can get cheaper proxies but the quality will not be the same. You can use them on mostly any site and hit with no problem. Live is the only proxie I would recommend live if you haven't try them yet."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "zanbato",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T17:04:32.000Z",
          "Titre": "Excellent Proxy Provider",
          "Contenu": "Very helpful discord for support. Proxies worked great for my use case. Will definitely use again."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "aa",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T16:11:38.000Z",
          "Titre": "one of the most reliable proxy…",
          "Contenu": "one of the most reliable proxy companies i have ever used. you'll get your monies worth and they have top notch customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Spencer Kiang",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T16:52:01.000Z",
          "Titre": "High Quality and Superior Service",
          "Contenu": "No other proxies come close to the speed and reliability of Live Proxies. The quality is chef's kiss and the customer service team is fast and on point!"
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "AN JEYEONG",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T04:50:30.000Z",
          "Titre": "goat of the proxy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lemuel Anthony Reyes",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T15:41:58.000Z",
          "Titre": "I’ve used LIVE proxies for 3 years now",
          "Contenu": "I’ve used LIVE proxies for 3 years now. Speed, accuracy and consistency is their key. You always get fast support if you have questions. Thanks for your help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred",
          "Nb_Reviews": 2,
          "Date": "2023-03-26T01:51:28.000Z",
          "Titre": "Consistent!!",
          "Contenu": "Consistent for all needs on various of websites. Always have great results. Such a great quality product for a reasonable price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "yueyue guo",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T20:46:41.000Z",
          "Titre": "Great pure proxies",
          "Contenu": "The proxies are pure and works great on all kinds of websites across the board. Also the data usage is very efficient compared to other proxy services. Great product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jean Flor",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T22:25:38.000Z",
          "Titre": "Amazing Resis",
          "Contenu": "Works everytime on everydrop drop. It can be initial or restocks on pp drops."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mr West",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T23:56:16.000Z",
          "Titre": "Great Product",
          "Contenu": "Been using them for years and am one of the older members. They are always fair with their pricing even though its on the higher side the quality is still there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tech",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T07:57:34.000Z",
          "Titre": "Live is A+",
          "Contenu": "The new cost/plan structure is great! Live has always delivered for me. Been solid over the last couple years since I started using the product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katapa",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T00:14:12.000Z",
          "Titre": "Best Proxies-khichke.com",
          "Contenu": "Best Proxies...  work on so many websites. I keep. buying them even though sometimes I dont finish the entire data plan. Thats how good these proxies are. khichke.com"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Derrick",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T22:26:06.000Z",
          "Titre": "Live is one the highest quality…",
          "Contenu": "Live is one the highest quality providers and offers great customer service. It's unbanned on essentially all sites and offers so many opportunities. I highly recommend using Live as your provider."
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "KNMRKSS K",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T18:13:00.000Z",
          "Titre": "It's always an accurate and honest…",
          "Contenu": "It's always an accurate and honest performance. There is always no lie. This is why users are guaranteed innovation and faith."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adeliz Vargas",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T17:57:55.000Z",
          "Titre": "Absolute best proxies in the game",
          "Contenu": "Absolute best proxies in the game. Highly recommend to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Austin .",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T00:56:27.000Z",
          "Titre": "Live Proxies is truly amazing!",
          "Contenu": "Live Proxies is truly amazing! The number of proxies you can buy in bulk paired with really fast proxies it's a recipe for success!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 3,
          "Date": "2023-02-05T04:31:25.000Z",
          "Titre": "Need lower price plans",
          "Contenu": "Would like lower plan price and gb for the non hardcore botters, but overall always proxies are always on point."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Spooky",
          "Nb_Reviews": 1,
          "Date": "2023-02-05T09:51:13.000Z",
          "Titre": "Best in Class",
          "Contenu": "Purchasing is straight forward. Product usage is straightforward. And ultimately, their performance is above all other competitors—consistent and high quality product. The output is always positive. Superb product! Best in class!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Simon Lai",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T23:59:41.000Z",
          "Titre": "Been a customer for about a year and…",
          "Contenu": "Been a customer for about a year and haven't had any issues that wasn't deal with by the team and corrected in a timely manner"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "UniWarBuckz",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T22:40:30.000Z",
          "Titre": "Product that works",
          "Contenu": "If you’re looking for a provider that’s worth the money go with live proxies you will not be disappointed!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hero",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T17:12:19.000Z",
          "Titre": "High Quality Proxies",
          "Contenu": "A bit expensive...but the data doesnt burn nearly as fast as other providers. The IPs are also very high quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adomas Fiseris",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T05:12:27.000Z",
          "Titre": "Reliable and transparent service",
          "Contenu": "I've had a fantastic experience with Live Proxies. Their transparency, stability, and reliability are standout features. If you need a dependable proxy service, I highly recommend Live Proxies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SKULLDOZER",
          "Nb_Reviews": 2,
          "Date": "2023-03-01T20:56:24.000Z",
          "Titre": "Live Proxies has allowed me to succeed…",
          "Contenu": "Live Proxies has allowed me to succeed within my business. They are the industry standard for what they do. Thank you, Live Proxies."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jason's randomness (awesomedragon123)",
          "Nb_Reviews": 2,
          "Date": "2023-03-26T00:26:20.000Z",
          "Titre": "Good high quality proxies",
          "Contenu": "Good high quality proxies, has helped me to purchase multiple pairs on both SNKRS CA and footsites"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "malik",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T19:05:59.000Z",
          "Titre": "Live proxies has always been solid",
          "Contenu": "Live proxies has always been solid. Years and years. The only ones that ALWAYS worked on Nike and Supreme. Plus Perish is a babe."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Latrelle Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T22:41:32.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. Even better proxies best bang for the buck."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "anup chauhan",
          "Nb_Reviews": 4,
          "Date": "2023-02-04T03:29:10.000Z",
          "Titre": "Best product in its class",
          "Contenu": "Best product in its class. They have been consistent ever since thier launch, Excellent team and support"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Cody Tomasek",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T23:30:57.000Z",
          "Titre": "Reliable service provider!",
          "Contenu": "Reliable service provider. Sells a high quality product and very quick to rectify any issues that arise (although issues are very infrequent!)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "travieso",
          "Nb_Reviews": 2,
          "Date": "2023-06-24T00:04:19.000Z",
          "Titre": "Company is always supportive with any…",
          "Contenu": "Company is always supportive with any issues I have. Been using them for about 3 years now"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Only one me",
          "Nb_Reviews": 3,
          "Date": "2023-11-15T12:21:34.000Z",
          "Titre": "A must have",
          "Contenu": "Live is always my go to. Burns so good and so reliable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T15:42:58.000Z",
          "Titre": "Best proxies I have ever used/bought by…",
          "Contenu": "Best proxies I have ever used/bought by far. No other company as consistent as Live.Josh#0028 Discord"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sammy H.",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T04:31:01.000Z",
          "Titre": "My favorite provider",
          "Contenu": "Great proxies ive never had an issue with them and they got me hundreds of checkouts"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlie Garcia",
          "Nb_Reviews": 2,
          "Date": "2023-06-27T07:16:07.000Z",
          "Titre": "Best Provider out there",
          "Contenu": "Live has been one of the best providers I have used. Good customer service, easy UI to understand, and THEY WORK!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MonsterWand",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T09:14:55.000Z",
          "Titre": "5/5 Highly Recommend the proxies and the team behind it",
          "Contenu": "Been using them for a couple months and never had any issues, best proxies and support team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luke",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T04:20:30.000Z",
          "Titre": "Great Provider, Great Service, BEST MANAGEMENT!",
          "Contenu": "Great owner, great company, great customer service. The only proxy company I trust. It's more than company, its family."
        }
      ]
    }
  ]
}