{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "loop-mobile.com",
      "Review": [
        {
          "Note": 1,
          "Pseudo": "Matthijs",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T14:13:42.000Z",
          "Titre": "Fraudulent way of operating and terrible customer service",
          "Contenu": "Fraudulent way of operating and terrible service.Ordered an Apple watch ultra with alpine loop size medium. Initially, the order came in with a random black watch strap. Mistakes like that can happen of course.Upon contacting them, indicating that they provided me with the wrong strap and have to provide the product as mentioned: Apple watch with Alpine loop size medium. They then told me they could send € euros as a replacement. No, of course not I indicated, what I bought was as mentioned so that is what they are obliged to provide. Without any further discussion they then said that they would send the right loop.Then, when I received what was supposed to be the Apple Alpine loop, in reality it was a very cheap Chinese replacement?! Ridiculous, but even worse, it is basically scamming people by providing a different product as mentioned in product description AND product photo.Two and a half weeks down the line and nothing has been resolved.These loops costs €100 new price. This will be followed up by legal action."
        },
        {
          "Note": 1,
          "Pseudo": "Marianna Zernova",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T11:50:55.000Z",
          "Titre": "Scam",
          "Contenu": "The worst service ever. I bought Apple Watch through Refurbed.de with Loop mobile and guess what? 2 weeks going back and forth trying to return it. They keep sending me the same messages, like \"what´s the serial number\" but from there it doesn´t move anywhere. I am about to contact my lawyer as I see that they just trying trick me into buying that watch, which I don´t want! Worst company ever stay away from them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barb",
          "Nb_Reviews": 4,
          "Date": "2023-11-18T00:53:54.000Z",
          "Titre": "Can not contact customer service",
          "Contenu": "I ordered an iphone case and needed to get customer service that I had ordered the wrong case. I have no idea how to return this item. This is the responds I got: Emily L (Loop)Nov 14, 2023, 18:04 GMT+1Thank you for reaching out. This order number is not associated with any Loop service  Best of luck locating the correct Customer Service team. Best,EmilyAnd here is the other message:Your message to  has been blocked. See technical details below for more information. And then there is no information BELOW."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jiacheng Dong",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T00:13:01.000Z",
          "Titre": "I didn't receive my package",
          "Contenu": "I didn't receive my package. You told me that you need 14 days to deal with it. That is unacceptable! And I didn't receive the tracking number, your promise is fake."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TODD",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T00:37:13.000Z",
          "Titre": "Stupid website…avoid it",
          "Contenu": "Requiring a signature on a $18 purchase is the dumbest thing I have ever had to endure. I would never use you again because of the inconvenience. Shame on you"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Arthur Siegel",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T18:21:40.000Z",
          "Titre": "Never received my computer",
          "Contenu": "I did not receive my computer. It's much more than the two days you promised for delivery I don't know what happened to it can you find out please and let me know thank you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Diane Mickelson",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T14:34:47.000Z",
          "Titre": "you sent me a non-apple charger that…",
          "Contenu": "you sent me a non-apple charger that would not charge the apple watch...after initial response to complaint have heard nothing than originally saying you can return the entire GIFT - mind you Christmas gift that did not arrive on time even though said two day shipping....oh can I have your gift back and maybe you'll get something back that will work sometime in the near future....really disappointing and will never use or recommend your business again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Trickey",
          "Nb_Reviews": 3,
          "Date": "2021-09-26T21:50:12.000Z",
          "Titre": "Disappointed",
          "Contenu": "Disappointed, I was directed to their site based upon a Google ad. Regarding iPhone eight Verizon ready phones. The listing on their page made no mention of the phone being only t-mobile Compatible. I put in A refund request and have yet to hear anything in five days. I expect better."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rich Shirilla",
          "Nb_Reviews": 1,
          "Date": "2021-06-22T00:29:19.000Z",
          "Titre": "Loop mobile makes it right",
          "Contenu": "I’ve been attempting to return an Apple Watch and I can’t get anyone to answer my emails….. I initially received an email asking for my order number. I responded with the number and haven’t heard anything for a week.Update 6/20/21Loop Mobile corrected the situation promptly…….. once we made contact they were professional and helpful with my return….. I would use this company again in the future."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hannah",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T23:18:23.000Z",
          "Titre": "Worst Customer Service Ever",
          "Contenu": "If I could give them 0 stars I would. Hands down the worst customer services I have ever experienced. I bought a watch from them and it broke within months and when I contacted them, they had decided to give me a full refund to my original payment method. Instead, a replacement watch shows up a few days later without even informing me. When I reminded them that they told me they would give me a refund, they completely went back on their word because THEY made a mistake. That should not be my problem but because of their poor customer service, it is now my problem. Don’t waste your money on their poorly refurbished products and buy somewhere else."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angel Velez",
          "Nb_Reviews": 1,
          "Date": "2022-05-17T16:37:26.000Z",
          "Titre": "Purchase of MacBook Air (2020) “Excellent” Condition",
          "Contenu": "Purchased a MacBook Air (2020) for Over 800$ for excellent condition. Turns out the screen has water damage, and the back of the MacBook has a big dent. Most definitely getting my money back, and never purchasing something from here again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Holly Moore",
          "Nb_Reviews": 1,
          "Date": "2021-03-29T01:56:38.000Z",
          "Titre": "I hate that i hit purchase and sent and…",
          "Contenu": "I hate that i hit purchase and sent and the second after i purchased i realized it wasnt then phone i wanted and could bit cancel the purchase. I.have had to receive the phone and return and still waiting See if tal y'all are going to credit my acct back.  You should allow a person time to cancel before shipping it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matthew Miller",
          "Nb_Reviews": 1,
          "Date": "2021-04-23T12:50:23.000Z",
          "Titre": "Not recommended, poor customer service",
          "Contenu": "I was sent a locked instead of an unlocked IPhone. Reaching customer service to return and replace the phone has been next to impossible. No customer service number and sloop does not return emails within 48 hours. So frustrating. My recommendation: Do not buy from them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LZ",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T18:40:24.000Z",
          "Titre": "Selling Refurbished Phones as NEW",
          "Contenu": "Loop Mobile was selling a NEW iPhone Straight Talk 12 mini on Walmart website. Only problem was the phone was refurbished and NOT NEW. They never mentioned anywhere that they were selling refurbished items on Walmart's site. I bought a New phone and received a used phone. This must be an ongoing scam bc they offered a discount to keep the used phone. I purchased a new phone elsewhere for less than they charged for a used phone. They have tied up my money, delayed my getting a better deal and caused me inconvenience of having to return item to Walmart. Loop has been notified by Walmart on numerous occasions and is fully aware of the situation. Even after learning that the site says \"new condition\" they have yet to correct the page and continue selling refurbished phones. I made my purchase on 11/16/22 on Walmart.com, the phone was returned to Walmart the day after being received and out for return delivery via Fed Ex. I'm still waiting for my credit."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vanessa K",
          "Nb_Reviews": 3,
          "Date": "2021-06-09T19:25:56.000Z",
          "Titre": "Nada",
          "Contenu": "I am looking forward to updating this review. For now, I have only a meaningless tracking number, not the phone I ordered. According to the email I received the day after my purchase, my phone should have been delivered six days ago, but the tracking number still says \"shipment information sent to FedEx.\" I submitted a support request yesterday. I've gotten lots of communication from them: the tracking number a few times, several coupon codes, and now an email from TrustPilot asking about my experience. But I haven't gotten the item I ordered or a reply to my inquiry about it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 2,
          "Date": "2022-12-01T19:45:15.000Z",
          "Titre": "Horrible customer service",
          "Contenu": "I have been trying to contact Loop Mobile continuously since I made the purchase of the phone, an iPhone SE. I have received NO response. I tried immediately to cancel the order, but that attempt was made too late so the phone arrived. Fine. Even so, I tried MANY TIMES to contact Loop Mobile to get you to send me a FedEx mailing label so. that I can send the phone back to you. I have received NO response from you. It is as if you do not have anyone in customer service. I do not want the phone that you sent to me. It is still in its original packaging. I am shocked at the horrible customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason Suenaka",
          "Nb_Reviews": 1,
          "Date": "2021-04-09T12:35:52.000Z",
          "Titre": "I never got my phone I ordered",
          "Contenu": "I never got my phone I ordered. I wrote an email to the seller but they haven't responded in two days. Guess I'll have to try file a claim with fedex. Basically zero customer support from loop mobile though. This is my second order from them, the first one arrived fine, but no sign at all on my second order. Apparently they don't use boxes to ship their phones, just bubble wrap. You might be best trying somewhere else for iphones not loop mobile."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "K S",
          "Nb_Reviews": 1,
          "Date": "2022-10-07T21:52:35.000Z",
          "Titre": "A weird hand printed note in the iPhone box",
          "Contenu": "I ordered a refurbished iPhone from Amazon. It was delivered via FedEx from Loop today. Delivery was fast, but when I opened the package . . .A hand-printed note saying “I KNOW WHAT YOU DID LAST SUMMER” was on top of the phone inside the box. THIS IS NOT FUNNY. It also leads me to wonder if the phone itself was tampered with.Beware of this seller."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Danielle Philip",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T17:49:19.000Z",
          "Titre": "Late order",
          "Contenu": "I ordered my phone on a Friday at August 12th and it said that it would get to me in about 1-2 business days because I chose the FedEx 2 day shipping. I understand that this wouldn’t ship immediately. I thought was going to ship on Monday but wasn’t till Wednesday when it was shipped. Also, I was told I was gonna get updates about my shipment but I didn’t get ANYTHING. The only thing I saw was that my order was placed nothing else. On Wednesday, If I didn’t complain about my phone not coming or saying I would never use Loop mobile again. I don’t know if would have got my phone or not or it would came much later. Furthermore, my order came a week later after my order and that was unacceptable especially when I didn’t get any update about my order AT ALL. So again as I mention in my complaint this will be the last time I order anything on Loop Mobile."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "My SIDE",
          "Nb_Reviews": 1,
          "Date": "2021-03-26T15:38:24.000Z",
          "Titre": "Below 0 STAR",
          "Contenu": "IN SHORT, MY PHONE DIDN'T COME IN 2 DAYS! I WAS OFFERED $20 REFUND TO CHANGE MY 1 STAR RATING TO A 5 STAR, AND THEY PUT REQUIRE SIGNATURE, SO I STILL DON'T HAVE PHONE. DON'T HAVE TIME TO GO INDETAIL NOW, ABOUT HOW BAD IT WAS DEALING WITH AUTOBOTS THAT GIVE GENERIC MESSAGES, ABOUT THEIR HOURS, YET IT WAS DURING THE TIME THEY WERE OPEN! PERIOD! DO NOT LET THE SALE PRICES ON ITEMS FOOL YOU, INTO DEALING WITH THIS COMPANY! UPDATE!!!! PHONE WAS DELIVERED TODAY, (WITH OUT A SIGNATURE!!!!!!!) BUT I THOUGHT THAT'S WHY, IT WASN'T LEFT YESTERDAY! WHAT A JOKE!! LOOP KEEP FLAGGING MY REVIEW SO I WILL SCREEN SHOT, ALL PUT THIS ON OTHER SITES!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "yuphadee",
          "Nb_Reviews": 3,
          "Date": "2021-10-04T19:17:27.000Z",
          "Titre": "I bought the phone on Sep 15",
          "Contenu": "I bought the phone on Sep 15, 2021.  I have emailed Loop Mobile more than 10 times for the return and received only the auto response email.  Loop Mobile didn't have customer services contact me back at all.  They didn't response since then."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tomy  B",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T14:10:34.000Z",
          "Titre": "Website wouldn't even let me purchase…",
          "Contenu": "Website wouldn't even let me purchase the product I wanted. My purchase constantly kept getting denied for no reason. Then \"customer support\" sent me an email asking unnecessary questions."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amy Riffe",
          "Nb_Reviews": 1,
          "Date": "2022-03-27T17:47:24.000Z",
          "Titre": "I ordered a refurbished phone off of…",
          "Contenu": "I ordered a refurbished phone off of here and once it arrived it didn't work. It won't turn on. I requested a refund and said I could send it back and still haven't gotten a response. I had to reorder another phone off of Amazon. I'm now out $160. Loop Mobile can kiss my ass"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Wilson",
          "Nb_Reviews": 1,
          "Date": "2021-04-22T21:26:48.000Z",
          "Titre": "They sold me a LOCKED phone",
          "Contenu": "They sold me a LOCKED phone!  And they are not cooperating in getting that resolved.  Note: they have no 800 or other number to call and just keep responding with cryptic emails."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Francisco",
          "Nb_Reviews": 2,
          "Date": "2021-04-02T18:54:53.000Z",
          "Titre": "order did not arrive and has no means…",
          "Contenu": "order did not arrive and has no means of tracking, I am very sad because the website says it would arrive in 2 days and the deadline has not been met. No one responds to emails."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kent Lyman",
          "Nb_Reviews": 1,
          "Date": "2022-10-24T12:19:04.000Z",
          "Titre": "My order arrived with a dead battery…",
          "Contenu": "My order arrived with a dead battery which will not charge.  Your customer service is almost impossible to reach.Extremely disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mouli Ramani",
          "Nb_Reviews": 2,
          "Date": "2023-04-15T15:09:31.000Z",
          "Titre": "The \"2 day turnaround\" was a mess",
          "Contenu": "The \"2 day turnaround\" was a mess.  It took you guys 2 days to process the order and then another 2+ days for us to receive it (hopefully)"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Virat Patel",
          "Nb_Reviews": 1,
          "Date": "2021-04-07T21:38:28.000Z",
          "Titre": "Still haven't received a response after…",
          "Contenu": "Still haven't received a response after sending multiple email. I received a phone damaged in the box and they are not doing anything about it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dario Salas Quiroz",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T20:01:33.000Z",
          "Titre": "The product was ok but I want to return",
          "Contenu": "The product was ok but I didn’t like it. I have been trying to return since I’m in my 6th day with it I should be able to return.I try contacting them trough email but I still haven’t got a response"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Essam",
          "Nb_Reviews": 1,
          "Date": "2022-06-21T16:39:13.000Z",
          "Titre": "Do not recommend",
          "Contenu": "I would not recommend purchasing from this site. The device purchased was in bad condition and their customer service is not reachable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joshua Rogers",
          "Nb_Reviews": 1,
          "Date": "2022-02-12T19:28:38.000Z",
          "Titre": "I have still yet to receive my package…",
          "Contenu": "I have still yet to relieve my package and it’s going on 2 weeks I will never order from  y’all again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jagarius Bell",
          "Nb_Reviews": 1,
          "Date": "2021-04-22T11:02:31.000Z",
          "Titre": "Poor sent me a phone and is still…",
          "Contenu": "Poor sent me a phone and is still locked I called the company that the seller of the phone they tell me they can’t unlock it till the original owner call them and unlock it when I don’t know the original owner I brought it threw loop iPhone 8"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ty lo",
          "Nb_Reviews": 1,
          "Date": "2021-07-02T18:14:34.000Z",
          "Titre": "I will never buy from loop mobile ever…",
          "Contenu": "I will never buy from loop mobile ever again. I bought a pristine phone and they sent me a scratched up phone! Not once but Two times! I tried calling and emailing them and have no response back"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer Franklin",
          "Nb_Reviews": 1,
          "Date": "2021-05-05T14:28:42.000Z",
          "Titre": "No customer service or support",
          "Contenu": "No customer service or support I’ve been trying to make a return for over a week and all I get is generic automated email responses saying customer service will respond in 48 hours but it’s been a week and no one has gotten back to me yet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joshua Burkhardt",
          "Nb_Reviews": 1,
          "Date": "2021-03-02T00:34:07.000Z",
          "Titre": "I selected the pristine phone And…",
          "Contenu": "I selected the pristine phone And wanted to pay more but you all are sending the fair one😡"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lucy Pinto",
          "Nb_Reviews": 2,
          "Date": "2021-03-29T21:53:43.000Z",
          "Titre": "Try to get information to send back…",
          "Contenu": "Try to get information to send back phone for days!!! There’s no way to call this company!!!"
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Francisco",
          "Nb_Reviews": 2,
          "Date": "2021-04-12T22:48:51.000Z",
          "Titre": "in addition to the delay in delivery",
          "Contenu": "in addition to the delay in delivery, i bought an iphone 8 premium and the battery health came below the guaranteed minimum of 95%"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ReML",
          "Nb_Reviews": 1,
          "Date": "2021-04-17T05:09:51.000Z",
          "Titre": "The order was not processed",
          "Contenu": "The order was not processed. No response to my requests/follow up."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roman Kiflom",
          "Nb_Reviews": 1,
          "Date": "2022-10-10T17:13:54.000Z",
          "Titre": "The shipping was fast but the phone…",
          "Contenu": "The shipping was fast but the phone speaker it didn’t work and no response"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Troy Cordes",
          "Nb_Reviews": 1,
          "Date": "2021-06-04T16:37:37.000Z",
          "Titre": "The phone I got was not unlocked as advertised",
          "Contenu": "The phone I got was not unlocked and they never sent me a package to return it like they said they would. I want my money back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Suresh Vadlapatla",
          "Nb_Reviews": 2,
          "Date": "2022-04-23T13:50:18.832Z",
          "Titre": "I got a phone that has hardware problem…",
          "Contenu": "I got a phone that has hardware problem it is frustrating"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tara b",
          "Nb_Reviews": 2,
          "Date": "2021-02-21T20:49:51.000Z",
          "Titre": "I paid for this iPhone and they sent a…",
          "Contenu": "I paid for this iPhone and they sent a email Saying they canceled my payment because the name and address didn’t match with my boyfriends card then I got another email saying thanks for your payment but we did not receive the phone then there is no number to reach them on so they tell us to email they still don’t respond on that smh it’s a rip off"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous.",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T19:00:48.000Z",
          "Titre": "I received 3/4 of the correct iPhones",
          "Contenu": "I received 3/4 of the correct iPhones. 1 completely different color was sent. 1 phone had a third party non functioning camera installed. One phone is covered in sticky stuff and scratched up. I have been reaching out for 4 days now, to return them. No response. No updates."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ana Daresa Moore",
          "Nb_Reviews": 3,
          "Date": "2023-09-02T15:54:20.000Z",
          "Titre": "They send the wrong apple series it’s…",
          "Contenu": "They send the wrong apple series it’s not what I ordered."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sudhashree Bogavalli",
          "Nb_Reviews": 1,
          "Date": "2021-08-17T19:21:23.000Z",
          "Titre": "Heating up a lot want to return"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T14:48:45.000Z",
          "Titre": "Poor Customer Service",
          "Contenu": "I ordered two pristine iPhone 8s via their eBay store, but one of the phones I received came with scratches in multiple places on the screen. I'm looking to get an exchange for the damaged phone, but customer service is not responsive.Edit: While I did end up receiving my refund, this took over 1 month to resolve — very unprofessional."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "W. C. Johnson",
          "Nb_Reviews": 2,
          "Date": "2022-09-05T17:13:32.000Z",
          "Titre": "I have returned the product and can’t…",
          "Contenu": "I have returned the product and can’t get my money back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Suresh Vadlapatla",
          "Nb_Reviews": 1,
          "Date": "2021-02-25T15:54:09.000Z",
          "Titre": "I didn’t even got the phone",
          "Contenu": "I didn’t even got the phone. Its been too long still waiting for it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "T Sheridan",
          "Nb_Reviews": 2,
          "Date": "2020-12-30T19:56:43.000Z",
          "Titre": "Not as described",
          "Contenu": "I ordered a “VERY GOOD” phone only to get one that had a long, deep scratch in the glass on the back. I have been emailing to arrange a return, but no one has responded. I am hoping this might be resolved after the holiday, so I can amend this review."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Avi",
          "Nb_Reviews": 1,
          "Date": "2020-12-04T12:44:58.000Z",
          "Titre": "Damaged pristine and non responsive customer care",
          "Contenu": "Ordered pristine grade iphone8 64 GB but got one with pixel burn in front screen. I have been trying to get in touch with customer service for week now but have not received any response yet. If anyone from Loop mobile sees this please do respond."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T21:07:17.000Z",
          "Titre": "Never received product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "HeziiDropEmOff",
          "Nb_Reviews": 1,
          "Date": "2020-12-28T13:03:59.000Z",
          "Titre": "Never buying from here again",
          "Contenu": "Never buying from here again. 2 day shipping turned out to be a week now and I still haven't gotten my phone. Dont get fooled by this 48 hr shipping bs"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fred",
          "Nb_Reviews": 1,
          "Date": "2020-12-04T20:59:37.000Z",
          "Titre": "Condition not as described",
          "Contenu": "Condition that I paid for was stated as very good but phone is far from very good shape. I would rate the condition as mild."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Earth",
          "Nb_Reviews": 2,
          "Date": "2022-03-24T16:25:40.000Z",
          "Titre": "Phone was unresponsive when arrived."
        },
        {
          "Note": 1,
          "Lieu": "CL",
          "Pseudo": "Nicolas Lorenzini Raty",
          "Nb_Reviews": 1,
          "Date": "2020-12-22T18:19:13.000Z",
          "Titre": "I bought a premium Iphone 8 (Supposed…",
          "Contenu": "I bought a premium Iphone 8 (Supposed to have at least 95% battery) but I received it with 87%"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "matthew vargas",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T14:41:03.000Z",
          "Titre": "Rude",
          "Contenu": "Rude. Not helpful. Rude. Rude."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JW",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T00:02:16.000Z",
          "Titre": "\"Pristine\" phone with minimum battery life",
          "Contenu": "I paid extra for a phone in \"Pristine\" condition. This did not apparently translate to the components of the phone as it came with only 85% battery life, the bare minimum they deliver without replacing the battery. This is a problem as the 2400 battery is already small for today's power demands. Neither of the phone numbers for customer service work and do not allow you to hold or wait. They just drop the call. To be fair, I did send an email ~24 hours ago and am waiting for a response from Loop. I will update my rating if my experience improves."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mouli Ramani",
          "Nb_Reviews": 2,
          "Date": "2023-08-18T22:33:49.000Z",
          "Titre": "1)  Opened a ticket for a missing 20$…",
          "Contenu": "1)  Opened a ticket for a missing 20$ credit. No réponse. 2.) phone arrived one day late. 2nd consecutive order that arrived late. 3.) Frustrated with Loop Mobile"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Maria Soriano",
          "Nb_Reviews": 1,
          "Date": "2022-07-08T16:42:18.000Z",
          "Titre": "They said that the battery was at 85%…",
          "Contenu": "They said that the battery was at 85% of its capacity, I know it is normal for it to last less than new watches but the battery lasts less than 5 hours.  it's totally lousy"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DoronNissan",
          "Nb_Reviews": 2,
          "Date": "2022-11-04T23:42:53.000Z",
          "Titre": "Loop failed to honor it's shipping…",
          "Contenu": "Loop failed to honor it's shipping timing promise.  When I contacted customer service they did nothing about it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Felicia",
          "Nb_Reviews": 1,
          "Date": "2022-07-13T19:35:46.000Z",
          "Titre": "Wrong computer delivered, customer service unreachable",
          "Contenu": "UPDATE: I was finally able to reach someone via this email address - info [at] loopmobile.us - and get a return sorted out. About a week after shipping the return, I got confirmation of my refund. I guess I'd just say shop at your own risk here, and know that the customer service phone line is kind of a dead end. Will recommend Computer Overhauls again as a good and reputable small business with quick shipping and good service.--Ordered a MacBook Air from Loop Mobile. After reading a handful of negative reviews about customer service, I figured the majority were positive and the price was right. It arrived in about 3 days, and when I opened it, not only was it packaged very loosely, it was not the computer I ordered. I immediately called the customer service line but countless attempts at different times of day have been answered by an automated \"There are no agents available to take your call\" message, and my email has gone unanswered for several days now. Luckily I did a payment plan, so only a portion of the cost is lost so far, but 3 additional payments are due to be drafted from my account for a computer I didn't order and don't want. I'm trying to return the one that was mistakenly delivered and just cancel my order for a refund, if someone will respond to me. For other customers, I'd recommend Backmarket (though they sell through there too, that's where I initially found them but prices were cheaper to order directly through the site) or Computer Overhauls instead."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeraul Patrick",
          "Nb_Reviews": 2,
          "Date": "2023-06-19T14:54:51.000Z",
          "Titre": "I am yet to receive the phones or any…",
          "Contenu": "I am yet to receive the phones or any updates"
        },
        {
          "Note": 3,
          "Pseudo": "AT",
          "Nb_Reviews": 3,
          "Date": "2022-10-11T15:46:21.000Z",
          "Titre": "CONCERNED: No confirmation No tracking BUT CHARGED",
          "Contenu": "I am very very concerned now after reading these conflicting reviews .I ordered a iPhone but confirmation email for my order no tracking details for my order ! What is frustrating is that there are several complaints about shipping etc why wouldn’t this company fix that issue !Also now I’m concerned about the quality of my phone I may or may not receive! The number attached to the charge on bank details is invalid ! It looks like this organization has plenty of business why isn’t these simple things managed  better ?The customer service number that starts with a 786 is also a joke and that doesn’t feel good either , at least offer the option to text or leave a voice message! Can someone reach out to me please ASAP!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "J.",
          "Nb_Reviews": 3,
          "Date": "2021-04-26T15:35:47.000Z",
          "Titre": "Not the best but not the worst",
          "Contenu": "Pros: screen and back looks great, one week in no issues with the phone, new charging cable, competitive pricing, great website/interface, great correspondence with shipping updates.Cons: The phone was very dirty, wall adaptor was disgustingly dirty with visible hair, dirt, and burn marks.Conclusion: For paying the premium for “Pristine” I expected the phone to not have face grease on the screen, dirt and sludge blocking all the speaker ports, dirt in the ear speaker, and the wall adaptor to have burn marks on it. Overall I would probably buy from loop again-maybe."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert H.",
          "Nb_Reviews": 2,
          "Date": "2021-05-27T15:45:55.000Z",
          "Titre": "The first phone sent had screen damage",
          "Contenu": "The first phone sent had screen damage. This was not the end of the world but it was frustrating trying to contact customer support. Only a foreign phone number on the website and no email response for several days. I also stated that I wanted a replacement phone but still had to wait for a refund and reorder myself. Eventually another phone was sent but there definitely have room for improvement. The phone was a mother's day present but ended up being 10 days late. Later the company did follow up and offer me a $20 refund for my inconvenience which was nice."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rumon P.",
          "Nb_Reviews": 2,
          "Date": "2023-02-27T14:00:08.000Z",
          "Titre": "The Apple Watch I received is rough by…",
          "Contenu": "The Apple Watch I received is rough by the edges, not thoroughly clean , someWhite stuff on the edges of the glass battery is  running out  rather quickly with light use."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wallace Julio",
          "Nb_Reviews": 1,
          "Date": "2021-11-01T02:24:12.000Z",
          "Titre": "broked",
          "Contenu": "macbook battery came hooked, it doesn't stop plugged in, it only works with the power cord plugged in."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 2,
          "Date": "2021-04-17T00:45:12.000Z",
          "Titre": "Poor battery",
          "Contenu": "The cosmetic condition is great. The downside is the battery life won’t hold a charge for a day."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Justine Green",
          "Nb_Reviews": 1,
          "Date": "2021-03-22T05:52:33.000Z",
          "Titre": "Says it has a 12 month warranty but the…",
          "Contenu": "Says it has a 12 month warranty but the phone is off. Other than that it works the best! Haven't had any problems."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ziad Abualya",
          "Nb_Reviews": 1,
          "Date": "2022-07-18T20:21:33.000Z",
          "Titre": "I paid $400 for a used little phone…",
          "Contenu": "I paid $400 for a used little phone with a lot of scratches on the screen…..not worth the money…."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nicole Pamp",
          "Nb_Reviews": 1,
          "Date": "2021-03-24T03:37:44.000Z",
          "Titre": "It's was okay",
          "Contenu": "It's was okay, it came on time but, when it came it had marks on the screen."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gabriela Martinez",
          "Nb_Reviews": 1,
          "Date": "2021-02-06T05:22:09.000Z",
          "Titre": "Super small besides that’s fine"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry Maddox",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T20:33:40.000Z",
          "Titre": "Service was prompt and efficient. The product is well made and attractive. Only negative is that the case doesn’t cover the camera lenses.",
          "Contenu": "Service was prompt and fficient"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brenda",
          "Nb_Reviews": 2,
          "Date": "2022-06-17T15:16:20.000Z",
          "Titre": "Good product except for battery",
          "Contenu": "Loop Mobile delivered a very good looking product, good working condition. I cannot see any visible signs of the watch being refurbished. My only complaint about the Apple Watch I purchased is that the battery doesn't fully charge but that is what the conditions are of the purchase.  For an Apple Watch, a battery with 100% capability is a better fit for me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KRISTINE H.",
          "Nb_Reviews": 2,
          "Date": "2021-04-20T20:28:07.000Z",
          "Titre": "They delivered what was promised",
          "Contenu": "They delivered what was promised. My only issue was the shipment required a signature, which I didn't know ahead of time. I had to create an alternate delivery address via FEDEX and pick the item up because I was not going to be home. Just an extra step but not ground shaking."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2021-03-24T20:49:41.000Z",
          "Titre": "Phone arrived and works great",
          "Contenu": "Phone arrived and works great. It arrived just as described. A few scruffs, but nothing major or highly noticeable for the price.The only reason I'm not giving this 5 stars is because of the shipping. It was advertised as 2 Day shipping, but I ordered on a Wednesday and received the following Monday."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom Childers",
          "Nb_Reviews": 11,
          "Date": "2022-03-23T19:41:17.000Z",
          "Titre": "Good product, but warranty service was slow",
          "Contenu": "Short version: I ordered a 2018 MacBook Pro from them in mid-December 2021. The video board failed six weeks later, and it took a lot of extra effort and time to get the warranty filled. But after five weeks, I had a nice replacement machine, which happened to be 1 year newer than the one I originally purchased. Longer story: To start with, the original order took 10 days to arrive via FedEx Ground (Ok, it was Christmas time). The computer was poorly packed, actually rattling around loose in the box.The computer's video board failed six weeks later, and getting warranty service under their 12-month warranty, was a challenge. There was no order confirmation email, and no clear way to get warranty coverage on the website. I found the customer support link on the bottom of the home page, replied to their request for photos immediately...and it took 7 days to get a shipping label. Shipping each way took a week, processing the return took a week, so the warranty process took 4 weeks. That was a long time to be without a computer!Ultimately, I got a good machine at a good price. But don't expect things to arrive as promptly as their website suggests, or warranty coverage to be super easy like the big competitors."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jenkins michelle",
          "Nb_Reviews": 1,
          "Date": "2021-11-01T01:11:44.000Z",
          "Titre": "Ok thanks",
          "Contenu": "Thank you so much I was just checking on my package to see where it was located if you don’t mind to y’all keep me posted and when will I receive it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lance Kruse",
          "Nb_Reviews": 2,
          "Date": "2021-10-12T19:00:14.000Z",
          "Titre": "It worked out great...just wished they'd checked their email",
          "Contenu": "The actual purchase/shipping service was great.  I only knocked off a star because I tried to contact them during the time between ordering and shipping and it was crickets.  I was in a little bit of a pinch for time (about to leave on a two week trip) and I needed to verify when it would be shipping so that I would know where to ship it.  I had it shipped it to my home, hoping they'd come through quickly, and they did!  So it all worked out.  The phone came the night before we left.  But based on a few of their bad reviews, I thought they'd pay more attention to the emails.  They didn't, but like I said, the order was processed and the shipped as fast as possible so it worked out great.  Just a couple days of nail-biting."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Cote",
          "Nb_Reviews": 1,
          "Date": "2021-03-09T11:23:53.000Z",
          "Titre": "Excellent condition of phone",
          "Contenu": "Ordered Premium iphone 8, had some minor problems but Loop Mobile reached out and made it right. Using the phones and no issues or problems with them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marilyn Vogel",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T23:58:01.000Z",
          "Titre": "I was promised 2 day delivery and it…",
          "Contenu": "I was promised 2 day delivery and it took 4 days."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tran Thanh-Nhan",
          "Nb_Reviews": 2,
          "Date": "2022-08-29T21:22:10.000Z",
          "Titre": "Quick shipping and good phone",
          "Contenu": "Quick shipping and the Iphone 12 pro max I received is working very well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sri",
          "Nb_Reviews": 2,
          "Date": "2021-12-21T23:38:47.000Z",
          "Titre": "Bought a refurbished item from Loop",
          "Contenu": "Bought a refurbished item from Loop. It was good. Repackaging is good"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "javier verduzco",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T06:07:49.000Z",
          "Titre": "it's a good place to get iPhones",
          "Contenu": "it's a good place to get iPhones. but I would like to have more discount codes or offers"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roberto Vega",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T14:01:31.000Z",
          "Titre": "Good buy at a great price",
          "Contenu": "Good buy at a great price. Product was as advertised. Shipping was quick and easy."
        },
        {
          "Note": 4,
          "Lieu": "UY",
          "Pseudo": "Guillermo Alberto Parodi Viera",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T18:59:24.000Z",
          "Titre": "Delivered take to more than 2 days",
          "Contenu": "Delivered take to more than 2 days , mobile is great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jackson Creel",
          "Nb_Reviews": 1,
          "Date": "2021-02-02T03:23:19.000Z",
          "Titre": "The phone is what I wanted and in…",
          "Contenu": "The phone is what I wanted and in pristine condition as described. Only complaints I have is 1.) It was very loosely packed and was being thrown around in the box as it was shipped. 2.) The SIM card key was not in the box. I had to use a paper clip that was laying around the house. But other than those complaints, everything else was great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fuad Amin",
          "Nb_Reviews": 3,
          "Date": "2020-12-11T12:42:42.000Z",
          "Titre": "Finally Fixed it",
          "Contenu": "Edited:They finally contacted and got my phone. Received the phone as described. looks clean. I am satisfied. 1start reduction for slow response from customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Justin Phillips",
          "Nb_Reviews": 1,
          "Date": "2021-04-10T00:53:20.000Z",
          "Titre": "Thanks",
          "Contenu": "Thanks we really do enjoy it! Will use again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Helton De Oliveira",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T19:33:40.000Z",
          "Titre": "Very good product",
          "Contenu": "Very good product, no complaints"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maxwell Liebsch",
          "Nb_Reviews": 1,
          "Date": "2021-02-13T13:11:29.000Z",
          "Titre": "It’s all good",
          "Contenu": "Took a little while to get Here and phone was dead when I got it but it’s all good fam tree"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ugww John",
          "Nb_Reviews": 1,
          "Date": "2022-05-19T00:00:16.000Z",
          "Titre": "I'm in love with the phone"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rowland",
          "Nb_Reviews": 3,
          "Date": "2020-12-12T14:20:47.000Z",
          "Titre": "It was fast delivery"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "anonymous",
          "Nb_Reviews": 1,
          "Date": "2021-03-28T21:46:15.000Z",
          "Titre": "Great",
          "Contenu": "Great stuff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tommy Callaway",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T19:47:49.000Z",
          "Titre": "Couldn't Ask For A Smoother Transaction!",
          "Contenu": "The communication was Excellent. Shipping was Fast.I purchased a refurbished Apple 7 watch. Price was very fair compared to new prices. The classification of Pristine was accurate. I like the requirement that buyer must sign to receive. I am very pleased with the entire transaction! I wish instructions were included."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leander",
          "Nb_Reviews": 5,
          "Date": "2023-12-08T17:01:20.000Z",
          "Titre": "Easy-peasy user friendly website",
          "Contenu": "Easy-peasy user friendly website. Navigating the website was a breeze. From the time I placed my order to the time it shipped was less time than some websites takes to process the payment alone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SK",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T03:07:53.000Z",
          "Titre": "Refurb was basically open-box, with AppleCare",
          "Contenu": "I bought a iPhone 13 mini in excellent condition and it arrived beautifully with an original apple packed cable and 11 months of applecare already paid for. Fantastic deal, quick shipping. (I really appreciate that loop commits to using OEM parts, as some other marketplaces can be more unpredictable.)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex McKaughn",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T23:12:30.000Z",
          "Titre": "My first delivery from Loop Mobile and a 5 Star Feeling!",
          "Contenu": "After dealing with other online retailers, Loop Mobile  has shown service that I have not seen in any other   company in recent times.A company that returns calls, accepts responsibility, delivers a valuable product timely and a great customer experience! I love my new watch!!! Thank You!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jiacheng Dong",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T17:05:52.000Z",
          "Titre": "The problem is solved",
          "Contenu": "The problem is solved. Thanks to Gabriela. I'd love to share with you that they are responsible for the problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Genevieve",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T02:20:52.000Z",
          "Titre": "Awesome seller",
          "Contenu": "Fast shipping & great price. I will be ordering from your website again & tell my family & friends for the great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ana Daresa Moore",
          "Nb_Reviews": 3,
          "Date": "2023-10-14T14:41:53.000Z",
          "Titre": "Gabriela is so nice to give me an…",
          "Contenu": "Gabriela is so nice to give me an upgrade for my Apple Watch that they accidentally sent the wrong one but the replacement was fast and got a nice upgrade..thanks a lot Gabriela for doin above and beyond for me and for being patient also to me when I keep asking regarding my watch.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Gibbons",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T14:00:06.000Z",
          "Titre": "I received my phone promptly and as…",
          "Contenu": "I received my phone promptly and as described, unfortunately the phone had problems charging and the battery would drain within 4 hours after being charged fully so i will have to have the battery changed. I was unable to return the phone to loop as I had already left the states and will be overseas for 6 months plus. **UPDATE Loop contacted me and offered me a replacement phone at no cost to me, the ,logistics were not entirely seamless due to my overseas location but a replacement phone arrived with some $ credit also. Loop worked hard to rectify my issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tasha Stingley",
          "Nb_Reviews": 1,
          "Date": "2021-11-16T17:40:24.000Z",
          "Titre": "Just recently received this phone",
          "Contenu": "Just recently received this phone, everything checks out but a couple of things. First thing I noticed was dirt/ debris in every crevice, I would have thought the place would have air dusted this before sending out as “very good”.  A couple minor blemishes on the outer screen and deep cut in center of screen as well but hardly noticeable.  One thing though the speakers sound disoriented. Sometimes my sound gets higher then lower only when sounds on and using phone."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Moneca Gossette",
          "Nb_Reviews": 1,
          "Date": "2021-04-07T19:26:58.000Z",
          "Titre": "I was a little suspect because I…",
          "Contenu": "I was a little suspect because I usually order direct from apple and new, but I wanted a iPhone XS so after searching several sites I found Loop Mobile. I am so glad I did it was a great experience exactly what I wanted and way way cheaper. My iPhone is perfect and function perfectly. I am gonna tell more about Loop Mobile."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liwen Lin",
          "Nb_Reviews": 1,
          "Date": "2021-09-28T20:00:11.000Z",
          "Titre": "great service, great experience",
          "Contenu": "so i bought an iphone xs max from loop mobile. unfortunately, all cameras did not work after 6 months. after contact with loop mobile, a new iphone xs max is dispatched to replace my previous one. anyway, a reliable merchant. deserve to visit more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T06:41:39.000Z",
          "Titre": "Fast ship",
          "Contenu": "Fast ship! As advertised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose R",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T18:14:05.000Z",
          "Titre": "iPhone 12 Pro Max",
          "Contenu": "I purchased an iPhone 12 Pro Max in Fair condition but when it arrived it was very good looking!! I’m extremely happy with my purchase! Thanks Loop Mobile!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley H.",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T02:01:20.000Z",
          "Titre": "I-Phone 12 ProMax - Good Condition",
          "Contenu": "I purchased an I-Phone 12 ProMax in good condition. The phone looks and smells brand new. I was very happy that I got exactly what I purchased in great condition. No scratches on the screen nor body of the phone and it was completely unlocked so my sims card went right in and worked with no issues. I will continue to upgrade my phone through Loop. The only issue was FedEx shipping instead of 12/23 I got my phone 12/29 which was way after Christmas and a little disappointing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AT",
          "Nb_Reviews": 3,
          "Date": "2022-10-13T16:15:27.000Z",
          "Titre": "FROM FRUSTRATION TO FEELING FABULOUS",
          "Contenu": "So a few days ago I was frustrated with not being able to receive my order number and lack of communication about shipping , but I did get my phone so far so good ! I wanted to take the time to say I am pleased with the phone it looks brand new and besides the lack of communication the speed of service is really good and the price was extremely fair. TY!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeraul Patrick",
          "Nb_Reviews": 2,
          "Date": "2023-06-19T23:10:39.000Z",
          "Titre": "I got a call from customer care and…",
          "Contenu": "I got a call from customer care and everything is resolved... She promptly addressed the matter as the phones were delivered and I wasn't informed via email (I stay at 2 homes 15 minutes apart)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Dotto",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T13:32:16.000Z",
          "Titre": "I love my PRISTINE Apple Watch",
          "Contenu": "At first I was a little skeptical at the prices but after many many questions, that were answered in a timely fashion, and the other reviews, my concerns lessened. I ordered a pristine item and I couldn’t be happier with it. I see myself returning to get more products in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicole",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T21:56:27.000Z",
          "Titre": "Saved myself $200 on Loop Mobile's Apple Watch Series…",
          "Contenu": "I just purchased an Apple Watch Series 6 and it seriously looks brand-new! The ordering process was super simple to navigate. I received a number of emails confirming my order, providing tracking number, and updating me on the status of the shipment which was reassuring. My watch was delivered very quickly, despite it being a holiday weekend. I ended up saving myself over $200 purchasing through Loop Mobile. I would highly recommend as a cost-saving option."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rosie G",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T14:42:17.000Z",
          "Titre": "The purchase was smooth and the…",
          "Contenu": "The purchase was smoothed and the delivery super quick. Very happy with my new watch! Just as described."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Karin   Keller",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T00:52:05.000Z",
          "Titre": "Such a great and easy experience with…",
          "Contenu": "Such a great and easy experience with loop! It delivered so quickly and came in perfect condition. I love shopping more sustainably so this was the best option for me!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Korin",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T03:21:08.000Z",
          "Titre": "I didn’t need the phone in expedition…",
          "Contenu": "I didn’t need the phone in expedition but the phone came in good timing. It looks and acts just as my other phone and I have no complaints. My only question is, is the packaging recyclable? Or compostable? Other than than loop mobile worked for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lucas",
          "Nb_Reviews": 1,
          "Date": "2023-01-02T10:54:08.000Z",
          "Titre": "Solid company",
          "Contenu": "Saw you guys on Backmarket and noticed that your overall price was cheaper so I ordered. No dissatisfaction at all from me. The phone came as if it was brand new, charging port was spotless, no scratches or dents. At T-Mobile they confirmed the iPhone was real. Keep up the good work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael+Maxian",
          "Nb_Reviews": 2,
          "Date": "2021-11-13T16:58:59.000Z",
          "Titre": "Great Watch!",
          "Contenu": "I purchased the Apple Watch Series 4 “pristine “ from your website and wanted to give it a couple of days of set up and test all of the features before reviewing. The watch I received was spotless, not a scratch on it and so far everything works. Battery health is at 94%, a big plus. I’m impressed with your product, I wanted one of these but always hesitated due to high cost. Nice job Loop Mobile!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlos McCarty",
          "Nb_Reviews": 1,
          "Date": "2022-08-31T20:32:11.000Z",
          "Titre": "Wonder experience with loop",
          "Contenu": "Wonder experience with loop. Phone call s in excellent condition and it shipped really fast. Had phone in my hand 2 days after I ordered it. Will be buying my granddaughter an iPad next."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon Dellasso",
          "Nb_Reviews": 4,
          "Date": "2021-04-20T10:49:35.000Z",
          "Titre": "Excellent refurbished Iphone 8",
          "Contenu": "Extremely delighted with purchase of Iphone8 for my grandaughter. It was in excellent condition, great price, great shipping and service, and it also included a warranty which was a bonus. Thank you Loop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce Malin",
          "Nb_Reviews": 1,
          "Date": "2022-04-14T00:09:16.000Z",
          "Titre": "Aside from the fact that i am enjoying…",
          "Contenu": "Aside from the fact that i am enjoying using this computer which replaced my computer from 2012, it is in pristine condition and that is exactly what Loop said that it was.  I am really happy with the company and they gave me a real deal besides.  Thanks, Loop!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anita Achtenberg",
          "Nb_Reviews": 1,
          "Date": "2021-04-04T04:47:07.000Z",
          "Titre": "Regarding purchase of refurbished…",
          "Contenu": "Regarding purchase of refurbished iPhone 8:I am exceedingly pleased with the purchase of my “new” phone!  Delivery was on time and the selection of “pristine condition” was without any disappointment.  Transfer of information from my old phone and Activation by Verizon took place smoothly.  Thank you for a superior product.  I won’t hesitate to use your service again or recommend it to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miss Telephone Girl",
          "Nb_Reviews": 1,
          "Date": "2021-03-23T15:37:52.000Z",
          "Titre": "I ordered the wrong item entirely",
          "Contenu": "I ordered the wrong item entirely - wrong model and wrong carrier compatibility. The ease of which Loop let me return the item and get my refund is A+ and so I'd shop with them again."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jac",
          "Nb_Reviews": 3,
          "Date": "2022-05-11T23:02:56.000Z",
          "Titre": "great company",
          "Contenu": "I had slight issue with communication (maybe they were lacking in staff) at start but at the end they were able to help with my issues and had been helpful. Will buy from site again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Deese",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T17:40:15.000Z",
          "Titre": "I appreciate that you sell phones that…",
          "Contenu": "I appreciate that you sell phones that people like me can afford.  My niece told me about this site and I was able to get an IPhone 13 ProMax quickly, where AT&T said I had to wait til February.Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandi",
          "Nb_Reviews": 3,
          "Date": "2022-02-18T23:31:20.000Z",
          "Titre": "Good value for the price. Great customer service! Would recommend. 👍",
          "Contenu": "While I appreciate the 2 day shipping, it’s FedEx with a signature required. I’m always at work during the 10a-5p window, so making arrangements to be home to sign for the delivery was sort of a pain in the butt. Yes I could’ve arranged for a pickup on their website, but I’ve had packages “disappear” like that before so I’m always leery of going that route. Once I did receive the package, I discovered that they sent me the wrong color Apple watch. I was disappointed but the watch worked fine and I really wasn’t up to the whole return process, so I just kept the one they sent. The watch was in much better condition than I expected, having opted for one in “fair condition”. Very good value for the price.**Update** Jeannie from (I’m assuming) customer service, reached out to me regarding the wrong color being sent out. She apologized and offered me a partial credit for the inconvenience, since I did not want to deal with the returns process. Mistakes happen. I’ll accept that gesture as a sign that Loop Mobile wants to do right by their customers. For that reason I’m definitely comfortable giving them five stars and would recommend them to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cecil Woodgate",
          "Nb_Reviews": 1,
          "Date": "2022-04-21T02:39:43.782Z",
          "Titre": "Received MacBook Air on time",
          "Contenu": "Received MacBook Air on time. Loop Mobile has been great. It took a bit to learn the differences between the MAC OS as I am an old 77 years Windows user. It came in with no scratches or damage I could see. I tested it after running the battery down below 20% and gave it a good charge. I used it most of the next day and installed MS Word, Excel and Power Point I had purchased. All I can say right now is this MacBook is super. So far i love it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda Stevenson",
          "Nb_Reviews": 2,
          "Date": "2022-06-22T03:08:55.000Z",
          "Titre": "I ordered an Apple Watch",
          "Contenu": "I ordered an Apple Watch, and OMG!!! They said it would be here on Thursday I ordered on Tuesday and my watch was at my house THE NEXT DAY! When I got my watch it was perfect!!! Exactly what I ordered and expected!!!! I will definitely be recommending Loop Mobile to others and I’m so happy I chose to order from them!!!!!!♥️ THANK YOU SO MUCH LOOP MOBILE"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harold V",
          "Nb_Reviews": 2,
          "Date": "2022-07-06T18:41:00.000Z",
          "Titre": "Good service for less money",
          "Contenu": "Good service for less money.  Entertaining to interact with.  Proactive company.  Seemed too good to be true but it is true.  Tried it...liked it...owned it...keeping it.  No looking back."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emmanuel Bolosan",
          "Nb_Reviews": 1,
          "Date": "2021-05-10T03:05:49.000Z",
          "Titre": "iPhone 11 Pro Max",
          "Contenu": "iPhone 11 Pro Max I received was pristine condition.  So far all good.  Will definitely purchase another phone from Loop again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lacey",
          "Nb_Reviews": 1,
          "Date": "2021-11-18T06:41:01.000Z",
          "Titre": "Great deal",
          "Contenu": "Great deal, great laptop 👍 i would strongly recommend this company, speedy delivery, works and looks brand new, I’m super happy with it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T02:13:29.000Z",
          "Titre": "Wish it was always this easy!",
          "Contenu": "This was a seamless online buying experience. I received updates for each step of the order and got exactly what I ordered. This is how it's done! Thanks Loop. I will be back!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kl",
          "Nb_Reviews": 2,
          "Date": "2022-07-04T05:39:05.000Z",
          "Titre": "Purchased an iPhone 12 in super good…",
          "Contenu": "Purchased an iPhone 12 in super good condition. Delivery was fast and on time. The phone works great, no scratches at all. Works like a brand new phone. Thank you Loop Mobile for providing a great phone at a great price! Will definitely shop with you again in the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Duncan",
          "Nb_Reviews": 5,
          "Date": "2022-12-15T16:57:36.000Z",
          "Titre": "Pricing was good",
          "Contenu": "Pricing was good, the phones were better than described, and you knew exactly what the carrier was previously.  The last was a big help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DJ",
          "Nb_Reviews": 1,
          "Date": "2021-08-05T20:21:55.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service , I ordered a iPhone XR good condition  , and it came in 18 hours. No trouble with the phone, IT CAME WITH 99% battery health. Will definitely buy from here in the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacorri Bogan",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T20:06:10.000Z",
          "Titre": "I like this app very decent phone and…",
          "Contenu": "I like this app very decent phone and it got delivered on time definitely will be buying another phone from this site again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samuel Walston",
          "Nb_Reviews": 1,
          "Date": "2022-09-18T01:34:01.000Z",
          "Titre": "Well to be honest they have great…",
          "Contenu": "Well to be honest they have great prices and free shipping but I've been having a lot of trouble with receiving my package"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paige Arms",
          "Nb_Reviews": 1,
          "Date": "2021-05-23T19:16:39.000Z",
          "Titre": "Great quality and saves you tons of money!",
          "Contenu": "I got an iPhone 8 for half their original cost and was in amazing condition! It came with a charger and a warranty in case I wasn’t happy with the phone I received."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debby Martinez",
          "Nb_Reviews": 1,
          "Date": "2021-04-25T21:30:03.000Z",
          "Titre": "Second purchase",
          "Contenu": "I just ordered my second phone from Loop-Mobile and I am very satisfied with the product. The phones are reasonably priced and the condition was great. I would recommend to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peep",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T18:31:37.000Z",
          "Titre": "Can’t go wrong",
          "Contenu": "This is the second time I’ve purchased a phone from Loop Mobile and I have no complaints. Fair pricing, good products, and fast shipping, what more could you ask for these days?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valerie Stanley",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T21:16:22.000Z",
          "Titre": "Ease of ordering",
          "Contenu": "Ease of ordering, selecting choices of various features.  Fact that I had a good experience with the last phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2021-03-03T03:14:17.000Z",
          "Titre": "Give them a try!",
          "Contenu": "Two day shipping and on my two week waiting and no phone. No one has been able to give me a straight answer or even offer a refund. This is a crime! I have paid for a phone and still have not received it. Very frustrating.***Update: I have received my phone and it is wonderful! The phone came late but it is a very good buy. FedEx held my product longer than promised. Loop sent it on time and packed it well. Give loop a try, just be patient with FedEx."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin G",
          "Nb_Reviews": 1,
          "Date": "2021-05-20T03:45:53.000Z",
          "Titre": "Highly recommend going with Loop…",
          "Contenu": "Highly recommend going with Loop Mobile. Appreciated the fact that they have the option to purchase phones with a guaranteed battery life of 95% or better."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2022-06-07T23:39:46.000Z",
          "Titre": "Amazing!!",
          "Contenu": "I did a lot of looking around for a decently prices Apple Watch that I felt like would be of good quality. I either found watches that I felt like were too expensive for me or the sites had very bad reviews. Right when I was going to give up I ran into this site. I looked up previous customers reviews and they sold me. I was able to order what I was looking for and at a very reasonable price. When I got it from the delivery service I was blown away. It looked like a brand new watch, nobody would think that it was refurbished. So it looked good but I didn't know if the quality would match up. It did! Everything has been great. It charges to 100%, there were no flaws visually, and all of the features work perfectly. I am very happy that I found this site and made my purchase through them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Prisephanie Savoy",
          "Nb_Reviews": 2,
          "Date": "2021-02-14T07:20:42.000Z",
          "Titre": "The iPhone 8",
          "Contenu": "The iPhone 8 in the prescribe condition, is perfect. We have not had any problems with the phone. In the future I will recommend this site to anyone 😌"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judith Hanson",
          "Nb_Reviews": 11,
          "Date": "2023-04-03T22:58:16.000Z",
          "Titre": "Two thumbs up",
          "Contenu": "Easy ordering on line Good priceAnd prompt deliveryI’d recommend this company based on my experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Natalie",
          "Nb_Reviews": 2,
          "Date": "2021-03-16T21:35:32.000Z",
          "Titre": "Great buy!",
          "Contenu": "I am glad that I make this purchase! Phone came fast in excellent condition . Will recommend to anyone. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon Franklin",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T20:12:06.000Z",
          "Titre": "Phone was in perfect condition and…",
          "Contenu": "Phone was in perfect condition and shipping fast too!!! Would definitely order from Loop again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy Customer",
          "Nb_Reviews": 1,
          "Date": "2021-02-13T16:42:08.000Z",
          "Titre": "IPhone 8",
          "Contenu": "Purchased an IPhone 8, great condition, low price  and no issues whatsoever. Will be back again. Thanks, Loop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Rushton",
          "Nb_Reviews": 2,
          "Date": "2022-11-16T04:57:23.000Z",
          "Titre": "I thought I would maybe see the phone…",
          "Contenu": "I thought I would maybe see the phone in a week. Well it came in 2 days as promised and it is a really nice looking phone I was able to purchase at a very fair price. Charger cable and block as well. Everything I need to switch over from my other phone quickly and easily."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2021-03-22T16:48:33.000Z",
          "Titre": "This is the place to buy a used phone…",
          "Contenu": "This is the place to buy a used phone and if you want one that looks new, you will get one, as they will sell you any type condition of phone.I bought one in \"pristine\" condition, and it was like a brand new phone, Not one mark, not even used look. I will be buying more in future from them. They are straight shooters."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BMR",
          "Nb_Reviews": 3,
          "Date": "2021-03-26T04:48:08.000Z",
          "Titre": "Really good communication and product…",
          "Contenu": "Really good communication and product just as promised. Battery life was 100%. I could be happier! Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brett Sasson",
          "Nb_Reviews": 2,
          "Date": "2021-05-24T19:36:47.000Z",
          "Titre": "Arrived in perfect condition",
          "Contenu": "Thank you for working with me and I am happy with my new iphone 11 pro max, arrived in perfect condition"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gia",
          "Nb_Reviews": 1,
          "Date": "2021-03-27T14:23:37.000Z",
          "Titre": "- I bought my iPhone 11pro max in…",
          "Contenu": "- I bought my iPhone 11pro max in pristine condition and it definitely is as flawless as a new one I love it🥰"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie Burke",
          "Nb_Reviews": 1,
          "Date": "2021-02-28T18:22:58.000Z",
          "Titre": "I received my husband's phone on the…",
          "Contenu": "I received my husband's phone on the date I was supposed too. It has no cosmetic damages and works perfectly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie Tolep",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T21:33:57.000Z",
          "Titre": "Great service",
          "Contenu": "Great service.  Product shipped on time.  Was kept updated on shipment.  Very satisfied with the service!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katelyn Buschman",
          "Nb_Reviews": 1,
          "Date": "2022-06-30T19:32:12.000Z",
          "Titre": "Great value and good shipping time",
          "Contenu": "Great value and good shipping time. It came two days sooner than expected. The product is great and it works well, even though it is refurbished."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ivkoni",
          "Nb_Reviews": 1,
          "Date": "2022-06-27T17:41:09.000Z",
          "Titre": "Will definitely buy from loop mobile…",
          "Contenu": "Will definitely buy from loop mobile again. Package was shipped right away and arrived in 2 days"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Jonathan Leonardo",
          "Nb_Reviews": 2,
          "Date": "2022-01-28T21:00:18.000Z",
          "Titre": "Excellent service, I would recommend!",
          "Contenu": "Everything okay with my purchase. The device is refurbished so obviously it’s not in the best state but the vendor made it clear."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sanjoe Jacob",
          "Nb_Reviews": 4,
          "Date": "2021-04-05T02:27:06.000Z",
          "Titre": "Got an iphone 8 from Loop last week",
          "Contenu": "Got an iphone 8 from Loop last week. Amazing quality and super fast shipping! Appreciate the quality assurance process!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rahul Ranjan",
          "Nb_Reviews": 1,
          "Date": "2022-06-20T20:07:49.000Z",
          "Titre": "Very Good Product",
          "Contenu": "I watched iPhone 4 in \"Very Good\" condition and it is very difficult to differentiate this product from a new one."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "matthew",
          "Nb_Reviews": 2,
          "Date": "2021-03-16T17:11:24.000Z",
          "Titre": "My phone arrived fast and it was in…",
          "Contenu": "My phone arrived fast and it was in very good condition as advertised.The phone seems to be working fine."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rogerio Barros",
          "Nb_Reviews": 2,
          "Date": "2021-04-03T03:44:23.000Z",
          "Titre": "Congratulations",
          "Contenu": "Congratulations, for the speed in shipping and the quality of the Iphones, I will definitely buy many more times."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 3,
          "Date": "2023-05-30T19:52:18.000Z",
          "Titre": "Resolve my issue",
          "Contenu": "Gabriela was very nice and helpful. She was able to resolve my issue"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam king",
          "Nb_Reviews": 2,
          "Date": "2021-03-26T03:00:31.000Z",
          "Titre": "The phone came within two business days…",
          "Contenu": "The phone came within two business days and was very impressed. To be honest I thought it was all a scam but the phone came and everything worked felt blessed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Johnson",
          "Nb_Reviews": 3,
          "Date": "2022-09-05T17:55:42.000Z",
          "Titre": "Product was on time and looks great",
          "Contenu": "Product was on time and looks great!  I actually bought it for a Christmas present, so it will not be used until then.  Hopefully it works!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2021-04-03T08:44:28.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent business I needed a new phone fast and cheap with good quality also and you delivered.thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pablo F. Gamarra",
          "Nb_Reviews": 1,
          "Date": "2021-04-29T08:54:22.000Z",
          "Titre": "I need to unlock the iPhone 8 that I…",
          "Contenu": "I need to unlock the iPhone 8 that I got from you please let me know the password or code so my server can connect Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra Brunet",
          "Nb_Reviews": 1,
          "Date": "2022-05-02T17:11:35.000Z",
          "Titre": "We had a",
          "Contenu": "We had a. great experience. The watch was in perfect shape and we are very happy customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "zack ahmed",
          "Nb_Reviews": 5,
          "Date": "2023-02-07T04:15:04.000Z",
          "Titre": "Super 5 stars I would do it for 20…",
          "Contenu": "Super 5 stars I would do it for 20 stars So nice so quickly delivery on time never missed I love it viva loop. All year"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Lawrence",
          "Nb_Reviews": 1,
          "Date": "2021-10-26T21:20:40.000Z",
          "Titre": "My laptop is damn near brand new all…",
          "Contenu": "My laptop is damn near brand new all the bells and whistles these guys know what they are doing!!! Very very happy with doing business with them A1"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Duncan",
          "Nb_Reviews": 5,
          "Date": "2023-03-06T22:57:55.000Z",
          "Titre": "Good value and very clear on what phone…",
          "Contenu": "Good value and very clear on what phone you are getting.   Fair condition appears good to me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jana",
          "Nb_Reviews": 2,
          "Date": "2021-02-17T13:16:47.000Z",
          "Titre": "Shipped fast",
          "Contenu": "Shipped fast! Phone was in Excellent shape! Will not hesitate to order again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raphaelle",
          "Nb_Reviews": 2,
          "Date": "2022-02-01T21:15:16.000Z",
          "Titre": "Amazing experience",
          "Contenu": "Amazing experience and customer service. Would recommend to anyone willing to buy a refurbished phone or laptop. Thanks again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miles Wilson",
          "Nb_Reviews": 3,
          "Date": "2022-06-28T03:09:02.000Z",
          "Titre": "Ordered in good condition was really…",
          "Contenu": "Ordered in good condition was really nice little to no scratches works perfectly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "nikki willis",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T11:09:21.000Z",
          "Titre": "Perfect Apple iMac",
          "Contenu": "Received my Mac on time and in beautiful shape! Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diana C.",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T21:29:13.000Z",
          "Titre": "Excellent quality, fast delivery!",
          "Contenu": "Watch was delivered even earlier than expected. Pristine condition as described."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 4,
          "Date": "2021-02-14T03:06:08.000Z",
          "Titre": "Happy Customer!",
          "Contenu": "Product came on time, instructions for activation were easy to follow & tech support was helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lihuang Zheng",
          "Nb_Reviews": 1,
          "Date": "2022-02-24T01:13:41.000Z",
          "Titre": "Sells what promised 👍🏻",
          "Contenu": "Awesome refurbished device from Loop Mobile. Will buy again from them xD"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Epitacio Jaimes",
          "Nb_Reviews": 2,
          "Date": "2022-12-14T00:06:55.000Z",
          "Titre": "I really happy with delivery an my…",
          "Contenu": "I really happy with delivery an my device the experience was great 👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lorraine de Landes",
          "Nb_Reviews": 2,
          "Date": "2022-08-15T23:14:24.000Z",
          "Titre": "Great overall",
          "Contenu": "fast delivery, phone works very well and great costumer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antonia M.",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T23:22:27.000Z",
          "Titre": "Great service and fast shipping",
          "Contenu": "Great service and fast shipping. Will definitely come back!"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Rodrigo Zucatelli",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T13:55:45.000Z",
          "Titre": "The device is incredible new!",
          "Contenu": "The device is incredible new and it came with charger and cable. Fast shipping!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dn",
          "Nb_Reviews": 2,
          "Date": "2021-06-22T15:55:32.000Z",
          "Titre": "fast shipping i phone was in excellent…",
          "Contenu": "fast shipping i phone was in excellent condition at a good price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa Graham",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T23:16:53.000Z",
          "Titre": "I will never buy new again",
          "Contenu": "I will never buy new again. I was skeptical at first but so glad I make the purchase now. The phone looks and works like a new one. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Les+Seyforth",
          "Nb_Reviews": 4,
          "Date": "2021-05-02T14:42:56.000Z",
          "Titre": "Excellent phone",
          "Contenu": "Excellent phone. You would not know it isn’t brand new. Shipping was slightly slow, it was a day later than I figured, but everything is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zachary Pitts",
          "Nb_Reviews": 1,
          "Date": "2021-02-16T05:09:41.000Z",
          "Titre": "I ordered an iPhone 8 and i love the…",
          "Contenu": "I ordered an iPhone 8 and i love the phone. The delivery was quick. There were no issues with the phone, no scratches. It’s basically brand new."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "yuphadee",
          "Nb_Reviews": 3,
          "Date": "2021-05-14T16:40:49.000Z",
          "Titre": "I bought (2) phones from Loop Mobile, very happy with both phones.  Fast and free shipping.",
          "Contenu": "I bought (2) phones from Loop Mobile, very happy with both phones.  Fast and free shipping.  Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-05-25T16:30:49.000Z",
          "Titre": "Authentic, Reliable, very happy with my purchase",
          "Contenu": "Authentic amazing phone, very happy and satisfied with it. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Hollister",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T16:10:23.000Z",
          "Titre": "Great product",
          "Contenu": "Great product! Item was delivered faster than expected!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T21:37:33.000Z",
          "Titre": "Such fast shipping",
          "Contenu": "Such fast shipping, great service, and use of the website!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "nicholas Thomas",
          "Nb_Reviews": 1,
          "Date": "2021-09-03T18:28:33.000Z",
          "Titre": "Apple watch s3",
          "Contenu": "Amazing product, still in great condition and came pretty fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "APH",
          "Nb_Reviews": 4,
          "Date": "2022-12-02T14:46:18.000Z",
          "Titre": "Very happy",
          "Contenu": "Product came as described and very happy with my purchase and the fast shipping.  Prices were great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AM",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T03:26:05.000Z",
          "Titre": "Great product/seller",
          "Contenu": "Great product, works as expected.Also, shipping was quick and got my item on time.I trust this seller."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wes",
          "Nb_Reviews": 1,
          "Date": "2022-07-18T19:18:22.000Z",
          "Titre": "Excellent condition and packaging",
          "Contenu": "Watch came in mint condition and shipping was fast and easy. Love my new (used) iWatch!"
        }
      ]
    }
  ]
}