{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "lumilum.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "khaleel martinez",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T00:57:19.000Z",
          "Titre": "Never got my product and when I tried…",
          "Contenu": "Never got my product and when I tried to order it again it got declined"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrea Hill",
          "Nb_Reviews": 1,
          "Date": "2021-03-03T13:03:25.000Z",
          "Titre": "\"Something wrong with customers services from Lumilum for not responding my questions on email\"",
          "Contenu": "On last October 1, 2020, I did already send my questions about Lumilum of LED lights (spotlight) on email that I did send my emails to you but you or company of Lumilum customers services NEVER response me back and NEVER replying my questions on emails that I keep sending my emails many times to send to Lumilum customers services since October 1 thru October 6 that longest weeks & many times and nothing heard from customer service until now in March 2021 are still NO one response back to me & I NOT know why & not know what happened to that customers services from Lumilum and yes that's something WRONG with Lumilum company that customers services. I DEEPEST WISH Lumilum customers services will read my questions and response/replying back to me and I DEEPEST WISH that customers services are GOOD service & GOOD help, I WISH. Right now I still try to asking questions to you about Lumilum LED lights. Very extreme sorry! Not fair that customers services did response & replying & helped to other people that customers services that NEVER response me that I am only one that those NO one go responding me because lucky to other people because I NEVER got lucky that customers services does NOT replying me back from I waiting and waiting for replying on my QUESTIONS about LED lights.I wish want 5 stars but very extreme apology about lower 1 star because never response on emails."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Simcha Livshitz",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T02:53:18.000Z",
          "Titre": "For me your LED strip light more ooensive then on l",
          "Contenu": "For me your LED strip light more expensive then on line."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amanda Moore",
          "Nb_Reviews": 2,
          "Date": "2022-11-07T18:05:45.000Z",
          "Titre": "The first year and a half everything…",
          "Contenu": "The first year and a half everything worked perfectly.  Then it started flickering, and you sent me a new dimmer switch.  It still kept acting up, and I took out one bar.  That worked for awhile but it started turning off spontaneously, and when I called and asked for technical support, I realized that they don't actually know.  I mean, they're not electrical engineers.  So I had two electrical engineers come over to my house, and they both said they thought it was the connection from the transformer to the dimmer.  I had asked your technical support person if it could be the transformer, and he said definitely not.  When these products work, they are the best on the market."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-08-02T19:49:35.000Z",
          "Titre": "Shipping too high!",
          "Contenu": "The order process is acceptable, however, returning to shopping after entering the payment process is not smooth.  Shipping charges for small orders is unreasonably excessive."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ron Evans",
          "Nb_Reviews": 1,
          "Date": "2021-10-13T16:43:39.000Z",
          "Titre": "45.00 for UPS ground shipping is ridiculous",
          "Contenu": "45.00 for UPS ground shipping is ridiculous."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "engineers",
          "Nb_Reviews": 1,
          "Date": "2022-08-19T18:50:19.000Z",
          "Titre": "The cart kept emptying for no apparent…",
          "Contenu": "The cart kept emptying for no apparent reason. I couldn't increase the number of 1/2\" metal brackets past purchasing only 1 package.  There were so many missing specifications that I ordered less than 1/2 of what I might have ordered because I felt that I should spend as little money as possible to learn how your product actually works.  Pricing is super weird - it is cheaper to order 2x10 ft than to order 20 ft. Shipping is a mystery until you check out, assuming that you once again haven't had the basket emptied again. BTW, I am an engineer and a product manager.  Your website needs a lot of work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael R",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T15:54:56.000Z",
          "Titre": "Website is very quirky",
          "Contenu": "Website is very quirky. Doesn't behave well. Can't download a receipt. Email receipt is a mess. Line items run on into each other."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Isa Roig",
          "Nb_Reviews": 4,
          "Date": "2022-06-16T14:54:41.000Z",
          "Titre": "Lumilum never READS the instructions to…",
          "Contenu": "Lumilum does a great job at confirming orders and  even shipping the same day :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis RJ Heizelman PE",
          "Nb_Reviews": 1,
          "Date": "2021-07-28T22:32:02.000Z",
          "Titre": "Helpful answers",
          "Contenu": "i originally called in for support regarding a fixture, i was/am trying to determine if it will into my design.  Miquel was helpful and did what he was able to answer my questions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Judd Bonham",
          "Nb_Reviews": 1,
          "Date": "2021-07-24T20:28:01.000Z",
          "Titre": "It would be nice if the mounting…",
          "Contenu": "It would be nice if the mounting hardware or double sided tape were included with a $1,200 purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Russ Cormier",
          "Nb_Reviews": 1,
          "Date": "2020-12-02T21:36:27.000Z",
          "Titre": "Just made my first order today",
          "Contenu": "Just made my first order today. I made a small mistake on my order and emailed them, they contacted us probably minutes after I did and took care of my mistake asap!!! So so far so good. Hopefully the product is as good as the service then it will be 100% 5 star"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Evelyn Allport",
          "Nb_Reviews": 4,
          "Date": "2021-05-27T02:15:30.000Z",
          "Titre": "Fabio was willing to take the time to…",
          "Contenu": "Fabio was willing to take the time to listen to my needs. He was very helpful in making sure I ordered just what I need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Walter Rodin",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T20:45:44.000Z",
          "Titre": "Well trained staff makes a difference",
          "Contenu": "Working with Favio is always a learning experience and an enjoyable process to source needed lighting materials for complex designs.  I look forward to ordering more products and encourage our customers to consider Lumilum products for their next lighting project."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luxury",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T18:35:23.000Z",
          "Titre": "helpful customer service",
          "Contenu": "helpful customer service, efficient order process & order barely placed and it already shipped!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Satisfied customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T15:39:04.000Z",
          "Titre": "Beautiful 3000k strip lighting (for uplighting application)",
          "Contenu": "Lumilum consulted with us by phone and email to get our order just right and we installed 3000k Strip lighting just below the ceiling, in our dining room, as uplighting. It is absolutely gorgeous and everyone who sees it loves it, too. Product is well made and the service in helping us select and order the correct components was excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oscar Rey",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T03:54:14.000Z",
          "Titre": "faster that Amazon !!",
          "Contenu": "user friendly website, excellent service - the package arrived the next day!!!  it was very impressive to say the least !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean Day",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T21:30:33.000Z",
          "Titre": "AMAZING COMPANY, GREAT EXPERIENCE",
          "Contenu": "I called in to inquire about some questions I had on the product before purchasing,  upon calling, all my questions were answered, and I placed an order with the agent.  I received the order quickly, have it installed and product is working great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Kamau",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T17:25:48.000Z",
          "Titre": "Miguel THE 5 star",
          "Contenu": "Miguel gave 5 star customer service. From the start he was super awesome and easy to talk to. I was a first time customer and was new to what I was asking for but he was able to break it down and help me make sure I got what I needed. Thank You so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ray M from Michigan",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T19:54:09.000Z",
          "Titre": "One of the better online experiences out there",
          "Contenu": "Comparing product to online competitors, I felt I got more bang for the buck. Called customer service to make sure I was getting all the right product and accessories before placing order. Miguel was great. He tweaked a few things that saved me money after he reviewed the schematic I emailed him. All in all it took about 30 min - as if I walked in to a physical location.  Website easy to navigate.  Most pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Ehmann",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T14:17:36.000Z",
          "Titre": "Excellent Products and Customer Service",
          "Contenu": "Last year I bought 120v LED lighting from Lumilum, to use as under counter lighting in my kitchen.  The project turned out great!  I love the product quality and the fact I could get everything I needed to have dimming counter lights as part of a home automation system.  I also received excellent support from Miguel, one of the best customer service people I've worked with in awhile.  I'm now considering buying more lighting from Lumilum, this time for my deck."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Mann",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T00:37:58.000Z",
          "Titre": "Your sales people was very…",
          "Contenu": "Your sales people was very knowledgeable. Service was polite, helpful and deliver was prompt."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T23:46:50.000Z",
          "Titre": "Lumilum Delivers Everytime!",
          "Contenu": "In a world where getting lighting equipment produced and shipped has gone completely haywire, Lumilum never fails to deliver on time every time!  I've been using their products for 4 years now and will NEVER look back!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce Johnsen",
          "Nb_Reviews": 2,
          "Date": "2021-10-20T20:30:57.000Z",
          "Titre": "Mr Mukbel",
          "Contenu": "Mr. Mukbel was extremely knowledgeable and helpful with assisting in helping me determine what I needed for my order and in turn send me a link to checkout.    This company makes life easy even when I didn’t know what I needed.  Thank you Hussein and Lumilum.   Looking forward to helping my customer with the same satisfaction you provided me with.   Bruce Johnsen The Electrician"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Troy Thompson",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T14:53:04.000Z",
          "Titre": "These guys are fantastic",
          "Contenu": "These guys are fantastic.  I called in a custom order and had several folks respond quickly.  I emailed a sketch of the landscaping project to make sure all was well and they walked me through all the steps.  This was a good thing as I made a few assumptions that were wrong.  Bottom line, Lumilum is a top tier professional outfit and I highly recommend them to everyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barry Teger",
          "Nb_Reviews": 1,
          "Date": "2021-01-26T15:52:39.000Z",
          "Titre": "Found this site on line as i was…",
          "Contenu": "Found this site on line as i was looking for LED lighting to customize an entertainment center.  I wanted to be able to use this lighting with an external Lutron Caseta dimmer switch which Cannot be used with low voltage. Spoke with Steve who was very informative and reviewed my layout so i would use the correct parts. Installed it looks very professional. I see only one downfall. The smallest section which can be used is 12\".  They need to make this product where you can cut it in increments of inches. Otherwise made well and can be used inside and outside"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harvey Wright",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T14:43:36.000Z",
          "Titre": "The product has been great",
          "Contenu": "The product has been great, but moreover the service has been even better!! I will recommend Lumilium 100%"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stevo",
          "Nb_Reviews": 1,
          "Date": "2021-01-09T01:57:56.000Z",
          "Titre": "Best customer service in the buisness",
          "Contenu": "Best customer service in the buisness! I’ve been looking for strip lights that could be hard wired on a dimmer switch and these were the only folks who could answer my questions and deliver. Packed and shipped the same day. I haven’t received the product yet but I’m confident it will be perfect for my application."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Ahl",
          "Nb_Reviews": 1,
          "Date": "2021-02-11T21:47:58.000Z",
          "Titre": "Outstanding customer service",
          "Contenu": "I left a question on the website message board late at night and was contacted early the next day. I spoke with Steve who answered all my questions and even guided me in a different but more appropriate product for my application. Ordering through Steve at Lumilum was a pleasure and I will be sure to go through him again on the next project."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamey Glynn",
          "Nb_Reviews": 3,
          "Date": "2021-08-26T18:40:44.000Z",
          "Titre": "Fantastic customer service from Michael",
          "Contenu": "Fantastic customer service from Michael.  He helped me select exactly what I needed for our project.  He was very patient as I explained what we were trying to accomplish.  I cannot wait to receive our light strips and install them in our bar room."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anika Ruff",
          "Nb_Reviews": 2,
          "Date": "2021-02-12T21:01:32.000Z",
          "Titre": "Lumilum - Great product and Service",
          "Contenu": "Love this product for its variety and ability to configure it in so many different ways.  Steve DiTusa is super in customer service.  Assists me with product design and reminds me of all the parts needed to make the system perfect.  Very Responsive (even on Friday afternoons!)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AFletcher",
          "Nb_Reviews": 1,
          "Date": "2021-09-23T20:06:06.000Z",
          "Titre": "Fantastic Customer Service!",
          "Contenu": "I called to place an order on the phone so we could utilize our own shipping number for overnight delivery.  Hussein was very helpful. He went out of his way and even helped get our package out that day even though it was nearing the shipping cutoff time.  Fantastic customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Walter Rodin",
          "Nb_Reviews": 3,
          "Date": "2022-01-04T18:55:05.000Z",
          "Titre": "Thanks for taking care of an important…",
          "Contenu": "Thanks for taking care of an important customer's needs with a Single color 120v tape needing a short run J-Rex with a specific cord length.  Lumilum's staff are always helpful and find the best solutions to get projects done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremiah",
          "Nb_Reviews": 1,
          "Date": "2021-07-19T18:25:36.000Z",
          "Titre": "Outstanding",
          "Contenu": "Initially, the service I received was outstanding. Thank you for being awesome Steve.   The product is also top notch.  The lights were high quality, assembled easily, and they looked great after installation. I highly recommend Lumilum."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn Citro",
          "Nb_Reviews": 1,
          "Date": "2020-12-17T23:59:36.000Z",
          "Titre": "Well I recently talk to a guy name…",
          "Contenu": "Well I recently talk to a guy name Steve from this company he was very informative patient and very knowledgeable about the situation we were trying to light up in a high-end home I highly suggest using these guys in the future the pricing was right but the service was even better you cannot put a price on good service these days so if you’re looking for some outdoor lighting ideas industrial commercial or residential please contact  Steve from this company.  He is a hell of a guy. I look forward to using him again as soon as possible thank you Steve. Shawn Citro"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy",
          "Nb_Reviews": 2,
          "Date": "2022-10-26T14:37:19.000Z",
          "Titre": "Excellant service",
          "Contenu": "Steve helped me figure out everything I needed to create stunning off-set light for our ceiling and backsplash.Woulld highly recommendI'd be happy to provide pictures of the finish product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark R.",
          "Nb_Reviews": 3,
          "Date": "2021-12-07T21:58:54.000Z",
          "Titre": "The gentlemen that helped me was extremely helpful, patient and polite.",
          "Contenu": "The gentlemen that helped me was extremely helpful, patient and polite.  I was unsure what I really needed and he helped me through it in a very friendly manner.  I will definitely come back for all my lighting needs going forward."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Goad",
          "Nb_Reviews": 2,
          "Date": "2022-05-10T05:51:03.000Z",
          "Titre": "RGB Strip Lighting Purchase",
          "Contenu": "I reviewed the products on-line and found the website most informative and was confident the product we tentatively selected would be best for the sun room mood lighting we were looking to obtain. Called the vendor just be sure and with no wait time I was able to talk to a \"real person\" who was very helpful and suggested a few additional items to aid in the installation. Although the product may seem a bit costly compared to the products available in home improvement stores they were not of the reliability and quality of the Lumilum product line. So glad to have found them online."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Banuk",
          "Nb_Reviews": 3,
          "Date": "2022-09-27T22:42:19.000Z",
          "Titre": "My 165-ft length of LUM-120HLO-5500K…",
          "Contenu": "My 165-ft length of LUM-120HLO-5500K went out because of water ingression into a screw connector.  Favio sent me a repair kit.Thank You"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wizardwlr",
          "Nb_Reviews": 1,
          "Date": "2021-01-06T22:03:12.000Z",
          "Titre": "Called with some technical questions…",
          "Contenu": "Called with some technical questions which where answered in detail.  Asked if samples might be available for evaluation, answered with a positive YES.  Samples where on there way with in hour,  Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Geoffrey Goodland",
          "Nb_Reviews": 3,
          "Date": "2020-12-18T17:50:26.000Z",
          "Titre": "Last minute order filled with the quickness",
          "Contenu": "Roth Lighting had a last number order at the end of the day.  Our customer needed to pickup an order as soon as possible.  The sales team at Lumilum made it happen.  Especially Miguel, he is the best."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "INTERNEGATIVE LLC",
          "Nb_Reviews": 1,
          "Date": "2021-05-07T00:40:07.000Z",
          "Titre": "SUPER Helpful & Customer-Focused",
          "Contenu": "Lumilum is about as customer-focused as a company can get. They responded quickly and were always readily available to answer questions about my custom installation. The product has not arrived so I cannot comment in that respect. But if the product is as good as the service, I don't think I'll be disappointed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Walter Rodin",
          "Nb_Reviews": 3,
          "Date": "2023-06-27T22:38:10.000Z",
          "Titre": "Top Customer Service!!",
          "Contenu": "Having quick access to a sales person for specifications, product availability, and application questions helped advance our project in the sales process.  Favio Pardo has been an exceptional sales person.  With his knowledge of the Lumilum product, he has provided us the ability to use Lumilum products in some of the finest homes and complicated applications.  All Lumilum projects have been receiving our customer's many compliments."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CER Electrical SVC's",
          "Nb_Reviews": 1,
          "Date": "2021-03-15T22:35:46.000Z",
          "Titre": "New potential LED strip provider",
          "Contenu": "New potential client, will be reviewing LED strip products.So far  Lumilum was very receptive and accommodating and we look forward to installing their products.Will get back on future review!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Wolfe",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T01:55:32.000Z",
          "Titre": "Jose took good care of me",
          "Contenu": "Jose took good care of me. Turned around my requested quote quickly and was able to answer my questions professionally. Good stuff!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vince Rossi",
          "Nb_Reviews": 1,
          "Date": "2022-02-16T01:18:59.000Z",
          "Titre": "Jose was very professional and helpful…",
          "Contenu": "Jose was very professional and helpful with our LED lighting project.  He educated me on the available options and helped me find a great solution for our needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K Kean",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T14:04:18.000Z",
          "Titre": "Well Beyond Expectations...",
          "Contenu": "The entire experience from browsing the options on the website, the ease of ordering on the website and the fast shipping for a custom order were above and beyond my expectations. The strip lights are excellent quality and the perfect compliment to our spa deck. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lyons Companies",
          "Nb_Reviews": 1,
          "Date": "2021-01-12T21:45:23.000Z",
          "Titre": "Very easy to work with and they got our…",
          "Contenu": "Very easy to work with and they got our product shipped out for a prototype within one day of making contact with them. Impressed with their customer service and friendliness"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "thomas rafferty",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T01:27:40.000Z",
          "Titre": "Under cabinet lighting project",
          "Contenu": "I'm doing a small project at home and wanted the wire to match the top quality products I purchased for this job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Witulski",
          "Nb_Reviews": 1,
          "Date": "2021-01-19T22:05:01.000Z",
          "Titre": "This was my first experience with…",
          "Contenu": "This was my first experience with Lumilum. The product specialist (Favio) was great to work with. He was very helpful with product specific information to guide me through the details of my installation. Paul Witulski"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Restin",
          "Nb_Reviews": 4,
          "Date": "2021-08-12T17:57:57.000Z",
          "Titre": "Top quality product.",
          "Contenu": "I've had this product installed in our home for 5 years, and it performs flawlessly. I expect the current order to do the same. Highest quality product, and I am a lighting manufacturer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Sherogan",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T23:52:36.000Z",
          "Titre": "Jose provided helpful information to…",
          "Contenu": "Jose provided helpful information to help me build my LED installation prototype. He was patient with my questions and knowledgeable about the products I required."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Eicher",
          "Nb_Reviews": 1,
          "Date": "2022-07-22T22:22:21.000Z",
          "Titre": "The guys I spoke with were very helpful…",
          "Contenu": "The guys I spoke with were very helpful directing me to the additional components I needed. Miguel Wright was a pleasure to talk to and work with. Thanks for your help in getting things ordered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "the Creditcardman",
          "Nb_Reviews": 8,
          "Date": "2021-04-22T16:36:33.000Z",
          "Titre": "THE place for DIMMBLE LEDs",
          "Contenu": "THE place for DIMMBLE LED strip lighting with helpful service and easy to order and pay online. Hard to find a source like this anywhere until Lumilum."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melanie Hoke",
          "Nb_Reviews": 1,
          "Date": "2021-10-19T14:55:52.000Z",
          "Titre": "Bar Lighting",
          "Contenu": "Bar LightingWe were needing lighting for our new bar and had many questions.  Jose S was so helpful.  He got the order together for us, was so easy to work with.  Highly recommend this company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Ross",
          "Nb_Reviews": 1,
          "Date": "2021-02-17T19:26:52.000Z",
          "Titre": "These guys are terrific!",
          "Contenu": "These guys are terrific!  Steve was clear and attentive, The products seem spot on for our needs, and their quote was reasonably inexpensive"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rohs",
          "Nb_Reviews": 1,
          "Date": "2021-01-22T02:05:10.000Z",
          "Titre": "Best product with the best service!",
          "Contenu": "I first learned about Lumilum while researching hard-wired LED strips to include as part of my home remodel. Lumilum's products appeared to have superior specs and a wider selection than the competition, so I reached out to the company to learn more. I was connected with one of Lumilum's representatives (Steve), who not only patiently described the different products but also helped me design and put together a lighting package for my family room. I received the order a few days later and easily installed the lights myself. The look of the lights exceeded my expectations! I was so pleased with the product and the entire experience, that I quickly got back in touch with Steve and he helped me design my living room/ dining room/ and kitchen as well. I'm impressed with their product line, knowledge, and customer service in helping me arrange and put together a fantastic lighting plan for my home remodel. I highly recommend Lumilum!"
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "DVI",
          "Nb_Reviews": 2,
          "Date": "2022-02-05T11:15:50.000Z",
          "Titre": "Brilliant!",
          "Contenu": "Working with Lumilum had always been a pleasant experience.  The professional + friendly team ensures that orders are quickly shipped.  Lumilum is always ready to answer questions about products and to ensure that customers are happy with each purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randall Wright",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T04:32:17.000Z",
          "Titre": "Superior customer service",
          "Contenu": "Superior customer service. I had a few led strips that were prematurely failing. Michael resolved the issue with in just a few minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oslay Xuarez",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T00:44:50.000Z",
          "Titre": "Very good attitude",
          "Contenu": "Very good attitude, always helps to get the best LED products and  exactly what you looking for."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CNG",
          "Nb_Reviews": 1,
          "Date": "2021-03-09T19:54:33.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service! Jose answered all of my install questions which was very helpful. He was awesome to deal with - very professional and patient!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janeen Johnson",
          "Nb_Reviews": 1,
          "Date": "2021-04-05T23:31:03.000Z",
          "Titre": "Excellent customer service!",
          "Contenu": "Excellent customer service!  Favio made the piece as we spoke on the phone.  He made a confusing issue for me, a piece of cake!  I will order from them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Atten",
          "Nb_Reviews": 2,
          "Date": "2021-04-05T14:40:51.000Z",
          "Titre": "Customer support was quick to respond…",
          "Contenu": "Customer support was quick to respond with an answer to my question. I have not yet received the flood light so the quality and performance is TBD."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Solutions",
          "Nb_Reviews": 1,
          "Date": "2021-06-10T12:29:15.000Z",
          "Titre": "Led Lighting",
          "Contenu": "Lumilum is an excellent company to deal with. As a business owner it is a pleasure wo work with a company who provides status notifications on orders throughout the process so we can keep our customers informed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roseann Rappa",
          "Nb_Reviews": 1,
          "Date": "2021-11-17T21:26:26.000Z",
          "Titre": "There was a miss understanding with a…",
          "Contenu": "There was a miss understanding with a quote, once the rep noticed he took action and we received our price within minutes.."
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "DVI",
          "Nb_Reviews": 2,
          "Date": "2022-10-05T15:02:21.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service.  Response time to orders or queries is very good.   Followup calls and emails are handled quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet",
          "Nb_Reviews": 2,
          "Date": "2023-02-23T23:29:58.000Z",
          "Titre": "Had an electrician hard wire them under…",
          "Contenu": "Had an electrician hard wire them under my kitchen cabinets. They look great and are dimmable ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Geoffrey Goodland",
          "Nb_Reviews": 3,
          "Date": "2022-12-14T16:27:34.000Z",
          "Titre": "The team at Lumilum are excellent",
          "Contenu": "The team at Lumilum are excellent. Every one there are experts  with strip lighting. I always appreciate there help"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Manny Mariano",
          "Nb_Reviews": 1,
          "Date": "2022-03-14T21:35:04.000Z",
          "Titre": "Miguel was so great with helping me…",
          "Contenu": "Miguel was so great with helping me find the right part. 100% satisfied and will be returning for future purchases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe McCampbell",
          "Nb_Reviews": 1,
          "Date": "2021-10-18T18:14:11.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "The customer service is some of the best I've experienced. Favio walked me through the products and got me exactly what I needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cliff Beck",
          "Nb_Reviews": 1,
          "Date": "2021-05-03T21:52:17.000Z",
          "Titre": "Excellent work with my order",
          "Contenu": "Jose was great to work with. He knew just what I needed to do my lighting job and was very quick about putting the quote together. The whole process was less than 10 min. Thank you Jose. Good job. I'll take pictures of the completed wine room and send them. Cliff (CNB Const) California."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anabella Cohen",
          "Nb_Reviews": 1,
          "Date": "2022-03-14T03:03:07.000Z",
          "Titre": "The seller has been very profesional…",
          "Contenu": "The seller has been very profesional and helpful, his name is Hussein Mukbel and helped me with all my questions."
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "Cesar H",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T22:14:29.000Z",
          "Titre": "LED Strip 120V",
          "Contenu": "Great customer service and super fast shipping. Great product and pricing.  I had a wonderful experience and I would highly recommend this business to others"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan",
          "Nb_Reviews": 2,
          "Date": "2021-04-13T23:54:36.000Z",
          "Titre": "You guy’s always come through!",
          "Contenu": "You guy’s always come through, I explain the project and you recommend the proper lighting solution. Great job !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracie",
          "Nb_Reviews": 1,
          "Date": "2021-06-11T18:33:45.000Z",
          "Titre": "Calling in our order was very easy",
          "Contenu": "Calling in our order was very easy, efficient and all parts were available for shipment same day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim's Sign & Lighting",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T17:49:09.000Z",
          "Titre": "Easy to work with",
          "Contenu": "Excellent on time service and very helpful. We would use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brent Graves",
          "Nb_Reviews": 3,
          "Date": "2021-03-12T19:14:12.000Z",
          "Titre": "Great customer service and response…",
          "Contenu": "Great customer service and response time on questions and quotes. Look forward to using them on more projects!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Domenic Caserta",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T21:25:02.000Z",
          "Titre": "Fabio was very helpful and professional…",
          "Contenu": "Fabio was very helpful and professional explained everything very well . Made for a very smooth experience . Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "steve porter",
          "Nb_Reviews": 2,
          "Date": "2023-02-20T23:44:20.000Z",
          "Titre": "Great customer service by Miguel",
          "Contenu": "Great customer service by Miguel.  Narrowed down the parts I needed in minutes and sent an invoice, paid and in the mail the same day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danny",
          "Nb_Reviews": 2,
          "Date": "2023-04-24T23:20:36.000Z",
          "Titre": "I don’t generally write reviews.",
          "Contenu": "I don’t generally write reviews.. too busy, but Miguel (the cs rep) was outstanding!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim at Brilliant! Lighting & D",
          "Nb_Reviews": 1,
          "Date": "2021-09-30T16:07:02.000Z",
          "Titre": "Great experience!",
          "Contenu": "Worked with Jose Sanchez. His assistance was perfect in getting the order right, many thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anika Ruff",
          "Nb_Reviews": 2,
          "Date": "2021-01-22T20:05:40.000Z",
          "Titre": "Love this product and Steve is such a…",
          "Contenu": "Love this product and Steve is such a great help.  Top Quality customer service and superior product.  Great combo!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 1,
          "Date": "2021-04-05T21:22:20.000Z",
          "Titre": "Super FAST Shipping",
          "Contenu": "Website was very easy to navigate and also easy to order additional items needed to complete the project.  Shipping was SUPER FAST!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ivan Delgado",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T16:28:20.000Z",
          "Titre": "The experience was seamless and very…proffessional",
          "Contenu": "The experience was seamless and very easy to pick up merchandise"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Johnny Allen",
          "Nb_Reviews": 2,
          "Date": "2023-06-16T22:33:31.000Z",
          "Titre": "Very fast response and a customized…",
          "Contenu": "Very fast response and a customized quote for our specific project was put together same day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Cook",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T14:18:07.000Z",
          "Titre": "Jose Sanchez was very helpful and…",
          "Contenu": "Jose Sanchez was very helpful and walked me through how your product will work with my application.  He was great, thank you Jose!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg Markman",
          "Nb_Reviews": 1,
          "Date": "2021-03-12T03:24:53.000Z",
          "Titre": "Very knowledgeable professional and…",
          "Contenu": "Very knowledgeable professional and courteous. What an excellent source for LED lighting. So happy I came across Lumilum."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOSEPH MACE",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T19:42:37.000Z",
          "Titre": "Jose very easy to work with",
          "Contenu": "Jose very easy to work with, great experience. Hoping I will enjoy the LEDs. Wanted to pick a quality company and feel this is it right here! Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carl Sandberg",
          "Nb_Reviews": 1,
          "Date": "2022-09-09T20:37:02.000Z",
          "Titre": "Jose is great",
          "Contenu": "Jose is great, Product thus far has been quality compared to \" similar \" order process time outstanding"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane Martin",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T20:06:52.000Z",
          "Titre": "I am a repeat customer....and as…",
          "Contenu": "I am a repeat customer....and as before, the service, response time and product is excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy Customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-15T18:08:30.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service, They pick up the phone . I gave them my order had product in stock. Ordered product no hassle."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karlean Weber",
          "Nb_Reviews": 1,
          "Date": "2022-03-10T19:18:25.000Z",
          "Titre": "Great Job!!",
          "Contenu": "You are all always so helpful. It has been a pleasure working with you over the past several years. Here is to many more to come."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MB",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T19:37:33.000Z",
          "Titre": "Responsive",
          "Contenu": "Sent free samples so verify lumens required."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Herz",
          "Nb_Reviews": 3,
          "Date": "2023-11-17T23:29:16.000Z",
          "Titre": "Jose was extremely helpful in answering…",
          "Contenu": "Jose was extremely helpful in answering my questions and facilitating the decision making process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 2,
          "Date": "2023-06-27T17:47:15.000Z",
          "Titre": "Favio was the rep I spoke with and he…",
          "Contenu": "Favio was the rep I spoke with and he was responsive, friendly and very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lars",
          "Nb_Reviews": 2,
          "Date": "2022-02-18T22:21:39.000Z",
          "Titre": "Easy to navigate web site",
          "Contenu": "Easy to navigate web site.  Found the replacement part I needed, and it was on its way by UPS within a couple of hours."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Solis",
          "Nb_Reviews": 1,
          "Date": "2021-12-14T19:39:31.000Z",
          "Titre": "Been doing business with them for many…",
          "Contenu": "Been doing business with them for many years and always very happy with the product and service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erik Nilsen",
          "Nb_Reviews": 1,
          "Date": "2021-02-22T20:15:49.000Z",
          "Titre": "Hussein and Michael were extremely…",
          "Contenu": "Hussein and Michael were extremely helpful on my design of the system I needed.  Thanks guys!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2022-05-03T23:44:33.000Z",
          "Titre": "Great service from Michael to get the…",
          "Contenu": "Great service from Michael to get the lights I needed.  Select him from the menu.  He answers and responds.Thank MichaelTom from Texas"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Zaccagnini",
          "Nb_Reviews": 1,
          "Date": "2021-12-14T19:31:11.000Z",
          "Titre": "Jose was quick w/ the estimate and very…",
          "Contenu": "Jose was quick w/ the estimate and very helpful!Thank you!Dennis w/ Clear Light Electric, Inc."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "YVETTE DEL VALLE",
          "Nb_Reviews": 2,
          "Date": "2023-03-06T21:06:06.000Z",
          "Titre": "Great Product",
          "Contenu": "Ease of ordering, extremely fast shipping. And great product. Well done!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Smith",
          "Nb_Reviews": 1,
          "Date": "2022-06-06T23:26:47.000Z",
          "Titre": "I hope the shipping is as pleasant and…",
          "Contenu": "I hope the shipping is as pleasant and efficient as the ordering.Thanks Jose"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rob Davidson",
          "Nb_Reviews": 1,
          "Date": "2021-09-24T21:04:54.000Z",
          "Titre": "Always easy to get a hold of and…",
          "Contenu": "Always easy to get a hold of and customer service and products are superb."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Mike Thibodeau",
          "Nb_Reviews": 1,
          "Date": "2022-08-06T05:10:17.000Z",
          "Titre": "Best sales Rep experience in years.",
          "Contenu": "Miguel Rocked it . Got me hooked up with the right on day 1... and helped get the various deliveries to where and when they needed to be .High Marks all around"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Broome",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T22:29:45.000Z",
          "Titre": "Miguel is very accommodating followed…",
          "Contenu": "Miguel is very accommodating followed up perfectly and kept in communication hopefully we'll be able to place a large order"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack Tamir",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T22:09:32.000Z",
          "Titre": "Fabio has always been great",
          "Contenu": "Fabio has always been great, quick, and knowledgeable. 10 stars!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathan Myer",
          "Nb_Reviews": 2,
          "Date": "2023-01-09T23:13:29.000Z",
          "Titre": "Lumilum Service",
          "Contenu": "Favio makes it so easy to do business with LumiLum."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie Fountain",
          "Nb_Reviews": 1,
          "Date": "2022-06-27T23:12:44.000Z",
          "Titre": "Favio was awesome",
          "Contenu": "Favio was awesome! Took care of everything we needed fast and efficient. No hassles"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathan Myer",
          "Nb_Reviews": 2,
          "Date": "2021-12-15T17:56:25.000Z",
          "Titre": "Favio has always helped us out in a…",
          "Contenu": "Favio has always helped us out in a quick and friendly manner!  We love the products and the support!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Van Winkle",
          "Nb_Reviews": 1,
          "Date": "2021-08-06T15:16:51.000Z",
          "Titre": "Outstanding web site",
          "Contenu": "Outstanding web site, pictures, and video installation tips. Full descriptions and technical specifications were extremely helpful. Easy shopping cart and order processing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ALEX MATHIAS",
          "Nb_Reviews": 2,
          "Date": "2022-06-10T00:24:43.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shippingThanks for getting my order correct and shipped out the next day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick Colvin",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T21:26:21.000Z",
          "Titre": "Great Company",
          "Contenu": "Within minutes I received a callback. Very helpful and knowledgeable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet Roach",
          "Nb_Reviews": 5,
          "Date": "2021-09-02T20:31:21.000Z",
          "Titre": "Always easy to deal with",
          "Contenu": "Always easy to deal with.  Very helpful and knowledgeable sales people."
        }
      ]
    }
  ]
}