{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "masterwriter.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lee Shackleford",
          "Nb_Reviews": 3,
          "Date": "2023-11-17T00:19:31.000Z",
          "Titre": "So disappointing.",
          "Contenu": "I had such high hopes based on the slick and compelling advertising. Signed up right away! But ... it's a website, people. It's not an app that runs with your favorite writing software. It's an online thesaurus and I already have access to plenty of those. The hype is exciting! I fell for it! But there's nothing there to get excited about."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T18:51:59.000Z",
          "Titre": "Didn't find this website/app useful at…",
          "Contenu": "Didn't find this website/app useful at all! A waste of money to be honest. Although the video that showed the tutorial, was very useful and inspiring, I thought, that was the perfect writing tools for songwriters, but straight after purchasing the monthly subscription, I was disappointed by the lack of choice I was given. I wrote a couple of songs which needed variations in terms of sentences and rhymes, but I could only find very strange suggestions or very little rhymes choice for a word. When I did the same search via Google search, I was much more lucky and could finish my songs. The algorithms are not working the way I was expecting, hence why, I wouldn't recommend this app and had to cancel my subscription after a couple of months trying to work my way round."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "customergGlen Ervin",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T13:54:20.000Z",
          "Titre": "Frustrating. Not impressed",
          "Contenu": "My previous work was not available when I renewed using the same account info. I still find the interface cumbersome. And there’s still nothing I’m seeing here that I can’t find at Rhyme Zone and other free sites."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-19T22:00:32.000Z",
          "Titre": "I was very disappointed with the…",
          "Contenu": "I was very disappointed with the product. I did not need a word processor. The dictionary and thesaurus functions can be found on other free websites and work better than this bundle. I will not renew."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Diane Garrod",
          "Nb_Reviews": 2,
          "Date": "2023-06-29T21:24:55.000Z",
          "Titre": "Never used it",
          "Contenu": "Never used it. Didn't seem \"writer friendly\" as it was not a \"writing program\" but a dictionary, thesaurus typed program."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T15:24:45.000Z",
          "Titre": "It’s a dictionary and a thesaurus",
          "Contenu": "Format is outdated. It’s a dictionary, thesaurus and a quote book in a word processor format. Doesn’t have any capacity to make writing less difficult. I wish I hadn’t purchased this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pool League",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T22:29:33.000Z",
          "Titre": "H ave not used this because ther's none yher",
          "Contenu": "H ave not used this because ther's no one there answerin pjones or looking at emails. thus the only 1 star.  I was going to buy it but i wanted to test thier support first.  glad i did because it seems rhere is none.. They doe'nt answer phones, it goes to voice  mail but no one responds to thst.   tech ssuport is the sam, none.    they \"guarnt ee to give you your money back in 90 days but i would'nt count on it baseddon just tryin to tlk to sone there.thst's too bad. at first looks i thought this might be a great producttak your money anf flush it down the toiletthe toilet.tec support.. do'nt hold you r breath"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-18T21:32:17.000Z",
          "Titre": "I would say that this program is…",
          "Contenu": "I would say that this program is essentially just a glorified thesaurus that is not remotely worth any amount of money. I hate it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leland",
          "Nb_Reviews": 2,
          "Date": "2022-12-10T01:14:09.000Z",
          "Titre": "Buy a dictionary or two",
          "Contenu": "For me, at least, I find other writer tools, such as a synonym dictionary, more complete and more useful."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rick McParland",
          "Nb_Reviews": 2,
          "Date": "2023-03-10T03:50:49.000Z",
          "Titre": "it needs to interface as a add in with…",
          "Contenu": "it needs to interface as a add in with word.It just is not that needed when I do my writing.I do not see it as  a needed addition to my writing but I am giving it more time to be sure"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-02-25T12:40:20.000Z",
          "Titre": "So it has yet to do any of the things…",
          "Contenu": "So it has yet to do any of the things it claims to do. I was ecstatic when i bought it. But it literally wont even show me one rhyming word let alone a phrase.. So disappointed. waste of money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T20:04:23.000Z",
          "Titre": "Misleading advertising",
          "Contenu": "Misleading advertising. You can get the same results from rhymer.com and thesaurus.com both of which are free."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Todd",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T22:08:21.000Z",
          "Titre": "Couldn't upload any of my work so I…",
          "Contenu": "Couldn't upload any of my work so I could use my own word processor."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-13T20:39:14.000Z",
          "Titre": "It does not offer what I was told",
          "Contenu": "It does not offer what I was told. I am extremely unhappy with this product and am sorry I wasted my money on it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Don",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T17:03:30.000Z",
          "Titre": "No real relationship with 1940s noir…",
          "Contenu": "No real relationship with 1940s noir fiction"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SE Teres",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T17:23:31.000Z",
          "Titre": "I bought this to use with Final Draft…",
          "Contenu": "I bought this to use with Final Draft and have not been able to do so.  I feel this was a useless purchase."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T23:14:47.000Z",
          "Titre": "Can’t figure out how it works WORD is…",
          "Contenu": "Can’t figure out how it works WORD is better, Is it an app is it web what is it NOT much help"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Meredith",
          "Nb_Reviews": 2,
          "Date": "2022-08-04T21:56:06.000Z",
          "Titre": "I forget what Master Writer is",
          "Contenu": "I forget what Master Writer is! How do I find it on my computer?  THanks"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Anne Stewart",
          "Nb_Reviews": 3,
          "Date": "2022-06-18T20:57:02.000Z",
          "Titre": "The whole thing has been useless to me",
          "Contenu": "The whole thing has been useless to me. For the amount of money I paid I could have taken numerous online courses. I haven't used any portion of MasterWriter and I will make sure to let my friends know how I feel. I don't even know how to go about getting into the course, and I'm out all that money, and it's nearly timed out. NEVER AGAIN!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 2,
          "Date": "2022-06-17T18:25:03.000Z",
          "Titre": "Long time user, but not for long",
          "Contenu": "Not a big fan of the internet subscription model. I've been using master writer for since it's beginning.  Not so much anymore.  It's not a fluid move to access program while using my daw. Stopping creating to go on internet to access program breaks my flow.  I have the cd of master writer that requires a code that Master Writer no longer supplies as they push they're current model. Thus reminds me that in order to.cancel the subscription you have to call them.  Which I shall today. Anyway not happy at all"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Silent Forest",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T18:24:06.000Z",
          "Titre": "when I use it the results are bad or none",
          "Contenu": "when I use it the results are frustrating and lacking. It steers me to cliche song ideas. In the time I have been paying for Master Writer I have used Rhymzone, even more than before and really appreciate all the features Rhymezone has, best of all it is fast and it gets me results."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T00:09:37.000Z",
          "Titre": "Not User Friendly",
          "Contenu": "I am unclear how to use it. I do not feel it user friendly. I have put words in the dictionary, and I get a message, “no match.” I put the same word in Merriam-Webster Dictionary and I get results. It’s too complicated."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T17:06:29.000Z",
          "Titre": "MasterWriter is lost somewhere deep in…",
          "Contenu": "MasterWriter is lost somewhere deep in the bowels of my computer.   I guess I have it, but I've never been able to access it.   But, it's free, and this e-mail gives me confidence that it really exists.  Somewhere."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Sajidah",
          "Nb_Reviews": 4,
          "Date": "2022-06-17T20:37:08.000Z",
          "Titre": "I didn't find anything here that MS…",
          "Contenu": "I didn't find anything here that MS Word and its thesaurus didn't provide. I really wanted it to be great, but I was not impressed. For me, it has to be faster and better than MS Word."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terry",
          "Nb_Reviews": 1,
          "Date": "2016-01-10T18:47:19.000Z",
          "Titre": "Very disapoonted",
          "Contenu": "This program is awkward and quite counter intuitive. I'd hoped to have a program that would aid me in developing stronger and more consistent storylines. Instead, I have an expensive synonym finder and that I already owned. And the double window configuration is absolutely confusing. My advice: stick with your word processor. At least then you know what to expect when you tell it to do something."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lenard Michael Black",
          "Nb_Reviews": 1,
          "Date": "2015-07-29T17:59:18.000Z",
          "Titre": "A POOR INVESTMENT AND A WASTE OF MY TIME",
          "Contenu": "Starting from day one I have never been able to use this program.  In fact, I have never been able to log in to the program's website.  Easy to use, my foot.  How will I ever know without ease of access first,  Tech support has been unresponsive.  THE COMBINATION OF NEGATIVES makes me feel ripped off and violated.  I SHOULD HAVE CANCELLED AFTER MY FIRST 3 BAD EXPERIENCES"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Stephen",
          "Nb_Reviews": 2,
          "Date": "2015-12-14T22:29:42.000Z",
          "Titre": "Whatever",
          "Contenu": "I liked the program when it was on my computer and I could access but I haven't used my subscription in over a year since they went on-line with it.  I couldn't even tell you how to access the program but I am still paying for it every month.  It just doesn't have a presence in my life.  Maybe it's my fault for not being smarter."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cindy A Zarzycki",
          "Nb_Reviews": 2,
          "Date": "2022-06-17T22:17:03.000Z",
          "Titre": "Unable to use",
          "Contenu": "Because I have never been able to use it. I have been paying monthly that I have never used. If I can be provided with the elements it offers I won't cancel it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "michealt towers",
          "Nb_Reviews": 4,
          "Date": "2021-08-03T22:01:29.000Z",
          "Titre": "I originally designed m",
          "Contenu": "I originally designed mMasterwriter. I think it's too expensive for what it does. You should spend more time writing and more time writing.Personally I don't use Masterwriter to write anything with anymore."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Henry",
          "Nb_Reviews": 1,
          "Date": "2016-03-27T00:53:41.000Z",
          "Titre": "Disappointed",
          "Contenu": "I'm a writer (books, articles, and marketing), I've tried using Masterwriter  less than ten times, once was a very good experience, the other times were awful. I couldn't make the system work for me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carol",
          "Nb_Reviews": 1,
          "Date": "2015-07-29T17:46:54.000Z",
          "Titre": "Total waste of money!!!!!!!!!!!!!",
          "Contenu": "I'm so sorry I bought the program.  I wanted a disc.  This internet based thing is for the birds.\r I have tried to get a credit but the claim is they didn't know I called.\r Oh well.  Live & learn."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rusty",
          "Nb_Reviews": 2,
          "Date": "2022-06-18T23:55:33.000Z",
          "Titre": "The software is not intuitive",
          "Contenu": "The software is not intuitive. I end up using it only for Synonyms and, even then, I often end up doing an internet search instead."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Virginia",
          "Nb_Reviews": 3,
          "Date": "2016-04-04T18:10:16.000Z",
          "Titre": "can't use this software",
          "Contenu": "I wish I had not bought this software because I haven't been able to use it. The directions are too vague, and none of my questions are answered."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cody",
          "Nb_Reviews": 2,
          "Date": "2022-08-04T21:26:35.000Z",
          "Titre": "Useless",
          "Contenu": "Useless. Grab a notebook, a pen, and Google and you're good to go."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Eamon D.",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T06:38:03.000Z",
          "Titre": "The product provides nothing.more than…",
          "Contenu": "The product provides nothing.more than you can find in a $14 paperback thesorus"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "michealt towers",
          "Nb_Reviews": 4,
          "Date": "2021-02-26T21:29:09.000Z",
          "Titre": "My name is Micheal Towers",
          "Contenu": "My name is Micheal Towers.  I am the original creator of Masterwriter.  I now believe that Masterwriter is a complete waste of time and money. Let me say it again Masterwriter is a complete waste of time and money, as are most of the features of most song writing programs. The only thing a song writing program is good for is organization and a rhyming dictionary. Other than that it's just a time-wasting tech tool.       The other big problem with Masterwriter is that you have to pay for it on a monthly basis. You should be able to buy the program and be done with it.         Another problem with Masterwriter is the design of version 3. In my opinion it really sucks. They would have you believe that all the changes in Masterwriter 3 are  major and important. In reality it's the same program as Version 2 with a few minor this and thats.         Don't be fooled! It's a complete waste of your time. Spend more time writing songs and less time tangled up in technology.  John Lennon, Paul McCartney and Bob Dylan did not have Masterwriter.  Study their songs not the technology of writing programs.       And finally the idea that you're going to write a novel or screenplay with Masterwriter is absurd."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "michealt towers",
          "Nb_Reviews": 4,
          "Date": "2021-02-25T20:45:40.000Z",
          "Titre": "My name is in Micheal Towers",
          "Contenu": "My name is in Micheal Towers.  I am the original creator of Masterwriter.  I now believe that Masterwriter is a complete waste of time and money. Let me say it again Masterwriter is a complete waste of time and money, as are most of the features of most song writing programs. The only thing a song writing program is good for is organization and a rhyming dictionary. Other than that it's just a time-wasting tech tool.       The other big problem with Masterwriter is that you have to pay for it on a monthly basis. You should be able to buy the program and be done with it.         Another problem with Masterwriter is the design of version 3. In my opinion it really sucks. They would have you believe that all the changes in Masterwriter 3 are  major and important. In reality it's the same program as Version 2 with a few minor this and thats.         Don't be fooled! It's a complete waste of your time. Spend more time writing songs and less time tangled up in technology.  John Lennon, Paul McCartney and Bob Dylan did not have Masterwriter.  Study their songs not the technology of writing programs.       And finally the idea that you're going to write a novel or screenplay with Masterwriter is absurd."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Lynn",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T09:31:37.000Z",
          "Titre": "Changing to an online only version has…",
          "Contenu": "Changing to an online only version has stopped me using your product."
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Anders",
          "Nb_Reviews": 1,
          "Date": "2015-11-29T09:15:41.000Z",
          "Titre": "Offline issue",
          "Contenu": "Program is great but I really work a lot offline so I need tha possibility badly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "michealt towers",
          "Nb_Reviews": 4,
          "Date": "2021-03-11T17:44:19.000Z",
          "Titre": "It's Micheal Towers again",
          "Contenu": "It's Micheal Towers again. Just so you remember my relationship with Songwriting Software, I built Masterwriter. These are my next comments about Songwriting Software.I do not like the new design of Masterwriter. The black design is annoying, at least it is for me.The new comments about writing songs versus building your vocabulary are a  large waste of time. I am just writing songs. I don't care about my building my vocabulary I just care about writing great songs, period!!!All songs come from life's experiences. So if you want to write better songs study your life's experiences.  Dictionaries will help you write better songs. Building your vocabulary is a nice idea but I don't use Songwriting Software to build my vocabulary I use it to aid me in writing songs.  That's all there is. Songwriting Software will not write songs but it can help you write better songs. The two things all Songwriting Programs should have, a great rhyming dictionary and a great thesaurus. These two dictionaries will help you write better songs. The mind, the imagination and the heart will help you create new songs.Songwriting Software can help you write better songs. All great songs come from the imagination, that's it. Writing dictionaries will help you write better songs. I wrote the dictionaries in Masterwrter and in the building of these dictionaries, it grew my vocabulary but it did not help me to write songs. Remember in the end, it's all about writing songs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JOHN CHOWNING",
          "Nb_Reviews": 2,
          "Date": "2022-06-16T23:36:36.000Z",
          "Titre": "I found the app cumbersome and not that…",
          "Contenu": "I found the app cumbersome and not that helpful."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christopher Oak",
          "Nb_Reviews": 1,
          "Date": "2015-07-29T18:41:41.000Z",
          "Titre": "Who needs it?",
          "Contenu": "There are other resources much more expansive and helpful..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J.A.Terlizzi",
          "Nb_Reviews": 2,
          "Date": "2022-06-26T17:15:35.000Z",
          "Titre": "I want to cancel immediately",
          "Contenu": "Poor communication and access"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bart",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T23:46:00.000Z",
          "Titre": "Don't use it",
          "Contenu": "Don't use it."
        },
        {
          "Note": 2,
          "Lieu": "NO",
          "Pseudo": "Bo",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T19:49:09.000Z",
          "Titre": "Unsure",
          "Contenu": "Still debating with myself whether this was strictly necessary…To be honest, it can be a useful tool for poets or songwriters."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Don Trufan",
          "Nb_Reviews": 5,
          "Date": "2023-07-21T00:21:34.000Z",
          "Titre": "Incorporate AI in the system.",
          "Contenu": "Incorporate AI in the system.Have a selection for Clichés.Lyric studio is what I have been using.Much more song writer user friendly with a lot more final solution."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-05-19T23:05:24.000Z",
          "Titre": "This software has too many bugs in it",
          "Contenu": "This software has too many bugs in it. One example is the default font is set at 14. When I change the font to what I am using, which is typically 16, it goes back automatically to 14 on the next line. So literally I have to change the font each line I write. This is very frustrating with this software. Frankly I would do better with Microsoft Word. That's just One problem"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mitch Jacobs",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T05:10:23.000Z",
          "Titre": "So far...program is of no use",
          "Contenu": "Just getting started and finding the interface confusing. So far, the program has been of no use. The tutorials were not particularly helpful. I don't see any value added. I hope that will change if I figure out how to use it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customerJCS",
          "Nb_Reviews": 3,
          "Date": "2023-06-17T13:48:06.000Z",
          "Titre": "mostly old fashioned",
          "Contenu": "The phrases are mostly old fashioned. The rhymes are not as deep or fresh or modernas rhymewave, for one example.  So far in several attempts to write with Master Writer I have found it did not speed up my writing at all"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Brigette",
          "Nb_Reviews": 5,
          "Date": "2023-07-24T23:20:01.000Z",
          "Titre": "Disappointed",
          "Contenu": "I’m not sure if I’m at fault because I’m incorrectly using it, but I just don’t find it useful."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Patricia",
          "Nb_Reviews": 2,
          "Date": "2022-08-05T00:27:39.000Z",
          "Titre": "I honestly quit using MasterWriter…",
          "Contenu": "I honestly quit using MasterWriter months ago and canceled my subscription (so it wouldn't renew). I found the navigation cumbersome and time consuming to use. The word suggestions were nothing better than I could find on free resources like Word Hippo or other Thesaurus services. Sorry."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Danielle Bussone",
          "Nb_Reviews": 2,
          "Date": "2022-09-18T13:18:29.000Z",
          "Titre": "Not impressed",
          "Contenu": "So far, I haven’t found this program to be any better than my free thesaurus. However, I’m still learning how to use it. Perhaps I haven’t yet learned its full functionality."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Johnny Byrne",
          "Nb_Reviews": 1,
          "Date": "2022-12-31T19:18:02.000Z",
          "Titre": "Better for poets/songwriters than novelists",
          "Contenu": "I think if you write songs or poems, MasterWriter will help, but for my writing, my £10 buy-once dictionary apps are much better."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bruce",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T21:50:35.000Z",
          "Titre": "Discontinued using the program",
          "Contenu": "Used it as a thesaurus. Often didn't have terms usually found in a good thesaurus. Discontinued using the program."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-25T15:43:30.000Z",
          "Titre": "Difficult to navigate",
          "Contenu": "Difficult to navigate, having to go online to use is a hinderance, results sometimes in sentence form making    it difficult to peruse.  Not nearly as powerful as advertised."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "walter",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T03:58:51.000Z",
          "Titre": "I already knew the synonyms you came up…",
          "Contenu": "I already knew the synonyms you came up with."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 2,
          "Date": "2022-08-15T23:42:12.000Z",
          "Titre": "I have been kind of disappointed with…",
          "Contenu": "I have been kind of disappointed with MasterWriter because it really doesn't help with the creative flow like I wanted and I found the rhyming word program not having a big enough choice and the other sections not inspiring."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Sarah Syrja",
          "Nb_Reviews": 2,
          "Date": "2023-03-09T04:44:52.000Z",
          "Titre": "I couldn’t seem to save things properly…",
          "Contenu": "I couldn’t seem to save things properly abs lost a lot of work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Doug",
          "Nb_Reviews": 3,
          "Date": "2022-06-24T02:19:13.000Z",
          "Titre": "I've been using MasterWriter for a…",
          "Contenu": "I've been using MasterWriter for a couple of years now and it's been helpful with my writing, but I'm able to find most of the tools MW offers me online for free now (synonyms, thesaurus).  The $99.99 yearly fee has become too expensive for what the program does.  I hope MasterWriter considers lowering the subscription costs in the future."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Mark",
          "Nb_Reviews": 3,
          "Date": "2022-06-16T23:58:42.000Z",
          "Titre": "No good for Duo's",
          "Contenu": "It's as good as any of the others available, however, it does not allow you to collaborate with other writers, in fact if you try and join forces with your song writing partner it disconnects you. I contacted them to ask if there was a premium feature so two writers could be on at the same time, they informed me that it was not possible even as a paid feature."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Laraine",
          "Nb_Reviews": 2,
          "Date": "2022-06-17T16:18:09.000Z",
          "Titre": "Not exactly what I thought it was",
          "Contenu": "Sometimes helpful. Sometimes not. Synonyms provided aren’t always applicable to the nuanced meaning of the word im using. I may not be using it correctly but often  find myself googling for a word that better fits. In some functions i find phrases that have been indicated for usage of other unrelated terms. I rarely use & won’t  renew"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Talitha",
          "Nb_Reviews": 1,
          "Date": "2022-07-03T13:03:08.000Z",
          "Titre": "Good in theory",
          "Contenu": "I like the concept, however it doesn’t work well across different devices. Also wish I could just click the word/phrase I’m searching and it insert to my doc.  Colour scheme is also not very accessible for people with vision impairment, even with colours inverted."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike Mosall",
          "Nb_Reviews": 7,
          "Date": "2022-07-21T18:56:40.000Z",
          "Titre": "Tried It for a Month and Found No Advantage",
          "Contenu": "Tried it for a month and did not see any real advantage.  Clunky interface and a very limited thesaurus.  You can find the same things online for free (with advertising).  Good that they give you a free trial so you can find out for yourself."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joseph Lewis",
          "Nb_Reviews": 2,
          "Date": "2022-06-24T14:27:15.000Z",
          "Titre": "Not a user-friendly app no direction on…",
          "Contenu": "Not a user-friendly app no direction on how things work a waste of money. I have found a better app that is user-friendly and explains your options and how to use it.I do not recommend this app try Pro Writing or Auto Crit"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 2,
          "Date": "2022-06-16T23:33:09.000Z",
          "Titre": "I liked the program much better before…",
          "Contenu": "I liked the program much better before it became online.  I preferred the older format and layout when it was local on the device.  They turned what was a streamlined unique app into a cumbersome experience."
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "Amanda",
          "Nb_Reviews": 5,
          "Date": "2016-07-22T13:29:39.000Z",
          "Titre": "Great programme but some drawbacks",
          "Contenu": "The dictionary and writing aspects of this programme are excellent.But as someone who has come from their previous set up (all your writings are stored on your own machine), not having the lyrics on your own pc is inconvenient at best, annoying and useless at worst.If I can't get online, I can't access my lyrics - not good enough for $10 a month -sorry."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2015-07-30T04:03:59.000Z",
          "Titre": "Not much to write home about",
          "Contenu": "I was billed too early, before my subscription ran out. I just find that Masterwriter is so limiting as I have to be online all the time. It isn't as helpful for writing as it leads us to believe. Masterwriter is best for songwriters and poets. I also get tired of entering my password every single time I log on. I don't think I will renew"
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Francis",
          "Nb_Reviews": 2,
          "Date": "2015-07-31T09:14:17.000Z",
          "Titre": "Not good to work on line in India",
          "Contenu": "I had been using Master writer 2 for quite long. It is ok for me to work offline without any external pressures. With version 3. I have to leave it on-line and wait for a spark, which doesn't happen that often. So I prefer to scribble my ideas on the version 2 and proceed with it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2015-12-07T22:34:40.000Z",
          "Titre": "No Time To Learn",
          "Contenu": "I think it's got great potential.  I liked what I saw when I reviewed the process however as I researched to way to use the process, I didn't have time to complete or really get started on how the Masterwriter process works.  I will learn as soon as time allows."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "pat",
          "Nb_Reviews": 2,
          "Date": "2016-06-24T20:32:48.000Z",
          "Titre": "Needs work",
          "Contenu": "the fact that I can't work on my content offline is a deal breaker. I get the facility of an online interface, but what about those of us who travel and are not always sitting in comfortable chairs waxing poetic about the Porsche in my driveway."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott Sanders",
          "Nb_Reviews": 3,
          "Date": "2015-07-29T17:33:48.000Z",
          "Titre": "Boring",
          "Contenu": "The program is useful, but it has no interface imagination and is uninspiring. Yes, there are good tools to be used, but quite frankly, it's as if we have been given 88 piano keys encased in a rickety of stand-up piano body that is ugly and uninspiring. Yes, it plays and plays well, but one almost forgets it is there because of the plain, boring nature of its interface--which is not very inspiring either.\r I like programs that give me clear understanding of how to use it.\r MasterWriter has good tools and database. It's just boring and uninspiring as a platform or interface. It doesn't need to be."
        },
        {
          "Note": 2,
          "Lieu": "BE",
          "Pseudo": "Laurence Daykin",
          "Nb_Reviews": 15,
          "Date": "2016-01-09T12:45:23.000Z",
          "Titre": "LIMITED USE FOR ME",
          "Contenu": "I purchased Masterwriter on the recommendation of and a special deal with ProWriting Aid, the later is an excellent piece of software. However Masterwriter has limited value for me as a novelist. It is complex and I found it unwieldy. I've tried out the synonyms and there are free dictionaries that are more powerful. For example, I entered 'thunderstorm' into synonyms and it returned nothing, although the phrases returned 'caught in a thunderstorm'. It provides an easy way of doing research but that for me that is not worth the $49.95. I can quite easily use the internet and Wiki without an intermediate interface.\r It's possibly good for song writers, but I doubt the utility for novelists."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "joanna",
          "Nb_Reviews": 4,
          "Date": "2015-07-29T17:48:50.000Z",
          "Titre": "Unmet potential",
          "Contenu": "you have the potential of being useful to all songwriters but you do not have export capabilities, other than cut and paste, and no easy way of sending to co writers, or backing up to Dropbox. The program is not easily compatable with text commands on iPad, cut and paste, and freezes at times...\r Cowriters tell me they don't use masterwriter because they can find what they need on Internet....when you are competing with \"free\" you need to demonstrate excellence, and easy compatibility. \r I don't think you have a dictionary of opposites, highly useful.\r The fact that you can only access with Internet is limiting.\r If you can overcome the limitations I'd be tempted to give it another try..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ed Draper",
          "Nb_Reviews": 1,
          "Date": "2015-07-30T01:23:58.000Z",
          "Titre": "A Devolving Product",
          "Contenu": "I think many good features of MW2 are no longer available in the web edition. What happened to the built in drum loops of various styles? I wish there was a text scroll option while recording - so many of my demos have breaks where I'm not playing or singing because I'm scrolling down to read the rest of the lyrics.\r I've found it impossible to be productive on the mobile version. I never use this. If I worked for MW, I'd make an app with a voice recorder...maybe text-to-speech enabled. I would never \"type\" lyrics using the phone keyboard because I find editing to be very tedious using this input method. It does work well at synching when I get back to my laptop, and I think that's great - but ultimately useless for my purposes.\r I'm upset with myself because I continue to pay a yearly fee to use a product that seems to progress backwards in time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "BILL",
          "Nb_Reviews": 2,
          "Date": "2022-06-16T23:35:36.000Z",
          "Titre": "Cannot navigate the software",
          "Contenu": "I simply cannot figure this software out.  Therefore, it is absolutely useless to me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Merle",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T00:34:46.000Z",
          "Titre": "I can’t get my songs to print from the…",
          "Contenu": "I can’t get my songs to print from the app.!! They say its me??"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Esther Cohen",
          "Nb_Reviews": 2,
          "Date": "2022-07-26T20:42:09.000Z",
          "Titre": "Really don’t care for it",
          "Contenu": "Really don’t care for it, it’s not l thought it would be"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2016-01-03T18:00:04.000Z",
          "Titre": "An online copy of The Synonym Finder by J.I. Rodale",
          "Contenu": "I've stopped using it. Using The Synonym Finder is easier for me."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2022-06-16T23:31:26.000Z",
          "Titre": "never felt any reason to use it"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Not For Me",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T00:11:44.000Z",
          "Titre": "It will suit some.",
          "Contenu": "I didn't find that it added any value. I tried entering phrases and it would tell me nothing was available. What I did love is that one of the owners followed up with me regarding why I didn't feel there was value. Turns out, I thought it could do one thing when it was designed for another. I can see it being helpful for others."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mashaw",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T21:18:01.000Z",
          "Titre": "trouble figuring it out",
          "Contenu": "I'm having trouble figuring it out. Is there a tutorial somewhere that goes into specifics? Or something like a troubleshooting guide where needs can be addressed?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ross",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T18:33:09.000Z",
          "Titre": "One problem",
          "Contenu": "I like the program overall...BUT...I use it every day and more than once have come up with a fairly common word that has no synonym. You need to fix this..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sipora",
          "Nb_Reviews": 6,
          "Date": "2023-10-08T22:50:41.000Z",
          "Titre": "Looking for greater ease",
          "Contenu": "I would like more correspondence for metaphors, etc. For example, if I need another way to say something like \"a penny saved is a penny earned\" I don't want to have to look through a list of unrelated cliches."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Lana McMahon",
          "Nb_Reviews": 3,
          "Date": "2023-08-25T01:08:45.000Z",
          "Titre": "Syllable Counting and Rhyme Colour Coding",
          "Contenu": "It would be helpful if each sentence could count the number of syllables, or if we could manually enter the number of syllables (singers may bend words to have more or less syllables). Would also be good to colour code words then we can identify rhyming patterns/ sequences."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Denise",
          "Nb_Reviews": 5,
          "Date": "2023-11-02T21:44:50.000Z",
          "Titre": "I found it difficult to use when…",
          "Contenu": "I found it difficult to use when needed. It failed to provide adequate feedback or I could just be challenged.  I don't like it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T22:00:07.000Z",
          "Titre": "I just completed my book",
          "Contenu": "I just completed my book. I used MasterWriter sometimes. I relied on other apps for more substantial help. Perhaps when I start my next book, I will use it more."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pierce",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T18:58:52.000Z",
          "Titre": "Could Use Improvement",
          "Contenu": "overall I find masterwriter to be helpful but a couple things could be improved. For one I'd like to have more than one project open in my browser at a time in different tabs/windows without being logged out. Secondly there should be options to change font colors, bold and italicize text to help with organization"
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Raymond",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T01:21:42.000Z",
          "Titre": "Useful but limited",
          "Contenu": "I really believe this is a useful writing aid; however, for my needs it is rather limited."
        },
        {
          "Note": 3,
          "Lieu": "NO",
          "Pseudo": "Kyrre Sæther",
          "Nb_Reviews": 13,
          "Date": "2023-07-07T13:32:00.000Z",
          "Titre": "A little pricey and limited in features",
          "Contenu": "It's a useful tool for me as a songwriter, but I wish there were even more, in-deapth tools and more extensive rhyming and other content, tbh. The price is just above what you'd expect for what you get."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris Miller",
          "Nb_Reviews": 2,
          "Date": "2023-02-21T14:50:18.000Z",
          "Titre": "I love that somebody has developed a…",
          "Contenu": "I love that somebody has developed a tool for writers! The rhyming dictionary is so helpful. I would like to see more display and print options. It becomes hard to use it when recording on a DAW. I suppose I could use a tablet with MW on it but with 2 screens for recording another screen to manipulate while recording is not an easy task.  If there was some way to minimise the screen to use as an overlay or work with DAW companies to use as a VST to use within their software that would be very useful. My current option is to print the lyrics and use paper the old fashion way."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas Oehmler",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T11:33:58.000Z",
          "Titre": "MasterWriter after use for about 2 months",
          "Contenu": "I’ve been using MasterWriter for about 2 months.  It’s a fine “application” but not great.  What this website (yes website, not application) needs is a good competitor.  MasterWriter can be very funky and even annoying in how it performs basic functions - think Microsoft Word in the 1990s; it has a long way to go to be great.  An example, the search bar at the top has an “x” to delete current searches. You better have super accurate finger attack because it requires pinpoint accuracy to clear your current word search.  I routinely have to touch the “x” 4 or 5 times to erase my current search to clear it for a new search.   There are some cool functions, like organizing projects, Word Families and Speech Types.  I find myself too often going to Rhymezone for basic things like looking for synonyms by rhythm pattern (accent/unaccent) and for a broader array of rhymes.  When a viable alternative comes around I will be very open to a change."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 2,
          "Date": "2023-02-13T20:17:30.000Z",
          "Titre": "Company has changed",
          "Contenu": "I've been with MasterWriter from the beginning of their company.  Which wasn't subscription.  I personally do not like the subscription model especially for this product.   There are times where I need to use this product and internet connection was sketchy.   Don't like being tethered to the internet.  That's why I gave the rating I gave.  If a product appears on the market that's not tethered to the internet, where you pay for the product once,  I'm all for it!"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T21:27:08.000Z",
          "Titre": "it's ok",
          "Contenu": "it's ok, the interface is hit or miss, the web access is single only.To elaborate on it's ok, there is a decent amount of word choices to help you write lyrics in different styles. To elaborate on the interface, it is all web page based and there is no right clicking so a lot of the time you have to click and hope that you've been able to select the word for it wot be used as the seed for whatever lookup/function you're trying.  The interface is responsive (changes) in both tablet and phone but the menu system is clunky in providing options.To elaborate on single only, if I'm working on my pc at home but go out and need to do something quick on my phone it logs me out of home which is not helpful i.e. I left it open at home for a reason, and it wasn't to cheat anyone out of paying a subscription."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Miramar Postal Plus",
          "Nb_Reviews": 2,
          "Date": "2022-08-12T01:16:15.000Z",
          "Titre": "It not you, it's me.",
          "Contenu": "I don't think this software is for me. I have had the program for a year, and I may have even signed for a 2 year subscription, bit I am unlikely to renew. The interface looks a little dated and really doesn't give me much more power in its layout to justify using it over software like Word, which I already bought, and can use juat as robustly. But I have used that software for a very long time. This may be a good tool for people who need another perspective to write."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T16:20:04.000Z",
          "Titre": "Super slow to connect and to work on",
          "Contenu": "Super slow to connect and to work on. Bad connection from any device (computer,macpro,iPad,iPhone) via 4g or optic fiber. Would be so great to have a software offline version. Otherwise great tool ! I recommend"
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "JazzFR",
          "Nb_Reviews": 1,
          "Date": "2022-12-24T10:12:22.000Z",
          "Titre": "Not for me...",
          "Contenu": "I subscribed for a month before cancelling. The  dictionary/thesaurus was too focussed on American phrases and sayings, which didn't suit me.I have other tools which perform most of the same functions as Masterwriter without having to pay for a subscription."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mauricio",
          "Nb_Reviews": 2,
          "Date": "2023-08-22T15:46:09.000Z",
          "Titre": "Needs more content to complete…",
          "Contenu": "Needs more content to complete songwriting. Rhyme issues or lack thereof, phrase issues or lack thereof etc...etc..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Teresa",
          "Nb_Reviews": 3,
          "Date": "2023-01-05T21:40:52.000Z",
          "Titre": "Wish it was easier to figure out.",
          "Contenu": "I like the idea of Master Writer, but I'm having difficulty figuring out its best and highest use. It seems like I get a lot of the same responses for the same words, and it doesn't make any sense."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Dennis",
          "Nb_Reviews": 4,
          "Date": "2023-02-15T03:51:21.000Z",
          "Titre": "It is excellent but a long way from being modern and having utility.",
          "Contenu": "It is excellent, but unlike the trends, it is a program in isolation, so it gets much less used than it should. As they have poor thesauruses, it should plug into Word processors, ProWritingAid, or other checkers. It is not convenient and not integrated into my activity. Therefore, what it does, is costly. Grammarly sits on top of whatever I write. So should Master Writer. It should offer alternatives to many overused words. It needs to check the work, not be a passive blob waiting to be used. I have used it for years and have seen it as a program fall behind as others have raced ahead in usefulness.Since Chat GPT and Bing, it makes the search for alternate words and ways of expressing a concept so much easier for me as a writer. This will make it even harder for Masterwriter. The best result for me as a writer would be for Masterwriter to be available in Grammarly. Grammarly offers alternate words, but its thesaurus is poor. I only need the thesaurus, I rarely use the other features of Masterwriter other than perhaps word definitions. AI is making research and so many parts of being a writer so much easier. When I first reviewed Masterwriter I gave it five stars but the world has moved on."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Long time customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-17T07:16:43.000Z",
          "Titre": "I think overall it's good but it's…",
          "Contenu": "I think overall it's good but it's about writing and think it should include all manners of descriptive words, dark and negative sides, vulgarity (maybe have a button where you can flip to explicit or clean), etc.....I and many others tend to write on the darker side of things and most of masterwriter is very general on the happier side of phrasing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sandra Brown",
          "Nb_Reviews": 5,
          "Date": "2023-01-04T23:06:53.000Z",
          "Titre": "I have not been able to see the…",
          "Contenu": "I have not been able to see the difference between the tools offered to me through MasterWriter and the standard tools that I have on my computer. Please help me see why I should renew this service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Timothy",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T18:49:44.000Z",
          "Titre": "i am really disapointed that when I…i try to look up phrases",
          "Contenu": "i am really disapointed that when I type in a word the phrases do not come up.  Maybe I am doing something wrong. But I had to go back to google to look up phrases for a word or how they are used in a sentence"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2022-08-12T01:28:28.000Z",
          "Titre": "Useful program, but...",
          "Contenu": "This is a useful program, but I prefer buying this type of software outright rather than on a subscription basis. I won't continue using the program because of this."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2022-08-09T00:08:45.000Z",
          "Titre": "When I first saw this years ago it…",
          "Contenu": "When I first saw this years ago it looked very refreshing. However, since I’ve signed up for the service, it appears very sluggish. Seems like the software and service needs a good overhaul."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Janet",
          "Nb_Reviews": 2,
          "Date": "2023-03-16T18:46:22.000Z",
          "Titre": "I like the program except for the fact…",
          "Contenu": "I like the program except for the fact I am unable to open a download onto My Documents. It says it is there, but will not open. So far I have not written a lengthy piece, but this would be a problem if I do!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pieter Blikslager",
          "Nb_Reviews": 8,
          "Date": "2022-10-14T02:56:20.000Z",
          "Titre": "No easy miracles for songwriters here.",
          "Contenu": "I think I bought into this helping me write better songs - which isn’t possible for a computer program."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-04T21:10:34.000Z",
          "Titre": "I have not tried the product yet had a…",
          "Contenu": "I have not tried the product yet had a computer issue and needed to reinstall so I lost the download, and any time I didn't get to use the service"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Megan Casteo",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T12:38:20.000Z",
          "Titre": "MasterWriter is now just a website NOT an App.",
          "Contenu": "MasterWriter does have a lot of useful features for songwriters / lyricists BUT the decision to switch to a web only format – basically MasterWriter 3.0 is now just a website (not an app like MasterWriter 1.0 and 2.0 were) is a huge mistake. Most creative types need to get away from the distractions of the Internet to find their inspiration and do not want to be glued to it night and day. Bizarrely, MasterWriter 3.0 simply cannot be used without an Internet connection!  It is also hopeless trying to use MasterWriter 3.0 on a mobile phone as those screens are far too small to be able to do much with it. I am not the first person to feel this way. Many colleagues I know who loved MW have given up on it and switched to apps like Rhyme Genie etc. I hope the nice folks at MasterWriter are hearing this feedback about the website only shortcomings and will soon update MasterWriter 3.0 – or create a version v4.0 – to combine the essential usefulness of an app with that of a website. I really like the simple utilitarian design and look of MasterWriter. I just hope they bring it back as an app instead of just a website.REPLY TO MASTERWRITER'S REPLYBeing an online only website also comes with many disadvantages too. Most songwriters prefer to be 'offline' when creating and composing. The Internet is a huge distraction to the creative process. Please reconsider your stance and create a software version rather than it just being a website users have to pay to access.As for using on the phone? Phone screens are simply too small to be practical for this purpose. Even when using a laptop with MasterWriter the available screen size available is too small as it is split in half and feels very cramped compared to writing on Word documents for instance. So to be honest, it just feels gimmicky even having a phone app for this programme. Just a way of trying to justify the price of the subscription website only model that is being pushed."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "DAVID JOHN WHEELER",
          "Nb_Reviews": 5,
          "Date": "2022-08-05T03:27:36.000Z",
          "Titre": "useful",
          "Contenu": "useful if you are on-line - could be improved to include thesaurus of emotions and traits"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TERRENCE",
          "Nb_Reviews": 2,
          "Date": "2022-12-30T14:24:29.000Z",
          "Titre": "The service is helpful",
          "Contenu": "The service is helpful. Two recommendations 1) make access less clunky; 2) expand the vocabulary.Thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 3,
          "Date": "2023-03-16T16:30:01.000Z",
          "Titre": "I haven't used it yet",
          "Contenu": "I haven't used it yet.  I have a writing project coming up and I'll try it then."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Allister",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T20:52:37.000Z",
          "Titre": "Not sold on the value for its subscription price",
          "Contenu": "I'm not entirely sold on MasterWriter being a subscription service.  Nothing about the product ever changes.  Sure, I agree that it's useful having MasterWriter and my catalog of songs \"in the cloud\", but that's about all that justifies a subscription, and the cost of this subscription is high for what it offers."
        },
        {
          "Note": 3,
          "Lieu": "IE",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T21:06:08.000Z",
          "Titre": "Masterwriter is a good app",
          "Contenu": "Masterwriter is a good app, well designed and very useful, however, I personally like to work offline and that's no longer possible. I'd love it if they released a proper mobile app that could work offline.I also find the cost prohibitive. I'd prefer to pay monthly and not be penalised for it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T23:39:40.000Z",
          "Titre": "As a beginner song writer",
          "Contenu": "As I use your software as a beginner song writer I found the rhymes, phrases and word families lacking.  I was hopeful it would help me to find the right words but I suppose my expectations were a little too high.  I use OneNote and google search to accomplish the same things.  This is just my experience as someone working to learn to write songs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roger Owens",
          "Nb_Reviews": 5,
          "Date": "2022-06-25T00:07:54.000Z",
          "Titre": "Your customer service doesn’t answer…",
          "Contenu": "Your customer service doesn’t answer the phone, pretty poor if you ask me. Tried to update my subscription with a discount, no response. I received a response the next day both here and on the phone from MasterWriter.While I was disappointed in how they handle customer service, over the phone, I want to clarify I love the software and think it is very helpful to lyric writing overall."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Al Rutgers",
          "Nb_Reviews": 2,
          "Date": "2022-06-17T20:54:37.000Z",
          "Titre": "Thesaurus is easier to use",
          "Contenu": "I have to say I made an error in posting a review of 1 star with the comment below. “Thesaurus is easier to use. Not worth the money”Masterwriters customer service people reached out to me and after discussing with them my review I have to admit that I did not give the product a proper road test and that I reviewed it based on a cursory use of the product. I will give the product a more robust trial and provide more meaningful feedback."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Denis",
          "Nb_Reviews": 1,
          "Date": "2022-06-23T23:49:16.000Z",
          "Titre": "Hasn't been practical for me.",
          "Contenu": "I've had very little use of your product for the following reasons;1- It doesn't work properly on safari (Mac).2- I have to be online to use it and there is a lot of time that I am not online.3- I tend to write when I am away from the studio, sitting in a coffee shop, out in nature or by the beach.4- Not particularly Mac-like, so I find it a little awkward to use - not so user-friendly.5- Your email reminded me that I have a license for the product and haven't made good use of it.   :-("
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Curtis",
          "Nb_Reviews": 1,
          "Date": "2022-06-23T23:37:13.000Z",
          "Titre": "Using/navigating MasterWriter for maxium potential - Not sure?",
          "Contenu": "Every time I use MasterWriter, I feel like I am missing something. Yet, I don't want to give up on it; I am using it wrong, or it's not intuitive. I realize the two are not the same, but I got Grammarly around the same time I got MasterWriter. As a tool, I use Grammarly so much more."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Bean",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T21:51:05.000Z",
          "Titre": "It's a means to an end",
          "Contenu": "It's a means to an end - I think there's a couple of things that it misses that could make it a 4* or even a 5* on an ergonomic level. The audio recording features seems it could be better.But with all that said I have found that having access to it has increased the amount I am writing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "karole",
          "Nb_Reviews": 3,
          "Date": "2023-06-02T01:50:54.000Z",
          "Titre": "I think research information is…",
          "Contenu": "I think research information is limited; also writing techniques for beginning screenwriters"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jeffrey Moore",
          "Nb_Reviews": 3,
          "Date": "2022-06-17T17:35:03.000Z",
          "Titre": "The problem with this version",
          "Contenu": "The problem with this version, unlike my last, is that one has to be online to use it. It remote areas, or during power outages, I cannot use it. I would much prefer downloading it directly onto my computer, as it was previously. So I definitely will not be renewing this version."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JOHN",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T04:22:36.000Z",
          "Titre": "Middling",
          "Contenu": "Masterwriter has no synonym for the word 'okay' which is how I rate the software. Instead I'm giving a middling review because the website has been of middling use to me. Often I'll use an online thesaurus for free when masterwriter doesn't recognize the word or has a limited list. I would see more value if I was using it for rhyming. I don't use the other sections such as 'speech types' and 'the world' since direct web searching is more useful for those.I don't regret buying a subscription, but I won't be renewing it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Curt",
          "Nb_Reviews": 1,
          "Date": "2022-07-22T20:57:32.000Z",
          "Titre": "A good pocket thesaurus beats this…",
          "Contenu": "A good pocket thesaurus beats this so-called tool hands down. If I could get my money back, I'd be thrilled. The software is not really useful, it's not convenient to use, and it was completely overrated by its seller. TOTALLY UNAMUSED!!!!!!- I was completely blindsided by the reply I received from Master Writer after having posted the above review. I received a most cordial letter apologizing for my dissatisfaction with the product...AND a full refund of my purchase price. I commend them for their integrity even if I was unhappy with the product and amend my former rating of one star to a neutral three stars. But their integrity actually deserves five stars. -C.C."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-06-16T23:44:09.000Z",
          "Titre": "Need side by side version views with the ability to edit between them",
          "Contenu": "It would be much better if I could compare different versions side-by-side. As things stand, if I want to do that, I have to use a word processor or text editor. It would be nice to do everything within masterwriter, but that’s not possible right now."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Spencer",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T01:38:13.000Z",
          "Titre": "The interface is not very intuitive",
          "Contenu": "The interface is not very intuitive. It would be nice to have a smoother more predictable path to use the tools. It is distracting when trying to create and explore an idea only to  get caught up in where do I go now to find the answers."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Paul Brown",
          "Nb_Reviews": 4,
          "Date": "2022-06-24T11:34:48.000Z",
          "Titre": "Too expensive, particularly as a subscription service.",
          "Contenu": "Master writer is a convenient tool, however it is very expensive for what it is. It isn't easy to cancel either. I assumed that the subscription would end and I would be notified when it was due for renewal but this was not the case. I tried to find ways of cancelling prior to the first year ending, however it wasn't until after it auto renewed that I found the option. Maybe this was user error though.If the price for one year was a permanent price, I would be rating it much higher, but even then it's quite expensive.After receiving a reply from masterwriter and noting some good points made by them, I have refectled upon my review and adjusted."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mr Pakipot",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T01:51:48.000Z",
          "Titre": "Basically, the American Hertiage Dictionary & Thesaurus",
          "Contenu": "I already owned the American Heritage Dictionary and Thesaurus disk, and that's pretty-much exactly what this site offers for a screenwriter/novelist.However, the site/program would be helpful to a song writer or poet."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Anthony Duignan",
          "Nb_Reviews": 3,
          "Date": "2022-08-12T10:49:57.000Z",
          "Titre": "Very few information bulletins",
          "Contenu": "Very few information bulletins, not what I expected from this service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gabriella",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T15:50:13.000Z",
          "Titre": "I will NOT be renewing my subscription",
          "Contenu": "I will NOT be renewing my subscription. I didn't find it as useful as I had expected. It does have some great features and it has helped in some instances, but it isn't as comprehensive as I expected it to be."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Jacques",
          "Nb_Reviews": 3,
          "Date": "2022-06-24T15:36:08.000Z",
          "Titre": "Might work for some, but not for me",
          "Contenu": "Nah. Didn't help me write a single song and I've written over 100 of them. Thought it might bring a different approach or twist to the process. I had no luck with it. Just not the way my brain works."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Drew",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T16:40:30.000Z",
          "Titre": "Love it but need Mac/iOS apps",
          "Contenu": "I love MasterWriter, but I really need there to be an app for Mac and ideally also for every other device - being able to access my songs offline and on any device is an absolute necessity."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Freewheeling Freelancer",
          "Nb_Reviews": 2,
          "Date": "2022-06-24T04:33:16.000Z",
          "Titre": "Fine product, but not for everyone.",
          "Contenu": "This seems to be a fine product for its intended user. Thanks to the easy learning curve, I found out quickly that MasterWriter is not intended for authors who write and revise as I do."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Jenny",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T08:18:32.000Z",
          "Titre": "Found my old version of Masterwriter…",
          "Contenu": "Found my old version of Masterwriter easier to use and of course, I owed my copy and didn't have to worry about paying monthly (But I guess all companies have gone to subscription now)"
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Greg Van Kerkhof",
          "Nb_Reviews": 3,
          "Date": "2022-06-17T08:54:37.000Z",
          "Titre": "Great features, but not enough to justify its subscription model.",
          "Contenu": "As a freelance songwriter I use Masterwriter every day. It's a powerhouse of creative tools. But I feel like it's either missing features that other free services have (like Rhymezone's Descriptive Words feature) or certain features just don't work as expected, for example, the Word Families dictionary tab seems useful, but most of the time it doesn't come up with any results. Or how spell check underlines incorrect words, but when I right click I just get a paste option that doesn't even work.I love this app,but considering how I haven't seen a single update or bug fix in the months I've been using it, its pricing shouldn't be a monthly subscription. This is definitely an app that I should be able to purchase a lifetime license for."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Alison Darley",
          "Nb_Reviews": 6,
          "Date": "2022-06-21T13:27:02.000Z",
          "Titre": "Useful tool but would also appreciate a…syllable count would be helpful",
          "Contenu": "Useful tool but would also appreciate a syllable counter and chord recognition- like the songcraft website.  Option to share and live real time collab on documents would be amazing toi"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Clay Coins",
          "Nb_Reviews": 3,
          "Date": "2022-06-16T23:53:56.000Z",
          "Titre": "A huge improvement over using google",
          "Contenu": "A huge improvement over using google, but it feels hard to use at times. Almost like there is a limited database of words where it will give you the same output as their sales video."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "FITZROY, D.",
          "Nb_Reviews": 4,
          "Date": "2022-06-16T23:52:17.000Z",
          "Titre": "Master Writer is a sophisticated…",
          "Contenu": "Master Writer is a sophisticated dictionary and Thesaurus.  It has been a big help in diversifying my vocabulary and in improving my word selection.  Other than that, I do not get much help from it.  The help may be there but I am not one to spend hours teaching myself new software.  For example, as far as I can tell, the subcategories of Word families, Phrases, Speech types and the World serve a function but there is no help category to explain the purpose of those subcategories and how to use them.  The filter section is useful for nouns and verbs and useless for other categories like The World, but maybe I do not know how exactly to use it.  Strongly suggest you offer newcomers to your product a help/guide document that takes them through the various options of us that Master Writer offers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Caron",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T00:08:24.000Z",
          "Titre": "Okay",
          "Contenu": "It hasn’t proven to be very useful for fiction writing. I do see how poetry and music writers might love it. If it had metaphors and other figures of speech I would give it a five."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DD",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T03:31:57.000Z",
          "Titre": "It's a good product... but used to be a great product.",
          "Contenu": "I have used MasterWriter for years, and only recently canceled my subscription. It's a solid product and has a lot under the hood for songwriting - the phrase rhyming was something I found extremely useful and have yet to find a good alternative elsewhere.Ultimately, I ended up canceling because I just don't like the feel of writing in a web view and always requiring an internet connection. I miss the old Version 2 that was an actual piece of installable computer software instead of just a website. I understand the push toward a website instead of offline software because it makes having a monthly subscription much easier, but it's just not as enjoyable to use personally.If I could buy it for life, I would do so. But as it sits right now, I just don't feel like the subscription is worth it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 4,
          "Date": "2016-08-05T23:28:58.000Z",
          "Titre": "Offline Access",
          "Contenu": "Master Writer is the best online writing tool out there, but without offline access it is very limiting. There are a host of circumstances that could prevent one from utilizing the many aids available to artists during the creative process. You were the best offline writing toll out there, in your attempts to reach everyone you left behind what made you great to begin with. Why not have the best of both worlds?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pumpkinhead",
          "Nb_Reviews": 2,
          "Date": "2016-09-04T12:39:40.000Z",
          "Titre": "Awesome START",
          "Contenu": "The function of the program does what it needs to do but there are some obstacles in the way for a seamless experience. For instances the spell check is so awkward to use and I'm being nice. It slows any flow you have going but for the shake of time the core program is excellent. It does what it's suppose to do, very well. I'm sure in time the proper tweaking will make this program shine even more. It's a buy."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2015-12-15T03:47:54.000Z",
          "Titre": "Masterwriter",
          "Contenu": "I dislike paying an annual license fee for the program. I prefer to upgrade and pay for the upgrades.  I may not use the program for several months but am still required to pay the license fee each year.  I also prefer downloading the files rather then going to the web page to access the program. I don't believe I will renew my license when my term runs out unless their method of operation changes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cory Knowland",
          "Nb_Reviews": 2,
          "Date": "2015-11-27T01:41:39.000Z",
          "Titre": "Monthly subscription fee",
          "Contenu": "I love the product. I really do. However, for some of us who took the monthly payment option for the program have realized we have paid several times the actual subscription costs. Unfortunately, I may have to leave the relationship since it appears I would have to pay, in full, the entire membership fee to get off the monthly subscription. Brilliant marketing on your part, but not necessarily good financial stewardship on my part."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 1,
          "Date": "2016-02-19T02:56:44.000Z",
          "Titre": "Good features, software not very stable yet.",
          "Contenu": "I like the basic features but I get a lot of \"server not aviailable\" type messages. I've had a few times where it seemed to lose my song, but then when I rebooted the song came back. One nice feature would be that if I highlighted a word in my song it would feed that automatically into the rhyming dictionary search window."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Timothy",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T02:57:41.000Z",
          "Titre": "I was really looking forward to…",
          "Contenu": "I was really looking forward to MasterWriter. I thought it would be my go-to source when I was stuck or wanted to punctuate my writing with unusual synonyms (e.g., slang expressions, jargon) or idioms that I could play with and add a new twist to. Unfortunately, MasterWriter falls short. There aren't as many choices as I thought there would be.  Instead of using your program  when writing I find myself going to Urban Thesaurus, Reverse Dictionary, Relatedwords.org, the idioms page at the FreeDictionary, and the phrases page at RhymeZone. Those are all open tabs on my browser when I'm working. I did like the price that I paid for your program though. Hence, a third star. Hopefully, you'll end up incorporating the features that seem to be lacking and which would make MasterWriter a truly one-stop source for writers. Sincerely,Timothy"
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "Kelly",
          "Nb_Reviews": 5,
          "Date": "2015-12-28T00:40:07.000Z",
          "Titre": "What do you do when you can't access the internet?",
          "Contenu": "I much prefer to have a software version of Masterwriter.  I enjoy taking my laptop to a riverside, a mountain top, or even a campsite.  You get my point.  Having to sit in an area where WiFi is available takes all the romance out of writing a song.  Boo.  Yes, I can access it on my iPhone but it's small and the load time is painful.  This feels like a money move for Masterwiter.   Otherwise the product itself is amazing.  Too bad I find it hard to use when I want to."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Janet",
          "Nb_Reviews": 2,
          "Date": "2016-07-17T21:35:47.000Z",
          "Titre": "Good Product",
          "Contenu": "This product is good for some I am sure,  it just didn't work for me and I felt that it was a little expensive for what it is.  I canceled the product and I will say that the professionalism shown by this company when I voiced concerns was impeccable . My money was refunded immediately and there was true concern for my reasons for leaving.  I wish I could use the product so I could work with a company like this one, but I didn't feel the expense was worth it at this time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2022-06-26T17:38:13.000Z",
          "Titre": "Missing pieces.",
          "Contenu": "This program does have an acceptable selection of synonyms, but \"word families\" is a joke. It is rarely helpful. \"Phrases\" adds very little as it adds only the very simple and often'd cliched, as is \"Rhymes\". A simple Webster on line is much more helpful that \"Definition\". Categories is poorly reference and difficult to use. The \"World\" is well done.I should be able to type in a phrase to find a one word synonym of the meaning I am looking for. Phrases and Rhymes should be easier to reference from my thoughts, but this program is lacking and difficult to use. Help me say \"old eagle eye,\" or \"high as a kite\" with one word, then it would be helpful. This program could be beautiful but it needs a lot of work. There are a lot of missing pieces and it needs to be more user friendly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 4,
          "Date": "2015-12-22T12:41:01.000Z",
          "Titre": "Opportunities for Improvement",
          "Contenu": "I wish I could download pdfs of my songs. The rhyming dictionary needs to have better close rhymes. The recording feature is a little awkward to use. I would like to double or right click on a word and get rhymes rather than reenter the word. This feature could also apply to synonyms, etc."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 1,
          "Date": "2016-07-23T20:48:40.000Z",
          "Titre": "New software not as easy as the old one.",
          "Contenu": "Masterwriter is great for coming up with rhyming words, phrases, synonyms and what not for a songwriter. But they really dropped the ball on this new licensed product. I purchased the original software and was quite satisfied with it. Reluctantly, I decided to go ahead and subscribe to the new product. I am not happy with my decision because there are so many glitches in this product. For example, the print button doesn't always print as it should. The screen is split on the print job and I can not get rid of the split. Annoying to the point of dissatisfaction."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "User8239",
          "Nb_Reviews": 1,
          "Date": "2016-09-10T02:12:47.000Z",
          "Titre": "Great product until it went \"online\"",
          "Contenu": "I loved it when it ran on my computer and I could use it all I wanted. Now it's a yearly subscription for a web app. There aren't really any other alternatives out there. If there were I would have switched the minute it became a subscription only product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fb",
          "Nb_Reviews": 1,
          "Date": "2016-03-20T01:52:08.000Z",
          "Titre": "Good but not yet amazing",
          "Contenu": "I love master writer but do find it limiting in many ways. For one, I can't make it work on all platforms i.e. Ipad pro. Using a Bluetooth keyboard disables some functionality i.e. I am unable to use the enter key for the search tab. It' is temperamental at best. I can not copy any phrases for easy access. There are many glitches and bugs. I would love to see the ability to share songs with other writers for co writes etc... \r Again, it's a great idea but not yet amazing. Thank you for all your hard work, I look forward to seeing what you all come up with in the future."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2016-06-22T21:07:33.000Z",
          "Titre": "Good but still needs work",
          "Contenu": "While looking for synonyms I've come back with none found yet MS Word had a selection. For the price, I find that a bit irritating. Also sometimes I can eventually think of the word I wanted to use but was nowhere within the masterwriter suggestions."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 2,
          "Date": "2022-06-16T23:51:18.000Z",
          "Titre": "good, but...",
          "Contenu": "as much as I'd like to use MW more, I just can't get in the groove with it.  one thing that may help is seamless interconnection with MS Word"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gerald",
          "Nb_Reviews": 2,
          "Date": "2016-05-19T20:40:27.000Z",
          "Titre": "learning curve",
          "Contenu": "Giant learning curve for some of us. Have not  had time to  work on my written songs as yet so complete evaluation is not forth coming. But i do have high hopes it will serve the purpose of song notation and arranging lyrics to suite the muse. ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2016-08-25T17:33:59.000Z",
          "Titre": "Good and bad",
          "Contenu": "Don't like that they've went to subscription.  Hard to export other than cut and paste (would be nice if you could export txt or PDFs).  Work tape/audio function has improved on tablet/desktop, but phone still lackin."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Greene",
          "Nb_Reviews": 1,
          "Date": "2015-12-28T23:19:29.000Z",
          "Titre": "Web Base Difficulties",
          "Contenu": "It is bothersome to have to constantly enter my password, no matter if I use bookmarks. The program can be complicated without proper instructions on how to use it. If it wasn't for Youtube I would be completely lost."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T15:46:55.000Z",
          "Titre": "I don’t like the change made in the…",
          "Contenu": "I don’t like the change made in the newer version where you have to have an internet connection. I liked the older version better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shane",
          "Nb_Reviews": 1,
          "Date": "2016-01-05T20:16:49.000Z",
          "Titre": "I think it is a better program than it seems... But",
          "Contenu": "Having some difficulty because the tutorials are very vague on how to use the program. The tutorials are either there and not easily accessible or just not there. The tutorials I did follow were vague."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Evange",
          "Nb_Reviews": 2,
          "Date": "2022-06-19T03:44:39.000Z",
          "Titre": "I am not using it as I did back few…",
          "Contenu": "I am not using it as I did back few years ago. It seems like the quality or usefulness has dropped....I am very disappointed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bobby",
          "Nb_Reviews": 1,
          "Date": "2016-08-14T16:26:39.871Z",
          "Titre": "At least better than the free online rhyming tools",
          "Contenu": "I use Masterwriter exclusively for songwriting/lyric writing.  I can't honestly say that I recall Masterwriter every really being of all that much help in discovering new, useful rhymes.  Maybe if you are a novelist and you are looking for lists of synonyms, antonyms, phrases, etc. Masterwriter is probably more useful.  And for lyric writing it is at least better than the free online stuff.  But I can accurately say that Masterwriter has never given me that one \"ah-ha\" rhyme that I could have never have come up with on my own.  To be fair it does get your brain churning which helps you self-discover the words you are really looking for.  I would give it 2 stars but as it is at least better than the free online rhymers I upped it to 3 stars."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Ilkka",
          "Nb_Reviews": 2,
          "Date": "2016-08-02T05:54:05.000Z",
          "Titre": "Great features but",
          "Contenu": "I think the writing features are top knotch.  It's easy to use and I enjoy working with it.  I just don't think it's fair that it has to be tied to the internet to use it and for that reason I keep version 2 on my computer when I don't want to use the subscription model on the internet to do some writing.  Not sure if I will keep 3 after another year because I don't use a data plan so I have to make sure there is Wifi when I am out and about.  I mean version 2 was so good anyway that with the addition of Rhyme Genie I don't think anything could really compete with the 2 of them together.  Masterwriter 2 \"felt\" like it was MY program.  Subscriptions feel like rentals.  But feature wise I can't complain about version 3."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Ramon",
          "Nb_Reviews": 1,
          "Date": "2017-07-02T08:48:39.000Z",
          "Titre": "Great product with some flaws.",
          "Contenu": "Love the product. Couple things I would change1) Masterwriter app on iPhone: I'm a singer and songwriter as I would expect most of your customers are. I downloaded the app in hopes that it would mirror the web interface to an extent, allowing me to quickly access lyrics when I'm in a vocal session or being able to make changes on the fly. The functionality of the app is so limited, it's not really worth downloading in its current state. So much potential here though, would be amazing if there was a major update in the near future. 2) Web interface: Slow reaction times with Safari, blank menu windows. Noted several glitches when scrolling through the pages. 3) Colour customisability: Would be great to be able to customise the colour and break away from the blue.Hope this helps!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dustin",
          "Nb_Reviews": 1,
          "Date": "2016-05-08T23:46:40.000Z",
          "Titre": "Great content.  Horrible mobile platform.",
          "Contenu": "I love everything about the content on Masterwriter and it is quite helpful, but it has absolutely abysmal functionality on the iPhone.  Very frustrating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "cheryl",
          "Nb_Reviews": 2,
          "Date": "2016-04-05T18:45:25.000Z",
          "Titre": "Not as helpful as I'd hoped",
          "Contenu": "Either I just don't get how it works or it's not what i needed for the books I write. have other tools that help me much better and are free."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Janice",
          "Nb_Reviews": 1,
          "Date": "2022-06-27T01:18:25.000Z",
          "Titre": "I just didn't find it to be anymore…",
          "Contenu": "I just didn't find it to be anymore helpful than using Scrivener or other word processors."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T17:48:31.000Z",
          "Titre": "I am having difficulty.",
          "Contenu": "I am having difficulty using MasterWriter and some instructive help would be appreciated."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jan",
          "Nb_Reviews": 1,
          "Date": "2015-07-29T18:22:58.000Z",
          "Titre": "Haven't started using the program yet.",
          "Contenu": "I haven't had time to view the video and afraid I can't figure it out on my own. Hoping to have a look in the next several days."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 4,
          "Date": "2022-07-21T18:53:02.000Z",
          "Titre": "The idea is wonderful",
          "Contenu": "The idea is wonderful, but it is too manual. Google searches work better for me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 2,
          "Date": "2022-06-16T23:57:44.000Z",
          "Titre": "This was not more helpful than…",
          "Contenu": "This was not more helpful than thesaurus.com or other search engines that are free."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T19:32:50.000Z",
          "Titre": "I miss the offline option",
          "Contenu": "I miss the offline option. Please include an OS app and easy way to license songs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Russell",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T14:10:13.000Z",
          "Titre": "MasterWriter times out too quickly",
          "Contenu": "MasterWriter times out too quickly.  Too much time is spent logging in and out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joel",
          "Nb_Reviews": 3,
          "Date": "2022-06-24T01:01:17.000Z",
          "Titre": "Good source for alternate words",
          "Contenu": "Good source for alternate words, but not as intuitive as I would have liked."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bradford Guy",
          "Nb_Reviews": 4,
          "Date": "2015-12-26T09:07:21.000Z",
          "Titre": "Great Application, But a Bit Pricey!",
          "Contenu": "In all honesty, I love Master Writer; it has helped me immensely in writing new lyrics and also finishing/polishing some very old lyrics that were unfinished. The fact that there are so many tools available to me from within the MR application without having to scour the internet for rhymes, words and ideas is fantastic and really helps keep the momentum of writing stay constant. \r I would like to see some templates added that would allow a more professional outline and finished work in writing; spelling out main lyrics, choruses, instrumental interludes and codas. Maybe correctly adding the name of the composer, dates, copyright information, etc. Automatically adding the composer/writer name; setting up the font size and location for the title, etc. \r My biggest complaint would be that the subscription is way too high for an application that rarely, if ever, changes or is updated. I would prefer a stand alone, desktop app that is free of any subscription. Maybe has upgrade options to purchase for additional functionality, or some other value added service to make the subscription at least [seem] worthwhile. In ending, I love the Master Writer application. But after \"Years\" of use, and payments, I cannot really see the benefit of an ongoing subscription."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 1,
          "Date": "2017-06-02T00:18:43.000Z",
          "Titre": "Rhymes listed not always \"perfect\" or …",
          "Contenu": "Rhymes listed not always \"perfect\" or based on sloppy pronunciation"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rhett",
          "Nb_Reviews": 1,
          "Date": "2016-03-28T17:43:19.000Z",
          "Titre": "Edit page too small",
          "Contenu": "good product but disappointed in that edit page is still too small"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sebati",
          "Nb_Reviews": 4,
          "Date": "2022-06-17T03:23:19.000Z",
          "Titre": "Some services do not work as advertised."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John - SantainChicago",
          "Nb_Reviews": 1,
          "Date": "2016-06-11T16:52:56.000Z",
          "Titre": "Masterwriter is ok",
          "Contenu": "Masterwriter is ok but not nearly as easy to use as I had hoped."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2022-06-23T23:44:00.000Z",
          "Titre": "Your user interface is clunky!"
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Cliff",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T00:32:45.000Z",
          "Titre": "Absolutely fabulous, but…",
          "Contenu": "Absolutely fabulous. I’d recommend a couple improvements. The word family function rarely provides anything useful. I came over from another app that has a great word family function. Masterwriter usually just says nothing found for this word. Try synonyms. The competitions app when you type the word ‘gun’ for example will say bullet, black, dangerous, hollow tip, shooting, war, NRA, safety, policeman, etc etc etc. and just give words “in the key of gun” so to speak. Another frustrating thing about this app is digging through some of the speech types, there can sometimes be 150 separate pages to sift through but no way to jump ahead or alphabetically search. Just endless page flipping. Other than these two things you guys are crushing it. Loving the app."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregg",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T00:50:21.000Z",
          "Titre": "I have not yet used the new Master…",
          "Contenu": "I have not yet used the new Master Writer, but I have used Master Writer in the past.  The only reason I gave a 4-star, instead of a 5-star, is due to the fact that the program is not downloaded onto the PC.  I like to be in total control.  Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joshua Rose",
          "Nb_Reviews": 3,
          "Date": "2023-11-23T09:09:37.000Z",
          "Titre": "It’s a great app, but…",
          "Contenu": "It’s a great app. I just wish it was actually an app. Like for iphone/android rather than a web based app that sits in my browser lost amongst all the other open tabs."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T20:34:04.000Z",
          "Titre": "I have just started to use Masterwriter…",
          "Contenu": "I have just started to use Masterwriter after having used Songwriter’s Pad forever.  It’s as good or better than my old app, and similarly not without its warts.The fact that the MW mobile app is not the same in functionality as the desktop version is not a surprise, but is no less frustrating.That said, it’s a great app.  I wish it was less subscription and more one time purchase, but I’m happy enough."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "M Emmanuel Chevalier",
          "Nb_Reviews": 7,
          "Date": "2023-10-23T23:47:21.000Z",
          "Titre": "MW is a great tool to improve the lyric…",
          "Contenu": "MW is a great tool to improve the lyric writing. As a non native english speaker, i use it a lot when i need a rhyme , a synonym or an english expression that i'm not familiar with. And i can write all my lyrics on it directly and find them easily. There are probably other functions that i don't use and i still need to discover."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robin OHerin",
          "Nb_Reviews": 8,
          "Date": "2023-10-22T05:12:39.000Z",
          "Titre": "Masterwriter is really helpful",
          "Contenu": "Masterwriter is really helpful. I like the rhymes, near rhymes, and phrases...all very helpful and inspiring when writing songs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Justin H.",
          "Nb_Reviews": 2,
          "Date": "2023-10-01T21:08:52.000Z",
          "Titre": "Waiting for a standalone iPad app",
          "Contenu": "It's great!  All of the tools (rhyming, thesaurus, dictionary), all in one place, and very inspiring.  Just wish it was available as a standalone app, either on iPad or Mac/PC like it used to be."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-03-26T17:28:30.000Z",
          "Titre": "Convenient with useful tools",
          "Contenu": "Very handy to have the dictionary and thesaurus and the other tools close at hand. The Versions feature is quite useful. Normally I am not quick to use web apps for intellectual property, but it is convenient to have access to my lyrics from anywhere. I have several features I would like added. Nonetheless, this app is worth the price. It is money well spent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "VICKI BIGGS",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T00:49:25.000Z",
          "Titre": "Masterwriter has provided help in…",
          "Contenu": "Masterwriter has provided help in coming up with words, but I find I am still having use my browser to come up with synonyms that fit my needs. So it has become another tool for me, but not my go-to tool as yet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T17:59:33.000Z",
          "Titre": "Useful tool",
          "Contenu": "Mostly I use word families, synonyms, phrases, speech types, and dictionary sections. I do use the world section but not as often. I'm a writer, not a songwriter, but it is quite a useful tool when I'm polishing my work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ROBERT",
          "Nb_Reviews": 2,
          "Date": "2023-10-19T03:00:25.000Z",
          "Titre": "Plenty of synonyms",
          "Contenu": "Plenty of synonyms. Otherwise not so useful to me. Perhaps my issue, not theirs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joel",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T21:55:55.000Z",
          "Titre": "Great tools for songwriters",
          "Contenu": "This is a great tool for my songwriting career. It helps me find words that is not familiar with me & appropriately you have a choice for the right tune and words matching together for the theme."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Joe",
          "Nb_Reviews": 3,
          "Date": "2022-08-05T00:12:43.000Z",
          "Titre": "Clunky birs on mac",
          "Contenu": "Copying and pasting (eg into a word file) and organising new versions of the same song under titles etc is all there but a bit clunky. Also, i have to use a different program to write chord charts, or at least that is my current practice. Still a great program."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Venusmariemakesart",
          "Nb_Reviews": 1,
          "Date": "2022-08-31T19:17:41.000Z",
          "Titre": "Few things I’d change but amazing nonetheless",
          "Contenu": "I love it, it’s an amazing resource for songwriting and poetry!! I would change a few things though on the mobile website, like maybe having the rhyme words on the auto fill bar instead of having to exit out of the writing entirely? I find the navigation is quite annoying, I hope I don’t sound entitled lmfao I’m sorry. maybe have a lot more rhyme words too? PLEASE PLEASE PLEASE MAKE AN APP THAT WOULD BE AMAZING!!! That’s my number one request and I’m sure others too ❤️‍🔥But that’s it! Everything else is amazing, thanks for designing this amazing resource❤️‍🔥"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Justin H.",
          "Nb_Reviews": 2,
          "Date": "2022-10-01T17:41:56.000Z",
          "Titre": "Standalone app would be nice",
          "Contenu": "Solid.  Has everything I need for lyric writing, as I'm a terrible lyricist.  Lol.  Rhyming dictionary is the best I've seen.  My only gripe is I'd like to see a standalone app for iOS/Android, and an offline mode, as I'm not always online 24/7."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Jerone Howard",
          "Nb_Reviews": 12,
          "Date": "2022-08-24T15:51:35.000Z",
          "Titre": "I've loved MasterWriter since the…",
          "Contenu": "I've loved MasterWriter since the beginning and will continue to use it when I write lyrics.   It's a great source of inspiration, and it keeps getting better.   It'll someday get a 5 star review from me I'm sure.   Keep up the good work!!"
        },
        {
          "Note": 4,
          "Lieu": "AW",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T16:33:48.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, very useful! Word Families is extremely awesome. It can lag a little at times, but that might be my pc. Also, it went on sale like a few days after I bought 2 years for full price, but that's just timing I guess. Maybe a lifetime payment option? Some text sections/files in the Help Center would be nice. Also instant showing of words on the left, or like an option for a scratchpad that does this, something along those lines. Still new to it though so working with it. All in all, very useful for fiction, really digging it so far!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ramin Keyvan",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T02:15:08.000Z",
          "Titre": "Several Improvements to Consider",
          "Contenu": "Love it so far. I have several improvements to suggest:1.) iOS and Android Apps2.) The ability to email files bigger than 10mb. These days, many files are larger than that.3.) The ability to \"Save As\" new versions of songs rather than copy and paste, etc.4.) API integrations with on line services like Box.com, DropBox.com and Avid Cloud. The more integrations the better.Happy to discuss any of the above with your team. Just let me know.Thanks!Ramin Keyvan"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Esther Ligthart",
          "Nb_Reviews": 3,
          "Date": "2023-01-27T18:06:14.000Z",
          "Titre": "Great tool, perhaps easier to use for native speakers",
          "Contenu": "Writing with this tool wasn't the solution for me, and I did cancel my subscription. I also gave a bad review initially out of frustration, but it turned out that it was something temporary and should be back in order. The company's owner reached out to me to ask me personally about what my experience was and cared about my experience. We mutually agreed that, for now, it's not the tool I need, but I did appreciate he reached out to me. I got a refund, which I didn't ask for, and there was no need to do so as I did use the tool and see it as part of trying out something new. MasterWriter might be the perfect tool for writers and perhaps easier to use for native speakers; if you do have a problem, I can tell you this: reach out to the company. They will (unlike so many others) respond and help you out immediately."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Blue Ferret Jim Hall",
          "Nb_Reviews": 3,
          "Date": "2022-08-12T01:36:26.000Z",
          "Titre": "Excellent Tool for songwriters",
          "Contenu": "I have found Masterwriter to be an indispensable tool in my day to day creative life. The interface is a little eccentric but I have grown to it. It's like having a second writer with you who only speaks when asked!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T22:11:17.000Z",
          "Titre": "Almost five stars",
          "Contenu": "I would have given you five stars, but the add-on for MS Word occasionally freezes and I have to sign out and sign back in again to get it to work.  Annoying but I can live with it now that I know what to do. It is a glitch in the program you should get fixed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Manuel",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T01:03:22.000Z",
          "Titre": "The only thing that I don’t like is how Master Writer disrupted my service the same day they debited my bank account",
          "Contenu": "The only thing that I don’t like is how Master Writer disrupted my service the same day that my bill was due."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave Evans Solo",
          "Nb_Reviews": 2,
          "Date": "2022-08-13T17:40:23.000Z",
          "Titre": "I am a songwriter and I use MasterWriter everyday as an essential part of my workflow.",
          "Contenu": "I am a song writer and I use MasterWriter everyday. I love everything about it and could not write as many songs as I do without it.  It is a valuable, essential part of my workflow.The one major thing I need that MasterWriter is missing is the ability to upload/download PDF files. If it had that ability, it would be a perfect 5 stars.Dave Evans"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T17:53:20.000Z",
          "Titre": "I like many of the tools",
          "Contenu": "I like many of the tools, I find fewer rhymes than Rhymezone, I would love to have better search filters for idioms and other poetic devices, would like to search idioms for specific words."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Zachary Woodard",
          "Nb_Reviews": 3,
          "Date": "2023-02-06T14:38:16.000Z",
          "Titre": "It’s Rhyme Time!",
          "Contenu": "This is a really good piece of software for kickstarting and refining lyrics. I wish it had a generator for when I need an entire line, but that is really a minor issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T20:02:41.000Z",
          "Titre": "I LOVE master writer but it could be WAY better...",
          "Contenu": "I LOVE master writer.... I just wish the app was better.  It's really hard to use your program for all it's worth on my phone.  I try using it on my phone in my web browser because the app is pretty much useless for my needs -  I need all the word searching tools primarily.  Sometimes on mobile it doesn't let me scroll to the bottom of the list of words or move on to the next page.  It just doesn't work.  If it worked as well on the phone as it does online it would be used by way more people."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Stewart",
          "Nb_Reviews": 3,
          "Date": "2023-08-08T17:50:07.000Z",
          "Titre": "Been using master writer for 8 years…",
          "Contenu": "Been using master writer for 8 years and its my go to songwriting program! Full of ideas and easy to navigate!"
        },
        {
          "Note": 4,
          "Lieu": "JM",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T21:42:53.000Z",
          "Titre": "Because it is easier to access",
          "Contenu": "Because it is easier to access, I am able to work faster.  I am still in the process of exploring MasterWriter, but so far so good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Denise Dimin",
          "Nb_Reviews": 2,
          "Date": "2022-08-05T18:09:31.000Z",
          "Titre": "I love Master Writer!",
          "Contenu": "I love Master Writer!I wish it was a little more intuitive.  I always eventually get where I want to go but because I don’t use it frequently, it takes me a while each time I return to get back in the rhythm! 😉"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Geralyn Morrow Swindle",
          "Nb_Reviews": 2,
          "Date": "2022-12-27T00:40:01.000Z",
          "Titre": "Information all in one place",
          "Contenu": "The features I appreciated was the ability to find new words quickly, instead of having to joggle between websites for words. They have categories I have never heard of like intensifiers and onomatopoeia’s.  Its a great site to expand your knowledge and hopefully be inspired and unlocked into your creative expression."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave B",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T19:37:41.000Z",
          "Titre": "Very helpful",
          "Contenu": "I like it, I need to use it more, it helps spark ideas and I like to be able to save my work and always be able to come back to it even if I cancel my subscription"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jackie Dixon",
          "Nb_Reviews": 2,
          "Date": "2023-05-27T00:43:59.000Z",
          "Titre": "Seems like the proper too.",
          "Contenu": "I have reviewed the program, but I haven't actually got a chance to begin songwriting. Seems like it will be very useful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bedford",
          "Nb_Reviews": 2,
          "Date": "2023-03-22T22:36:50.000Z",
          "Titre": "This is a good tool for my songwriting",
          "Contenu": "This is a good tool for my songwriting. I enjoy using the extra tools when I need them. But I am honestly inclined to do without them when I can. I'm hooked on Master writer....B"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T22:10:27.000Z",
          "Titre": "I’d love to see an offline app version…",
          "Contenu": "I’d love to see an offline app version that can sync when I have access to wifi, still allowing for a full experience while internet is not available."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Jim Wall",
          "Nb_Reviews": 6,
          "Date": "2022-12-30T12:57:10.000Z",
          "Titre": "An excellent product with the one…",
          "Contenu": "An excellent product with the one drawback being that I can't put an icon on my desktop to gain access."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark B.",
          "Nb_Reviews": 2,
          "Date": "2022-08-11T22:17:54.000Z",
          "Titre": "I use MasterWriter on every write",
          "Contenu": "I use MasterWriter on every write. It helps make the process go more quickly as well as spark additional ideas."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Josh R",
          "Nb_Reviews": 2,
          "Date": "2022-08-06T00:38:32.000Z",
          "Titre": "Great tool for aspiring song writers.",
          "Contenu": "I haven't learned how to use it very well yet. I can clearly see how effective it could be. I have written part of two songs and I have used it to write a couple of letters. It will only get better as I learn how to use all of its features."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2022-08-05T12:49:00.000Z",
          "Titre": "More words to master writing.",
          "Contenu": "Disclaimer: this is a edit of a previous review.I use MasterWriter for songwriting, so I mostly search Rhymes. Ha. It's not fair to blame MasterWriter for not finding the rhyme I'm looking for. The app has a vast offering of perfect, close, wider, and widest rhymes. It runs rings round my Songwriter's Rhyming Dictionary. I haven't used MasterWriter much since it moved online. I prefer a standalone app I can open when needed without the online login process. Admittedly this is a personal bias which shouldn't color a review.The developer quickly replied to my initial review, which was short and not flattering. Honestly, I had forgotten about the app until I received a request to review it. Online apps are not my thing. My recollection was often not finding the rhymes I needed. (Please see the first paragraph.) Perhaps it was the process of searching that interrupted my writing--not a fault of the app. The developer's outreach prompted me to log in and take another look. I found a more robust version offering more content than I recalled. \"Speech Types\" is a new addition, with categories for Alliterations, Allusions, Idioms, Intensifiers, Metaphors, Onomatopoeia, Oxymorons, and Similes. That looks very useful, especially since you can filter by the number of syllables required.I'm going to give MasterWriter another try. I still don't like the online app process. But the site has many useful features. It looks like a one-stop shop for words. Users will have to determine if that is true for themselves. I'm giving it the second look it deserves.I've updated my rating to four stars. It may deserve five stars. I need to explore the new version before I can say. Will I use MasterWriter more now? Hard to say. I'm not often at my computer when I'm writing songs. Again, no fault to the online app.Bottom line -- the developer takes this seriously. Serious writers may benefit from  giving MasterWriter a look. How it fits into a writer's workflow may have a say in whether it is a useful tool or not. MasterWriter certainly has a lot of words to use. The developer's desire to help users is a big plus, as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DOLORES HALL",
          "Nb_Reviews": 5,
          "Date": "2023-04-21T00:17:59.000Z",
          "Titre": "Can't believe all the great synonyms…",
          "Contenu": "Can't believe all the great synonyms and word choices! It's opened up a whole near area to enhance my writing. Love the program!"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Ralf",
          "Nb_Reviews": 1,
          "Date": "2022-08-12T22:09:43.000Z",
          "Titre": "Very useful for creating lyrics",
          "Contenu": "Very useful for creating lyrics. It would be great if words could be searched by syllables and stress."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T16:50:18.000Z",
          "Titre": "Great for Lyricists",
          "Contenu": "This helped me expand my horizons to get into deeper critical thinking for each of my songs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cristaña",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T01:21:51.000Z",
          "Titre": "I like the variety of options that are…",
          "Contenu": "I like the variety of options that are available on the app… onomatopoeia, personification, and other language devices are extremely beneficial! I think a more thorough rhyming dictionary with close rhymes, and options would be beneficial… a rhyming dictionary that has an exhaustive number of choices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 5,
          "Date": "2023-10-17T03:54:06.000Z",
          "Titre": "Good instructive materials.",
          "Contenu": "Good instructive materials to fully utilize their product and services!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer Bill Soprano",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T19:21:40.000Z",
          "Titre": "Just learning to use MasterWriter",
          "Contenu": "Just learning to use MasterWriter.  I have always wanted to use this program and finally took the plunge.  So far so good!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Douglas Bates",
          "Nb_Reviews": 8,
          "Date": "2023-05-25T21:48:13.000Z",
          "Titre": "MasterWriter a useful tool/",
          "Contenu": "MasterWriter is a useful tool and has helped with many projects."
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "Thomas A P",
          "Nb_Reviews": 5,
          "Date": "2022-11-19T21:39:03.000Z",
          "Titre": "Very good software",
          "Contenu": "Very good software, but requires somme getting used-to. Otherwise, easy and straightforward"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cathy Young",
          "Nb_Reviews": 1,
          "Date": "2022-09-11T19:55:49.000Z",
          "Titre": "Love love love masterwriter",
          "Contenu": "Love love love masterwriter!  My only complaint is not being able to use it on my phone and computer at the same time…"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-15T21:17:55.000Z",
          "Titre": "Good for writing lyrics",
          "Contenu": "Really helpful for when you get stuck, or need to re-arrange.  I wish there was an easy way to add chords above song lyrics."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dove Knight",
          "Nb_Reviews": 3,
          "Date": "2023-08-31T21:57:20.000Z",
          "Titre": "good but i wish you had a microphone…",
          "Contenu": "good but i wish you had a microphone mastering"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "M Emmanuel Chevalier",
          "Nb_Reviews": 7,
          "Date": "2022-08-05T00:33:12.000Z",
          "Titre": "It's a great tool for lyricists",
          "Contenu": "It's a great tool for lyricists. It helps me a lot to find the words i miss  for my lines , and it helps for the inspiration"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 2,
          "Date": "2022-08-04T21:44:27.000Z",
          "Titre": "I can't create my own password",
          "Contenu": "I can't create my own password, not matter how hard I try. That's my only complaint."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jean",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T22:17:00.000Z",
          "Titre": "I am a writer and I use MasterWriter to…",
          "Contenu": "I am a writer and I use MasterWriter to find synonyms rapidly."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "JAMES GERARD KEARNEY",
          "Nb_Reviews": 2,
          "Date": "2022-10-14T03:53:53.000Z",
          "Titre": "My personal thoughts. This is a useful device",
          "Contenu": "I found the device helpful, but it could be easier for the beginner."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kurt vM",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T21:19:03.000Z",
          "Titre": "Great resource for songwriters",
          "Contenu": "Many options for rhyming words and phrases.  A great resource."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Deborah Chris",
          "Nb_Reviews": 30,
          "Date": "2022-08-08T00:00:54.000Z",
          "Titre": "Very creative software",
          "Contenu": "Very creative software, I use it, a good help for the lyrics"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lionel",
          "Nb_Reviews": 3,
          "Date": "2023-03-02T23:09:30.000Z",
          "Titre": "Great assistant for all forms of writing!",
          "Contenu": "There are some words that are not in the MasterWriter database"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jenepher White",
          "Nb_Reviews": 1,
          "Date": "2022-09-12T20:54:42.000Z",
          "Titre": "Mostly good",
          "Contenu": "Mostly good. The UI is a bit clunky. The phrases arent as helpful as they could beAnd, the thesaurus isn't complete."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr M Johnson",
          "Nb_Reviews": 4,
          "Date": "2023-07-14T08:25:18.000Z",
          "Titre": "MasterWriter now a website not an app.",
          "Contenu": "I've upgraded my review from 3 Stars to 4. Matthew from MasterWriter has been very responsive. I sincerely hope they'll soon be able to bring back offline working mode for us songwriters who travel a lot and are away from Internet.  ***********I have used MasterWriter on and off since Version 1. I do have a soft spot for it and have tried to stay loyal to the company but I really do not like the fact it is now just a website and no longer dedicated software. You have to be online and tied to the Internet to use it. I think this is a big mistake and does put off quite a lot of people I have spoken to about it. In fact, no one I have spoken to prefers this new version to the older software version - which no longer runs on modern Macs. Many songwriters – myself included – crave time away from the Internet to be able to clear our heads and create away from its distractions. Another issue for me is the very cramped size of the writing area for lyrics. It is very small even on a laptop, but on a phone I find it not useable at all.  As I remember, the older software versions use to have an additional sketchpad / notes area where you could play around with your words in extra space before bringing across to the main lyrics area on the left hand side. Lastly, I really do not like the subscription model they have introduced. You are not even paying for software. You are paying a monthly or annual fee to access a website. I would rather pay for software that exists on my computer and then pay again for significant upgrades. There have been no major upgrades in Master Writer for many years -apart from the dubious one of it now being a website that you can access with your phone! I hope the folks at Master Writer take note of this feedback and bring it back as independent software. I am not meaning to be negative at all but I don’t think MW has evolved enough since it was first launched many years ago. There is something I do still like about it but from a personal point of view its usability is now going backwards, not forwards with the demotion to being just a website and not freestanding software. PLEASE bring it back as software!IN RESPONSE TO MASTERWRITER'S REPLY:1. I do find it hard to believe there is overwhelming demand for a web-based program on a subscription model. I know a lot of creative people in the fields of music, photography and film and absolutely all of them resent being forced into the subscription model by the likes of ProTools, Adobe etc. as well as being unable to use their creative tools without being tied to the Internet. In regards to MasterWriter, the value of being able to work away from the distractions of the Internet (on a tour bus, airplane, train, remote cottage etc.) is far greater than the value of being able to access the website on a small phone screen. There is a growing resentment in the creative community – generally – that the subscription model is based more upon the financial needs of the software creators than the creative needs of the software users who – in effect – no longer own what they are paying for. Also, the fact that our work no longer resides on our own computers / hard drives but on someone else's hard drive (which is basically what the cloud and web-based apps are ... just someone else's hard drive). 2. Yes, I did notice that by hovering the cursor over the black separator bar I can pull the writing area on my MacBook Pro out to the right by approx. 1.5” (4cm) which does help slightly. I agree with you, that the writing area on the phone is too small due to the limitations of the phone itself. My suggestion would be to revert to a software model where several full pages can be opened up at once – like Word documents – and exist fully side by side rather than the very limited real estate allowed by a webpage. 3. Agreed. The new ‘Versions’ feature is an improvement over the old sketchpad. 4. When using Versions 1 and 2 of MasterWriter I noticed there were barely any software updates over many years. Is there an area on the main website where we can see which updates and improvements are being implemented and where users can make suggestions for improvements? It would be nice to feel we are part of a community working together to improve MasterWriter. Lastly, a practical question. Does MW only send out text files in .html format? Could there be an option added in preferences where files could be sent in simple TextEdit format? As again, if one is trying to open up MW text files offline then .html format is of little use. Audio files work fine though. I wish to reiterate that I am a supporter of MasterWriter and have enjoyed using it since Version 1. I just want to help make it better and increase its appeal as there is still much I like about it. I also wish to thank you for being so responsive on this forum. Hopefully, the views of users can be taken on board for future upgrades."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "larry wilcox",
          "Nb_Reviews": 3,
          "Date": "2023-04-18T18:00:34.000Z",
          "Titre": "Simplicity...enjoyed it and love the…",
          "Contenu": "Simplicity...enjoyed it and love the expansive vocab."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Bishop",
          "Nb_Reviews": 3,
          "Date": "2022-07-30T17:01:54.000Z",
          "Titre": "This program is useful",
          "Contenu": "This program is useful. Honestly, as a rhyming dictionary, the color coding and syllable counter of Rhymer's Block is easier to use, but has far less depth. Masterwriter helps when you are stuck. For the price, they should develop more features though. I am interested in a writing tool, and not a way to push my songs (that doesn't seem very useful)."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Matty Dransmann",
          "Nb_Reviews": 3,
          "Date": "2022-08-02T09:21:13.000Z",
          "Titre": "I love Masterwriter and I have been a…",
          "Contenu": "I love Masterwriter and I have been a user for more than a decade now. The cloud surface is a plus now and the overall experience is almost flawless. Here are just my suggestions for improvement: - color coding songs, - highlighting sections inside songs as if using a magic marker, direct pdf export, foreign letters like äöü should be flawlessly imported, - integrated access to a quote library. Update: Thanks for the answer and the reference to the BrainyQuote link. That's good to have indeed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bedford",
          "Nb_Reviews": 2,
          "Date": "2022-06-19T18:22:36.000Z",
          "Titre": "The masterwriter app is basically very …",
          "Contenu": "The masterwriter app is basically very  Helpful.  But when I look for synonyms definitions or other tools, it seems limited compared to Wiki rhymes etc. I also heard that it is now $100 per year. I got a deal when I signed up for 2 years for $79. I would do that again, but will not be able to afford $100 a year. I am retired tired I'm living on social security, Haha."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Douglas",
          "Nb_Reviews": 2,
          "Date": "2022-06-17T00:51:52.000Z",
          "Titre": "I enjoy using MasterWriter but it is convoluted.",
          "Contenu": "I enjoy using MasterWriter, primarily for the purpose of \"punching up\" my fiction writing. However, it's mystifying to me why I have to go some convoluted route to do the thing I do 99% of the time, and that's look for synonmys. I can't just type in a word, I have to create or use an existing project (whatever that means) and they within the \"project\" I can use MasterWriter."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2022-11-19T22:41:49.000Z",
          "Titre": "versatility",
          "Contenu": "able to  work with word processor in tandem"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T00:45:29.000Z",
          "Titre": "Pro Songwriter Review",
          "Contenu": "BEST rhyming dictionary, hands down!!! That’s the shining star of this system. Others have a better way of searching (currently cannot search by author). Also has no way of tracking pitches or if/when a song is on hold or has been recorded. SongSpace is the gold standard for those things. As a result, I have to use both, not one or the other."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carl",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T02:36:51.000Z",
          "Titre": "Limited access when not on line",
          "Contenu": "Limited access when not on line, still don't know how I'll get my files if subscription stops, otherwise a good program.Thank you for the explanation, sorry I did not better understand the value of my subscription. Is there a way to make a form? I have distilled my education in song writing and have some forms of interest. Carl"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brendon",
          "Nb_Reviews": 1,
          "Date": "2022-06-28T00:46:20.000Z",
          "Titre": "I love a lot of the features of your…",
          "Contenu": "I love a lot of the features of your app. Could I give you some constructive criticism for hopefully some change? With a laptop I wish there was options to make the screens bigger and the fonts bigger. I don't have the best eyesight and constantly have to put reading glasses on. Perhaps when I'm in the section just writing lyrics I would love to expand that section to fill up my entire screen instead of just a small portion on the left which is more difficult to read. Thank you for your consideration!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T23:48:54.000Z",
          "Titre": "I love the platform for storing…",
          "Contenu": "I love the platform for storing information, lyrics, ideas and notes. Masterwriter is great at this. The fact that it is accessible on mobile devices is a huge plus. I am able to record a lyrical thought immediately before its lost.Where I don't get a lot of value are the Rhymes, Synonyms, etc. I have reverted back to Rymezone.com and Thesaurus for these needs. That said. I plan to continue using Masterwriter as a useful tool and would definitely recommend it to others."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Paul M",
          "Nb_Reviews": 6,
          "Date": "2022-06-17T01:04:30.000Z",
          "Titre": "Master writer is a great program that…",
          "Contenu": "Master writer is a great program that fuels the writing process creatively. It’s easy to use with only a few weaknesses. It provides me with alternate ideas with my lyric writing which I love.I’ve been using it for well over 15 years so I’m a long term fan but there are never any incentives for long term users. Not sure why ?  but that would be my greatest criticism … sometimes it’s good to give back :)I’m grateful either way because I think it’s the best at what it does. Thumbs up Paul"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "brett doelling",
          "Nb_Reviews": 4,
          "Date": "2022-06-16T23:35:06.000Z",
          "Titre": "Great; Could Be Better; Might Get There",
          "Contenu": "There are some elements to the organization/folder system that could use some improvement, and may get them in future revisions (the current version has improved over the previous). But otherwise, a word processing program with an integrated thesaurus and particularly, afull featured, rhyming dictionary is indispensable for songwriting. That it's a cloud app is convenient for those times when you only have your phone on you (though the phone interface could use some improvement, as well)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "F A",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T14:11:03.000Z",
          "Titre": "The only thing I would add to this…",
          "Contenu": "The only thing I would add to this great program is the ability to use it offline.  I realize that wouldn't work for the full program, but certainly there are parts that could. It is frustrating at times when I need to look up words or phrases and find I need to go online to use MasterWriter, so I don't."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bobby",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T23:34:07.000Z",
          "Titre": "THE SOFTWARE IS REALLY USEFUL",
          "Contenu": "THE SOFTWARE IS REALLY USEFUL. ADMITTEDLY I DON'T USE ALL THE FEATURES THAT IT OFFERS, BUT I STILL GET VALUE FOR THE COST. THE ONLY PROBLEM I'VE HAD IS THAT THERE ARE SMALL CHANGES TO THE SOFTWARE THAT I DON'T FEEL I WAS ADEQUATELY INFORMED ABOUT. ONE EMAIL TO SUPPORT AND ALL WAS WELL, SO NO BIG DEAL."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "vondelljones",
          "Nb_Reviews": 2,
          "Date": "2023-01-01T10:40:21.000Z",
          "Titre": "Still trying to figure how to best use…",
          "Contenu": "Still trying to figure how to best use it!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MiLTON",
          "Nb_Reviews": 1,
          "Date": "2022-06-26T22:55:48.000Z",
          "Titre": "Always room for improvement",
          "Contenu": "Always room for improvement. Sometimes I have to go to wordhippo for additional assistance.The fonts that show dark and clear on computer do not always show as well on phone. Replaced all fonts with Arial Bold. FYI.Other than that, all is well.MiLTON"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lyn",
          "Nb_Reviews": 1,
          "Date": "2022-06-30T21:03:58.000Z",
          "Titre": "Limited Dictionary",
          "Contenu": "There are numerous words I can enter into thesaurus.com that can be found on that site, but when they're entered into MasterWriter, I get nothing. Be that as it may, it is a good program, but unfortunately, it can't be the only one you use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T17:15:01.000Z",
          "Titre": "I love the convenience of…",
          "Contenu": "I love the convenience of writing/editing/adding to my projects from anywhere. The \"filing\" of projects is easy to navigate and keeps my projects in order. The only complaint I have is the uploading of text from other sources. It is a bit cumbersome."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2022-06-25T13:13:10.000Z",
          "Titre": "Not Essential but Close",
          "Contenu": "I love MW and use it every day. I’d love to see a sharing feature like a Google Doc for collaborations, as well as the ability to resize or change the layout of the screen.All in all it has improved my songwriting and I recommend it to everyone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Luxenberg",
          "Nb_Reviews": 2,
          "Date": "2022-06-17T02:42:55.000Z",
          "Titre": "MasterWriter is very useful for both…",
          "Contenu": "MasterWriter is very useful for both screenwriters and songwriters. It provides an extensive list of synonyms. However, the synonyms are not hyperlinked to their synonyms. This would be a very useful feature which is found in other packages of this type."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2022-08-05T00:16:58.000Z",
          "Titre": "I don't like the online subscription…",
          "Contenu": "I don't like the online subscription only model!  If it weren't for this I would rate it a 5 star.  In all of the years since MasterWriter was created no other software I have found does what it does."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike P",
          "Nb_Reviews": 2,
          "Date": "2022-06-19T20:20:44.000Z",
          "Titre": "Great start, great potential",
          "Contenu": "I have been able to generate some great lyrical ideas, both with new compositions and revisiting some older ones. I would like to be able to use the features of interfacing with my music scores and with recording software better that I can now."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "udo cosgrave",
          "Nb_Reviews": 3,
          "Date": "2022-06-16T23:37:24.000Z",
          "Titre": "needs better tutorials",
          "Contenu": "I have been using masterwriter for a couple of years now and find it very helpful. 4 out of 5.The only issue I have is that the tutorials could be more inclusive and updated because I keep on finding out more useful options by trial and error."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T20:27:02.000Z",
          "Titre": "The app is very helpful",
          "Contenu": "The app is very helpful. Lots of assistance at your fingertips. One possible advanced feature could be an intelligent word or phrase suggestion mode that was switchable (on or off) that would operate as you write."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "klotzba",
          "Nb_Reviews": 7,
          "Date": "2022-06-17T05:43:13.000Z",
          "Titre": "This is a handy writing tool, but",
          "Contenu": "This is a handy writing tool, faster than thesaurus and goes well beyond that. However, it is far from perfect, which is why I gave it up for awhile.  Falls short in silly ways. This is just one example. It couldn't find another word for orange? Duh... how about tangerine? Come on, take a step outside the box. If we are looking for color words, this would suffice.I did come back to it because it's a timesaver, but I need to keep a list of all the times it fails me. Here's another one... relationship. No other word in the world can take the place of this one. I get the message there are no synonyms. How about marriage? Not perfect, but better then nothing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T01:37:15.000Z",
          "Titre": "I really like using MasterWriter",
          "Contenu": "I really like using MasterWriter. I primarily use it for rhymes, and it's great for that; it includes some inventive stuff that other applications don't have. The web interface makes it easy to use anywhere I am."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T15:01:03.000Z",
          "Titre": "I found that Master Writer is an…",
          "Contenu": "I found that Master Writer is an excellent venue for saving lyrics and creating them with the tools they provide. However, is there a way to record your songs and send the recordings to NSAI for evaluation?"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Dirk Darmstaedter",
          "Nb_Reviews": 3,
          "Date": "2022-06-24T09:48:36.000Z",
          "Titre": "I've been a MasterWriter user since… 2010",
          "Contenu": "I've been a MasterWriter user since many years. Having MasterWriter in the creative process is like having a good friend along for the ride watching and making careful suggestions every once in a while."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Francois",
          "Nb_Reviews": 2,
          "Date": "2022-11-11T03:44:10.000Z",
          "Titre": "Great",
          "Contenu": "Easy to use. Inspiring. Love it"
        },
        {
          "Note": 4,
          "Lieu": "KE",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T05:27:32.000Z",
          "Titre": "Master writer was helpful",
          "Contenu": "Master writer was helpful. Hi loved the analytical tools. I recommend it. My only challenge was there was a learning curve to use it effectively. I’m not sure I ever used it to its fullest."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 5,
          "Date": "2022-06-24T02:24:08.000Z",
          "Titre": "A very good tool!",
          "Contenu": "I like MasterWriter very much! It does take time to get use to how it works and what is is best at. It helps me primarily with song lyrics and rhyming words I may not have thought of."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mac",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T07:35:57.000Z",
          "Titre": "STILL A MAYBE",
          "Contenu": "I have Grammarly and found several discre[pencies. It was good on commas and periods but missed several when it should have been a period. I had higher expectations. Thank you,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2022-06-25T00:29:56.000Z",
          "Titre": "I use it mainly for rhymes",
          "Contenu": "I use it mainly for rhymes, and while it helps, I can think of at least a few rhymes every time I use it that do not appear in your database.  It's worth using though."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jared",
          "Nb_Reviews": 2,
          "Date": "2016-07-21T13:58:27.000Z",
          "Titre": "Amazing Tool!",
          "Contenu": "Masterwriter is an amazing tool that I use on virtually every song I write. It's a great way to streamline my writing process. My only complaint is that sometimes the web page will freeze on me and I have to refresh the web page to get it working again. This sometimes results in losing a lyric. Other than that I am perfectly happy with Masterwriter."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sonny",
          "Nb_Reviews": 2,
          "Date": "2022-06-16T23:45:59.000Z",
          "Titre": "Very useful",
          "Contenu": "Very useful! Still a few quirks, but overall a great tool. It would be great to be able to submit rhyme suggestions - sometimes I find one that's missing from the list."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melanie",
          "Nb_Reviews": 2,
          "Date": "2015-08-01T18:13:06.000Z",
          "Titre": "Great help in writing lyrics",
          "Contenu": "I think this is a wonderful program.  However, there are some glitches I get with working it.  It can freeze when I try to get the mp3 into the page to write the lyrics with it.  I wish there was a manual to go along with it in either html form or pdf form.  Other than that, the thesaurus, rhyming dictionary, regular dictionary help me so much.  Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bonnie",
          "Nb_Reviews": 1,
          "Date": "2016-03-30T13:59:27.000Z",
          "Titre": "What I think of Masterwriter",
          "Contenu": "I don’t know how to use ALL the features, but what I use, I get a lot out of. My main issue with the program is that it logs you out.....   I’ll be using it, then go into garageband to do some recording, go back to it, and have to log in all over again. I don’t know what the time-out limit is, but I wish it were longer, or I wish there was a button you could click to stay in the program. It’s really upsetting to the flow of writing when you have to log back in."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JD  Carroll",
          "Nb_Reviews": 4,
          "Date": "2022-07-21T20:09:18.000Z",
          "Titre": "I love the program",
          "Contenu": "I love the program. I wish the word processor functions were a little better. Easier access to simple functions like cut, copy & paste would be great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ally",
          "Nb_Reviews": 1,
          "Date": "2015-07-29T18:10:30.000Z",
          "Titre": "I'm a better lyricist because of Masterwriter, but with one suggestion..",
          "Contenu": "Only downfall with Masterwriter is, If you pay for a monthly subscription, with each billing cycle, they charge you one day sooner than the previous cycle. Eventually, you will pay for months you don't get to use. I can't be the only one who has caught this and I feel somewhat cheated/manipulated, like, \"If they don't notice it, we can get away with it\". This turned me off. Other than that, Masterwriter itself has helped tremendously with writer's block."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ADB",
          "Nb_Reviews": 1,
          "Date": "2015-12-25T15:37:19.000Z",
          "Titre": "Good idea but requires internet to work - I don't like that",
          "Contenu": "When I'm writing I want he freedom to create without dependency on an external resource.\r So I write in my composition book and transcribe to the MW site.  \r I am also concerned about the security of my original works being compromised - not that I'm that great, but many sites have been hacked, and someone would then have access to a lot of original ideas.\r I like the suggestions and the import export features.  This software helps to \"master\" the commposition."
        },
        {
          "Note": 4,
          "Lieu": "GT",
          "Pseudo": "Donna",
          "Nb_Reviews": 2,
          "Date": "2016-01-11T01:54:40.000Z",
          "Titre": "Great tool, unique options",
          "Contenu": "MasterWriter is like an artist's pallete, providing richer verbal color than a simple thesaurus (although sometimes the \"best\" word selection may still come through MW's thesaurus feature).\rI do look forward to an upgraded version that operates within Word and allows auto replace. It does allow you to collect your preferred choices for later reflection.\rSome common words yield surprisingly few search results, BUT the richness and versatility of what IS found makes up for it."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Leon",
          "Nb_Reviews": 3,
          "Date": "2016-02-18T12:45:41.000Z",
          "Titre": "Offline work",
          "Contenu": "I really like the functionality of your program but I am often offline due to traveling and cannot use your software. I find myself saving the text of a song and working on that in other software when traveling and not connected to the internet. This makes the song making process slightly more complicated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leeann",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T18:02:03.000Z",
          "Titre": "I really enjoy having all the writing…",
          "Contenu": "I really enjoy having all the writing tools in one place. I used to have to go to so many different sites for rhymes, thesaurus, dictionaries, etc. Having this has been amazing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael L",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T18:04:47.000Z",
          "Titre": "This is a very convenient tool for song…",
          "Contenu": "This is a very convenient tool for song writing. You can use other methods, but this app has everything right where you need it. I would recommend it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacie",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T17:45:04.000Z",
          "Titre": "If you are serious about your craft, MasterWriter is the app for you!",
          "Contenu": "It's easy to use, the tech's really know their stuff, and it's just a good program to be using."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tory",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T00:14:37.000Z",
          "Titre": "This software is exactly what I need to…",
          "Contenu": "This software is exactly what I need to keep my songs, ideas, etc. organized and accessible from any device."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 4,
          "Date": "2023-12-01T17:23:04.000Z",
          "Titre": "The software is fantastic",
          "Contenu": "The software is fantastic. When composing a song and you run into that holdup that you just can't seem to  move forward with you can count MasterWriter to be very helpful. Thanks for creating such amazing product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 5,
          "Date": "2023-11-22T14:22:51.000Z",
          "Titre": "A Great Writing App for Any Writer.",
          "Contenu": "The MasterWriter app works well as a word processor, but I find it has so much more to offer any writer. It instantly saves my work and the spell check is very accurate. But, this innovative app can help any writer in whatever field to broaden their writing skills with easy-to-use search categories like word families, synonyms, definitions, phrases, rhymes, and much more. Plus, informative Help Videos are included in the app to get you up and writing quickly. If you write for a living like I do or are just starting your career as a wordsmith, I can highly recommend MasterWriter to you as the most valuable arrow in your quiver."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlene",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T17:18:43.000Z",
          "Titre": "THE Best songwriter tool EVER",
          "Contenu": "I don't write a song without MasterWriter.  It's the best all in one tool for songwriters EVER.  With thesaurus, rhymes, definitions, and phrases all in one place, and one place to keep all my lyrics, it keeps me organized!  The ability to write different versions of a song is brilliant.  I started with MasterWriter years ago based on David Foster's endorsement.  I wouldn't be without it."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Hannah Ward",
          "Nb_Reviews": 12,
          "Date": "2023-11-18T21:12:16.000Z",
          "Titre": "Quite a confusing format (UPDATED)",
          "Contenu": "Quite a confusing format. Not sure how much I’ll use it. Seems to suggest a “new project” every time you look up a word which seems quite counterintuitive.EDITED ADDITION TO REVIEW ABOVE: I had a brilliant response from the company on this - unsurprisingly (to me) it was something I was doing wrong. Matt DeVorzon got in touch and sent me a personalised video, explaining some of the issues I was having, and also how to resolve them with the \"dictionaries\" function. Essentially, I was trying to create projects each time, rather than the dictionaries button. As I use Word for my writing, I just needed it as a search function, which is now working really well.Extremely impressed with the response and explanations, Masterwriter itself is really useful for any writers who need a wealth of words to choose from. Thanks Matt!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Libby",
          "Nb_Reviews": 3,
          "Date": "2023-10-19T04:32:18.000Z",
          "Titre": "Great for a \"smarter\" thesaurus",
          "Contenu": "I bought a Master Writer subscription because I've exhausted the built-in dictionary app thesaurus on my Mac. The options M.W. gives me are incredible. It's like it's actually thinking! Haha. This will transform my novel writing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T15:22:24.000Z",
          "Titre": "Indespensible Writing Tool",
          "Contenu": "I've been utilizing MasterWriter for the past month while I undertake the first revision of my novel. The numerous ways to search for the ideal word that elevates my writing is simple and straight forward. Working on a MacBook I was also able to easily launch MasterWriter.com in its own app. It would be great if there was someway to integrate MasterWriter into Scrivener. But for now, I am extremely happy with this indespensible writing tool."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harrison Greene",
          "Nb_Reviews": 6,
          "Date": "2023-11-23T03:43:58.000Z",
          "Titre": "MasterWriter -- the indispensable writers tool.",
          "Contenu": "MastrerWrtier is indispensable for writers.  It is of immense help.  The only thing they forgot was the word count... but I know they will add it.They are in process of adding word count."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T17:17:02.000Z",
          "Titre": "I picked up MasterWriter to help with rhyming poems.",
          "Contenu": "I picked up MasterWriter to see if it would help me write some rhyming poems. It was the best move I made for this year. You still need to have talent to write, but MasterWriter opens up possibilities the many direction to take your writing. Then, the dictionary had words not listed on Microsoft Grammarly. I found that hilarious. Best program ever!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MLNcustomer name",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T23:52:05.000Z",
          "Titre": "excellent writing tool",
          "Contenu": "excellent writing tool. direct, human & helpful support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martha",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T16:57:43.000Z",
          "Titre": "Songwriting made Simpler!",
          "Contenu": "At songwriting camp with John McCutcheon, I learned about and downloaded Master Writer, and it is a tremendous resource! Songs come together quickly when you have a rhyming dictionary and thesaurus like this handy. And being able to record works in progress is priceless where memory can fail to bring back that lick or turn of phrase that passed briefly though consciousness! With ease, I printed out my finished songs and performed them. It's a great tool for songwriters and poets! Like having a personal assistant to compose with!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Anthony Manning-Stanley",
          "Nb_Reviews": 16,
          "Date": "2023-10-08T12:53:11.000Z",
          "Titre": "The go-to software for songwriting",
          "Contenu": "The go-to software for songwriting. Not only providing rhymes, but synonyms, phrases and word families, all within a song-management framework. Could also be used for other writing forms."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clark",
          "Nb_Reviews": 3,
          "Date": "2023-08-08T23:01:00.000Z",
          "Titre": "Great tool for songwriting",
          "Contenu": "Great tool for songwriting!  In addition to having rhymes and other \"dictionary\" features at my fingertips, it is also a great tool for song prompts.  I have all my lyrics in one place where they can be accessed from any computer.  I can add audio, email them, keep various versions of songs - in short all the tools I need other than my keyboard!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joey",
          "Nb_Reviews": 3,
          "Date": "2023-06-10T21:30:58.000Z",
          "Titre": "Five-star customer service!",
          "Contenu": "My original review of one star was written without my understanding of how the program operates. That was my fault. Within a couple of hours of posting my too hastily submitted harsh review, I received a phone call from the vice president of the company, who explained exactly what MasterWriter was designed to do. He offered to refund my entire purchase price. However, after he cleared up my misconceptions I told him I wanted to try MasterWriter again for a few months to see whether it worked for me.I appreciate his reaching out to me personally."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheri Lynn",
          "Nb_Reviews": 2,
          "Date": "2023-07-26T07:13:35.000Z",
          "Titre": "Masterwriter is outstanding!",
          "Contenu": "I just paid for another 2 year membership with ease. I enjoy this program as it keeps all my song lyrics in one place with many features to help with writing song lyrics to have ready for a recordable song. Thanks for such an amazing program like Masterwriter!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrea",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T01:32:19.000Z",
          "Titre": "I'm hooked on Masterwriter!",
          "Contenu": "I'm hooked on Masterwriter. I don't even want to try to write lyrics without it. There are so many great options which not only help with things like rhyming, but also help to spawn additional idea. I used to used a rhyming dictionary, a thesaurus, and other things like dictionaries of colloquialisms and idioms. Masterwriter provides all of this! It's my go-to tool for writing and it helps that I be standing in line at the grocery store and I can work on a song on my phone. AND the tech support is top notch!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric  Toll",
          "Nb_Reviews": 5,
          "Date": "2022-12-30T02:05:27.000Z",
          "Titre": "When you need that just perfect word",
          "Contenu": "When writing for online or major publications, the right word makes the difference between an article and a story.Despite writing daily, I find that there are times when the perfect word will not quite come forward out of the mental cobwebs. MasterWriter delivers every time, even if I do not know the exact synonym -- or better still -- correct spelling. The site always come through with what I need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Irene Rodriguez",
          "Nb_Reviews": 2,
          "Date": "2023-06-30T00:05:55.000Z",
          "Titre": "MasterWriter has enhanced my writing…",
          "Contenu": "MasterWriter has enhanced my writing immensely. No longer am I pondering for hours day or night for tight, energizing and appropriate words.  In submitting my work, I was told my line edits were perfect and I had a natural talent for world building. And that is thanks to MasterWriter! I couldn't do without it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bernie Sims",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T02:12:13.000Z",
          "Titre": "MasterWriter adds several, valuable new tools to your toolkit.",
          "Contenu": "MasterWriter offers so many tools that you wouldn't even be thinking about - synonyms, expressions.  It just opens all kinds of doors vs. the typical process where you might just stop when you can't find a reasonable rhyme.  It really feeds the creative engine in so many ways."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan",
          "Nb_Reviews": 5,
          "Date": "2023-11-23T14:57:25.000Z",
          "Titre": "The creative tools master writer offers",
          "Contenu": "The creative tools master writer provide has help many times with my writer’s block.  Thank you Master Writer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Billy Livesay",
          "Nb_Reviews": 5,
          "Date": "2023-03-16T18:07:05.000Z",
          "Titre": "MasterWriter opens the door to a whole…",
          "Contenu": "MasterWriter opens the door to a whole new world of ideas. Not just the usefulness of different literary tools such as dictionary, thesaurus, synonyms etc., but it sparks ideas that one may have not thought of. I have written and released 5 albums which have been critically acclaimed since 2011 using MasterWriter. I have not used the recording capability. I also feel the earlier version was a bit more in depth."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sebati",
          "Nb_Reviews": 4,
          "Date": "2023-09-01T04:30:50.000Z",
          "Titre": "Superb!!!",
          "Contenu": "Vocabulary is the spice of every great story, Masterwriter has helped me transform my novel from ordinary to extraordinary, many times I feel like a kid in a candy store. Masterwriter should be every artist's companion."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T14:01:43.000Z",
          "Titre": "I switched MacBook Pro computers last…",
          "Contenu": "I switched MacBook Pro computers last year and discovered my old download version did not work with the new operating system and thought I had lost all of my songs.  Once I went on line and subscribed I could use my old files for all of my songs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael James",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T06:09:27.000Z",
          "Titre": "Key to the Kingdom",
          "Contenu": "Masterwriter keeps my thoughts (words and music) organized to the point where I can super easily bounce from idea to idea with clarity and confidence. The fact that nothing ever gets lost unlocks my creative potential. Some days I do three separate cowriting sessions, and can later return to the songs without missing a beat. I've been a satisfied customer since version one. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony Factor",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T13:33:21.000Z",
          "Titre": "Great program, but not for me.",
          "Contenu": "Even though I was not happy with Master Writer program, I do think the production and layout is great. The tools provided are very impressive. I’ve been a songwriter for many years and have developed a rhythm with free apps and tools to help me in my journey. Some apps I’ve paid for. But it’s a 3 or 4 dollars each time. So trying to be convinced to pay more is a hard line to accept. But after trying the program, I know now what it is and what its not and have a better opinion. I think it would be amazing for some people. But not for everyone. I still give it 5 stars for its quality and strong comprehensiveness."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ron",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T17:33:03.000Z",
          "Titre": "the best dictionary plus",
          "Contenu": "Great customer service. I recommend this for anyone wanting to write a song or book. Matt was very helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jackzone",
          "Nb_Reviews": 6,
          "Date": "2023-03-29T03:34:07.000Z",
          "Titre": "My first cowriter!",
          "Contenu": "The ease with which you can navigate a lyric is like a running dialogue between several cowriters. New ideas get fostered by unexpected rhymes. They can alter a  story line or just smooth it out and make it sound conversational."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy Shay",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T12:27:54.000Z",
          "Titre": "Flow State Activation",
          "Contenu": "Sure you can use Google Docs or Evernote but this app is dedicated to lyric writing. Once opened, there is no need to open up other tabs or consult a rhyming dictionary - everything is integrated. In the age of information overload, this is a phenomenal tool for activating and sustaining flow state. This alone is worth the cost of admission!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Conley",
          "Nb_Reviews": 5,
          "Date": "2023-07-25T23:08:05.000Z",
          "Titre": "I like it. Easy to use.",
          "Contenu": "It has worked better for me than anything I have used in the past.All the other ones, and there have been quite a few always ended up with me losing my project due to some computer snafu that I couldn't figure out. I still have those songs but can't open the file, or if I can it's unreadable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MW Duncan",
          "Nb_Reviews": 4,
          "Date": "2023-02-23T01:19:57.000Z",
          "Titre": "A GLITCH CORRECTED",
          "Contenu": "M.R. Is a rare class act co.=====================I was contacted by Matt with Master Writer to express theirConcern of the handling of an unfortunate breakdown of communication between Master Writer and myself. The communication was resolved being to both of our satisfaction. Formerly being a member a few years back and having former association with Master Writer without problems I will re associate myself with them again. Master Writer is a valuable asset to writers as it is for me being a songwriter in Nashville ..Thank You,Mike DuncanGallatin, Tn"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Rhonda Gallant-Morari",
          "Nb_Reviews": 2,
          "Date": "2022-10-14T04:17:03.000Z",
          "Titre": "I really enjoy this app",
          "Contenu": "I really enjoy this app.  It helps me find that elusive word that fits into a line. Lyrics are the more challenging part of my songwriting practice and Master Writer has saved me on many occasions! Just tonight, I worked on a line that needed a rhyme and needed to convey a certain meaning. It just wasn't coming until I opened the app, typed in the word needing a rhyme.  And there it was! This app speeds up the writing process for me.  Yes, I would recommend this for any songwriter: beginner, intermediate or professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ric",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T07:51:58.000Z",
          "Titre": "Focus is there",
          "Contenu": "MasterWriter makes lyric writing much more efficient that I imagined. Everything you need - demo, rough draft, research materials, etc. - is all in one place. The hardest part of MasterWriter is finally convincing yourself to put old habits in the drawer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Bohlen",
          "Nb_Reviews": 2,
          "Date": "2023-10-19T23:59:17.000Z",
          "Titre": "Very valuable tool",
          "Contenu": "I believe this is a very valuable tool. I’m stating to really get into it and rely on it first. I believe it’s triggering better ideas and writing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Shadbolt",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T00:03:08.000Z",
          "Titre": "MasterWriter is a helpful resource",
          "Contenu": "MasterWriter is a helpful resource when I'm struggling to come up with a word or phrase that works with my song. I like working with it a lot, but it might be even better if it had an option to do musical notation, at least for the melody line of the song. I don't know if that's even possible to incorporate, but it's just a thought."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reid",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T22:01:25.000Z",
          "Titre": "Great for writing, but lacks other features",
          "Contenu": "UPDATED:After I wrote the below review, I was contacted by customer support. They helped me with understanding how the Group function works and how I can use that to do many of the things that I was missing for tracking and categorizing songs. Also how to eliminate the website link from being printed. Plus they added some of my suggestions to review as possible future features. Top notch support! Updated my review to 5 stars!-------------The writing part works great. Great resources for finding the right words. I think it lacks in other functionality that would benefit the songwriter. Such as track the song after writing (copywrite info, publisher or promotional info), Printing functionality (does not print any composer information, copyright info, dates...). I hate that it prints the web address! Not pro looking printing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Faulkner",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T17:32:03.000Z",
          "Titre": "This is the only tool I use",
          "Contenu": "This is the only tool I use. Super intuitive for finding the right words and phrases that complete the creative process and then quickly record those ideas. Every time I find myself stuck in a song, it seems like Masterwriter gets me out of that jam."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2023-05-09T21:48:42.000Z",
          "Titre": "I have been looking for something like this",
          "Contenu": "I have been looking for something like Master Writer for years, it can be very helpful when you run out of ideas, being endorsed by David Foster is a definite plus, it gives you an idea on how goGood it is."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HARRIET SCHOCK",
          "Nb_Reviews": 6,
          "Date": "2023-01-07T23:49:26.000Z",
          "Titre": "Everything I need in one place!",
          "Contenu": "Since I have had Master Writer, I have written or co-written four musicals which would not have been written had I not had all the tools of Master Writer in one place. Now I simply write every song with it. I can't imagine trying to write a song with my Clement Wood rhyming dictionary and a thesaurus and even these do not give me a fraction of what Master Writer does."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "rapdup",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T21:29:49.000Z",
          "Titre": "Great for Lyrics",
          "Contenu": "The word/phrase look-up features are really helpful. Would love to see the ability to format text a bit to help with organization.Update: Actually, it does have text formatting, so bumping to five stars!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Damon Foreman",
          "Nb_Reviews": 3,
          "Date": "2023-10-20T16:47:45.000Z",
          "Titre": "I really like the ‘landing page as well…",
          "Contenu": "I really like the ‘landing page as well as the ease of use .The program is quite effective in expanding lyric ideas."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 2,
          "Date": "2023-02-07T18:29:00.000Z",
          "Titre": "MasterWriter Makes Creating Easy!",
          "Contenu": "I love everything about MasterWriter... The big change for me was being able to write in a paperless environment and have all the resources I need to rewrite and edit in the same place.  Being able to uplaod the music that goes with my lyrics and share them from the same location is also a time saver that I find makes the task effortless.  Thank you for your efforts on behalf of us songwriters!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Todd",
          "Nb_Reviews": 2,
          "Date": "2023-03-24T23:18:28.000Z",
          "Titre": "I gave a poor review before because I…",
          "Contenu": "I gave a poor review before because I didn't understand how to properly use Masterwriter. Well after a very nice phone call with Matt all was explained to me. Now I am using Masterwriter with my WP and all is great. Masterwriter is great to use, it gives my writing a boost where I need it. Thanks Matt for taking time from your day and help me get started."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cynthia-HighlandsRecordingArts",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T04:18:30.000Z",
          "Titre": "Master Writer - Invaluable aid since I first purchasd it on floppy.",
          "Contenu": "I have been using Master Writer, since I first bought it on floppy disks, many years ago.  As a singer-songwriter, I dreaded the writers block phenomena. When I found Master Writer all those years ago - I didn't worry about it any longer. I have used it 100 times not only to get past writers block, but to fuel thoughts for a new song or a new song concept. It continues to this day to be an invaluable artistic aid."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T19:47:13.000Z",
          "Titre": "This is a useful tool for songwriters",
          "Contenu": "This is a useful tool for songwriters.  I mainly use the rhyming feature, but some of the others as well.  My only concern about it is storing all my songs in it, as a personal matter, if I decide to leave the system how I get all of that information back out.  For what I use it for, I am not sure I would pay $100 a year, but at $50, which is what I renewed it, I feel it is a good value and would recommend this to any songwriter."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yio D'Arcangelis",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T03:12:00.000Z",
          "Titre": "An Indispensable Tool",
          "Contenu": "For the last 15 years I've been using MasterWriter, in one form or another, as a tool in my songwriting toolkit and MasterWriter has alway been true to their word. Never stare at a blank page ever again! Thank you, MasterWriter."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2023-04-25T09:27:20.000Z",
          "Titre": "Better Then Ever",
          "Contenu": "I had used Master Writer a few years ago, and I've come back to it now that I'm back into songwriting.Today's version provides a great user experience supported by tools that help me focus on creativity instead of thumbing through my rhyming dictionary and thesaurus. It also helps with brainstorming by suggesting idioms, alliteration and so on."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T01:43:23.000Z",
          "Titre": "Writing is laborious",
          "Contenu": "Writing is laborious; good writing is more so. MasterWriter takes it to an almost enjoyable level! I use it for all my writing. I particularly like the Word Families dictionary as it enlivens my communication. When I have difficulty putting thoughts to paper I rely on MasterWriter’s tools to help me unscramble my thoughts. As a bonus, the constant reliance on the app has actually made me a better writer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T23:05:22.000Z",
          "Titre": "I used them before my cancer so I'm…",
          "Contenu": "I used them before my cancer so I'm glad to be able to start with them again. They have lots of avenues for you to go sometime I couldn't find the right words an they're system got me where I wanted to get to"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Will",
          "Nb_Reviews": 2,
          "Date": "2023-03-12T00:54:23.000Z",
          "Titre": "I’d like it better if there was an app…",
          "Contenu": "Update! Masterwriter promptly replied to my review wanting to know how they could improve. Honestly, other than not having an app currently, it’s a very good songwriting tool. In the past, I used the program on my computer. Now I primarily write on my phone and have grown accustomed to my current process. While Masterwriter is an all-in-one program with a massive dictionary of rhymes, a thesaurus, and so much more, I just didn’t feel like it was for me at this time. When they develop the app, I may try it again. Many thanks to Masterwriter for reaching out to me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet",
          "Nb_Reviews": 2,
          "Date": "2023-03-24T05:55:13.000Z",
          "Titre": "Efficient and Readily Available",
          "Contenu": "Because my previous program was an obsolete CD, I was forced to use two laptops side by side, I subscribed to Master Writer. As a published author, I find it efficient and provides all the tools I need readily available with a click while I am writing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Ciardella",
          "Nb_Reviews": 3,
          "Date": "2023-02-21T21:24:37.000Z",
          "Titre": "Successful Author Because of MasterWriter",
          "Contenu": "You helped me get my book, The Dealer, How One California Dealership Fueled the Rise of Ferrari Cars in America, published successfully. I could not have written it without your help. Thank you. Jim Ciardella"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Henry Garrison",
          "Nb_Reviews": 2,
          "Date": "2023-07-15T01:30:03.000Z",
          "Titre": "Best on the Market",
          "Contenu": "I used to keep a total of 6 books beside me when writing. They collectively helped me find words when I was stuck. Master writer is a dream because everything I need plus some I right with me, accessible to the page I’m writing. What could better than that. I’ve been using Master Writer for 10+ years and will continue to do so."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T22:39:18.000Z",
          "Titre": "instant access to words and helping generate ideas!",
          "Contenu": "Masterwriter stimulates creativity by helping me find words and phrases that sound natural quickly and efficiently. It helps me keep my message on point, and saves me valuable time in the process.I love it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clare",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T21:36:11.000Z",
          "Titre": "I use Masterwriter all the time and…",
          "Contenu": "I use Masterwriter all the time and really enjoy having a place to keep my lyrics and send audio files to make things easier in working with my co-writers.  I write a lot of songs so this really helps keep me organized."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelley Kelley",
          "Nb_Reviews": 2,
          "Date": "2023-08-16T03:25:36.000Z",
          "Titre": "Longtime user here",
          "Contenu": "Longtime user here. Since Master Writer was on CD.  It’s my go to when writing lyrics. I still think the formatting for printing could be better. Like, put all lyrics on one page or screen for better workflow. But it’s like my best friend for writing quick."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donny",
          "Nb_Reviews": 6,
          "Date": "2023-05-13T05:03:56.000Z",
          "Titre": "An invaluable tool for songwriters",
          "Contenu": "An invaluable tool for songwriters.  Not only are great resources provided like a very comprehensive rhyming dictionary, but you have a convenient location for all your work-in-progress as well as an archive of all your finished work all together in one place that is accessible from anywhere and from any device.  I use MasterWriter even to capture all my new ideas.  Great knowing they're right there in MasterWriter ready for me to work on all the way to completion.  Plus all your work gets automatically dated when you start work on it giving you a chronological record of your creative journey.  MasterWriter also has great customer support if ever needed."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "PRODOS",
          "Nb_Reviews": 9,
          "Date": "2022-10-18T00:45:06.000Z",
          "Titre": "For songwriters who prefer to craft their lyrics while experimenting a bit",
          "Contenu": "I've been finding MasterWriter to be a very helpful, user-friendly tool for exploring and testing lyrics and rhymes. It's not based on AI (so-called \"Artificial Intelligence\"). Rather, it relies on making available all sorts of comprehensive, practical references and guides that, in my experience, serious songwriters use anyway. But MasterWriter brings them all together in a way that's fast, vast, and very convenient. It's not magic and it doesn't pretend to take over the lyric-writing process. The design is a bit \"old-fashioned\" in its look, but the functionality is 100% robust.I think it's best suited to songwriters who take pride in really crafting their songs in their own, unique way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lorrie Singer",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T18:52:05.000Z",
          "Titre": "Best tech and customer service anywhere!",
          "Contenu": "My Masterwriter had expired before I could upgrade it, and they went all out to help me get my new, current version going.  They really researched the issues I was having and they were there for me every step of the way.  Matt is amazing - everyone at Masterwriter is at the top of their game and their customer service is fabulous - has been since the start.  They get a 10 out of 10 from me - how about 100 out of 10?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Songwriter",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T15:48:21.000Z",
          "Titre": "I love the easy access to all sorts of…",
          "Contenu": "I love the easy access to all sorts of tools including rhyming and thesaurus- it makes for on the spot inspiration! The archive of songs I have written is so easy to access if I need to go back for any reason. I also love the fact that you can write versions of songs without overwriting. Great platform!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T19:07:13.000Z",
          "Titre": "A uniquely helpful tool for writers of all genres.",
          "Contenu": "I've been using Masterwriter almost since its inception twenty years ago. It is the most uniquely useful program I've ever seen for finding that perfect word, phrase, or concept, when the creative mind can't quite get there on its own. I've used it as a honing tool for my prose, poetry, songs, technical writing, and even simply to brainstorm new ideas in general. When I feel that nearly imperceptible dissatisfaction with a turn of phrase or a word that I know is close but not quite what I'm trying to convey, Masterwriter gives me many alternatives, both words and phrases, that will offer exactly the answer I needed, or just as often presents me with a whole new bank of ideas that gives the work an exciting turn I hadn't contemplated. Five stars for this unique program that does what no other resource can do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darren Grasso",
          "Nb_Reviews": 3,
          "Date": "2022-11-11T22:12:53.000Z",
          "Titre": "Master Writer Helps!!!!",
          "Contenu": "Love the feature of completing the sentence and wider / widest rhyme matching. I don’t want to use ‘in a sentence’ phrase for phrase, but it certainly helps spark the creative process in a positive direction when you feel like you’re stuck."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Louis",
          "Nb_Reviews": 2,
          "Date": "2023-05-30T17:28:42.000Z",
          "Titre": "An all around great tool for communicating",
          "Contenu": "This is a great resource for finding the perfect word or phrase or any of the other options MasterWriter hasIt also has helped in broadening my vocabulary in writing poems, email or in person eye to eye conversations"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cassandra Lavender",
          "Nb_Reviews": 2,
          "Date": "2023-03-29T19:41:11.000Z",
          "Titre": "NO LONGER BOUND",
          "Contenu": "First, I've known about MasterWriter since it started. Now I have a chance to use it. I have not finished the song yet, but I will. I like that everything I need to develop my songwriting is in one app on my phone. I am not bound, I can expand my songwriting vocabulary and create better song lyrics."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald A",
          "Nb_Reviews": 3,
          "Date": "2023-06-09T01:37:22.000Z",
          "Titre": "Great aid for writers!",
          "Contenu": "As I am not very Tech savvy, the tutorial was very helpful. In addition, Matt was outstanding when I needed extra help. Many thanks. This system is terrific for writers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 2,
          "Date": "2023-04-06T21:45:05.000Z",
          "Titre": "MasterWriter became a better for me the second time around",
          "Contenu": "A couple years ago I wrote a review giving MasterWriter one star and may have said , I found MasterWriter not very useful. I was just starting to write ideas down and nothing was lyrically happening so I stop even trying use it. I continued I increase my song writing skill by reading books on song writing and really started paying close attention to great lyrics. So I decided to give MasterWriter another shot because I felt I might have a more descriptive direction to what I want to say and needed to find a creative rhyme and MasterWriter really has been an outstanding tool. So maybe the first time I was to impatient but now I am writing more and enjoying using MasterWriter."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Christian Ingebrigtsen",
          "Nb_Reviews": 2,
          "Date": "2023-08-24T09:29:17.000Z",
          "Titre": "Fantastic tool for songwriting",
          "Contenu": "Fantastic tool for songwriting. I've used it for years, and it's helped me write some of my best songs. Great for organising and keeping track of who I wrote which songs with as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liz",
          "Nb_Reviews": 2,
          "Date": "2023-03-13T23:15:31.000Z",
          "Titre": "MasterWriter really helped me spice up…",
          "Contenu": "MasterWriter really helped me spice up my novel with an alternative word that changed the trajectory of the paragraph. Made me feel like a writer and not a hack."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Skelly",
          "Nb_Reviews": 9,
          "Date": "2022-11-04T17:34:46.000Z",
          "Titre": "MasterWriter provides a new level of writing",
          "Contenu": "MasterWriter has sent me to a whole new level of writing and imagination. MasterWriter is a must-have tool for any author, writer, editor, and all of the above. Worth every penny."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOSE",
          "Nb_Reviews": 3,
          "Date": "2022-10-06T00:37:45.000Z",
          "Titre": "Assistant  buddy",
          "Contenu": "Best writing assistant ever created.Since I started using MW I been writing 1 song per week.However, I wish you had the Spanish version of this program.Thank you MW"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ginette",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T18:21:36.000Z",
          "Titre": "Love MasterWriter",
          "Contenu": "Love MasterWriter, fantastic resource. Had a little problem with my subscription renewal but Matt DeVorzon and Madeleine M were super helpful and friendly, they fixed the problem without delay. Very much appreciated and I will continue to subscribe to MasterWriter."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "semiosphere consulting",
          "Nb_Reviews": 3,
          "Date": "2023-03-28T00:49:44.000Z",
          "Titre": "Good. Helps me.",
          "Contenu": "I likevhaving all my songs im working on in the same place instead of wherever i save them, and then cant find.Good rhyming dictionary.  I like being able to record a melody that goes with the lyrics and vice versa."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kimberly",
          "Nb_Reviews": 2,
          "Date": "2023-06-20T18:19:41.000Z",
          "Titre": "I MasterWriter is an incredible product…",
          "Contenu": "I MasterWriter is an incredible product that helps writers perfect their not only their projects but their skills as writers it’s definitely worth getting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 4,
          "Date": "2023-08-22T19:05:50.000Z",
          "Titre": "Me and My Co Writer",
          "Contenu": "It's like I have another set of eyes and ears. If the words don't come, I just ask my co writer what they can come up with. I'm very pleased with my co writers ideas, suggestions. I think we'll be writing together for a long , long time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T21:11:29.000Z",
          "Titre": "The application is great",
          "Contenu": "The application is great. It has helped my song writing, not with the tools, but just that I have a central location for my stuff and I can easily share."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rich",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T01:32:13.000Z",
          "Titre": "I'm an old man now,but it's a lot of fun",
          "Contenu": "I'm an old man now, 71. I put the guitar down for about 30 years or so, never was very good. But a friend of mine passed away and his brother gave me his old Gibson Gospel. It rekindled my interest in the guitar and I kept remembering bits and pieces of songs I started making up when I was in my 20's. Your site has been great as I try to finish a few of those old ideas and a few new ones. It's a lot of fun."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Phil",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T22:37:08.000Z",
          "Titre": "I like being able to keep my thoughts…",
          "Contenu": "I like being able to keep my thoughts and ideas separately for all songs, from just starting to completed. Have been using MasterWriter for close to 15 years."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T04:48:13.000Z",
          "Titre": "MasterWriter is fantastic",
          "Contenu": "MasterWriter is fantastic! Its one of the best tools I have in my writers box!Only downside I have is that you cant purchase lifetime membership and instead have to stick to subscription."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "indie writer & publisher",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T18:51:19.000Z",
          "Titre": "Time saver!",
          "Contenu": "I have only had a short time to \"play\" with this program but LOVING it. So fun having a helper, assistant, editor, and sounding board all in one place!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Claggett",
          "Nb_Reviews": 2,
          "Date": "2022-12-30T05:22:28.000Z",
          "Titre": "Happy to be back with MasterWriter",
          "Contenu": "The last round of updates were significant enough for my needs that I switched back to MasterWriter.  Additionally, all of my support questions have always been answered."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Thomas",
          "Nb_Reviews": 2,
          "Date": "2023-10-13T21:55:36.000Z",
          "Titre": "My volcubalary is deminishing because…",
          "Contenu": "My volcubalary is deminishing because of old age. Master Writer helps a lot."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Porter Jr",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T17:49:52.000Z",
          "Titre": "Getting the software is easier than…",
          "Contenu": "Getting the software is easier than using the software but I'm trying"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Davidson",
          "Nb_Reviews": 5,
          "Date": "2023-03-10T00:11:27.000Z",
          "Titre": "Best songwriting tool on the market",
          "Contenu": "Best songwriting tool on the market.  Have used it for years and am so thankful to see the newest features and functionality.  Keep up the good work folks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sedly Bloomfield",
          "Nb_Reviews": 2,
          "Date": "2023-05-05T04:36:25.000Z",
          "Titre": "This program rocks the world for…",
          "Contenu": "This program rocks the world for writers, being a world writer for episodic TV, scenes, monologues,and booksThis has changed my life and has given me the powerfor the perfect words.Sedly Bloomfield"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Jacques M Gentil",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T00:16:06.000Z",
          "Titre": "Long time user.",
          "Contenu": "I have been a Masterwriter user since it's version 2.0 which I still sometime use on the computer and now online version 3.0. It's allowed me to write songs that has won me songwriters awards."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eleanor Sweetwood",
          "Nb_Reviews": 9,
          "Date": "2023-04-21T15:18:05.000Z",
          "Titre": "Another tool in my arsenal as a writer",
          "Contenu": "Another tool in my arsenal as a writer. I love having it at my disposal when writing my book. Easy to use and I have only scratched the surface of what it has to offer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2022-11-30T06:32:15.000Z",
          "Titre": "I have been using MasterWriter for…",
          "Contenu": "I have been using MasterWriter for several years. It’s a great tool box for songwriters and an awesome way to save, edit and document work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Raymond",
          "Nb_Reviews": 1,
          "Date": "2022-10-09T23:30:44.000Z",
          "Titre": "Every time I call with a question or…",
          "Contenu": "Every time I call with a question or concern the call is returned promptly and professionally from the staff.MasterWriter is a great resource to put a thought to paper."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T18:54:12.000Z",
          "Titre": "Works as advertised",
          "Contenu": "Works as advertised, which is to say GREAT.I've been using it for songwriting, corporate creative work, and more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rico Dawson",
          "Nb_Reviews": 1,
          "Date": "2022-11-20T22:06:22.000Z",
          "Titre": "Masterwriter has allowed me to unlock…Unlock writers block",
          "Contenu": "Masterwriter has allowed me to unlock my writers block to be able to complete the final song on my new album that will be coming out in 2023."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beverly",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T04:08:41.000Z",
          "Titre": "I received excellent service when I ran…",
          "Contenu": "I received excellent service when I ran into difficulty understanding how to best use all the assets of the site. The person helping me was patient and we got the situation handled to my satisfaction."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Michael Kleimert",
          "Nb_Reviews": 2,
          "Date": "2022-12-21T23:59:59.000Z",
          "Titre": "Great tool to give you new ideas when…",
          "Contenu": "Great tool to give you new ideas when you’re stuck or need a bit of inspiration. I also find it very practical as the central place and storage for all my lyric ideas.Michael"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Gene Pringle",
          "Nb_Reviews": 3,
          "Date": "2023-05-30T23:00:42.000Z",
          "Titre": "The download was easy, support great",
          "Contenu": "The download was easy plus support walked me through uploading the files from my previous version on an older computer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gina",
          "Nb_Reviews": 6,
          "Date": "2023-06-28T04:48:52.000Z",
          "Titre": "Masterwriter makes it EASIER for Songwriters!",
          "Contenu": "Makes it EASY for me to organize,and get my Lyrics typed.GOOD to have the major parts to my Songs in ONE Place! Lyrics,Melody,Harmony.Reasonable Monthly rate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harry",
          "Nb_Reviews": 3,
          "Date": "2022-10-14T12:44:37.000Z",
          "Titre": "Very Helpful",
          "Contenu": "I am a poor speller and have a comma problem. Love the fact my misspelling is corrected and that comma help is rendered as needed. Also like that the program works on all my platforms including email."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PERRY D",
          "Nb_Reviews": 3,
          "Date": "2022-11-05T15:38:40.000Z",
          "Titre": "MasterWriter is a wonderful toolbox",
          "Contenu": "MasterWriter is a wonderful toolbox of several features that greatly assists me in writing a lyric. Any time I write, I always have MasterWriter open and ready to help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Bradle y",
          "Nb_Reviews": 3,
          "Date": "2022-11-17T03:26:29.000Z",
          "Titre": "I’m a writer and your app has been…",
          "Contenu": "I’m a writer and your app has been invaluable in my soon to be published novel. Thanks for providing a decidedly use fool writing tool."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alvin Fritzke",
          "Nb_Reviews": 2,
          "Date": "2023-07-10T20:04:05.000Z",
          "Titre": "What I like quite well are the many…",
          "Contenu": "What I like quite well are the many options you can work with. And within the options you have an abundance of choices. The Word Families section is really good.  It’s a way to work with feelings."
        }
      ]
    }
  ]
}