{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "maxandfix.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen Harris",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:39:42.000Z",
          "Titre": "Very 😡",
          "Contenu": "Do not like the fact that the item is refurbished for the amount of money that was spent"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nikole Jones",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T13:09:55.000Z",
          "Titre": "Yesterday was my daughter’s birthday…",
          "Contenu": "Yesterday was my daughter’s birthday and this is the first time it was taking out the box it doesn’t hold a charge and now that it’s plugged up it has a black screen"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Collins",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T21:06:01.000Z",
          "Titre": "Use my personal data for nothing.",
          "Contenu": "Use my personal data for freeI ordered a macbook, the address was correct. They asked me to verify with a photo of my driver's license, so I did. They sent a letter that the order was about to be sent. I was counting on this product.12 hours later they canceled the order without contacting me or any information at all. I recommend you not to contact this store, they will waste your time and ask for your details for nothing. Their approach to business is repulsive and outrageous.Their 1 st reply:We greatly appreciate your assistance in helping us maintain a secure environment against fraud for both you and our shop. Now that we're all secure, we're excited to tell you that your order is on its way and will be shipped out ASAP!And after:Order #2360 was canceled because of unforeseen circumstances and your payment has been voided.Why you Answer me order will be shipped out and after it cancel? Timewasters."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul Spensberger",
          "Nb_Reviews": 1,
          "Date": "2021-02-19T21:51:06.000Z",
          "Titre": "Maxandflix supposedly sent me my apple…",
          "Contenu": "Maxandflix supposedly sent me my apple MacBook Pro I ordered. Fedex supposedly delivered it. I have cameras they did not deliver it. 30 phone calls later maxandfix at first acted like they were going to help me but now since I’m stuck in this contract and I had to pay they don’t care about the customer. So I’m out of a apple MacBook Pro that I never received and I’m paying $128 a month for 12 months. I honestly believe maxandfix(Dominic) are working together and screwing over their customers."
        },
        {
          "Note": 1,
          "Lieu": "JM",
          "Pseudo": "mona_ jae20",
          "Nb_Reviews": 1,
          "Date": "2021-11-12T14:14:05.000Z",
          "Titre": "Not ORIGINAL PACKAGING AND NOT NEW PRODUCT!",
          "Contenu": "The product is not new! The charger and adapter says made in China and is not the original Apple product! The package was a random box, NOT THE ORIGINAL APPLE PACKAGE! I got it yesterday and I immediately called to return it, but I was told they can only exchange due to Covid! That’s a lame excuse! I am not pleased with this purchase and demand a refund! Also, I purchased a phone from this company before and I was pleased that’s why I returned for a second purchase and I am utterly disappointed with this recent purchase!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jason Pouliot",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T19:15:17.000Z",
          "Titre": "Sold me broken IPhone 7",
          "Contenu": "I purchased a iPhone as a Christmas gift. They sent me a broken phone. It says on their website they offer exchanges or refunds, they ended up telling me exchange only because of covid! I needed the phone in time for Christmas. I had to pay for return shipping and two months later Feb 8th they finally sent me a exchange phone I do not need!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John DeNoma III",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T04:51:59.000Z",
          "Titre": "Ordering was quick and easy but...",
          "Contenu": "Ordering was quick and easy.  I really appreciate the Katapult leasing option.what I DIDNT like is the flurry of emails and text messages telling me \"We want to upgrade you at no extra cost!\" and \"ACTION NEEDED! \"  I find this extremely invasive and will most likely avoid ordering from here in the future"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ken Kelley",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T18:48:28.000Z",
          "Titre": "Product bait and switch. Do not buy from these folks.",
          "Contenu": "Ordered product listed as \"Apple Smart Folio for iPad Air 10.9-inch (5th and 4th Generation)\" and received \"ProCase iPad Air 5th Generation Case 2022 / iPad Air 4th 2020\" listed on Amazon for $12.99Feb 22 update... Customer service resolved the problem by refunding my purchase price and providing a return shipping label. While Satisfied with the resolution, I am disappointed that they did not have or deliver the product I ordered from their site, wasting my time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ruby Red",
          "Nb_Reviews": 1,
          "Date": "2021-06-19T15:12:20.000Z",
          "Titre": "Awesome very kind service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Victor Kangkolo",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T18:55:05.000Z",
          "Titre": "Shipping item on time and the item…",
          "Contenu": "Shipping item on time and the item received undamaged"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Iluminada Aponte",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T03:51:57.000Z",
          "Titre": "Computer came fast but i didnt know it…",
          "Contenu": "Computer came fast but i didnt know it was coming until the day of after waiting a couple days with no update"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ahmad",
          "Nb_Reviews": 1,
          "Date": "2021-09-22T14:28:54.000Z",
          "Titre": "Thanks for your services",
          "Contenu": "Thanks for your services , got my computer all working"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nikole",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T22:32:02.000Z",
          "Titre": "I was having issues with my newly…",
          "Contenu": "I was having issues with my newly purchased IPad and Maxandfix went above and beyond to make sure the battery issue was resolved. I am please with the service provided."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis Coppin, Jr",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T00:17:07.000Z",
          "Titre": "Fantastic site for refurbished Apple and new products.",
          "Contenu": "What a fantastic site. I stumbled upon this site but never made a purchase until today. The prices were great and the fact that you can stretch out payments, if that’s your option, to make life that much easier. The customer service person called me to make sure of my purchases, this was a first for me. In addition, I received a text about an item I purchased wasn’t a newer one at no additional charge. Blew my mind. Thank you for the, overall, great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tonya Nichols",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T16:53:36.000Z",
          "Titre": "I was definitely skeptical… I’m not…",
          "Contenu": "I was definitely skeptical… I’m not going to lie. My old MacBook blacked on and would not come back on and I needed a new one ASAP but didn’t have the money to purchase one full out. Maxandfix is just what I needed and I received my new MacBook in less than 3 days… I have had no issues and it’s exactly what I needed and wanted. I definitely recommend them to anyone and everyone. You will not be disappointed and the customer service is A+"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Ortega",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T22:05:49.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service, easy process buying with Katapult, and quick shipping. Amazing experience! I can't wait for more in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diana Pickett",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T19:19:23.000Z",
          "Titre": "Excellent customer service!!!",
          "Contenu": "I have spoke with Brian with customer service through this whole process and I am so excited and grateful. I needed customer service because I wanted to upgrade my shipping. From ordering to shipping I'm so happy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandi Gonzales",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T18:42:47.000Z",
          "Titre": "100% happy customer!",
          "Contenu": "Even though one app was not at all by any means accurate on my order, customer service was great and amazing! When I started having concerns about my order, they were very responsive and basically immediate! Phone is certified refurbished and in pristine condition! No scratches, cracks or proof it was ever previously used. Thank you all so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis Coppin, Jr",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T01:58:09.000Z",
          "Titre": "Fantastic prices and the availability…",
          "Contenu": "Fantastic prices and the availability of the items I was looking for and wasn’t looking for. I’m glad I shopped here. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kamiah brooks",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T21:12:30.000Z",
          "Titre": "Great product",
          "Contenu": "I purchased a pair of Airpod pros as a gift and my daughter is very happy with them. I was a little confused after my purchase but a rep from Maxandfix reached out and resolved my issue. Will be making another purchase soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tristan Baker",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T19:41:04.000Z",
          "Titre": "Excellent customer Service",
          "Contenu": "For some strange reason, we could not get our order to process ourselves. We began a chat , that turned into a Rep calling us immediately! The rep ordered our items, entered the July discount, fixed our payment issues, and even shipped to my sons Dorm!  i never heard of this company before this, and they have a overly happy customer!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Finn",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T20:42:46.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. Very friendly yet professional and good follow up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Audy D.  Portland Oregon",
          "Nb_Reviews": 3,
          "Date": "2023-04-21T03:47:52.000Z",
          "Titre": "Good service/ good product/ good customer service",
          "Contenu": "I received a like new computer (2017) that is very clean and responding well to set up.  There was some kind of glitch in my order and one of their reps called me and it took me a long time and several calls back to get it straightened out (I think it was my error in the first place) and the rep was so patient, kind, helpful and relaxed.  It made what could have been an anxious  experience into a very good experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Vega",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T20:54:10.000Z",
          "Titre": "Outstanding products and customer service!!",
          "Contenu": "Maxandfix sells great products, gets them to you fast and their customer service is outstanding! Shout out to Nick, has been working with me on my orders to make sure I'm taken care of. Will definitely purchase from them again in the future and I highly recommend them"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gianni torres",
          "Nb_Reviews": 2,
          "Date": "2020-08-31T22:18:32.000Z",
          "Titre": "No recommendations",
          "Contenu": "No recommendations. The technicians did an absolutely fantastic job. Knew exactly what I needed and how to help. My computer and phone were serviced faster than the allotted time frame. Charged me less than countless other places that I went to and gave me recognizable better quality. Definitely recommend, they’ll take care of you post haste and efficiently!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mackenzie Arbogast",
          "Nb_Reviews": 1,
          "Date": "2021-02-20T03:34:18.000Z",
          "Titre": "Amazing service!",
          "Contenu": "Love the service! I have always been skeptical about buying online but this experience changed everything! I was denied for the payment plan but Dominic called me with other options and helped so much! I am now expecting my MacBook that I’ve been hoping to get for awhile and I’m so excited. I didn’t have any questions because everything was explained to me so well! I definitely recommend buying from Maxandfix!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sara Tully",
          "Nb_Reviews": 1,
          "Date": "2021-05-20T14:43:21.000Z",
          "Titre": "My screen was saved!",
          "Contenu": "I was vacationing in Deerfield Beach and my phone screen stopped responding. I was able to get my entire screen replaced within fifteen minutes! The cost of the new screen was less than what my wireless insurance would have costed. Service was fast, employee went above and beyond. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mohit Kumar",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T06:03:18.000Z",
          "Titre": "Great quality and fast shipping",
          "Contenu": "Buying experience was super simple, as well as the communication of shipping. The shipping was really fast, I got the device within the same week. And the device itself had some scuff but still in excellent condition and it was true to its claim of being unlocked. Overall great experience and great company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Walter Mitchell PHD",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T22:54:44.000Z",
          "Titre": "`Above the normal",
          "Contenu": "`Above the normal, these guys went out of their way to make sure I got a new IPhone that was 5G compatible. Thank you so much for your time and consideration in making this purchase happen."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shamika",
          "Nb_Reviews": 1,
          "Date": "2020-10-19T20:40:27.000Z",
          "Titre": "Ask for Dominic",
          "Contenu": "Dominic is the number one go to for your service. He helped me purchase a MacBook Pro 2017 for my boyfriend who does YouTube and it’s wonderful. Dominic is very friendly and helps you with anything you need. Shipping was very fast as well. Subscribe to my boyfriend YouTube channel Daquan DayDay"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Destiny Golden",
          "Nb_Reviews": 1,
          "Date": "2021-03-03T15:57:46.000Z",
          "Titre": "Always a pleasure doing business w/…",
          "Contenu": "Always a pleasure doing business w/ these guys. This is my second purchase and probably will not be my last. Dominic exemplifies nothing short of superb customer service. I highly recommend these guys for any of your electronic needs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roman L",
          "Nb_Reviews": 1,
          "Date": "2021-02-08T22:46:08.000Z",
          "Titre": "This is the best online experience with…",
          "Contenu": "This is the best online experience with costumer service I ever had, the response to resolve something or just to give some information is 5 stars raining.. and when applied I got the result instantly and in minutes I was able to order what I can’t afford to pay in full right now and the payment options are so reasonables ... thank you Bryan for being nice and giving me a courtesy phone call to make sure o was taken care of when I asked for a confirmation number..! Highly recommend Maxandfix"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fernando",
          "Nb_Reviews": 1,
          "Date": "2020-04-08T18:28:39.000Z",
          "Titre": "First visit!",
          "Contenu": "I had such a great visit and the staff is absolutely amazing just as the service. I definitely recommend to anyone who is having technical issues with Apple or simple need to do some shopping. For sure will be returning for anything definitely worth it. Thank you guys for the amazing service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Desere Lovr",
          "Nb_Reviews": 1,
          "Date": "2021-03-03T22:13:23.000Z",
          "Titre": "Will come back",
          "Contenu": "I would definitely recommend to anyone. I was able to find out which MacBook would be best for me and was helped the whole time. I really appreciate Dominic for being there and having so much patience with me via chat. Due to me being in another state."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "shannon bingham",
          "Nb_Reviews": 1,
          "Date": "2021-06-22T16:23:52.000Z",
          "Titre": "AMAZING SERVICE !",
          "Contenu": "I looked up a place to fix my IPHONE screen. I found MAXANDFIX ! So glad I did. So professional, no games and the phone was ready when I was done doing some shopping at another store. I definitely recommend this business and I will definitely come back!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brittani Harris",
          "Nb_Reviews": 1,
          "Date": "2021-02-08T23:47:53.000Z",
          "Titre": "I'm a lifetime customer",
          "Contenu": "I've been in search of a pre-owned or like-new product for a while and this company made it easier than any other!! I had an amazing experience. Nicole answered all of my questions quickly and thoroughly. She even offered me a great trade-in deal. I am super excited to receive my new purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DT",
          "Nb_Reviews": 3,
          "Date": "2021-01-18T23:28:08.000Z",
          "Titre": "This place is awesome",
          "Contenu": "This place is awesome! Those of us who can’t afford these expensive phones by paying the high prices up front can’t make payments here and with no credit check so def check this place out! Ask for Dominic he is awesome and even helped me when he was out of town and an issue to get my phone shipped sooner than I was told it would be shipped! He makes this place even better!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ezinne",
          "Nb_Reviews": 1,
          "Date": "2020-06-08T20:21:36.000Z",
          "Titre": "2018 MacBook Air",
          "Contenu": "I’m absolutely in love with my purchase. This company is amazing!!They shipped my order within one day and I received it 3 days later. I’m so happy with them, I’ll definitely be ordering again. Thank you so much Maxandfix!!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jonas Rugna",
          "Nb_Reviews": 1,
          "Date": "2021-04-30T14:50:05.000Z",
          "Titre": "Great service, excellent professionals!",
          "Contenu": "I was looking for a MacBook and I found Maxandfix. They have a good price with financing conditions. I didn’t know which one ti choose, but Brian was great and walked me through the features and what would better meet my needs! I would gladly recommend them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melvin H Vera Nieves",
          "Nb_Reviews": 1,
          "Date": "2020-07-17T15:48:49.000Z",
          "Titre": "Excellent customer service!",
          "Contenu": "I had an issue with one of my orders, I needed to change a desktop, and Nicole from the customer service chat was more than amazing!!! Very professional and polite, found the perfect solution for me. I'm so happy now! Recommended and this company is legit and honest!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ty",
          "Nb_Reviews": 1,
          "Date": "2021-05-07T17:33:56.000Z",
          "Titre": "These guys are the real deal if you…",
          "Contenu": "These guys are the real deal if you need anything to IPhones to MacBooks these are the guys you want to get your products from. Plus if you do the finance with any of there lenders it helps boost your credit by 16 points I’m clear proof!!!! Domo and Brain are the coolest staff that works in the Deerfield Beach Mall if you need anything they got you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Carty",
          "Nb_Reviews": 1,
          "Date": "2021-03-10T02:17:52.000Z",
          "Titre": "Just bought my first Mac.",
          "Contenu": "Just bought my first Mac.Dominic's customer  skills were on point.  He knew exactly what I was looking for and what I wanted to spend. Explained all my options and landed me a 2015 i7 15 in.  He was quick to respond to any questions i had and even answered me when he wasn't at work.   Much appreciated.Already looking forward to my next purchase.   Thanks Dominic.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mariana Mesa",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T01:50:53.000Z",
          "Titre": "Amazing Experience!",
          "Contenu": "Max and Fix is a hidden gem when it comes to shopping for Apple products. They had the best prices on all their products and I loved the fact that they planted a tree after buying a MacBook. Lastly, their support team answered all my questions and concerns in a timely manner. Max and Fix is a 10/10 and would recommend it to all my loved ones!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kleaning K",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T02:34:35.000Z",
          "Titre": "I had one of the best customer…",
          "Contenu": "I had one of the best customer experience thus far. My guy was very knowledgeable about the item I was interested in and guided me down the right way. I am very appreciative for that and I will continue to use there services!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Adkins",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T17:54:47.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. They listened well and worked hard to ensure my satisfaction. Would use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerry Poole",
          "Nb_Reviews": 2,
          "Date": "2020-09-26T15:44:57.000Z",
          "Titre": "Fantastic service",
          "Contenu": "Fantastic service, extremely fast shipping. It has been the best computer buying experience hands down. I will always use MaxandFix first.  You won’t be disappointed. Even got a free upgrade.  Awesome personal touch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brittany Bullock",
          "Nb_Reviews": 1,
          "Date": "2020-07-27T23:15:53.000Z",
          "Titre": "I'm starting my second semester of…",
          "Contenu": "I'm starting my second semester of college and needed (wanted) a MacBook Pro. Nicole in customer service answered every question for me and helped me to even upgrade what I had originally chose.Love you guys!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alfonso Boxill",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T21:51:44.000Z",
          "Titre": "Brian is a fantastic human being",
          "Contenu": "Brian is a fantastic human being reach out to ask me how was my experience ordering from the site, super friendly and polite and upgraded my storage and shopping option at no extra cost would definitely shop here again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Gray",
          "Nb_Reviews": 1,
          "Date": "2020-09-05T00:36:15.000Z",
          "Titre": "You'll Want To Bite This Apple...",
          "Contenu": "I bought a MacBook Pro after my Air died due to extreme circumstances. When I picked it up, a man was also there for service. He walked up behind me and assured me that I'm dealing with great and very honest people. He didn't know this was my umpteenth visit, and second time buying a MacBook from there. I already trusted their work. I felt assured about my experience and what I was getting. I've been getting consistency, and apparently, so was that other guy. The Apple knowledge is thorough. There isn't a question I couldn't get answered or information I should have known that I didn't get. Lastly, the work Ive been doing in rebuilding my credit means I've been trying to avoid any inquires to keep my points from dropping. I couldn't shed that much cash at once, and I needed a finance option that didn't include running or placing an extra inquiry on my credit. The program they offered me did exactly that with a small deposit and payment installments drawn from my account. Amazing, and exactly what I neededGracias, Besitos!!-Fifty"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "detra koon",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T21:48:59.000Z",
          "Titre": "Order arrive quickly and Brian was…",
          "Contenu": "Order arrive quickly and Brian was available to answer any questions that I may have had."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sara Saleh",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T20:54:39.000Z",
          "Titre": "Great service!",
          "Contenu": "Great service! Brian and Marquis were so patient! I purchased a brand new Mac and iPad and they helped me through every step of the way. They also applied a protective seal on my iPad perfectly! These are boys are the best! I definitely recommend this place!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liz",
          "Nb_Reviews": 1,
          "Date": "2020-08-31T20:54:53.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. My phone was done quickly and Dominic was very knowledgeable about the different apple products. I will recommend this store to anyone who needs phone or computer repairs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marzetta M. Craven",
          "Nb_Reviews": 1,
          "Date": "2021-03-08T23:45:47.000Z",
          "Titre": "Awesome customer service",
          "Contenu": "I just purchased a computer with them and the amazing customer service I received was so wonderful. Nicole was able to help me complete the purchase. This is a wonderful company. I can not wait until I get my new iMac!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ann Griffiths",
          "Nb_Reviews": 1,
          "Date": "2021-06-16T22:31:46.000Z",
          "Titre": "Friendly and efficient staff",
          "Contenu": "Friendly and efficient staff. Very knowledgeable. This is my third time using their services. Never any issues, purchased phones and got my phone fixed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tonya Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T21:26:58.000Z",
          "Titre": "Brain was very helpful and he solved my…",
          "Contenu": "Brain was very helpful and he solved my issue right away. This is a great company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adrienne Leary",
          "Nb_Reviews": 1,
          "Date": "2021-06-28T19:21:44.000Z",
          "Titre": "Great service",
          "Contenu": "Great service!  I want to thank Dominic for helping me  with the online process.he kept his word in keeping me updated with my purchase ,and tracking information.this is my first time purchasing maxandfix and was a great experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sofia Pearl",
          "Nb_Reviews": 1,
          "Date": "2021-05-17T22:41:36.000Z",
          "Titre": "Just happend to be next door at five…",
          "Contenu": "Just happend to be next door at five below but here out of chargers came in here to see if they had any Brian was very nice and showed me the different chargers n sizes they had"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KD",
          "Nb_Reviews": 1,
          "Date": "2020-09-03T20:29:48.000Z",
          "Titre": "Very helpful!!",
          "Contenu": "Very helpful. I live in Louisiana and called one evening. I wanted to make sure that it wasn’t a scam! It was after hour and someone answer. He answer all my questions. Broke down what I didn’t understood. And as well made my buying experience seamless!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Latisha Roach",
          "Nb_Reviews": 1,
          "Date": "2021-09-23T17:48:03.000Z",
          "Titre": "The service was great",
          "Contenu": "The service was great, thanks to Nick. Very efficient and he kept me updated with the tracking and shipping information of what I purchased. It was very hassle free. Thank you Nick and your team for such a wonderful service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antonio",
          "Nb_Reviews": 1,
          "Date": "2021-05-20T16:12:04.000Z",
          "Titre": "Brian was extremely excellent with…",
          "Contenu": "Brian was extremely excellent with helping me replace my screen. This is the 3rd time I’ve been here and it’s always been a great experience with fair pricing and great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ayaana Reeves",
          "Nb_Reviews": 1,
          "Date": "2020-07-28T21:20:29.000Z",
          "Titre": "Dominic was extremely awesome!",
          "Contenu": "Dominic was extremely awesome!! I bought the 2018 gold 126gb and it was on back order so he tried his best for me now I got the 2019 256gb and this is awesome highly recommended!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bre'ana Carr",
          "Nb_Reviews": 1,
          "Date": "2021-03-04T21:46:03.000Z",
          "Titre": "Great efficient quick service!!",
          "Contenu": "Great efficient quick service!!! My phone was fixed in 11 minutes!!!!!!!11 minutes!!!! Very professional and courteous!!! I hope I don’t need to return butttt if I do I definitely will come back!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dominic Figueroa",
          "Nb_Reviews": 1,
          "Date": "2021-05-14T18:13:02.000Z",
          "Titre": "Amazing staff",
          "Contenu": "Amazing staff, very helpful and knowledgeable. Brian helped me purchase my 2020 MacBook Pro. Most definitely will be coming back"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Haira D.",
          "Nb_Reviews": 1,
          "Date": "2021-04-27T17:11:54.000Z",
          "Titre": "Profesional",
          "Contenu": "Profesional, nice and welcoming, fixed my phone daughter phone twice did a great job! Will recommend 100% and there prices are reasonable!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jazmaine Mayo",
          "Nb_Reviews": 1,
          "Date": "2020-08-14T20:33:59.000Z",
          "Titre": "Maxandfix is the spot to go for…",
          "Contenu": "Maxandfix is the spot to go for MacBook! I needed a new MacBook for grad school but didn’t want to pay an arm and a leg. Different payment options and very helpful staff! Your crazy if you don’t check them out! Love my new Mac ordered one week got it the next week."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J J",
          "Nb_Reviews": 1,
          "Date": "2020-04-07T02:35:44.000Z",
          "Titre": "Excellent service and great prices",
          "Contenu": "Excellent service and great prices, don’t waste your money and time on other service stores, this place is the greatest with excellent technical service and amazing prices !! 100% Recommended"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jean Silva",
          "Nb_Reviews": 1,
          "Date": "2020-04-06T17:38:53.000Z",
          "Titre": "I needed a quick and affordable laptop…",
          "Contenu": "I needed a quick and affordable laptop for my daughter to do online classes. This place saved me. Reasonable monthly payments, and BEST service ever. Thank you so much for helping me!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Pinkston Sparks",
          "Nb_Reviews": 2,
          "Date": "2023-07-05T17:57:29.000Z",
          "Titre": "First of all the customer service was…",
          "Contenu": "First of all the customer service was amazing. I will only be buying my apple products from here from now on. Secondly, I had my items in two days. I live in NC and the business is in Florida. The emails kept me up to date and the products were great. Huge savings on really nice apple products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "henry Munoz",
          "Nb_Reviews": 1,
          "Date": "2021-04-29T20:15:31.000Z",
          "Titre": "Changed several batteries different…",
          "Contenu": "Changed several batteries different phones.fast ,politeStand by their work. Will return. Thumbs up"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dr. C",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T02:11:41.000Z",
          "Titre": "Worth it!",
          "Contenu": "Received my phones in excellent condition! Shipping was really fast!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Simone",
          "Nb_Reviews": 3,
          "Date": "2020-12-03T16:01:31.000Z",
          "Titre": "I wanted to upgrade my phone and…",
          "Contenu": "I wanted to upgrade my phone and AirPods to the iPhone 12 abs AirPods Pro . I saw an ad on Facebook max and fix, they rock. Brian reach out to me, help me with my ordering and gave me a $25 gift card. They rock, check them out. Customer service on fleek!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josephine Tutton",
          "Nb_Reviews": 1,
          "Date": "2021-07-27T18:40:02.000Z",
          "Titre": "Michelle is such a wonderful great help…",
          "Contenu": "Michelle is such a wonderful great help to I much appreciate her for helping with my purchase she deserve a pay raise and promoted again Michelle thank you ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tee",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T19:45:37.000Z",
          "Titre": "So I had a package scare ..",
          "Contenu": "So I had a package scare ... I thought my package was lost or never delivered.This company helped me and stayed connected with me. The frustration was out of this world. I want to say thank you for your help would totally recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Monaco",
          "Nb_Reviews": 1,
          "Date": "2021-04-21T22:31:36.000Z",
          "Titre": "I got into the store after they close…",
          "Contenu": "I got into the store after they close and the employee helped me anyways ! He gave me excellent customer service .I definitely recommend the place ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamil Jalil",
          "Nb_Reviews": 1,
          "Date": "2020-04-06T17:03:30.000Z",
          "Titre": "Top Notch service",
          "Contenu": "Impressive and succinct deals on cellular repair but what's really impressive is the attentiveness of the staff. After multiple visits, I've just decided that no one else should be handling my equipment but Maxandfix."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monique Letts",
          "Nb_Reviews": 1,
          "Date": "2021-04-29T17:43:08.000Z",
          "Titre": "Very friendly and reliable I’ve been…",
          "Contenu": "Very friendly and reliable I’ve been going here for years. The entire staff is helpful, they have an lifetime customer with me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andy Z. G.",
          "Nb_Reviews": 2,
          "Date": "2021-05-14T20:41:47.000Z",
          "Titre": "Received quick and honest pricing for a…",
          "Contenu": "Received quick and honest pricing for a phone repair. This is my second time coming here and I plan on continuing to when the need arrives!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A  Coleman",
          "Nb_Reviews": 2,
          "Date": "2023-08-20T01:56:20.000Z",
          "Titre": "Thank you for working with me when my…",
          "Contenu": "Thank you for working with me when my son changed his mind about the product I ordered!  Y’all were professional and good to work with   Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luci Core",
          "Nb_Reviews": 1,
          "Date": "2021-09-25T15:32:38.000Z",
          "Titre": "The most helpful customer service I've…",
          "Contenu": "The most helpful customer service I've ever experienced. They answered every dumb question I had quickly and kindly. Definitely would recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JJ Johnson",
          "Nb_Reviews": 1,
          "Date": "2021-04-26T20:26:21.000Z",
          "Titre": "The experience was awesome",
          "Contenu": "The experience was awesome! They were friendly, knowledgeable and affordable..Real pros. Give them a try, you will be glad you did"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jorge Ruiz",
          "Nb_Reviews": 1,
          "Date": "2020-09-26T15:31:02.000Z",
          "Titre": "Great guys quick and friendly staff",
          "Contenu": "Great guys quick and friendly staff. Upfront advice before work is done competitive price and knowable staff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erin Cook",
          "Nb_Reviews": 1,
          "Date": "2020-08-29T20:42:33.000Z",
          "Titre": "Great Experience!",
          "Contenu": "Great experience! They’re very helpful and knowledgeable. They weren’t pushy at all and made the process very easy. Would shop with them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlie",
          "Nb_Reviews": 5,
          "Date": "2023-05-10T02:39:37.000Z",
          "Titre": "The item I was looking for was in stock…",
          "Contenu": "The item I was looking for was in stock and able to get it through Katapult.  Had to use Goggle Chrome to shop and order my iPad before things still worked out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Austin Laros",
          "Nb_Reviews": 1,
          "Date": "2021-03-24T22:58:54.000Z",
          "Titre": "Got my iPhone 11 Pro phones screen…",
          "Contenu": "Got my iPhone 11 Pro phones screen replaced. Service was great and screen replacement was successful and relatively quick."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KAMILLA VERSI",
          "Nb_Reviews": 2,
          "Date": "2021-05-08T17:58:38.000Z",
          "Titre": "I needed a glass screen protector for…",
          "Contenu": "I needed a glass screen protector for my iPhone and Brian was super helpful! He cleaned my phone, applied it, and I was out in a few minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gianni torres",
          "Nb_Reviews": 2,
          "Date": "2021-05-01T15:20:07.000Z",
          "Titre": "Awesome job again",
          "Contenu": "Awesome job again. Always come here to get my phone fixed, they help me out quick and easy. They take a look at any issues in no time to help you get everything pristine like brand new. Thank you Maxandfix!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liz Alcindor",
          "Nb_Reviews": 1,
          "Date": "2021-07-16T17:42:41.000Z",
          "Titre": "Extraordinary Customer Service",
          "Contenu": "Had a hiccup with shipping product replaced and excellent customer service. Dedicated and assisted through the whole monstrous process will be making future Apple purchases with them"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laihla Pierre",
          "Nb_Reviews": 1,
          "Date": "2021-03-05T08:05:28.000Z",
          "Titre": "I recommend it to anyone",
          "Contenu": "I recommend it to anyone, I had a great experience, Dominic helped me with everything in a professional way Thank u!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Althea",
          "Nb_Reviews": 2,
          "Date": "2023-08-09T18:31:28.000Z",
          "Titre": "Alma and Dominic was very patient and…",
          "Contenu": "Alma and Dominic was very patient and understanding with me.  they assisting me was very much appreciated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Will Mattew",
          "Nb_Reviews": 1,
          "Date": "2021-05-01T19:26:19.000Z",
          "Titre": "These guy’s are awesome I got a new…",
          "Contenu": "These guy’s are awesome I got a new computer for my wife, hook me up with everything I would need for it. like case, adapter and even got my iPhone screen face life savers"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cristine",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T18:55:53.000Z",
          "Titre": "These guys are awesome they always fix…",
          "Contenu": "These guys are awesome they always fix everything very quickly for us they’ve even repaired smooshed iPads!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joanna Troyano",
          "Nb_Reviews": 2,
          "Date": "2021-06-03T20:13:51.000Z",
          "Titre": "Thought my phone was a goner for sure…",
          "Contenu": "Thought my phone was a goner for sure until I came to Maxandfix! Always great service ! Highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Farrell",
          "Nb_Reviews": 1,
          "Date": "2021-04-30T20:05:41.000Z",
          "Titre": "This place was Awesome",
          "Contenu": "This place was Awesome. They diagnosed my speaker issue and fixed it promptly. Highly recommended.👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sterlynn Pulido",
          "Nb_Reviews": 1,
          "Date": "2021-05-05T19:57:20.000Z",
          "Titre": "Dominic was very quick and friendly in…",
          "Contenu": "Dominic was very quick and friendly in assisting me! I recommend that you come here for all your phone service needs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mick O",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T21:31:10.000Z",
          "Titre": "Stellar communication",
          "Contenu": "Stellar communication! After not reaching me via call they texted me to make sure my order was accommodated well (and discussing a compelling and valuable upgrade opportunity).  ⭐️⭐️⭐️⭐️⭐️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andy Z. G.",
          "Nb_Reviews": 2,
          "Date": "2021-05-12T22:10:57.000Z",
          "Titre": "Very quick and thorough phone damage…",
          "Contenu": "Very quick and thorough phone damage diagnostic and repair. Will be referring them to friends and family."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim Comette",
          "Nb_Reviews": 1,
          "Date": "2021-06-12T21:59:39.000Z",
          "Titre": "The service here is great",
          "Contenu": "The service here is great! I was able to get my screen protector and service on my MacBook. Both employees are so helpful and very nice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joanna Troyano",
          "Nb_Reviews": 2,
          "Date": "2020-08-15T19:31:44.000Z",
          "Titre": "These guys rock",
          "Contenu": "These guys rock! So helpful and knowledgeable! Fixed my busted Iphone8 even when I thought it was beyond repair!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PB  bicycles",
          "Nb_Reviews": 3,
          "Date": "2021-05-15T18:39:20.000Z",
          "Titre": "Nice and friendly place",
          "Contenu": "Nice and friendly place, Brian really knows abou what he is doing over there !!! Highly recommended..... thank you so much guys for fix my phone so good and quick!!!Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "demetrius adams",
          "Nb_Reviews": 1,
          "Date": "2021-05-15T20:43:03.000Z",
          "Titre": "Have been coming here for 3 years now",
          "Contenu": "Have been coming here for 3 years now.   Every time I come they deliver. What ever I need screen fixes to devices purchases they come through. Max and fix is it!!! The staff is lit and professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "saketh saketh",
          "Nb_Reviews": 1,
          "Date": "2020-10-29T19:49:49.000Z",
          "Titre": "This is my first time experience here…",
          "Contenu": "This is my first time experience here and they fixed my iPhone X screen display in less than 20 mins. Great service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandy Cook",
          "Nb_Reviews": 2,
          "Date": "2020-12-21T18:56:39.000Z",
          "Titre": "Very good customer service",
          "Contenu": "Very good customer service, called to let me know some changes needed to be made! Very upmost respect!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jaime",
          "Nb_Reviews": 1,
          "Date": "2020-10-03T19:52:52.000Z",
          "Titre": "Dominic F was so helpfully and fixed…",
          "Contenu": "Dominic F was so helpfully and fixed are phone very quickly I will tell my friends to come here my 2nd time here!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CJ Harris",
          "Nb_Reviews": 1,
          "Date": "2021-03-09T19:45:10.000Z",
          "Titre": "The customer service is awesome they…",
          "Contenu": "The customer service is awesome they really helped me with my battery problem with my phone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pamela Aliotta",
          "Nb_Reviews": 1,
          "Date": "2021-07-07T22:53:00.000Z",
          "Titre": "Brian was super helpful and so…",
          "Contenu": "Brian was super helpful and so friendly! will definitely be back next time i break my phone (:"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Samuel Brotones",
          "Nb_Reviews": 1,
          "Date": "2021-04-30T15:18:05.000Z",
          "Titre": "It’s a great place!",
          "Contenu": "It’s a great place, the employees there are very kind and attentive, and the prices are very good!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chritian Senises",
          "Nb_Reviews": 1,
          "Date": "2021-04-21T21:50:34.000Z",
          "Titre": "Fast and reliable",
          "Contenu": "Fast and reliable. Very good customer service, no complaints. Thanks you guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheryl Strowbridge",
          "Nb_Reviews": 1,
          "Date": "2020-11-23T18:44:03.000Z",
          "Titre": "Dominic was amazing and out going",
          "Contenu": "Dominic was amazing and out going. Ver knowledgeable and friendly. Ask for him when you pop by or call in"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Grant Pelchen",
          "Nb_Reviews": 1,
          "Date": "2020-08-17T23:20:18.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service! Brian was very helpful and got the screen finished promptly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cynthia Ortiz",
          "Nb_Reviews": 1,
          "Date": "2021-01-20T16:19:44.000Z",
          "Titre": "They were so quick to respond to my…",
          "Contenu": "They were so quick to respond to my question and was able to order my laptop in a short amount of time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cristian Espinoza",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T15:51:49.000Z",
          "Titre": "Go see Dominic good dude very helpful",
          "Contenu": "Go see Dominic good dude very helpful. I appreciate the service thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mimi's Art Studio",
          "Nb_Reviews": 1,
          "Date": "2021-11-27T16:30:30.000Z",
          "Titre": "Great customer service I had shipped my…",
          "Contenu": "Great customer service I had shipped my Mac to my old address and they assisted me every step of the way. Thank you!"
        }
      ]
    }
  ]
}