{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "maya.net",
      "Review": [
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Yoram dg",
          "Nb_Reviews": 10,
          "Date": "2023-12-17T18:11:08.000Z",
          "Titre": "SCAM SCAM SCAM",
          "Contenu": "SCAM SCAM SCAMWe purchased esim for Switserland.Service was unavailable, we waited 2 hours without any response or assistance. After 2 hours they deleted my sim “code no longer valid” without notification. I did not get my esim data nor my money back. We purchased another sim from Airalo and it worked within 1 minute.DONT TRUST THEM YOU HAVE BEEN WARNED"
        },
        {
          "Note": 1,
          "Pseudo": "Zahari Georgiev",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T06:47:10.000Z",
          "Titre": "the internet is very very weak",
          "Contenu": "the internet is very very weak, it doesn't work for anything except for chat, it's also very expensive, I bought a package for 5 days to try it out, but I won't do it again. I'm responding to Maya's answer: Yes, the signal is full and it's 5g, but the internet speed is very low, so don't mislead people! There are other providers that are much cheaper and with faster internet, have a nice day😀"
        },
        {
          "Note": 1,
          "Pseudo": "Barbara Lujic",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T16:33:48.000Z",
          "Titre": "Never again",
          "Contenu": "Booked eSIM for Georgia. Landed and it didn't work,after contacting the customer service they said everything was okay and it should start working. It didn't not and it resulted with me having to book another eSIM and luckily that one worked perfectly and had an amazing support."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Rae W",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T13:41:19.000Z",
          "Titre": "The e sim doesn’t work in Guadeloupe",
          "Contenu": "The e sim doesn’t work in Guadeloupe, I paid £40 for nothing, the signal is so bad. Now I have to use my normal data from my phone provider for £8 a day -_-I bought it for 17.12-23 for 10 days, should have not spent the £40 at all."
        },
        {
          "Note": 1,
          "Pseudo": "SL",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T11:31:42.000Z",
          "Titre": "Continue to Charge after Cancellation",
          "Contenu": "This would’ve been a great service, however I keep getting charged monthly for Maya Mobile even though I haven’t had an active sim or account since September 2023 (it’s December 2023 today). Although the customer service helped to delete my account, refund my payments, they still continuously attempt to charge my bank account monthly. Quite honestly, it feels like harassment. I have to constantly have my account frozen to avoid Maya Mobile from removing money again and again. So I guess the customer service is poor if they havent resolved this for me since September 2023.Complain Requests: 87032, 96744, 106455 (for every month after I no longer have maya mobile or requested these harassment attempts to remove funds from my account  stops) First request was when they managed to have funds removed from my bank account because i did not manually froze the card then"
        },
        {
          "Note": 1,
          "Pseudo": "Jamie B",
          "Nb_Reviews": 6,
          "Date": "2023-12-06T21:48:07.000Z",
          "Titre": "Terrible Customer Service",
          "Contenu": "Terrible customer service - I appear to have an account with O2 from an old Virgin TV deal. Been trying to close it through 02's complaint dept. as they keep charging me. Every time I ring I either get passed around until I eventually get cut off, or they never call back. Pretty terrible and very stressful. I was on the phone for 30 mins this evening and got cut off."
        },
        {
          "Note": 1,
          "Lieu": "AT",
          "Pseudo": "Fazila Ibrahim",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T07:34:38.000Z",
          "Titre": "I had a good experience previously when…",
          "Contenu": "I had a good experience previously when I used the e-sim in Australia , so when I planned for a European trip I got myself an unlimited data plan.The e-sim didn’t work, couldn’t install and even after asking them for refund as I’m already 4 days into the plan, they completely ignored my request. I had to use other e-sims instead which works perfectly fine.Scammers.PS: After writing this review, they processed my refund. So do submit reviews when they ignore you!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ahmad",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T00:15:55.000Z",
          "Titre": "Horrible experience; AVOID!",
          "Contenu": "Horrible experience. Paid £16 for a so called \"10GB\" package. Barely lasted 3 days and all I did was send a few messages/make a few calls on WhatsApp and use maps for directions. Better to just pay an extra £10 (£25 in total) and get a physical sim from a reliable company like Turk Telecom or Turk Cell."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Tri Pham",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T20:28:27.000Z",
          "Titre": "speed and coverage is not good for unlimited plan in Europe",
          "Contenu": "From Maya mobile website indicated \"Get fast 4G/5G data and best coverage\".    I found this is incorrect statement.    I ordered 15 days unlimited Europe plan.   At some point internet is so slow that a website page cannot open.   I sent a support request, the response is \"Checking on our side, it looks like your Unlimited eSIM has been limited to 1Mbps maximum download/upload speed for the rest of the day, after consuming the high speed data allowance for today\" When using speettest.net,   my speed is 0.36 mbps.I ended up using resource to public wifi even though  I have unlimited data plan.   Also some beach area in Lisbon have very little reception."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Cihan Göktürk Canpolat",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T12:26:44.000Z",
          "Titre": "Doesn't work on iPhone XR",
          "Contenu": "My wife bought an eSIM to use it during her Switzerland visit and we were informed that the eSIM would work on iPhone XR. However, it doesn't. The phone cannot open the QR code and it is also not possible to manually install the eSIM as the guide to manually install the eSIM is not up to date."
        },
        {
          "Note": 1,
          "Lieu": "CO",
          "Pseudo": "Hazel Tan",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T01:00:40.000Z",
          "Titre": "Not helpful",
          "Contenu": "Not helpful! I couldn’t connect to the data roaming after trying all their steps ensuring the apn is correct, waiting 15mins… I even switched off and on my phone twice! Still no connection. The staff just replied me a standard reply. And then NO FURTHER HELP or reply!!! I really had to figure out myself. After half a day I had a thought to resetting in the end it was to just reset / redo the same apn settings. It’s always a risk buying these esims fromunknown companies!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Rob Stower",
          "Nb_Reviews": 4,
          "Date": "2023-10-31T05:01:56.000Z",
          "Titre": "Don't bother...",
          "Contenu": "If a 4G data plan that delivers <1Mbs and a service desk that just doesn't get back to you is what you want than this is the go!Two facts for you to consider:Fact 1:  Despite their claim that they \"don't slow down your roaming data in Europe. You will get reliable, fast data on both Unlimited and Prepaid eSIM plans\".  They do, they absolutely do.  I have a record of my online chat with them staying that they had done this to my service.Fact 2:  While attempting to resolve the problem, their service desk \"went cold\" on me for nearly a full day and left 7 messages from me unanswered."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "MTC",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T20:26:31.000Z",
          "Titre": "You can't tell what you have - big problem",
          "Contenu": "We were uniquely positioned to compare this with my family member that was using a competitor's eSim. Maya is cheap but it needs an app. While travelling...I could not track how much data I was using which varies from LTE to 5G. I had to top up three times and there was nothing to acknowledge how much I had left...and the contract extension dates were totally wrong...Also my husband's Maya also didn't work at all."
        },
        {
          "Note": 1,
          "Lieu": "LK",
          "Pseudo": "Daniel Sontheimer",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T07:27:33.000Z",
          "Titre": "It’s not possible to have a WhatsApp…",
          "Contenu": "It’s not possible to have a WhatsApp conversation because the internet gets interrupted every few seconds to minutes in Sri Lanka. Also Dialog is way cheeper and better then the expensive and bad Maya mobile. Don’t by Maya!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Noel Graham",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T00:30:01.000Z",
          "Titre": "Useless service",
          "Contenu": "We got an unlimited Sim while traveling in Paris and Rome. The service was so slow that it was unusable. I was getting speeds of 0.1 Mb per second while in Paris and Rome. It said it was always connected to a 5G network.  I contacted maya.net and have not heard from them yet even though I have been back from my vacation for over a week."
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "sean belarmino",
          "Nb_Reviews": 2,
          "Date": "2023-10-21T04:38:17.000Z",
          "Titre": "BEWARE! dont buy this simcard!",
          "Contenu": "BEWARE!! im an regular esim user and a regular traveler tried maya but so dissapointed dont buy this esimcard first day of use after few hours my internet went 0.30mbps!!the throttled it barely can open a page and this is a not good! i complained to their support but they replied its capped at 1mbps but its not even 1mbps i got way more less than 1mbps!! REFUND my money!!!other esim company after 12am data is reset! but this esim doesnt it will be rollover hours a hell waiting for a reset dont buy this esim!!!! you will be stuck with 0.30mbps!!!update after writing a review here they cut my internet! give me my money back its for 1 months bare 24 hours you cut my internet!"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Óscar CG",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T21:00:44.000Z",
          "Titre": "I boguht Two esims from UK",
          "Contenu": "I boguht Two esims from UK1. For my iPhone 14 pro (works)2. For my wife iPhone 12 pro (not works)Chat support didnt solve me the problemChat support didnt offer me oher esimChat support didnt refund me the money"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "alex platon",
          "Nb_Reviews": 3,
          "Date": "2023-10-10T20:03:27.000Z",
          "Titre": "Maya cards not working",
          "Contenu": "I purchased a Maya esim plan while in Israel and it did not workMaya is not transparent about esim requirements on using esim cards, like type of phone you are using"
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Alastair Patterson",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T21:29:19.000Z",
          "Titre": "Wasted first 6 hours of holiday trying…",
          "Contenu": "Wasted first 6 hours of holiday trying to connect to internet. Customer services sporadically replied suggesting I type an APN in, but this has not worked. It has consumed data which is strange as unable to connect to internet or make calls. I cannot wreck the rest of my visit. Maybe verging on a scam"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Tom Evans",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T15:28:11.000Z",
          "Titre": "DISASTER We bought 2 Esims for 2 phones…",
          "Contenu": "DISASTER We bought 2 Esims for 2 phones and followed the instructions exactly, and then when we retuned to Canada we got charged $300 for Roam like Home from Rogers. Maya refunded the money (big deal) but didn't seem to care that it didn't work. There was no way to know if it was working or not DO NOT DO THIS"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Anh",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T14:12:39.000Z",
          "Titre": "Very bad coverage",
          "Contenu": "The coverage area was too spotty. Data only worked in some areas, It's more or less OK in Paris although the signal would disappear or become unusable 2G in areas surrounded by high buildings. Going outside Paris was a hit and miss, and it's totally useless in Switzerland and Belgium."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "ochashinai",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T05:17:24.000Z",
          "Titre": "useless esim for NZ",
          "Contenu": "Bought esim for NZ, installation was easy but upon arrival I have been able to connect to 2degrees LTE but speed has been so dismal I can't load a webpage or receive any messages. Back to relying on free wifi making this Sim a complete waste of money."
        },
        {
          "Note": 1,
          "Lieu": "LT",
          "Pseudo": "Jurga Kasperaviciute",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T02:51:09.000Z",
          "Titre": "Internet was almost not working",
          "Contenu": "Internet was almost not working. Outside the big cities had no connection. Besides that I don’t know were my gigabytes disapeared."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Tobias Schniertshauer",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T05:45:52.000Z",
          "Titre": "Never worked",
          "Contenu": "Never worked. Fast Support. 2 days, 2 ESIMs But No working Connection. Only for 2-5 minutes, then disconnect again. After a Lot of Support Mails Money Back."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Derek",
          "Nb_Reviews": 3,
          "Date": "2023-07-13T16:42:49.000Z",
          "Titre": "It never worked in Turkey",
          "Contenu": "It never worked in Turkey, we bought two eSims, but neither phones connected to internet! Emailed every day, they replied everyday, nothing worked, no refund offered. $36 down the drain!!!  Will never use again. ****after a few days we found that I could use my wife’s phone as a hotspot to access the internet, and vice versa, but not at the same time 🥲"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Derek",
          "Nb_Reviews": 3,
          "Date": "2023-07-13T16:39:45.000Z",
          "Titre": "It never worked in Turkey",
          "Contenu": "It never worked in Turkey, we bought two eSims, but neither phones connected to internet! Emailed every day, they replied everyday, nothing worked, no refund offered. $36 down the drain!!!  Will never use again. ****after a few days we found that I could use my wife’s phone as a hotspot to access the internet, and vice versa, but not at the same time 🥲"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-01-02T20:55:47.000Z",
          "Titre": "Very complex activation",
          "Contenu": "Very bad experience. Activation in Argentina was very difficult and far from \"plug and play\" which other esim providers offer. So I paid 60€ extra as my phone used local data instead of the esim. Connection quality after activation was very poor. Email support from maya did not reply. I will never buy here again and would not recommend to do so."
        },
        {
          "Note": 1,
          "Lieu": "CR",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T05:08:32.000Z",
          "Titre": "Seemed good but very poor service -I spent extra money to get more data…",
          "Contenu": "I spent extra money to get more data for 1 month in Costa Rica. Unfortunately my eSIM worked a bit my 1st week, but my 2nd week here whole stayed in Aljuelja and San Jose all week, the cell did not work. We are going to Punteranas all next week and my cell phone data plan did not work in Punteranas yestarday, so I am frustrated I paid a double premium and wasted my money. Please refund or help me get my eSIM working"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ugo",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T05:15:05.000Z",
          "Titre": "Always having to reconnect to the…",
          "Contenu": "Always having to reconnect to the network to have LTE and most time  slowww LTE or H+/3G is making me regret buying an eSim for my trip to Costa Rica... and often enough I don't even get a data connection..."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Paz Ohana",
          "Nb_Reviews": 5,
          "Date": "2023-04-18T04:09:16.000Z",
          "Titre": "Avoid!!!",
          "Contenu": "Avoid!!!Everyday in Ireland I experience failures connecting to a network and lack of data connection!Im using galaxy s23 ultraAnd ive been a lead tech support for a cellular network for 9 years!They offer no service, only directing you to their online checklist.When i said i followed it they only offered tryi g it again.Just avoid. There are many other options.***Editing further to Maya's response:I had troubles every day and I contacted them 5 more times at least! each time they answered 6+ hours later and only directed me to their website, which I already wrote I did! I was stuck without internet running to stores in the rain to hunt Wifi!This kind of response manifests 0 responsibility and it fits them best. do your math."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Johan te Ronde",
          "Nb_Reviews": 2,
          "Date": "2023-02-11T00:46:35.000Z",
          "Titre": "I do not see if I am using Maya and on…",
          "Contenu": "I do not see if I am using Maya and on nearly all places in Colombia were I went and were is no wifi the internet connection faled.Do not know if this normal, but I had expected that just than would be usefull incase of no wifi, groet, Han"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lee McKenzie",
          "Nb_Reviews": 2,
          "Date": "2023-09-25T00:33:24.000Z",
          "Titre": "Warning - they can not fulfill Peru eSims but will sell you one",
          "Contenu": "As a single woman traveling solo in Peru for the first time, having cell service is important. I purchased my eSim which stated it would be available in less than 2 minutes. I have been unable to get a eSim from them and 2 days later I have cancelled my order and selected a different carrier. A carrier I'm using to write this review from Peru. When I asked Maya why they still hadn't provided an eSim and when I could expect one they simple stated\"Thank you for contacting us. I am happy to help.  We are currently awaiting a restock of the eSIM you ordered. The order will be provisioned automatically when the eSIMs are available. In the meantime, I will be consulting our internal team for an update on the same.  You will receive an email with the activation code and instructions as soon as the eSIM is ready. We appreciate your patience and we will have this ready for you as soon as possible.\"Which is of zero help and offers no timeline. Their order page for Peru STILL says you will get your eSim within 2 minutes. This is very deceptive and leaves travelers frustrated at a time we would rather be having fun that chatting with Customer Service who offered zero help at all."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "On behalf of",
          "Nb_Reviews": 10,
          "Date": "2023-05-25T15:37:39.000Z",
          "Titre": "MY BAD EXPERIENCE WITH MAYA",
          "Contenu": "It says instant activation on android but it takes 2 phone to set it up. You have to screenshot the qrcode then send it to the second phone then scan it on the first. If you don’t have 2 phones don’t try to follow the instructions as that's impossible."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Zsuzsa Bodrogi",
          "Nb_Reviews": 1,
          "Date": "2023-01-29T16:25:37.000Z",
          "Titre": "I bought to my doughter 5GB for 14…",
          "Contenu": "I bought to my doughter 5GB for 14 days. After 4 days she lost connection. She tryed everything ( restart the esim, flymode, upload the qr code again) but nothing worked.At Maya's customer servise's there isno one to talk with only chatbot!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Blaz",
          "Nb_Reviews": 1,
          "Date": "2023-01-29T14:18:34.000Z",
          "Titre": "Extremly bad operator",
          "Contenu": "The internet connection was constantly falling out.On the 29.1.2023 the internet was not functioning at all!Terrible experience and most of all waste of money.I do not recommend and wont buy again when i will travel.Since the service was so bad i had to use my mobile data witch will lead to extra unplaned costs."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Marcin .Drobniak",
          "Nb_Reviews": 3,
          "Date": "2023-11-14T09:43:00.000Z",
          "Titre": "please write that it is 3 GB internet…",
          "Contenu": "please write that it is 3 GB internet for 5 days, but only 3/5 for one day, scammers"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Kyle Aszalos",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T14:43:17.000Z",
          "Titre": "My partner and I ordered a esim for our…",
          "Contenu": "My partner and I ordered a esim for our Europe trip. The morning of our 3rd day we both got an email saying we had used our data, however when we looked, we had only used 450mb. We have been on wifi the whole time on the cruise and been to 1 port where we spent a few hours off the ship but we have not used 10GB.  Been waiting for customer service to provide an update on “their investigation” but we should have been provided an automatic reactivation of the servir we paid for and have not used.  We are in Europe for the next 13 days and need the service to get around the cities.  Unacceptable that we wait 5+ hours for a response to correct this issue.Update: they have fixed my account but not my partners."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jean-paul",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T04:52:49.000Z",
          "Titre": "I do not understand why the Iphone…",
          "Contenu": "I do not understand why the Iphone system took more than half the data volume in so called \"notifications push\" whereas i removed all notifications; something i never had before i put your e-sim. For me the system does not work, and i do not plan to use or recommend it"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Svw",
          "Nb_Reviews": 10,
          "Date": "2023-09-12T09:45:55.000Z",
          "Titre": "bad connection and keeps billing you twice",
          "Contenu": "update to original reviewagain they billed me twice, this cannot be a honest mistake anymoreCoverage is also terrible in Australia, so it seems to be in every country the same. I also bought an esim for Fiji not long ago, this did not even connect, totally uselessstay away from this providerReally great service,one of the main reasons I bought my Pixel phone is the possibility to use esims.I needed to contact costumer service twice already - once there was a network error in parts of the country and the second time there was a mistake with billing. By mistake, Maya charged me twice to the same Esim. It only took one Mail and they immediately solved the issue and I had my money refunded in two days time. My biggest issue however is the connection. Maybe it is because Israel does not have good coverage for maya Once a day, I am shortly without internet connection, very inconvenient, when eg one of the main uses is to get tickets for transport."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Id an",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T15:13:50.000Z",
          "Titre": "Very bad experience",
          "Contenu": "Very bad experience - a lot of disconnections, low speed, and the support didn't do anything. I had to buy another eSim as this one was useless! Total false advertisment about the speed.. got 1mbps while my friends got 100mbps"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Neomi",
          "Nb_Reviews": 1,
          "Date": "2023-01-29T17:08:27.000Z",
          "Titre": "no service",
          "Contenu": "me and my mom bought an eSim plan (separately).we didn’t use all of the GB in the package but it stopped working today and we got stuck in london without service wich means we didn’t know how to get from place to place. horrible experience."
        },
        {
          "Note": 1,
          "Lieu": "AM",
          "Pseudo": "Sergei",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T17:19:09.000Z",
          "Titre": "Some services don’t work",
          "Contenu": "Google maps and local taxi app, GG, didn’t work with the SIM, with other services connection was terrible, to make it working I had to turn off/on the eSIM many times. Exceptionally bad experience."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Concerned investor",
          "Nb_Reviews": 4,
          "Date": "2023-09-19T10:03:32.000Z",
          "Titre": "The service was extremely unreliable…",
          "Contenu": "The service was extremely unreliable and often not available at allThe Company has now refunded the charge made, which whilst obviously welcome does not help the difficulties encountered."
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "switchr",
          "Nb_Reviews": 10,
          "Date": "2023-04-15T05:35:16.000Z",
          "Titre": "Didn’t work",
          "Contenu": "I bought their e sim card for when going to Brazil. Firstly it wasn’t possible to add the sim card when outside of Brazil, only when in the country and connected to a network. Because of this I had to go around and look for an open network that actually worked, something that took me quite some time. When I then tried to activate it, it didn’t work. So I had to use my regular sim card the first day to send necessary messages and to research how to get around. After having access to a network again on the third day I managed to contact support. They sent me a new qr code which finally worked. Kind of inconvenient using a qr code as it wasn’t possible to scan it on the screen, you need a second device to display the qr code, which again became a hassle as I didn’t have another device to use. Anyways after everything was fixed i had spent a total of 150 euro on data on my regular sim card. This entire experience was very bad, I recommend everyone to just buy a physical sim card in the country you arrive in. Don’t fall for the trap of thinking getting an e sim is easier, it really isn’t"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matthew Slater",
          "Nb_Reviews": 2,
          "Date": "2023-07-17T13:47:49.000Z",
          "Titre": "Buyer beware: this could ruin your phone",
          "Contenu": "I attempted to load the eSIM on my unlocked iPhone 13 Pro. Got a message that the SIM was not supported which prevented me from getting into Settings to rid myself of it. I was in setup purgatory. After hours on the phone with Apple and my carrier (including an hour in my carrier's store), no one could solve my problem and I now seem to have a $1200 paperweight. Maya's support was unable to do anything either. At least I got my $18 back so I didn't *pay* to ruin my phone. Good luck out there.EDIT: just to be clear, I'm not stuck on the settings screen, I'm stuck in the initial setup that adding the eSIM to my UNLOCKED phone (purchased full price directly from Apple that's been working great for a year and a half) initiated. I can't get to settings. I can restart — indeed, I can factory reset! — but it just takes me back to the \"Hello!\" screen and when I hit the activation phase, the SIM fails and my only options are to try again or go back (which means try again). Five senior Apple advisors so far have scratched their head at this. I'm not saying that Apple bears no responsibility here (pretty clearly if scanning a QR code from the settings can brick your phone, that's bad design), but Maya needs to advise users better about the risks of their product and perhaps how to look in advance for possible hold ups. Had I known that this was even a remote possibility, I'd probably not tried to save a few bucks on my trip and just used my carrier's international rates. Now I'm out the cost of a pricey smart phone."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Aggeliki N",
          "Nb_Reviews": 1,
          "Date": "2023-01-29T10:30:28.000Z",
          "Titre": "Crap",
          "Contenu": "Crap! I bought 5 gb and I ended up the 3rd day to not be able to connect to internet while I only consumed 1gb! Their customer service super slow! When I need data I need them right now not in 2 hours otherwise I can wait to get Wi-Fi at home.. bad service"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Shirli",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T09:59:58.000Z",
          "Titre": "Terrible- the wifi cuts out constantly",
          "Contenu": "Terrible- the wifi cuts out constantly. Horrible when trying to drive in an unknown place. Will buy an actualSIM card"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Nikita",
          "Nb_Reviews": 2,
          "Date": "2023-07-05T17:35:25.000Z",
          "Titre": "The SIM card did not work in All of…",
          "Contenu": "The SIM card did not work in All of Asia - I had no network in indonesia ! Very disappointed - I haven’t even got a refund"
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "vangogmk",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T07:19:42.000Z",
          "Titre": "It’s a very unreliable service in…",
          "Contenu": "It’s a very unreliable service in Israel, it stops working every ten minutes and you need to restart the e-SIM all the time. Customer service responds to complaints but fails to live up to what they promise to deliver so it’s useless to complain. Once you pay it’s a gamble, if it doesn’t work right then there’s nobody to fix the issue. I would definitely not recommend this service.Edit: During the process of my complaints, the Maya team informed me they issued a new e-SIM as it was clear the issue was not fixable, but the e-SIM never arrived. Upon my inquiry as to why I have not received the new e-SIM, their response was that it looked like I had used the 3GB internet, so instead, they offered an extra 1GB on the same e-SIM. By the time this was done, my stay in Israel was almost over, and I had deleted the e-SIM, so it was useless for me. I never said I could not use the internet - I could use it, but I had to restart the e-SIM constantly for it to work, which was very inconvenient. If I did not use the phone, the internet simply stopped working so I could not really receive messenger texts, WhatsApp, and other communication while offline, so I had to restart the phone again to check if I had missed calls or messages on those apps. I stand by what I am saying and I have evidence of the correspondence, otherwise, if everything went fine I would not write this review."
        },
        {
          "Note": 1,
          "Lieu": "MY",
          "Pseudo": "Zainal Arshad",
          "Nb_Reviews": 3,
          "Date": "2023-03-05T05:56:31.000Z",
          "Titre": "Maya cost me US#60",
          "Contenu": "I bought an Asia Pacific plan. I installed it as per instructions. But when I arrived Australia it didn't work. I was asked to make sure my roaming was on and my phone setting set to primary.  I was asked to change from Telstra to Optus. I couldn't do it. Maya did it for me. I thought I had a connection and used it when I was outside my rented apartment which had WiFi. To my amazement my phone was barred after a few days.  On  returning home I went to my service provider and they told me that my roaming was on and I was using my home service provider and not Maya. I had exceeded my credit limit.  I had to pay almost US$60.  I looked through the intructions given and discovred that different people gave different  instructions.  Think carefully before using Maya.  But I must say the personnel answered my questions promptly but my problem was not solved, It is unlikely that I will use an eSIM plan again. It was a costly first time experience.This was your instructions to me. To leave the roaming ON.In your phone's Settings, go to Cellular and select the eSIM data plan under Cellular Plans. The eSIM plan may be called \"Secondary\" or \"Personal.\" Make sure Turn On This Line is set to ON.Make sure Roaming Data is set to ON."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Laurent",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T09:40:11.000Z",
          "Titre": "Does nog work since i bought it",
          "Contenu": "Does nog work since i bought it. whatsapp does not work waze does not work. impossible to send emails. I see full coverage but nothing works."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "vishal natekar",
          "Nb_Reviews": 7,
          "Date": "2023-01-31T02:03:43.000Z",
          "Titre": "The worst ever eSIM I have used",
          "Contenu": "The worst ever eSIM I have used. I got a eSIM for Asia Pacific valid for 30 days as I was travelling to singapore, Thailand and Vietnam. I activated my eSIM in London( where I’m based) . The sim didn’t work when I landed in Singapore. After a lot of back and forth with the customer service, they issued me a new eSIM which started working. After three days in singapore, I land in Thailand, the sim was working again. When I logged in and check, I was issued singapore only sim, instead of apac, so again after following up with customer care, they issued a apac sim. The next 11 days in Thailand was ok. Ok the last day, the sim stopped working again. I have been following up with customer care and there is absolutely no response. This day was very important and I had to arrange taxi etc. And also i land in Vietnam that day i badly wanted the internet connection. I must have sent at least 10 emails and absolutely no response. I had no option but to buy another eSIM. Absolutely horrible customer service and absolutely horrible eSIM. I have used a fair few eSIM but this is definitely the worst. Stay away.Edit: i understand that there was some network failure. But what was stopping you from responding to our emails for so long. Or better , what was stopping you from sending out emails to all your users when you realised there was this issue? Instead of just stranding us without any clue."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Sierra",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T07:53:08.000Z",
          "Titre": "No coverage in Germany ❌",
          "Contenu": "Phone plan worked in Switzerland, but now we are in Germany and it never works. Very unreliable."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Agustin",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T04:09:09.000Z",
          "Titre": "Sometimes when I needed service it…",
          "Contenu": "Sometimes when I needed service it would take up to 5 minutes to let me use internet"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Irene",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T17:32:05.000Z",
          "Titre": "I was unable to make international…",
          "Contenu": "I was unable to make international calls and unable to make calls in Spain. As well I was unable to receive texts."
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T22:30:42.000Z",
          "Titre": "instability",
          "Contenu": "It was stressful to lose communication several times a day and have to restart the phone each time."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Rob",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T20:49:06.000Z",
          "Titre": "In Argentina doesn't work",
          "Contenu": "In Argentina doesn't work. Lost 3 days already. Phone is Samsung S23."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "..",
          "Nb_Reviews": 1,
          "Date": "2023-02-19T11:26:25.000Z",
          "Titre": "confusing",
          "Contenu": "It was very confusing and it has been over a month and still isn't working well"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Kate",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T07:22:37.000Z",
          "Titre": "Very slow and makes phone unresponsive"
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "Alexander",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T15:59:54.000Z",
          "Titre": "Very bad mobile service in Abu Dhabi."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Elio",
          "Nb_Reviews": 3,
          "Date": "2023-06-07T17:53:47.000Z",
          "Titre": "The double charged me through PayPal",
          "Contenu": "The double charged me through PayPal. They are not reliable"
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Christopher David",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T15:23:36.000Z",
          "Titre": "The service works for a few minutes…",
          "Contenu": "The service works for a few minutes then stops. you then have to restart your phone and then it works again"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Samantha Cook",
          "Nb_Reviews": 6,
          "Date": "2023-06-03T08:59:34.000Z",
          "Titre": "Never have any internet",
          "Contenu": "Never have any internet. Waste of money"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Aron",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T17:00:45.000Z",
          "Titre": "Very spotty service",
          "Contenu": "Very spotty service. Even boarding the light rail wouldn’tlink to Moovit. Dead in most places"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mark Copp",
          "Nb_Reviews": 8,
          "Date": "2022-09-15T20:50:43.000Z",
          "Titre": "Don’t be conned by this company stating…",
          "Contenu": "Don’t be conned by this company stating “there is no fair usage policy”. I recently paid £51 for an unlimited esim but after using 20 GB in 2 days I was throttled and told I was breaking their fair usage policy. I sent them a snapshot of their own website but have received no response from this outrageous company. Please do not fall for their lies. I will not be using them ever again. Tiekom has a far better service with outstanding Customer Services."
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "Krzysztof",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T11:36:03.000Z",
          "Titre": "I bought 2 data plans, one didn't work.",
          "Contenu": "I bought 2 data plans.First works 7 days with disruption, required restart connection (flight mode) each hours.After using 1GB I've bought second.Secound bought after 7 days worked 1 day and stop working. Data was available on account 95% but transfer didnt' work.Lost 5ERUO."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "constantin",
          "Nb_Reviews": 4,
          "Date": "2023-06-22T12:41:51.000Z",
          "Titre": "Easy buying",
          "Contenu": "Easy buying. Great price. Poor cell service."
        },
        {
          "Note": 1,
          "Lieu": "ID",
          "Pseudo": "Henrik",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T12:48:10.000Z",
          "Titre": "The connection is not good at all"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Sanyam",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T01:29:25.000Z",
          "Titre": "I chose 1 sim but 2 were activated"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Lino",
          "Nb_Reviews": 1,
          "Date": "2022-10-30T20:08:17.000Z",
          "Titre": "Absolutely crap service and their data…",
          "Contenu": "Absolutely crap service and their data definitely runs out faster than it actually does. Scammer!!"
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Guenther",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T19:34:25.000Z",
          "Titre": "Expensive",
          "Contenu": "Too expensive. 25€ for 5GB."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Torrejon Braojos",
          "Nb_Reviews": 2,
          "Date": "2022-11-08T03:32:07.000Z",
          "Titre": "You shoud’nt insist with the review",
          "Contenu": "You shoud’nt insist with the review. Once is enough"
        },
        {
          "Note": 1,
          "Lieu": "SK",
          "Pseudo": "Darina",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T11:25:50.000Z",
          "Titre": "im not able  to start  to use  data"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ananya",
          "Nb_Reviews": 1,
          "Date": "2023-03-26T18:03:18.000Z",
          "Titre": "Did not work on android phone",
          "Contenu": "Did not work on android phone. Totally wasted."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Ondrej",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T21:50:22.000Z",
          "Titre": "Expensive expensive expensive"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Juan",
          "Nb_Reviews": 1,
          "Date": "2023-03-26T15:52:25.000Z",
          "Titre": "e perítate automatica is unfair"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Emma",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T11:38:43.000Z",
          "Titre": "I never received an answer for my…",
          "Contenu": "I never received an answer for my refund demand."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Naaaaa",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T05:34:38.000Z",
          "Titre": "Very bad internet commection",
          "Contenu": "Very bad internet commection. Money wasted"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Hawraz",
          "Nb_Reviews": 2,
          "Date": "2023-01-11T03:34:10.000Z",
          "Titre": "It's really slow 👎"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Manuel",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T12:00:01.000Z",
          "Titre": "Expensive",
          "Contenu": "Expensive , Bad connection"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Alex Taylor",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T13:39:15.000Z",
          "Titre": "Disappointed",
          "Contenu": "Disappointed Said 5gWhen I arrived got 3G So wouldn’t be using you again"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Grace Wijaya",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T18:27:06.000Z",
          "Titre": "Slow for Indonesia",
          "Contenu": "Roaming and service was spottier than other eSim providers (Airalo) for the parts of Indonesia I visited (e.g. Bali). I'd hesitate to use them for a future trip because the unlimited data plan was pricey and you need to have access to data to use an 'unlimited' plan fully. They assume that you want to renew it and have renew as the default option (but was easy to cancel this renewal)"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Jason Jeffrey",
          "Nb_Reviews": 9,
          "Date": "2023-10-06T04:29:45.000Z",
          "Titre": "Really mixed experience with Maya…",
          "Contenu": "Really mixed experience with Maya Mobile. Took out the APAC+ plan to cover travel to Bali and Singapore. The SIM installation process is pretty simple, but does require 2 devices as you need to scan a QR code on the device you want the SIM to work on.Was all set up before I took off for Bali so expected data to be available when I landed.Unfortunately, it took about 4 days and many messages back and forth to get the connection working. Eventually I was provided a new QR code and once this was installed the connection worked great.I had a second SIM for a trip to Kochi in India and this worked perfectly within the first hour of landing.Then on to Singapore and again have spent 5 days going from WiFi to WiFi and continuously requesting support from Maya mobile. This support has been very friendly and professional, however woefully inadequate.I eventually gave up in Singapore and switched to Airalo which worked immediately.So, all in all, a very mixed experience."
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "Sascha",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T01:51:31.000Z",
          "Titre": "LatSIM - inadequate net supply",
          "Contenu": "This review is related only for LatinSIM option in Costa Rica.I decided to go for maya.net because I‘m planning to stay a couple of weeks in LatinAmerica and the data plan sounds great. No border issues, easy eSIM activation process, searching for the best mobile net etc. So far so good. I also had first experience in Mexico with maya.net. After first problems, it worked quite good. The maya.net customer service is amazing.BUT!I moved on to Costa Rica and decided to switch from local country data plan to LatSIM data plan.I‘m currently using it for about 2 weeks and can say that the mobile net is pretty bad… I‘m always getting LIBERTY and it seems to be the worst. I met many people getting KOLBI or CLARO. They are very pleased with fast connection.I was traveling through San José, Guapiles, Limon, Puerto Viejo… Many cities… And everywhere I’m getting stuck, experiencing slow connection, not only in rural region, also in San José…That might be also the the reason why 70% of my 3GB data plan is gone. It takes a long time, and I‘m using only google maps sometimes and internet research. No videos, no videocalls, no ICloud synch. Just surfing.To be honest, the data plan is not the cheapest compared to the physical SIM cards, you can buy.But the fact that maya.net says, they choose the best mobile net, was the reason using this provider.Summary:- Excelent Customer Service.Fast and customer friendly.- inadequate mobile net supply.In the end, this is decisive for my review only rating 2 of 5 points.Too bad…"
        },
        {
          "Note": 2,
          "Lieu": "CR",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T15:17:17.000Z",
          "Titre": "Travelled all over the South in Costa…",
          "Contenu": "Travelled all over the South in Costa Rica.  Worked in a major city called San Sandrio.  Kept dropping signals in Uvita, and had no signal in Golfito.My girlfriend travelled before to CR and used a different esim provider she had no issues with data connection in any of the major cities listed above.Since we are here for two more weeks I switched esim providers and had no issues."
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "Maximilian",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T19:25:15.000Z",
          "Titre": "Often I had no connection although my…",
          "Contenu": "Often I had no connection although my phone seemed connected. A restart of the phone usually fixed the issue, but it was pretty annoying"
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "KB",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T03:48:14.000Z",
          "Titre": "the network was lost",
          "Contenu": "I used Maya Mobile in Uzbekistan.When I take a taxi or train, the network was lost.I did not know how to fix, but I understood that it could be fine when I re-choose the network by myself, not automatically."
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "Dean",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T17:11:20.000Z",
          "Titre": "Poor coverage.",
          "Contenu": "Poor coverage.Had to keep turning my phone on and off, would keep dropping out.Showed 5G connection but no internet connectivity,My friend had the exact same phone and sim as me and his would work fine beside mine. All settings the same.Mine just failed to work effectively."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas Potter",
          "Nb_Reviews": 2,
          "Date": "2023-06-27T18:38:39.000Z",
          "Titre": "Data is gone suddenly and for no reason",
          "Contenu": "I had a good experience with Maya in Lima, so I extended the package for my trip to Argentina. Everything was fine until the data cut out suddenly on my second day. Just gone for no reason. I messaged Maya for help. The bot said they usually get back to people in 2-3 hours. Meanwhile I'm in the middle of downtown Buenos Aires with no navigation/Uber/etc. Luckily my wife has Airalo which is working fine."
        },
        {
          "Note": 2,
          "Lieu": "NO",
          "Pseudo": "David  Holst",
          "Nb_Reviews": 3,
          "Date": "2023-03-21T17:12:07.000Z",
          "Titre": "2 iPhones and an Android",
          "Contenu": "2 iPhones and an Android, struggled to get it to work even though we followed the instructions before we left. Very confusing when instructions don't use the same words as the phone. While on holiday the network dropped multiple times per day.When it works its affordable and practical."
        },
        {
          "Note": 2,
          "Lieu": "HR",
          "Pseudo": "Efrat",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T22:50:43.000Z",
          "Titre": "We dont have a service in Croatia…",
          "Contenu": "We dont have a service in Croatia Plitvice Lakes National ParkWe started our tour in Slovenia, there it works and now we arrived to Croatia and no service at all!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ivan",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T19:44:07.000Z",
          "Titre": "Used it in Miami,it was working fine no…",
          "Contenu": "Used it in Miami,it was working fine no complaints..Just don’t like the support they charged me another 10gig of data but I didn’t use itContacted them for a refund and they told me they will refund the amount but it never happened.. after contacting them still nothing.."
        },
        {
          "Note": 2,
          "Lieu": "CO",
          "Pseudo": "Juan Carlos",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T23:56:43.000Z",
          "Titre": "Your internet is deplorable",
          "Contenu": "Your internet is deplorable. It's a thousand times better Holafly"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Thomas Bonnet",
          "Nb_Reviews": 2,
          "Date": "2023-08-20T23:40:15.000Z",
          "Titre": "way top expensive for too bad coverage…",
          "Contenu": "way top expensive for too bad coverage … friends with Claró paid less than a third a had mobile network access all over Colombia- we did not have mobile network in many areas like pacific or Caribbean coast."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Fernando",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T03:13:35.000Z",
          "Titre": "Very very ordinary",
          "Contenu": "Very very ordinary. The difference is quick access but if you can buy them somewhere else with a lower price it would be better"
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "Raoul Poras",
          "Nb_Reviews": 5,
          "Date": "2023-07-16T16:51:49.000Z",
          "Titre": "Virtual Card denied - Setup requires IT Phd",
          "Contenu": "Payment with a virtual card or disposable card was constantly denied; thus undermining the security aspect of it. Setting-up the e-sim on an Android was certainly not user-friendly and would discourage any technophobic! In any case, I used my \"lyca-mobil\" package throughout my trip, since it was to my surprise working all over Europe!"
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "Francoise",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T09:31:27.000Z",
          "Titre": "Calls with internet not possible",
          "Contenu": "Calls with internet not possible, as connection comes and goes. Not stable!Very slow loading websites or even sometimes not possible at all."
        },
        {
          "Note": 2,
          "Lieu": "NO",
          "Pseudo": "Aleksander",
          "Nb_Reviews": 6,
          "Date": "2023-02-24T11:29:43.000Z",
          "Titre": "Slow as hell and laggy",
          "Contenu": "Slow as hell and laggy. I have been using differnt travel sim in The same country but my choise will not be mayamobile. I tried it because its saus They use 2 network. They do but i have The network at The same places and it work perctiy find whit The locsl prowider"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Will Cuijpers",
          "Nb_Reviews": 6,
          "Date": "2022-12-20T16:55:21.000Z",
          "Titre": "South America Cruise",
          "Contenu": "Travelled from Peru chili Equador Argentinië and Brasil. Found the speed everywhere slow to very slow. Could hardly work with it. Next time I try something different"
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Jacek",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T21:36:31.000Z",
          "Titre": "I cant follow and control using my date"
        },
        {
          "Note": 2,
          "Lieu": "AE",
          "Pseudo": "Chad",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T22:35:04.000Z",
          "Titre": "Coverage was very bad in Switzerland…",
          "Contenu": "Coverage was very bad in Switzerland compared to other companies"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Idalia",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T08:20:01.000Z",
          "Titre": "Bad range and internet",
          "Contenu": "Telephone range is the worst. All the time it’s losing it Cuts out internet all the timeOnly good thing - nice and easy activating process"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Plamen",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T21:57:15.000Z",
          "Titre": "Kept losing connection",
          "Contenu": "Kept losing connection. The signal overall didn't seem to be that strong or steady"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Grant Brown",
          "Nb_Reviews": 3,
          "Date": "2023-03-28T02:40:35.000Z",
          "Titre": "Sign up was easy",
          "Contenu": "Sign up was easy. Data works fine it’s everything you said it would be except one simple little thing about phones. You should be able to call people and they should be able to call you that has yet to work. Price was great. Very disappointing that I can’t make phone calls."
        },
        {
          "Note": 2,
          "Lieu": "NO",
          "Pseudo": "MS",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T20:09:25.000Z",
          "Titre": "After a short time and mini data usage…",
          "Contenu": "After a short time and mini data usage they ask me if 7‘I want to buy more. Very enervating."
        },
        {
          "Note": 2,
          "Lieu": "TW",
          "Pseudo": "Ondrej",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T02:06:52.000Z",
          "Titre": "The signal doesn’t work perfectly",
          "Contenu": "The signal doesn’t work perfectly. The data is sometimes just 3G and sometimes doesn’t work. I don’t recommend you."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "thibaud brunet",
          "Nb_Reviews": 3,
          "Date": "2023-06-13T16:52:07.000Z",
          "Titre": "Advertise as 4/5g and lte connection",
          "Contenu": "Advertise as 4/5g and lte connection, never had anything else than lte connection in the city center of Barcelona the internet is really struggling, wouldn’t recommend anyone to buy that “ esim “"
        },
        {
          "Note": 2,
          "Lieu": "CR",
          "Pseudo": "fcs",
          "Nb_Reviews": 1,
          "Date": "2023-05-28T15:04:23.000Z",
          "Titre": "cell reception via LTE only",
          "Contenu": "installation and pricing are smooth, but cell reception in Costa Rica is LTE only, disappointingly poor performance throughout"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "UkNow",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T18:33:14.000Z",
          "Titre": "Slow speed",
          "Contenu": "The eSim worked from the get go. The Internet was slow and a bit unstable."
        },
        {
          "Note": 2,
          "Lieu": "TH",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T23:29:20.000Z",
          "Titre": "Too slow",
          "Contenu": "I bought the 10gb for 1 month, and it work really slow. Thank god there js free wifi everywhere"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Leo A",
          "Nb_Reviews": 3,
          "Date": "2023-10-06T15:21:13.000Z",
          "Titre": "Slow",
          "Contenu": "Slow, most of the time I don't have a network"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sue Tan",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T05:21:36.000Z",
          "Titre": "The data service in Taipei was not as…",
          "Contenu": "The data service in Taipei was not as smooth as expected."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Olly",
          "Nb_Reviews": 4,
          "Date": "2022-09-25T11:39:23.000Z",
          "Titre": "A waste of money",
          "Contenu": "A waste of money. It doesn't work most of the time, the coverage in Israel is useless, and when there is coverage the internet stuff (whatsapp, wayze, safari) doesn't always function.  Let's say it works 20% of the time, but you really cannot count on it.  I imagine their problem is that they don't have proper contracts with the main operators.  The eSim technology is the way of the future, but I won't be using this provider again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Juanma",
          "Nb_Reviews": 2,
          "Date": "2023-02-16T18:12:48.000Z",
          "Titre": "The network signal was awful",
          "Contenu": "The network signal was awful. I wouldn't recommend this eSim."
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "Revi",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T11:10:15.000Z",
          "Titre": "Often unable to get signal"
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "Vitalik",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T06:34:59.000Z",
          "Titre": "the internet stop working after few…",
          "Contenu": "the internet stop working after few days without any reason.I dont think that package ended. Anyway, no any warning about not in the message and not in the mail"
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "Miomjon",
          "Nb_Reviews": 3,
          "Date": "2022-11-18T06:33:37.000Z",
          "Titre": "Network is slow and drops regularly"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "DETH",
          "Nb_Reviews": 1,
          "Date": "2022-09-26T18:28:00.000Z",
          "Titre": "trouble using the esim in Israel",
          "Contenu": "I had trouble using the esim in Israel. Could not use it until I got help by a friend who is a technician."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Imran",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T22:42:27.000Z",
          "Titre": "Very poor service in Doha",
          "Contenu": "Very poor service in Doha. 90% time only 3G"
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "IEW",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T22:57:48.000Z",
          "Titre": "Poor signal",
          "Contenu": "Easy to instal, very poor signal."
        },
        {
          "Note": 2,
          "Lieu": "CO",
          "Pseudo": "Daniel Ramirez",
          "Nb_Reviews": 2,
          "Date": "2022-10-16T05:11:42.000Z",
          "Titre": "Too expensive"
        },
        {
          "Note": 2,
          "Lieu": "MY",
          "Pseudo": "Wong",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T14:38:03.000Z",
          "Titre": "Bad internet signal"
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "M.H.",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:39:37.000Z",
          "Titre": "Data doesn’t last long compared to my regular provider.",
          "Contenu": "I’ve been using wi-fi most of the time, yet somehow burned through 2.5GB of data in just one week. 😢 I only turn on the data at night for about 7 hours, when I don’t have wi-fi."
        },
        {
          "Note": 3,
          "Lieu": "NI",
          "Pseudo": "Kristopher",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T22:37:25.000Z",
          "Titre": "As a new user of an eSIM",
          "Contenu": "As a new user of an eSIM, it was pretty confusing and I didnt like that there was no app to track it"
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T19:32:20.000Z",
          "Titre": "Good price but slow internet",
          "Contenu": "Everything was fine with purchase and set up. Easy and great communication. Sim card was ready to go when I arrived. However, the coverage in London was not great and internet was often slow when my local friends could use their internet with ease."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Susan van der Baan",
          "Nb_Reviews": 5,
          "Date": "2023-09-07T19:27:01.000Z",
          "Titre": "Differences between countries",
          "Contenu": "Bought a Maya e-sim for both Malaysia and Indonesia, easy installation but unfortunately I had a lot of problems with my data connection in Indonesia. It only worked when I turned on my 4G, but after a few seconds I lost connection again. However, 4G in Malaysia worked perfectly. Costumer care is good, they reply very fast and are willing to help."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Davide Riggio",
          "Nb_Reviews": 3,
          "Date": "2023-11-06T13:36:00.000Z",
          "Titre": "Use hola pay",
          "Contenu": "Use hola pay, more expensive but at least you get unlimited data. I’ve used Maya half day and it’s already almost gone (1 giga to be fair).It does work smoothly apart from the consumption."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Piola Dario",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T19:01:03.000Z",
          "Titre": "First time; not bad  but it could have been better",
          "Contenu": "Honestly it was first time for me and I was not so familiar with the eSIM in itself. I had to work out the activation with some difficulties.However I found the functionality not stable.Expecially saturday I experienced problems all along the day. Monday was definitely better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T01:25:41.000Z",
          "Titre": "Not what I expected",
          "Contenu": "There was no indication on your website that your E Sims would not work with a locked phone. Didn’t discover that until I was already in country and had to scramble to make other arrangements. The reason for the three stars is because I was able to give the code to another colleague, however, they said the Internet service was very slow."
        },
        {
          "Note": 3,
          "Lieu": "FI",
          "Pseudo": "Edgar Lopez",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T23:07:00.000Z",
          "Titre": "Ok, but pricy, not the best reception in the shipyard area",
          "Contenu": "It is good, but expensive, a friend of mine got an unlimited data plan for 20€, in the same area, I’ll change to that one when my month finishes."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Zulfiqar Ahmed",
          "Nb_Reviews": 4,
          "Date": "2023-10-22T05:21:39.000Z",
          "Titre": "Good but not brilliant",
          "Contenu": "Slightly difficult to set up not just me some of the rest of the group & when checking on usage of data it said 0% used then suddenly 70% used!?"
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Lea",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T20:01:41.000Z",
          "Titre": "Easy setup is the only positive thing about this",
          "Contenu": "The setup was easy. The connection over the esim is not great unfortunately. I have to keep turning mobile data of and on and in some areas it doesn't work, even though it looks like I've got full reception (LTE). So probably wouldn't get it again, only in an emergency."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Dale",
          "Nb_Reviews": 2,
          "Date": "2023-10-29T21:10:53.000Z",
          "Titre": "Support and directions",
          "Contenu": "Support and directions for use with google phone or I phone is sketchy and confusing! Never live support. The chat feature is useless. A rabbit hole!"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Marcel",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T13:06:57.000Z",
          "Titre": "It is OK!",
          "Contenu": "The service was easy to book and install because it is very well described by the provider. However, the network coverage was bad. Maya advertises T-Mobile/AT&T in the US, but compared to a real T-Mobile eSIM, the Maya eSIM had a less network coverage and was sometimes also not available in Los Angeles (why?). Summary: Good for travelers, who want/need to be online direct after arriving in the country of destination. Bad for travelers, who want/neet good network coverage (=> just go directly to a local provider)."
        },
        {
          "Note": 3,
          "Lieu": "PL",
          "Pseudo": "Wojciech",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T09:34:50.000Z",
          "Titre": "Incompetent people, good service",
          "Contenu": "The service itself works well (in Greece), quite easy to set up from the QR code. The customer service, on the other hand, is tragic. My phone (Samsung A 54 5G) does not exist in the list of compatible ones on the Maya website. I therefore sent a question to the service to see if it would work on the Maya network. I received a reply that this phone does not support esim cards. What nonsense!!! I already had an esim card installed in this phone before. Out of curiosity I bought a small top up in Maya and by all means it works!!! Incompetent people!!! That's why for the service itself 5* and for the service 1*."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TOC",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T04:02:25.000Z",
          "Titre": "Be aware of the time difference",
          "Contenu": "I had activated esim in advance before departure in order to use the mobile when I arrived in Tokyo.I couldn't use it till next day because of the activation time was the standard American time or whatever its called. I'm sure there are some people like me. A bit more explanation on this point might be helpful.Otherwise the connection is excellent."
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Jude",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T03:49:33.000Z",
          "Titre": "Random multi-hour outage",
          "Contenu": "Random unexplained complete outage for half a day during usage period so far."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Rhiannon",
          "Nb_Reviews": 5,
          "Date": "2023-08-02T09:37:18.000Z",
          "Titre": "The website itself was easy to use and…",
          "Contenu": "The website itself was easy to use and to put the eSim onto you’re phone.However the data signal itself has been a little iffy.Sometimes no signal at all to access data, possibly due to where we are staying in Turkey."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T18:05:42.000Z",
          "Titre": "Not very reliable",
          "Contenu": "Price is good but I had a hard time connecting to network. I followed the instructions provided by Maya but failed to connect until the 3rd day of my trip when it randomly started working. It was practical for the time it worked but really inconvenient that I could not rely on it. I am unlikely to rely on esim again for future trips."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "A Customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T21:34:48.000Z",
          "Titre": "Unlimited is not worth it after 30gb",
          "Contenu": "I purchased the unlimited data package and it worked well without any issues… until. The problem was that - and I was aware of this - after 30gb of usage they reduce your data speed. This made surfing the web excruciatingly slow, and often had me wishing I had used another company. I knew about this an expected it to come, but it was a harsh reduction in speed. Another thing Maya did - which I was not aware of - was block certain applications on my phone after 30gb of usage. This was annoying. The reason I went with Maya was because of the option to use a hotspot, but I would not recommend them if you plan to use more than 30gb with the unlimited package."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Ian",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T19:55:50.000Z",
          "Titre": "Service was not available throughout…",
          "Contenu": "Service was not available throughout the country of Costa Rica. Generally, Maya would become famous if it offered partial refunds to customers who bought more GB than they used. I bought five and used less than one. Offer a partial refund on your esims, please."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mohammed Amran",
          "Nb_Reviews": 8,
          "Date": "2023-07-02T04:14:40.000Z",
          "Titre": "Great when it works",
          "Contenu": "Great when it works. Not best for Saudi. Best to get physical sim from STC once in country as you get more data and inclusive call minutes.I did find changing data settings from LTE to 3G improved data reliability!"
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Brigitte",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T17:06:41.000Z",
          "Titre": "Data doesn’t always work",
          "Contenu": "Data doesn’t always work, sometimes need to restart the phone so you can get a connection - usually after leaving a wifi zone. Otherwise, good value."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sascha Pries",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T02:03:47.000Z",
          "Titre": "Doesn't work properly in Columbia",
          "Contenu": "Doesn't work properly in Columbia. Even if your phone says you have a signal you actually don't. Customer service is quick, but couldn't help either. Has been working well in Mexico so far."
        },
        {
          "Note": 3,
          "Lieu": "GT",
          "Pseudo": "Matthew",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T06:00:14.000Z",
          "Titre": "Purchased two esims for a trip to…",
          "Contenu": "Purchased two esims for a trip to Guatemala. Upon arrival the sim in iPhone 12 worked fine on the Tigo network. Continued to work fine with mostly LTE coverage. No issues using the esim in Guatemala on iPhone 12. Unfortunately the esim on iPhone 13 did not work with iMessage or FaceTime. It initially did work for web browsing, then abruptly stopped working altogether. Maya mobile was not able to resolve the issue, but did refund. I don’t think this is an issue with the esim or Maya Mobile necessarily. I think it’s an Apple issue as other esim users have had similar experiences. Ended up purchasing a regular sim from a Tigo vendor in Antigua for less and it worked no issues. If you have an iPhone, it might work, or it might not. Maya will refund you if it doesn’t work though, so it’s worth a shot. If it works, it’s easier than having to buy a sim and swap."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mark Fabian",
          "Nb_Reviews": 8,
          "Date": "2023-09-08T17:25:22.000Z",
          "Titre": "Unable to receive text !",
          "Contenu": "I needed to be able to text to verify my identity to login to home apps , but cannot due to data only , so some issues for us as a couple, so next time would buy one Maya data and one locale sim so we can receive text ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marija Rozevska",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T09:59:06.000Z",
          "Titre": "Good service",
          "Contenu": "In total - good service. For a few days experience problems with the internet connection. It was very slow and took a lot of time to load pages and google maps. But then suddenly the situation changed and for the last 4 days of the trip, the internet was perfect at all times."
        },
        {
          "Note": 3,
          "Lieu": "SA",
          "Pseudo": "Ali",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T18:26:32.000Z",
          "Titre": "Good deal but below average connection.",
          "Contenu": "Being connected the moment we landed in London is the best thing about Maya. However, we lost coverage multiple times during our visit in London and that frustrated us a little."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Mattia Drera",
          "Nb_Reviews": 2,
          "Date": "2023-03-13T19:38:43.000Z",
          "Titre": "I chose maya mobile for my trip to Egypt",
          "Contenu": "I chose maya mobile for my trip to Egypt and it was a good fit. Activation at the airport was not immediate but overall I was satisfied with how it worked even though from Luxor to Aswan there was not much mobile network"
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Kamila",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T14:05:22.000Z",
          "Titre": "in comparing with another website",
          "Contenu": "in comparing with another website, youre programm is quite expensive. i would continue in using different website, because they have unlimited data for 20chf, but i have some technical problem here. but otherwise is your programme very well beside of the price"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Robert Mackintosh",
          "Nb_Reviews": 7,
          "Date": "2023-10-09T09:01:40.000Z",
          "Titre": "Although worked really well had issues…",
          "Contenu": "Although worked really well had issues in trying to use it to call local telephone numbers in  Thailand."
        },
        {
          "Note": 3,
          "Lieu": "AL",
          "Pseudo": "Ulrich",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T17:36:52.000Z",
          "Titre": "multi county roaming is a pain",
          "Contenu": "roaming worked well switching between roaming for different countries is a pain!I want 1 eSIM and automatic switching between bought plans…"
        },
        {
          "Note": 3,
          "Lieu": "PL",
          "Pseudo": "TUERO MARIANO ARIEL",
          "Nb_Reviews": 2,
          "Date": "2023-07-27T13:05:36.000Z",
          "Titre": "In albania the connection with maya…",
          "Contenu": "In albania the connection with maya esim was unstable. May be this is due to albania's network infrastructure but i lost connection many times during my trip"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Paulo",
          "Nb_Reviews": 5,
          "Date": "2023-03-31T09:33:31.000Z",
          "Titre": "Everything is great and so easy to use",
          "Contenu": "Everything is great and so easy to use. I just won't give it  a five star because I can't never get 4G network will be nice if in future they work on having a 5G network. But apart from that it's fantastic"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Vivien",
          "Nb_Reviews": 3,
          "Date": "2023-07-14T09:35:04.000Z",
          "Titre": "Ok for the price",
          "Contenu": "Ok for the price. Felt like it took at least a day for the sim to properly work between countries. Connection not very stable and experienced glitches from time to time"
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Oliver",
          "Nb_Reviews": 1,
          "Date": "2023-03-26T14:06:54.000Z",
          "Titre": "eSIM for Egypt was really slow and…",
          "Contenu": "eSIM for Egypt was really slow and crappy. eSIM for Singapore was OK but after adding more data I had to re-install the whole eSIM. Not very convenient."
        },
        {
          "Note": 3,
          "Lieu": "GR",
          "Pseudo": "Antonio",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T20:51:13.000Z",
          "Titre": "The 1gb data puechased expired after…",
          "Contenu": "The 1gb data purchased expired after only using 650mb according to my iphone."
        },
        {
          "Note": 3,
          "Lieu": "MY",
          "Pseudo": "Tomio",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T07:47:49.000Z",
          "Titre": "Difficulty to connect maya at Singapore airport,terminal 1.",
          "Contenu": "When I try to connect maya in Singapore airport,terminal 1,it’s so difficult to connect.After almost 1 hour, it’s connected."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Biagio",
          "Nb_Reviews": 2,
          "Date": "2023-02-26T09:11:53.000Z",
          "Titre": "Difficult to contact",
          "Contenu": "Difficult to contact. Would be nice if there was a phone number. Explanation on how to make calls is not very clear."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Pawel",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T21:03:56.000Z",
          "Titre": "Good value for money",
          "Contenu": "Good value for money, but disadvantage is lack of app to monitor data usage"
        },
        {
          "Note": 3,
          "Lieu": "PL",
          "Pseudo": "Magda Pawłowska",
          "Nb_Reviews": 2,
          "Date": "2023-06-08T16:52:08.000Z",
          "Titre": "Good only in central London",
          "Contenu": "In Central London where the phone reception was good, your internet reception was alright. Anywhere further from city centre your service was nonexistent."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Paolo",
          "Nb_Reviews": 2,
          "Date": "2023-08-28T13:11:39.000Z",
          "Titre": "Very good service, but...",
          "Contenu": "Very good service, though a locally-bought SIM seems to be a cheaper option"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Doug",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T16:23:25.000Z",
          "Titre": "Could not place calls",
          "Contenu": "Could not place calls. Coverage was very spotty despite their marketing promises."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Claire",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T00:36:16.000Z",
          "Titre": "Not able to get better than lte…",
          "Contenu": "Not able to get better than lte connection, but still works a bit. Doesn’t really work in buildings"
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Tobi",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T09:56:22.000Z",
          "Titre": "Everything was good with the infos and…",
          "Contenu": "Everything was good with the infos and the payment, but the internet was often very slow or at times there was no signal at all"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-06-12T00:24:18.000Z",
          "Titre": "Easy to purchase and activate",
          "Contenu": "Easy to purchase and activate. However, comparatively pricey; other plans offer more data for less."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Ontevreden over retourbeleid bij fabrieksfout",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T20:56:06.000Z",
          "Titre": "Low amount of data for the price",
          "Contenu": "Low amount of data for the price. Rest is functioning as expected"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Don",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T06:24:27.000Z",
          "Titre": "Works okay",
          "Contenu": "Worked seamlessly but blocks some sites like Cinemark. Also blocked my work email but Gmail was okay. Otherwise all worked well."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Carolin Braun",
          "Nb_Reviews": 3,
          "Date": "2023-03-28T05:20:54.000Z",
          "Titre": "Easy to set up but not everywhere network.",
          "Contenu": "Easy to set up.  Very well described.  Unfortunately not everywhere network."
        },
        {
          "Note": 3,
          "Lieu": "LT",
          "Pseudo": "Mintare",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T20:06:11.000Z",
          "Titre": "It was okay at first",
          "Contenu": "It was okay at first, but after using 1 month it’s none stop started crashing."
        },
        {
          "Note": 3,
          "Lieu": "CY",
          "Pseudo": "Guenther",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T10:10:08.000Z",
          "Titre": "Does not work in turkish cyprus"
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Yassine",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T19:08:55.000Z",
          "Titre": "Good service and covery",
          "Contenu": "A good covery  in France and spain  but the voice call and SMS were not operational"
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Lukasz",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T11:19:26.000Z",
          "Titre": "Attention to auto-dialed GSM operator",
          "Contenu": "The automatically selected GSM operator, despite being in LTE coverage, offered very slow Internet. After manually selecting another operator, the situation improved. Unfortunately, only in the second week of using the service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Austin Iturralde",
          "Nb_Reviews": 2,
          "Date": "2023-10-07T15:26:03.000Z",
          "Titre": "Varies from 1 to 10 mbps",
          "Contenu": "Varies from 1 to 10 mbps how am I able to utilize it on a puck"
        },
        {
          "Note": 3,
          "Lieu": "PA",
          "Pseudo": "Sixto Pinilla",
          "Nb_Reviews": 3,
          "Date": "2022-11-06T20:22:54.000Z",
          "Titre": "I bought the eSIM in Amsterdam while…",
          "Contenu": "I bought the eSIM in Amsterdam while waiting next flight, but it didn't connect till arrive to ROME, the connectivity was very limited fine in center cities but bad in smaller cities most of the time the connection was 3G"
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "Alexandre",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T23:18:06.000Z",
          "Titre": "The signal is not strong enough and…",
          "Contenu": "The signal is not strong enough and there’s no app to check The consume"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "saBine",
          "Nb_Reviews": 2,
          "Date": "2023-06-04T21:16:18.000Z",
          "Titre": "Not good cell service",
          "Contenu": "Very easy to install, activation worked fast and well, unfortunately no good cell service"
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Dmitry Ditkovich",
          "Nb_Reviews": 4,
          "Date": "2023-08-22T18:04:04.000Z",
          "Titre": "No support is exist",
          "Contenu": "Everything is good, but if you have problem there no service to reach (only auto. reply)"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Mk",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T14:46:22.000Z",
          "Titre": "I bought it for 1 month",
          "Contenu": "I bought it for 1 month, but it was finished in 2 weeks."
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Sebastian",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T04:23:08.000Z",
          "Titre": "Good connection in Singapore but not in…",
          "Contenu": "Good connection in Singapore but not in Indonesia :("
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Alex González",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T12:26:48.000Z",
          "Titre": "Easy process and quick access but no 5G…",
          "Contenu": "Easy process and quick access but no 5G at all. Just LTE the whole time in Italy. In Florence, it was bad."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Chris Kotze",
          "Nb_Reviews": 3,
          "Date": "2022-09-15T17:30:55.000Z",
          "Titre": "Does not work with Apple Watch",
          "Contenu": "I took on Maya.net with the promise of access for my sons Apple Watch.  The Sim loaded perfectly for the phone so suspect if I wanted data for the phone it would have been fine.  Unfortunately, when I tried to connect the eSim to the watch it was unable to do so saying that service is not currently supported.  Very prompt customer support and refund but pity the website did not have accurate information for Apple Watch in Switzerland."
        },
        {
          "Note": 3,
          "Lieu": "ID",
          "Pseudo": "Riccardo",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T10:40:28.000Z",
          "Titre": "Medium giod",
          "Contenu": "Decent coverage and easy access  I haven’t tried competitors."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Witrix",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T13:10:10.000Z",
          "Titre": "But i don't can phone with number maya…",
          "Contenu": "But i don't can phone with number maya but the service is good"
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Daniel Cs.",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T09:41:39.000Z",
          "Titre": "Bought 2 mobile plans",
          "Contenu": "I got a plan for both me and my girlfriend. She could not install it at all. As for me, it took 12-24 hours for the connection to become stable, and even after that it was very slow. There are better roaming options in Europe."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Dilip",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T20:52:13.000Z",
          "Titre": "It's okay",
          "Contenu": "Didn't work that well when I went to vadodara. Very slow speed and only worked with 2g and 3g."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Abdelaziz Echcharef",
          "Nb_Reviews": 2,
          "Date": "2022-12-11T16:22:22.000Z",
          "Titre": "good service but very expensive",
          "Contenu": "good service but the price just 5 gega for 11 euro is very expensive"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Leonid",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T07:37:57.000Z",
          "Titre": "Data connection is not stable"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valon",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T20:25:41.000Z",
          "Titre": "Data trouble",
          "Contenu": "Half of the time i had troubles with 4G! Turned automaticaly to 3G"
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Shani",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T21:11:21.000Z",
          "Titre": "internet disconnected",
          "Contenu": "I bought 3 gb in Prague and the internet occasionally disconnected during important navigation moments"
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Marcel",
          "Nb_Reviews": 5,
          "Date": "2023-06-15T01:42:13.000Z",
          "Titre": "Limited connection in Puerto López and…",
          "Contenu": "Limited connection in Puerto López and San Cristobal"
        },
        {
          "Note": 3,
          "Lieu": "SE",
          "Pseudo": "ADRIAN",
          "Nb_Reviews": 2,
          "Date": "2022-09-29T20:48:00.000Z",
          "Titre": "To expensive",
          "Contenu": "Connection is fine but the price is unreasonable and buying a normal simcard in any shop on Bali is 1/10 in cost of data."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Renato",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T02:39:24.000Z",
          "Titre": "Signal ir not so good in Bicester area"
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Anas",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T17:53:45.000Z",
          "Titre": "Not clear on the call package"
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Random traveller",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T17:09:24.000Z",
          "Titre": "Lots of dead spots in some places"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Akin",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T18:13:44.000Z",
          "Titre": "Frequently interrupted"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Emily Mann",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T19:34:07.000Z",
          "Titre": "Quite pricey"
        },
        {
          "Note": 4,
          "Lieu": "GT",
          "Pseudo": "Andrea",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:15:55.000Z",
          "Titre": "It worked really well for my trip",
          "Contenu": "It worked really well for my trip, even though it didn’t had signal coverage in London at times. The activation steps were easy to follow."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "GaryC",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T10:21:46.000Z",
          "Titre": "Very easy to use data across Europe",
          "Contenu": "The e-sim was very simple to activate and worked straight away once I reached Europe. Phone calls can be problematic - check with your service provider beforehand and check you won’t get charged. But data works effortlessly, just disable the primary sim."
        },
        {
          "Note": 4,
          "Lieu": "RS",
          "Pseudo": "Nikola",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:21:32.000Z",
          "Titre": "Easy to setup",
          "Contenu": "Easy to setup. Good coverage. Sometimes speed is limited even though good signal."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Sara",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T11:12:42.000Z",
          "Titre": "Wonderful for travelers",
          "Contenu": "Wonderful for travelers. Something you must do before your trip with all security."
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T11:47:51.000Z",
          "Titre": "Had no problems so far!",
          "Contenu": "Had no problems so far!I bought a APAC package to travel through Singapore, Malaysia, Indonesia and Taiwan. I'm only through Malaysia so far but I've had no issues with service so far - and the price is very competitive with the other eSIM options I've found. If I have good experience with all the countries I'm planning on going to, then this is definitely 5 stars!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Emma",
          "Nb_Reviews": 4,
          "Date": "2023-12-01T00:19:38.000Z",
          "Titre": "Worked well",
          "Contenu": "Worked well, as expected - would definitely use again as they have better deals than my current provider! EU sim even worked in the UK, which I wasn’t expecting. Could do with clearer instructions how to set up, but thankfully I’d used an eSIM before so was fine Sent A LOT of spam emails after I’d signed up."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Anna Giacomelli",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T17:35:51.000Z",
          "Titre": "Great option",
          "Contenu": "Great option, but I feel like the connection is not as strong as getting a regular SIM card. Overall I am happy with the product."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T08:35:02.000Z",
          "Titre": "Maya is truly remarkable product",
          "Contenu": "Maya is truly remarkable product. To just be able to go online, choose a plan, add the esim to my phone and have instant data is amazing. To be able to change from country to country if I like so I get the best access to networks when I travel. The only thing I feel is missing is the ability to manage all of this in an app. This would make it perfect."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Julian",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T04:00:27.000Z",
          "Titre": "Good but not cheap",
          "Contenu": "Everything worked perfectly but could be a little cheaper"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 17,
          "Date": "2023-11-26T16:01:06.000Z",
          "Titre": "The process is simple and reliable",
          "Contenu": "The process is simple and reliable. Communication from Maya.net is precise and acurate.reason for 4 star is that communication in rural areas and safari reserves in South Africa is negligible.rest everything is all good"
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "Harald",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T15:53:13.000Z",
          "Titre": "I have booked Asia eSim",
          "Contenu": "I have booked Asia eSim. It worked right from the start, when we arrived in Bangkok. I had little difficulties when putting on the expansion, for another 15 days. Maybe about 12 Hours it constantly went on and off. Now it works fine again."
        },
        {
          "Note": 4,
          "Lieu": "AW",
          "Pseudo": "DZ",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T06:19:46.000Z",
          "Titre": "Very helpful",
          "Contenu": "Some hassle during activation but then working fine (Argentina, Chile, USA, Aruba)."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "BNS",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T01:04:35.000Z",
          "Titre": "Easy to set up",
          "Contenu": "Easy to set up, worked well, only slow sometimes. Not 5g fast but still  functioned well. Less than 5 stars because too many spam emails afterwards with promos, offers etc."
        },
        {
          "Note": 4,
          "Lieu": "HR",
          "Pseudo": "Juraj",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T11:29:49.000Z",
          "Titre": "At times the speed felt a little…",
          "Contenu": "At times the speed felt a little throttled and slow. However nothing unmanageable and this was temporary, for the bulk of the time it worked well and as advertised"
        },
        {
          "Note": 4,
          "Lieu": "GT",
          "Pseudo": "Alexander",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T16:28:51.000Z",
          "Titre": "The service worked as promised and was…",
          "Contenu": "The service worked as promised and was easy to install. I would appreciate to have plans for whole two weeks instead of just five days to be prepared for the complete vacation."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Mica",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T18:42:40.000Z",
          "Titre": "Would recommend",
          "Contenu": "It’s not so expensive and it’s easy to activate. The only thing is sometimes it doesn’t have a signal or it’s slow but it works. Would still recommend it."
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Lyra",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T09:26:15.000Z",
          "Titre": "good customer service",
          "Contenu": "*update*Maya team immediately fix the issue. Good customer serviceI  signed up for 3GB for 5 days. And on day 4 I wasnt able to access the internet, I checked my account and it shows 1.96 GB used. So basically I still have almost 1.1GB left. Never again with Maya!!! I was out in Yerevan Armenia and I couldn’t get a taxi because of this!!!!!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Maciej",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T09:48:26.000Z",
          "Titre": "Great and quick onboarding",
          "Contenu": "Great and quick onboarding. The setup was super easy an quick. I take one star off because often in downtown London I didnt have internet eventhough signal strenght was at it highest"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Branka Tunjic",
          "Nb_Reviews": 2,
          "Date": "2023-10-15T16:09:34.000Z",
          "Titre": "I'm very happy with my purchase of two…",
          "Contenu": "I'm very happy with my purchase of two e Sims from Maya Mobile. I would like a bit better price, but everything else is OK. The Sim cards worked as expected and accessing my profile is easy and straight forward. I'm still Maya Mobile customer and  my intention is to continue use Maya Mobile"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patrick Tan",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T17:49:03.000Z",
          "Titre": "No way to recharge if you are out of data",
          "Contenu": "The connection is fast but sometime need to restart by turning the esim card setting on/ off. If you have ran out of data you will be cut off without warning, you can’t recharge esim without an Internet connection. It will be difficult until you can find a store with free WiFi to login maya to recharge. Maya should provide a connection just for recharging."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Brian Kenny",
          "Nb_Reviews": 6,
          "Date": "2023-10-07T16:56:14.000Z",
          "Titre": "Value for money!!",
          "Contenu": "Easy to use, value for money. Connection so far is always excellent. The one negative experience is that a lot of Apps don’t work at all, which is a shame because I was prepared to spend money on it on a regular basis but won’t be now if my favorite Apps are being blocked"
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "Radka Smith",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T06:51:07.000Z",
          "Titre": "Same price as physical card",
          "Contenu": "I used maya, bought 20GB, they sent me email 70% of data is used, I checked my Maya account and it showed I used 15.2Gb but anyway not possible to connect Internet without WiFi. I contacted them, had to wait for answer but on the end,in 24 hours they sorted out the problem. But have to say, on same money I can buy sim card in Turkey and will have some free minutes and texts"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Matteo Zezza",
          "Nb_Reviews": 4,
          "Date": "2023-10-24T09:19:28.000Z",
          "Titre": "The data worked quite well",
          "Contenu": "The data worked quite well, but some apps (like Teams) were not usable.Moreover the procedure for the activation was quite difficult, especially for Android.Overall, however, the opinion is positive."
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "Baby Katze",
          "Nb_Reviews": 2,
          "Date": "2023-10-08T18:31:07.000Z",
          "Titre": "Recommended for Turkey, but not for Uzbekistan",
          "Contenu": "I bought an e-sim package for Turkey and for Uzbekistan (I was using a Samsung Galaxy S23). In Turkey, it worked like a charm (and it's much chaper than buying a physical tourist-simcard in the country). Can definitely recommend it for Turkey.In Uzbekistan on the other hand, I kept losing the connection and the internet was extremely slow, I would say around 90% of the time I was without connection. Support was'nt really helping, they just replied with standardized answers/tips you can also find in their FAQs. Buying a physical sim card is much cheaper and will provide you with faster and most importantly reliable internet connection. No recommendation for use in Uzbekistan!Update 08.10.2023: I received a refund from Maya for the Uzbekistan data package - added one star for their support!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Trish Baillie",
          "Nb_Reviews": 16,
          "Date": "2023-09-13T08:29:36.000Z",
          "Titre": "A very clever idea.",
          "Contenu": "Quite easy to buy and upload. Not completely intuitive and it took a couple of tries to get it right but once installed it worked really well.  Used it on an 11 day holiday to Turkey, so outside the EU, and therefore not covered by our usual phone contracts. It doesn’t cover phone calls and texts but data and email covered everything needed while away."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Stephan",
          "Nb_Reviews": 6,
          "Date": "2023-10-25T11:23:01.000Z",
          "Titre": "Every thing is fine",
          "Contenu": "Every thing is fine. Connection is easy and got supported. you didn't have a lical number. That can be difficul perhaps fo unsing grab."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Rudy Vink",
          "Nb_Reviews": 9,
          "Date": "2023-06-24T16:31:49.000Z",
          "Titre": "All worked well",
          "Contenu": "All worked well, connection was reasonably simple albeit trial and error, instructions need to be clearer, more detailed. Allowed us to use WhatsApp for calls, it’s a shame it’s only a data ESim and did not include voice.My biggest concern was the dramatic increase in junk mail while using the ESim Overall though good price for the data required and worked well"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jaziel",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T15:10:26.000Z",
          "Titre": "Easy to use and I can share internet with my other devices"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Chantal",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T06:58:37.000Z",
          "Titre": "Practical when on the go with a foreign…",
          "Contenu": "Practical when on the go with a foreign telephone and steep roaming charges."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "ML",
          "Nb_Reviews": 2,
          "Date": "2023-06-18T22:29:33.000Z",
          "Titre": "Overall a great service",
          "Contenu": "Works, value for money, Esim easy to activate . However my regular sim seems no to be receiving text/sms with after e Sim had been activated.In some parts of London coverage is not great ie Covent garden area. So far otherwise ok"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Fatima Matem",
          "Nb_Reviews": 2,
          "Date": "2023-08-10T11:12:43.000Z",
          "Titre": "Works well",
          "Contenu": "Works well. Used the eSIM while in the UK. Instructions were clear and initial connection was seamless. After that though, I experienced some issues with the connection; no internet connection, limited coverage... At a point I wondered if I was out of data, checked my account and saw I hadn't even used up to 50%. Restarted my phone and that helped. I restarted my phone I few more times when I experienced the lack of or limited internet connection. Those moments were frustrating but overall, using Maya was convenient."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "ZS",
          "Nb_Reviews": 8,
          "Date": "2023-09-27T19:20:05.000Z",
          "Titre": "Super easy to use and activate",
          "Contenu": "Super easy to use and activate.4 stars because one evening the data stopped working and I assumed it had run out but I received no explanation from the company, would’ve been nice but not necessarily expected.I’d definitely use the company again."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Briget",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T22:54:34.000Z",
          "Titre": "Great easy app",
          "Contenu": "Great easy app, works really well Only have package valid for 30 days , still have one gig available and need it but cannot extend.Should be able to use within EU not get separate SIM for each country and cannot transfer daya that already paid for"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Giovanna Toldi",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T16:58:02.000Z",
          "Titre": "Worked well",
          "Contenu": "I bought the unlimited data pack for Italy because I work a lot with my laptop and I have been travelling for 2 months here. It worked well until I reached 30GB (in 2 weeks), then it became slower and it worked well only for emails. Due to the fact that this product was not what I thought it was, I requested a refund. This was granted to me after a bit of back and forth to explain the misunderstanding, therefore I am happy with the outcome."
        },
        {
          "Note": 4,
          "Lieu": "AM",
          "Pseudo": "Sargis",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T08:35:32.000Z",
          "Titre": "The connection was not always…",
          "Contenu": "The connection was not always available. My roaming provided more broad connectivity than Maya, but it didn't give me much trouble since most places worked fine. The internet speed was good.I had a hard time during the initial setup because the terms described in the documentation, like settings menu item names, needed to be correctly named for Samsung Galaxy S23 (in particular, there is no Cellular menu option on my phone settings page). I had to do additional research to be able to complete the setup."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Vanessa",
          "Nb_Reviews": 2,
          "Date": "2023-08-27T20:19:54.000Z",
          "Titre": "Israël",
          "Contenu": "The whole buying proces was very quick and easy. The data was immediately activated when I arrived in place. Also they have different options to tell you what to do when the internet is running slow or doesn’t work. Unfortunately my internet runned very slow a few times a day. Not sure if it’s because I was in a place with slow data or when I traveling in the bus? Overall great experience and will use it again for sure."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Francisca",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T13:35:55.000Z",
          "Titre": "Fantastic",
          "Contenu": "I think the app is fantastic and very practical but I would like it to work for all smartphones and not such new versions (such as from the iPhone 11 onwards). For example, my parents came to visit Europe and they were very excited to use this system but they couldn't because my mom has an iPhone 7 and my dad has an iPhone 6. That was very sad. Everything else is fine."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Andre",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T12:02:01.000Z",
          "Titre": "Connection was slowly at different…",
          "Contenu": "Connection was slowly at different times of days. Don‘t know of it depended on turkish mobile phone network or something else. Installation was easy and helpful explained. App could help monitoring usage instead of website login. Finally it worked and was suitible for me."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jonas",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T21:24:34.000Z",
          "Titre": "Traveling through California(USA)",
          "Contenu": "Traveling through California(USA)This eSIM is a great alternative to using my own SIM and avoid the ROAMING CHARGES. CONVENIENCE- eSIM provide quick online install avoiding physical SIM (which you need to purchase ahead of time). AVERAGE DATA SPEED piggybacking on major cell company in the area. *I did get some spotty signals but overall good coverage in metropolitan areas. Outside cities are not as reliable. Main use for the esim is for GPS maps and chat APPS like FB messenger and Viber. **Make sure you turn off your other SIM or eSIM to avoid charges. Set your cellular data setting so APPS and mail(push) don’t get used on the background.  I learned that the hard way as my data got depleted. Overall I would use this company again."
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "Susana",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T17:54:29.000Z",
          "Titre": "Good, but",
          "Contenu": "I'm going to give 4 because I'm not sure if the problems I got were not available. First, I had bad connection in the North of Wales, although it's covered in the map on the website. Also, I felt my 3gb expired very quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T00:32:59.000Z",
          "Titre": "eSIM is a game changer; tho have some concerns",
          "Contenu": "An eSIM is really a game changer, and I was excited to give this a try. And mostly, it was great! Easy to install, got me data in most places most of the time, and the prices are reasonable. Some concerns though: -I have an iPhone and it totally messed with my iMessages and contacts. I didn't get a bunch of messages, group chats were unusable, and people's name/photos weren't showing up. There was no easy solution to this- I read the FAQ's and even contacted customer support. Maybe user-error, but if so I can't be the only one? -The data went conspicuously fast. I'm super careful about streaming, uploading photos, etc and it went much, much faster than predicted based on my typical usage. Maybe I was on weak internet and it pulled from data sometimes? I tried to turn off data when on wifi, but it didn't seem to matter much. Spent twice what I anticipated."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "L van Hooijdonk",
          "Nb_Reviews": 3,
          "Date": "2023-09-06T15:17:16.000Z",
          "Titre": "Very easy, but not really on an android phone",
          "Contenu": "It was not difficult to install the simcard and also the payment went well. Except when you have an android phone it doesn't show up right away. That ofcourse is not maya mobiles fault, but maybe you can give instructions to make it work on a android phone. Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Fida",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T02:46:21.000Z",
          "Titre": "Quick pick up of network in NZ",
          "Contenu": "Quick pick up of network in NZ, however instructions wasn't clear on how to activate it. I had to disable my existing sim to get full service from Maya. Network coverage was good as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Herve",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T17:33:43.000Z",
          "Titre": "Very easy to register and receive the…",
          "Contenu": "Very easy to register and receive the esim card. Instruction for the installation could be a little more detailed for Samsung. Connexion is working very well with good speed."
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "Mark",
          "Nb_Reviews": 3,
          "Date": "2023-08-01T20:04:42.000Z",
          "Titre": "Worked great in Turkey",
          "Contenu": "Worked great in Turkey. However prices are higher than expected so consider buying a cheap local SIM. If you need eSIM only and don't need really big packet, Maya is really a good option."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paula",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T20:36:33.000Z",
          "Titre": "I really like the fact that you don’t…",
          "Contenu": "I really like the fact that you don’t have to physically buy a SIM card so I could book it from the Wi-Fi hotel I was staying in. It’s easy to manage and they send you all details on how to do the configuration on your cellphone."
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Susan",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T16:50:48.000Z",
          "Titre": "Maya coverage in Northern Europe and…",
          "Contenu": "Maya coverage in Northern Europe and England has been mostly excellent. Very easy to purchase and connect. Highly recommend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jyothish",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T19:22:42.000Z",
          "Titre": "I had very good coverage in…",
          "Contenu": "I had very good coverage in Switzerland, but in France i had slight signal strength issue initially but later it became ok and the internet was fastI reccomend maya esom for Europe traveller"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "BENAISSA",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T10:24:34.000Z",
          "Titre": "Very good!",
          "Contenu": "I was very pleased with the options Maya offers. Furthermore I need to mention that the Internet conection was always stable and enough"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2023-07-06T12:19:14.000Z",
          "Titre": "Easy to install and works well",
          "Contenu": "Easy to install and works well. Just need to remember to turn it on once arrived in Europe. I had to log on via an airport wifi to search on why it was not connected to data. After that it has connected execpt one time after being on a hotel wifi I needed to turn airline mode on and off to connect again (to a different network)"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Oswaldo",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T19:10:30.000Z",
          "Titre": "For the most part good 👍🏼",
          "Contenu": "The speed was good, the price was good, and the support was also good. It was super easy to set up and everything worked smoothly. The only issue I encountered is that some websites blocked me, as if I was using some kind of VPN."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Frank",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T14:06:40.000Z",
          "Titre": "Unclear setup instructions",
          "Contenu": "Esim was working well. The only issue I had with the plan was about its initial setup. There’s no clear instructions about how to set up the esim. I was charged $15 roaming fees on the first day of my travel by my primary line provider because of faulty instructions from Maya as it said I can leave my primary line on. Maya needs to revise their instructions wholly."
        },
        {
          "Note": 4,
          "Lieu": "AL",
          "Pseudo": "Dietmar",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T11:06:38.000Z",
          "Titre": "Installation on the device",
          "Contenu": "It is an easy way to cross borders and there is no need to buy a physical Sim-Card. It is easy, to choose your Data Plan und pay with PayPal. You get your QR-Code immedatly via Email. But there are problems to scan the QR Code from the Email  via screenshot with my Android Galaxy S22 cellphone directly. Wenn the E-Sim was installed correctly at the end, there was another problem with the possibilty to promt the correct APN, that is given in the Email. These problems are more or less problems of the users side. Now,after the knowledge of the single steps I could recommend the completion by Maya"
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "ja",
          "Nb_Reviews": 5,
          "Date": "2023-07-09T14:26:03.000Z",
          "Titre": "Generally positive, some problems with signal",
          "Contenu": "Overall, using the Maya eSim in Corfu Greece was positive. In many area I had good 5G signal and speed. In more remote areas (we were traveling across the island a lot) there was bad reception or no signal at all. I had to revert to my Swiss SIM in those cases"
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Robert john",
          "Nb_Reviews": 3,
          "Date": "2023-03-09T20:15:13.000Z",
          "Titre": "I was on vacation in Brazil with my…",
          "Contenu": "I was on vacation in Brazil with my girlfriend in the winter of 2023. We both bought an esim from Maya. Everything was fine for about one week then I experienced problems (I was connected but could not use data and, hence, no internet connexion). I use an Android Pixel 3XL (and my girlfriend uses Apple iPhone and had no problem whatsoever).I made several different attempts to resolve the problem myself. We finally gave up and decided to use customer service. Which is what I should have done in the beginning... It was no biggie and everything was resolved within minutes. Quick and efficient customer service obviously. Thumbs up!"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T09:20:25.000Z",
          "Titre": "Good service",
          "Contenu": "In Kuala Lumpur the connection was good, no complains about it. In Indesia the connection was not that great, but the service of Maya is really good. They fixed the problems I had and kept in contact with me if I have any other problems."
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "From VIE to UK",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T00:18:08.000Z",
          "Titre": "Reliable eSim card",
          "Contenu": "Reliable eSim card. Easy to activate. And it’s really working. Minus one star, because just like any other normal mobile provider.. there were times (about 3-5times of my 5-day stay in UK) it’s so slow, or no connection at all."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "YSB",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T00:29:33.000Z",
          "Titre": "Affordable and reliable connectivity",
          "Contenu": "Reliable 4G connectivity for the most part, although occasionally it drops to 3G outside urban/town areas (Nova Scotia, Canada.) Overall, it is great, and for a very reasonable price. I would definitely use their service again."
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Noam",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T08:45:24.000Z",
          "Titre": "very good experiance",
          "Contenu": "i bought a 1 giga package for a short trip to Greece. the tech bit at the beginning was a little tricky (i use an android phone) but I managed, and since then the service worked perfectly and connection was solid. I ended up paying 10 percent than what my carrier charges for such a trip! I will use this service again"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Paul Bretherton",
          "Nb_Reviews": 12,
          "Date": "2023-07-02T11:38:04.000Z",
          "Titre": "So my experience was a little mixed",
          "Contenu": "Thank you Maya, I took out 2 e-sims from you, by accident I deleted the e-sim for my wife’s mobile, I did email your customer service the day we tried to set up the account, but got no reply, which was disappointing, but my phone worked brilliantly, so I paid for 2 e-sim but only got to use 1. So my experience was a little mixed,"
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "Dimis",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T12:12:33.000Z",
          "Titre": "Very good choice",
          "Contenu": "All was good, the esim was activated immediately when arrived in Turkey and could share it via iPhone hotspot so we all have internet.The signal, 4G, most of the times was strong. This package contains only data, not voice."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Norma Mcdonnell",
          "Nb_Reviews": 11,
          "Date": "2023-07-24T13:23:10.000Z",
          "Titre": "Tried out an eSIM from",
          "Contenu": "Tried out an eSIM from. MAya whilst on holiday. Easy to use and reasonable price . Will definitely use next time and upgrade to unlimited for Europe ( same price as Switzerland only)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul G.",
          "Nb_Reviews": 17,
          "Date": "2023-05-15T16:08:10.000Z",
          "Titre": "Just used Maya in Colombia for first…",
          "Contenu": "Just used Maya in Colombia for first time using it anywhere.  Like others have mentioned, it is not the easiest to load when away from home.  The qr code took me to a sign-on page in Spanish requiring a credit card so I ducked out of that!  But then I got the info and put it in manually without too much problem. (using iphone 12 mini). Well worth noting that there is an additional step in the settings for Colombia.  Seems to be a great system."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T15:10:13.000Z",
          "Titre": "Data worked almost every time I tried…",
          "Contenu": "Data worked almost every time I tried to use it, and really only didn’t work where we were so far away from infrastructure that no services would have worked"
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "Agnieszka",
          "Nb_Reviews": 5,
          "Date": "2023-02-20T01:18:18.000Z",
          "Titre": "Not easy to activate",
          "Contenu": "I could not activate the service outside of Switzerland or with wifi connection so I had to use my roaming which I really wanted to avoid by purchasing this card. Afterwards it has been working properly.So it did not fully paid off."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Stephane",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T12:22:48.000Z",
          "Titre": "Great in any city",
          "Contenu": "Worked very well where there was good LTE coverage but would stop working in remote locations and mountains where only 3G or Edge worked. It was expected but a minor hindrance still."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Chris Durham",
          "Nb_Reviews": 2,
          "Date": "2023-06-11T18:46:52.000Z",
          "Titre": "Worked really nicely overall",
          "Contenu": "Worked really nicely overall. Used in Turkey for a long weekend. Only reason to drop a star is that the coverage/speed wasn’t amazing. Usable, definitely but not quite the same as being at home (UK)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Denise",
          "Nb_Reviews": 4,
          "Date": "2023-06-20T17:13:56.000Z",
          "Titre": "I am a first time user of esim for cell…",
          "Contenu": "I am a first time user of esim for cell data. I was pleasantly surprised that it loaded and was ready for use once we landed in Heathrow, London. It was affordable and for the most part worked as advertised.The only negative is that there were times when it was slow to load our map but if we were patient it would eventually work.We found there is WIFI in alot of cafe's; museums; and our hotel so really only used it for google maps and a few look ups for dining. We will use for our next trip!"
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "Donald",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T03:26:22.000Z",
          "Titre": "Best eSIM I found for Seoul",
          "Contenu": "I’m in Seoul and this is the first time to use Maya but definitely won’t be the last. Overall, it was worth it. We used Airalo before and although Airalo’s speed was a little faster, Maya worked just fine and was easier to install. Best part - the 30-day plan was a third the price than Airalo."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Aziza AL Adhoobi",
          "Nb_Reviews": 4,
          "Date": "2023-06-11T19:40:01.000Z",
          "Titre": "Azerbaijan and Turkey",
          "Contenu": "My e-sim worked flawlessly during my stay in Azerbaijan; however, the data packages were expensive. I had several installation issues with e-sim in Turkey, which was frustrating as I had to re-install every now and then. The data packages provided were fair."
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "Herbert",
          "Nb_Reviews": 3,
          "Date": "2023-08-07T07:38:42.000Z",
          "Titre": "Great and easy to intall an purchase",
          "Contenu": "Ist so Great ans easy to purchase and install. The Connection is not everywhere good. Sometimes there is no connection and you must go on the flight Modus an back to have a connection."
        },
        {
          "Note": 4,
          "Lieu": "HR",
          "Pseudo": "Nenad",
          "Nb_Reviews": 5,
          "Date": "2023-05-21T18:17:33.000Z",
          "Titre": "Easy to use",
          "Contenu": "It was rather easy to install and use but I don't know if it was the sim or bad signal coverage in general in UK but the internet connection was pretty slow at times. Overall I would recommend it."
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "Nick",
          "Nb_Reviews": 5,
          "Date": "2023-06-04T01:16:49.000Z",
          "Titre": "I’m not disappointed",
          "Contenu": "Set up was easy and price is reasonable. The only issue is the internet speed is not impressive. It’s enough for surfing, checking email, texting but for streaming it struggles."
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Arthur",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T06:33:20.000Z",
          "Titre": "Great to reduce cost on data transfer",
          "Contenu": "Great to reduce cost on data transfer The only disadvantage is the poor coverage in some districts around the country."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Adrian",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T03:14:34.000Z",
          "Titre": "The experience in Brazil was amazing",
          "Contenu": "The experience in Brazil was amazing. Exceeded all my expectations. In Argentina had some issues to get connection to the network in one city but after that in other places it worked just fine. Very recommended in general."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "David Rüegg",
          "Nb_Reviews": 2,
          "Date": "2023-08-13T00:07:20.000Z",
          "Titre": "Good price, some performance issues.",
          "Contenu": "Cost for value is good. Travelling in Ecuador I experienced some connection problems on my Samsung S22. When the connection was lost (due to network coverage) the connection often was not automatically restored, when coverage was good again. Further an app to monitor data usage would be very much appreciated."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Joan",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T14:49:14.000Z",
          "Titre": "February 23rd",
          "Contenu": "February 23rd, after purchasing a month of Maya Mobile I found it difficult to start it up. I tried following the directions and eventually had to go to a more experienced fried. Once I had it going it worked and I found it very useful"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Julian",
          "Nb_Reviews": 3,
          "Date": "2023-05-20T20:56:58.000Z",
          "Titre": "Super cheap and effective",
          "Contenu": "The service is super cheap and works amazing. Installing it is a bit painful, especially if you don’t have a computer, printer or second device. If it had an app it would be perfect."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Laura J",
          "Nb_Reviews": 2,
          "Date": "2023-05-09T17:59:49.000Z",
          "Titre": "The activation process was slightly…",
          "Contenu": "The activation process was slightly more complicated than expected and the reception wasn’t always there. But I guess that’s not their fault. So overall would recommend it :)"
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Ricardo",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T00:02:52.000Z",
          "Titre": "The e-sim card in Brasil worked well",
          "Contenu": "The e-sim card in Brasil worked well, but the one in Argentina had a signal break which left me wondering"
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "Dub_Ta",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T16:51:41.000Z",
          "Titre": "Great for travelers👌",
          "Contenu": "Fast, easy, just Works, more than one eSim possible, Great service Could be a bit cheaper"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Neil Wolfenden",
          "Nb_Reviews": 7,
          "Date": "2023-08-25T22:36:58.000Z",
          "Titre": "Has worked really well in Europe for me…",
          "Contenu": "Has worked really well in Europe for me over the last few months in my travels no problem I didn’t use as much data as I thought I would"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Santiago",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T08:56:05.000Z",
          "Titre": "Great and convenient service",
          "Contenu": "I really like using Maya Mobile for my trips. Its a good service and convenient.The only thing missing are Apple Pay support and a mobile app, that is why 5 stars yet!"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Martha",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T12:22:54.000Z",
          "Titre": "Maya Mobile was very helpful whilst…",
          "Contenu": "Maya Mobile was very helpful whilst abroad, but we did not always have a good signal that resulted in slow internet."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Alexander Coltman",
          "Nb_Reviews": 3,
          "Date": "2023-03-10T00:51:06.000Z",
          "Titre": "Super handy to be able to sort data in…",
          "Contenu": "Super handy to be able to sort data in a foreign country without having to visit a local phone shop and go through all the hassle of getting registered etc."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Raissa",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T13:03:36.000Z",
          "Titre": "Super easy internet acess",
          "Contenu": "Super easy internet acess. Would be great if there were an app to manage/check the amount of data used/buy more credits."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Manuel",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T18:32:34.000Z",
          "Titre": "I wasn’t very convinced at once but…",
          "Contenu": "I wasn’t very convinced at once but when I arrived to Guatemala it worked. I had data available in many parts of the country, even in Tikal pyramid."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T12:21:31.000Z",
          "Titre": "Maya Mobile helped alot whilst abroad",
          "Contenu": "Maya Mobile helped alot whilst abroad, the only problem we experienced wass that we did ot always had a good signal, which resulted in slow internet."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Homa",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T17:45:49.000Z",
          "Titre": "Needed an internet while traveling and…",
          "Contenu": "Needed an internet while traveling and Maya provided that with esim purchased online for a fair price and just worked perfectly."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Hagit",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T15:10:58.000Z",
          "Titre": "It was easy to make the swich",
          "Contenu": "It was easy to make the swutch, I hope I did it well. I THINK THE MOBILE INFRUSTACTION IN SANTORINI ARE SO SO BUT YOUR ESIM MADE IT MOST OF THE TIME"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Sam",
          "Nb_Reviews": 13,
          "Date": "2023-05-28T13:43:25.000Z",
          "Titre": "It just worked.",
          "Contenu": "It just worked for a one-off to get me out of trouble in Europe. Rates would need to be more competitive so as to use more frequently when travelling."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Shomel",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T21:36:42.000Z",
          "Titre": "The sim works efficiently and easily",
          "Contenu": "The sim works efficiently and easily. Unfortunately, sometimes does not connect to the fastest networks and it does not receive a connection in Monaco. Otherwise it is a smooth, cost-efficient service."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Markus L.",
          "Nb_Reviews": 3,
          "Date": "2023-10-09T23:51:26.000Z",
          "Titre": "Disney plus was Not working due to VPN…",
          "Contenu": "Disney plus was Not working due to VPN restrictions.Installation, Price was good and Connection was Always available ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barb",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T13:49:09.000Z",
          "Titre": "Service was pretty easy to set up…",
          "Contenu": "Service was pretty easy to set up although texts went thru email and I didn’t know how to fix that - otherwise great"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "mevr. LJ  Moree",
          "Nb_Reviews": 2,
          "Date": "2023-06-25T08:38:50.000Z",
          "Titre": "It was great to have access to mobile…",
          "Contenu": "It was great to have access to mobile data in Turkey. The connection was great. I only had the feeling that it didn't work the best in crowded area's. But when I stepped to a side of that area it worked perfectly again."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T08:32:29.000Z",
          "Titre": "Great eSIM service",
          "Contenu": "Great eSIM service - easy to prebook and works as promised with requested starting date. More expensive than physical SIM, but was fine for me as I needed immediate access when landing in country."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tati",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T16:14:24.000Z",
          "Titre": "Everthing was very easy",
          "Contenu": "Everthing was very easy and it worked directly. Sometimes the internet reception is not so good. Overall I would recommend it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alan",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T19:58:55.000Z",
          "Titre": "eSim is great except for occasions when…",
          "Contenu": "eSim is great except for occasions when it disconnects and have to re-enter access point name and restart my phone"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Eric R",
          "Nb_Reviews": 21,
          "Date": "2023-11-03T07:22:34.000Z",
          "Titre": "Easy to buy and install with e-sim",
          "Contenu": "Easy to buy and install with e-sim. Connection is most off the time ok."
        },
        {
          "Note": 4,
          "Lieu": "MA",
          "Pseudo": "Ahmed",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T09:51:35.000Z",
          "Titre": "Good price to use for calls for all Europe",
          "Contenu": "Sometimes the network was not good to visit the websites"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Stefan",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:59:24.000Z",
          "Titre": "The best eSIM",
          "Contenu": "The best eSIM. Works perfect for Germany, Switzerland and Austria! I am getting strong connection on any carrier in the country. Granted , your result may be different in a different city. But I am traveling often by train and Maya always works the best for me. Thank you guys."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "air bonine",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:48:59.000Z",
          "Titre": "This is my second time using Maya…",
          "Contenu": "This is my second time using Maya Mobile's eSIM. The installation process and worked just fine! I had an issue with installing the second eSIM since I lost the phone that I originally installed the eSIM for. I was worried at first that the only way to reach customer service was through email. However, I got a response within 10 mins or so and the issue was resolved in less than an hour. Very impressed with their customer service!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Fabia Werder",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:30:43.000Z",
          "Titre": "Quick and good support",
          "Contenu": "Everything worked good from the beginning, after reactivation for another month of data something did not syncing, so i needed support. I really appreciated how quick, supportive and friendly they replied. Thank you, everything works perfect now."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Carol",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T02:22:22.000Z",
          "Titre": "Awesome service",
          "Contenu": "Awesome service! Very easy to buy and set up. I had it going in just a few minutes, and then forgot about it for the rest of my trip. The coverage worked perfectly everywhere I visited in the UK. Once I got home, I switched back to my regular SIM seamlessly, just a toggle in the settings. Keeping it installed for next time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T05:16:19.000Z",
          "Titre": "eSIM: Easy to Purchase & Activate, Just What I Needed",
          "Contenu": "The eSIM was easy to purchase and activate. There are a variety of data packages available and the price is competitive. Adding an eSIM without having to leave the house was a nice convenience and used this to bridge the gap between my regular service and getting a physical SIM with better data rates."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Lilly",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T01:26:03.000Z",
          "Titre": "Fast&safe way to get mobile data in foreign country!",
          "Contenu": "Worked super fast and reliably in the USA and Nicaragua. You get only data and no calls/SMS with a Maya eSIM but that was enough for pretty much everything as you can call people through Whats App. In the USA it was a good price in comparison to prepaid SIMs from local network providers like AT&T or T-Mobile (which would include calls&messages though). In Nicaragua it would have been cheaper to get a local SIM card. But the fact that you can buy, download the Maya eSIM and set up everything in 5 min while being in the airport wifi is a BIG comfort and advantage which is the reason I'm giving 5 stars. Plus, they are transparent and tell you right away that the service is NOT a subscription. No scam or hidden payments. Yey! Good job, Maya!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Daniele",
          "Nb_Reviews": 12,
          "Date": "2023-12-19T15:28:21.000Z",
          "Titre": "No Netflix service, then all fixed!",
          "Contenu": "Connection works fine, but I paid unlimited data to watch netflix, and I just discovered that the website is completely blocked. It should have been mentioned.Edited:After 4 days, internet access went completely down and my unlimited plan changed state to \"no data available\" and I had to recharge it!!I've contacted the support and quickly restored it and now even netflix is available!I'm not sure what happened (they thought I was in France), but in the end great and quick support.There might be always issues with the technology, but I think you can trust a service based on their support team.For this reason I change my review to 5 stars."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Alejandro Anibal Abud",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T09:33:34.000Z",
          "Titre": "My great experience was too much…",
          "Contenu": "My great experience was too much successful. I recommended to my friends your services when they need to travel everywhere!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Juan Carlos",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T07:15:09.000Z",
          "Titre": "Clear instructions!",
          "Contenu": "I like how easy it was to get it started. The navigation and icons are clear and very helpful for someone who can get overwhelmed with instructions. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "MT",
          "Pseudo": "Umer Hameed",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T15:13:42.000Z",
          "Titre": "Best travel purchase ever!!",
          "Contenu": "Best travel purchase ever!!! No connectivity issues at all. Travelled to Malta and tried their e-sim, worked like a charm throughout the trip and their setup procedure is very easy too."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Lauren",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:31:08.000Z",
          "Titre": "Travelling in simplicity",
          "Contenu": "This is probably the best way to have e-sims when travelling ! Simple to add , no network problem when you arrive ! Only issue is there isn’t a number so can’t make call but again don’t really need to make call when im away!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "GIOVANNA",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T19:40:35.000Z",
          "Titre": "Hello,",
          "Contenu": "Hello,I really appreciated this app which was very useful to me during my trip to Turkey.your service is certainly better than Airalo as long as I tried to install the Airalo E sim once but without success, because the instructions were more complicated.Thank you so much for everything, you have been a lifesaver. excellent service and instructions much easier than Airalo, airalo is a a bad app but yours is much better!!! I will recommend it to everyone!!! continue like this!!!Thank you so much!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Corinne",
          "Nb_Reviews": 58,
          "Date": "2023-12-09T11:44:22.000Z",
          "Titre": "My first time using an esim",
          "Contenu": "Sooo easy to set up connect. It was my first time using an esim and I didn’t even know if I was going to be able to set it up or make it work by myself. But it was the easiest thing to do with clear step by step guide I had the new esim up and running in minutes. My usual network dosent allow me to use my current package abroad without massive charges but by setting up this esim I was able to use my phone and WA on my holiday in France. Very happy indeed and whole heartedly recommend Maya Mobile esim."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Daniel",
          "Nb_Reviews": 16,
          "Date": "2023-12-10T12:10:10.000Z",
          "Titre": "Great alternative to mainstream telecom…",
          "Contenu": "Great alternative to mainstream telecom providers. Now U.K. operators are charging daily for data use in EU countries (thanks EE), I went with the eSim option with Maya. The process was super easy and I was up and running within 10 minutes!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cliff",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T12:26:10.000Z",
          "Titre": "Fast delivery and truly works well",
          "Contenu": "Our family travels internationally very often. It is extremely helpful to be able to have a working data plan overseas that delivers maximum speed and throughput. Maya mobile has worked flawlessly every time."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Doug",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:34:03.000Z",
          "Titre": "Easy install",
          "Contenu": "Easy install. Works perfect. Great connection in the USA. Would buy again"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Rhonda Nunan",
          "Nb_Reviews": 12,
          "Date": "2023-12-11T19:09:01.000Z",
          "Titre": "So easy to sign up.i am a teco phobic…",
          "Contenu": "So easy to sign up.i am a teco phobic but I did it easy instructions I've already recommended to my son who has used it and my friend in the US.  Great price too.  For some reason. I couldn't get normal calls using my other sim.  But I think that was to do with turkey not being included in the 71 destinations Three cover."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "David H",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T17:04:58.000Z",
          "Titre": "First time using an e-sim data plan",
          "Contenu": "I am just back from travels and first time using an e-sim data plan. Maya was easy to setup and use, very reasonably priced and efficient for all data needs. I will be pleased to use Maya for all my future international travel, and recommend it to friends and family. Well done, a really great service!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Maja",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:37:48.000Z",
          "Titre": "Overall great experience for a good…",
          "Contenu": "Overall great experience for a good price. Will choose it again when needed."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Adriano",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T10:30:21.000Z",
          "Titre": "Great experience!!",
          "Contenu": "Great experience!!I`ve use maya Mobile in Cina and work very well!All European and american applications works without problems!!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "dave hart",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T23:19:25.000Z",
          "Titre": "Sceptical at first but now I will forever use Maya for travel",
          "Contenu": "I was really sceptical of getting an esim, especially when it wasn’t from a high street store. I don’t know why I was so worried though. It was dead simple to set up and has been a life saver. I will now always be using Maya for travel"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T16:36:39.000Z",
          "Titre": "Nothing to complain",
          "Contenu": "Easy to install, mostly good connection. Nothing to complain."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Diamond",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T01:02:55.000Z",
          "Titre": "Save a lot of money when traveling!",
          "Contenu": "This was so very easy to setup on my iPhone 12.  I have Consumers Cellular, which I love - but it can be very expensive when traveling.  With Maya, I had it working in five minutes with enough data in the plan for more than ten days!   For $20, this saved me hundreds of dollars on my cell plan."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Uwe Schmitz",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T17:35:04.000Z",
          "Titre": "Top Internet Connection in Brasil",
          "Contenu": "Top Internet Connection in Brasil. Will buy Maya e Sims For all our holidays in future"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Jiila",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T11:00:05.000Z",
          "Titre": "Very easy to use",
          "Contenu": "Very easy to use. Way easier then trying to find a good place that sells esims and doesn't rip you off. Made my travels less stressful knowing I could have data anywhere I go. It's fast and reliable. Also way cheaper then buying a prepaid card in store. I'll use it wherever I travel from now on."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "YEL",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T08:46:57.000Z",
          "Titre": "Very convenient for short trips in…",
          "Contenu": "Very convenient for short trips in countries where you don’t want to have an actual service. Maya eSIM service a good option. I used it in the UK."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Remi Hammerstein",
          "Nb_Reviews": 5,
          "Date": "2023-12-18T18:02:06.000Z",
          "Titre": "10 out of 10",
          "Contenu": "Super easy to activate, working like a charm, and unbeatable prices"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Philipp",
          "Nb_Reviews": 4,
          "Date": "2023-12-12T21:35:14.000Z",
          "Titre": "Great help for our journey to South Africa",
          "Contenu": "Easy order process, easy installation, always „on“ from the first minute in South Africa. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David Watson",
          "Nb_Reviews": 5,
          "Date": "2023-11-29T06:30:17.000Z",
          "Titre": "As a foreign traveler having a local…",
          "Contenu": "As a foreign traveler having a local sim for your phone has become vital. The eSIM is the latest tool to be made available. Buying a Maya eSIM was a simple process and worked instantly. Recommended"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Ricardo",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T19:34:59.000Z",
          "Titre": "Ease of use",
          "Contenu": "Ease of use, activation & signal quality was top notch for our visit in Spain from South Africa!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Marieke Goossens",
          "Nb_Reviews": 3,
          "Date": "2023-12-09T02:19:00.000Z",
          "Titre": "Easy and good working",
          "Contenu": "Very easy to bye and instal. Had it for my travels in New Zealand and the covering was good for most of the country. Better than some who bought a simcard."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Levi",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T06:15:43.000Z",
          "Titre": "Excellent quality.",
          "Contenu": "Easy setup, fast speed. This was my 4th esim in Taiwan and the best. Still some blank spots especially near TSMC in Tainan but overall far better then every other provider I could try.Price for data was reasonable if not cheap. I'll be trying this in other countries and let's see if they hold up!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Arran",
          "Nb_Reviews": 5,
          "Date": "2023-11-23T16:50:23.000Z",
          "Titre": "Highly recommend!!",
          "Contenu": "Currently travelling Asia and it’s perfect to use, had no issues at all. Instructions on how to set up were clear and easy to follow. Would highly recommend and have already passed Maya Mobile on to travellers whom I have met along the way."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Kazuhito",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T00:14:11.000Z",
          "Titre": "excellent",
          "Contenu": "in the business trip at munich and london , esim went well continuously. thank you so much"
        },
        {
          "Note": 5,
          "Lieu": "GE",
          "Pseudo": "Federico Schober",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T10:42:56.000Z",
          "Titre": "Works everytime, im super happy",
          "Contenu": "I have used maya 3 times in Georgia, 1 time in argentina, and never had an issue. If you already have an account, the top up of existing esim or buying a new one is super easy. TOday i tried another company because maya web was down, and my experience was super bad. Came back to maya, bought a new esim, and im good to go. Never dissappoints. Maybe the plans are a little bit less appealing on how much data you get, but its a 10/10 service.Order id: R07KIQQVMSB9"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T05:37:20.000Z",
          "Titre": "Best eSIM to travel around Europe",
          "Contenu": "I’ve been all around Europe and this eSim has worked perfectly and I’ve been connected everywhere without a problem and not to mention that the prices are great for the amount of gigabytes you get. It’s amazing!"
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "L.",
          "Nb_Reviews": 89,
          "Date": "2023-11-26T13:07:15.000Z",
          "Titre": "One very happy customer",
          "Contenu": "Got a new phone because it had esim possibility, which I wanted to test in my home country before taking a longer trip. The first provider I tried sent an esim that was already taken(!), then they sent a new one that worked but couldn't get any internet (in a city where there is plenty). Then they sent me all kinds of tricks to make it work and I used 3 hours trying to do it, unsuccessfully. They gave me a full refund, which was good, but I was left wondering if I had bought a new phone for nothing, if esim was more trouble than it's worth.So I set aside a day when I had plenty of time and bought a card from Maya, expecting the worst. It took about 5 or 10 minutes from payment to getting online, and I am one very happy customer."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Rob",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T09:44:46.000Z",
          "Titre": "I’d wish i learned about this option…",
          "Contenu": "I’d wish i learned about this option sooner.  On vacation in South Africa my wife using Android as myself with apple we both enjoy full internet with Maya’s esim packages.It all works flawless"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gavin Smith",
          "Nb_Reviews": 12,
          "Date": "2023-11-28T20:34:45.000Z",
          "Titre": "Perfect for Turkey",
          "Contenu": "For a recent trip from the UK to Turkey I wanted data, so as not to rely on the hotel wifi. In advance of the trip I ordered an esim, and set this up according to the instructions. On landing at Antalya Airport I turned my phone on, but i didnt get any network signal. Thinking it was a settings issues i accessed the sim manager to check, only to find my phone (Samsung S21) froze, several reboots later and the phone failed to respond to attempts to access sim manager. I left my phone whilst we left the airport to hunt down our transfer to the southern outskirts of Side / Manvagat. About 15mins into the journey i noticed my phone had gained a signal for the e-sim. After which I enjoyed the next 10 days  of network data. I've scored Maya 5* as it may have been my own impatience that caused the issue rather than the network as after I got connected I had no further issues. I even got a message when my data was 50% used which was handy too. Ordering and Setting up the initial esim was easy to do, with Maya offering the best value esim."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Clif",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T16:50:03.000Z",
          "Titre": "Product worked as planned",
          "Contenu": "Product worked as planned. Wish the directions for enabling were better for Android. It seems the instructions were meant towards people who had used an esim previously."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Anna",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T02:22:39.000Z",
          "Titre": "all worked perfect (e-sim in thailand)",
          "Contenu": "all worked perfect (e-sim in thailand), most of the time i had 5G, and connection worked everywhere (also on all the islands like koh samui, koh phangan, koh yao noi). also recharging went super easy and worked within a few minutes. only tricky thing: to activate your e-simyou have to scan the QR code on your phone. so make sure you do this at home with your computer or have someone with you who has a phone where you can scan the code. highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Hussain",
          "Nb_Reviews": 5,
          "Date": "2023-12-21T23:18:45.000Z",
          "Titre": "Great esim",
          "Contenu": "Great network. Easy to set up. Decent rates."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T23:14:09.000Z",
          "Titre": "It works, no problem",
          "Contenu": "I love eSIMs for travel. I can order them in advance of my trip online and be connected as soon as I land. With this company there are selections of data plans and countries at relatively cheap prices. I’ve used them twice and had connectivity as soon as I arrived."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "david",
          "Nb_Reviews": 24,
          "Date": "2023-11-20T02:58:54.000Z",
          "Titre": "Reasonable price",
          "Contenu": "Reasonable price. Bought aesim for use in Armenia , 1GB 5 day use for £5.  Appreciation goes to Customer Care Team who kindly refunded an automatic data increase payment.  For this, I give 5 star service."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Meri",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T00:22:46.000Z",
          "Titre": "It is super easy to activate esim",
          "Contenu": "It is super easy to activate esim, no complicated procedures and  a risk to lose a e card"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Martha",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T02:54:30.000Z",
          "Titre": "Glad I found Maya eSim!",
          "Contenu": "It was easy to set up account and install eSim for Thailand. The only problem I had was making calls but other than that I could get on social media, use Google and Google maps with ease. I did start with the 5 day plan with 3gb but used most of it the same day. It was only $7 USD. So I did add 10GB for another $14 USD that was automatically activated with purchase. I like that I don't have to go looking for a sim card from now on whenever I travel."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Erich",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T15:08:36.000Z",
          "Titre": "Easy to purchase and activate.",
          "Contenu": "Easy to purchase and activate.Good connection during my stay in Cardiff/Wales."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Ella Pepito",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T20:59:01.000Z",
          "Titre": "Asia Tour",
          "Contenu": "I was travelling to Singapore, Indonesia, and Philippines and the connectivity was seamless! Easy to set up and no need for multiple sims. I highly recommend for travelling."
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "Hicham",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:03:56.000Z",
          "Titre": "Great experience.",
          "Contenu": "Great experience.. perfect network coverage, despite passing through several cities in 2 different countries...I highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Germano A.",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T21:11:53.000Z",
          "Titre": "I have used the esim for me and my wife",
          "Contenu": "I have used the esim for me and my wife.Everthing was smooth and faster.We were in Brasile, State of bahia.We also gotten 5G Connection.For sure next my vacation I will buy it."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Aniq Niazi",
          "Nb_Reviews": 5,
          "Date": "2023-11-13T22:47:31.000Z",
          "Titre": "Travelled to Qatar for a week and tried…",
          "Contenu": "Travelled to Qatar for a week and tried an esim for the first time. The instructions were clear and everything activated and worked perfectly on arrival. Really happy with the purchase and will certainly be doing it again for future visits overseas."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Justin James",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T13:10:39.000Z",
          "Titre": "Works perfectly great signal",
          "Contenu": "Works perfectly great signal, we went to 4 countries in Asia works very well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jorge",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T18:08:35.000Z",
          "Titre": "Easy connection everywhere i traveled…",
          "Contenu": "Easy connection everywhere i traveled [Portugal, Italy, Spain]. Great price. Used it on both an iPhone 13 and Samsung S20.I highly recommend Maya."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Fernando Castellani",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:43:16.000Z",
          "Titre": "It’s amazing",
          "Contenu": "It’s amazing ! It’s working very well !"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Ricard",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T14:37:07.000Z",
          "Titre": "everything worked as expected"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Jakub",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T11:58:57.000Z",
          "Titre": "The best option for eSIM.",
          "Contenu": "Using Maya Mobile during my last trip to UK was a huge convinience! I'm contented that there was a rapid possibility to buy eSIM and get it ASAP. I can recommend that website to buy eSIMs during your visits abroad! Price are affordable and service is intuitive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "OLUCHI",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T17:53:46.000Z",
          "Titre": "Very reliable, very fast! Simply Amazing",
          "Contenu": "This service is fantastic. I even bought it for my friends. The service is seamless and really fast. Worked in the three European countries I visited and the UK. The service was always up and fast. I had a stopover in Turkey so I got the Turkey one as well. I would recommend highly to anyone."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Manuel",
          "Nb_Reviews": 6,
          "Date": "2023-11-14T08:24:57.000Z",
          "Titre": "Exactly what I needed, an eSIM with good signal",
          "Contenu": "They provide what they offered, I paid for the data and I received it instantly by email. You then have to add the eSIM to your phone that follow the instructions that they provide.The signal was really good all over Cape Town even receiving 5G. Really recommended, if I go back , I would choose same provider."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Liza",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T11:36:27.000Z",
          "Titre": "internet is great",
          "Contenu": "internet is great, but it has problem with buying a service. My friends tried to buy  same way I did, but they could not.  it says to contact customer service."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Sonia",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T08:30:59.000Z",
          "Titre": "Very convenient",
          "Contenu": "Very convenient. Easy to use"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Admir",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T13:57:42.000Z",
          "Titre": "Finally an eSIM with stable connection",
          "Contenu": "So easy to use, instal and the network does not get cut as it’s usually the case w eSIM. So pleased with this purchase. Well done team!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "amira p Melbourne",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T11:42:07.000Z",
          "Titre": "Easy and good experience",
          "Contenu": "Easy to sign up to, good connection while in france, easy to end when we left for home"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Silvia Di Carlo",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T06:14:20.000Z",
          "Titre": "Got on the internet in the less than 5…",
          "Contenu": "Got on the internet in the less than 5 mins!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Hon Liep",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T13:18:11.000Z",
          "Titre": "Stable 5g and well coverage over…",
          "Contenu": "Stable 5g and well coverage over Switzerland."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Gary",
          "Nb_Reviews": 5,
          "Date": "2023-12-04T02:07:51.000Z",
          "Titre": "Used Maya mobile while in London.",
          "Contenu": "Used Maya mobile while in London.It was a good deal and loads of data , will definitely be using this again"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Norbert",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T21:20:12.000Z",
          "Titre": "The signal and quality was really…",
          "Contenu": "The signal and quality was really great, I will defenitly use it in future too!"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Armando",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T21:24:27.000Z",
          "Titre": "Service work perfect",
          "Contenu": "Service work perfect, internet speed is very good and stable always..."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Patrik",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T00:11:22.000Z",
          "Titre": "All good",
          "Contenu": "Easy to install, working perfectly."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Joris",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T12:27:53.000Z",
          "Titre": "Super smooth service",
          "Contenu": "Super smooth service. Easy to use. Everything went very well. Would recommend and will use this service 100% more often"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T09:46:03.000Z",
          "Titre": "Easy to use no problem works as…",
          "Contenu": "Easy to use no problem works as advertised"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Hubertus",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T11:26:49.000Z",
          "Titre": "Flawless",
          "Contenu": "Flawless. Booked my Maya eSIM from abroad, and did the few activation steps. Upon landing at my destination, I switched on my phone still on the plane and was connected immediately. Recommended."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Alireza Behtash",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T09:55:45.000Z",
          "Titre": "Fast and reliable",
          "Contenu": "Very fast and reliable internet in Turkey. It was also super easy to install."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Axel",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:49:21.000Z",
          "Titre": "Easy and good",
          "Contenu": "Fast buy and Installation from esim"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Paola Sanchez",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T09:47:35.000Z",
          "Titre": "good coverage",
          "Contenu": "Overall good coverage, works fast and is reliable"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Reinhold",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T06:58:38.000Z",
          "Titre": "Gets the job done right!",
          "Contenu": "Simple and easy to use. A lot of good offers when comparing to other providers.A variety of countries to choose from."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Niels Van Willigen",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T09:55:17.000Z",
          "Titre": "Easy to install & great trouble shoot…",
          "Contenu": "Easy to install & great trouble shoot guide to help with questions"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jotty",
          "Nb_Reviews": 8,
          "Date": "2023-12-09T11:02:15.000Z",
          "Titre": "Great AAP",
          "Contenu": "Great AAP. Stress free to use and so simple to set up. No need to change your number. I like things which are easy to do and so impressed with the service."
        },
        {
          "Note": 5,
          "Lieu": "SI",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T16:19:53.000Z",
          "Titre": "Works great overall",
          "Contenu": "Works great overall, albeit a little unreliable when in bigger crowds."
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "G.W",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T20:31:02.000Z",
          "Titre": "Great rates for e-sim",
          "Contenu": "Great rates for e-sim. Easy setup. Online dashboard with usage info and notifications on usage are also great. Will use again"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 7,
          "Date": "2023-11-18T10:52:04.000Z",
          "Titre": "Maya - Istanbul Trip",
          "Contenu": "It was really easy to use the Email and the connection was really good throughout my whole trip. Would recommend it if visiting Turkey."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Hugo",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T19:36:10.000Z",
          "Titre": "easy to use",
          "Contenu": "easy to use! I used Maya mobile for 2 different countries . and worked really well!"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Celine",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T11:48:56.000Z",
          "Titre": "Travelled to Cape Town and Kruger Park…",
          "Contenu": "Travelled to Cape Town and Kruger Park in South Africa for 2 weeks and had no issues. Recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T23:05:57.000Z",
          "Titre": "Worked well",
          "Contenu": "Worked well. Website instructions helped me get the “roaming” setting right on the eSIM."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Martynn",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T16:41:48.000Z",
          "Titre": "Convenient and fast service",
          "Contenu": "I love how easy it is to get the e-sim, no more fussing around having to change the physical sim.  And also very easy to see how much data you have left."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Leonardo",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T17:08:16.000Z",
          "Titre": "Maya has worked very good on a cruise…",
          "Contenu": "Maya has worked very good on a cruise ship from Italy along the coast to end in Turkey.I chose a stateroom on the port side of the ship, facing inland.Only when I could not see land did Maya not provide 5G."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Deb Caulet",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T16:16:57.000Z",
          "Titre": "Quick and friendly support!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "S Campbell",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T08:33:20.000Z",
          "Titre": "Worked really well for me",
          "Contenu": "Worked really well for me. Excellent"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Daniel Lechner",
          "Nb_Reviews": 4,
          "Date": "2023-12-11T14:53:43.000Z",
          "Titre": "Great",
          "Contenu": "Very easy and quick insulation.I’d buy it again every time."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Angel",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T13:03:39.000Z",
          "Titre": "Great experience with the service",
          "Contenu": "Great experience with the service, every place that I were, I had cellular data!I was in 5 countries"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Flavia",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T22:52:28.000Z",
          "Titre": "I'm using it in Germany",
          "Contenu": "I'm using it in Germany, so far in Frankfurt and Berlin, working without any complications."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carolyn",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T15:15:52.000Z",
          "Titre": "Very easy to use and provides…",
          "Contenu": "Very easy to use and provides consistent coverage no matter where you are."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "F S",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T00:52:23.000Z",
          "Titre": "Simply great",
          "Contenu": "Simply great ! No issues at all with connectivity. And the best part sharing through hotspot 👍"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Peter Spychala",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T19:00:03.000Z",
          "Titre": "I used Maya in Malaysia and China",
          "Contenu": "I used Maya in Malaysia and China. Good speed and coverage. No issues with service. Definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T11:39:23.000Z",
          "Titre": "Simple to setup",
          "Contenu": "Simple to setup. Great coverage."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Pascal",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T19:59:26.000Z",
          "Titre": "A satisfied with the quality of…",
          "Contenu": "A satisfied with the quality of service. Internet connexion is good!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "dclaici",
          "Nb_Reviews": 17,
          "Date": "2023-12-12T16:48:28.000Z",
          "Titre": "Easy to install and easy to use",
          "Contenu": "Easy to install and easy to useReliable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T16:13:33.000Z",
          "Titre": "Easy to purchase",
          "Contenu": "Easy to purchase, easy to setup and easy to use.   Was informed via email of usage and had no issues with coverage"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Ian",
          "Nb_Reviews": 7,
          "Date": "2023-12-11T08:14:02.000Z",
          "Titre": "Excellent connectivity",
          "Contenu": "Seamless easy connection. Great value."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Th.P. , Berlin",
          "Nb_Reviews": 5,
          "Date": "2023-11-18T21:27:32.000Z",
          "Titre": "Easy and inexpensive",
          "Contenu": "It was easy to get the eSim, easy the configuration and scheduling and last but not least it was inexpensive- it was worth the money."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Kornelia Kvas",
          "Nb_Reviews": 4,
          "Date": "2023-11-25T17:18:25.000Z",
          "Titre": "Maya is quick and reliable",
          "Contenu": "Maya is quick, reliable. And I can use it in many countries, which is important to me."
        }
      ]
    }
  ]
}