{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "microvisorhood.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Phillip Mitchell",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T18:58:45.000Z",
          "Titre": "I installed the hood about two months…",
          "Contenu": "I installed the hood about two months ago and have used it a few times since then. The hood seems to help, but not as much as I had hoped. For me, sticking out another inch or two would have helped. And the back is just held on with magnets, which are too small in my mind. But the biggest issue is that last night when using it, the hood almost fell off. Two of the three screws holding the hood to the microwave came out; they were not under tightened they just came loose from the microwave as if they were the wrong size. So now I have an expensive door stop."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Annoymous",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T17:50:41.000Z",
          "Titre": "Would never recommend this company to…",
          "Contenu": "Would never recommend this company to you. They ship you saying all charges included but to you surprise at delivery you are forced to pay extra 30-40$ in customs. International customers beware this fraud seller does not pay customs although he says he charges a flat fee with import fee included. To top it all my credit card was fraudulently charged for 4k$ after i shopped at his site he either saves and uses your card for fraud or his website is compromisrd"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard L Miller",
          "Nb_Reviews": 3,
          "Date": "2022-12-14T16:12:27.000Z",
          "Titre": "This product does not work for us",
          "Contenu": "The product does not work for us.  We have been trying to return the item without success.  The address provided is confirmed by the NJ BBB as fraudulent and the merchant has been less than honest in providing us valid return address and there is no indication that we will receive a refund.  We have notified our Bank and they intend to challenge the merchant on his dishonest business practices."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "rjs",
          "Nb_Reviews": 3,
          "Date": "2023-02-22T21:05:39.000Z",
          "Titre": "Additional adaptor may be required and returns are costly",
          "Contenu": "Product required an additional $25 adapter that would make the visor look too low. Returning the visor is not easy and not customer-friendly. The customer must pay the return shipping and a restocking fee of $35 if there are any scratches on the product and must use the original packaging.You are definitely not Amazon, and if only two units need adapters, then you shouldn’t have problem providing the adapter for free upon request, or giving a full refund for those few unfortunate people who own non-conforming microwaves."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "rjs",
          "Nb_Reviews": 3,
          "Date": "2023-02-18T00:58:40.000Z",
          "Titre": "Very expensive piece of metal that you better not have to return",
          "Contenu": "The product required a spacer for my microwave which would have cost another $25 and would have put the hood an inch lower than the microwave. The product describes itself as a filter, but is simply a hood, and a very expensive piece of metal. The return policy is very limited. You have to pay to ship it back and pay an $18 or $35 \"restocking\" fee. I inserted the hood once which produced scratches where the hood contacts the insertion clips. These scratches could make the product non-returnable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ALEXA GARRETT",
          "Nb_Reviews": 2,
          "Date": "2023-01-29T05:15:33.000Z",
          "Titre": "Screen comes out too far",
          "Contenu": "The product I'd made well, but not what I expected.  It comes out too far and I can't see the controls on my stove without bending down. I am trying to return it, but I have about 20 times to start the return using the email instructions and it keeps sending me errors not accepted. I read other reviews and everyone has a hard time returning, no refunds.  I guess they don't back their product. I hope to get help soon. I can't afford to waste $150, who can."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Holland",
          "Nb_Reviews": 3,
          "Date": "2023-01-05T11:37:30.000Z",
          "Titre": "lousy order service",
          "Contenu": "You were supposed to send me a black hood the most expensive because the cheaper ones were not available. You sent me stainless, you are lucky your customers are 1 timers or you would be out of business??"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Austin",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T21:34:09.000Z",
          "Titre": "It’s fine while water is heating",
          "Contenu": "It’s fine while water is heating.  However it can’t keep up with the steam volume of both front burners going at the same time, the steam just billows out the side."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Freiburger",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T21:47:51.000Z",
          "Titre": "this did not solve the problem with steam saturating my cupboards. I returned product & am being charged a restocking fee of $18 never say any indication of restocking fee. I am not a happy camper.",
          "Contenu": "product did not solve the problem, steam saturating my cabinets. I am returning product owe and $18 restocking fee that I was not aware of. I am not a Happy camper."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ken Andreini",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T16:32:33.000Z",
          "Titre": "Beware of the Microvisor return policy!",
          "Contenu": "Beware of the Microvisor return policy, as it does not allow you to test the product and return it. I recently purchased the product and tested it on my new LG microwave. I was very dissatisfied with it, as it only captured a minimal amount of steam from the front burners of my induction range (maybe a 10% improvement). When I called Microvisor to inquire about a return, I spoke to a man named George who informed me that they will not refund me, as the product was used. After arguing with him for a few minutes and listening to him attempt to belittle me, he finally agreed to accept the return and refund me (minus the $18 restocking fee)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Escoto",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T19:41:03.000Z",
          "Titre": "Received a dented visor",
          "Contenu": "Received a dented visor.  Contacted customer service and hood visor. com and never received a reply regarding dented product received.Never will I buy from them again and buyer beware."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Don LLOYD",
          "Nb_Reviews": 3,
          "Date": "2022-12-28T00:04:09.000Z",
          "Titre": "Finally got ahold of I suspect the…",
          "Contenu": "Finally got ahold of, I suspect the owner (I can't believe it would be an employee that rude), told him that I wanted to return the hood and explained why that the hood was getting in the way of cooking and being able to safely use. He said to use the thumbscrew and remove it while cookin ony takes 30 seconds. Really I bought this to take off when cooking? The company does not tell you that if the microwave is not flush with the bottom of the cabinets, it sets to low to safety use. Brother this guy started his BS by saying everyone's home is different, really why would you not say that in your ad. When I told him I would like to return the microvisior for a refund he stated that to read the return policy and there would be an $18.00 restock fee. He also said that if it was used it was like returning tennis shoes that had been worn. Wow this company is not honest, once they get your money it's all over. BE SURE TO READ THE RETURN OPTION BE FORE BUYING!! AND BUYERS BEWARE IF YOUR MICORWAVE SITS BELOW THE CABINETS IT WILL NOT FUNCTION PROPERLY. Of course you could do as he told me and remove it when cooking. I will never buy from this guy again. Also the customer service email does not work. I called several time before I got that idiot on the phone. I also want to apologize for giving a 1 star review."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Diane Hutcheson",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T16:47:03.000Z",
          "Titre": "I was excited to get the hood but once…",
          "Contenu": "I was excited to get the hood but once we installed it, it blocked my view of the back burners and I had to bend over to reach the pots."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Don LLOYD",
          "Nb_Reviews": 3,
          "Date": "2022-12-19T00:07:49.000Z",
          "Titre": "The company needs to let people know…",
          "Contenu": "The company needs to let people know that if the bottom the microwave  is below the cabinets the hood covers the back burners line of sight and also gets in the way in front when stirring on the front burners."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Walter Duniven",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T23:40:26.000Z",
          "Titre": "We returned the product for a refund…",
          "Contenu": "We returned the product for a refund and haven’t heard a response. The hood is not usable with our kitchen."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary Nollkamper",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T04:01:32.000Z",
          "Titre": "Wanted to return item unused but never…",
          "Contenu": "Wanted to return item unused but never got a return e-mail."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Kloepping",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T15:17:34.000Z",
          "Titre": "Your return policy sucks",
          "Contenu": "Your return policy sucks. \"George\" at your company is rude. For the people he wants to hide from, his name is:John Tsakiris - Founder and CEO of MICROVISOR PRODUCTS, LLC - Fair Haven, New Jersey, United States I just lodged a complaint with BBB."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Kensinger",
          "Nb_Reviews": 1,
          "Date": "2022-09-10T17:36:50.000Z",
          "Titre": "It doesn’t work for us",
          "Contenu": "It doesn’t work for us.  The fact that it is not returnable after opened is a good reason not to buy it!  I wish I had read that first, I would not have bought it.  I also bought one as a gift and am trying to return it, but no response to my emails yet (it has been over a week)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Conrad La Creta",
          "Nb_Reviews": 1,
          "Date": "2022-10-07T21:24:12.000Z",
          "Titre": "It was very diffucult to install",
          "Contenu": "It was very diffucult to install. couldnt get the spacer the screw kept folling Tryed to send back . THey said it cost 18 dollars what a rip off. Im 82 yrs. old would not recomend this product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Brown",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T04:17:53.000Z",
          "Titre": "I'm trying to receive info on how to…",
          "Contenu": "I'm trying to receive info on how to return my microvisor hood. I've sent two emails to the return cite with no response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KSF",
          "Nb_Reviews": 1,
          "Date": "2022-06-26T15:56:07.000Z",
          "Titre": "Doesn’t do the job",
          "Contenu": "I am very disappointed from the product especially after reading all the positive reviews. 1. The hood is pretty deep so it is kind of in your face when you’re cooking, also blocking the light2. Pricey for this pretty flimsy piece of metal3. Does NOT do the work, smoke is still running to the sides, and my retire house still smells like cookingConclusion: Don’t worth it, if you want your house to be smoke and smell free you should replace your above range microwave with a decent hood with decent suction."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "sandra vanhandel",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T01:01:27.000Z",
          "Titre": "It doesn't stick out far enough ..I…",
          "Contenu": "It doesn't stick out far enough ..I turn on fan grease goes right past it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike D",
          "Nb_Reviews": 1,
          "Date": "2022-06-11T18:16:08.000Z",
          "Titre": "Cheap product …",
          "Contenu": "Very flimsy once mounted and then the interior microwave light would not turn off when door closed so I removed it and the Microwave would not work at all ,had to buy a new one. Sent it back for a refund and they refused! Would never recommend this product, a very lousy company to do business with!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ROBERT LEBLANC",
          "Nb_Reviews": 2,
          "Date": "2022-05-10T04:13:50.000Z",
          "Titre": "Micro hood is a rip off!!!",
          "Contenu": "Micro hood is a rip off!!!! They charge to much there product does not work and if you try to return it! They tell you to send it back with an invoice.  Then they get it say it was returned in bad condition and you will not get any money back. And although it cost $25.00 to return it they want to charge $18.00 more than the $124.00 you already paid.  This company is a fraud!!! Do no buy anything from these scam artists!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paramjeet Sidhu",
          "Nb_Reviews": 1,
          "Date": "2022-04-21T04:36:41.153Z",
          "Titre": "I am never buying any MicroVisor product again.",
          "Contenu": "Had terrible experience with the product. This is literally a no-return product because if you return it then first u have to pay return shipping and they will also find a reason not  to refund you even if u never installed or used the product, saying the product is used. I feel cheated 😔 never buying any Microvisor product again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MICHAEL SMITH",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T21:42:54.000Z",
          "Titre": "Installation is way too hard."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Smith",
          "Nb_Reviews": 1,
          "Date": "2022-03-14T17:13:37.000Z",
          "Titre": "Purchased product",
          "Contenu": "Purchased product, unfortunately didn’t read return policy before I installed it.  Product did not work at all. Horrible. Returned it and because I hung it up was unable to return for refund. Would not recommend product. Buyer beware. Any company that won’t let you return there product because it does not work us shady in my opinion."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "PAMELA LINN",
          "Nb_Reviews": 1,
          "Date": "2022-06-19T23:39:11.000Z",
          "Titre": "MICROVISORHOOD EXPERIENCE.",
          "Contenu": "WE INSTALLED HOOD.  BOILED ONE POT OF WATER, WATCHED STEAM GO AROUND THE HOOD. ALSO, THE HEIGHT OF THE HOOD WAS RIGHT AT MY FACE AND DID NOT LIKE IT STICKING SO FAR IN THE WAY. REPACKAGED CAREFULLY USING THE EXACT SHIPPING MATERIALS AND CALLED GEORGE FOR RETURN INSTRUCTIONS. WHEN TOLD GEORGE I HAD USED IT, HE SAID IT WOULD NOT BE RETURNED BECAUSE HIS POLICY STATED THE HOOD MUST BE UNUSED/UNINSTALLED. WHEN I ASKED HIM HOW A CUSTOMER COULD DETERMINE IF IT WOULD WORK, GEORGE SAID\" ARE SUPPOSED TO HOLD IT UP TO THE MICROWAVE AND SEE IT WOULD WORK\".I ASKED FOR HIS LAST NAME TO WHICH HE SAID I DON,T HAVE TO TELL YOU."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2022-02-08T00:07:43.000Z",
          "Titre": "Update on my review",
          "Contenu": "Update on my review. I've emailed the seller to complain about the issues I am experiencing and the email was bounced back to me.Try customerservice@microvisorhood.com and you will get undeliverable address warning email.How do you expect us; customers, to communicate with the company when the customer service email is not valid???"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sachin Ghorpade",
          "Nb_Reviews": 1,
          "Date": "2022-01-06T16:44:36.000Z",
          "Titre": "This has a design flaw",
          "Contenu": "This has a design flaw. On Samsung Microwave, it has a filter underneath, and this blocks the opening of it. i.e. you can't take out the filter without opening the full hood unit which is hooked with 3 screws. Another issue is - unit (clamp) that goes with  the screw, it overlap with the filter  opener and does not fit well, so you see a gap, and it doesn't look straight."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "M Ciccarelli",
          "Nb_Reviews": 2,
          "Date": "2022-04-12T15:08:51.000Z",
          "Titre": "Not exactly the cure",
          "Contenu": "Unfortunately, we found this hood to be cumbersome as it sticks out quite a bit.  As a result, our field of vision to the rear of the stove is obscured unless one moves back from the range or you stope down to look under the hood.We used it for 15 minutes and then removed it."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2022-02-04T20:14:23.000Z",
          "Titre": "It took almost 2 weeks to get the…",
          "Contenu": "It took almost 2 weeks to get the product. I expect it to be delivered in a week or earlier when I get charged $50 shipping fee,Also the product is thinner than the photo leaving one side lower than other when installed.I wouldn't recommend to others for this price and shipping cost."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeanne Griffin",
          "Nb_Reviews": 1,
          "Date": "2022-03-14T13:51:24.000Z",
          "Titre": "Hood did not work for me",
          "Contenu": "Hood did not work for me. It was easily detached from its holder and fell on my glass top stove chipping it. They have a no -return policy for the one I purchased. I will sell it at my next yard sale.This is the feedback I received after writing my review.(Reply from Microvisor Hood12 hours agoJeanne,We have no email or phone call from you. We also have ZERO issues of this complaint in over 15,0000 units sold and counting. We would love to hear from you.......................)If you purchase this unit you should read their return policy and judge for yourself. If I had been able to return the hood I would not have written a review."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pankaj Agarwal",
          "Nb_Reviews": 1,
          "Date": "2021-06-26T23:20:55.000Z",
          "Titre": "Rude customer service",
          "Contenu": "Product is fine, but felt bit smaller than what I expected and also too pricy. I had ordered a NEW Microvisor hood but got one which was \"used\". It had a lot of scratches so I emailed them with photos. I got no response but a replacement was initiated. But that would take A LOT OF TIME so I had emailed about price adjustment instead. In reviews they say they respond to 100% reviews but I got no response to 100% of emails but I did not get any for my emails, just got rude responses on posting reviews."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elino Mercado",
          "Nb_Reviews": 1,
          "Date": "2021-01-07T19:31:24.000Z",
          "Titre": "A turtle delivered it",
          "Contenu": "Delivery was really slow, when I got it had a nick on the side, this was a present for my sister that came from NC to visit me and she left without the item, so now I have to pay for a delivery service because of a slow process delivery, i ordered it on 12/23 and it stated I get it 12/30, so finally I got it today 1/7/21....if your a  patient person then this company is for you but if your like me that before purchasing you look at the expectation date and expect it that same day , then this company is really not for you..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MARK SIPPEL",
          "Nb_Reviews": 6,
          "Date": "2021-10-28T15:00:25.000Z",
          "Titre": "how many freaking emails do you have to…",
          "Contenu": "how many freaking emails do you have to send that I have to read and then move, copy delete mark as spam etc.?????   I bought, I calendar a time to get, that is simply enough DON'T KILL YOUR CUSTOMERS!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Mavroftas",
          "Nb_Reviews": 1,
          "Date": "2021-09-09T16:48:33.000Z",
          "Titre": "I'm very disappointed with the seller.",
          "Contenu": "I'm very disappointed with the seller.. He tried to lecture me about the shipping. When I question why it was not moving on usps tracking site. He stated he's not Amazon! Made excuses about a holiday. Seller is notprofessional. I had planned to tell all my family and many many friends about the product. But he ruined that. I had planned to help the seller present his product to a major appliance repair company I know of.. If I liked the product...but.after his insult to me.... I don't even want to use his product. So I most likely will return it if ever I receive it.The sellers remarks is a sign that he is used to people fussing. This product has the potential to be a well needed item in every house."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter Weber",
          "Nb_Reviews": 1,
          "Date": "2022-09-04T23:30:17.000Z",
          "Titre": "not coming back",
          "Contenu": "I thought shipping is free, but I got charged $ 13.00 for shipping on a $ 14.00 purchase.Will go back to shoplet.com"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jigar Shah",
          "Nb_Reviews": 1,
          "Date": "2022-03-26T14:32:55.000Z",
          "Titre": "Not worth the price",
          "Contenu": "The stainless steel mini hood is rusted and has scratches. Not worth the price they charge. Also I still see majority of vapors escaping and reach ceiling."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "P. Nix",
          "Nb_Reviews": 1,
          "Date": "2022-05-29T15:47:09.000Z",
          "Titre": "I DO NOT recommend this product",
          "Contenu": "I DO NOT recommend this product! When installed, it does not allow you to reach your back burners without having to reach completely around or reach over a steaming pot or fryi n g pan, therefore burning yourself.  When I called about returning it, George (apparently the owner working out of his home. A lafy answered with \"hello\" and said he wasn't home at the time I called.) advised that that's why he made it removable and was very rude on top of that. It makes no sense to me. If I have to remove it to reach my back burners what purpose does it serve when I still have the issue with the front burners in order to reach the back?  When finally told I could return it but packaging and everything had to be perfect I got stuck with the product because my cat scratched on the styrofoam. I could not, in good conscience, sell the product to someone else without telling them tge truth about the product, so yeah, I'm definitely stuck with it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "stanley anderson",
          "Nb_Reviews": 1,
          "Date": "2023-02-05T18:16:38.000Z",
          "Titre": "Doesn't help much and gets in the way"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rodney Miller",
          "Nb_Reviews": 2,
          "Date": "2022-10-25T15:55:49.000Z",
          "Titre": "Cant leave my filter in when installed",
          "Contenu": "Cant leave my filter in when installed. Had to remove it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Umesh Kanaujia",
          "Nb_Reviews": 1,
          "Date": "2021-03-05T16:06:01.000Z",
          "Titre": "Customer care department are not professional enough",
          "Contenu": "Customer care service department are not professional enough, even after sending multiple emails related to product issue, they do not reply."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "vincent carta sr",
          "Nb_Reviews": 1,
          "Date": "2022-06-28T16:57:50.000Z",
          "Titre": "to hard to get into microwave sorry I…",
          "Contenu": "to hard to get into microwave sorry I bought it not good for 5ft person you can  bump your head"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Venugopal GUDIPATI",
          "Nb_Reviews": 1,
          "Date": "2021-03-22T18:18:18.000Z",
          "Titre": "It has been two weeks and I still did…",
          "Contenu": "It has been two weeks and I still did not receive the shipment. Please resolve the issue so that I can revise the rating"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nancy Davis",
          "Nb_Reviews": 1,
          "Date": "2022-02-14T15:48:37.000Z",
          "Titre": "Not very sturdy also did not apply Logo…",
          "Contenu": "Not very sturdy also did not apply Logo on the hood, which makes for a bad look (like not finished)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wadi Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2021-01-18T18:43:04.000Z",
          "Titre": "Product did not arrive.",
          "Contenu": "Product did not arrive.I cannot rate the product since I have not received it. I am waiting on the product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Philip Laske",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T04:05:38.000Z",
          "Titre": "Fantastic advertising",
          "Contenu": "Fantastic advertising.  Nothing but $10 worth of metal."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lois March",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T03:38:21.000Z",
          "Titre": "it covers my work space and I cant use…",
          "Contenu": "it covers my work space and I cant use it.  is there any way to return it?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sandra H Johnson",
          "Nb_Reviews": 2,
          "Date": "2022-02-28T16:24:37.000Z",
          "Titre": "Could not figure out to install",
          "Contenu": "Could not figure out to install. Sent it back for a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ramil Baiazitov",
          "Nb_Reviews": 2,
          "Date": "2021-09-28T13:59:03.000Z",
          "Titre": "Still did not receive the product two…",
          "Contenu": "Still did not receive the product two weeks after I ordered it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wilson Velasquez",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T13:31:40.000Z",
          "Titre": "Unreasonable Return Policy",
          "Contenu": "After receiving the product, I opened the package to review its contents.  The hood looked a little wider than anticipated.  Also, since my oven was curved, I wondered how the hood would look.  So I placed the hood up to the oven to see how it would look (with the bracket as well).  No mechanical fastening took place; just lifted it up to the oven to have my wife view how it looked.  It did not look good and we concluded it would be a safety issue for our young child and elderly parent.After requesting the return policies the very next day via email, I received a response email and was notified about the stringent return guidelines (for the first time).  Essentially, one cannot even open the package and touch the hood.  I'm exaggerating, but essentially the company noted any scratch whatsoever would void the any refund.After reading the email and the attached photos, I called to find out if this was really happening.  The gentleman repeating their policy, noting that even if the unit is not mechanically fastened/installed, it did not matter.  Even putting the hood into the bracket on a table would void the refund as the hood would be \"scratched\" (although could not be visible because the \"scratched\" portion would be in the bracket and hidden).  Regardless, I noted I did not know of this stringent return policy to which he noted it was on the website.  I noted I did not see it and that, at a minimum, it should have been with the instructions or somewhere in the box as is common practice.  Not everyone looks for return policies on websites, especially since most people visit websites to place orders.So, after having to pay about $30 to return the hood and another $10-$20 (don't remember), I just received the hood back.  FYI, it took almost 4 weeks from the date I returned it.My recommendation to avoid any future issues:  place the stringent return policies in the box along with the installation instructions.  If this would add to your costs, I would recommend replacing IT for the advertisement you place in the box for a free hood in exchange for a Youtube video; at least put the ad in regular stock paper in lieu of the heavy card stock.  No added costs would be incurred and the consumer would be protected.  Had I known of this stringent return policy, I would never have placed the hood into the bracket (by hand on my table).  BTW, I keep using the word stringent because I am a SME (subject matter expert); I've been in quality control for years (most of my tenure at the corporate level)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Disappointed customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-25T03:44:19.000Z",
          "Titre": "Does not work!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ehhh",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T03:37:16.000Z",
          "Titre": "Not so great",
          "Contenu": "Not that great."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carole Woodard",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T01:01:43.000Z",
          "Titre": "I don’t like this at all",
          "Contenu": "I don’t like this at all. I have to lean down to see the controls on my range. It’s in my face I feel like. I’m not sure what I expected, but not this. The metal also seems flimsy."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard Worley",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T16:47:17.000Z",
          "Titre": "Sort of works.",
          "Contenu": "Does not capture smoke from front burners as depicted in ads.  Have to fan stove top with a towel to fully push smoke under the hood.  Does slightly interfere with access to stove top rear panel controls.  Not sure it's worth the cost.  Very easy to install."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Kavanaugh",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T17:22:12.000Z",
          "Titre": "Need thicker spacersInstallation was a nightmare",
          "Contenu": "Installation was a nightmare! If you have a microwave that is straight, should be no problem, however my microwave has a curved door & your 3/8 inch spacers did not cut it. I made my own 7/8 spacers and it worked fine. You need to fix this problem as I was ready to declare your product a piece of junk and send it back!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bob Giles",
          "Nb_Reviews": 3,
          "Date": "2022-12-20T18:05:42.000Z",
          "Titre": "Doesn't work well when making candy or…",
          "Contenu": "Doesn't work well when making candy or anything that requires a  thermometer"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Roanne Fortin",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T15:30:35.000Z",
          "Titre": "Product was very easy to install but…very flimsy",
          "Contenu": "Product was very easy to install but very flimsy. Needed more locking screws, only has one. Husband will gave to drill holes in it to add more. And, for $139.00, we expected a more sturdy product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel OConnor",
          "Nb_Reviews": 1,
          "Date": "2022-07-09T18:21:27.000Z",
          "Titre": "Terrible return policy!",
          "Contenu": "Wife didn't like it so asked for return instructions.  Email came back with $18 restocking fee, and you pay return freight.  If you install it, it is non Returnable and if there's any scratches or anything else it's non Returnable. Also you must have the original packaging or it's non Returnable. Fortunately we just held it up and she made the decision. I hope it's not damaged in shipping on the way back."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike Hein",
          "Nb_Reviews": 1,
          "Date": "2022-10-30T15:36:47.000Z",
          "Titre": "Didn't fit my microwave",
          "Contenu": "This product didn't fit my microwave with filter have to remove the filter for it to work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Robinson Jr",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T23:47:34.000Z",
          "Titre": "It stinks out a little further than I…",
          "Contenu": "It stinks out a little further than I thought it would"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chandramouli Krishnan",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T02:02:44.000Z",
          "Titre": "Beware of the screw size (it did not fit my microwave model)",
          "Contenu": "While the product is good, the edges are a little sharp. Depending on how much room you have above the range, you could get some scratches/cuts in your hand while cooking. Another issue is that the screws that are provided are not universal. The screws that came with the package did not fit my microwave model (Kitchenaid). So, beware of this issue."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Fabian Sarrazola",
          "Nb_Reviews": 1,
          "Date": "2022-09-17T17:25:46.000Z",
          "Titre": "The design is good but it needs to be…",
          "Contenu": "The design is good but it needs to be wider in the front to really cover all the fumes when you use the burners at the front  edge."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "AG",
          "Nb_Reviews": 1,
          "Date": "2022-06-26T16:29:54.000Z",
          "Titre": "Took over 3 weeks to receive product …",
          "Contenu": "Took over 3 weeks to receive product  due to shipping inefficiency. In the year 2022, company should work on this more and not defer responsibility to third party. Find a solution."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Candy Benjamin",
          "Nb_Reviews": 1,
          "Date": "2021-03-02T15:28:01.000Z",
          "Titre": "First off I'll say I thought the…",
          "Contenu": "First off I'll say I thought the concept was great and it does what it's supposed to.  In practice however the now concentrated steam collects on the underside of the microwave and the adjoining cabinets because the fan can't pull it out fast enough.  My cabinets were dripping water.  Made a bigger mess than before.  Also cuts off any overhead light that you might have so you're now cooking in worse shadow than before.  It probably won't stay up much longer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "AJL in MD",
          "Nb_Reviews": 1,
          "Date": "2022-03-28T21:24:37.000Z",
          "Titre": "Wish it worked better",
          "Contenu": "A well-made product, but enough smoke still escapes when cooking a steak to set off my smoke alarm."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jacklyn McBeth",
          "Nb_Reviews": 1,
          "Date": "2022-04-18T16:10:35.000Z",
          "Titre": "front burners",
          "Contenu": "Still getting lots of smoke so it really does not defuse the smoke from the 2 front burners."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paul Improta",
          "Nb_Reviews": 1,
          "Date": "2022-05-21T16:54:36.000Z",
          "Titre": "Overpriced",
          "Contenu": "Overpriced, flimsy and doesn't really funnel the fumes to the vents."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RAPPEL/JOAN CASTILLO",
          "Nb_Reviews": 3,
          "Date": "2023-07-18T18:58:12.000Z",
          "Titre": "It does what it's supposed to do but…",
          "Contenu": "It does what it's supposed to do but the flimsy metal makes it not worth the price. The front of the hood is wavy making it look like dents in the metal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 2,
          "Date": "2023-02-20T20:28:54.000Z",
          "Titre": "Works well but hard to see oven controls",
          "Contenu": "Does a good job capturing the smoke but it makes it difficult to see the oven controls. If there was a possibility to make it slide in and out from under the microwave that would make it easier to use. I leave the set screw out so I can leave it off until I need to use it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DLath",
          "Nb_Reviews": 1,
          "Date": "2022-12-19T00:27:22.000Z",
          "Titre": "For Olde people it's too hard to install.",
          "Contenu": "It came with some scratches on it.  It appears to be made of flimsy material.  The screws were to long for my microwave when using the upper slit in the rail and to short in the bottom slits.  I finally was able to install it with the original screws from the microwave after standing on my head. It does appear to keep some of the heat off of the microwave handle so that is a plus.  I probably wouldn't buy it again, especially at the price it is, but we'll see."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Karvunis",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T19:28:54.000Z",
          "Titre": "I already left a review on Google",
          "Contenu": "I already left a review on Google, but it keeps bugging me to leave another. It works as it should and it looks fine. I don’t like how it’s loose, I think another set screw would take care of that. And I think it’s over priced. $50 more and you can buy an over the stove microwave at menards. It does make it hard to cook on the front burners if you have a tall pot but that is not the fault of this hood, it hooks onto your microwave so it’s at the same level that your microwave is."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matthew Sutton",
          "Nb_Reviews": 2,
          "Date": "2023-03-12T18:58:01.000Z",
          "Titre": "Doesn't quite work.",
          "Contenu": "Install was very easy, however it doesn't really help direct steam through the blower, the steam just goes arround the side of it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-12-07T21:55:39.000Z",
          "Titre": "made with very cheap materials",
          "Contenu": "overall concept is good, but the product metal is too thin, therefore very flimsy and easily bent by knocking it while setting down or picking up a pot off the cooktop appears to be very cheap!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Limone",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T18:46:35.000Z",
          "Titre": "Although packed well and no damage to…",
          "Contenu": "Although packed well and no damage to carton after unpacking item was bent. Had to be shipped that way because your product is made from heavy gauge steel."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "sonny s.",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T19:12:56.000Z",
          "Titre": "I like the clean look of your product…",
          "Contenu": "I like the clean look of your product but my wife noticed when she cleans it that it’s really flimsy.. even when just brushing up against it will make it bounce up and down pretty noticeably"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Raymond Colello",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T21:51:53.000Z",
          "Titre": "The unit does not stop all the steam…",
          "Contenu": "The unit does not stop all the steam from the stove I rate it’s function at about 50 percent!  This product is way over priced!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chad Newman",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T17:12:27.000Z",
          "Titre": "The end result of mounting ( I followed…",
          "Contenu": "The end result of mounting ( I followed instructions as prescribed ) leaves the visor too wobbly & shaky!  Not happy with mounting."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-01-29T21:10:20.000Z",
          "Titre": "gets in way",
          "Contenu": "when it is on you cant see the controls on range.  it how ever does do what it is intended to do.  I think it could be a little longer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Citizen",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T23:27:55.000Z",
          "Titre": "No TItle",
          "Contenu": "Like:  Respond time to email is quickDislike:  Price of Product is too high for what you get"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T17:49:01.000Z",
          "Titre": "Delivery and service was good",
          "Contenu": "Delivery and service was good. Price of the item for what it is is very steep."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "richard j",
          "Nb_Reviews": 2,
          "Date": "2022-08-23T18:53:20.000Z",
          "Titre": "Easy install, mediocre performance",
          "Contenu": "The Microvisor Hood was relatively easy to install  It looks good and seems of high quality.  The only disappointment I have is that it still allows quite a bit of steam to escape from the front of the hood which is what I was trying to address. It also obstructs the view of the stove top quite a bit and will take some getting used to."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff Skowron",
          "Nb_Reviews": 2,
          "Date": "2022-08-29T16:47:59.000Z",
          "Titre": "Works ok but has a flimsy mount.",
          "Contenu": "Your product looks nice and of course it works keeping the heat and grease close to the fan intake, but....The mount is flimsy and allows the hood to bounce. Your company should add a few holes in the hood and threaded holes in the mount to bolt it more solidly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Peter Fisette",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T17:01:38.000Z",
          "Titre": "The unit is well made and easy to…",
          "Contenu": "The unit is well made and easy to install. The thing I didn’t like from day one is it sticks out too far and it is had to see and use the stove controls when in place. I think it could have been made 4” shorter and would not be in the way of controls or stirring larger pots on burners when using. The result being we are constantly taking it off and on under different stove top use."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nick Giglioli",
          "Nb_Reviews": 2,
          "Date": "2022-10-23T21:27:28.000Z",
          "Titre": "Hood is made of goo matieral boxed well…",
          "Contenu": "Hood is made of goo matieral boxed well and came on time.Hoods not low enough to catch smoke still setting of smoke detector."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Travis Marcott",
          "Nb_Reviews": 2,
          "Date": "2022-07-30T17:02:47.000Z",
          "Titre": "Helps but is flimsy.",
          "Contenu": "It definitely helps with the steam coming up and matches the black stainless ver well!  Only problem is it’s very flimsy metal.  Already bumped it a couple times reaching for pans and can see dents and bends in its future.  For the price it should be sturdy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michelle McDonald",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T21:52:17.000Z",
          "Titre": "Works pretty good",
          "Contenu": "I waited until I had used the product for awhile before writing a review. It works, to an extent. It keeps the majority of the steam from hitting the microwave but I have to move the pot to the back side of the front eye to get all steam. Definitely helps a lot though. One word of caution, if you want Black, order Black, not Black SS as it is not at all black. Matches my SS appliances perfectly but does not match my black stove and microwave."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Julie M",
          "Nb_Reviews": 2,
          "Date": "2022-07-23T17:15:46.000Z",
          "Titre": "The microvisor  hood was shipped…",
          "Contenu": "The microvisor  hood was shipped quickly and we received it in a few days. My husband installed it and he mentioned that it was very easy to install. It seems to work well funneling steam and smoke into the microwave fan and not into the kitchen. It is a nice quality. The reason for the three stars is that it does block your vision. My controls are on the back of the stove so i have to bend over to set the controls. Also you need to keep the light on because it makes the stovetop dark. While cooking a large pot with the strainer of pasta, it is not easy to drain the pot because as you are lifting the strainer the hood interferes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "esposito joan",
          "Nb_Reviews": 1,
          "Date": "2022-05-30T18:14:29.000Z",
          "Titre": "Disappointment with installation.",
          "Contenu": "I was pleased with the looks, fit, ease of installation until I put in the one center screw supplied; to install under the hood and secure it. One screw is not enough. Another screw for each end is needed to stabilize both ends of this hood. It is not solidly connected to the bracket which makes it a bit floppy. I had to wrap clear tape around each side of hood to firmly attach it to the bracket. Two more holes and two more screws should have been supplied. Poor judgement on the part of the company. Don’t know how long the tape will last?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fred",
          "Nb_Reviews": 1,
          "Date": "2022-03-29T15:56:00.000Z",
          "Titre": "Not bad but not great for $150",
          "Contenu": "The hood looks good but mounting is pretty flimsy and nothing connects to the sides of the hood for stability.  It is like a diving board in its mount.  The security screw would not screw into the hood.  I had to use a tap to make threads there.  So overall it's mediocre at best.  Not a good value for $150!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Narayanasamy Rajagopal",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T15:01:29.000Z",
          "Titre": "Does it job but unreasonably priced",
          "Contenu": "This product does what is expected out of it. It prevents oil stick on the microwave door and saves time webspent in cleaning.  It blends perfectly with ovens metal Color and hardly noticable. Only downside of this is price, i am not sure why they charge $120 + for this metal plate. Probably $50-$75  would be justifiable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "john renna",
          "Nb_Reviews": 1,
          "Date": "2022-03-21T16:02:19.000Z",
          "Titre": "Idea of hood excellent but…",
          "Contenu": "Idea of hood excellent but unfortunately the bottom of our mounting microwave oven above the stove did not allow me to mount the Microvisor to the bottom of the microwave.  I would have needed much longer screws with spacers to even get the unit to attach correctly"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "T McDermott",
          "Nb_Reviews": 1,
          "Date": "2022-05-21T17:23:20.000Z",
          "Titre": "The hood didn't totally fix the issue…",
          "Contenu": "The hood didn't totally fix the issue of smoke and grease not being captured by the microwave fan, but it did help. I personally feel the price is too high for what it does accomplish. Very clever idea though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin Rodolico",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T22:00:57.000Z",
          "Titre": "when in place it is hard to see knobs for burners it should have been made shorter for those stoves with control in back.",
          "Contenu": "screws that were provided didn't fit my Whirlpool Microwave. I had to go buy ones at hardware store!!Directions weren't as plain reading as could be."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel Gosselin",
          "Nb_Reviews": 1,
          "Date": "2022-08-27T20:07:35.000Z",
          "Titre": "Nice idea but the screws fit through…",
          "Contenu": "Nice idea but the screws fit through the small slots. Delivery was signature required which means you don’t value my time. That should be optional."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bruce Dorner",
          "Nb_Reviews": 2,
          "Date": "2021-05-11T12:13:04.000Z",
          "Titre": "Useful to reduce stovetop vapors",
          "Contenu": "Nicely made.  Easy installation.  In my case, the microwave did not extend far enough forward for the fan to be effective in reducing vapors from the stove burners.  The Microvisor helped somewhat, but did not eliminate the problem.  I give it high marks for quality, but middle of the road for effectiveness."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MAGNUM",
          "Nb_Reviews": 2,
          "Date": "2021-03-29T14:08:46.000Z",
          "Titre": "Good idea with poor packing and execution",
          "Contenu": "Good idea with poor packing and execution. Hood cover came dented and scratched. The included rail attachment screw was to long on the left side of the microwave as it bottomed out on the door hinge before tightening and the original screw was too short once the rail was installed. You would think for 100 plus dollars this would be a bit better engineered and I would not need to take a 20 minute, each way, ride to Lowes to buy more hardware to properly install it. It works but it was a bit of a hassle to get it installed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "cyrus choy",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T22:14:17.000Z",
          "Titre": "easy install/semi works",
          "Contenu": "easy install, but it needs to be 2-3 inches longer, as it does not capture all of the smoke/smell. For $150 someodd dollars, should work better."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Richard Katerberg",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T16:43:31.000Z",
          "Titre": "I like the actual stainless steel hood",
          "Contenu": "I like the actual stainless steel hood, but was not satisfied with the samsung adapter kit. Probably not your fault that one of the screws broke because it was difficult to screw into one of the existing holes on the microwave. With the adaptors installed the visor was too low for my liking. I remove the C clamp and drilled 3 holes in the visor so that I could attach it directly to my samsung. This did still allow access and removal of the microwave filter. Im very happy with this adaptation. P.S. I should have checked on the import duties of shipping to Canada...my bad that it shocked me on arrival. It doubled the shipping cost!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Becky",
          "Nb_Reviews": 3,
          "Date": "2021-08-27T17:24:01.000Z",
          "Titre": "Easy to install, good service but very sharp edges!!",
          "Contenu": "The item was easy to install.  The service assistance was great.  However, the Microvisor had sharp edges that I wish could have been filed down.  Easy to cut yourself when cleaning it.  Had to cover with a strip of tape."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brett Rider",
          "Nb_Reviews": 1,
          "Date": "2022-03-11T02:35:30.000Z",
          "Titre": "The quality is good it just sticks out…",
          "Contenu": "The quality is good it just sticks out too far and I emailed a return request and haven’t heard anything back yet. I need to get a response before the 30 days so I can get my money back."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dennis Howard",
          "Nb_Reviews": 1,
          "Date": "2022-08-27T19:37:57.000Z",
          "Titre": "THE  EMBLEM IS MESSINA",
          "Contenu": "Everything went well but when I received the visor their was no emblem.  Could you possibly send me the microvisor emblem"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 3,
          "Date": "2022-05-31T18:15:42.000Z",
          "Titre": "The construction of the product is…",
          "Contenu": "The construction of the product is great.For my set up the visor is alittle longer than I expected.  It's hard to see the control panel on the stove."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marlene Mendoza-De La Torre",
          "Nb_Reviews": 1,
          "Date": "2021-04-05T20:00:22.000Z",
          "Titre": "It arrived bent",
          "Contenu": "It arrived bent. We had to straighten out the dent with a towel and pliers. So as not to scratch it. Otherwise it seems to working. More care needs to go in the packaging. Very easy to install. Fast shipping."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DIYer",
          "Nb_Reviews": 1,
          "Date": "2021-06-21T22:36:20.000Z",
          "Titre": "Best available option for OTR…",
          "Contenu": "Best available option for OTR microwaves but has sharp edges that may pose a potential hazard. When contacting customer service, I was pretty much told to be careful around the kitchen."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bw",
          "Nb_Reviews": 3,
          "Date": "2022-05-23T18:16:41.000Z",
          "Titre": "Hood only captures part of the smoke…",
          "Contenu": "Hood only captures part of the smoke from frying. Doesn't do what the discription says it will. Hard to mount it to the microwave."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-01-19T22:40:48.000Z",
          "Titre": "I haven’t receive my order yet up to…",
          "Contenu": "Got my order after a month. The package in good condition, installation is very simple and straight forward and it looks good, matching on our microwave."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Craig",
          "Nb_Reviews": 6,
          "Date": "2022-05-03T23:56:36.000Z",
          "Titre": "View of the back burners and oven…",
          "Contenu": "View of the back burners and oven controls is blocked by the hood. Have to bend over to cook on the back burners."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Reuben Pinzon",
          "Nb_Reviews": 1,
          "Date": "2021-03-15T21:44:25.000Z",
          "Titre": "o.k. but not for my application .",
          "Contenu": "Item seems o.k. but my microwave sits lower over range and visor blocks view of cooktop ,so I am currently trying to return this item !"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Justin M",
          "Nb_Reviews": 1,
          "Date": "2022-03-05T17:08:31.000Z",
          "Titre": "It’s ok a little pricy for what it is",
          "Contenu": "It’s ok a little pricy for what it is. Also since I’m tall it’s upper hard to see the knobs now."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Troy Schall",
          "Nb_Reviews": 1,
          "Date": "2022-05-01T17:45:37.000Z",
          "Titre": "Good",
          "Contenu": "Nice range hood. Works well. But it's flimsy. Needs away to tighten it up"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas D. Bieber",
          "Nb_Reviews": 1,
          "Date": "2021-04-22T18:14:39.000Z",
          "Titre": "Did not have micro visor  logo",
          "Contenu": "Did not have micro visor  logo.  Did not see value compared to price.  Works well though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lynn Montoya",
          "Nb_Reviews": 2,
          "Date": "2022-04-20T17:54:58.993Z",
          "Titre": "it didn’t really work for my microwave…",
          "Contenu": "it didn’t really work for my microwave set up.  i gave it to my friend"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rodney Flessner",
          "Nb_Reviews": 1,
          "Date": "2022-01-06T15:01:47.000Z",
          "Titre": "The hood should retract back when not…",
          "Contenu": "The hood should retract back when not needed. Then it would be a great design"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Albert Lewallen",
          "Nb_Reviews": 2,
          "Date": "2022-12-28T00:58:34.000Z",
          "Titre": "bad light",
          "Contenu": "light stay charged light falls off"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Duce",
          "Nb_Reviews": 1,
          "Date": "2021-02-04T22:09:48.000Z",
          "Titre": "Not great",
          "Contenu": "Unit does not improve evacuation of cooking product as well as expected. Too pricy..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2022-08-14T18:14:26.000Z",
          "Titre": "Good product but overpriced for sheet…",
          "Contenu": "Good product but overpriced for sheet metal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris Shin",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T17:05:37.000Z",
          "Titre": "Average",
          "Contenu": "Average compare to other companies"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brittany G",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T18:40:37.000Z",
          "Titre": "The hood was very thin and warped"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Audrey B.",
          "Nb_Reviews": 2,
          "Date": "2023-04-12T23:47:24.000Z",
          "Titre": "Works to reduces odor from cooking",
          "Contenu": "The Microvisor Hood was so easy to install - it looks like it was made for my microwave, not an 'add-on'.  It definitely reduces cooking odors but won't capture all of them (they are clear about this in advertising so believe it).  The house can still be stinky after some types of foods but the intensity of cooking odors are greatly reduced.  I use an odor eliminating candle occasionally and that helps.  I wanted to replace my microwave with a range hood; however, the way the microwave is attached would require a contractor to remove it and redo the tile.  The Microvisor Hood is a viable option.  You can't go wrong with getting this item.  Shipping was fast and I suspect the company has a good customer service department from the positive reviews although I did not need to contact them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "patricia trudel",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T21:48:00.000Z",
          "Titre": "Product looks nice and does the job",
          "Contenu": "Product looks nice and does the job. But because my microwave has curved bottom the adapter for additional $25  had to be ordered. The 2\" screws to connect adapter to visor were missing from package. Rather than going through bother of contacting company just found my own screws. Other than that very satisfied dealing with company and with product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Benjamin",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T14:20:17.000Z",
          "Titre": "Looks great!",
          "Contenu": "Shipping was fast. Looks great, matches with our black stainless steel microwave. Install was easy and feels strong and sturdy.  Has definitely reduced the amount of smoke alarms we’ve been getting."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Santiago",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T17:52:28.000Z",
          "Titre": "Amazing product, could use a slight redesign on how solid the mounting is.",
          "Contenu": "The actual product is great.  Works as described and has really made cooking a more enjoyable experience now that we worry less about setting the fire alarm off or raising the indoor AQI (we have a detector) too much.  We have birds which are very sensitive to AQI.  The only constructive criticism I have is that I immediately did not trust mounting this with the hardware present on my microwave.  I decided to drill out a bar existing on the microwave, install 3 m6 rivnuts and then enlarged the holes through everything in order to really get a solid mount.  I had some left over automotive m6 bolts with a philips drive, which made it possible to install without having to modify the provided mounting bar much.  My wife and I are a bit accident prone and we've already bumped the hood a few times, I'm really happy with how solid it is now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JLW",
          "Nb_Reviews": 2,
          "Date": "2023-01-10T19:47:57.000Z",
          "Titre": "Microvisor 30” Black",
          "Contenu": "Your product, well made and delivers as promised to a large extent. A breeze to install. My only slight misgivings are it’s kinda pricey, and I wish it could extend out another inch or two at the user’s discretion. As-is, good purchase and helps keep the smoke and odor under the microwave filter fan for better elimination. This and a stand-alone air purifier almost as good as an exterior vent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christine",
          "Nb_Reviews": 3,
          "Date": "2023-01-17T15:59:10.000Z",
          "Titre": "The hood does what it’s supposed to do",
          "Contenu": "The hood does what it’s supposed to do.  If it was a couple inches less in depth with the same slope it would not stick out as mischief and would not inhibit the access to tall pots on large burners in the front.  Also the screw to stop it from sliding was slightly too short for our installation and keeps falling out.  Had to replace with something different."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Giuseppe Timpano",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T05:41:33.000Z",
          "Titre": "Since the height of the Microvisor Hood…",
          "Contenu": "Since the height of the Microvisor Hood is at head level, it is easy for your brow to hit the MH. If the ends are more round the impact would be minimal."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lenny",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T20:13:34.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, does control a lot of steam going to the ceiling and sweating the microwave door above. Have had to lift food higher to clear the little stick out of hood visor to put food in micro, but this is not the company fault. The visor is worth it. Bought by sister, Debbie, at my recommendation and installing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leilani madrigal",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T21:57:46.000Z",
          "Titre": "It was easy to attach to my microwave…",
          "Contenu": "It was easy to attach to my microwave and gives good coverage for exhaust from my stove,,am very happy with my purchase"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Norwood",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T08:21:18.000Z",
          "Titre": "Product is excellent",
          "Contenu": "Product is excellent,  only negative was the instructions were not overly clear, it took some trail and error until I realized screws go up thru slots, not a very easy task doing it by yourself."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greta Caguioa",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T18:15:11.000Z",
          "Titre": "The MicroVisor works really well",
          "Contenu": "The MicroVisor works really well!  My husband cooks a lot of fried foods on the stove and the microwave and upper cabinets constantly needed to be cleaned. It does work well but the only thing is it looks kind of cheap.  So after I use and clean it, I store it in the pantry."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ray",
          "Nb_Reviews": 2,
          "Date": "2022-12-22T02:39:47.000Z",
          "Titre": "Easy to install, stainless steel hood is not black",
          "Contenu": "Easy to install as we have a Maytag microwave. The hood extension increases the hood fan efficiency. The only negative comment would be the color of the stainless steel hood. The ads say it’s black, but the color is actually  dark grey in color, not black. Not a big deal and it works great. It would have been a 5 star rating if the color would have been black."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas Bruno",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T18:30:04.000Z",
          "Titre": "It has helped with stopping the smoke…",
          "Contenu": "It has helped with stopping the smoke alarm for going off.I am really disappointed with the light I purchased.The charge doesn't last more than a day?i cant keep charging it every day? i think there is something wrong with it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Caprarese",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T21:35:46.000Z",
          "Titre": "Instructions for a return was not easy…",
          "Contenu": "Instructions for a return was not easy for me to fully understand. A quick phone call to Microvisor answered my question and a refund was quickly prvided."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PETER SHAW",
          "Nb_Reviews": 2,
          "Date": "2023-01-23T18:19:56.000Z",
          "Titre": "I liked that you had a phone number to…",
          "Contenu": "I liked that you had a phone number to call and you resolved the issue in a timely manner. I didn’t like that the original product that I received was the wrong item."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adan R Mendez",
          "Nb_Reviews": 2,
          "Date": "2022-12-03T23:47:14.000Z",
          "Titre": "serves its purpose",
          "Contenu": "In general terms, this product is good, easy to install and it fit my microwave perfectly, although I consider it was a bit overpriced."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandra",
          "Nb_Reviews": 2,
          "Date": "2023-01-30T15:47:02.000Z",
          "Titre": "The hood came quickly and attached…",
          "Contenu": "The hood came quickly and attached easily.  Works reasonably well and easy to take off for cleaning"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mee",
          "Nb_Reviews": 2,
          "Date": "2023-02-08T21:20:12.000Z",
          "Titre": "It is working well",
          "Contenu": "It is working well.  There was a larger dent in the front, larger than we thought you would sell one with.  But my husband \"hammered\" most of it out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Clay",
          "Nb_Reviews": 2,
          "Date": "2023-03-06T19:42:10.000Z",
          "Titre": "Good fit",
          "Contenu": "Good fit well, was easy to install and catches the fumes from cooking."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vivikka Molldrem",
          "Nb_Reviews": 3,
          "Date": "2023-01-08T17:24:38.000Z",
          "Titre": "Easy to install",
          "Contenu": "It was very easy to install and the automatic feature works well.  My only complaint is that it is not as bright as I would like it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "katheen Sutton-Stuber",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T20:59:55.000Z",
          "Titre": "Sticks out to use rear burners which i…",
          "Contenu": "Sticks out to use rear burners which i use all the time other than that really like the concept"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sophie Menard",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T11:38:34.000Z",
          "Titre": "We renovated our kitchen and our OTR…",
          "Contenu": "We renovated our kitchen and our OTR microwave wasn’t removing all the steam and grease from cooking.  Once we added the microvisor, it made a huge difference!  The only thing I would change is to add canadian dollar selling price as it is double the US dollar cost with shipping! (That is the reason for 4 stars and not 5)!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janet Lovell",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T19:44:28.000Z",
          "Titre": "Love it",
          "Contenu": "Love itThinner than I expected BUT realized it had to be made that way"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shawn",
          "Nb_Reviews": 2,
          "Date": "2022-11-08T03:35:18.000Z",
          "Titre": "Quick delivery",
          "Contenu": "Quick delivery, easy installation. Only down side for me is if I’m standing next to the stove I have stand back or bend over to see the rear area. My wife of 5’0 has no such problem. The hood does capture a lot more smoke and exhaust so it does exactly what it advertised."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 2,
          "Date": "2023-02-27T18:09:06.000Z",
          "Titre": "It is good",
          "Contenu": "It is good , but it could be a little shorter say about 2 inches.But over all it good and easy to put up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Neena Virdi",
          "Nb_Reviews": 3,
          "Date": "2023-01-15T20:31:56.000Z",
          "Titre": "Good improvement on the smoke and…",
          "Contenu": "Good improvement on the smoke and exhaust. Very easy to install."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Happy",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T20:06:03.000Z",
          "Titre": "Shipped promptly and was packaged well",
          "Contenu": "Shipped promptly and was packaged well. Easy to install and works fairly well. Should be priced around $80."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "EDDIE GONZALEZ",
          "Nb_Reviews": 2,
          "Date": "2023-01-21T19:40:10.000Z",
          "Titre": "Awsome idea",
          "Contenu": "Awsome idea, just an ich longer and it would have been perfect"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "WHTETRASH",
          "Nb_Reviews": 2,
          "Date": "2022-11-29T03:24:54.000Z",
          "Titre": "Easy to install works fine"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2022-12-31T17:08:12.000Z",
          "Titre": "Pleased with Microvisor Hood",
          "Contenu": "Pleased with Microvisor Hood; however, had trouble screwing extension piece into hood."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Curtis",
          "Nb_Reviews": 4,
          "Date": "2022-10-08T15:41:30.000Z",
          "Titre": "Very good functionality, price/quality ehh.",
          "Contenu": "The idea and functionality is excellent. The minus a star is for the price and quality. It is expensive for what the product is. The \"stainless steel\" is very thin and flimsy. It needs to be sturdier for the price. Recommend the product just not sure about the pricing and product together. Another point unrelated to stars is that if your microwave is only a 24 inches or so above the stove it does block visual and access. Again not their issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brenda Webb",
          "Nb_Reviews": 2,
          "Date": "2023-02-06T19:38:40.000Z",
          "Titre": "It works fine just wish it  didn't …",
          "Contenu": "It works fine just wish it  didn't  come over the stove so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eddie Sturgeon",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T15:44:56.000Z",
          "Titre": "It was shipped on time and it does help…",
          "Contenu": "It was shipped on time and it does help no doubt about that on a scale of 1 to 10 probably a seven the difference before and after.. but 150 bucks for just a flimsy sheet of metal to be honest I could have gone out in the shed and probably built something that didn't look as good but would have done the same thing.. installation was easy I just think for something that probably cost you $10 to build to sell for $150 is a little Overkill"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Stout",
          "Nb_Reviews": 3,
          "Date": "2022-11-21T00:27:19.000Z",
          "Titre": "It works",
          "Contenu": "It works, it's got a dent you can see from a mile away."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CJ in Arizona",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T18:59:17.000Z",
          "Titre": "It was easy to install!",
          "Contenu": "It was easy to install. My wife used three out of four of our stove's burners to cook a meal on Saturday, and the hood funneled the steam into the microwave's exhaust fan very effectively. But she says that she keeps bumping into the hood because of how far it extends out away from the microwave. But she just brushes that off as a learning curve. For me, at 6'6\" tall, I have to bend over quite a bit to see the stove's control knobs. I guess I'll have to learn, too. But it does what it was advertised to do!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "john",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T14:37:24.000Z",
          "Titre": "seems like a good product.easy to…",
          "Contenu": "seems like a good product.easy to install.fits well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elizabeth Yake",
          "Nb_Reviews": 1,
          "Date": "2022-09-25T19:31:21.000Z",
          "Titre": "i have to remove it when i'm not…",
          "Contenu": "i have to remove it when i'm not cooking on stove top because i can't reach into my microwave with it on.  Also, i've hit my head on the corner a couple times, but have learned to stay away from the corners (lol).when i use it while cooking it does a good job of \"re\"directing the steam and i have less clean up of microwave when done cooking.all in ....a pretty product.  i'd have given 5 stars if i didn't have to remove it when not cooking.  I don't think there is a solution to this problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tish",
          "Nb_Reviews": 1,
          "Date": "2022-10-16T21:43:59.000Z",
          "Titre": "Only one problem",
          "Contenu": "Arrived quickly. Install was simple. Does it's job. Only problem is it makes using the back burners difficult and accessing the control knows located on the back of the stove"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jasem Albaghli",
          "Nb_Reviews": 1,
          "Date": "2022-09-04T17:32:29.000Z",
          "Titre": "exactly as described, but!",
          "Contenu": "The hood is exactly as described. Excellent quality and easy installation. I just hate it! 😂🤣😂🤣😂 it blocks my view while cooking. I can’t tip food into the pots without pulling them out from under the extended hood. So I have opted to keep the screw that holds it in place out, that was I can slide the hood in and out with ease."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis Whitlock",
          "Nb_Reviews": 2,
          "Date": "2023-01-02T06:53:02.000Z",
          "Titre": "Good quality stainless steel"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ann McEwen",
          "Nb_Reviews": 9,
          "Date": "2022-10-25T16:21:35.000Z",
          "Titre": "The micro visit works great",
          "Contenu": "The micro visit works great!  We are pleased with the exception of purchasing a kit to install which wasn't needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KEVIN",
          "Nb_Reviews": 2,
          "Date": "2022-08-01T02:09:22.000Z",
          "Titre": "Well made! A little bit spendy.",
          "Contenu": "I found the product solid and well made and thought out. I mounted it under a cabinet that hangs a bit too low over my range. A normal range hood with light and fan would be too bulky and look bad in that location. The Microvisor looks much better and directs steam away from the cabinet and wall. It's nice, but a little pricey for what it is."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2022-08-06T16:12:25.000Z",
          "Titre": "Prompt and quick delivery, but",
          "Contenu": "Prompt and quick delivery, but the forward lip has noticeable warping and waviness in the metal.  I don't know if I want to try to straighten it, lest I make it worse.Incorporated magnets on the top would allow for easy attachment to the underside of the microwave when not in use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laddie Folster",
          "Nb_Reviews": 2,
          "Date": "2022-12-12T22:06:04.000Z",
          "Titre": "Easy to put on",
          "Contenu": "Easy to put on.  We have a low Microwave and it is a little in the way.  But works great so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wayne Huff",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T01:49:46.000Z",
          "Titre": "VERY USEFUL",
          "Contenu": "This hood works pretty good and was what we were looking for to keep the steam from escaping the vent fan and getting all over the microwave and cabinets. I would have given it 5 stars, but for $150.00 it doesn't catch all the steam(maybe 95% which is pretty good). If it was just a few inches wider it would probably catch a %100 and I also thought it should have an option to be able to adjust it so when it's not in use you could slide it back out of the way instead of taking it off with the one screw. Other than that we love it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert L",
          "Nb_Reviews": 1,
          "Date": "2022-08-06T22:18:30.000Z",
          "Titre": "Great Visor",
          "Contenu": "The product came in on time and works great! Although there are manual instructions that came with it, there should be an online video showing how to install the spacer (specific video for Samsung and one for GE) and visor all together. Otherwise, great product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allan",
          "Nb_Reviews": 4,
          "Date": "2022-07-18T15:21:43.000Z",
          "Titre": "Micro visor hood ext",
          "Contenu": "The visor was straight forward installation, fit and finish was excellent, and appearance is very good.  The hood does help with exhausting cooking service, and should protect cabinet surfaces above microwave, but exhaust volume is built into microwave and would improve service if it could be increased…."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Martin Blais",
          "Nb_Reviews": 2,
          "Date": "2022-06-20T19:26:07.000Z",
          "Titre": "Well the hood fits but not prefect.",
          "Contenu": "Well the hood fits but not prefect.I see now that I will have to take the screws out each time to clean the filters.I do wish that it fit more level but the bracket sits on a ridge on the bottom of my Sharp microwave and makes it sit higher in the front.It does seem to catch more of the smoke though and so the house is not as smoky inside."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Douglas",
          "Nb_Reviews": 6,
          "Date": "2022-06-22T16:38:49.000Z",
          "Titre": "Great idea, hope it works as well",
          "Contenu": "Installation per the video is as easy as it looks; the written instructions are a bit more confusing.  The black stainless steel perfectly matched our LG microwave.  The mounting bracket seems solid, but the hood itself is a trifle flimsy.  Haven't really had a chance to evaluate its effect on steamy, greasy foods, but the theory seems good.   Looks great.  Even if it works as well as hoped, and adds a little more to clean, it'll be worth reducing the smoke etc. when cooking.   Great idea, hope it's as good in practice!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angela Hill",
          "Nb_Reviews": 12,
          "Date": "2022-05-01T21:24:36.000Z",
          "Titre": "It works to keep fumes from hitting ceiling",
          "Contenu": "The product works well,keeping fumes from cooking away from ceiling when using microwave fan. It was easy to installed ( check YouTube for tips ) we used didn't use screw included in kit,they were too long we just used existing screw on microwave worked out perfect). I think the price is a little high for the sheet metal. Other than that product works."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barbara Ireland Mojica",
          "Nb_Reviews": 2,
          "Date": "2022-03-19T19:35:13.000Z",
          "Titre": "Seems to be a good solution...",
          "Contenu": "The product was well-packaged and arrived in good condition. The shipping was pretty quick.The hood was easy to attach but a bit thinner than I anticipated. The filtration system seems to work well. I hope that it continues as time goes on. My microwave did not do a good job and smoke was traveling up to my wall cabinets. The Microvisor hood seems to be a good solution so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Delirio",
          "Nb_Reviews": 1,
          "Date": "2022-03-19T21:17:43.000Z",
          "Titre": "Microvisor Review",
          "Contenu": "The design of the product was good and was easy to install under the microwave.  My only problem was that the sides and front corners of the hood on opposite sides had blemishes on the stainless steel which I’m not sure why it was like that.  Hopefully it wasn’t a re-packaged return I received.  I didn’t want the hassle of having to return it and going through the process so I decided to keep it.  Don’t expect perfection."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph Castrigno",
          "Nb_Reviews": 1,
          "Date": "2022-03-12T16:26:02.000Z",
          "Titre": "Screws provided were too long",
          "Contenu": "Screws provided were too long; screws removed form microwave were then too short. There were two dimples on the microwave that prevented  a flush fit for the visor mount, so there is a space between the microwave and the hood mount that allows steam to escape.  I had to put an extra spacer in to get a straight fit.  However, using the hood worked reasonably well for the intended purpose.  I will need to fill the space between the hood mount and the microwave."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Froy Dela Cruz",
          "Nb_Reviews": 2,
          "Date": "2022-02-21T15:55:09.000Z",
          "Titre": "For its use of covering the whole range…",
          "Contenu": "For its use of covering the whole range and its burners, I say it does do the job. And although it is not applicable to all, we, as asians who is not well gifted with height, getting and using the microwave above it seems to awkward. Still its a cost efficient way instead of installing and range hood and relocating your microwave."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "TomD",
          "Nb_Reviews": 3,
          "Date": "2022-05-10T15:52:23.000Z",
          "Titre": "Almost perfect...except for",
          "Contenu": "works pretty well. I have a low profile over stove microwave and the hood is about 4\" too short to cover the whole area under the microwave. My Microvisor Hood needs a couple side extensions to resolve the issue. Otherwise this hood would be perfect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TARA DHUPER",
          "Nb_Reviews": 2,
          "Date": "2022-02-15T23:41:38.000Z",
          "Titre": "The product do what it says it does-…",
          "Contenu": "The product do what it says it does- add about 6 inches of additional \"hood\" to capture most of oil fumes. I'd say the price is little too much for the stuff, but hey it's free market, demand and supply balances the price, so no complaints.Very easy to attach under the microwave, it took me less than 10 minutes. Still trying to getting used to of it as it is little discomfort to work with this hood on, especially on the rear burners, but will get there soon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Bracewell",
          "Nb_Reviews": 1,
          "Date": "2022-02-07T17:06:31.000Z",
          "Titre": "Great Idea",
          "Contenu": "In general excellent. The only issue I had with the unit was the slot you have to put the screw through to attach the mounting bar is just a little small for two reasons. One holding the screw with your fingers and guiding it into the microwave screw hole and two i was using a small kit screw driver (was not at my house) and the screw driver head mount was to large to fit through the slot by about a 1/16 or 1/8 inch. Having a slightly wider slot would really help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Justin H.",
          "Nb_Reviews": 1,
          "Date": "2022-01-11T03:48:17.000Z",
          "Titre": "Good Construction - Attachment Annoyances",
          "Contenu": "I think the construction is good. I might see if I can add some washers under the screw heads as the slot is nearly the size of the head of the screw. I don't like the plastic spacers. I understand their necessity since my microwave has the nubs on the bottom. I may drill out those holes if I think the gaps hinder performance. Overall I'm happy though and we'll see how it performs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bonnie B.",
          "Nb_Reviews": 2,
          "Date": "2022-06-10T13:49:27.000Z",
          "Titre": "This works almost perfectly",
          "Contenu": "This works almost perfectly. With a pot of water boiling for spaghetti, a little steam escapes out from the sides. That being said, I would say 98% of the steam goes where it is supposed to go, so I am very happy. No more drying the microwave face and the cabinet above. My issues are: 1. The entire edge all the way around is sharp, which is really dangerous. 2. As others have stated, it is expensive for what you get. 3. I don't like the fact that if you install it you are no longer eligible for a refund. The only way to see if it is going to work is to install it. My opinion, that is not a good company policy to have. All in all, would I purchase it again....yes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Doug",
          "Nb_Reviews": 1,
          "Date": "2022-06-05T20:02:50.000Z",
          "Titre": "My micro visor was easy to install",
          "Contenu": "My micro visor was easy to install, does exactly the job that it was intended for catching all of the cooking steam and vapor coming from the pots, and doesn't look bad either, I am going to enjoy this for years to come."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joel Lora",
          "Nb_Reviews": 2,
          "Date": "2022-04-27T16:39:40.633Z",
          "Titre": "Good unique product to extend microwave…",
          "Contenu": "Good unique product to extend microwave exhaust coverage over the stove. My only concern Is that there is only one screw to support hood to its support bracket. So it feels lose to the touch. It may need  at least 3 screws to be properly supported."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael D'Acunti",
          "Nb_Reviews": 2,
          "Date": "2022-09-25T16:51:26.000Z",
          "Titre": "So Far so good!",
          "Contenu": "I only used it once but thus far it meets all expectations, I do like the fact it keeps smoke blowing all over our kitchen."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Stein",
          "Nb_Reviews": 1,
          "Date": "2022-09-10T16:01:43.000Z",
          "Titre": "I love the product and it was easy to…",
          "Contenu": "I love the product and it was easy to install. It would have a much better look if the ends of the spacer and attachment pieces were closed"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward",
          "Nb_Reviews": 3,
          "Date": "2021-10-20T18:06:57.000Z",
          "Titre": "Great product!",
          "Contenu": "This is a great addition to increase the effectiveness of the fan a lot. It does obscure the vision of the rear burners if you are tall. The single screw holding the shield in the bracket  does not keep enough tension on the shield to keep or from moving, although that is not a major concern. The part is well made and finished. I’m very happy with this product!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Siva",
          "Nb_Reviews": 3,
          "Date": "2022-01-18T23:14:58.000Z",
          "Titre": "Great Product, Canadians may have to pay for shipping",
          "Contenu": "Great Product. Not only makes your over-the-range microwave efficient but also reduces the cooking smell in the kitchen. My wife was skeptical but now she is very happy with the purchase. The price kept me away from buying (129USD) since I can buy a brand new microwave for 299CDN. The price could be lower for such a simple solution. Shipping to Canada is also expensive(45USD). I wish they open a Canadian outlet and ship it free for Canadians as well. If you need a good deal, buy refinished product (sold as, \"less than perfect product\")."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 2,
          "Date": "2022-05-28T16:47:05.000Z",
          "Titre": "Item shipped quickly and was easy to…",
          "Contenu": "Item shipped quickly and was easy to install. It works as advertised—but don't expect miracles! Ambitious cooking sessions (i.e., anything with high heat) will likely still flood your kitchen with smoke."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles Sayre",
          "Nb_Reviews": 3,
          "Date": "2022-05-02T16:13:06.000Z",
          "Titre": "FAST EFFICIENT DELIVERY",
          "Contenu": "FAST EFFICIENT DELIVERY. A LITTLE HARDER TO INSTALL THAN STATED. DOES SEEM TO HELP WITH STEAM & SUCH HOWEVER YOU HAVE TO BE CAREFUL NOT TO HIT YOUR HEAD ON IT. ALSO NOT REAL STABLE BUT CAN BE FIXED TO BE MORE STABLE"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Aussies White",
          "Nb_Reviews": 11,
          "Date": "2022-03-30T07:09:58.000Z",
          "Titre": "Expensive but Recommended!",
          "Contenu": "Personally, I thought it was slightly expensive. I appreciate this product and obtained it on time as said in the order. It's quite easy to set up, and it works perfectly. Thank you very much for creating such a great brand."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Billy",
          "Nb_Reviews": 2,
          "Date": "2021-09-06T16:57:46.000Z",
          "Titre": "Service was great",
          "Contenu": "Service was great. They notified me as my order progressed through their system until it was finally delivered. The only thing I docked them a star on was that I didn't get an estimate of the delivery until AFTER I placed my order. I wasn't sure if I was gonna get it in 1 week or 3 months which did scare me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Witten",
          "Nb_Reviews": 5,
          "Date": "2022-08-11T06:44:28.000Z",
          "Titre": "Really like it",
          "Contenu": "Really like it. Works well. Just wish it was not so lightweight and bendable. It’s very easy to be bent. One wrong grab from someone and it’s a goner."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Bruce Dodds",
          "Nb_Reviews": 1,
          "Date": "2021-08-03T16:03:30.000Z",
          "Titre": "The hood does just what it is intended…",
          "Contenu": "The hood does just what it is intended to do - extend the exhaust fan's reach, keeping grease off my cupboard doors above.  Because I have a GE microwave with a curved bottom on the door I needed to use the longer bushings to accommodate this, resulting in a certain amount of play if you wobble the hood.  Also, I look forward to the day when Americans discover the joys of Robertson head screws rather than the vastly inferior Phillips heads - it would have made installation so much easier!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Austin Kimbrell",
          "Nb_Reviews": 1,
          "Date": "2021-03-18T15:09:13.000Z",
          "Titre": "Microvisor's product is great",
          "Contenu": "Microvisor's product is great - very happy with delivery, installation instructions were good, product does as expected and advertised. Only thing I am dissatisfied with is spacing between the hood and cooktop - a shorter visor would allow for larger spacing and ease of access to the cooktop. Maybe something to consider for the next iteration of the product"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Buck",
          "Nb_Reviews": 1,
          "Date": "2022-07-12T23:47:38.000Z",
          "Titre": "stick out",
          "Contenu": "My only complaint, it tends to stick out too far. Can't see the pots in the back very well. Does a great job at channeling the steam, and smoke, heat up the vent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gayle Regalia",
          "Nb_Reviews": 1,
          "Date": "2021-01-11T18:27:14.000Z",
          "Titre": "It was easy to install just as…",
          "Contenu": "EDIT: As stated below, my microwave CFM may play a part in the performance! I am following up with that information as suggested by Microvisor Hood.It was easy to install just as promised. I don't think it helps too much though. For the cost of such a simple design, I would rethink the purchase. However, the purchase was easy, delivery was quick and installation took me all of 5-10 minutes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brooklyn home cook",
          "Nb_Reviews": 1,
          "Date": "2021-02-08T15:50:45.000Z",
          "Titre": "Elegant solution",
          "Contenu": "The Microvisor Hood is an elegant and cheap solution to the design flaws built in to the microwave vents above stoves. It would be improved by having it extend just 1.5\"  more, based on my observation of the smoke. Still, it does capture far more than it used to, and my fire alarm doesn't go off every time I cook something at high temperature."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-01-12T00:14:18.000Z",
          "Titre": "Easy to install"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nomer fernandez",
          "Nb_Reviews": 3,
          "Date": "2022-02-12T05:02:51.000Z",
          "Titre": "Great product",
          "Contenu": "Great product. Installation was a breeze. It does what it is intended to do. The center lock screw is nice, but would be nicer if it is a thumb screw. A little bit pricey though but highly recommended."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Babu",
          "Nb_Reviews": 2,
          "Date": "2021-03-15T15:36:18.000Z",
          "Titre": "Gr8 Concept",
          "Contenu": "Gr8 Concept, works as expected but I wish the edges were not left that sharp, I'm always scared thinking I might hit the edge and get hurt while working on kitchen. I have the Samsung Microwave, as per the descriptions on the product I ordered the spacer but while using spacer it didn't look neat as the gap between the microwave and hood looked bigger but I can manage to fix without using spacer and thought to return the spacer as it was separate item but nope.... it is not amazon, no returns for the small spacer unit, I know it is not expensive but will go on trash without making any use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lacarl Lander",
          "Nb_Reviews": 4,
          "Date": "2021-05-03T14:26:29.000Z",
          "Titre": "Great idea",
          "Contenu": "All in all, it is a great idea and a decent product. However, the edges are sharp and can injure someone. A suggestion would be to \"roll\" the leading and side edges to avoid slicing/cutting someone. Might avoid some inherent legal issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Doug Greer",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T22:24:33.000Z",
          "Titre": "It does draw a lot better now that I installed the visor!!!",
          "Contenu": "It does an amazing job on the cooktop vent!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sue Cork",
          "Nb_Reviews": 1,
          "Date": "2022-03-27T13:44:02.000Z",
          "Titre": "I like it to keep grease off my…",
          "Contenu": "I like it to keep grease off my microwave. Trying to get used to how far it sticks out from the microwave Does do what they claim. Great service and attractive in my kitchen."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Niegemann",
          "Nb_Reviews": 2,
          "Date": "2021-11-01T01:41:36.000Z",
          "Titre": "Product is good quality and works fine",
          "Contenu": "Product is good quality and works fine. It might be nice if more shapes and sizes were available. I would recomnend it for people who are tired of steam and odors getting all over their kitchens."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Satisfied customer",
          "Nb_Reviews": 3,
          "Date": "2021-11-07T15:06:08.000Z",
          "Titre": "It does what it’s supposed to do",
          "Contenu": "It helps to channel the steam to the bent when cooking but the only thing is that it can get in the way when cooking so you may need to remove it from time to time. It does easily slide out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Luis Arroyo",
          "Nb_Reviews": 2,
          "Date": "2020-12-15T20:16:04.000Z",
          "Titre": "Good product",
          "Contenu": "I give it 4 stars just cause you can tell it’s an aftermarket fit. The hood sticks way out and it wobbles a little due to the fitting for Samsung microwave.   Would had liked for the hood to be adjustable back and forward."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 3,
          "Date": "2021-04-19T19:15:59.000Z",
          "Titre": "Almost Perfect",
          "Contenu": "It does what it’s supposed to in that it catches about 75% of the smoke emitted. If it caught 100%, I would have given a 5-star review.$129.99 (price paid) = catches 100% of smoke $99 = catches 75% of smoke"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Judith Kemp",
          "Nb_Reviews": 1,
          "Date": "2021-02-07T04:10:25.000Z",
          "Titre": "I love the hood!",
          "Contenu": "I love the hood!! My only complaint is that the stainless steel edge is very sharp and my fingers are easily cut. Just a little blunting on the edges would make the product perfect. Thanks for making this product!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Ganan",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T17:29:17.000Z",
          "Titre": "The hood serves its purpose and looks…",
          "Contenu": "The hood serves its purpose and looks good above the stove. A bit flimsy when hanging on the microwave, might need another way to secure it firmly otherwise its great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Krishna P",
          "Nb_Reviews": 1,
          "Date": "2021-11-01T14:45:15.000Z",
          "Titre": "Happy customer",
          "Contenu": "We have exhaust fan through in cabin microwave and it is not powerful enough to remove all the vapors from cooking. This spreads smell across the house or deposits oil droplet marks on the upper cabinets. I have been searching internet for a good solution and stumbled upon MicroVisor extension. We were skeptical as this product is not sold on Amazon. However MicroVisor delivered this product within a week as advertised. It is a simple and elegant idea, easy to install, right away we can see the effectiveness. We really like the product.A few things to improve:1) MicroVisor edges are little sharp and smoothening them will make better user experience while installing.2) Center lock screw doesn’t come off easily.Looking forward for motorized MicroVisor extension. Great product and good service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vinod Panicker",
          "Nb_Reviews": 1,
          "Date": "2021-04-05T13:50:02.000Z",
          "Titre": "Product is good and works as expected",
          "Contenu": "Product is good and works as expected. It perfectly fits my microwave and installation was easy as well. The edges in front are very sharp and needs to be careful particularly for short people"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Flowers",
          "Nb_Reviews": 1,
          "Date": "2022-02-22T12:28:13.000Z",
          "Titre": "Fantastic low cost visor",
          "Contenu": "Packaged well and delivered very quickly. Assembly was extremely easy, just screw the mount into the bottom of your OTR microwave and then insert the visor and the locking pin. Less than 5 minute install.My only complaint is that the single locking pin between the visor and the mount doesn't hold the visor completely steady. Hitting the edge of the visor gives it a noticeable amount of wobble, and there's a small amount of in-and-out play in the visor when mounted. You can push/pull it ever so slightly around after it's been mounted and secured.Functionally this thing does exactly what it's supposed to. It very clearly helps capture steam and move it towards my microwaves fan when cooking on the stove top. I recommend this product, although I would like to see an additional security pin for the visor to the mount. The single pin doesn't hold it as securely as I'd like."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Witten",
          "Nb_Reviews": 5,
          "Date": "2022-08-15T16:56:50.000Z",
          "Titre": "Great product but cheaply made",
          "Contenu": "Great product but cheaply made. Material is very lightweight and wobbly but it does what it advertised."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer W. B. Shull",
          "Nb_Reviews": 3,
          "Date": "2022-10-25T03:32:20.000Z",
          "Titre": "Shipped quickly and received four days after placing order.",
          "Contenu": "Easy to order, quickly received, easy to install."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "VISWANATH",
          "Nb_Reviews": 2,
          "Date": "2021-04-20T00:50:39.000Z",
          "Titre": "catches 85%",
          "Contenu": "It does not catch all smoke, but it catches 85% of it, which is enough to maintain the cabinets neat longer. if they make it any bigger then it will hit the face of the chef"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barry Mathis",
          "Nb_Reviews": 3,
          "Date": "2021-08-02T23:27:57.000Z",
          "Titre": "Service was good",
          "Contenu": "Service was good, don't like how its not free returns.  And don't like the fact they keep the product if its been installed.  You lose twice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Rice",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T18:57:24.000Z",
          "Titre": "Hood came quickly",
          "Contenu": "Hood came quickly, was easy to install. Looks good and does what it was designed for."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Dalechek",
          "Nb_Reviews": 1,
          "Date": "2022-04-25T19:28:20.338Z",
          "Titre": "FOund it helpful for short people and…",
          "Contenu": "FOund it helpful for short people and collecting front burner steam from food.Need more time to access other issues"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven Mark Whitney",
          "Nb_Reviews": 2,
          "Date": "2022-10-11T16:39:21.000Z",
          "Titre": "it is working wish it extended 2 more…",
          "Contenu": "it is working wish it extended 2 more inches"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DORIS A",
          "Nb_Reviews": 3,
          "Date": "2022-01-16T02:37:54.000Z",
          "Titre": "The hood does divert smoke/oils very…",
          "Contenu": "The hood does divert smoke/oils very effectively.  As to style I think I will remove when having company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yanel Fuentes Cortes",
          "Nb_Reviews": 1,
          "Date": "2022-04-17T19:26:58.000Z",
          "Titre": "I would like the branding sticker…",
          "Contenu": "I would like the branding sticker opcional. Mine doesn't have and I think is nice."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Mentor",
          "Nb_Reviews": 5,
          "Date": "2021-05-12T13:53:37.000Z",
          "Titre": "Easy to install",
          "Contenu": "Easy to install, less than 5 minutes all done. Looks great and appears to do what it is intended to do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh inzelbuch",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T21:45:28.000Z",
          "Titre": "Installation was very easy",
          "Contenu": "Installation was very easy. I would suggest a video or better photo show g how to attach the adapter piece. Makes my hood look like the expensive hoods used in commercial operations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Mulka",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T01:09:14.000Z",
          "Titre": "Easy install!",
          "Contenu": "I'm not a \"handy\" guy (thought I'm not totally incompetent either), but the removable visor was EASY to install. It took just a few minutes.I got tired of my microwave door getting so much condensation buildup while boiling pasta, but this completely eliminates that! And it looks great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Schoeppner",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T00:00:04.000Z",
          "Titre": "Solid Construction: Reasonable Installation",
          "Contenu": "George, just received and installed your touted Microvisor retractable hood. It's every thing you said it would be, namely quality in construction. The rear attach magnet concept is ingenious!! Makes it a one guy operation. Do have one suggestion, the knurled height setting knobs would be easier to access/tighten if they were keyed for an Allen wrench....a small item in an otherwise superb design. Also, was impressed with packaging. Solid box, no dings or dents!! Again, as when I ordered, being able to watch the videos and correspond directly with you was/is a major plus. Take care...and may sales take off. John Schoeppner, AF Major General-retired"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Warren",
          "Nb_Reviews": 3,
          "Date": "2023-07-13T00:21:43.000Z",
          "Titre": "The finish and fit are extraordinary",
          "Contenu": "The finish and fit are extraordinary. The corner brazing at the front is nearly imperceptible, with a fine polish on the view side. The holes line up with ease due to the long slots. I did swap out the mounting 3/4 inch screws for 1/2 inch ones, which had plenty of turns before bottoming out and tightening. I was not sure if going 3/4 inches into our microwave  would get close to anything electrical inside. I am very impressed by the detail built into the visor. Smooth edges, very good stainless steel thickness, and a threaded knurled screw which locks the visor in place, once the receiving nut is engaged.Finding the shorter screws took longer than installing the unit. The look is classy, and my wife is happy with its appearance and function."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Hepworth",
          "Nb_Reviews": 3,
          "Date": "2023-02-20T20:53:25.000Z",
          "Titre": "Just what we needed!",
          "Contenu": "The Microvisor hood arrived on time.  The installation instructions were clear and easy to follow.  I was able to install it in about 20 minutes with nothing more than a Phillip's head screwdriver.  We were having a problem with grease attaching itself to the cabinetry near the stove whenever we fried anything.  It has been two weeks now and the problem seems to be eliminated.  It was exactly what we needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 3,
          "Date": "2022-12-22T16:56:15.000Z",
          "Titre": "We have a large 1930 O'Keefe and…",
          "Contenu": "We have a large 1930 O'Keefe and Merritt stove that sits a bit too far out from our overhead microwave to collect heat and steam in the fan. Microvisor Hood helped divert all that to the back of the fan in the microwave keeping the microwave much cooler. Installation took all of 10 minutes and couldn't be happier. Packaging was excellent which protected the hood with much thought in today's handling of packages."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Rizzo",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T02:45:14.000Z",
          "Titre": "Definitely recomend!",
          "Contenu": "Purchaed online and was able to figure out the right model I needed with ease from the dimensions shown for each product. Shipping was lightning fast, arrived the next day. Installation was a breeze and was able to put it on by myself without assistance. Tested and it really does work, all steam/ smoke was captured and drawn up the microwave vent as advertised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "felix sanchez",
          "Nb_Reviews": 2,
          "Date": "2023-02-04T19:33:26.000Z",
          "Titre": "Stylish Microwave Visor",
          "Contenu": "This well made stylish microwave oven visor does a great job of deflecting the steam and smoke into the vents of our microvave. This product was something that was sorely needed for our kitchen. Most importantly it installs in minutes and looks so darn good. Thank You MicroVisor!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JC",
          "Nb_Reviews": 2,
          "Date": "2023-02-13T00:44:45.000Z",
          "Titre": "Good hood extension",
          "Contenu": "Hood extension works very well, as long as the microwave fan has a high cfm draw, and is vented to the outdoors. The fan on my microwave is ~400 cfm and vents directly out of the kitchen wall to the outdoors. The hood extension helps direct the cooking fumes to the fan and eliminates about 80% of smoke/fumes that would otherwise come into the kitchen area."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JoeV",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T21:58:13.000Z",
          "Titre": "Easy Install",
          "Contenu": "Wife saw the advertisement and wanted more information. Looked 0nline, read reviews. Apparently Microvisor customer service could use some additional training. Luckily I didn't need to call for any additional help. Install was a breeze. Only NEGATIVE is you have to get used to the overhang. You keep hitting your head until,,you get used to the hood being there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Waters",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T05:52:05.000Z",
          "Titre": "Built with Quality",
          "Contenu": "Our microwave sets over our range.  When cooking something on the range, the smoke used to set the smoke detector off quite often. Since we installed the Microvisor, it has the ability to capture the smoke when the exhaust fan is on because of the way it extends out more to the front of the range.  also, the quality of the metal lends to the rigidity of the product, making it a product that will last a while. Very well made."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ross Bigler",
          "Nb_Reviews": 2,
          "Date": "2022-12-19T19:30:12.000Z",
          "Titre": "Product is good",
          "Contenu": "Product is good. This can take anywhere from 15 minutes to an hour to install including reading the instructions. I did have a problem lining the 3 holes up with the screws and that is because it's almost like working on plumbing under a sink. You just cannot get your head turned to see everything under the hood that you are screwing in. So, if you cannot feel the screw go into the hole, it can be difficult."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judith Karen  Ulchinsky",
          "Nb_Reviews": 2,
          "Date": "2022-11-27T21:02:38.000Z",
          "Titre": "Microvisor is a great product!  It works!",
          "Contenu": "I have a new house and the microwave is open over the stove. Every time I cooked anything 2 fire alarms went off. I was looking for some solution and came across your product Microvizer. It seemed like a really good thing so I bought it.  I am thrilled that it works perfectly.  (And will be recommending it to the builders of my home).  It cleans easily.  I also bought the light that works great! Install took less than five minutes.  I recommend using a dry erase or marked tape to show where fastener screws are to be attached."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CHARLES KYLE",
          "Nb_Reviews": 3,
          "Date": "2023-02-19T01:54:17.000Z",
          "Titre": "Just as advertised...",
          "Contenu": "The hood arrived in perfect condition. The directions were understandable and easy to follow. Install took less that 1/2 hour and the product not only looks good above the stove, but functions exactly as advertised. Kudos to Microvision!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Berry",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T14:28:43.000Z",
          "Titre": "I used the video to instal mine and…",
          "Contenu": "I used the video to instal mine and that made it very easy for me, I did not use the spacers for my microwave.  It looks great and it does capture ALL of the smoke coming from the burners.  I now get released into the house the filtered smoke which is so much better than before, I now do not have yellow greasy cabinets above and near the microwave.  My microwave exhaust does not release to the outside."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vanessa Guy",
          "Nb_Reviews": 2,
          "Date": "2023-02-05T22:48:26.000Z",
          "Titre": "I love my Microvisor",
          "Contenu": "We had the greatest experience with Microvisor Hood. First of all, it is a great product. In one day, I noticed how clean my cabinets remained after cooking dinner. The hood is so easy to assemble and to disassemble for cleaning purposes. So happy with our purchase!Second, the hood had a dent. Reached out to Microvisor and they immediately sent us a new hood."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara Williams",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T21:48:45.000Z",
          "Titre": "The Microvisorhood is one of the Best Inventions!!!",
          "Contenu": "The Microvisorhood is one of the Best Purchases I have made in a long time..The Microvisorhood is most effective when steam rising to the fan vent and would hit the microwave also.. It prevents that from happening. Therefore protecting the microwave from the heat that would cause cracks in the frame of the microwave…  The Microvisorhood is very, very easy to install..,Shipping was speedy, it arrived in 3 days…I am so very Happy I found the Microvisorhood"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robin",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T18:39:11.000Z",
          "Titre": "Definitely worth buying!",
          "Contenu": "After reading the reviews on the microvisor we decided to give it a try. It arrived 5 days after our order and was packed very securely and in excellent condition. Installation was a breeze and it performed as advertised. We are very very happy with it!  Looks great and does the job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T02:59:35.000Z",
          "Titre": "The microvisor arrived quickly",
          "Contenu": "The microvisor arrived quickly, was well packed, easy to install, and looks great. I confirmed with a smoke stick that it does indeed help my microwave vent fan do a better job at catching fumes from the front burners of my stove."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Etienne",
          "Nb_Reviews": 2,
          "Date": "2022-12-28T19:33:17.000Z",
          "Titre": "FANTASTIC.  HIGHLY RECOMMEND.  Every time we would cook previous to…",
          "Contenu": "Every time we would cook previous to the Microvisor Hood, there was so much smoke even with fans running to try to push it out the door.  Now I have NO smoke at all.  This is a blessing and I highly recommend it to everyone who experiences constant smoke alarms when cooking."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Henry Bey",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T02:24:01.000Z",
          "Titre": "I'm a retired contractor and can't…",
          "Contenu": "I'm a retired contractor and can't begin to tell you how many kitchens I've installed over my 50-plus years in business. So when I saw your product, I needed to try it. We were tired of having our fire alarm going off even with the fan on high. Once installed, the problem was solved. Not only that, but I learned the exhaust fan would come on automatically when the temperature got too high. Great product would recommend it highly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Horstmeyer",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T17:19:07.000Z",
          "Titre": "On time delivery and packaged to…",
          "Contenu": "On time delivery and packaged to prevent damage. More importantly the micro visor 100 percent does the job. I haven't set off smoke alarms since. Time to install definitely fell within the 5 minutes advertised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neilson Ocampo",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T21:52:10.000Z",
          "Titre": "The product is great",
          "Contenu": "The product is great, took me a while to find it though. I had been searching for something like this for quite some time. Purchasing was easy and delivery was quick. There was an issue with installation that I called about and the support person was able to assist by sending me a specific screw I needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eddie Kist",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T03:56:45.000Z",
          "Titre": "Great invention. works great",
          "Contenu": "Quality product looks great on the Microwave. (Kitchenaid microwave and stove) fast shipping very easy install. Works as advertised."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Andrew Walters",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T07:26:42.000Z",
          "Titre": "Great item",
          "Contenu": "(Standard Stainless Model) Really appreciate the look and craftsmanship of this product. Agreeably with other reviews the price is a tad steep but quality doesn't come cheap.Fast shipping, no damage, easy install. Overall highly recommend the hood, Satisfied Canadian resident."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Suneed Shaikh",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T23:44:00.000Z",
          "Titre": "Great product",
          "Contenu": "Great product. Works as advertised. Looks OEM like it came as part of the microwave. Wife approved. Prevents the oil/steam from getting on to cabinets. Does require a wipe down every couple of uses, but a regular hood vent requires that as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendy Johnson",
          "Nb_Reviews": 2,
          "Date": "2023-02-22T01:42:06.000Z",
          "Titre": "I love my new Microvisor!",
          "Contenu": "My Microvisor was delivered in a timely manner.  The installation was very easy, just as advertised.  I  love it! The visor performs perfectly sending all smoke and grease directly to the microwaves filters. No more ceiling stains."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sathish kumar jojoday rajendra",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T18:52:08.000Z",
          "Titre": "This hood is stopping all moisture to…",
          "Contenu": "This hood is stopping all moisture to go up. Using the same microwave with out disturbing the kitchen really nice. Defentely recommend for those who dont want to remodel the kitchen."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Grounard",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T07:01:48.000Z",
          "Titre": "Since installing the microvisor hood",
          "Contenu": "Since installing the microvisor hood, it seems the cooking fumes are more contained at the stove.  The real test will be when we clean the tops of our overhead cabinets."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chuck Mancini",
          "Nb_Reviews": 2,
          "Date": "2022-12-12T15:13:41.000Z",
          "Titre": "Great product,Simple installation!",
          "Contenu": "actually, this is a great product.  Well made, responsibly packaged.  Arrived quickly!  VERY easy to install.  Works as described.  Our cabinet above the microwave used to get condensation when we were boiling anything  on it before the MICROVISOR was installed.  After installing the MICROVISOR just before Thanksgiving we were able to see the benefits of having the MICROVISOR.  No more condensation!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nomad",
          "Nb_Reviews": 3,
          "Date": "2022-12-07T21:06:05.000Z",
          "Titre": "Great product.",
          "Contenu": "For the first time, I did not set off smoke alarm when I seared chicken.  My new microwave just doesn’t have enough power to adequately vent the smoke.  I have recommended this product to family and friends who experience the same problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Jablecki",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T00:41:16.000Z",
          "Titre": "It does what it promises",
          "Contenu": "It does what it promises.  Looks and works great.  However it was a little difficult to line up and install the screws.  My advise if you buy a new microwave install the visor bracket before mounting the microwave."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marian Cristea",
          "Nb_Reviews": 1,
          "Date": "2022-11-27T20:15:46.000Z",
          "Titre": "Very practical",
          "Contenu": "Very practical , helps a lot to collect the smell from cooking underneath , nice and neat , easy to install .I recommend to all who is having a cooktop underneath the microwave for this reason"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barry Bartos",
          "Nb_Reviews": 1,
          "Date": "2022-12-25T23:50:24.000Z",
          "Titre": "I had a problem with my Microvisor hood…",
          "Contenu": "I had a problem with my Microvisor hood due to shipping damage and customer service contacted me almost immediately and shipped another unit that is fine. The product works great because I have a couple of hot sauce recipes that require boiling jalapeño peppers and the fumes are very potent if they don't go up the vent. The Microvisor Hood met all my exceptions. Great customer service is refreshing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-01-01T17:56:14.000Z",
          "Titre": "Hood Ecperence",
          "Contenu": "We have a vented microwave hood.  This product arrived quick,  packaged well and I am pleased.  It works exactly as described.  Our cabinets are staying moisture and grease free."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy P",
          "Nb_Reviews": 4,
          "Date": "2022-12-15T01:21:32.000Z",
          "Titre": "Best invention ever!",
          "Contenu": "First I love your idea for microwave hoods! OMG!!! Thank you for such great customer service. The delivery company I think UPS damaged it during delivery and I emailed your company and within a few days I had the new bracket. So Thank you very much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Microbe",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T16:30:13.000Z",
          "Titre": "Great looking extension for a fantastic price",
          "Contenu": "This hood extension covers the area that was not covered by the vacuum created by the microwave fan. It allows that vacuum to capture the vapors and remove them.     Additionally the extension covered the lights which were obvious and not stylish on the microwave. It was relatively easily installed and impressed my  significant other who does most ( read as all) of the cooking.     We purchased the damaged extension and although we could identify a small rise in the bending of the extension it was excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Delos",
          "Nb_Reviews": 3,
          "Date": "2022-12-03T16:33:07.000Z",
          "Titre": "Great support and product..",
          "Contenu": "I thought there product Microvisor Hood was very unique.   I ordered one and when I received it it had a dent in the front.  Contacted customer service and immediately they sent a replacement.  I received the second one in a few days.  It is easy to install and looks great.  Great company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathleen Scott",
          "Nb_Reviews": 2,
          "Date": "2023-03-11T20:52:55.000Z",
          "Titre": "One minor detail...",
          "Contenu": "I received my order on a timely basis.  It sat unopened for two weeks, decided to open it and realized I needed my trusty son-in-law to install it.  He did a couple weeks later and it is now a functioning object."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DANNY",
          "Nb_Reviews": 3,
          "Date": "2023-02-14T05:04:22.000Z",
          "Titre": "Supplying and Filling a need !! Long Time Coming !!",
          "Contenu": "Supplying a need !!! This is a GREAT idea that fills a need !!!! This product WORKS !!!!! Long time coming !!! Phone experience was great , Talked to George, very helpful !!!!   Product was so very easy to install !!!!  Would definitely recommend this product !!!!!  TKS, George !!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WF",
          "Nb_Reviews": 2,
          "Date": "2023-02-20T03:49:18.000Z",
          "Titre": "Bought a returned unit and was…",
          "Contenu": "Bought a returned unit and was apprehensive that the hood might have problems when it arrived. But when I opened the box I was pleasantly surprised, it looked brand new. I  got to finally try it today and it works just as it was described. Takes some getting used to but it works and looks great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Henley",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T17:11:29.000Z",
          "Titre": "Received my first hood bent",
          "Contenu": "Received my first hood bent. These folks immediately sent me a second one, no charge!  It fits perfectly and does a great job.  No more smoke alarms when we're cooking steaks!  Thanks Microvisor!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Marcozzi",
          "Nb_Reviews": 2,
          "Date": "2023-02-20T12:19:26.000Z",
          "Titre": "Does what it said it would do",
          "Contenu": "Does what it said it would do! Easy to install! Nice that it's easily removable because depending on your range set up, you can't see your controls."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 3,
          "Date": "2023-03-19T18:02:26.000Z",
          "Titre": "Got a great deal on an imperfect hood…",
          "Contenu": "Got a great deal on an imperfect hood that I somehow cut down to 24\"ish pretty darn straight with a sawzall and installed neatly saving my fresh paint in kitchen from the smoke signals I send searing meat."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald Teseniar",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T22:09:50.000Z",
          "Titre": "I decided to purchase the micro visor…",
          "Contenu": "I decided to purchase the micro visor for my wife. She absolutely loves it. We upgraded our appliances to stainless steel and got the micro visor in stainless steel to match it. It works great  so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Thurmon",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T20:27:49.000Z",
          "Titre": "You'll wish you had it years ago.",
          "Contenu": "It's easy to install. It matches the metal on the microwave perfectly. It does exactly what it's advertised to do. You need this well made effective product and you'll wish you had it sooner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol M.",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T20:25:43.000Z",
          "Titre": "Very satisfied",
          "Contenu": "Product was as described. Well made and easy to install. Customer service was well informed of their product. No problems at all; would definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane Scott",
          "Nb_Reviews": 6,
          "Date": "2023-02-01T20:29:14.000Z",
          "Titre": "Solved a major smoke issue in my kitchen",
          "Contenu": "I have a retractable vent at the back of my stovetop. For years, I have dealt with smoke escaping from the stovetop when I use multiple burners, to the point where it sets off the smoke alarm. I ordered the Microvisor Hood, and the package arrived on time and in perfect condition. The frame was easy to install, and the visor extends from the microwave out to the edge of the stovetop. I am 5'9\", and the visor does not impede my ability to see all the burners when I am cooking. Then I started cooking.  I am very pleased to say that the visor did a fabulous job redirecting the smoke from all my pans to the vent at the rear of the stovetop. I honestly did not expect such a drastic improvement, but for my situation, the visor works. The best part was not hearing the smoke alarm go off!Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Carrillo",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T00:22:49.000Z",
          "Titre": "I like the way it is supposed to work",
          "Contenu": "I like the way it is supposed to work.  However, if I have both burners on in front, there's a small amount of steam that will still escape.  Too, I have to remind myself of the microvisor--not to hit it when reaching upward.  But, all in all, I'm very happy with it.  Glad I  purchased it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JO MALLETTE",
          "Nb_Reviews": 3,
          "Date": "2023-01-15T18:35:35.000Z",
          "Titre": "Great product!",
          "Contenu": "It arrived in excellent condition, was easy to install, & functions as advertised!  No more foggy glass on my microwave!  And it looks great, too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vincent Tuazon",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T21:28:52.000Z",
          "Titre": "Easy install",
          "Contenu": "Easy install. Matches my brushed stainless steel microwave. And captures the smoke , which would activate close by fire alarms too frequently."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Garrett & Deb Caputo",
          "Nb_Reviews": 2,
          "Date": "2023-03-15T23:27:32.000Z",
          "Titre": "from order to use: GREAT!",
          "Contenu": "i received the hood in a timely manner. Easy to set up and use. It takes just a little bit to get used to the overhang, but it really makes a difference in containing the exhaust under the microwave. Worth every penny."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lou",
          "Nb_Reviews": 2,
          "Date": "2023-01-03T15:45:41.000Z",
          "Titre": "Perfect purchase.",
          "Contenu": "The Microvisor Hood turns out to be exactly what we needed to make our microwave exhaust fan do its job effectively when we use the front burners."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WAYNE MORRISON",
          "Nb_Reviews": 3,
          "Date": "2023-03-15T01:14:48.000Z",
          "Titre": "I really like the way it protects my…my microwave and cabinets from getting all wet",
          "Contenu": "I really like the way it protects my microwave and cabinet doors getting sweat all over them when cooking on the front burners a very great item"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rob D",
          "Nb_Reviews": 1,
          "Date": "2022-12-26T21:52:07.000Z",
          "Titre": "Great Product",
          "Contenu": "Great customer service during the ordering process.  Shipped timely. And easy installation!  It took less than 15 minutes to open, read directions, and complete the installation. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Negrin",
          "Nb_Reviews": 3,
          "Date": "2022-12-17T23:54:46.000Z",
          "Titre": "Good solution for better steam removal",
          "Contenu": "Nice addition that doesn't add much space and does the work. The installation was easy as well and overall we are happy with this purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roszan Jarman-Konkel",
          "Nb_Reviews": 1,
          "Date": "2022-12-25T03:24:30.000Z",
          "Titre": "Definitely what I was looking for",
          "Contenu": "Definitely what I was looking for.  The fan on my microwave didn't work for the front burners.  The hood keeps the steam from covering the above cabinets"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T22:07:56.000Z",
          "Titre": "I was skeptical but the Microvisor has…",
          "Contenu": "I was skeptical but the Microvisor has made a tremendous difference in the spatter on my cooktop. It works extremely well. Very happy with the purchase and the shipping was quick!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ray Echevarria",
          "Nb_Reviews": 2,
          "Date": "2023-01-15T20:10:36.000Z",
          "Titre": "This product definitely helped by capturing the steam",
          "Contenu": "This product definitely helped by capturing the majority of steam and smells while cooking. It is a life changer for us! Truly recommend it!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vee",
          "Nb_Reviews": 2,
          "Date": "2023-03-19T18:41:41.000Z",
          "Titre": "I was able to purchase a refurbished…",
          "Contenu": "I was able to purchase a refurbished Microvisor Hood on the last day of February for a reduced price. Due to some negative reviews I wanted to give it a try, but not at full price. The hood was very well packaged and arrived very quickly. It was in perfect condition, lightweight, easy to handle, and I was able to install it in a few minutes. I have had it for a few weeks now and have to say it works very well. It's keeping my microwave and upper cabinets clean. I pulled my microwave fan filters to clean after using for a week or so and they do seem to be pulling in a lot more grease. I have also noticed that the underside of the hood has grease and condensation spots so it is working to keep cooking steam more contained. Does it keep everything contained? No, but it's a great improvement in my kitchen. It does obstruct my view of the stove knobs a little (they are on the back of the stove), but I just duck down to adjust them and that minor inconvenience is more than worth it in my opinion. The only thing that would be an improvement would be to have a full-sized outside vented fan instead of a microwave, but my very small kitchen is not very accommodating to that scenario.Thank You Microvisor Hood for helping to provide a solution to a very annoying kitchen problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbi",
          "Nb_Reviews": 2,
          "Date": "2023-08-19T23:58:27.000Z",
          "Titre": "Quality item!!",
          "Contenu": "The MicroVisor came quickly. I paid extra to get it shipped 2 day. They were true to their word. My husband had this installed in less than 15 minutes.  We are both in love with it. We have a Whirlpool microwave."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eugene",
          "Nb_Reviews": 4,
          "Date": "2023-03-08T22:43:38.000Z",
          "Titre": "On-line order handled quickly and…",
          "Contenu": "On-line order handled quickly and accurate.  Received email when shipped and when delivered. Product was easy to install and functions great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Buczek",
          "Nb_Reviews": 3,
          "Date": "2023-05-16T18:52:33.000Z",
          "Titre": "Great customer service - and product",
          "Contenu": "Great customer service -easy to install and works really well with eliminating the exhaust out of the home. Wish I found this earlier.Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beejay",
          "Nb_Reviews": 3,
          "Date": "2022-12-21T17:29:47.000Z",
          "Titre": "Simple 5 minute installation",
          "Contenu": "Simple 5 minute installation. Performs exactly as we hoped. Reduces smoke/smells from cooking dramatically. Thoroughly enhances previously weak microwave exhaust fan, completely stops steam from destroying above range microwave's electronics."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob H",
          "Nb_Reviews": 2,
          "Date": "2023-02-27T23:41:02.000Z",
          "Titre": "Easy ordering",
          "Contenu": "Easy ordering, Excellent customer service. The mini hood is a lifesaver well worth the money ! Excellent quality easy to install. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed W",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T18:14:33.000Z",
          "Titre": "Easy to install",
          "Contenu": "Easy to install, no special tools required, just a phillips screw driver.  Seems to capture all steam/smoke and diverts to vent fan (make sure the fan is on)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Blau",
          "Nb_Reviews": 2,
          "Date": "2023-01-30T00:13:15.000Z",
          "Titre": "Catch the front burner smoke",
          "Contenu": "The visor Really helps the exhaust fan catch any smoke and steam from the front burners, and helps keep the smoke alarms from going off."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Di Salvo",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T19:22:09.000Z",
          "Titre": "Stove Hood",
          "Contenu": "This was exactly what I was looking for. It keeps the steam and grease off  the kitchen cabinets. Fortunately I saw your commercial on TV."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lydia Laurer",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T23:34:40.000Z",
          "Titre": "So glad I purchased… works perfect",
          "Contenu": "So glad I purchased… works perfect! No more worries about cabinets getting ruined! Easy to install too!! 5 stars!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gustavo Millan",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T20:47:01.000Z",
          "Titre": "It meets my expectations",
          "Contenu": "It meets my expectations. It helps pick up and the smoke/smells from what we cook on the stove, and directs it towards the exhaust system."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zoltan Toth",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T19:01:55.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, it really helps with venting.  The owner is super friendly.  Order arrived within days and it was easy to install.  Highly recommend it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Barnes",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T16:50:06.000Z",
          "Titre": "For four reasons",
          "Contenu": "For four reasons, I give it FIVE starts!1 - It was affordable.2 - It arrived quicker than expected.3 - It was easy to install.4 - It does exactly what it claims to do!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen A",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T19:22:53.000Z",
          "Titre": "Why didn’t I order sooner!        …",
          "Contenu": "Why didn’t I order this a long time ago!  So easy to install.  My husband and I were still speaking to each other after completing this project. I can tell you that’s not usually the case. 😂"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Villarreal",
          "Nb_Reviews": 4,
          "Date": "2023-03-04T19:56:48.000Z",
          "Titre": "Microvisor is a lifesaver",
          "Contenu": "It was easy to install and seems to have helped keeping the steam and any grease from hitting my cabinets above the microwave."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T17:49:29.000Z",
          "Titre": "The visor does exactly what it is…",
          "Contenu": "The visor does exactly what it is supposed to do. Great quality easy to install and most importantly made in America."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce P. Nichols",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T02:18:37.000Z",
          "Titre": "Easy to install",
          "Contenu": "Easy to install. Allows the steam, coming from a pot on the stove top below, to be exhausted to the vent rather than up over the microwave oven face."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mai",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T13:41:22.000Z",
          "Titre": "The little hood works great",
          "Contenu": "The little hood works great! It covers all oil mess and smoke. My cabinets looks clean after deep frying! Thanks Microvisor!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward",
          "Nb_Reviews": 3,
          "Date": "2022-12-21T02:06:48.000Z",
          "Titre": "I couldn't believe how easy it was to…",
          "Contenu": "I couldn't believe how easy it was to install under my microwave. It fit perfectly and so few parts. The only help I needed was for the wife to hold the flashlight so I could see the screw holes. It must have only taken 5 minutes to install and just a few steps."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phillip Melland",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T17:20:22.000Z",
          "Titre": "Microwave visor",
          "Contenu": "The packaging of the product was great so the product would not be damaged! Very easy to install and the price was great! The product did its job by converting the flow of steam to the fan. I recommend this product if you have steam problems on your microwave! Works wonderful!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Robert Poisson",
          "Nb_Reviews": 1,
          "Date": "2022-12-26T03:37:50.000Z",
          "Titre": "Online purchasing was great",
          "Contenu": "Online purchasing was great.  Delivery was fast, especially this close to Christmas.  Product is well made and well finished."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RAPPEL/JOAN CASTILLO",
          "Nb_Reviews": 3,
          "Date": "2023-08-10T00:26:08.000Z",
          "Titre": "Happy and satisfied with the replacement",
          "Contenu": "We received a damaged product and the company respectfully replaced it. We are satisfied and happy with the replacement."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Frank Capuano",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T17:27:16.000Z",
          "Titre": "Easy to install",
          "Contenu": "Easy to install, works great, And the colour matches perfectly. I would recommend this to people with under mounting microwaves."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DeMarcus",
          "Nb_Reviews": 3,
          "Date": "2023-02-04T19:23:41.000Z",
          "Titre": "Very functional",
          "Contenu": "Looks great with my matching black kitchen appliances. Improves the performance and function of the over range microwave."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah Larson",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T17:45:52.000Z",
          "Titre": "The service was awesome and the owner…",
          "Contenu": "The service was awesome and the owner gives special attention to your needs! And that is hard to come by these days! Will refer all my family and friends, love the product!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Eaddy",
          "Nb_Reviews": 4,
          "Date": "2023-01-28T23:38:17.000Z",
          "Titre": "OUTSTANDING COMPANY! OUTSTANDING SERVICE! OUTSTANDING PRODUCT!",
          "Contenu": "What made my experience great was that I made a mistake on my order. I meant to order the black stainless steel model but mistakenly ordered the chrome stainless steel model. And I ordered it express 2 day shipping! So I emailed customer support the next business day, which was Monday, and immediately received an automated response which provided me with a phone number to call if I choose to do so. Quickly, a man whose name I cannot remember, asked me if he could be of assistance. I explained to him I made a mistake on my 2 day order and he asked for my order# and how I would like my situation to be resolved. I told him which model I ordered, and the model I wanted, and he said he would take care of it. NOW HERE'S WHAT SETS MICROVISOR HOOD APART FROM THE REST! About 10 minutes later, I logged into my account to check my order...AND IT WAS THE CORRECT ITEM!!! So here's a company that does what they say they're going to do, when they say they're going to do it, and did it swiftly with no problems at all. Super-Fast response and resolution. YOU CAN'T ASK FOR MORE THAN THAT FROM A COMPANY! Oh, yes you can. The visor works GREAT!!! Not to mention that it gives your Over The Range Microwave a look you won't see anywhere except in places where people bought the Microvisor Hood. OUTSTANDING COMPANY!!! OUTSTANDING SERVICE!!! OUTSTANDING PRODUCT!!! I HIT THE TRIFECTA WITH THIS ONE!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce P. Koenig",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T19:29:10.000Z",
          "Titre": "Easy install and works great.",
          "Contenu": "Easy install and works great. I was a little skeptical when I first saw it on TV. Fast delivery service, easy to install, with the adapters and works like it is designed to. Thank you!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy Decker",
          "Nb_Reviews": 2,
          "Date": "2023-02-15T16:56:51.000Z",
          "Titre": "Really works",
          "Contenu": "Really works! We have always had problems with our smoke alarms going off when I make anything in the oven or on the stove. The vent on the microwave just doesn’t cut it. This thing is amazing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth",
          "Nb_Reviews": 2,
          "Date": "2023-01-22T02:25:58.000Z",
          "Titre": "Prompt reliable service … I called on…",
          "Contenu": "Prompt reliable service … I called on Saturday, spoke to George and received my order a few days later …"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peggy Motsinger",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T20:32:58.000Z",
          "Titre": "Exactly what we were looking for",
          "Contenu": "Exactly what we were looking for. Fast delivery and customer service answered all of our questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Lucas",
          "Nb_Reviews": 1,
          "Date": "2022-12-19T02:09:06.000Z",
          "Titre": "Fast delivery and beautifully made",
          "Contenu": "Fast delivery and beautifully made. My deceased dad was a sheet metal worker and could have made this."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Starr",
          "Nb_Reviews": 1,
          "Date": "2022-12-25T01:57:45.000Z",
          "Titre": "Great product",
          "Contenu": "Fast shipping, quality product, easy to install. The visor works as intended, the led light works great also. Web site easy to work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victoria Williams",
          "Nb_Reviews": 1,
          "Date": "2022-12-04T16:49:55.000Z",
          "Titre": "Our first hood was damaged in transit",
          "Contenu": "Our first hood was damaged in transit. George in customer service handled our problem immediately!  The microvisor works perfectly.  Great product and superb customer service!  Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Simon Karpen",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T02:49:56.000Z",
          "Titre": "Fast ship, well packed, no issues",
          "Contenu": "Very well packed, fast shipping. Absolutely no issues. I haven't needed to contact customer service for anything because the instructions were excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Hanson",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T23:30:41.000Z",
          "Titre": "Your customer service was amazing and…",
          "Contenu": "Your customer service was amazing and giving Veterans a discount was appreciated. Was super easy to install and solved the problem.                        Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Adams",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T22:53:33.000Z",
          "Titre": "Response & Quality",
          "Contenu": "Quick response when notified that received damaged. Then quick to replace with ease to install."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pittsburgh",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T17:35:43.000Z",
          "Titre": "A savior from greasy closet doors",
          "Contenu": "This product surely helps avoiding the cooking grease yo get to the top cupboard doors which is great.I would surely recommend this product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelly and Tina Stitzel",
          "Nb_Reviews": 3,
          "Date": "2022-12-07T22:25:30.000Z",
          "Titre": "Easy installation",
          "Contenu": "Easy installation, NO MORE MORE HOT MICROWAVE HANDLE, YES YES YES.  Can I get on of your stickers to put on it, mine came with none."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Moshe",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T15:21:37.000Z",
          "Titre": "This is a handy jtem for the kitchen .",
          "Contenu": "This is a handy jtem for the kitchen .. it has greatly elimanated the cooking smoke from ‘flooding’ the kitchen…"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pat Kruse",
          "Nb_Reviews": 1,
          "Date": "2023-01-29T16:13:02.000Z",
          "Titre": "Easy install",
          "Contenu": "Easy install.  Solves the exhaust problem. No more grease exhaust on my kitchen ceiling!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MICHAEL SOYKA",
          "Nb_Reviews": 2,
          "Date": "2023-02-19T00:28:15.000Z",
          "Titre": "Does the job!",
          "Contenu": "The install was easy. It does a great job. I feel two thumb screws should be included. Also, I bought the 36\" version that I wish came in Black. Anyway, my smoke alarm no longer goes off when cooking and that alone was worth it!"
        }
      ]
    }
  ]
}