{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "mimeophotos.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Dr. Y",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:57:38.000Z",
          "Titre": "Terrible",
          "Contenu": "TerribleShipment due on Dec.5, received it on Dec.18Had to spend time and energy to get news on what’s going on with UPS and with MimeoMimeo very disappointing on solutionIn addition I receive my albums damaged on upper left corner and Mimeo offres as compensation 30% on my next order! Joke, not onay a discount on next order but send me black my albums NOT DAMAGED or refund those, Logic So as you see a very bad trip"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "John Heeney",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:15:21.000Z",
          "Titre": "We had 2 photo projects on the go",
          "Contenu": "We had 2 photo projects on the go. The 3 calendars finally arrived but were 4 days AFTER DHL said they would arrive!! And the tracking information at DHL is terrible in that they rarely give you up dates.My guess is that you moved ago DHL from FedEx (who were excellent!) as a cost saving measure. The problem is that DHL is antagonizing long term customers (such as us) and running the risk of losing them to another photo service. Not worth the cost savings!!"
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T18:09:38.000Z",
          "Titre": "Not as good as before",
          "Contenu": "The delivery was almost one week later than it was said when I placed the order.The printing quality isn't as good as it was.  Even I have upgraded my shooting gear, there is noise on the printed photos which I have never seen before."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "lisa",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:37:29.000Z",
          "Titre": "The pictured were NOT printed…",
          "Contenu": "The pictures were NOT printed correctly.   They were cropped and the coloring was only adequate.   I am very disappointed and do NOT recommend mimeo at all."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T23:15:03.000Z",
          "Titre": "Charged in UK currency",
          "Contenu": "While the calendars are lovely, you charged me in GBP.  I live in Canada.  There was no way to change the currency on your website.  Can you please explain why?"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Jon O'Grady",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T04:31:42.000Z",
          "Titre": "Why is MIMEO keeping me in the dark?",
          "Contenu": "I paid for two albums but I didn't get receipt, yet the changes were still made against my bank account.Clearly your software workflow is faulty needs to be corrected. CHARGES SHOULD ONLY BE MADE AFTER THE RECEIPT IS SENT.Now Just today the two albums have arrived but I never received any notification of intention to deliver, nor tracking information. Nor did I receive any answers from MIMEO when I made my first complaint."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T23:49:05.000Z",
          "Titre": "Mimeo was good to deal with and the…",
          "Contenu": "Mimeo was good to deal with and the items were produced well, but the DHL delivery service was abysmal. No words adequately describe how poor they were to deal with.They email with conflicting advice regularly, indicating they have the wrong address, despite it being correct on all three items we ordered and we would have to pick them up at one of their depots, despite paying for home delivery. They also said that they had tried to deliver two of them, despite us being home all of the day. The Canadian lady I spoke to had no idea how Canadian addresses were organized. I cannot use Mimeo again if they use DHL to deliver items as it is too frustrating. I would not be surprised if DHL is not delivering packages much longer as they seem to be struggling."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Satisfied Customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T01:02:31.000Z",
          "Titre": "Wal Calendar",
          "Contenu": "Wal CalendarThe Quality is OK,, But the pricing is far to high and not competitive in the market place,I will order the Calendar next year from another company,,"
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Sara Winsnes",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T12:38:00.000Z",
          "Titre": "At first I order from apple and the…",
          "Contenu": "At first I order from apple and the calendars looked good for many years, then with Mimeo, the quality began to drop. The Calendars is too dark but ok. Now I ordered a book and it is so dark I just want to throw it away. And they actually sent me another copy, that was suposed to be better, but looks exactly the same. I´m a photographer and used to see my pictured edited, So the problem is not my pictures."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Tina  Hansen",
          "Nb_Reviews": 16,
          "Date": "2023-12-06T21:25:51.000Z",
          "Titre": "You cannot have more than one project…",
          "Contenu": "You cannot have more than one project in your basket. Therefore you will have to pay freight for each project actually up to 50% of my order. Other suppliers can do this. I only got a bad excuse asking the chat for help. And for Denmark the freight is around 100 DKK per parcel."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "T L",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T16:55:07.000Z",
          "Titre": "Don't bother ...",
          "Contenu": "I ordered prints and the books and I have to say the prints came back with horrible colors.  The outfits in all the photos looked completely off and the entire print had a red tint to it.  I e-mailed the company (not for refund or anything, but to just let them know) and no one even bothered to reply back to my e-mail.  In a world where such companies are a dime a dozen, I would not use Mimeo ever again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:41:27.000Z",
          "Titre": "Front cover was totally crooked",
          "Contenu": "Front cover was totally crooked. Inside pics were fine. Coloring was off and really bummed about the front. Looks cheap and off center."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lora Barrett",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T20:58:50.000Z",
          "Titre": "DEFECTIVE",
          "Contenu": "On Nov 17 I wrote to you about a defective order and attached a photo of the defect, which was that one of the pages was printed upside down. I have not heard a single word yet from your company about the resolution. Here is the original email:Good afternoon.One of the three copies I order was defective when it was delivered today. The last page of one copy was inserted upside down. The Mimeo Photos Order is 1057522. I have attached a shot of the page that is a problem. Please send me only one new copy.  Thank you. Lora Barrett"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T20:42:00.000Z",
          "Titre": "I’m very happy with the product but I’m…",
          "Contenu": "I’m very happy with the product but I’m still missing two orders. On top of that I am unable to establish an account with you. I keep resetting my password but the system says it’s invalid with no info to fix it. I did get an email response saying he was going to check with shipping. But no resolution yet. How do I contact you if I can’t establish an account?"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Santi Mane",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T19:06:00.000Z",
          "Titre": "Disconformida",
          "Contenu": "Good Afternoon.The truth is that I have very good references from more than 20 books that I have from you, but I have a disagreement in the way I can contact you.Las October I placed an order for a duplicate book by mistake, there was no way to cancel it, so I have 2 identical books with double cost.I just needed to be able to cancel an order, very difficult? but I do not know how.Excuse my English, it is a Google translation.Greetings."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T15:56:06.000Z",
          "Titre": "It wasn't completely user friendly",
          "Contenu": "It wasn't completely user friendly. But what is more important is I'm being asked to review my experience about products I still haven't received. So I don't know what they look like yet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Hicks",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T22:22:10.000Z",
          "Titre": "Can't contact MimeoPhotos",
          "Contenu": "You delivered another order to our address.  No way to contact MimeoPhotos to correct situation!"
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Kim Mens",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T10:32:01.000Z",
          "Titre": "Did not receive package after more than 2 weeks",
          "Contenu": "I still have not received my package after several weeks. Ideally I would like to see my money returned. The event for which I wanted to offer it as a gift has long passed by now. The experience seems to be the same as when I ordered something last time in March 2023. Then it took 16 days for delivery by UPS rather than the estimated standard shipping of 9-11 days. It was mentioned then that you would take up the issue with UPS to avoid slow delivery in the future, but in the mean time the delivery still seems slow. Again I've been waiting for 15 days already and still received nothing."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Penn Nee",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T06:09:37.000Z",
          "Titre": "Spent MONTHS making my wedding album",
          "Contenu": "Spent MONTHS making my wedding album. I decided i wanted to then make it a hard cover in a slightly larger size.   The message on screen when choosing this, read that i could undo it if i was unhappy with it.  Turns out, it DELETED ALL of the images and theres nothing I can do.  Undo is inaccessible.   Start from scratch was the advice from MIMEO.... My advice, don't use them!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 3,
          "Date": "2023-11-07T18:48:02.000Z",
          "Titre": "A disappointing experience",
          "Contenu": "I had a simple card made but never received it.  Had to request another one be made and sent.  Still waiting.  This should have been sent by USPS and not UPS in my opinion.  I have had other projects done with them and have received good service and nicely produced products.  But I believe this company has gone downhill I'm sorry to say."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Shaw",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T17:12:42.000Z",
          "Titre": "impossible to order a photo with a…",
          "Contenu": "impossible to order a photo with a frame on your website"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vinnie Lainson",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T19:44:29.000Z",
          "Titre": "The book fell apart when unpacked",
          "Contenu": "The book fell apart when unpacked. Had to prove this, which we did. Book shipped a week ago and has not arrived. Checked delivery status and it says, \"delivery status unavailable\" which usually means \"lost\".This is very frustrating."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles Williamson",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T21:08:40.000Z",
          "Titre": "Shipping",
          "Contenu": "I have 30 different folded cards and when I reorder they are shipped to one at a time with a separate shipping charge for each. They should be bulked into one package with one shipping charge."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "mie",
          "Nb_Reviews": 4,
          "Date": "2023-08-31T19:05:31.000Z",
          "Titre": "Delayed and disappointing",
          "Contenu": "Delayed delievery. Low quality. Does not match the sales pitch in the app. I do not understand that Apple has replaced its own brilliant photobook service in Photos with this. I usually never write reviews, especially not bad ones. But this was disappointing."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Anju Bottcher",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T11:55:25.000Z",
          "Titre": "Delivery cost unacceptable",
          "Contenu": "Price for delivery and tax are way too high. Delivery firm only tried to deliver package once and then didn’t give exact instructions where the packages had to be picked up. My 90 year old father was completely stressed !!!"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Marina",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T00:23:01.000Z",
          "Titre": "I have not yet received my order",
          "Contenu": "I have not yet received my order. Your team is  trying to resolve the issue. The package is in UPS Center (Eindhoven) since April 15th. So, if one day I receive my 5 albums, I could give my opinion about quality 😇 My advice: change carrier!"
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Mario",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T22:37:40.000Z",
          "Titre": "Terrible after sale service",
          "Contenu": "Terrible after sale service. After 20 days I did not receive the photo album ordered. I asked why is stopped in Netherlands but till now no answer. Absolutely to forgot. Apple photo service used years ago was  another planet."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T22:49:01.000Z",
          "Titre": "Worts International Delivery",
          "Contenu": "I haven’t received my book because you sent the invoice with a price of 1,074 usd instead of 1,074 Mexican pesos so customs won’t let DHL deliver the product until we pay more taxes. I contacted your team and haven’t gotten a solution."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Co.Tyrone",
          "Nb_Reviews": 5,
          "Date": "2023-11-01T00:37:25.000Z",
          "Titre": "I am a long standing customer and…",
          "Contenu": "I am a long standing customer and recently the photo album I ordered had a photo which was not the standard of Mimeo.The colour was wrong.I use a Cannon 500 camera of a good standard.I am unable to make contact with anyone in Mimeo."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 1,
          "Date": "2022-12-19T16:20:57.000Z",
          "Titre": "…Worst Customer service EVER - non-existent.",
          "Contenu": "You have no customer service to talk to.  Your Email is a joke, I've sent 4 and have only gotten a bot to respond.  I spent $300 on an order, paid for express shipping and you have no idea where it is, when it'll arrive and no one to talk to.  I just talked to a lady at Mimeo, she said she gets these calls all day long. Trying to cancel order! Worst customer service EVER!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T06:44:15.000Z",
          "Titre": "Holiday photos",
          "Contenu": "When making the book, it continually crashed. I spoke to a technician who said try and finalise the book delete then re download the Mimeo App. The book is finally done and has arrived. The print book colour  is extremely flat, noticeably in the flesh tones. When looking at the actual photo in comparison to the printed pages, there is no comparison. Everything looks dark."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lauren Quackenbush",
          "Nb_Reviews": 3,
          "Date": "2023-09-13T22:37:32.000Z",
          "Titre": "I ordered one book just to make sure it…",
          "Contenu": "I ordered one book just to make sure it was what I wanted, went back to my book they had taken four pictures out, and I had to redo my book to order eight more books! I don’t care if the pictures were blurry or not my book could’ve should have stayed the same and no pictures should’ve been removed!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T19:51:30.000Z",
          "Titre": "I had to do my project over 3 times…",
          "Contenu": "I had to do my project over 3 times because I did not click the \"autofill\" before I spent hours selecting my photos for a project, for example!! One time my project was deleted becuase I deleted ONE picture from the project and without asking if I wanted to delete the entire project... my project was gone and I had to start over again...!!! This is not a user friendly software at all! I will not be using Mimeo for next year's Chrismas calendars..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marian",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T21:57:44.000Z",
          "Titre": "It was an ordeal",
          "Contenu": "It was an ordeal.  I have used Mimeo for years, and this was a terrible experience.The app would not load my photos into the calendar app, and it was not clear why not.  I had a lot of trouble connecting to someone to help me, and they couldn't explain what was wrong or how to fix it.  I ended up starting all over, and it was incredibly frustrating and difficult.  If you had someone I could talk to who knows the program, it would have made all the difference!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nadine",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T13:18:21.000Z",
          "Titre": "Shipping issues- almost a month since…",
          "Contenu": "Shipping issues- almost a month since order was placed. No help from customer service. Replacement order sent. No tracking available for that one either. If I needed this as a gift I would have been more disappointed. Still waiting!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LoriB",
          "Nb_Reviews": 2,
          "Date": "2022-12-17T04:52:25.000Z",
          "Titre": "Had problems with picture not appearing…",
          "Contenu": "Had problems with picture not appearing in “preview” mode, yet was in the edit mode. Emailed for help, they had me delete, reinstall, yada yada, didn’t work, had to just use different pics. Then at checkout, I kept getting an error, when I signed out of my account, I could check out. Jeesh!! Waaaaaaay too difficult. Never again."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Andrew D",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T20:16:12.000Z",
          "Titre": "Threw the Calendars in the Garbage",
          "Contenu": "Very poor functionality. Can’t preview layouts. Limited ability to add pics to individual dates. If you make a major obvious mistake they will take your money and print it anyway.  Zero Quality Control, and no interest from their staff to catch anything obvious. Brutal customer service. Too bad, so sad, don’t use Mimeo."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T20:28:01.000Z",
          "Titre": "The check out process is horrible",
          "Contenu": "The check out process is horrible. It took me over an hour to check out. The upload kept failing then working with support I had to do a pdf that did not give me confidence that the project was being ordered correctly. I like your product but the check out process was so bad I don’t know if I can order from you again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christine",
          "Nb_Reviews": 3,
          "Date": "2023-08-21T18:22:34.000Z",
          "Titre": "I purchased 3",
          "Contenu": "I purchased 3, 8\" x 8\" soft bound photo books.  Each book has approximately 34 pages, Cost was about $100 each.  After a few page turnings the books are all falling apart from the inadequate book binding. Very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Leonor V",
          "Nb_Reviews": 3,
          "Date": "2023-10-25T17:02:59.000Z",
          "Titre": "16 days and no order received!",
          "Contenu": "I placed an order on Oct. 9th, amd it's the 25th and I haven't received it yet!!! I contacted Mimeo twice by emailz and I did get a prompt reply only to tell me both times that they wpuld assing someone to get back to me with a delivery date.This is for a birthday gift, and I needed it by Oct 27th....I definitely won't order anything from Mimeo again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Nosrati",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T21:48:26.000Z",
          "Titre": "I've lost count how many emails I've…",
          "Contenu": "I've lost count how many emails I've received from Mimeo for promotional offers. Now that I wanted to place an order none of the promotional offers worked. What's the point of letting you flood my inbox with countless emails only to not be able to use any of the offers when I actually need them?"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "cathal",
          "Nb_Reviews": 3,
          "Date": "2023-04-17T19:24:49.000Z",
          "Titre": "Not delivered; refund eventually",
          "Contenu": "I spent hours preparing an album for an important birthday. They charged me the 300e for the multiple albums then missed the delivery deadline. Two full months later of email correspondence, I finally get an email to say they will make a refund. They should not be allowed trade on Apple. Disgraceful experience. Avoid."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "No name",
          "Nb_Reviews": 3,
          "Date": "2023-07-10T14:15:59.000Z",
          "Titre": "Beware",
          "Contenu": "I am using an old Mac OS - 10.13.6 (which is no longer supported by Apple). When I downloaded the latest Mimeo update 5.3 I could not upload my photographs from Photos. After extensive web chats I was told to uninstall 5.3 and was sent 5.2 to upload as a ‘workaround’, this failed to work. Consequently I have lost some ten projects (Photobooks), this is most disappointing and frustrating as I have used Mimeo for a number of years and have previously been most satisfied.I feel that there should have been some warning regarding updating to 5.3, it would then have been my choice."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carol Gimesky",
          "Nb_Reviews": 4,
          "Date": "2022-12-16T12:26:00.000Z",
          "Titre": "I wanted to change my Christmas card…",
          "Contenu": "I wanted to change my Christmas card shortly after I ordered it.  Different people emailed me to say no changes could be made even though my order was not processed.  I redid the card the following day which put receiving my order 4 days later (after Christmas.). I asked for both orders to be sent together on the earlier date.  No promises made to do that.  It seems there is no customer service which I expect with a company that is more expensive than many others and has high shipping and handling fees.  I most likely will choose another company next year."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lex",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T21:10:39.000Z",
          "Titre": "Very delayed delivery",
          "Contenu": "Very delayed delivery. It was sent out on 2/8/2023. Up to now, it hasn't arrived yet. Fedex keeps changing the estimated delivery date (initially at 2/15, then changed to 2/21, then changed to 2/24). Not sure what instructions Mimeo provided to Fedex for such delay but this is discouraging from me from making future orders with Mimeo."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "ALDERMAN, JAN TAUB",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T22:36:43.000Z",
          "Titre": "I was just very disappointed in how the…",
          "Contenu": "I was just very disappointed in how the cards looked. Also, I thought they were folding cards, not a postcard. I ordered new ones at Walgreens and loved how they came"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "debra goodwin",
          "Nb_Reviews": 2,
          "Date": "2023-10-06T14:18:36.000Z",
          "Titre": "Projects not delivered",
          "Contenu": "Well I still have not received either project, one sent to you sept 2 …And the other sept 9…I had an email to say they were on their way… but they do not show up in the tracking app!   BOth of them were estimated to be here by now.  The company responded to this and rectified the problem…. Thank you Deb"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Sad",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T23:26:05.000Z",
          "Titre": "Item never arrived in spite of UPS…",
          "Contenu": "Item never arrived in spite of UPS marking as delivered on tracking. I’ve complained, and have received a response from mimeo to say they will deal with queries in the order received, but this is a Christmas gift for very elderly relatives, so time is of the essence."
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "tommieboy",
          "Nb_Reviews": 4,
          "Date": "2023-04-14T19:26:31.000Z",
          "Titre": "Bad integration of Mimeo in Apple Photos…",
          "Contenu": "The integration of Mimeo in Apple photos did not work at all!I tried multiple times to upload my project; >10 times unsuccessful!Finally I got advised to download it as a pdf and upload manually… that worked but not as expected :-(Thanks for the feedback Mimeo; so far I’ve not yet experienced the app. As soon as I see an opportunity I’ll give it a try and update the review on that opportunity."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Gillian",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T20:57:29.000Z",
          "Titre": "Exorbitant shipping charges!",
          "Contenu": "Although the calendars are great and so easy to use with a Mac, the cost of shipping the projects is terrible.  I made 5 different projects and had to ship them all independently.  This is close to $80 just in shipping costs.  Not to mention that shipping one calendar shouldn't cost 16.99....heavy packages from across the world cost less than that!  I have asked about this before and the answer is always that \"we are working on it\"!  It's been years, surely the company can figure out how to group projects going to the same address.  I was trying to save money this year by making presents!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JayH",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T22:25:51.000Z",
          "Titre": "Every year it gets more difficult",
          "Contenu": "Every year when I make calendars for my family there is some additional “feature” that makes the process more arduous than the previous year. For example, it used to be possible to import a calendar with birthdays and anniversaries. That disappeared. Each event now needs to be manually entered. The font size needs to be changed one at a time instead of a global setting. Because I ship 6 calendars to multiple locations, each address needs to be entered manually. It would be nice to maintain a database to select from."
        },
        {
          "Note": 1,
          "Lieu": "FI",
          "Pseudo": "Felix",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T18:40:00.000Z",
          "Titre": "Discount code",
          "Contenu": "Did use the offer on your site, 15% discount, thinking that was the best I could get. However, after signing up for your newsletter I get a 27% discount code, this being too late as I already ordered the 220 dollar photo book from you, very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T19:53:10.000Z",
          "Titre": "I really miss Apple photo book service",
          "Contenu": "I really miss Apple photo book service. Your software is clunky, not intuitive, restrictive and the best designs Apple used to offer are gone for good. Your fonts are hideous!Apple is such a constant disappointment as they sell off good services and refuse to listen to the customer base that used to love Apple. It’s either take what we give you, overpay and do it our way or f- off. Mimeo is a reminder of that. What used to be awesome and easy is now just a restrictive pain in the ass. Here’s an idea, leave the software alone so we don’t have to re-learn it every time a book needs to be created and ordered."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Anne Jaucot",
          "Nb_Reviews": 4,
          "Date": "2022-12-09T14:34:25.000Z",
          "Titre": "Easy to use but bad result!",
          "Contenu": "Very easy to use but really disappointed about the result!!! I use it each year for calendar and christmas card but this year the quality is really bad. Pictures are not well placed, the paper quality and pictures quality are really bad! Sad!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jane  P",
          "Nb_Reviews": 2,
          "Date": "2023-07-29T00:33:29.000Z",
          "Titre": "Incredibly frustrating experience!!!  I have made your books for years…",
          "Contenu": "I have made your books for years (before that Apple), but this is my worst experience ever!!!  My three books turned out well, but I had endless frustrations in making them.  My teaching partner saved the day by telling me the very simplest of steps which corrected the problem.  That was after I had had many many \"chats\" with an expert who simply kept offering me printed Q&A's to read!  If I had been able to speak with a human being the problem would have been solved in less than five minutes.  As it was I spent three days making two books because of this simple glitch.  It there was another choice I would definitely use another company which allowed me the opportunity to speak with a human being like it was in the old days!  There is nothing that can replace human contact, and I may use Shutterfly from here on out."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Susan Hamilton-Green",
          "Nb_Reviews": 2,
          "Date": "2023-07-22T09:52:40.000Z",
          "Titre": "Not received my photo book yet",
          "Contenu": "Not received my photo book yet. Cannot contact courier despite numerous attempts. Missed the date for this to be given as a present for my child’s birthday! Very disappointing!!"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Alexis",
          "Nb_Reviews": 4,
          "Date": "2023-10-31T21:52:47.000Z",
          "Titre": "I ordered a book which arrived after…",
          "Contenu": "I ordered a book which arrived after the date for a birthday - quality is ok. Service disappointing for the price"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "James Cameron",
          "Nb_Reviews": 2,
          "Date": "2023-03-07T19:48:39.000Z",
          "Titre": "Repeated Delivery Failure",
          "Contenu": "Hello,I just sent the message below to help at mimeophotos.com complaining about repeated delivery failure on a package by UPS========================================Hello,I am writing to follow up on delivery of a Photo-Calendar order from Mimeo which has been fraught with problems going back to Feb 22nd! Based on the shipping history as documented below, it seems there have been many issues in delivering the calendar.  Initially, the calendar was not delivered as no one was home.  For future delivery, I then gave explicit instructions to leave the package at the door (if no one answers) but still the calendar has not been delivered!I am very frustrated as the calendar has still not been delivered.  Can you please do what it takes to deliver the calendar asap.Sincerely,"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Monica",
          "Nb_Reviews": 2,
          "Date": "2023-09-20T21:26:40.000Z",
          "Titre": "Probably will never use Mimeo again",
          "Contenu": "Probably will never use Mimeo again.  A simple order for two prints seemed to be lost, and not delivered.  Also no updates on my orders from Mimeo. I suggest you take your business elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Near",
          "Nb_Reviews": 1,
          "Date": "2023-05-07T17:50:41.000Z",
          "Titre": "Package has not arrived",
          "Contenu": "Package has not arrived. It is a memorial book for my husband who passed away. Very disappointed.  Emails say you are looking. Really upset that book was not tracked appropriately."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "cRonald W. Howardustomer",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T19:13:16.000Z",
          "Titre": "Disappointed to learn that the 72% off…",
          "Contenu": "Disappointed to learn that the 72% off Valentine Day offer when orderingr two or more items did not apply to the folded photo cards with envelopes. Trying to place the order for the photo card was difficult and confusing. I was trying to order a folding card with the photo on the outside and the inside blank. I ended up abandoning the effort unsuccessfully."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T07:14:06.000Z",
          "Titre": "it’s absurd to change $5 (or whatever…",
          "Contenu": "it’s absurd to change $5 (or whatever it was) for shipping a $2.50 card. ridiculous! the shipping is so expensive it’s a joke. just charge more for the damn card and don’t charge anything for shipping or charge something reasonable. i mean, i wonder if you are even aware of what you are charging? because it seems impossible to believe that you would think your shipping charges are a good idea. like was that a part of the business plan? normally i wouldn’t even bother to respond but it is so crazy that i’m taking the time to tell you. i will not continue to use your services because there are plenty of choices that don’t charge nearly twice the amount of the card itself for shipping."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donald Applegarth",
          "Nb_Reviews": 2,
          "Date": "2023-01-04T04:44:27.000Z",
          "Titre": "Too much for shipping and slow",
          "Contenu": "Program works good, but asking for a review right after charging me $12 for shipping and not having it out the next day sucks. If you charge that much in shipping you should be fast. I’ll not recommend this to anyone"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Kelly Flemming",
          "Nb_Reviews": 3,
          "Date": "2023-03-29T20:33:21.000Z",
          "Titre": "Not user friendly at all…",
          "Contenu": "Spent hours doing a photo book from our trip overseas. Uploaded it and saved it. Then spent another couple of hours editing the same book for another friend.uploaded and paid also. Only to receive an email stating they had both failed afterwards. The platform has some major faults when trying to go back to make changes. After being told I could go back to last save by online chat, this is not the case. It will only go back a few changes. You also cannot rename project and save as different project which would have been a major helpAn update after your reply. The current version of Apple does not allow duplicates to be made and it most definitely does not allow you to rename. I think your platform needs a major overhaul with registration to Apple users. It’s a pity because the finished product is lovely quality."
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Renaud Joly",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T16:14:09.000Z",
          "Titre": "Horrible",
          "Contenu": "HorribleShipment is first super expensive and not fast at allWhy photo are not printed in Singapore and send locallyThis is not good for the planet On top quality of the pictures is mediocre and shipment by Australia post way to long"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T18:39:30.000Z",
          "Titre": "I contacted Mimeo several times about…",
          "Contenu": "I contacted Mimeo several times about my order for my daughter's 9th birthday, as my tracking number wasn't working, as I was concerned that there was an error, especially as I paid a higher shipping fee to ensure on-time delivery for her special day. I was assured several times that my book was en route by Mimeo, despite the tracking number needing to be fixed. When the expected delivery date passed, I contacted Mimeo for the third time, inquiring about my delivery. Only after the third contact, Mimeo told me there was an \"unexpected problem\" with my tracking number and, therefore, they would ship me another order. I received my order one week after my daughter's birthday. I've always had a great experience with Mimeo. Still, this delay could have been avoided, and I am at a loss as to why I would pay a higher shipping cost only to receive my book a week later, especially when I contacted Mimeo when there seemed to be a problem with shipping from the get-go. I would love to get a refund on my expedited shipping costs, especially since this could have been avoided."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T02:53:02.000Z",
          "Titre": "The product hasn’t arrived.",
          "Contenu": "The product hasn’t arrived.It was estimated for 18.10.23Today is 28.10.23Your customer service response was cut and paste.I am usually very happy with the product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer LM",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T15:50:03.000Z",
          "Titre": "I was stunned at the price of shipping",
          "Contenu": "I was stunned at the price of shipping. Due to fact I needed the photos to complete a heritage project I had no choice but to pay 7 x the amount of the actual photos for shipping. The ease of ordering and quality of product is great. But to pay so much for shipping when two stamps on an envelope would have delivered the same high quality goods? Not for me! I will print my own."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T01:32:59.000Z",
          "Titre": "Late; has not arrived.",
          "Contenu": "Estimated delivery 9/5.  It's 9/14 and has not arrived.  Perhaps you should not ask for feedback when the item is 1.5 weeks late and not yet delivered."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shirley J. Walker",
          "Nb_Reviews": 5,
          "Date": "2023-04-02T21:31:53.000Z",
          "Titre": "Tried to re-order my card made on line",
          "Contenu": "Tried to re-order my card made on line. Not able to access my account. Kept asking for new password.Even tried the help center. To no avail. So I decided the frustration is not worth it. I plan to make another thank you card and order from another site. Frustration."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customerJB",
          "Nb_Reviews": 2,
          "Date": "2023-04-21T22:39:48.000Z",
          "Titre": "Incredibly disappointed",
          "Contenu": "Incredibly disappointed. Pictures were pricey and are mostly resized cutting off and distorting the original pics. More clarification should have been given as how to size pics. certainly would never use this company again"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Neil Chrystal",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T20:14:13.000Z",
          "Titre": "Promo Codes",
          "Contenu": "I completed three projects on Sunday and placed the order Sunday evening. I ordered almost $2,000 of product and the very next morning you sent me a 20% discount code. Very disappointing.Maybe you can provide a credit against future orders?I appreciate your prompt response but I was hoping you might extend a credit given the timing of your promo code announcement."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T22:27:00.000Z",
          "Titre": "The phonebook arrived damaged",
          "Contenu": "The phonebook arrived damaged - the bottom of the binding is dented as if someone dropped or smashed it on the ground. I am very disappointed and upset, as I was depending on this as a Valentine's gift."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Maria Dolores Moreno",
          "Nb_Reviews": 5,
          "Date": "2023-09-26T19:39:16.000Z",
          "Titre": "I have not received my product",
          "Contenu": "I have not received my product. UPS did not deliver and they have not returned my emails asking when can they do it or where should I go pick it up."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "WYATT williams",
          "Nb_Reviews": 2,
          "Date": "2023-04-11T23:19:14.000Z",
          "Titre": "Book delivery fine.",
          "Contenu": "Book delivery fine.I have asked about potential reduction in another book that I am about to orderAND IF THAT SATISFIES ME I WILL ORDER 4/5 MORE. 1) Can I get a discount? 2) if so I want the code or codes. Damn simply.No robot please."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nipomo Gal",
          "Nb_Reviews": 3,
          "Date": "2023-06-12T19:40:55.000Z",
          "Titre": "Poor Quality",
          "Contenu": "The pictures in my book were all out of focus.  Still haven't resolved the issue.  They want my first born and I am having issues obtaining what they have requested.  Offered to send the book back, but not told where.   I have used you in the past and always been happy, not this time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T21:00:34.000Z",
          "Titre": "I still have not received my photos",
          "Contenu": "I still have not received my photos, which were ordered 3 weeks ago. Mimeo keeps sending me requests to review their service, which I can't recommend."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Susi Inglis",
          "Nb_Reviews": 3,
          "Date": "2023-05-28T04:58:05.000Z",
          "Titre": "I still have not received my album",
          "Contenu": "I still have not received my album.  They said they had tried to deliver and left a card.  There was no card.  I emailed them and said please leave the parcel at our local post office.  They said they would look into it.  I have not heard back.  Album was expensive and this is very disappointing.  Susi Inglis"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Carole O'Neill",
          "Nb_Reviews": 3,
          "Date": "2023-04-23T02:16:28.000Z",
          "Titre": "The book hasn’t been delivered yet",
          "Contenu": "The book hasn’t been delivered yet. Must admit staff were most helpful in tracing it. Still taking ages to deliver, Carole"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T21:04:16.000Z",
          "Titre": "Wrong order followed up by poor…",
          "Contenu": "Wrong order followed up by poor customer service and a repeated wrong order. Why bother?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T20:53:42.000Z",
          "Titre": "It took me an entire week to finally…",
          "Contenu": "It took me an entire week to finally get my order properly placed.  Very frustrating and many emails later it finally happened.  I do appreciate your responses, however."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Morgan Moffett",
          "Nb_Reviews": 1,
          "Date": "2022-11-27T05:41:52.000Z",
          "Titre": "I thought they would of edited it but…",
          "Contenu": "I thought they would of edited it but they didn’t and I didn’t realize this but so now after 100$ some of the pictures are cut off and show black"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paulina hemmer",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T18:07:33.000Z",
          "Titre": "Had to returned my books they did y ho…",
          "Contenu": "Had to returned my books they did y ho threw customs because you made the prive of 2400 dllrs instead of pesos"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-03-13T03:05:17.000Z",
          "Titre": "Unreliable delivery of product",
          "Contenu": "Software is good. Finished my project and shipped-3wks later it still hasn’t been delivered. If your product never gets delivered, what’s the point. Expensive."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Sheehy",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T04:28:05.000Z",
          "Titre": "It’s been 2 weeks since order was sent",
          "Contenu": "It’s been 2 weeks since order was sent.   Missed opportunity to capture post trip excitement.   Still waiting for delivery !!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T23:26:20.000Z",
          "Titre": "Never received half my order",
          "Contenu": "I ordered 5 wallet prints and 7 8x10 prints 2 weeks ago and I got the 5 wallet prints which are great but never received my 8x10 prints."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas Hiserodt",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T20:06:40.000Z",
          "Titre": "I was notified of a promotional code…",
          "Contenu": "I was notified of a promotional code that would reduce the cost of calendars I made by 23%. After repeatedly trying to input the code and getting a failed notice, I gave up. The promotion would have saved me up to $150.00. I will not use this product again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Natasha Smithwick customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T19:10:08.000Z",
          "Titre": "Photo book has arrived badly damaged…",
          "Contenu": "Photo book has arrived badly damaged (crushed on one corner! Unacceptable, was going to offer as wedding anniversary present to my parents, paid over $150!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T19:45:48.000Z",
          "Titre": "You can only order one project at a…",
          "Contenu": "You can only order one project at a time which forces you to have to pay more to ship each individual project. I will not use Mimeo again as this is not efficient use of shipping and costly overcharge."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Diane Novakowski",
          "Nb_Reviews": 5,
          "Date": "2023-06-12T20:36:44.000Z",
          "Titre": "My parcel did not arrive on time",
          "Contenu": "My parcel did not arrive on time.  It is over a week late and due to arrive June 14-15.  I will write another review once the parcel has arrived."
        },
        {
          "Note": 1,
          "Lieu": "DO",
          "Pseudo": "Cristina",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T12:41:57.000Z",
          "Titre": "I dont have my photobook delivery yet…",
          "Contenu": "I dont have my photobook delivery yet and theres no delivery date either. Since april 26, i dont know what happen"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amelia",
          "Nb_Reviews": 3,
          "Date": "2023-06-22T01:47:14.000Z",
          "Titre": "All the pictures on the book were dark",
          "Contenu": "All the pictures on the book were extremely dark when the real pictures are not dark.I was very disappointed with the final product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T02:56:53.000Z",
          "Titre": "The price was crazy expensive when I…",
          "Contenu": "The price was crazy expensive when I was done $17.99 was the price.. paid $60.00.. over charge for delivery because I admit I needed the book for a birthday gift and was afraid  it would not arrive in time…I paid the upcharge and it was there the next couple of days kinda believe I didn’t need too…"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Walter",
          "Nb_Reviews": 2,
          "Date": "2022-12-09T02:13:58.000Z",
          "Titre": "Unhelpful Customer Services",
          "Contenu": "An issue I flagged with Mimeo's HelpDesk was escalated by them to Customer Services, whose response was neither timely, well-considered, nor helpful."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-19T02:15:40.000Z",
          "Titre": "Still waiting g for customer service to…",
          "Contenu": "Still waiting g for customer service to call me back. I placed two orders only received an confirmation email for one. Link to help on website doesn’t work. Found customer service number on a complaint website. Called and no one has called me back."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Marcel Travella",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T21:39:29.000Z",
          "Titre": "poor results with many under exposed…",
          "Contenu": "poor results with many under exposed pictures"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Rob Misanchuk",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T18:46:10.000Z",
          "Titre": "Great product just can't understand why…",
          "Contenu": "Great product just can't understand why you have to ripe everybody off on shipping. There is no reason you can't get three books shipped at the same time and in the same package. Very sad."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T01:15:36.000Z",
          "Titre": "I never received my card",
          "Contenu": "Paid an outrageous amount for shipping. Card never even showed up. Nice one Mimeo 👍🏻"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer. Charlotte Ribertd",
          "Nb_Reviews": 2,
          "Date": "2022-11-20T17:09:27.000Z",
          "Titre": "Was an error in processing.",
          "Contenu": "After receiving a message that there was an error in the processing of my order, I reached out for help from Mimeo.  Eventually I received 3 messages saying I was given 3 refunds.  I had ordered 8 calendars.  Which orders were being refunded????  I have no idea.  My family looks forward to their Christmas calendars which I’ve given for at least 10 years in a row.  This year, because of this incident, I have no idea whose calendar was cancelled and whose calendar is being made.  Furthermore, I have no idea what went wrong and if and how the problem can be resolved.  This is very distressing.  I hope I can somehow get some answers and the 3 cancelled calendars can be fixed.  I really need to TALK to an agent ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T01:35:53.000Z",
          "Titre": "Your web site makes it almost…",
          "Contenu": "Your web site makes it almost impossible to find active projects. Multiple sign ins codes, ect"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Usweitzer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T06:58:21.000Z",
          "Titre": "Drips and splotches on my album",
          "Contenu": "This is the second time I’ve ordered a photo album and the last few pages have drips and discolouration on them. The books are so expensive - I would expect someone would flip through them before sending them out. They reprinted it the last time - haven’t had time to complain about this one. Just a waste of time, resources and shipping."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T04:45:19.000Z",
          "Titre": "App just stopped working on Mac",
          "Contenu": "Created my holiday cards as normal (done this for 8+ years now)and then the next day the software on my Mac stopped working. I uninstalled Nd reinstalled and it still doesn’t work anymore with Apple photos."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Juanjo",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T13:58:21.000Z",
          "Titre": "Definitely not premium",
          "Contenu": "I used to use Motif Photos (same quality as when Apple ran the service), but it was acquired by Mimeo Photos. The print quality now is terrible, and the feel of the hard-back album too. The only \"premium\" is the cost!"
        },
        {
          "Note": 2,
          "Lieu": "NO",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:33:44.000Z",
          "Titre": "The freight cost is way to high and if…",
          "Contenu": "The freight cost is way to high and if you order a calender and a photo book you cannot combine them in one shipment"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Jerry Barrett",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T04:05:20.000Z",
          "Titre": "Standard and Quality have dropped",
          "Contenu": "I have been ordering calendars from Apple/ Mimeo for a number of years now. This year I felt that the print quality was poor and no envelope/ outer cover. I will probably order from Snapfish next year!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dallas",
          "Nb_Reviews": 7,
          "Date": "2023-12-08T19:59:38.000Z",
          "Titre": "You were fast turning my card orders…",
          "Contenu": "You were fast turning my card orders around, but the quality of the prints, especially blue sky in m,y images on two different orders, was poor.   Very blotchy.  Quite disappointed."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Graham",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T20:44:59.000Z",
          "Titre": "Disappointed",
          "Contenu": "Not impressed by paper stock. 30 minute cancellation policy should be extended. Photos grainy and washed out."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Don Klassen",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T21:25:43.000Z",
          "Titre": "You used to have a calendar that had…",
          "Contenu": "You used to have a calendar that had the date numbers the size of the square for the date. I needed for the seeing impaired, but you discontinued it when you took over from apple. Also I make 4 individual calendars every year and I have to pay separate shipping for each one, people have been asking for years to change that yet you won’t listen to us."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Charles S",
          "Nb_Reviews": 4,
          "Date": "2023-12-07T14:08:30.000Z",
          "Titre": "I ordered prints and was very…",
          "Contenu": "I ordered prints and was very disappointed in the quality.  They were inconsistent and overly saturated for the most part.  The images were shot by a professional photographer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T15:54:08.000Z",
          "Titre": "Very difficult to edit."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Lyn Shaddock",
          "Nb_Reviews": 4,
          "Date": "2023-11-28T03:14:24.000Z",
          "Titre": "It was disappointing Compared to previous orders",
          "Contenu": "It was disappointing Compared to previous books. It was missing the written bits and a major photo of the ship.  The Title was not on the edge as previously."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T21:24:10.000Z",
          "Titre": "Shipping charges are ridiculous",
          "Contenu": "Shipping charges are ridiculous.  Will not be using you again until you either have flat rate shipping, or actual shipping cost (not inflated from USPS)"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 7,
          "Date": "2023-11-06T15:28:38.000Z",
          "Titre": "Unexplained Failure of Photo Book Project to Upload",
          "Contenu": "My 102-page photo book would not upload.  Unfortunately, no explanation was given regarding the reason.  I tried 7 or 8 times to upload, with the same message popping up at the end of each 10-minute try:  \"Sorry, we can't upload your project.  Try again.\"  After each attempt, I tried to correct my project by deleting pictures, deleting pages, rearranging page layouts, etc.  Nothing worked.  All this took 3-4 hours of wasted time.  I finally contacted customer service via e-mail (no opportunity for telephone contact was provided) and a helpful representative promptly explained how to send my project in using an alternative pdf method.  The explanation was complicated, however, so I put off trying it for several days.  When I did, it worked and the project turned out successfully.  While, as usual, I am very pleased with the final product, the entire experience was most frustrating."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T03:33:14.000Z",
          "Titre": "Expensive printing costs and the…",
          "Contenu": "Expensive printing costs and the shipping is way over priced. I ordered prints online through a local CVS and the quality was just as good for a fraction of the cost."
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "Katrin",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T20:28:51.000Z",
          "Titre": "Calendar creation is more complicated than it needs to be",
          "Contenu": "I always appreciate the good quality of the final product. However, the process of creating a calendar seems a little outdated. For instance, try to put a photo on a calendar page (the one with the dates, not the collage). Why does it need to be so complicated? In a former version (apple iPhotos some years ago) this worked just fine, in an intuitive way. What a pity that things get worse rather than better..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Starmapper",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T23:03:56.000Z",
          "Titre": "Won't be using it again",
          "Contenu": "First - you can't preview the themes and honestly they all look the same until you select one and play with it.Second:  NONE of you themes include complete boxes around the dateThird - well, that's as far as I got since I became so frustrated I just updated an old calendar made in Photo, and uploaded the completed PDF to Mimeo for printing (which has gotten ridiculously expensive especially with shipping added!)"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T00:07:49.000Z",
          "Titre": "Transfer from Mac to Mimeo did not work!",
          "Contenu": "I was very frustrated that I could not link the book I created on my Mac to Mimeo. All the photos were cut in 1/2 when it transferred. Changing the photo book size did not help. So, after 8 hours of work on the book and another 11/2 hrs with Mimeo consultants, who were not able to solve the problem, I started completely over. The new book turned out fine but it was not as nice as my original book."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Gillian Bailey",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T19:39:34.000Z",
          "Titre": "Your billing page wouldn’t work",
          "Contenu": "Your billing page wouldn’t work - couldn’t even enter my name & email. So after making a calendar on the photos app (18th) I make one on the web version (safari on my Mac) - when only the credit card # couldn’t be entered. I chatted with ashmir- v helpful - but it appeared to be a system-wide problem. Force quitting didn’t work. Eventually, I got it done on web version via chrome. V Time consuming and bad for my blood pressure."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 3,
          "Date": "2023-01-09T21:50:43.000Z",
          "Titre": "I was not able to use the 27% coupon…",
          "Contenu": "I was not able to use the 27% coupon offered to first time users.  I believe the same discount should be available to any user.  I purchased a calendar from you last year and two this year.  Customer loyalty should be worth at least the same as your deal for a new customer.  I'm afraid I won't be using Mimeo Photos for my calendar needs in the future."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Yvonne B",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T08:55:31.000Z",
          "Titre": "Not including GST in price is not fair",
          "Contenu": "I did not like that I was charged a whole lot of extra costs once I'd completed my project - GST and delivery.  I think it is illegal in NZ to quote excluding GST.The end result was a really nice book which I'm pleased with but cost a lot more than I expected and probably could have got as good for the same price elsewhere"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tracy",
          "Nb_Reviews": 2,
          "Date": "2022-12-29T21:15:57.000Z",
          "Titre": "Clunky",
          "Contenu": "I’ve used the app for the past few years, but this year it didn’t work well.  Really hated that I couldn’t clear the selected picture section for the new project.  Web version was ok -  it was clunky, the edit photo features were lacking and I wanted the ability to include a page of text only.  All in all, it was frustrating rather than an enjoyable."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "BD",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T09:15:10.000Z",
          "Titre": "this is no more a pleasure to make photo Albums with updated version of Mimeo",
          "Contenu": "I am using Mimeo for more than 8 or 9 years. Recently I got problems and updated Mimeo application on my computer. For privacy, I am not transfering all my photos on cloud or open websites, this is my choice and this is the case for years.Why the upgraded version (2 months ago) lot of functions are no more available : I cannot change photos frame and change light, brillance, colors on the photos integrated in the book. To open the files is a nightmare, the path through \"photoApplication\" and \"mimeo application\" is never the same.So, this is no more smooth to use Mimeo tool to make photo books.Hopefully, the quality is good and printing and sending worked correctly."
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "PLee",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T15:29:22.000Z",
          "Titre": "Not User Friendly",
          "Contenu": "It is not user friendly compared to the previous photo book by apple. I am starting a new project and i am still figuring out how to remove the photos from the previous project. There should be no photos selected from previously if i am starting a new project. The layouts are also limited. The old apple product was so much better and it’s a pain to use mimeo"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T20:59:10.000Z",
          "Titre": "The Calendar building process too fussy…",
          "Contenu": "The Calendar building process is very antiquated and cludgey. Particularly for assigning small photos to dates. Should be drag and drop. Requires way too many clicks. Should be able to organize photos by month. Should be able to save custom dates from year to year. Birthdays, anniversaries, etc. It’s like I‘ve never created a project before each time."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Disappointed customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T06:02:18.000Z",
          "Titre": "Disappointing",
          "Contenu": "Payment expected in Euros instead of dollars, no possibility to select type of shipment, very expensive shipment costs, as high as the calendar… I ordered my calendar because I had spent time to prepare it, but this is the last time I use it from the Apple Photos app in view of these high costs…disappointed because I have been using it for years…"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Palter",
          "Nb_Reviews": 2,
          "Date": "2022-12-24T00:10:52.000Z",
          "Titre": "I won't be ordering as many calendars…",
          "Contenu": "I won't be ordering as many calendars this year because of the inability to copy an existing calendar. It takes me hours to add all the notes and photos to a new calendar. If I want to duplicate this calendar I have to repeat the many hours to create another one. You need a copy calendar including copying a previous year calendar for a new calendar year. I commented on this last year and nothing was done about it. Now I just will not be ordering as many calendars."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T01:34:18.000Z",
          "Titre": "You need to have a customer service…",
          "Contenu": "You need to have a customer service phone number to call and talk to live person.  This email and chat does not work well.  Your site can be very confusing for customers who may be ordering from Canada. Would have been much easier to talk to live person and explain my questions.  Response time was very slow in chat.  Wasn’t impressed"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T22:27:17.000Z",
          "Titre": "Product is great, but purchasing process a nightmare",
          "Contenu": "The product is great, but the experience was horrible.  It took five submissions, a call to customer service, four credits to my credit card and for someone to get into they system and override why my project was not fully downloading.  It took me as long to buy the calendar as it did to make it--unacceptable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-12-24T20:26:52.000Z",
          "Titre": "Took Too Long",
          "Contenu": "I submitted my calendar on December 14th. On the 15th I got an email saying the shipment was ON ITS WAY. Then frustratingly I got another email almost a week later on the 21st saying the shipment was on its way again and that the delivery date had changed. I really thought that by submitting the order on the 14th I'd have the calendar by Christmas. I'm disappointed as it's a Christmas gift for my parents that I give every year. I've never had this problem with ordering from Mimeo and may re-think doing so next year."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ellen B Goff",
          "Nb_Reviews": 2,
          "Date": "2022-12-05T18:27:36.000Z",
          "Titre": "Jpeg Format Required",
          "Contenu": "I've made projects with you before, and all went smoothly.  This time I couldn't finish the process so I went to support and got someone who was helpful in getting me signed in, but that wasn't the problem.  He finally said that it was a problem with the images.  I asked then whether the images had to be jpegs and was told yes.  I was trying desperately to finish and buy the calendars to take advantage of the 25% off the order, but by the time I converted the images, the offer had ended.  All went smoothly after that."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lynn Beard",
          "Nb_Reviews": 2,
          "Date": "2023-08-11T17:40:48.000Z",
          "Titre": "Thanks for asking",
          "Contenu": "Thanks for asking.  First off, the shipping price was extremely high to send just a few prints.  Secondly, the quality of the prints was not good.  I had a family portrait where the heads of the people were cut off at the hairline which made the photos useless.  The prints were delivered in a reasonable time but I found that going to Walmart proved to be a much better experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T20:24:54.000Z",
          "Titre": "The Discount Code Would Not Work",
          "Contenu": "The system was glitchy.  After I would input a photo to a calendar date, some of the time (but not always), it would not let me then edit the photo.  Also, I ordered two calendars separately.  One order llowed me to use the \"Lastcall\" discount code but the other one would not recognize it so I could not obtain the discount when I checked out.  I had spent literally hours building the calendar or I would have just cancelled the whole order.  I won't be using Mimeo again, although I have used it for several years now for building calendars."
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "Esther",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T01:29:32.000Z",
          "Titre": "Ink marks throughout pages",
          "Contenu": "I have been using Mimeo for years. However in my latest photo book of 100 pages, there were ink marks in over 50 pages of the book. Totally unacceptable for a print professional"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pamela Bostelmann",
          "Nb_Reviews": 2,
          "Date": "2023-09-04T02:13:15.000Z",
          "Titre": "VERY SLOW DELIVERY",
          "Contenu": "My order was confirmed as having been RECEIVED by you on Aug. 16th.  I was charged $13.99 for shipping.  MY ORDER WAS NOT DELIVERED UNTIL 8/29.  As a result of this VERY SLOW DELIVERY, I was UNABLE TO SEND THESE CARDS TO THE RECIPIENTS IN TIME FOR THEIR BIRTHDAYS!!  I had allowed PLENTY OF TIME for the manufacture and shipping of these cards and the SLOW DELIVERY got it ALL MESSED UP.  I had to pay almost $30 for EXPRESS DELIVERY to get one of the cards to one of the great grandmothers on time for her birthday."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T12:04:16.000Z",
          "Titre": "The program froze multiple times while…",
          "Contenu": "The program froze multiple times while creating the book (like every few minutes as I tried to add more photos)… I kept worrying I would lose everything but it made the whole process extremely slow and worrying. I’ve used this program lots before but am not sure I would again after this experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "AlZem",
          "Nb_Reviews": 2,
          "Date": "2022-11-28T18:46:27.000Z",
          "Titre": "I had a 20% off code, BUT",
          "Contenu": "I had a 20% off code, but it wouldn't take it, so I overpaid $6.99,  Now a day later I get an email for 25% off.  Not good marketing.I have ordered from you for 3+ years and I like the quality and ease of making my projects, but I feel screwed over, so I will have to reconsider for future projects."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T16:47:37.000Z",
          "Titre": "Mistakes Were Made More than half of the 8 1/2”  x  11”…",
          "Contenu": "More than half of the 8 1/2”  x  11” pages were printed at a smaller size.  When I called to ask how I could correct those & reprint the 40 page book, I was told (by two different folks) that it was impossible.  Paralyzed in my place.  Help, please!  Judy"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kerry",
          "Nb_Reviews": 2,
          "Date": "2023-08-08T06:43:37.000Z",
          "Titre": "Frustrated with the difficulty in completing this project.",
          "Contenu": "This is not the first project I have made with your company, but I could not get the extension to work. We had to chat with a representative and go online, which indicated a lot of others have had issues like this.  It took me a great length of time to finish this project.  I was pleased with the final project, though.  Also, completed a survey and received a discount code, but it would not work when I tried to use it on this project."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DW",
          "Nb_Reviews": 2,
          "Date": "2023-04-16T22:50:46.000Z",
          "Titre": "Price seems a bit high for what you get",
          "Contenu": "The quality of the framed print is nice, but the frame itself feels like it’s on the cheap side. The online interface was frustratingly limited as well as the options for frame sizes etc, and the prices seem high for what you get. Customer service was helpful which I appreciated but I will probably just use a local place next time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tanya Stockland",
          "Nb_Reviews": 2,
          "Date": "2022-12-21T20:10:47.000Z",
          "Titre": "Good quality calendar, poor quality shipping and packaging",
          "Contenu": "The quality of the calendar we ordered was great, the unfortunate part was how the calendars were shipped. Not only did the prices go up several dollars per calendar, the packaging for the shipping was low quality. All the corners of our calendars were damaged and bent when we received them. These are gifts for our families, so it's pretty disappointing that you're raising your prices and yet skimping on packaging where the items get damaged. I'll be using another service next time. Don't raise your prices if you're going to skimp on delivering what could have been a much better quality experience and item."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-10T01:00:12.000Z",
          "Titre": "This App Could Be Great, But Needs Improvement",
          "Contenu": "The experience of creating the album was tricky because the photos imported into the app according to image ID #, rather than timestamp or the order I had put them in.  Because I was putting together three different cameras' worth of photos, it was a nightmare trying to choose the shots from a given moment--I had to constantly scroll to see the rest of the photos from that moment, which were in three different places.  Also, the default margin between photos is too small, but the next default size up is too big!  It would be nice if the space between photos were more easy to adjust.Finally, when I got everything placed where I wanted it, I was excited for the final product.  Two of my albums arrived banged up in one corner and all three had grainy images--shouldn't the print quality be better for $150???"
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T00:27:03.000Z",
          "Titre": "International shipping (unable to combine projects)",
          "Contenu": "I like that I can create a project straight from the photos app on my mac.I really dislike that you cannot combine shipping. Shipping to NZ is EXPENSIVE. I ordered four photo calendars as Christmas gifts for grandparents. They were created as two projects of two calendars each (as different photos were used for each project). I was unable to ship the projects together and ended up paying over NZ$50 to post the four calendars. I would have placed the order elsewhere except I had already spent so much time creating the calendars and did not have time to repeat the process.The quality is GREAT but I would not order again unless I could combine shipping or shipping was reduced. Thanks"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "dissatisfied customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-27T21:00:40.000Z",
          "Titre": "Despite multiple requests from multiple…",
          "Contenu": "Despite multiple requests from multiple users, you still have not implemented the ability to include pictures in the vacant day blocks of a calendar month (i.e., adding a picture into the dates of the previous or next month that appear on a given calendar month).  This was a feature of the original Apple-based calendar.  Please re-code your app to allow this to happen."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Jetstar enjoyer",
          "Nb_Reviews": 3,
          "Date": "2023-04-27T21:38:37.000Z",
          "Titre": "Tiny sized photographs sent on large…",
          "Contenu": "Tiny sized photographs sent on large pieces of paper. Absolutely terrible. No mention of this resizing before they were sent. Very disappointed and want my money back.I will upgrade this to two stars because the refund was issued without delay, thank you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Rhoads",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T20:21:25.000Z",
          "Titre": "Poor instructions…",
          "Contenu": "It’s not at all obvious how one makes Christmas cards on Mimeo, even though I have done it for five years running. Details of the process change every year, so I started out by emailing Mimeo to get some guidance on how to proceed. I got a response saying someone would get back to me soon, but no one ever did, so I ended up trying to figure it by myself. I ran into  problems and was unable to submit my order despite the fact that I tried three different credit cards, plus Apple Pay. I contacted Mimeo again for help but didn’t get a timely response. All of this could’ve been avoided if there had been a clearer set of instructions on how to proceed."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Dawn",
          "Nb_Reviews": 1,
          "Date": "2022-11-27T00:39:15.000Z",
          "Titre": "Unimpressed",
          "Contenu": "Mimeo indicates that you can choose from a variety of different styles of calendar (that is all we typically create) but they are essentially all the same. The shipping is ridiculously expensive and if you order two different products going to the same destination, even within minutes apart, you pay for shipping twice.  Not only is this frustrating for the consumer, it is inefficient for Mimeo.  The reason there are two stars is the result of the product is fine.  However, I have three different reminders to choose a different company next year."
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "ST",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T19:47:21.000Z",
          "Titre": "I’m still waiting….",
          "Contenu": "While I enjoyed using the app to create my photo book, it is taking too long to reach me. I was supposed to receive it on 17Jan. But I see on the tracker that it’s been stuck in Melbourne awaiting departure for the last 2 days!"
        },
        {
          "Note": 2,
          "Lieu": "BE",
          "Pseudo": "Pierre",
          "Nb_Reviews": 3,
          "Date": "2023-08-16T14:17:50.000Z",
          "Titre": "Too expensive",
          "Contenu": "Too expensive compared with other solution available on the market.I won’t use miles photos anymore.That’s a pity because it easy to use with app Photo on macOS."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T19:46:09.000Z",
          "Titre": "Nothing so far but wanted your…",
          "Contenu": "Nothing so far but wanted your attention. have purchased 3 copies of a photo book and I had questions during the building of it. You do not have a contact number for help and whatever was online doesn't help or answer the question."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customerJH",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T21:32:34.000Z",
          "Titre": "The photos weren’t printed out…",
          "Contenu": "The photos weren’t printed out properly, but the issue was resolved very quickly with a refund. I don’t think I’ll use the service again, unfortunately."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Beth",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T01:16:21.000Z",
          "Titre": "Clarity missing on the book",
          "Contenu": "I ordered a calendar which I was very happy with. The book, however, seemed to lack the crisp clarity from the print process that was evident in the calendar. This review is delayed because I just returned to visit the area where both the calendar and book were delivered to. I never had that problem when Apple printed my books. And all my photos were reviewed for clarity on my iMac prior to sending them to you for the book."
        },
        {
          "Note": 2,
          "Lieu": "BE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T09:23:30.000Z",
          "Titre": "Printed colours often are different…",
          "Contenu": "Printed colours often are different from what we get on our computer screen. Calibration problem? Many printed pics are too dark. Considering the price, this should be avoided."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christine Celata",
          "Nb_Reviews": 2,
          "Date": "2022-12-15T01:42:03.000Z",
          "Titre": "There is no way to shrink a photo to…",
          "Contenu": "There is no way to shrink a photo to fit a picture frame.  The customer service person worked with me, but told there is no way to do it.  There are so many things about this program that make doing normal things difficult."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Flavie",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T08:00:27.000Z",
          "Titre": "Way too expensive for the tiny cheap…",
          "Contenu": "Way too expensive for the tiny cheap looking book we received. Plus we payed as much in shipping cost than for the book itself. We only found out after spending hours making the book. So we dumbly paid 30€ pour a tiny photo book. That’s a total rip-off."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Sheila Jensen",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T22:45:55.000Z",
          "Titre": "I ordered five photo books",
          "Contenu": "I ordered five photo books. One had pages missing. Another was sent out right away to replace it and I did receive apologies from staff.  I order books every spring and calendars every fall, plus some puzzles. I have found the quality to be very good until this last order. The book folders have started to rip and are not as sturdy as usual. A “we are sorry” coupon for a future order would be appreciated."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "antonello Cozzolino",
          "Nb_Reviews": 2,
          "Date": "2023-01-15T19:53:25.000Z",
          "Titre": "The flow is not fluid",
          "Contenu": "The flow is not fluid. Having to download the photos from another platform makes it slow to built the calendars or books. Sorry but it was a lot easier when Apple included the option within it’s photo app. a"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T22:11:38.000Z",
          "Titre": "So time consuming trying to upload…",
          "Contenu": "So time consuming trying to upload photos. Could not upload album, had to do it one at a time. Have some duplicates in my photo book but it’s way too confusing to move photos around which could have resulted in less pages. This book is over $130.00. I can’t afford that so I didn’t order it. My first book was only $56.00."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-18T05:33:39.000Z",
          "Titre": "Your user interface is slow & not very…",
          "Contenu": "Your user interface is slow & not very intuitive.  There are 2 structural things that would make it a lot easier to use:1) Although you can copy a project, you cannot batch delete photos so you either have to delete them one by one, which is painstakingly slow or navigate a much larger photo selection.2) You cannot copy a page layout, so if you want multiple custom pages, you have to either copy the layout one picture space at a time (let's say 12 in a double page spread w/ 6 pictures per page) or build from scratch.Both seem like easy improvements to make, but I've contacted customer service every time I've made a book (once a year for the past several years) & no upgrades have been made."
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "Mágala Gómez",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T18:02:36.000Z",
          "Titre": "Mistreated albums",
          "Contenu": "I order one album every year for my anniversary. I´ve loved it every year, its such a good memory for my boyfriend and I. I live in México but I always order it to the US, since I have a place there aswell. This is the first year I order it to México and both albums arrived mistreated, I probably won't order to México again. I just wanted to tell you so that you can take care of the packaging and avoid this from happening to other customers."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T01:28:24.000Z",
          "Titre": "I was very disappointed that I couldn’t…",
          "Contenu": "I was very disappointed that I couldn’t add multiple calendars to my cart. I made 4 different ones and had to pay 4 separate shipping costs. I will not be using Mimeo in the future unless they change this feature."
        },
        {
          "Note": 2,
          "Lieu": "BE",
          "Pseudo": "Myriam Ghyselen",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T16:22:18.000Z",
          "Titre": "Great book but poor and expensive shipment",
          "Contenu": "Great book, but I payed more than 12 euro for shipment, that went completely wrong. My book ended up in Capri, Italy. I received a message that I had to get in touch with UPS myself. In the meanwhile, I got my book, but for such an amount of shipping costs, I would expect Mimeo to deal with this problem and not me as the client."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T00:27:44.000Z",
          "Titre": "I completed a photo book for my daughter’s 18th birthday",
          "Contenu": "I completed a photo book for my daughters 18th birthday and it cost approximately $250. I received it the other day and was disappointed with the quality of the photos and the thickness of the pages. For the past 7 years I have been using Mimeo to generate a year in review photo book and the quality has been excellent, except for the latest book. Abit disappointed as they are not cheap."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Heather O'Connell",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T21:38:01.000Z",
          "Titre": "The app crashed on me so many times",
          "Contenu": "The app crashed on me so many times. I had so much time invested in uploading my pictures, so I didn’t want to quit. If I knew it was going to crash and take so much time I would have used a different app."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Linda White",
          "Nb_Reviews": 1,
          "Date": "2022-11-27T04:05:16.000Z",
          "Titre": "Pictures are way too dark",
          "Contenu": "Pictures are way too dark, losing beautiful detail. I used the programs auto-lighting option to ensure the pictures were light enough because they were to dark on my 2022 calendar you did for me last year."
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T09:49:32.000Z",
          "Titre": "The estimated delivery time / shipping…",
          "Contenu": "The estimated delivery time / shipping time is totally inaccurate and not up to date. The book quality is acceptable. Would prefer the book wrapped in a plastic cover/bag during shipping especially the humid rainy weather might damage the parcel box."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-19T19:00:25.000Z",
          "Titre": "My calendar photos printed out much",
          "Contenu": "My calendar photos printed out much, much darker than the actual photos themselves. I can forward screen shots if it will help, but these printouts are not reflective of the source material at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Don",
          "Nb_Reviews": 2,
          "Date": "2022-11-25T07:39:49.000Z",
          "Titre": "the final result was good",
          "Contenu": "the final result was good, but the user interface could use improvement in making the editing easier.  I had to start over at least three times because I couldn't figure out how to undo mistakes and there is no help function or instructions that I could find."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Colleen Joan Spencer",
          "Nb_Reviews": 4,
          "Date": "2023-10-23T20:14:18.000Z",
          "Titre": "Text print was different on EACH page!!",
          "Contenu": "The text on each page was printed smaller and smaller until by the end of the book it was unreadable = very disappointing"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Helene",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T00:55:30.000Z",
          "Titre": "I think that the books are quite…expensive",
          "Contenu": "I think that the books are quite expensive compare to the competitors.The shipping fees are way too high and you find out only at the end when your project is ready to be shipped.I had pictures deleting as I ordered my project only a while after making it.Mimeo could not get my pictures from the cloud so I had to download them all over again even though I has first downloaded them when first creating my album"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Joel",
          "Nb_Reviews": 1,
          "Date": "2022-11-27T22:12:24.000Z",
          "Titre": "Expensive, limited layouts",
          "Contenu": "Was always expensive but now more expensive.  Layout features are still limited - have to manually make borderless layouts for each page - particularly when dividing into thirds."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frances Lewis",
          "Nb_Reviews": 2,
          "Date": "2022-12-13T19:55:04.000Z",
          "Titre": "Wish the process had been simpler",
          "Contenu": "I found the creation of project very difficult to navigate -After creating the one project I took to completion i desired many more but in frustration switched to another photo site."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Red Dog Racing",
          "Nb_Reviews": 9,
          "Date": "2023-02-09T07:31:26.000Z",
          "Titre": "Watch the year of the calendar you are creating. Be sure you adjust the default date that Mimeo presents on the first few steps………..",
          "Contenu": "When creating calendar in late Dec 22/early Jan 23, the default year that comes up on the beginning of the process is 2022. But it’s the end of 2022, about to be 2023 in a matter of days. This makes no sense at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Fancher James Fancher",
          "Nb_Reviews": 2,
          "Date": "2023-08-17T20:06:25.000Z",
          "Titre": "Damaged in shipment",
          "Contenu": "1st attempt at printing a photobook was damaged in shipment and printed way too dark. I called and the book was reprinted to our satisfaction."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Tim Noble",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T22:51:46.000Z",
          "Titre": "I had to use an App Cleaner before the…",
          "Contenu": "I had to use an App Cleaner before the app would work.  Once it got working, I had difficulty ordering as it kept saying that it couldn’t save my billing address.  the Tech Support were saying, don’t check this or don’t put a space in the postal code, etc..  Honestly, the app should work with spaces, dashes in phone numbers and regardless if you check a box or not (or remove the box completely).  I have ordered 7 calendars through Apple when it was with them, or Mimeo when they got out of it.  Next year - the FIRST TIME IT FAILS, I will go with a different app.And with all the technical problems, I spent almost an entire afternoon on tech support, I ended up making a mistake on the calendar.  Why?  Because I was too fussed about making it work and not taking the time to check what I was doing - and now I can’t change it."
        },
        {
          "Note": 2,
          "Lieu": "BE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T00:11:25.000Z",
          "Titre": "Plugin on Mac OS runs extremely slow…",
          "Contenu": "Plugin on Mac OS runs extremely slow with of connection issues. We ordered 3 different calendars but had to pay 3x an expensive expedition fee. It is impossible to group"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carol",
          "Nb_Reviews": 2,
          "Date": "2022-11-26T02:43:41.000Z",
          "Titre": "Had trouble adding photos to my…",
          "Contenu": "Had trouble adding photos to my project. Also had a problem setting up my card project…kept getting a phot album template. I found this project not user friendly."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T19:57:08.000Z",
          "Titre": "Your app is not very user friendly in…",
          "Contenu": "Your app is not very user friendly in my opinion. I have used it several times mostly to make calendars and still find it frustrating. E.g., Why is it so difficult to add extra photos to your project by dragging them into it? It often takes more than one attempt. Why are half the pages called “Collage” instead of, say, “April Photo Page,” etc.? Why all the choices of calendar templates when many of them are little if any different from the others? It takes me far more time than it should to produce a calendar!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T12:20:05.000Z",
          "Titre": "meh...",
          "Contenu": "I ordered prints and did not receive all of the prints that I had ordered.    I ordered several prints of various sizes and did not yet get the 2 prints that were a nonstandard size (5x10).    Otherwise the prints I received were fine."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Laura Hoffman",
          "Nb_Reviews": 1,
          "Date": "2022-12-24T00:10:35.000Z",
          "Titre": "I wanted to reorder an album and…",
          "Contenu": "I wanted to reorder an album and several pictures had vanished. I’m not going to make anymore photo books with you since the photos often disappear years later."
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "Benoît Rebetez",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T09:55:17.000Z",
          "Titre": "I created a 220 pages book and the…",
          "Contenu": "I created a 220 pages book and the first and last page (with photo) is not perfect sticked. Usually, everything are perfect with Mimeo, but this time, not the case.I wood love also to have a template \"Photo Book\" where we didn't have any margin to the end of the page. A border between the photo is perfect, but the margin to the page, I changed all the time all photo...and take a lot of time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T02:56:01.000Z",
          "Titre": "You can’t reorder a product.",
          "Contenu": "I spent a lot of time creating a Calendar for my parents that they loved and wanted replicated. This option is not available."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T21:18:46.000Z",
          "Titre": "Please fix the iOS app",
          "Contenu": "Please fix the iOS app. It crashes every time I ordered my project and tried to pay with Apple Pay. It takes the money from my credit card but my project never gets shipped. This happened to me two times, the app would crash as soon as you submit payment. I had to order on the website instead.Support team is fantastic, very fast replies. Was able to get my money refunded both times."
        },
        {
          "Note": 2,
          "Lieu": "NO",
          "Pseudo": "Lars",
          "Nb_Reviews": 4,
          "Date": "2023-11-14T19:20:00.000Z",
          "Titre": "The delivery has been way too late with…",
          "Contenu": "The delivery has been way too late with little communication."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Sandy W",
          "Nb_Reviews": 2,
          "Date": "2022-12-07T00:45:06.000Z",
          "Titre": "Not easy to use",
          "Contenu": "Not easy to use. Help instructions too hard to find. Very expensive. I preferred the Apple app which was much easier. Not likely to use it next yesr."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kenninghouse",
          "Nb_Reviews": 1,
          "Date": "2023-02-26T01:01:57.000Z",
          "Titre": "Weak midtones, lack of balance",
          "Contenu": "Photo midtones were weak, while the tints were too pale, and the darks were too dark. Seems there needs to be better white balancing and black balancing in the prints."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Halcyon M",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T19:32:26.000Z",
          "Titre": "I'm a little disappointed that one day…",
          "Contenu": "I'm a little disappointed that one day after ordering, a 15% discount on calendar ordering appears in my inbox. So I ended up paying full price."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "HS",
          "Nb_Reviews": 2,
          "Date": "2022-12-13T05:32:13.000Z",
          "Titre": "Time consuming process to produce calendar.        For the past 5 years if not more we’ve…",
          "Contenu": "For the past 5 years if not more we’ve been asking Mimeo to enhance the calendar process by enabling us to save events for the following year.  Said differently, allow us to duplicate the calendar project, change the start date of the dupe project and remove all photos.  That would actually save time in terms of data entering dates year after year.  Apple photos used to let us do that.  I create and purchase 10-12 calendars every year and it literally takes me 2-3 weeks part time to complete all data entry and photo choice and layout.  I wasn’t going to do it this year, but the recipients really like the calendar.  This may be my last time and I am going to warn others that this while the product is lovely, it is takes a lot of time to produce that I’ll never get back.  I would add that it’s disappointing to see that Mimeo has asked for and seen feedback similar to mine for years, but refuses to do anything in terms of rectifying the situation."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Priyanthy",
          "Nb_Reviews": 3,
          "Date": "2023-06-25T16:35:39.000Z",
          "Titre": "The image didn’t look as sharp as it…",
          "Contenu": "The image didn’t look as sharp as it did on my photo and perhaps a glossy print would have been better."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Charlene Forbes",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T05:02:05.000Z",
          "Titre": "I can no longer do a calandar as I…",
          "Contenu": "I can no longer do a calandar as I don’t have your lasted update as my computer is too old. Also I wanted 2024 and I got a2023 calandar."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Philippe LEMAIRE",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T15:56:35.000Z",
          "Titre": "Your products are fantastic but too…",
          "Contenu": "Your products are fantastic but too expensive … Although I believe I’m a faithful customer, I’m never given any promotion code nor any kind of discount year after year."
        },
        {
          "Note": 2,
          "Lieu": "AT",
          "Pseudo": "Maximilian Kunz",
          "Nb_Reviews": 4,
          "Date": "2022-11-15T12:13:23.000Z",
          "Titre": "Quality in book is NOT related to quality data in App",
          "Contenu": "The Apple Photo App and the technical part worked well. However, again and again the app defines certain photos with a bad quality (which I tried to minimize). When the photobook was delivered I experienced that all photos marked with bad quality look perfectly fine, and most of the others are in a bad quality. Summarized: I paid 330.- for 3 copies. For this price I can expect a better quality and since this happened not for the first time, I will use another provider in the future."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-19T01:33:06.000Z",
          "Titre": "Shipping fee a Rip Off",
          "Contenu": "Although calendar price is fair the cost of shipping[[ing is outrageous! Shame on you. It's a bait-and switch scheme. Will not use again"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "adbiwer",
          "Nb_Reviews": 2,
          "Date": "2023-07-16T21:57:55.000Z",
          "Titre": "Delivery service is really poor",
          "Contenu": "Delivery service is really poor. It took more than 2 weeks transit time, and in the end I had to pick it up at the ups depot…."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryan Noakes",
          "Nb_Reviews": 2,
          "Date": "2023-02-19T08:30:59.000Z",
          "Titre": "Still haven't received package..",
          "Contenu": "Still haven't received package... went track shipping just says it's arriving the next day. Been like that for 5 straight days."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T20:11:29.000Z",
          "Titre": "Shopping cart made it impossible to…",
          "Contenu": "Shopping cart made it impossible to input the 10% promo code so I finally gave up.  I don't like it when companies rob me.  Cost me $26"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Kageorge",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T08:18:47.000Z",
          "Titre": "Problem Fix Promise Broken Every Year",
          "Contenu": "I am disappointed that year after year after year I spend hundreds too much on shipping. I place all my orders at the same time. They are coming to the same address. But they are needlessly, wastefully, and inefficiently (resource-wise) shipped separately. It is sooo customer UNfriendly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sandra",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T15:22:56.000Z",
          "Titre": "My issue is still not resolved… I was…",
          "Contenu": "My issue is still not resolved… I was to hear back from someone… and no one has responded to me yet"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Greg C.",
          "Nb_Reviews": 2,
          "Date": "2023-08-21T18:38:45.000Z",
          "Titre": "Low quality",
          "Contenu": "Low quality paper and development. Doubt I will use this company again."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T22:51:03.000Z",
          "Titre": "It could be better",
          "Contenu": "Supportline with quick, friendly response but without solutions after a huge delay of production und delivery…"
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-07T20:11:36.000Z",
          "Titre": "The quality of the card didn’t match my…",
          "Contenu": "The quality of the card didn’t match my expectations. The folio came off when I received it."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:15:12.000Z",
          "Titre": "Damaged product",
          "Contenu": "I think the quality of the product/pictures is very good. I was however very disappointed that the corner of my calendar was folded when I took it out of its packaging. More care should be given by your team when placing the final product in the Mimeo packaging. Considering having received a damaged product (not due to shipping) I find your product pricey. Not sure I will order again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T02:20:32.000Z",
          "Titre": "Try to match colors and values to the submitted file",
          "Contenu": "Try to match colors and values to the submitted file.  The postcard looks duller and less saturated in the colors.  The postcard is a little bit darker in value.  Pleased with the turnaround time for the final cards and envelopes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T03:55:18.000Z",
          "Titre": "The app is great and easy to use, but the single order is a drawback",
          "Contenu": "The app is great and easy to use to create the calendars.However, the fact that we cannot order more than 1 calendar creation (I create 4 different calendar christmas gifts/ year) per order is a serious drawback that is making reconsider my use of Mimeo."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Skeeter",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T01:55:22.000Z",
          "Titre": "Not consumer friendly!",
          "Contenu": "Mimeo makes it difficult to tie your book projects to their so called promotions. I tried numerous times to design 5 travel books for my daughter and could not make their codes work. In the end, they got what they wanted, my 5 books at $250.00 full price, and from now on it's Shutterfly for my projects!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "james",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T20:12:35.000Z",
          "Titre": "I have use mimeo photos to make…calendars",
          "Contenu": "I have use mimeo photos to make calendars for many years.  This year was a bit disappointing as many of the photos came out darker than desired."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andy",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T21:25:20.000Z",
          "Titre": "We have ordered many calendars from you…",
          "Contenu": "We have ordered many calendars from you over the years. There quality is great, but the app is not very. User friendly and should be improved.  I don’t think it has ever been worked on since its creation."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Scott W",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T18:27:43.000Z",
          "Titre": "I use Mimeo and Photos to make Family Calendars",
          "Contenu": "I use Mimeo and Photos to make calendars for family every Christmas. The final product, as delivered is fantastic, but... Mimeo works just ok. I find it clunky to work with while editing calendars, for example there does not appear to be the ability to make global page layout change. Program is also buggy, requiring Photos to be quit and reopened.The ordering process is also clunky. For example, it requires me to re-enter my CC info for every order.Finally, the pricing has gotten too high; came to over $40 per calendar this year including shipping. At that price, this will probably be my last year making family calendars... or at least I will be MUCH more selective as to who gets them."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Kazuyo",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T01:37:33.000Z",
          "Titre": "Ok but not great.",
          "Contenu": "I ordered a couple of photobooks as school gifts. Delayed a few days to be delivered which wasn't great. And the huge Mimeo logo on the protection cover wasn't great either. We won't use this company again."
        },
        {
          "Note": 3,
          "Lieu": "IE",
          "Pseudo": "John Clerkin",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T01:42:25.000Z",
          "Titre": "Hidden costs are too much!",
          "Contenu": "The experience of adding photos has always been clunky even when Apple managed the calendar creations. What I can't believe is the crazy price of shipping this year, I have been creating calendars every Christmas for the past 15 years and never seen it so costly. It was advertised as 27 euro but then added on another 12 for shipping and a further 9 for tax! Far too expensive, only the fact I spent a long time creating the calendar did I proceed with purchase, next year I will look elsewhere!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ric Rosow",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T23:44:20.000Z",
          "Titre": "End Product Very Good - Getting there is cumbersome",
          "Contenu": "I find the end product - in the case a calendar - to be very good. I find the interface to create a calendar cumbersome."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Sandra geiger",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T18:34:13.000Z",
          "Titre": "The quality of the printing is not very…",
          "Contenu": "The quality of the printing is not very good, too dark and colorful compared to other years. Delivery took for ever."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Rebekah Kelly",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T10:14:03.000Z",
          "Titre": "Good service, print quality could improve",
          "Contenu": "Good service, but really wish the print quality was better. Its the best app around for doing it from photos but its a an expensive thing to do and i am dissapointed with the print quality!"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Tom Lee",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T02:25:56.000Z",
          "Titre": "Great product, mediocre software",
          "Contenu": "Quality of product was excellent. The software was really cumbersome when I needed to change layout, explore different picture options, or simply organize the many pics that I have. Also DHL as a shipping service is always a little nerve-wracking as it ships from US to Canada. Really wished they used USPS + Canada Post."
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T09:10:45.000Z",
          "Titre": "There is a misalignment in the…",
          "Contenu": "There is a misalignment in the printing.I would like to see an improvement in the unusually high shipping costs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T09:20:16.000Z",
          "Titre": "Damages photo pages.",
          "Contenu": "Love your products which I've been purchasing for 13 years.   However this last order 3 calendars had pages with white streaks across the images.  for this i only gave a 3 stars."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T04:17:01.000Z",
          "Titre": "Great printing service, customer care not as much",
          "Contenu": "Photobooks in the usual quality and fast. Box and three out of ten books were tainted with ink, some still wet when arriving. Photographs were not enough to just get replacement of these three, which was the cheapest order I ever did (~$15 each)."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Barry Ulman",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T06:53:46.000Z",
          "Titre": "The end product is great",
          "Contenu": "The end product is great. Photos well produced on heavy paper. Getting that result was a bit challenging.     I had to second-guess how to download the photographs. I couldn't just drag them from my desktop. I ended up making an \"album\" of the photos that I wanted. I was able to get those pics into the program. It took me a while to figure out how to adjust the size of the lettering beneath each photograph. I wanted a white margin at the bottom of each picture for the title. I never could get that, so I made do with the title in the photograph at the bottom."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T01:56:18.000Z",
          "Titre": "Its hard to edit within your program",
          "Contenu": "Its hard to edit within your program, especially to re size/zoom or move slightly right or left.  When you do outside of program the picture file then doesn’t fit with your parameters.Also the identification that youve used a picture already, isn’t quite strong enough, I used 2 twice"
        },
        {
          "Note": 3,
          "Lieu": "DK",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T21:17:06.000Z",
          "Titre": "Well",
          "Contenu": "Well - You have agood product - but the app is clunky and You need skills to make something nice."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Darlene",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T22:36:02.000Z",
          "Titre": "Too expensive",
          "Contenu": "I like your calendar product but unfortunately it is getting far too expensive to keep ordering."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Alain",
          "Nb_Reviews": 5,
          "Date": "2023-11-07T20:20:21.000Z",
          "Titre": "Product is ok, delivery not",
          "Contenu": "Product is ok, but expensive. Delivery via UPS is lousy. Got a notification, stayeyat home, and they dropped it at a collection point. They didn’t even pass by. I ordered 2 albums and couldn’t combine the delivery and thus paid the delivery fee twice."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T07:38:10.000Z",
          "Titre": "Discount code always gets rejected",
          "Contenu": "I was disappointed for the second time when the check out process kept rejecting the 25% discount code I received via email. It’s happened before and I can never seem to get through to customer service to rectify the issue. Clearly there is a bug in the software but mimeo doesn’t want to hear about it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bret Schlesinger",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:38:08.000Z",
          "Titre": "Challenging but wiorth it",
          "Contenu": "Although creating the calendar was a real chore and couldn't have been completed without assistance the finished product was a joy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ro",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T23:34:23.000Z",
          "Titre": "Ordering the printed project was BEYOND difficult.",
          "Contenu": "Ordering the printed project was extremely difficult.  I did the project using Motif, which is one of the options listed by Apple Photos.  I was unable to order it directly.  Fortunately the help people at Mimeo were, after MANY exchanges of emails, able to figure out a way to order by using a circuitous set of steps.  The finished product looks very nice, but, I will certainly not use the Motif options ever again.  I actually prefer it to Mimeo because it seems more simple."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T00:05:59.000Z",
          "Titre": "Just ordered several calendars for…",
          "Contenu": "Just ordered several calendars for 2024. Price keeps rising, but quality is not keeping up."
        },
        {
          "Note": 3,
          "Lieu": "HK",
          "Pseudo": "customer from HK",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T21:08:39.000Z",
          "Titre": "Mixed experience",
          "Contenu": "App was relatively easy to use and photo book arrived quickly. However I was entirely satisfied with the product.  On the spread where there was one photo across two pages, a large portion of the photo couldn’t be seen as it was inside the spine.  For this reason I would be unlikely to use Mimeo again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SUSAN",
          "Nb_Reviews": 8,
          "Date": "2023-11-03T20:16:06.000Z",
          "Titre": "I am generally happy with you and the…",
          "Contenu": "I am generally happy with you and the quality of your products. I do find it difficult to navigate at times as with my last order. I wanted to order one holiday card per each photo. I had to order 10 cards per photo, or pay more for shipping... than the cost of one card.I do think your shipping costs are too high on anything I've ordered. It would be nice also if you offered more discounted offers. Shutterfly does better than you in that area."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Robert F.",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T20:48:35.000Z",
          "Titre": "The quality is great",
          "Contenu": "The quality is great, but one star off because it was not clear in Apple Photos that part of the image would be wrapped to back of the frame (gallery wrapped canvas), subsequently cropping off parts of the imager to the side, that I hoped would be sufficiently on the front panel. I had done a lot of Photoshop work to extend the image to fit according to what's indicated in Apple Photos. It would be nice to have that extra guidance. I took another star off because the largest canvas size I can seem to get from you in Canada is 11x14\", much smaller than desired."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Robinson",
          "Nb_Reviews": 3,
          "Date": "2023-11-13T01:01:55.000Z",
          "Titre": "Overall good; some easy improvements would be welcome",
          "Contenu": "I appreciate the quality, but Mimeo needs to work on their app to allow more flexibility in working with, adding to, or changing preferences, and baseline information.The shipping packaging is not as good as it was even a year ago."
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T02:28:32.000Z",
          "Titre": "By and large good",
          "Contenu": "By and large good, but editing gets a bit long as it keeps going back to the beginning. If there are page/month thumbnails it will be easier - and faster - to complete the project. Otherwise all good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "IPhoto fan",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T21:12:24.000Z",
          "Titre": "Ridiculous shipping cost",
          "Contenu": "The quality of the prints I ordered was fine.  The exorbitant shipping fee will keep me from ordering in the future.  I could accept the high price of my order if the cost of preparing the prints was higher, but the shipping was (much) lower.  I hate spending $14 shipping on a little envelope!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gregg Logan",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T22:03:46.000Z",
          "Titre": "Not too impressed",
          "Contenu": "Not too impressed, photos look dull. The photos I uploaded were shot on a Sony A1, high megapixel and edited in photoshop to look great. And they do other places I printed them, such as an MPIX calendar I made. This book is a disappointment."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "customerC",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T18:18:03.000Z",
          "Titre": "Good quality of the final book but annoying design process",
          "Contenu": "Good quality of the final book and quick delivery, but the design process was REALLY annoying. I wanted to create a book out of two prior books I created and the apple mimeo app just wouldn’t let me cooy readily designed pages I had alteady done from one work to another. Also the app crashed several times. Really restrictive and annoying, so I‘m looking for another apo/service ti design my next works. Really a pity because I liked the quality of the print snd binding."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tatchum",
          "Nb_Reviews": 2,
          "Date": "2023-08-23T02:25:57.000Z",
          "Titre": "Easy Assembly, Frustrating Pricing",
          "Contenu": "Putting the book together was easy and intuitive. Pricing is frustrating. After investing hours of work to make a book at a pre disclosed price, you are hit with the added cost of unreasonably high postage. These are books and can go at a low book rate. If you search the internet and the stars are alined, you might find a discount code to offset part of the postage... maybe not. It would be much better to offer your quality product at a total price that seems fair and not engage in a form of subterfuge."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T22:58:13.000Z",
          "Titre": "I did not find your app to be very…",
          "Contenu": "I did not find your app to be very simple to use know where the placement as photos as good as it has been in the past. I also had difficulty creating and moving text messages. The final product looks good but not great. Some of the photos that span two pages get cut off in the middle because of the binding. I will probably be looking for a different application in future. ."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Michael Bondy",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T20:35:01.000Z",
          "Titre": "Generally good but the text on the…",
          "Contenu": "Generally good but the text on the cover was a bit blurred. All the text inside the book was clear. Never had this problem on any of our other amimei books"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T21:54:11.000Z",
          "Titre": "Mimeo is GOOD but could be GREAT",
          "Contenu": "Mimeo is GOOD but could be GREATMy wish list includes:- Making customized dates easier, including importing dates from prior year calendars (e.g., birthdays)- allowing for mini photos on dates that are greyed out (e.g., prior or next month)- interface that is less clunky between page changes- click and drag photos from underlying sources"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T19:58:45.000Z",
          "Titre": "The ease of it connected to my photos…",
          "Contenu": "The ease of it connected to my photos on my MacBook is excellent. The ability to make it look nice and professional is also very good. It is not very user friendly and the ability to customize things is difficult and there are not enough options. There should be more fun pages that you can add and other photo books have things like stickers that you can put on pages which would be nice. Also, the ability to \"zoom out\" in some of the photo layouts would be helpful as occasionally it cuts off some of the picture."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T03:45:34.000Z",
          "Titre": "Mimeo valentine card 2023 review",
          "Contenu": "Two things would have helped me more easily create the photo card I wanted to make: 1) I would like to be able to change the theme of the card without going all the way back and starting over (and if there is indeed a way to do that, some obvious instructions would be good), and 2) the colors of the background and the colors of text should be coordinated so they can be easily matched within the card."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T01:53:36.000Z",
          "Titre": "I had trouble seeing the texts that I…",
          "Contenu": "I had trouble seeing the texts that I added and positioning them. I also wanted more flexibility for size and location of pictures on pages. The circle that had my initials ( for login or something) was in the way of using options easily. But I am happy with the quality of the book."
        },
        {
          "Note": 3,
          "Lieu": "IE",
          "Pseudo": "Fiona Quinn",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T21:33:22.000Z",
          "Titre": "The shipping and VAT costs make products too dear.",
          "Contenu": "The quality is top class.  I have loved the calendars, hardback books and canvases I’ve ordered in the past with Motif.  However, I’ve just completed a 2024 calendar which should cost Euro 24.99 but with VAT and shipping added it comes to Euro 45 for one calendar.  Way too expensive for customers in Ireland.  I suspect Brexit may have caused these price hikes!  I can’t see the value for money with Mimeo and regret I can’t afford it anymore."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Noam Samson",
          "Nb_Reviews": 2,
          "Date": "2023-01-19T03:27:33.000Z",
          "Titre": "It is an excellent service and very…",
          "Contenu": "It is an excellent service and very easy to use. I have used Mimeo since Apple discontinued their own photo book service. However, this year I got an error message twice while trying to build the books and had to restart the project (two times) which was very frustrating. I contacted support but there was nothing they could figure out."
        },
        {
          "Note": 3,
          "Lieu": "AE",
          "Pseudo": "Damon Clark",
          "Nb_Reviews": 6,
          "Date": "2023-08-16T16:34:22.000Z",
          "Titre": "Product Great, Postage Not.",
          "Contenu": "The product itself is great.The delivery postage costs are expensive and inconvenient.Moonpig will charge c.£2 for delivery. You charge c.£10 and then if the package needs collecting from the local depot and you refuse to hand over the package if you have not taken identification.Moonpig is also faster."
        },
        {
          "Note": 3,
          "Lieu": "HR",
          "Pseudo": "Krešimir",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T17:53:21.000Z",
          "Titre": "Expensive shipping to Croatia.",
          "Contenu": "Shipping to Croatia costs 2 times more than to any other EU country  e.g. Italy (our first neighbour). There is no real reason for this because Croatia is in EU Schengen region and in EU Sepa region as Italy.Calendar design, user experience on WEB and final print quality I like. Overall too expensive, I was ordering calendar last 6 years, but now Im starting to look for alternatives."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James M Curtis",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T23:58:21.000Z",
          "Titre": "Mimeo Survey 2023",
          "Contenu": "The problem that I have was that I used the photo's app to build my Calendar and then used Mimeo to process into the calendar. This process changed all the font sizes( 9 & 10) I did in photos into a very small fonts  (size 6)hard to read on the calendar from a distance. I liked the ease it was to pay for the Calendar. Sincerely Jim Curtis"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T21:34:24.000Z",
          "Titre": "Photos were cut off due to selected size",
          "Contenu": "When I ordered my photos there was no way to see that some of them would be cut off in the size I ordered. It would be nice if it gave a cropped preview or flagged if photos would be cut off. Also, the colors didn't print as vibrant as they appear on my phone."
        },
        {
          "Note": 3,
          "Lieu": "PT",
          "Pseudo": "Ricardo Carvalho",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T01:15:55.000Z",
          "Titre": "Good quality, slow shipment",
          "Contenu": "Good quality, but excessive time in the shipment process. it took 2 days to produce and 11 days to arrive, which is not acceptable since the package was sent within europe."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Ian",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T22:00:27.000Z",
          "Titre": "The photo pages themselves were very…",
          "Contenu": "The photo pages themselves were very nice and the software is pretty good. The book itself is tiny for what you pay for. I’m sure this is outlined at the time of purchase but most people would order the standard book which in the past, has been much bigger."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T01:50:19.000Z",
          "Titre": "The price rise is unacceptable",
          "Contenu": "The quality is excellent but the price rise this year is just stupid!This will be my last mimeo calendar after many years."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T00:53:25.000Z",
          "Titre": "Overall a great product with a few, small challenges",
          "Contenu": "I had a few challenges with the Mimeo app in Photos that prevented a higher score. Initially, it wouldn't show me any layout options for pages, and I had to restart to get them to appear. I used the arrow keys to nudge an element, and then it kept moving in that direction even when I unselected and re-selected it — I had to restart again.I took off a second star because the DHL shipping process was unpleasant. The book arrived in my Canadian city on Friday, September 1st, but wasn't delivered to me until almost a week later. They blamed the long weekend for the delay, but the long weekend is in the calendar well in advance and is their challenge to manage as a company. I would recommend a different provider for international shipping."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "DL",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T17:38:14.000Z",
          "Titre": "Too expensive for the paper quality",
          "Contenu": "Too expensive for the paper quality. I think, it was better qualitative in the past.  Last projects were less qualitative with incrising price.  I think I will make a market review to find another supplier.  It time to test. By the way, you are the only provider who use UPS and They are really bad."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T18:22:05.000Z",
          "Titre": "Ok for fist time but will not repeat",
          "Contenu": "Liked the integration with apple pics and the ability to sort by used/unused photos Likes the templates tho I felt there could be more options Did not like having to order separately and pay for shipping twice Did not like that the shipping difference was almost double and the timing difference was only one day (and I couldn’t see that before making the shipping type decision)Did not like the price. The only reason I ordered was because it was too much work to remake the books with a different tool. But based on the “value for money” it’s not worth it cause other places provide larger format for less money)"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Laurie",
          "Nb_Reviews": 3,
          "Date": "2023-05-12T14:58:43.000Z",
          "Titre": "Some helpful suggestions",
          "Contenu": "I wish your selections of photo books had more of a description (visual) as to what the pictures/pages would look like. Also, is there was a way to change your project from say soft cover to hardcover midway thru a project? Lastly, the largest you can see of the page you are working on is still a bit too small on the computer screen."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T22:33:34.000Z",
          "Titre": "Your photobooks need more layouts",
          "Contenu": "Your photobooks need 2x or 3x as many Layouts. Apple photobooks had many, many more options. Using custom layouts isn’t feasible because you don’t have a ruler so it’s impossible to make symmetrical and same-sized layouts. Especially you need to add 8 vertical pages, 6 vertical pages, mixes of 7.  You prioritize square photos but iPhone default is 4x3 aspect ratios.  Your layouts mostly leave border, but you can print to the edges, so give that option more. This all seems so easy to add!!  Check the old layouts Apple used to offer on iPhoto. Your print quality is good otherwise.  Also it could be easier to drag/switch a placed photo without deleting and re-adding. But way more layout options is MAJOR way you could improve.  Thanks!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T23:46:55.000Z",
          "Titre": "I’ve used mimeo for years",
          "Contenu": "I’ve used mimeo for years, the quality seems to be less good as in the past.  Specifically the photos in my album are considerably darker than i believe they should be compared to previous projects I’ve done with mimeo."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Jan Dieckmann",
          "Nb_Reviews": 2,
          "Date": "2023-07-16T12:00:33.000Z",
          "Titre": "A very good app … which could be improved",
          "Contenu": "I consider photos to be the best software to create photo books. There are still a few things that could be improved. I described that in another post. A lot went wrong with my last project. But the support was helpful und Mimeo replaced a book having minor issues on the dust half-title. In the end the quality of the book was excellent as usual."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elizabeth West",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T20:06:38.000Z",
          "Titre": "Somehow my calendar project saved the…",
          "Contenu": "Somehow my calendar project saved the cover, events listed for the calendar and the photos added for the project. However the pictures I added for the layout were not saved and I had to start the layout portion over completely which was very frustrating. I chatted with a representative whose suggestion was to reopen Time Machine which I wasn’t able to do. I thought I had saved the calendar multiple times before closing it, but apparently it didn’t help. After I redid the whole calendar, I had no problem submitting it and placing my order a couple days ago."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T19:10:14.000Z",
          "Titre": "I was unable to order a project via…",
          "Contenu": "I was unable to order a project via Photos. Your tech support was helpful but, ultimately, could not solve the problem. I uploaded the project to your website and ordered it from there. That worked. But the fundamental issue - Mimeo not working within Photos - remains unsolved."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Bart",
          "Nb_Reviews": 5,
          "Date": "2023-01-07T20:56:40.000Z",
          "Titre": "Nice templates but laborious insertion of birthdays",
          "Contenu": "Nice calendar templates, easy upload of photos and good support of official holidays but inserting events / birthdays is really laborious. Why not take over birthdays from previous project or at least allow tabular insertion instead of going to the calendar every time again?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T17:54:51.000Z",
          "Titre": "Dislike",
          "Contenu": "Dislike: The gray sheets, first and last pages of the book are glued to my photo pages. Thus my photos are only partially visible due to the low quality book binding. This is the second consecutive book to incur this issue. So, fix the binding process. Actions speak louder than words"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Lou Tandy",
          "Nb_Reviews": 2,
          "Date": "2023-08-11T01:16:56.000Z",
          "Titre": "cost is extremely high (in AUD$)",
          "Contenu": "cost is extremely high (in AUD$). i bought multiple book (expensive) books and i think there should be a discount or loyalty program for good customers. I would like to be able to work on photo books off line - i would do a lot more. filters could be improved (more inline with insta). should be able to move single pages (not only spreads). should be able to flip design on a single page (your competitors can do this)."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T04:08:40.000Z",
          "Titre": "My photo book arrived in a UPS parcel…",
          "Contenu": "My photo book arrived in a UPS parcel bag without it’s protective sleeve and no plastic wrapping on the outside. The photo book had gotten wet and the pages warped on the bottom. In a separate UPS bag was the protective sleeve and it was saturated. I had to throw that away. The book is still useable but I’m disappointed that the pages got wet and are now wavy on the bottom. None of my other books from Mimeo arrived in such a state."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T01:50:00.000Z",
          "Titre": "I really like the calendar app",
          "Contenu": "I really like the calendar app, use it every year to design family calendars, I still do not understand nor enjoy having to re-enter all of the same event dates......grr and adjust the font of each individuallyOtherwise, a terrific product is produced :) Thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Janet",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T23:58:56.000Z",
          "Titre": "Too many difficulties",
          "Contenu": "Too many difficulties - apparently related to the Ventura operating system on Macs.  Had very good response from your tech support, but nobody could figure it out and I finally found fixes on my own. Then was unable to buy the book - it apparently never uploaded.  So I was finally instructed to save it as a PDF and then was able to order.  Just a lot of hassle - and it used to be easy!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Photo mom",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T08:06:11.000Z",
          "Titre": "I ordered a photo book and I don’t…",
          "Contenu": "I ordered a photo book and I don’t think it got reviewed before shipping as 6 of the pages had white smudge marks over my photos. However, once I notified the company they immediately processed a new one and checked it and shipped it for free."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Julie Hersk",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T22:46:46.000Z",
          "Titre": "The photos great, book not so great",
          "Contenu": "The photos turned out great, however the binding broke/ ripped, the pages and the white cover were dented and in both books some pages were stuck together creating tears when separated.  I really hope you can take more time in the future making sure the book is put together and handled right."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Warren Marsh",
          "Nb_Reviews": 2,
          "Date": "2023-01-12T04:13:50.000Z",
          "Titre": "Software ok but some features missing.",
          "Contenu": "Software straightforward.   I miss the ability to enhance / lighten / darken/ half tone/ mono the photos once they are placed on a page.   This feature is handy when using text over a photo on covers, dividers etc., and does exist in Mixbooks for example."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-04-05T19:14:19.000Z",
          "Titre": "I had a hard time at first knowing what…",
          "Contenu": "I had a hard time at first knowing what to do to get photos to be used for the calendar. Instructions a bit confusing for old people who are not very adapt at using a computer.It was so disappointing when my calendar came with the words \"Untitled Project\" across the cover. I assumed it would be blank if you didn't add a title.Delivered very quickly. Photos were clear and colourful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Honorable Lockton",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T21:34:52.000Z",
          "Titre": "So sad",
          "Contenu": "I have used Mimeo several times over the past 7 years.  The most recent order was inferior in both paper weight and photo reproduction.  I was very disappointed.  The company was kind enough to redo book, and while better, still not up to the quality of past editions."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Gina McDonnell",
          "Nb_Reviews": 5,
          "Date": "2023-10-05T14:06:30.000Z",
          "Titre": "Easy to use and support if needed",
          "Contenu": "Easy to use and support if needed. Final quality isn’t great, photo reproduction isn’t nearly as good as when Apple was doing the books themselves."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Barbara Kilbourn",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T15:56:20.000Z",
          "Titre": "I have made many photo books before",
          "Contenu": "I have made many photo books before. I watched your videos in YouTube. I found your layout to be very confusing and frustrating.  I had to contact help twice.  I would prefer to TALK to a person not type. Default print color should be black!Written or verbal instructions are needed.  I do not read symbols very well. For example I never would have figured out on my own that you needed to change ink color or how to do it."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-25T01:43:59.000Z",
          "Titre": "The product is great",
          "Contenu": "The product is great, the program to make the book is easy to use, which I appreciate.  The ordering was super silly to use - ordering different numbers of books  to 3 different addresses.  I needed help and even now after so many tries don't know why some attempts worked or didn't work.  The discount I had to ask them to apply.  It was very frustrating in the end."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T20:21:21.000Z",
          "Titre": "The process itself is very…",
          "Contenu": "The process itself is very straightforward but the pictures were not optimized for the size requested. Most looked zoomed in and not quite the right ratio"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert S.",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T03:47:45.000Z",
          "Titre": "Do not have photo printed on wood.",
          "Contenu": "The order process was very easy to follow and the turn around was very good. However, I was not very pleased with my photo printed on wood. It greatly reduces the resolution of the photo. Adding the white background would have made the photo stand out better but this defeats the purpose of printing on a wood texture. I probably should have expected this."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "JAC",
          "Nb_Reviews": 2,
          "Date": "2023-02-26T23:45:54.000Z",
          "Titre": "great final product but a few frustrations",
          "Contenu": "I found the text boxes too small - hard to get much commentary in. Many of the layouts did not accommodate the portrait size of pictures taken on the a cell phone which is pretty common these days. The books look great when done - good quality and excellent resolution in the pictures"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T06:13:58.000Z",
          "Titre": "I have been making Mimeo photo books…",
          "Contenu": "I have been making Mimeo photo books for several years and enjoy the photo reproduction quality, the layout options and until now, the options with text boxes of font choice, size etc. However for a recent soft covered book I made for my grandson, I was really disappointed to find in the book that some of the print is barely visible even though I definitely adjusted it when the warning sign came up on checking on the PDF. I do find the font hard to read in the text box but I think there a couple of lines on about 6 pages on this occasion which I think are faulty. I have since received another hard cover book from a recent trip to Italy which is fine. I would appreciate hearing from you about my soft cover 8x8 book as it has cost over $60 Aus as was i intended to be a gift. Im not sure I can gift it as it is.Kind regards, Norma Edwards"
        },
        {
          "Note": 3,
          "Lieu": "DK",
          "Pseudo": "Judy Watkins",
          "Nb_Reviews": 2,
          "Date": "2023-07-21T02:42:09.000Z",
          "Titre": "Convenient I enjoy the convenience of using Mimeo…",
          "Contenu": "I enjoy the convenience of using Mimeo with my Apple Mac It’s very easy to edit and create photo books. The books I received this time I didn’t think the photos were as clear as previous books, and I am using the same camera"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cory",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T18:41:07.000Z",
          "Titre": "Great looking calendars - with two major pain points",
          "Contenu": "The calendars look great and Mimeo continues to be the best way to make calendars on a Mac.  But adding events, which I do a lot, is tedious.  I create similar calendars every year with the same events, but there is no way to copy events from one year to another.  I have to re-type in every event every year.  iPhoto used to let you import .ics calendar files.  I would love to see that feature in Mimeo Photos.  Similarly, iPhoto used to let you drag and drop photos onto calendar dates, like you can for the main monthly photos.  The process for adding background photos to specific dates in Mimeo is cumbersome."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nytko",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T18:57:58.000Z",
          "Titre": "I had a lot difficulty using your…ordering system",
          "Contenu": "I had a lot difficulty using your website to finish my order. I had to contact customer support numerous times to be able to even place my order. The customer support was good but it took quite a while to solve the problem I was having. I am extremely happy with the calendars I received but, to be honest, I almost gave up and went to Shutterfly. In the end, I'm glad I didn't."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T22:18:08.000Z",
          "Titre": "Good quality unnecessarily expensive",
          "Contenu": "While it was easy to obtain a print of one of my photos, I got the exact same thing and quality through Google Photos for less than half the price"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T11:19:15.000Z",
          "Titre": "UI can be greatly improved",
          "Contenu": "UI can be greatly improved.  For example, it would be nice to move the calendar pages around and/or move photos to a different month without having to do it all manually."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "BB",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T03:29:15.000Z",
          "Titre": "Great quality but a few strange pages",
          "Contenu": "The last few pages did not save and came through with an off centre border, while the rest were full page. There was some error coming up but it did not make sense. When I go back into the project, all of those pages that printed oddly are gone. Great print quality and colours."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T23:11:51.000Z",
          "Titre": "I have made photo calendars with your…",
          "Contenu": "I have made photo calendars with your company for several years - for some reason it was difficult to navigate this year. I was also trying to reach someone for help, sent Email, got no response - I don’t think it even went through."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LM",
          "Nb_Reviews": 2,
          "Date": "2023-07-20T01:57:26.000Z",
          "Titre": "Purchase process is poor",
          "Contenu": "Product and project creation are great! The ordering process is a rip off. I cannot order more than one project at a time so the shipping fees cannot be combined. It's exorbitant. I'm returning to Shutterfly."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Andrei Railean",
          "Nb_Reviews": 2,
          "Date": "2023-02-28T11:16:05.000Z",
          "Titre": "The app kept on crashing when mimeo app…",
          "Contenu": "The app kept on crashing when mimeo app is in the background for a while.Not being able to load a calendar of events is quite annoying. Having to re-enter key birthdays and events each year is getting boring. If you can’t come up with that feature, perhaps you can create some kind of calendar project template I can maintain and use for future years. App has a relatively weak iOS photos integration - it’s impossible to work with dynamic albums and searches. All photos have to be uploaded first. This app work more like a website than a true app. I used it for a calendar with lots of photos and my needs aren’t catered for very well by the app.I only use the app because print quality is consistently good every year."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "John L",
          "Nb_Reviews": 2,
          "Date": "2023-05-15T03:45:49.000Z",
          "Titre": "Disappointed",
          "Contenu": "I asked for prints taken by professional photographers and was quite disappointed that most of the prints were underexposed and that some photos had parts of the subject cropped out.The order was quite slow in processing and at times, I wondered if it had gone astray!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frank Sivillo",
          "Nb_Reviews": 2,
          "Date": "2023-09-22T00:51:12.000Z",
          "Titre": "There was an error in my photo book (…",
          "Contenu": "There was an error in my photo book ( the book jacket had the wrong photo) and I went to the website to try to find a way to correct it. But I couldn’t. I would have liked a phone number to speak to someone who might be able to order me a corrected book jacket."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T07:44:57.000Z",
          "Titre": "I was redoing a project and the program…",
          "Contenu": "I was redoing a project and the program rejected photos that I had used before.  ThankfullyI was able to source them from another file and USB stick.I did find the previous Apple i'photo Journal program which I used for many years much easier."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "D Shaw",
          "Nb_Reviews": 4,
          "Date": "2023-03-22T18:48:10.000Z",
          "Titre": "I like the general ease of using the…",
          "Contenu": "I like the general ease of using the site. I disliked having to pay for shipping for each order — I’d like to combine orders given your shipping price. Also I couldn’t figure out how to omit the logo on the back of the folded card."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T00:25:10.000Z",
          "Titre": "Hard to start a new project after…",
          "Contenu": "Hard to start a new project after completing one. I gave up.  Hard to move off the mimeo landing page.  When an image is taken out of the project (eg calendar) and altered the file jumps back to the beginning of the project."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rick Fow",
          "Nb_Reviews": 2,
          "Date": "2023-05-31T23:17:18.000Z",
          "Titre": "We had trouble submitting the the book…",
          "Contenu": "We had trouble submitting the the book for print via the app in my MacBook Pro Photos app. It would not complete & we had to Call for help & get several refunds of charges to my CC. We had to submit as a PDF to get it done. Also, we couldn't fill the page with multiple pics without them overlapping.Finished product turned out Great!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donald Eccker",
          "Nb_Reviews": 4,
          "Date": "2023-11-15T01:19:30.000Z",
          "Titre": "I couldn’t add pages to my book so I…",
          "Contenu": "I couldn’t add pages to my book so I ended up having to make 3 books. If there was a way you should make it easy to find. That really sucks and costs so much more.Just got your reply. Good to know Thankyou It would be really nice if you put next to that + a couple words like “ More Pages “"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Doreen H",
          "Nb_Reviews": 2,
          "Date": "2023-07-28T23:07:55.000Z",
          "Titre": "Too much hassle for a mediocre result …",
          "Contenu": "Your customer service is eventually responsive but it takes time and patience to get there.More importantly your product is only marginally acceptable.Won’t be back nor will I recommend you."
        },
        {
          "Note": 3,
          "Lieu": "CZ",
          "Pseudo": "Calin",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T15:38:15.000Z",
          "Titre": "I liked the different layout options…",
          "Contenu": "I liked the different layout options and, above all, the fact that I could keep the original size of my photos.I was disappointed by the color rendition, which I found too dull."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T16:12:41.000Z",
          "Titre": "It was ok",
          "Contenu": "It was ok. Surprised with how long it took photos to ship; I was never provided a shipping confirmation, and customer service was slow to update me on the status of the order. Photos look good, but I will probably use a service that has a faster turnaround in the future."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "atilla",
          "Nb_Reviews": 3,
          "Date": "2023-02-13T17:16:26.000Z",
          "Titre": "Easy to use, but limited flexibility.",
          "Contenu": "Yes, the program is relatively easy to use.  The lack of additional page configurations (especially in the 4+ pictures per page) is an on-going frustration.  The page configurations have not changed for years.The number of photobook configurations seems a waste.....the real need is more flexibility at the page level.  Positive:  processing/delivery is fast.  The ability to sort by used and unused photos is a very good feature.Negative:  sometimes the printing is less than great and the lack of flexibility at the page level (much less than apple photos used to have) is a real drawback."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T23:46:19.000Z",
          "Titre": "I was a bit disappointed as the photos…",
          "Contenu": "I was a bit disappointed as the photos seem to be really dark. I have done books previously and the books were fantastic and I was expecting the same. It could also just be my bad photography skills!"
        },
        {
          "Note": 3,
          "Lieu": "AE",
          "Pseudo": "Mahmoud Abougabal",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T21:47:17.000Z",
          "Titre": "I received a message that Mimeo…",
          "Contenu": "I received a message that Mimeo recently changed ownership. I didn’t mind that, until I saw the quality of the photobook - the images are darker and the paper used is lighter and more glossy. Big difference from previous prints… very disappointing."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T23:14:50.000Z",
          "Titre": "I have trouble saving photos at times",
          "Contenu": "I have trouble saving photos at times. The book came with 2 corners of the paper book flap crimped and missing colour. There was also a crimp in the book flap at the back on the top. I appreciated the real time chat that was available. I wanted to use some photo spots for journaling but the “put your photo here” words were still visible causing confusion at check out. The chat person was able to confirm that it was ok to order that way and it came out fine."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T15:39:56.000Z",
          "Titre": "Delivery costs too high",
          "Contenu": "Delivery costs too highNot possible to put more than 1 album into the cart... all shipped separately"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "long time customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:16:21.000Z",
          "Titre": "I love the quality and relatively ease…",
          "Contenu": "I love the quality and relatively ease of use.  All, cards, memory books, calendars are as beautiful as I expect when making the projects.My only negative feedback is connected to the cards orders I typically place around Christmas time.  It has been now two years in a row that the order comes in without the envelopes.Which then totally defeats the \"extra cost\" for \"fast shipping\" since I then need to contact Mimeo, place the claim and wait another week to get the envelopes.  Needless to say frustrating."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Warren Cooke",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T23:21:32.000Z",
          "Titre": "Excellent printing and binding",
          "Contenu": "Excellent printing and binding of both photo books and calendars.  Delivery is impressively prompt.  The only problem I have encountered:  on books, it is not possible to choose either a font or a size for the writing on the SPINE of the book;  I need to be able to customize the spine (like the cover and the page captions), but cannot do so.  Otherwise no complaints at all."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Enuf already.",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T17:41:50.000Z",
          "Titre": "It would be helpful to support saving…",
          "Contenu": "It would be helpful to support saving ‘dates’ from year to year. I’ve been doing family calendars with apple/mimeo for years. Adding each person’s birthday, anniversary is a challenge that should be relatively easily solved by software. Our families look forward each year to receiving their family calendar."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Rose",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:25:04.000Z",
          "Titre": "Creating the photo books was easy and…",
          "Contenu": "Creating the photo books was easy and ordering along with delivery was quick. Out of 3 books created and ordered 2 were delivered early with no issues. The third book had a delay at the US boarder, delayed about a week and was slightly damaged. This was relating to the delivery process not the printing process."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Estelle Dallaire",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T22:55:46.000Z",
          "Titre": "User-friendly, excellent quality but excessive cost of delivery",
          "Contenu": "The app is user-friendly. The final product is really very nice. What I would like though is the possibility to order different calendars and pay for only one delivery. We ordered 3 calendars and had to pay 3 times $22 for delivery. I contacted the client service to find a solution but there was nothing they could do. Then, we received the 3 boxes same day, same time, same courier. What a waste! We’ve been clients for years, but now that we have more calendars to order and because of the prohibitive cost of delivery, we’re looking at other companies where we could pay less for the same kind of product."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Sílvia",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:34:29.000Z",
          "Titre": "Good Experience!",
          "Contenu": "Easy to use, great quality of materials and very efficient delivery.I missed more flexibility in the calendar pages with texts and images. For instance, only English/Spanish were available.Also, as a suggestion, it would be good to allow calendar import with all family birthdays and events, so we do not have to load all the info every year."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:41:44.000Z",
          "Titre": "Experience using my Apple IMac was very…",
          "Contenu": "Experience using my Apple IMac was very good. Generally very happy. What I didn’t like was not being able to access my projects from the online app. No ability to see delivery times of finished projects on order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edwin",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T23:37:22.000Z",
          "Titre": "What would make the experience really…",
          "Contenu": "What would make the experience really great would be the capability to combine orders into one order and have only one shipping charge. One big advantage tome as a customer is that I could order multiple cards with different photos so one could make mixed card packs as gifts, etc. I know other companies do allow one to combine orders. Thanks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NancyP",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T19:07:06.000Z",
          "Titre": "Useful features",
          "Contenu": "It would be nice to see how the different calendar options really vary, and to be able to switch from one to another without starting over.ALSO--is there a way to copy pictures for one month and put in a different month when you realize you accidentally skipped a page?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JAM",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T05:44:22.000Z",
          "Titre": "The Process of Making the Calendar Was Straightforward.",
          "Contenu": "The process of making the calendars was pretty straight forward and it was easy to add my photos. I gave 4 stars because the photos in the calendar appeared a bit darker in the printed calendar. Also there were two photos where there were some odd dark shadows on the people in the photos. These shadows were not in the original photos. I've used this company several times and have accepted that this is as good as it will probably get."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:02:00.000Z",
          "Titre": "The programme was easy to use",
          "Contenu": "The programme was easy to use, and the quality of the paper and thus the photos is firm.  Edges don't curl even in hot humid weather.  I am finding the cost of shipping is becoming very high, especially as I have to pay in Canadian Dollars."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Elizabeth H",
          "Nb_Reviews": 8,
          "Date": "2023-12-16T13:06:05.000Z",
          "Titre": "Good quality",
          "Contenu": "On the whole I’m pretty satisfied with Mimeo, but I do wish you would provide more templates.  I know how to create my own page designs, but it’s very fiddly and time-consuming.  What I would particularly like are two templates Apple used to offer, firstly, one large photo across most of the page with four small ones at the top or bottom; secondly, a 13 picture page, one larger central photo surrounded by twelve little ones."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joanne",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T03:16:03.000Z",
          "Titre": "A beautiful presentation for Christmas gifts.",
          "Contenu": "Making my calendar with Mimeo is a creative and easy way to use my bird photography to gift my friends and family for Christmas.  Only less than perfect things this year was there was no economy class postage and the cover photo was too dark.  The rest of the pictures within the months were beautiful Thank you."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Emily",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T16:49:10.000Z",
          "Titre": "The product is absolutely amazing…",
          "Contenu": "The product is absolutely amazing quality. You guys need to allow the customer the ability to order and package individual ‘different’ calendars together. I did six different personalized calendars that  cost over 156 US $ for shipping.  That is ridiculous!  My calendars are all produced in about 2 days. Why can’t I put them in a shopping cart and then do one order?  What a waste of resources and having six different trucks delivering the calendars.  In terms of environmental damage and resource gluttony your company is not doing anything to solve  these problems. How about reading this and changing your process as I have suggested this for two years and I do not see you taking this suggestion into your process?  Amazing product, but I will make a decision about using this company on how this shipping issue is dealt with."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T20:10:53.000Z",
          "Titre": "I recently gave Mimeo Photos a poor…",
          "Contenu": "I recently gave Mimeo Photos a poor review based solely on the delivery system, however Mimeo, which has always been very good at their job, has contacted me and, I believe are looking into their delivery system. I trust them and appreciate their commitment to making sure customers are happy. Thank you Mimeo for taking my review seriously. Mimeo is very good to deal with if things go wrong which is reassuring."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:29:05.000Z",
          "Titre": "Very quick delivery and great quality",
          "Contenu": "Very quick delivery and great quality. A smudge mark seen when book closed on top of all the pages. Wish the 30 something % discount came round more often. Have only ever seen it at Halloween so need to wait till next year for another order!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T17:21:48.000Z",
          "Titre": "Really good quality calendars",
          "Contenu": "Really good quality calendars. Software is (mostly) easy to use. Quick shipping. What made the review a 4 instead of a 5 is not having a “copy format” feature in the calendar so you have to relayout every month. Very time consuming and seems like such an easy fix."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "LINNEA BLAKEUS CALDER",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T10:35:34.000Z",
          "Titre": "Good quality, very expensiv",
          "Contenu": "It is a good photobook, but very expensive. We ordred only one copy but wished to ordred more to the rest of the family and to our self."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T04:08:40.000Z",
          "Titre": "I had ordered 5 calendars as Christmas…",
          "Contenu": "I had ordered 5 calendars as Christmas gifts. Only 1 calendar arrived. I emailed and Rachel took care of the problem by reprocessing the calendars and send them quickly to me. Dealing with everyone was easy and very efficient. Thank you look forward to working with your team again. Beverley Hunchak"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:26:23.000Z",
          "Titre": "Sometimes",
          "Contenu": "Sometimes, the formatting is a little restrictive. In general, photos are easliy placed where you want them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T17:14:00.000Z",
          "Titre": "Mimeo Photo Book",
          "Contenu": "Mimeo Photo Book has exceptional quality.  I did place a second order and the book had some production defects.  After a chat with Mimeo, I uploaded photos of pages with the defect along with screen shots of the same pages on my computer.  Without having to return the Photo Book, Mimeo mailed me a error free and corrected Photo Book at no charge."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "IRVING GOLDENBERG",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T16:26:28.000Z",
          "Titre": "I have now had twelve photo books made…",
          "Contenu": "I have now had twelve photo books made by you and all have been excellent. Color has always been accurate and photos are very clear. My one criticism is the first few pages don’t fully open and sometimes the photos or text closest to the binding are covered slightly even though I keep the positioning within your guidelines."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Brian O'Brien",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T21:01:12.000Z",
          "Titre": "Good bits, less good bits",
          "Contenu": "Overall the quality of the production is very good. The time between order and receipt of final product is very good. Not so good is the total attention to dispatch detail as part of the production run arrived without coverage folder."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary M",
          "Nb_Reviews": 2,
          "Date": "2023-12-22T04:09:52.000Z",
          "Titre": "Christmas Gifts",
          "Contenu": "I ordered 2 photo calendars and 1 photo book for Christmas gifts.  The quality is good, but the pricing is rather high."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:33:12.000Z",
          "Titre": "The page set up is easy but I wish I…",
          "Contenu": "The page set up is easy but I wish I could import the date parts of the calendar to use from year to year and just change the pictures."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T22:55:01.000Z",
          "Titre": "Great turnaround time",
          "Contenu": "Great turnaround time; great reproductions; had trouble with text box, though, and one stayed across a photo in the final product -- suggest making them easier to see against backdrops."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen  Hoover",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T23:18:48.000Z",
          "Titre": "Love the quality!",
          "Contenu": "Each year I create nine calendars for Christmas gifts. I started doing this through Apple, but then transitioned to Mimeo when Apple got out of the calendar business. I was fearful the quality would not be as good, but was pleasantly surprised when the first Mimeo calendar arrived. Last year several of the calendars arrived with the spiral metal “page attacher” installed backwards and the pages came apart. I was not happy after spending so much money. I decided to give Mimeo another try and this year they all came out beautifully. I am very pleased with the quality, but a little shocked at the current price of over $47.00 per calendar (the shipping price is steep and I wish there was some way to bundle the calendars being shipped to my house to cut down on the cost.)"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T18:14:11.000Z",
          "Titre": "Good qual calendars easy to create.",
          "Contenu": "The calendars are easy to create and give a good final product.  The one thing I miss is the possibility of placing the letters about an event, birthday,etc not on the photo as usually you can’t see the letters.  Other than that I am pleased with the experience."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Mike Loader",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T03:09:14.000Z",
          "Titre": "Pricey but good quality",
          "Contenu": "The print quality is excellent but in the past four years the price of a calendar has increased 48% and the cost of S&H to Canada for 3 calendars has increased 91%."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T18:43:28.000Z",
          "Titre": "Damaged in packing",
          "Contenu": "Creating the calendar was fun. Calendar turned out very nicely. Unfortunately who ever packed the calendars forced them into the cardboard container and consequently damaged the corners on two of the calendars. This was obviously done in the packing not after they were shipped."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "David M.",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T17:47:49.000Z",
          "Titre": "Great app, produces great calendars -- need better shipping options",
          "Contenu": "The app is really great, once you get the hang of it (which didn't take too long).  It has lots of great templates to help set up calendar pages, etc. easily and effectively. I've used it for several years, and the calendars always come out really well -- nice high quality paper and binding.My only complaint is that I'd like to package my entire order into one shipping charge.  We do customized calendars for different family members, and each calendar comes separately, with separate shipping charges, which makes them VERY expensive per unit.   (The shipping is almost as much as the actual calendar.) I'd like a way to put the different calendars in a \"shopping basket\" so I can checkout once and have all delivered at once for one delivery fee."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Kerry Lewis",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T23:44:12.000Z",
          "Titre": "Good program, help available, poor delivery.",
          "Contenu": "The assistance when I had a just expired voucher was great. I wish there were more page layout options, especially for 5+ photos when making a large book. My only problem was with the delivery - the instructions are to leave by front door (which is undercover). Instead it was left just inside gate - had it rained or our watering system turned on before we found it, the book would have been damaged. This has happened before with the book being left out in potentially wet weather."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Margie",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T19:01:23.000Z",
          "Titre": "Nice product",
          "Contenu": "Everything about the finished calendars was beautiful. I love the product and it was a very fast turn around. I received my calendars within the week of uploading the photos. My only complaint is the price of shipping. It is higher than any other product that I’ve ordered."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dean",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T04:17:20.000Z",
          "Titre": "Good app, nice calendars",
          "Contenu": "Calendars are nice, but some of the pictures come out darker than what they look like on the computer.  App is fairly easy to work with.  One issue I have is I make multiple different calendars and I haven’t found a way to order them all at once to avoid paying shipping charges on each one.  Price, especially with shipping charges, is somewhat high.  I do like the large size of the calendars, the multiple layout choices, and the ability to identify events with photos."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rollin Daggett",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T20:45:19.000Z",
          "Titre": "Great Calendars",
          "Contenu": "Calendar is high quality and is easy to prepare. I would like to be able to load multiple photos at once rather than just one photo at a time. If it is possible to load multiple photos, I would like to see directions how this can be done."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Toggwiler",
          "Nb_Reviews": 4,
          "Date": "2023-12-18T18:56:56.000Z",
          "Titre": "I’m satisfied with final result,however…",
          "Contenu": "I’m satisfied with final result,however total cost is too high compared with other products,and regular customers like me would appreciate more discount along the year ."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "V.A.L",
          "Nb_Reviews": 22,
          "Date": "2023-12-01T10:53:50.000Z",
          "Titre": "Deserved five stars but for one thing!",
          "Contenu": "Deserved five stars as Printing and quality great of a photographic calendar  BUT Delivery stressful - as did the same as last year - for some reason changed postcode and sent to wrong depot (I live in Channel Islands) so they don’t recognise postcode…Excellent Customer Service / resent with correct address ..and is here now and very happy with resultFive stars to Customer ServiceOne star to Packer!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marla",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T15:42:19.000Z",
          "Titre": "Heavy pages",
          "Contenu": "The book looks very nice.  However, I’m disappointed that the pages are so thick. I have made photo books with Mimeo for many years and the pages are now much thicker and the cost has almost doubled."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T04:58:48.000Z",
          "Titre": "the finished product was…",
          "Contenu": "the finished product was wonderful,thank you"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T05:17:42.000Z",
          "Titre": "Service was very good",
          "Contenu": "Service was very good. Helpline and delivery was quick and efficient.  Would prefer more choices of paper, more choices of patterned backgrounds, ability to fade and modify tones of page backgrounds, provision of background clips such as colored swooshes underneath text.  Would be nice to have more features enabling more customer creativity"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yev",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T17:56:56.000Z",
          "Titre": "Shipping per book is aweful",
          "Contenu": "Could be better if I could bundle multiple books to pay once for shipping."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Lorraine Espin-Hempsall",
          "Nb_Reviews": 9,
          "Date": "2023-11-27T23:56:26.000Z",
          "Titre": "Almost like the Apple program",
          "Contenu": "Almost like the Apple program, good but less creative and a little less intuitive, but since the Apple system doesn’t exist any more it will suffice. Quick turn around from sending to receiving.Will continue to use Mimeo"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T16:28:48.000Z",
          "Titre": "I used the website to design my photo book.",
          "Contenu": "I used the website to design my photo book because I am not an Apple user. My suggestion is to have an Android app as well as Apple. The website was very user friendly, easy to navigate and figure out quickly. I did reach out to customer service while designing the book and customer service was efficient and helpful with every question. Customer service actually told me that I could design my photo book on the website to start with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DHower",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:51:47.000Z",
          "Titre": "The cards came looking exactly as I hoped",
          "Contenu": "All was great, but I could not find a link to order more when I ran out."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Carla W",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T02:09:05.000Z",
          "Titre": "Always my go to for photo books!",
          "Contenu": "Always my go to for photo books! Not sure what happened to my old account and I used to get discount codes sent, but great product."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Keith Bamber",
          "Nb_Reviews": 10,
          "Date": "2023-11-23T22:07:06.000Z",
          "Titre": "I use for the quality of the product",
          "Contenu": "I use for the quality of the product. In my case a calendar. They match my colour well and print quality is superb. BUT it is ever so expensive and has increased in price too steeply over the last three years I have used to produce my annual calendar. There seems to be no justification for such increases. I will certainly be comparing others for my 2025 calendar."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anita",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T01:48:01.000Z",
          "Titre": "Reliably good quality",
          "Contenu": "This is my third book. And I've done several calendars. The overall quality seems quite good to me. This book was unlike my others because it featured photos of paintings. The colors in the book were not exactly as they appeared on the screen.  Not sure if there's anything that can be done about it. For some reason the color differences don't seem as noticeable with most photos that are not of paintings."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "D. Mason",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T15:28:23.000Z",
          "Titre": "Good overall but still needs some improvement.",
          "Contenu": "Overall the experience was very good. The program was relatively easy and quick to use. As I’ve told you in previous reviews, I still think that it needs more variety of page layouts. After cropping some photos simply don’t show well with your current layout choices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customJean Thierfelder",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T15:11:01.000Z",
          "Titre": "For many years I used Apple to make…",
          "Contenu": "For many years I used Apple to make calendars and cookbooks which Mimeo then published.  Altough Mimeo has made improvements, they are still not as user friendly as Apple was.  The first year, I could not alter the letter size on the calendars so made half my family calendars with Motif so my father-in-law could read the birthdays printed on the calendars.  I printed a family cookbook with Mimeo and did not realize Mimeo did not number each page automatically like Apple did and needed to number each page one-by-one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff M.",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T20:16:09.000Z",
          "Titre": "Great prints",
          "Contenu": "The quality of the photos and the speed of the service was exceptional. My only concern would be the cost of the shipping which was $13.99 for three prints which was standard. Seems a bit much."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kat",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T00:20:34.000Z",
          "Titre": "Mimeo holiday card success!",
          "Contenu": "I designed a holiday card using a Mimeo software template.  The software is just a little finicky, and when I’d goof up it was difficult to recover from, but ultimately I am happy with the final product.  I like that I can write a fair amount that can be printed in any font and color on the back of the card."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Catherine",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T22:50:15.000Z",
          "Titre": "Product good but problem with resolution",
          "Contenu": "Product good but don’t like the way Mimeo insists that perfectly good photos taken with my Canon Camera have resolution that is too low. This has rarely happened in the past & now happens most of the time."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Ivar Munthe",
          "Nb_Reviews": 20,
          "Date": "2023-11-15T09:46:51.000Z",
          "Titre": "Over all a great product!",
          "Contenu": "Workflow and interface is good. However I still miss being able to include page numbers automatically. I had problems placing the order, but got good follow up and help from the help desk to solve the issue. Over all a great product!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 8,
          "Date": "2023-11-16T17:01:31.000Z",
          "Titre": "Good printing of cards and calendars",
          "Contenu": "Good printing of cards and calendars. Colours not quite so accurate as in previous years but paper quality and sharpness of printing very good. Past years I would always have given five stars."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Tom",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T17:45:17.000Z",
          "Titre": "Why I like Mimeo photo albums",
          "Contenu": "Allows for a book of annotated images that are very personal and meaningful with little technical know-how.Best use of some of the tools would be enhanced by a manual or by a YouTube description of best use.  The existing YouTube videos are more promotional than helpful for an app that, by its nature, gets used only every few months or years."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debra Grieb",
          "Nb_Reviews": 5,
          "Date": "2023-11-15T19:54:48.000Z",
          "Titre": "New User",
          "Contenu": "I need more experience with the text choices in terms of size.  All the photo placements were easy and expected.  I did eliminate some photos because I thought the resolution would be poor."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T08:43:24.000Z",
          "Titre": "Had an issue when books I ordered was…",
          "Contenu": "Had an issue when books I ordered was stuck in transit due to missing documentation from sender. And I was told I had to sort it out, which I couldn’t since I was the receiver. It resulted in a delayed delivery and I was relieved to have ordered early so had the time. Never had this issue before, though. It has always been smooth sailing."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T19:35:59.000Z",
          "Titre": "The actual production was great",
          "Contenu": "The actual production was great. But shipping with Puralator and Canada post not the best. Package didn’t move for days and tracking appeared not to work on my computer until delivery day. So I probably made a nuisance of myself requesting updates ☹️"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "David Wells",
          "Nb_Reviews": 4,
          "Date": "2023-11-03T18:46:35.000Z",
          "Titre": "Good results but shipping too expensive",
          "Contenu": "Photobook result was good. The production process was fiddly but ok after some experience. The shipping cost was shockingly double their competitors which added a lot to the total cost. I'll try someone else next time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amy Chumbley",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T23:26:10.000Z",
          "Titre": "very good",
          "Contenu": "Had the wrong address and the help e-mail worked to get it changed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wayne",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T18:22:41.000Z",
          "Titre": "What happened to the clear envelope…",
          "Contenu": "What happened to the clear envelope around the book and jacket? Can we at least buy the envelopes?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 5,
          "Date": "2023-11-02T22:06:22.000Z",
          "Titre": "Generally good quality",
          "Contenu": "The book was printed as ordered and generally looks very good. There’s room for improvement: (1) more accurate printing/wrapping of cover so white space (which belongs on the inside flap) doesn’t appear on the front and (2) software should be sensitive enough to warn me when inserting photos that an enlarged photo will be slightly pixelated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mical Brenzel",
          "Nb_Reviews": 5,
          "Date": "2023-10-31T03:33:16.000Z",
          "Titre": "Beautiful photo book, creation process challenging",
          "Contenu": "Mimeo allows me to create a beautiful keepsake photo book from a trip, which was the project I completed on Oct. 16.  The app can be challenging to use, however.  I often need to scroll through ALL the photos I have placed in the file to use for the book, rather than the software taking me to the last photo used.  The app sometimes quits unexpectedly; I panic -- although my work was never lost.  Sometimes it is difficult to see if the SAVE function has worked properly.  Text boxes can be difficult to place on a page, and text editing is clumsy.  Overall, though, I am very happy to be able to create my own photo book online."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Eljaycustomer",
          "Nb_Reviews": 6,
          "Date": "2023-11-29T07:59:33.000Z",
          "Titre": "Excellent calendars…",
          "Contenu": "As usual the calendars were excellent in quality and were delivered quickly.However the continual yearly price rises together with a shipping charge of $60 for 12 calendars this year, has me considering an alternative source of my Books and Calendars.A pity after decades of very satisfying association."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T14:56:44.000Z",
          "Titre": "Worth the Price",
          "Contenu": "Pricey product and expensive shipping but worth it, as calendar is beautifully composed and printed"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Angie",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T03:08:19.000Z",
          "Titre": "Great Memories",
          "Contenu": "The calendars are wonderful as always…extremely well done!! It took a bit longer to receive them this year, but we love them, & they make perfect Xmas gifts for my Mom & Aunt (in their 90’s), as they bring back fond memories 😃"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Letizia Artini",
          "Nb_Reviews": 2,
          "Date": "2023-10-31T12:18:28.000Z",
          "Titre": "Mimeo is easy and fun!",
          "Contenu": "Creating photo album with Mimeo is easy and fun! The quality of the final product is good and it can be a nice present for special occasion.I learnt this on my own.. some features may be enhanced such as the picture adaptability to the chosen picture frame)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roberto Gomez",
          "Nb_Reviews": 4,
          "Date": "2023-10-13T01:29:18.000Z",
          "Titre": "Fun to work with Mimeo",
          "Contenu": "I really enjoy making my books this way and maybe because I've done it quite a few times, now it feels easy and convenient anytime I design and print one of these. My only comment is that the difference between book design themes seems to be almost non existent now. I was able to clearly tell the differences between styes before, now they all seem the same style, with different names. So I make my own."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Barry Elliott",
          "Nb_Reviews": 29,
          "Date": "2023-11-03T19:44:38.000Z",
          "Titre": "A very professional product.",
          "Contenu": "It was a joy to put the photo book together. Very straightforward with plenty of options. The book itself was sent very quickly and the final result was very professional. The only slight disappointment was that my snow photos all had a blue tinge."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nattgurl",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T19:36:41.000Z",
          "Titre": "Prints darker than expected",
          "Contenu": "As a graphic designer, I know there is a difference between screen and printed images. However, I thought I had adjusted the images enough to compensate for this. Since there is no way of getting a proof sheet, I will have to print a couple of my most challenging images and use them as a guide to adjust the batch.It would be nice if Mimeo gave guidelines for iPhoto settings to help the client better calibrate their images to Mimeo printers."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Hovywood user.",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T20:34:17.000Z",
          "Titre": "Overall it’s a good experience.",
          "Contenu": "Overall it’s a good experience.Only be very careful when you select the size of your album. I made in the past 10 times an album and believed my system would present me at the start of the creation the same as previously selected.. it wasn’t!Another remark, it would be greatly appreciate if we could edit our pictures while doing the album, within the Mimeo application."
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Bitten Rønnow Dieckmann",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T13:11:42.000Z",
          "Titre": "Fine pictures only 2 pictures was the…",
          "Contenu": "Fine pictures only 2 pictures was the same🤔"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T23:10:13.000Z",
          "Titre": "The final product was great but I would…",
          "Contenu": "The final product was great but I would like to be able to put 10 or 12 photos on a page using mimeograph photos.  I’ve done that by creating single jpg for each page with 12 pics on each. That was a lot of work. But I couldn’t find that option in the app. Other than that it was great."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Don",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T02:14:55.000Z",
          "Titre": "Brilliantly quick turnaround!!",
          "Contenu": "Brilliantly quick turnaround!!Only fly in the ointment, is that the reds printed a little hot. All in all, another good experience!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-10-03T20:42:08.000Z",
          "Titre": "Recording memories",
          "Contenu": "The program is fairly easy to use even if you are not entirely computer literate. I started making photo books on my Apple computer until they discontinued their program. I tried several new programs before I settled on Mimeo. It’s a very quick efficient service too."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "David Wells",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T09:14:01.000Z",
          "Titre": "Extraordinarily high delivery cost",
          "Contenu": "I would have given Mimeo 5 stars if it hadn't been for the unwelcome surprise of the extraordinarily high delivery cost which was only revealed once I'd made the book. I'll try another service next time."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T02:04:44.000Z",
          "Titre": "Quick and easy",
          "Contenu": "The whole process was so easy to work through  even for a novice.Easy to follow, to comply and easy to complete the photo book."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "N McLaughlin",
          "Nb_Reviews": 3,
          "Date": "2023-11-07T03:08:41.000Z",
          "Titre": "The platform is pretty easy to use.",
          "Contenu": "The platform is pretty easy to use.  I've made at least a dozen books with Mimeo.  Shipping is very quick - especially around the holiday season! My only wish is that I didn't have to put page numbers in manually:)"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T15:22:57.000Z",
          "Titre": "I don’t speak English….."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Nick Roberts",
          "Nb_Reviews": 10,
          "Date": "2023-09-26T22:18:13.000Z",
          "Titre": "design of…",
          "Contenu": "Really love the printing and design of the album and materials used however my glossy cover was creased on the edges of the spine which was a shame when presenting it.Usually it is perfect - but both copies had the creased/cracked spine on the outer cover.Disappointing really.They are very good value and the software is superb."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Steen",
          "Nb_Reviews": 3,
          "Date": "2023-11-21T20:15:34.000Z",
          "Titre": "The large calendars are excellent, but the ordering sure isn't!",
          "Contenu": "The large calendars are excellent, delivering photos as fine as I was used to when Apple produced them. Unfortunately, that is ruined by the very inconvenient ordering process that requires me to reproduce my order three times simply to send the same calendar to three addresses."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff Bloomer",
          "Nb_Reviews": 3,
          "Date": "2023-11-10T19:10:11.000Z",
          "Titre": "Product quality is always very good",
          "Contenu": "Product quality is always very good. The checkout part of the site is a bit awkward. I was hung up on some field but it wasn’t very apparent what the issue was. I did finally find the field that causing the purchase not to go through."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gordon Williams",
          "Nb_Reviews": 2,
          "Date": "2023-10-19T19:00:00.000Z",
          "Titre": "The final print books were beautiful",
          "Contenu": "The final print books were beautiful. I do wish there were a few more layout options that make slightly more efficient use of the spaces on the pages, but we do love the image quality!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ian",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T20:46:35.000Z",
          "Titre": "Happy to be able to work with Apple Photos, but needs some updates to save time...",
          "Contenu": "I really appreciate being able to design my photobook within Apple's Photos app. The ?plug-in / app definitely could use some updates to make it quicker and easier to use however.  The interface is very sluggish to load and moving things around is a bit clumsy. It would also be great is we could use our own self-defined guides for laying out and have the option to \"snap to\" those guides as an on/off feature.Ultimately, I had zoom in and out to try to get things to line up and even many times had to close the project and reopen it to have some control to shift items.  Another suggestion is allow us to turn on/off the tool bar and page views (at bottom) when we go into Full Screen view to be able to expand the page(s) we're working on to expand more."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Rebecca Dyck",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T18:03:52.000Z",
          "Titre": "Easy work, great product",
          "Contenu": "Making a calendar with Mimeo was easy and the result was exactly what I'd hoped it would be."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T01:42:01.000Z",
          "Titre": "Nice end product.",
          "Contenu": "Very happy with the book.But … Creating the book took a bit more effort than I expected. For example:  It’s cumbersome to modify pages - you can’t seem to separate them into individual pages and move them around.  Changing the page layout is also hard.  You can’t use a photo as a page background (or I couldn’t figure that part out.)"
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Anne Marie",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T21:54:41.000Z",
          "Titre": "The album looks very luxurious!",
          "Contenu": "The album was made with great care, the photo's are beautiful printed. It looks very luxurious.It is a pity that the address ticket was not printed correctly, the apartment number was not on it and the delivery ws delayed."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Linda Gregor",
          "Nb_Reviews": 3,
          "Date": "2023-08-21T10:20:50.000Z",
          "Titre": "Good quality books",
          "Contenu": "Good quality books. Pages smooth and thick, binding quite nice. Limitations with the software, more flexibility making the book would be helpful, like the automated photo placement didn't seem to work well. Photos printed a bit dark overall."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T20:07:02.000Z",
          "Titre": "Limited Design Options But Photo Color Quality is Great",
          "Contenu": "Photo quality on the calendar I ordered was better than the same calendar made with Mixbook. Design options are very limited, especially for photo books."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Kortney",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T23:02:11.000Z",
          "Titre": "Love the simplicity of this program",
          "Contenu": "Love the simplicity of this program. The printed quality is great. What’s not great is the shipping costs and that you can’t have more than one item in your cart and ship them together. That seems simple enough to do and could save the  user a lot of money."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Jonathan Peters",
          "Nb_Reviews": 4,
          "Date": "2023-08-30T12:40:01.000Z",
          "Titre": "Happy to repeat the exercise",
          "Contenu": "We are first-time users of the Photo Book software and found it relatively easy to get around with plenty of editing functionality. Shipment of our albums to Jersey in the Channel Islands appeared to cause a problem as the order was returned to sender before being re-shipped. The quality of reproduction is good.We only found out after having paid for our order that first timers would receive a discount - this was not promoted at the time, which would have been nice!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eva Trefz",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T20:57:14.000Z",
          "Titre": "Would love to see expansion of layout of pages",
          "Contenu": "I like the quality, however I would like to see more variety of the layout of the photos.In the past each Theme of the various books had lots of interesting layouts of photos that made albums unique and different. Now they all look the same and really limited. I don't understand the point of choosing different Themes when the layouts remain the same."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Bernadette",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T11:30:29.000Z",
          "Titre": "Very quick delivery and happy with the…",
          "Contenu": "Very quick delivery and happy with the quality.Putting together was sometimes messy. Would be helpful if photos uploaded were able to be resorted into date order, and once used marked as such someway."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "AnthonyH",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T05:42:04.000Z",
          "Titre": "Good quality product",
          "Contenu": "Good quality product with fast turnaround. Would like to see more options for multiple photos on a page other than just squares. Would also like to be able to move a single rather than just a double page."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T20:47:30.000Z",
          "Titre": "Good quality",
          "Contenu": "Quality of prints are good, delivery is fast. Interface could be better, adding text isn't always easy. Real problem: not downward compatible. Upgrading older projects removes all photo's: that's disaster level."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ash",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T17:52:53.000Z",
          "Titre": "The photos came quickly but in two…",
          "Contenu": "The photos came quickly but in two packages which would have been good to know ahead of time as I was looking in the wrong place (small one was mailboxed).Also one of my big photos was cropped unexpectedly to cut off a good portion of my father’s head rendering it undesirable to mount and display."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "voyageur trenitalia",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T21:31:37.000Z",
          "Titre": "Happy with final product. Software could still be more flexible",
          "Contenu": "Happy with final product. Would like more different templates to fit 3 to 5 pics (vertical and horizontal) in a month's page."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "David R",
          "Nb_Reviews": 2,
          "Date": "2023-10-20T21:23:02.000Z",
          "Titre": "A repeat customer.",
          "Contenu": "Excellent print quality and speedy service. A good range of products. I would like more flexibility e.g. inserting single pages and a wider range of photo shapes and templates."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T19:24:55.000Z",
          "Titre": "Creating the book is very easy",
          "Contenu": "Creating the book is very easy. I wasn’t home when the package arrived . It was left on my landing not my porch.  When I got home the cardboard package was soaking wet because it rained. I was fortunate that my picture book was not damaged.   Still dumbfounded why it was left on the landing.   Laziness I guess."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T17:21:00.000Z",
          "Titre": "Easy peasy photobook for a reasonable price",
          "Contenu": "Pictures quality was quite good, the book seems to be durable and well put together and best of all, it's exactly as it looked on the site when I submitted it (nothing out of the margins or missing text).  Quick delivery and turnaround time but I find the shipping cost high for what was shipped."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Tom Hennecker",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T02:37:35.000Z",
          "Titre": "Excellent finished product",
          "Contenu": "Excellent finished product! Very fast turnaround, received within plenty of time before Christmas. Online chat person let us in on generous available discount, which saved us plenty of money to make the whole experience even better. Not the first, or last time we’ll use Mimeo for our albums."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:53:39.000Z",
          "Titre": "Each year the product improves - one suggestion",
          "Contenu": "Each year the product improves.  I have ordered 5-6 calendars for family (under different names for ease of delivery).  The only request I have, is that it would be great if the calendars could automatically refill birthdays, anniversaries, etc.   Each year it takes me a while to input them. I was glad you increased the size of the font on calendar days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T17:47:55.000Z",
          "Titre": "2024 calendar",
          "Contenu": "2024 calendar. Photo's perfect. Colors matched what I sent you. This is something that is not always done. I will continue doing business with you. Nothing worse than not getting what should be a no brainer, color matching. Had a problem with that with another provider. So Thank You. John"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:31:09.000Z",
          "Titre": "Great product.",
          "Contenu": "I prepared two books to capture the highlights of a recent trip to Japan. The books are beautiful. And the service was great. One book arrived slightly damaged and I was able to easily report the damage, quickly get a response and received a perfect new replacement book within a week. Wonderful!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jamie H",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:18:05.000Z",
          "Titre": "Excellent quality and customer service",
          "Contenu": "I order photo books and calendars every year. They always look amazing. This year I had an issue with my photo books. Customer support responded to me very quickly and got replacements sent out right away. Very happy with how everything turned out!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Walter, Alberta, Canada",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:53:57.000Z",
          "Titre": "Been using Mimeo for several years.",
          "Contenu": "Been using Mimeo annually ever since Apple stopped their App. Uploaded my calendar pictures on a Saturday and received the printed product here in Canada 9 days later. To me, this is a quick turnaround. Printed quality is excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynn",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:31:41.000Z",
          "Titre": "Beautiful Calendars",
          "Contenu": "I received my calendar order timely and they are beautiful. Using the site was fairly easy and the finished product turned out beautifully. I like that they are \"individually packaged\" making it easy to give as gifts. I will absolutely use this site again, and will refer to family and friends!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jim Parker",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T03:55:48.000Z",
          "Titre": "Travel Memories I have now completed 17 travel related…",
          "Contenu": "I have now completed 17 travel related books now and each was a wonderful experience to create. The grandkids frequently take time to sit down and relive the experience. I have received good value for these books but must admit that they are getting more expensive and I will have to test my pension budget against the rising cost."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel M",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T06:20:58.000Z",
          "Titre": "I've been ordering Mimeo calendars for…",
          "Contenu": "I've been ordering Mimeo calendars for about 10 years and it seems to get simpler every time.  I like how easy it is to try a given photo, adjust its qualities, and then decide.  The image on my screen is well matched by what shows up in the print."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy Grider",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T19:06:26.000Z",
          "Titre": "My experience has been awesome from day…",
          "Contenu": "My experience has been awesome from day one of using Mimeo to create my projects. I make 6 books and 4-5 calendars. Every year I learn more about your tools,  and every year I get more creative with them. It's the highlight of the holidays to watch the reactions of the recipients when they open them. Your help staff is beyond helpful...and very quickly I might add. The only improvement I could suggest is that the calendar photos are a little more contrasty than the books. I think it's due to the color saturation I like to use. Less is more on these smaller photos. I loved that I was able to make use of the multiple discounts this year. Nice Mimeo, Thank You"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Casey",
          "Nb_Reviews": 4,
          "Date": "2023-12-19T21:30:10.000Z",
          "Titre": "Very easy to use and intuitive…",
          "Contenu": "Very easy to use and intuitive templates that mesh easily with Apple Photos, excellent turnaround time and very good print quality. One thing that might help though would be a few more fonts"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sharon Bergeron",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T14:28:09.000Z",
          "Titre": "I enjoy making my hard covered photo…",
          "Contenu": "I enjoy making my hard covered photo albums and calendars.  The paper and print is high quality and the books are beautiful.  I always get great comments on the projects I have made from Mimeo Photos.  The shipping is fast and sent in a hard covered cardboard case."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Christine",
          "Nb_Reviews": 20,
          "Date": "2023-12-19T12:21:31.000Z",
          "Titre": "Wonderful photo books",
          "Contenu": "Mimeo products are not cheap but they are of stunning and lasting quality. I've made their photobooks for years to create lasting memories. They look and feel so much superior to other products..."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jim",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T20:59:39.000Z",
          "Titre": "Easy software.",
          "Contenu": "Straight forward software for importing pictures and text. Quick delivery. Quality cards. Have used for Christmas cards for several years snd will continue using Mimeo"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Anna",
          "Nb_Reviews": 4,
          "Date": "2023-12-18T20:06:15.000Z",
          "Titre": "Mimeo has the highest quality products…",
          "Contenu": "Mimeo has the highest quality products (especially when working on iMac, MacBook & co). Easy to put together, all possibilities! The better quality also comes with a higher price. IMO it’s worth it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CSV",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:27:17.000Z",
          "Titre": "Top-notch reproduction",
          "Contenu": "We’ve been doing family calendars for years and our family members cherish each calendar as a keepsake for the year’s photos. Quality of production is top-notch!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judy Staples",
          "Nb_Reviews": 2,
          "Date": "2023-12-22T03:37:57.000Z",
          "Titre": "Important to know that the quality is wonderful.",
          "Contenu": "Not only were they very efficient but my calendars were wonderful and in time for Christmas.  The calendars that I do every years always turn out terrific!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:05:50.000Z",
          "Titre": "The quality of the cards and calendars…",
          "Contenu": "The quality of the cards and calendars of alwaysbeen great!The Mimeo team workers have always been veryhelpful when needed assistance in my projects. The service of receiving my cards or calendarshave been speedy.Thank you for your service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynn from Isle of Palms",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T23:50:49.000Z",
          "Titre": "User friendly",
          "Contenu": "I have been using Mineo video for at least 10 years and there have been many positive changes. I always create my own book. I can now re-arrange each page as I need to, and add pictures easily.   I only wish I could order other domestic items with pictures and not just books calendars and framed pictures."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Heather",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T18:56:33.000Z",
          "Titre": "Excellent service 5 years running",
          "Contenu": "I have used Mimeo to create an annual calendar for 5 years now. Every year the calendars turn out exactly how I expect! It's an easy app to use. The turnaround time is crazy fast. They usually have a holiday discount, which is really appreciated. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Carrie Hill",
          "Nb_Reviews": 12,
          "Date": "2023-12-18T20:27:32.000Z",
          "Titre": "Helpful on line chat to guide me…",
          "Contenu": "Helpful on line chat to guide me through designing my yearly calendar. The most tricky part was uploading and filling in the forms at the end, but I had great help from one of your guides and it all went through. I am a 77 year old granny, so I did well!The finished calendars arrived within a few days and were absolutely brilliant quality, design and value!Thanks, I will be doing them again next year."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stella McGurn",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T14:41:41.000Z",
          "Titre": "The program is user friendly.",
          "Contenu": "The program is user friendly.The finished books are beautiful.Quite prohibitive for printing more than a few books"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ruth Chanitz",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T18:39:13.000Z",
          "Titre": "I have been use MIMEO Photos for albums…",
          "Contenu": "I have been use MIMEO Photos for albums for few years and I really love it so much and ordered albums for family members"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T00:43:09.000Z",
          "Titre": "Mimeo is great for making books, calendars, and cards!",
          "Contenu": "Quality of Mimeo products, especially their printing is excellent.  Excellent color control.  Options for books, wall calendars, and cards are great. Having ordered 30 copies of a book, quality was maintained.  On a rare occasion, a flaw in printing might happen and if so, the support team responds quickly and issues a reprint. In terms of advice to users, plan ahead so one can use economy (the least expensive) shipping. Do note that the book cost remains the same no matter how many are ordered and reductions for shipping for multiple copies are minimal.  For Mimeo, I look forward to more layout options than just for titles and captions when book requires a significant amount of text as well as photos. I was able to enter a lot of text, doing my own page design, but it was hard, for example, to keep columns of text even. But - it did work and the results were very good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ReviewShark",
          "Nb_Reviews": 4,
          "Date": "2023-12-17T20:20:22.000Z",
          "Titre": "Easy way to create photo books using Apple Photos",
          "Contenu": "Creating the photo book using Apple Photos was easy.  The book arrived quickly, the quality is great, and the colors match the originals. The ordering process would be improved if Mimeo starts accepting Apple Pay as a form of payment."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "CIndy",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T21:59:17.000Z",
          "Titre": "Consistently high quality photo calendars year after year",
          "Contenu": "The quality of the final photo calendar was outstanding.  The photos all turned out great and the quality of the glossy paper used to make the calendar was outstanding."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynne Larock",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T19:30:35.000Z",
          "Titre": "Photo calendar takes stress out of holiday prep",
          "Contenu": "I make a family photo calendar every year. Using Mimeo with Photos on my computer makes the whole process straightforward and enjoyable. Quality is always excellent and I get my calendars promptly. Thanks for taking some stress out of my holiday prep, Mimeo!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "ewg",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T04:30:32.000Z",
          "Titre": "Quick and easy",
          "Contenu": "Great designs. And lots of choice. Logical navigation. Fast return of product. Quality of paper. Superb colours."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:50:42.000Z",
          "Titre": "Choose your own format, not a pre-set one",
          "Contenu": "I like the fact that I can choose to make my own format instead of having to choose one of the pre-set formats.  I like that I can put a text box with lots of text on one page and the photos can be on the opposite page.  Customer service was good.  Finished product looks classy and just how I hoped."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monica H.",
          "Nb_Reviews": 5,
          "Date": "2023-12-17T02:21:06.000Z",
          "Titre": "I really love the Calendar I created",
          "Contenu": "I really love the Calendar I created.  I do find the process of how to upload photos to it a little non intuitive, it's likely because I only do it once a year usually, but once I figured it out it was ok. Shipping was also prompt as usual."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T19:23:36.000Z",
          "Titre": "Probably my 10TH to 12th order from…",
          "Contenu": "Probably my 10TH to 12th order from mimeocards, calanders, hard cover books. Always great quality and fast delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger McLeod",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T18:42:59.000Z",
          "Titre": "QUALITY PRODUCT..",
          "Contenu": "QUALITY PRODUCT... easy to use app, uploads were quick, printing and shipping were fast, no damage to calendars when they arrived, pictures were accurately reproduced..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T16:52:57.000Z",
          "Titre": "Great company",
          "Contenu": "I have been using Mimeo since it first started doing business for Apple (before I knew it wasn’t even Apple making my projects. I am used to Mimeos ways of comprising projects and the products are of excellent Quality. When I have had questions it has been easy to communicate with a person for help. You have always been quick with delivery also. One year I made a book that wasn’t quite right and you corrected and shipped a corrected one out very quickly and it was my fault. My only issue is that if I make a book and cards I can’t do them on one order and combine shipping and also I can’t make 6 of something and send to different addresses without redoing each one for a separate address. Maybe there is a way but I haven’t figured it out.I would be very disappointed if I had to ding a different way to make my photo projects! I’m a loyal and happy customer."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Claire",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:18:13.000Z",
          "Titre": "I love mimeo photos and use it for all…",
          "Contenu": "I love mimeo photos and use it for all my photo books. Turn around is easy and I’m happy with the quality. Being embedded with iPhotos on the Mac makes the process so easy."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Raymond Howard",
          "Nb_Reviews": 12,
          "Date": "2023-12-21T15:59:30.000Z",
          "Titre": "The Calendar I purchased was very good…",
          "Contenu": "The Calendar I purchased was very good quality and my photos were all excellent quality when printed.The service was fast and efficient."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mireille",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:14:02.000Z",
          "Titre": "The discount for the Holidays",
          "Contenu": "The discount for the Holidays! Also I had a calendar that was missing a page and you sent another one. That was great. Thank you so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rand",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T18:45:04.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "There were some imperfections in the printing of my photobook. Mimeo took care of it right away. Final book is beautiful and a great memory of our trip."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vegas Guy",
          "Nb_Reviews": 7,
          "Date": "2023-12-13T20:43:18.000Z",
          "Titre": "High quality products.",
          "Contenu": "My calendars turned out so good! Very high quality and they are nice and big. Easy to make, though sometimes a little cumbersome when I wanted to add photos to the individual days on the calendar. I appreciate the  35% off and the shipping was quicker than expected. I will definitely make my yearly calendars again with Mimeo."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neil",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T15:26:07.000Z",
          "Titre": "A great way to make those pictures more…",
          "Contenu": "A great way to make those pictures more available and useful.  Who wants to constantly look at a screen to remember the past year?  Make an annual picture book, with a layout you choose, or make a memory book of a pet lost or a family member.  They look awesome on a coffee table and your family will pick the book up and look through them on a regular basis."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "June woods customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T01:45:29.000Z",
          "Titre": "disappointing",
          "Contenu": "My recent experience, I meant to give you one star.  It was difficult to negotiate, and $780 for eleven small soft covered albums was far too much... they look like something I paid $10 each for... very disappointing, and some of the photos in the middle of the book were cut in half.as for the $55 postage.. I felt it was overpriced and poorly executed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:00:23.000Z",
          "Titre": "I made two books",
          "Contenu": "I made two books.  Obviously the second one was easier than the first.  A UTube type of instructional video would be useful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NJMomSF",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T05:12:22.000Z",
          "Titre": "Highest quality photo books and…",
          "Contenu": "Highest quality photo books and calendars on the market. I have tried every company out there and have found Mimeo to produce the best products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristen Hunt",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:12:03.000Z",
          "Titre": "Perfect special gift to make",
          "Contenu": "I make these calendars every year for atleast 25 people. It is the best gift-as long ans you have the photos it is so easy to make and the quality is just beautiful. Thank you for your wonderful product. It truly is the best gift to make!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather Davidson",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:52:55.000Z",
          "Titre": "Quality. Efficient. Professional.",
          "Contenu": "Quality is great. The packaging professional. Not having to take my projects to the post office - priceless! Production & delivery- around the world - was most efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T09:46:13.000Z",
          "Titre": "Superb Customer Service",
          "Contenu": "Very good customer service. The folks who assisted me helped figure out how to upload my project on a very outdated operating system and browser. It took quite some effort to identify the hang ups that my computer had, working though chat and email, as I couldn’t even upload screenshot due to the age of my software. Once we had the right method identified, everything went smoothly and the photo book looks fantastic"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Veronique Tormey",
          "Nb_Reviews": 7,
          "Date": "2023-12-15T02:20:32.000Z",
          "Titre": "Fantastic facility for photo albums",
          "Contenu": "Really user friendly to make photo albums similar to the ones I used to make through Apple Mac. A lot of options for layout, zooming in/out, changing to black and white etc. Great quality for the finished product and rapid delivery."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "ごましお",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T10:53:11.000Z",
          "Titre": "Sale season",
          "Contenu": "I waited until the sale season to buy. This time I bought two hardbacks. I am making a book of my essays. The Japanese fonts in the current MIMEO are poor, so I create my manuscripts in Pages on my Mac and paste them as images.I have been using MIMEO since the Apple days, which is about 14-5 years now, and MIMEO is constantly being upgraded to improve its usability.I recommend MIMEO to Windows users because it has a web version as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer SK",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T13:25:41.000Z",
          "Titre": "This application is so easy on a Mac",
          "Contenu": "This application is so easy on a Mac! I can have an album on photos and go directly to the page without the hassle of downloading all the pictures first.  And I love having the options of different backgrounds.  It was so fun making my travel book! I could change picture sizes and positions  and move text boxes anywhere. Just don’t change themes in the middle of your work.."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Diane",
          "Nb_Reviews": 12,
          "Date": "2023-12-09T06:24:35.000Z",
          "Titre": "Family gifts for all from Mimeo again, great quality!",
          "Contenu": "For the second year in a row, I've made Family calendars with Mimeo for Christmas gifts, as well as a few book gifts for friends.The website is super easy to use, and fabulous quality.  These gifts are always well received and such treasured keepsakes for family.  The pricing is a little more expensive than some options to make books and calendars, but the quality is fantastic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T20:58:01.000Z",
          "Titre": "Exception business & pleasure calendars!",
          "Contenu": "I do all the creative work but can’t do the printing & binding for family & business calendars. Exceptional form and finish every time. Love the service and have been coming back for more over these many years!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan W. - Modesto, CA",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T23:35:14.000Z",
          "Titre": "Flexible, Versatile System!!",
          "Contenu": "I have been using Mimeo Photos for nearly 20 years to make a photo book of each of our vacations.  The program has continued to improve and grow through the years giving a multitude of choices with which to make great memories.  I enjoy making custom albums.  You may insert text where ever you wish, enlarge/crop/re-adjust pictures as you go.  The ability to add photos to your folder choices is great.  You may change fonts, font colors and background colors to your liking.  Being able to combine custom layouts with template layouts makes creativity shine."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MPC",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T17:47:49.000Z",
          "Titre": "Great Experience",
          "Contenu": "I've used Mimeo for 18+ 100 page photo albums.  This year was the best ever because I no longer need to get photos all into the same format.  Customer Service was great when I had 1 page, out of 900 total, that wasn't affixed to the book spine.  The book was immediately reprinted and sent.  I had one other \"quirky\" thing when I got notice I had 2 restricted photos that wouldn't be printed.  They were not.    Before I responded the book was printed and arrived in perfect order."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jean-Luc Charron",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T19:56:26.000Z",
          "Titre": "The app is very easy to use",
          "Contenu": "The app is very easy to use. The finished product is excellent, the colors are rich, nice size and make a great gift. One thing that could be improved is the wrapping and shipping. Again this year the corners of the calendars were slightly crushed, maybe using cardboard corners and wrapping in brown paper would help to better protect the product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Duck Hess",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T20:45:43.000Z",
          "Titre": "I have always been exceptionally…",
          "Contenu": "I have always been exceptionally satisfied with the Mimeo calendars. Always many compliments on the quality. Speedy product production and fast shipping. This year I tried to get a savings coupon from your web sight to save 25% -entered my email twice and never got an email back. But to show how much I am completely satisfied with your product, I ordered anyway. Pricey for a calendar so I only make one where I used to make several. $14.99 to ship a $30.00 calendar is expensive. Mimeo benefits because my recipient is worth it and it has become a traditional Christmas gift!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Nicole Weston",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T00:13:18.000Z",
          "Titre": "Easy and creative product to use",
          "Contenu": "The product is easy to use and I love the fact that it gives me the ability to make a very individual creation"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T17:10:10.000Z",
          "Titre": "I have used Mimeo for my calendars for…",
          "Contenu": "I have used Mimeo for my calendars for several years and EVERYONE that I gift them to LOVE them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebecca Bolduc",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T16:41:21.000Z",
          "Titre": "Wonderful quality!",
          "Contenu": "I ordered this a memory book with most of our pictures from a two week trip to Italy.  I was thrilled at the quality of every single picture.  It was incredibly easy to create, adding text where it was appropriate, and cropping and changing layouts to suit the number of photos I had."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Yirka TWARDEK",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T13:29:47.000Z",
          "Titre": "Great calendars",
          "Contenu": "Easy to use platform, great printing and fast delivery. Have been using this for a few years and will continue to do so."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debo Morris",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T15:59:25.000Z",
          "Titre": "I have been doing a photo book for many…",
          "Contenu": "I have been doing a photo book for many years at Christmas time. Very pleased with the quality of the product. They are easy to assemble and quick to get back to me. Thank you, Mimeo."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott G",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T21:31:38.000Z",
          "Titre": "Our card came out exactly as we hoped",
          "Contenu": "Our card came out exactly as we hoped. Excellent quality and fast service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sherry",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T20:35:34.000Z",
          "Titre": "This is the 9th book I have created…",
          "Contenu": "This is the 9th book I have created with Mimeo Photos.  The quality of the books is outstanding.  Even photos I was worried were not good enough turned out perfectly.  The paper used in the books is very high quality. You will not be disappointed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vanessa P",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T18:09:35.000Z",
          "Titre": "A Great Product Via Apple Photos",
          "Contenu": "I’ve been ordering Christmas cards from Mimeo for several years and I’m very pleased with their service. I like the ability to completely personalize your product and not just being stuck with templates. Templates are available but you can customize them. Mimeo is an available extension with Apple Photos, which is what I use to design my products. Shipping and processing have always been prompt."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Derko",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T20:20:24.000Z",
          "Titre": "Always excellent service and quality of…",
          "Contenu": "Always excellent service and quality of product.  We have used them for years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T06:50:02.000Z",
          "Titre": "Quick Turnaround",
          "Contenu": "Fast service and shipping. FYI - your end product will reflect the work you put into it. Pay attention to all the details before ordering and your product will look great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura McNally",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T21:38:48.000Z",
          "Titre": "Very professional quality",
          "Contenu": "Mimeo continues to improve their product/website. It is easy to use and looks very good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer, Virginia",
          "Nb_Reviews": 4,
          "Date": "2023-12-11T19:30:26.000Z",
          "Titre": "It usually takes a while",
          "Contenu": "It usually takes a while but when I remember the steps, it is pretty easy to get everything like I want it. The cards are high quality and arrive so quickly, I am always amazed. I am proud to send them to friends and relatives."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "IdaLucia",
          "Nb_Reviews": 7,
          "Date": "2023-12-11T17:11:05.000Z",
          "Titre": "Easy to use with beautiful results!Once I got started I was able to create…",
          "Contenu": "Once I got started I was able to create Holiday Greeting cards and a memory book of our vacation on my iPad! So easy, a child could do it! The finished products were beautiful!"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "annemurphy",
          "Nb_Reviews": 6,
          "Date": "2023-12-07T23:05:50.000Z",
          "Titre": "I usually enjoy using your site but…",
          "Contenu": "I usually enjoy using your site but this year my computer was not working properly and I found it difficult to make the calendar. , I was not able to edit the photographs. This was nothing to do with you- it was my computer. In the past I have found your site easy to use and I have made calendar for the family every Christmas for a number of years. They have always been very professional and my family have enjoyed getting them. Is it possible to make a calendar with Mimeo photo extension on an ipad. Thanks for making all this possible"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:48:58.000Z",
          "Titre": "Fast shipping!",
          "Contenu": "Mimeo Photos makes gorgeous books and ships them so fast! Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carole S.",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T23:14:25.000Z",
          "Titre": "I love how easy it is to make calendars.",
          "Contenu": "I love, love, love my experience with Mimeo Photos.  Every year I make calendars for family and friends and it is always so much fun!  It is easy and much appreciated by the recipients.  Hey, I am \"80\" and if I can do it, anyone can!"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Kilchsperger",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T12:15:47.000Z",
          "Titre": "very helpful",
          "Contenu": "I couldn't upload the hole data file but the credit card account was already charged. I wrote an email to Mimeo Photos and within 30min the problem was solved.Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 4,
          "Date": "2023-12-19T16:17:56.000Z",
          "Titre": "Easy to use",
          "Contenu": "If I had a question, I could usually find it in the tutorials. I emailed a few times and was answered promptly."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Susan B.",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T18:21:18.000Z",
          "Titre": "Turned out exactly as viewed",
          "Contenu": "The book turned out exactly as it looked in the software. I’m very happy with the quality.I did get a few warnings about some pictures that were low resolution, which I appreciated. So yes, those were a bit blurry but I knew they would be and it was fine.Easy tool to use. Great product. Will use again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dusan",
          "Nb_Reviews": 6,
          "Date": "2023-12-07T01:44:59.000Z",
          "Titre": "Replacement for Apple photo books",
          "Contenu": "I was looking for a photobook company that I could use for my different photobook projects after Apple stopped providing their services. I am very happy with the Mimeo product and will use it again. The program is similar to the late Apple one and is easy to work with. Upload and purchase were easy, and the production time was very reasonable. My only advice is to make it clearer that Mimeo is filling Apple's shoes. I do not know what is possible legally, but it was not 100% clear to me before I started to build my project. I would spend more time on my review if the request would come from Mimeo directly. I know the Truspoint is legitimate, but it is not the same."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T21:02:34.000Z",
          "Titre": "Product quality (calendars) is…Excellent",
          "Contenu": "Product quality (calendars) is excellent. Service was quick and I received happy responses from everyonewho I had gifted a calendar. This a yearly ritual andMimeo always comes through."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Donna Lumley",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T21:19:10.000Z",
          "Titre": "Calendars were beautiful and arrived…",
          "Contenu": "Calendars were beautiful and arrived when expected! Thank you. Cost is getting a bit higher!!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Nina",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:16:48.000Z",
          "Titre": "Problem with first Order without discount",
          "Contenu": "I placed my first order on Mimeo but unfortunately forgot to fill in the discount. That‘s why I started to chat with a really friendly and patiently person who helped me during the whole uploading process. Thanks a lot for your great help :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T04:42:53.000Z",
          "Titre": "The quality was even better than I…",
          "Contenu": "The quality was even better than I expected! Everyone who looks at the book wants to know what company I used. Truly, this really did surpass my expectations! I will definitely be using Mimeo again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karencustomer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:10:47.000Z",
          "Titre": "The quality is always great",
          "Contenu": "The quality is always great. The service as well. My only issue is with the high cost of shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:17:30.000Z",
          "Titre": "The product that was produced was…",
          "Contenu": "The product that was produced was beautiful. Excellent workmanship and good turn around time. I was truly impressed by the quality."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Oliver Facey",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T09:43:17.000Z",
          "Titre": "Beautiful high quality photo book and…",
          "Contenu": "Beautiful high quality photo book and easy to use software.  I appreciated being able to relocate individual rather than double pages which is an improvement in the software."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:02:15.000Z",
          "Titre": "Great experience overall",
          "Contenu": "Great experience overall. The final result was a great book of memories"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Catherine McRae",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T10:53:29.000Z",
          "Titre": "Love how easy this site is to make…",
          "Contenu": "Love how easy this site is to make beautiful memories come to life! I wish my older books I made didn’t have so many errors ending in all my work erasing…"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Cathie",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:33:30.000Z",
          "Titre": "It was fairly easy to work with",
          "Contenu": "It was fairly easy to work with. I hope my kids love the calendars If they do, I’ll be back next year."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Margaret Weissman",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T05:54:14.000Z",
          "Titre": "I have been very happy with the…",
          "Contenu": "I have been very happy with the calendars that I have created each year since 2011 however this year it came with out an envelope. I post the calendars to my family for Christmas and the envelope has made posting easier because it protects the calendar and also makes it easier to wrap. I had to get creative with a plastic folder this year which was not as satisfying. I expect my family to keep the calendars because they contain the family history. I miss the envelope. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Louis",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T00:56:02.000Z",
          "Titre": "I really like 1) the compatibility with…",
          "Contenu": "I really like 1) the compatibility with Apple Photo, 2) that I can produce PDF copies to review and proof read my project, 3) the quality of the printed book"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T20:56:04.000Z",
          "Titre": "A travels book completes the Trip",
          "Contenu": "A photo book completes the Trip!  With digital photography, it's so easy to gather thousands of images, but they get lost in our laptops.  The act of creating a Mimeo book encourages curation of the best images needed to tell a story.  I really enjoy sharing the images in a high-quality book format and it's so engaging and longer-lasting than a quickly-shown \"slide show\" from the phone or laptop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wisconsin customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T07:02:16.000Z",
          "Titre": "Mimeo gets a high rating",
          "Contenu": "They have greatly simplified the process to make a book and they respond quickly to tech help questions. They have also shortened the production time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martha Shaw Sylvester",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T16:38:11.000Z",
          "Titre": "Love Mimeo Photos",
          "Contenu": "Each time I use Mimeo Photos it's easier.  The latest update made the project better than ever and the final product is beautiful.Every year, two family calendars are created. All really enjoy the shared memories."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pamela Copeland",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T17:16:41.000Z",
          "Titre": "The Mimeo tool is very easy to use",
          "Contenu": "The Mimeo tool is very easy to use.  It was very convenient to build my Mimeo book inside of the iPhoto's app on my MAC.  The tool is user friendly.  The end product looked amazing!  It was delivered very fast.  The recipient of my photo project loved it!  Great experience and will use again."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Oddbjørn S Kløvjan",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T19:21:41.000Z",
          "Titre": "Very good service",
          "Contenu": "Very good service. I made a mistake related to an order/purchase, which Mimeo sorted out quickly for me. I have used Mimeo Photos several years for both photo books, but mainly annual calendars. It is easy to make books/calenders and the result printed quiality is very good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "neurodrew",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T02:55:30.000Z",
          "Titre": "I experienced fast and accurate service…",
          "Contenu": "I experienced fast and accurate service generating 100 or so Christmas cards, with text and a photo."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:31:41.000Z",
          "Titre": "Great",
          "Contenu": "Great, quality printing and book layouts!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T16:24:08.000Z",
          "Titre": "The Christmas cards I designed were…",
          "Contenu": "The Christmas cards I designed were printed on very high quality card stock. My order was delivered quickly. My only negative was the price really went up this year."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Lynn Jay",
          "Nb_Reviews": 5,
          "Date": "2023-12-21T13:50:18.000Z",
          "Titre": "Calendar",
          "Contenu": "Calendar was easy to put together and the quality it beautiful."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T21:35:15.000Z",
          "Titre": "Your ordering site is easy to navigate",
          "Contenu": "Your ordering site is easy to navigate, your production and delivery time is quite fast and your photo and packaging for the calendar is excellent"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Carrie Hill",
          "Nb_Reviews": 12,
          "Date": "2023-11-30T20:01:59.000Z",
          "Titre": "A great quality product!",
          "Contenu": "The whole procedure is quite complicated for a 77 year old granny, but with great back up and online chat from Ashmir, I managed to produce my yearly calendar as before, incorporating all my grandchildren, family, cats, dogs, etc! I needed help with the final uploading which he provided, and within three days, my 12 calendars arrived, all perfect, beautifully packaged and presented..really recommended for a very professional and good quality product..thank you all at Mimeo!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Woglinda Johnson",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T01:20:29.000Z",
          "Titre": "Suggestions",
          "Contenu": "Your product is excellent. Two suggestions: (1) allow for more precise spacing between pictures on a spread. I make all my books starting with a blank template. My books end up with pages where the spacing between photos is inconsistent. I would like to have more ability to adjust spacing on a spread. (2) I would like to have the option of adding page numbers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T20:56:42.000Z",
          "Titre": "I love the different ways you can add…",
          "Contenu": "I love the different ways you can add text to the photo book pages.Once i figured it out it was so greatWish they had more background options but other than that I love it"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Customer ew",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:19:00.000Z",
          "Titre": "Best Printing Service",
          "Contenu": "I've been a Mimeo customer for years and am still happy with its professional quality books and calendars, its reliable and quick service."
        }
      ]
    }
  ]
}