{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "moneydolly.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul D",
          "Nb_Reviews": 4,
          "Date": "2023-12-17T18:24:23.000Z",
          "Titre": "Ordered cookie dough for my Grandson's…",
          "Contenu": "Ordered cookie dough for my Grandson's fundraiser at Independance Middle school.  Gave CC number but never got the \"dough\" and never got a confirmation.  Not sure if I ever got charged as I can't find a record beyond, \"Thanks for support\" 2 Units?  How do I get in touch with Moneydolly?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Antoinette Deshotel",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:35:51.000Z",
          "Titre": "I only received one sweatshirt",
          "Contenu": "I only received one sweatshirt. I ordered a man’s XXL shirt and was charged for it yet still have not received it!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Capital One Gloria",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:32:20.000Z",
          "Titre": "I did not received my order I paid but…",
          "Contenu": "I did not received my order I paid but didn't get my order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve Watson",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T04:23:31.000Z",
          "Titre": "Biggest waste of time",
          "Contenu": "Biggest waste of time. It charges for you to donate, and the numbers my kid put in there to send the texts to ( which the coach told him to put all adult numbers off his contacts which isn’t right to tell students to do since they didn’t get permission to give the numbers out) kept getting texts about it with no way to stop."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Needs to be better",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T18:19:42.000Z",
          "Titre": "Horrible platform and prizes",
          "Contenu": "Horrible platform and prizes.  No one wants over priced popcorn.  The fees are reasons why some folks didn’t get a lot of supporters.  For improvement,  I would say have better things people can buy.  Get with vendors for perhaps gear or sport related items.  Snapraise was much better choices in my opinion.  They also had fees but lower than yours."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "M. Georges",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T16:41:33.000Z",
          "Titre": "I do not like this platform",
          "Contenu": "I do not like this platform. I don't like being charged a fee to use my credit card OR having it mandatory to use a card to place an order. I also feel it is completely unfair to count 1 donation, regardless of the amount as \"1 unit\" towards the student's unit count. I also feel it is a poor choice not to have a direct ship option so those with family and friends who do not live nearby but who want to support and who want to receive \"something\" for their donation, ie they want to receive a box of cookie dough for their $25 donation towards the team."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sophia Albertson",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T18:06:41.000Z",
          "Titre": "I’m so disgusted with this whole…",
          "Contenu": "I’m so disgusted with this whole process. First it’s taking 2 months to get the cheesecakes, 2nd I just found out that the cheesecakes are being sent to the school so all of the out of state people that ordered a cheesecake won’t be able to get there’s. I’m going to have to personally cover the cost of that now and even though the cheesecakes have not been delivered the information is no longer in the app so I can’t even give people a heads up. My daughter was one of the top in sales but we will absolutely not do this again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas Smith",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T14:23:15.000Z",
          "Titre": "Still waiting on my order?? Still waiting??",
          "Contenu": "Still waiting on my order?????and still waiting on my order almost 3 WEEKS!!! Please refund me my money… This seems to be a scam… Now December 12th???  No email confirmation… nothing… saga continues… oh my :("
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve Hernandez",
          "Nb_Reviews": 3,
          "Date": "2023-11-21T15:17:29.000Z",
          "Titre": "Disappointed",
          "Contenu": "I am happy to hear that the Fullerton High School Song and Cheer team accomplished their goal but I never did receive the gift that I paid for"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marjorie Wadden",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T21:04:50.000Z",
          "Titre": "The amount charge to my account was…",
          "Contenu": "The amount charge to my account was twice as much as I selected to donate and there was no way to rectify the issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Doona Ballard",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T19:31:35.000Z",
          "Titre": "I hate your platform",
          "Contenu": "I hate your platform. You inundated me with constant give, give, give. It’s annoying and it’s not even having the child asking. I’d much prefer interaction with the child."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rebecca Husk",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T16:43:15.000Z",
          "Titre": "I refuse to give out peoples phone…",
          "Contenu": "I refuse to give out peoples phone numbers to a company I know nothing about.  It was annoying to receive 3 text messages, so any contacts I gave would have hated that.  Also not being allowed to choose a donation amount and being forced to give at least $25 is not feasible for a lot of people in this day and age."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T22:45:59.000Z",
          "Titre": "Impersonal and Lazy",
          "Contenu": "It seems that a group “push” is the method used here to solicit people, rather than each potential buyer receiving an individual notification. This seemed cold, unprofessional, and unappreciative to me. We gave a donation, and were solicited again AFTER we had donated. Thinking the transaction didn’t go through, we gave ANOTHER donation.Even after giving 2 donations, we still were solicited to give yet again. This is a huge turnoff. I will think twice before purchasing from you again.Also, I think this is way too easy for the students. I expect them to put in some effort beyond sending a message to raise funds."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 2,
          "Date": "2023-09-02T20:55:54.000Z",
          "Titre": "Why must donating be so difficult?",
          "Contenu": "Donating money online thru MoneyDolly is easy. Obtaining a hard copy of the donation for tax purposes is a royal pain. I donate regularly to my alma mater, Union Gospel Mission, Susan Komen and several religious charities. All of these provide, on the donation page, a one-click method for printing a 1-page receipt of the donation.  This receipt has minimal white space and shows: date of donation, gift amount, name & number of the source used to donate (VISA, Mastercard, etc), donor's name, recipient's name and a confirmation number.  MoneyDolly needs to get their head out and fix this issue for those who wish to donate to a cause that uses their service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michelle LRette",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T23:29:28.000Z",
          "Titre": "My credit card was stole right after I…",
          "Contenu": "My credit card was stolen right after I donated to this site. I know it was related to using this site, because I never use this particular card and 2 hours after I used it to donate there were charges hitting from all over. Terrible experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lynette Dugas",
          "Nb_Reviews": 2,
          "Date": "2023-10-11T23:36:33.000Z",
          "Titre": "Read the fine print!",
          "Contenu": "Read the fine print!!  I may have missed the part where I agreed to allow users in my team that I have helped on previous fundraisers continue to have access to my contacts personal information for future fundraisers and allow them to use them without asking my permission to do the same on a separate fundraiser.  I also received calls asking if the fundraiser text was spam and complaints of the amount of communication is sent out on your behalf.  Before I did this fundraiser I probably would have done the same so let your contacts know ahead of time if possible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim and Lois Wells",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T00:48:45.000Z",
          "Titre": "Bring back real cards",
          "Contenu": "Having the opportunity to have a real card to sell to elder relatives and neighbors, would have given more sales. Not all people want the ap on phone and purchase with credit cards.   I know our grandson could have sold 10 more if they were just a card."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Astrid Dolezal",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T21:02:53.000Z",
          "Titre": "Shocked and Disappointed",
          "Contenu": "I was completely shocked to see how much the fees were for my purchases. It made me think and wonder how much the school actually receives from this fundraiser. The only reason why I gave it a one star rather than a no star, was because of the convenience of sending funds to the fundraiser. I would vote against having MoneyDolly associated with the fundraiser."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T01:59:02.000Z",
          "Titre": "I made donation first day and was…",
          "Contenu": "I made donation first day and was repeatedly harassed for a donation. There has to be SOME way for donators not to have to put up with weekly harassment AFTER donating. Everyone I talked to admitted this was a flaw."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tracey Nesbit",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T18:46:51.000Z",
          "Titre": "I couldnt figure out how to sell the…",
          "Contenu": "I couldnt figure out how to sell the items from the app or use a code for it - i felt the app was not easy for some reason mayb jus me idk"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karyn Wright",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T16:03:49.000Z",
          "Titre": "I did not get any explanation as that…",
          "Contenu": "I did not get any explanation as that what would occur. Texts were sent which caused a large amount of concern for friends and family. When I reached out, I was able to remove contacts but no one cared about the negative experience. I would NOT recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Virginia Graham Winters",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T21:15:10.000Z",
          "Titre": "Do not use my review",
          "Contenu": "I loved that each step was understandable (easy to follow). I was able to handle my contribution with each step telling me exactly “how to”. Having the choir member’s picture is a nice touch. It personalizes the whole experience, rather than a blank order form."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mr. Disappointed",
          "Nb_Reviews": 3,
          "Date": "2023-07-22T16:56:17.000Z",
          "Titre": "Did not complete registration/circle",
          "Contenu": "Did not complete registration/circle, yet app still took my contacts and would send pushy ghost messages out stating they were from me.  Felt embarrassed and privacy violated.  Some of my contacts are no longer speaking to me cause of the aggressive guilt sales tactics"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason Mickelson",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T13:42:55.000Z",
          "Titre": "I have never been able to access the…",
          "Contenu": "I have never been able to access the cards that were purchased. It was for our local football team and I would support them anyway, but it's a real bummer because my kiddos were looking forward to the deals on the cards.                              UPDATE, Trustplot fixed my issue the same day I filled out this survey. I thought it was just a lost cause. Thank you for fixing this I look forward to buying cards again this summer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nick P",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T00:31:05.000Z",
          "Titre": "problems with moneydolly",
          "Contenu": "the man who came to talk to us about the app was a salesman, but not one that makes you feel comfortable. he was one that rubs you the wrong way, and was generally annoying. the pre made message that you send to people seems like a scam by the way it’s worded. i didn’t enjoy the fundraiser in the 2 years i’ve done them. they don’t feel genuine at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leah",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T16:23:17.000Z",
          "Titre": "Technical difficulties for many",
          "Contenu": "Myself and others had a hard time using this program. It either had some technical bugs or something else, but many of us had to try to multiple times to get our donations to process. This issue may discourage others from donating as they may not try multiple times to get it to work properly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tc Garrison",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T22:56:18.000Z",
          "Titre": "We were told it was tax deductible and…",
          "Contenu": "We were told it was tax deductible and it’s not. We were told it was one price and ended up being more. No where on the flyer does it say plus processing fee. I don’t understand why it takes more money to process one $100 purchase than it does to process one $10 purchase. It clearly states that it’s for a tax deductible donation and that turned out to be false. Nowhere on the flyer does it state that the tax deduction is only for straight donations only"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maureen Babinsky",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T18:10:23.000Z",
          "Titre": "Not enough information was given",
          "Contenu": "Not enough information was given. I had no idea what MoneyDolly was or how it worked. Also, the coupons that the buyer could use were all for local establishments and I am a grandmother of the seller and I live out of state, I don't know if MoneyDolly is always for local businesses, or if the person selling the coupons didn't have enough information."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ashley Olmeda",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T00:41:41.000Z",
          "Titre": "Absolutely useless",
          "Contenu": "Absolutely useless. If you are not able to actually answer customer concerns when they don’t get products in the way they are said to get them you are useless. Telling someone your just a 3rd party is passing the buck. If your going to handle a fundraiser then the delivery details should be explained during check out because I put in a shipping address only to find out my items were 2000 miles away at the participants school. I would have paid for shipping given the option."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tobie Frey",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T03:16:10.000Z",
          "Titre": "Limited locations",
          "Contenu": "We bought $50 worth of coupons to support our grandson. However  the coupons were all local to the Dallas area. we are in San Antonio. Therefore we are unable to use any of the coupons We are very happy to contribute to the fund raiser for our grandson however if you could increase your area of businesses it would be a win win"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary-Kyle Windle",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T16:10:04.000Z",
          "Titre": "Worst possible method of fundraising for youth",
          "Contenu": "I absolutely hated the online format. This is a difficult system to use and quite frankly very impersonal. Generally whenever there is a fund raiser, my child is responsible for doing the work to obtain support. My child makes rounds in the neighborhood or takes the packet to places like church or our workplaces. They get an understanding of the people and relationships that are involved with fund raising. The way this is set up, first off looks like a scam whenever people receive it as a text or email, but relies on the parents to recruit other adults in the child’s life to do the work for them. I hated this format and only participated this time as we were told this was a new program and it would be evaluated afterwards so I wanted to be able to give feedback. If it is offered again, I will not participate."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lynette Dugas",
          "Nb_Reviews": 2,
          "Date": "2023-07-06T21:32:28.000Z",
          "Titre": "Bothersome",
          "Contenu": "My contacts sent me several messages complaining about the number of times they were sent texts, emails, etc. to ask for donations.  The minimum donation was $35 and quite often supporters would like to donate but they are not able to give $35, options for $10, $15, or $20 would have allowed us to receive more donations."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Katie, from Virginia",
          "Nb_Reviews": 2,
          "Date": "2023-01-18T07:19:53.000Z",
          "Titre": "Would rather the hand held card",
          "Contenu": "Would rather the hand held card. Don’t need another app on my phone. Can’t give the “card” to my husband when he picks up dinner because I can only put the app on one phone. I forget about it. Haven’t used it once. Happy to support the kids, but I won’t be buying this virtual discount card again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sandy Sigala",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T00:35:59.000Z",
          "Titre": "Poor customer service",
          "Contenu": "I just picked up my order and I was very disappointed to see I didn’t get what I paid for. Instead you sent a different item that we will not be eating as one of my kids is allergic to pecans. A courtesy email or phone call would have been nice so I can make the decision on what other cookie dough I would want instead you sent something that will be going to waste. I would still like to receive my item I ordered and paid for. Emailed almost a month ago and still not reply from anyone. I will not be part of this fundraiser again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SP",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T17:28:13.000Z",
          "Titre": "Very impersonal",
          "Contenu": "This was a very impersonal way to fundraise. I also didn't like that everyone could see who bought for an athlete, it actually caused some issue with friends and family buying for some and not all in a family."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wagner, Elizabeth",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T21:14:40.000Z",
          "Titre": "Junk fees charged to donors upon checkout, on top of charging the charity 20%.",
          "Contenu": "The website is incredibly archaic.  The biggest issue is that you are charged a fee to donate money.  Never has any other fundraiser I have donated to charged a fee to donate.  This fee isn't disclosed until you go to check-out (like all junk fees).  MoneyDolly also keeps 20% of the money raised. So, I donated $100, plus on top of that was charged a fee.  They pass only 80% of what I donated, meaning $80 went to this cause.  They kept what ends up being a high percentage when you include the fee.  This practice is sketchy to say the least."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas Smith",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T07:13:52.000Z",
          "Titre": "Our son didn't receive credit for…",
          "Contenu": "Our son didn't receive credit for donations received in addition to the cards he sold.  Most of our family is out of state.  They can't use the cards where they live, but wanted to donate.  We'd prefer the team just do a fundraiser and not fool with these cards in the future."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shannon Maloney",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T02:09:52.000Z",
          "Titre": "Money Dolly’s use of past contacts",
          "Contenu": "My daughter ended up sending this request out to people without our knowledge. It must have gone to people who formerly participated in a Money Dolly as she doesn’t have email addresses for some of them. We are really concerned about this strategy for boosting fundraising."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Smart money mom",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T15:57:30.000Z",
          "Titre": "Zero stars",
          "Contenu": "Zero stars.  This fundraiser is essentially panhandling for kids, but worse.  The kids don’t even have to ask people for money.  They send texts out to their contacts asking for money, of which they only profit a portion & your company takes a portion.  Your representative comes in during school hours when parents aren’t around & makes the children feel like they have to comply with what they are being told.  I (parent) immediately upon receiving the text contacted my child’s contacts & told them not to “donate” because there would be more appropriate ways to donate in which my child would actually be taught values."
        },
        {
          "Note": 1,
          "Lieu": "KR",
          "Pseudo": "Gwendolyn Emmsley",
          "Nb_Reviews": 3,
          "Date": "2023-08-16T22:23:47.000Z",
          "Titre": "$3 charge fee to fundraise per supporter",
          "Contenu": "While fundraising supporters are paying a $3 fee to this company? Just use PayPal, cash app, or venmo if you want to support someone’s fundraiser to ensure all $ goes to the member."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "n/a",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T16:11:17.000Z",
          "Titre": "I hate this school fundraising garbage",
          "Contenu": "I hate this school fundraising garbage!  The state and local governments should support our public schools!  The children should not be forced to ask people for money for activities that the public should step forward to fund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michelle Mcinnis",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T16:53:35.000Z",
          "Titre": "I watched the video",
          "Contenu": "I watched the video, followed the directions and asked the teen who come by our house, but no one can tell me the code to get in once I've downloaded the app.  Very frustrating.  Won't recommend this app because there are too many steps and still couldn't get it to work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nancy Harris",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T18:35:39.000Z",
          "Titre": "Truly Disappointed",
          "Contenu": "I am disappointed in the gentleman who worked with us.  He was quite rude.  He had the students download the app and they were working together to help one another.  He didn't like the fact they didn't get quiet quick enough for him and was rude!  Next, he decided to not show up on the last day of the fundraiser to do the big finale because he thought our students were too rude.  I have to be honest, I have taught for 25 years and the students were just fine.  He was supposed to do a survivor activity where the students would win money and of course he canceled saying we were too rude."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Veronica Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T01:14:27.000Z",
          "Titre": "I recently supported the West…",
          "Contenu": "I recently supported the West Springfield High School Baseball fundraiser, specifically in support of my nephew.  I did not like, that even though school officials shared with the public that each unit is equal to $35.00, my donation of $250.00 only reflected in the system as 1 unit of credit towards my nephew's fundraising.  No where were monetary donation values reflected, so that my nephew could see his progress compared to his teammates.  I did not like that at all, and hope my nephew was not penalized in any way for it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Melanie Grantham",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T17:32:08.000Z",
          "Titre": "Donation fees and amounts",
          "Contenu": "When someone donates, the donor should not have to incur fees.  Also donations should not start at 35.  with the economy the way it is, all parents, grandparents, friends, aunts, uncles should be able to contribute.  At the least, a $20 donation.  Many people live on fixed incomes or have more than one child to donate.  What happened to old fashioned cash options."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AH",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T03:22:06.000Z",
          "Titre": "I did not enjoy this fund raising…",
          "Contenu": "I did not enjoy this fund raising experience at all. First I had to down load an app. An app that has very minimal purposes. No one wants another app. 2. The coupons are basically non transferable. You can transfer them once, to a person with the app (see above comment on no one wants another app). But then you can’t get them back. So if my daughter was going to a mall where she might use them without me I can’t transfer them and then get back unused ones ever. She would now be in possession forever. So basically I supported the organization with little hope of ever using the product they sold me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T18:25:21.000Z",
          "Titre": "I received a card for Festival Foods",
          "Contenu": "I received a card for Festival Foods, I redeemed my first coupon at the register and the checkout had no bar code or code to enter and couldn't do anything with it. The manager also didn't know how to use it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Wissman",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T02:28:29.000Z",
          "Titre": "The “donation” feature is not explained…",
          "Contenu": "The “donation” feature is not explained well. If a card is $25, and someone decides to just donate instead, a child or program should get credit for the monetary amount of the donation (i.e.- $100 donation = 4 cards, not 1 card + $75). It’s very misleading and will not use or contribute to this fundraiser again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mom of Two",
          "Nb_Reviews": 2,
          "Date": "2023-01-18T02:18:25.000Z",
          "Titre": "The cinnamon buns were not worth the…",
          "Contenu": "The cinnamon buns were not worth the money paid for them. The cost was $25 and the quality was lower than the ones that come in a can.  Also I ordered several packs and was charged a processing fee for each package. Very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JM",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T13:51:23.000Z",
          "Titre": "Absolutely horrible",
          "Contenu": "Absolutely horrible.  App doesn't allow simple donations.  App is spyware to the extreme.  If your school signs up for it, you won't have any choice.  But try to avoid if you can."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AB",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T16:18:22.000Z",
          "Titre": "Donations should count toward goals",
          "Contenu": "This is a great way yo fundraise but please remove the donation tab if it won’t count toward the kids goal. Last year someone donated more than $100 snd they were angry when they found out it didn't help the student’s goal. People shouldn’t have to buy 10 cards. Count the donations or remove the tab. This is shady and defeating for the kids."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-01-18T02:14:09.000Z",
          "Titre": "Cost to much for the amount of jerky…",
          "Contenu": "Cost to much for the amount of jerky per pack. Also hardly any of the money goes to the student. Next time I’m just going to donate the money straight to the school and ditch the middle man. Best of luck to you and your scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T16:28:07.000Z",
          "Titre": "My family and friends got very…",
          "Contenu": "My family and friends got very aggravated with the repeated messages. Most of the ones said that they were not going to participate but still got messages and there is no way or easy way that I could find to remove them. Also, it makes it look like my son  is begging for money when in fact it is the app is doing this.My son was working hard to be able to go to the party and his understanding was that every twenty five dollars would be counted as a unit. I had several of my elderly family that reached out to me and didn't  want  to do the whole credit card thing, and they  just gave  me cash instead. Plus I have a couple friends that tried to donate and the app donated or charged more money than they were wanting to give. I also lost out on about fifty dollars because several people wanted to give 5 or ten but that was not allowed. You would think if you want money any amount would do. At this point I was not willing to front all of this money just so it could be donated.So therefore I just use my credit card after receiving cash from them so that he could get credit for multiple units.Instead the app only counted one unit when I had given seventy five dollars. I think there are a lot of glitches with this app and in the future we will not participate in thus."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Very Disappointed",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T18:15:47.000Z",
          "Titre": "The festival card was very difficult to…",
          "Contenu": "The festival card was very difficult to use and the store did NOT want to take it. It was very embarrassing to hold up the lines. i liked the regular cards  much better! I love to support the kids but I will not do the app purchase again :("
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T18:05:22.000Z",
          "Titre": "Was just 0 point to this fundraiser",
          "Contenu": "Was just 0 point to this fundraiser , was basically just giving money l… didn’t sell anything but “tiers”"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen Mach",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T01:00:39.000Z",
          "Titre": "I haven’t gotten the product",
          "Contenu": "I haven’t gotten the product.  Nothing in the confirmation email about delivery.  No update on delivery. No way to check or see delivery tracking. Went back to the site to try to see if there was any information and it’s closed for that fundraiser."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Allison Hutton",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T16:34:39.000Z",
          "Titre": "Discount cannot be used",
          "Contenu": "LA carreta in Rustburg will not recognize the discount because it is digital....our main reason to purchase the card.   Manager said he didn't authorize the discount card"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rini",
          "Nb_Reviews": 2,
          "Date": "2023-11-19T07:19:10.000Z",
          "Titre": "Not a fan how it continues to ask…",
          "Contenu": "Not a fan how it continues to ask supporters for more money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Snicksms",
          "Nb_Reviews": 3,
          "Date": "2023-04-06T17:54:37.000Z",
          "Titre": "I gave this fund-raising program a “1”…",
          "Contenu": "I gave this fund-raising program a “1” rating because I received MULTIPLE texts/emails AFTER I ordered cookie dough. Those texts/emails asked me MULTIPLE times to purchase cookie dough and/or to donate.Because I had purchased cookies before I received those texts, it was very aggravating. I imagine your program was embarrassing for the cheerleaders and the cheer squad.I suspected these MULTIPLE requests  didn’t come from the cheer squad or the specific cheerleader, but instead came from a POORLY developed automatic fund-raising computer-generated program.  A good programmer should have been able to spot and correct this issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T16:07:38.000Z",
          "Titre": "Means of security not provided",
          "Contenu": "Although I did use the App, I was very hesitant to do so. I could not find any information as to what kind of security is used. All I could find was that it was safe to use.  You may get more use if you can provide the means and type of security being used to keep user information secure."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pamela Baker",
          "Nb_Reviews": 2,
          "Date": "2023-01-18T22:40:06.000Z",
          "Titre": "Molly Dolly Folly",
          "Contenu": "I transferred Molly Dolly to my husbands phone and at first it did fine.  But then it started acting up - it would not pull up the card it would just circle around.  So I deleted the app and tried to re-add it to the phone but now it is asking me for a fundraising code-so I cannot use it.  I have sent two messages to Molly Dolly to try and resolve it but have not received a response still!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carol",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T16:37:29.000Z",
          "Titre": "MINIMUM DONATION a Big Assumption",
          "Contenu": "I am really annoyed that the minimum donation is set by your app. $25 being the lowest donation is a high priced assumption for a youth baseball team."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sara",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T00:46:10.000Z",
          "Titre": "App issues",
          "Contenu": "I had the Money Dolly app before this fundraiser and it worked fine. After purchasing this time, the app will never open. I have removed it a few times and reinstalled it but still the same issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Debrah Clark",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T21:01:22.000Z",
          "Titre": "Mandatory Money Dolly",
          "Contenu": "During the parent meeting, Coaches made it mandatory for each players family to open the Money Dolly account.  A few days later, the Coaches made each player sign up the Money Dolly account also.  Now our family has 2 accounts. I never finished my account.  I did not write anything asking my contacts to support my son.  Your colleagues took the liberty to do that for me without my consent.  Your system also sent messages out asking for support without our consent. I do not like the system asking anyone on our behalf for school support, using my son as the reason.  It make me feel I am not able to support my family.  I have had two contacts ask me \"what's going on with Austin?\"   \"Is something wrong?'  I don't mind using the system for products to purchase as a fund raiser.  I do not like the system asking my family or friends for money to support my son in PHS football.  Its embarrassing and humiliating to me and my family.Many of our friends are retired and do not use social media for anything.  We don't either."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carmel Sayre",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T01:29:37.000Z",
          "Titre": "whether it was money dolly or the…",
          "Contenu": "whether it was money dolly or the school, it misrepresented student that wasn't even on the roster for the school, and so we donated , it was wrong"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "courtney m",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T02:12:19.000Z",
          "Titre": "I think it’s a scam that a $100…",
          "Contenu": "I think it’s a scam that a $100 donation was the same as a $30 cup order. It should have counted as more than one unit. Unless that is changed, I will not participate in this fundraiser again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bryson Pappas",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T16:25:43.000Z",
          "Titre": "When someone buys you should get a…",
          "Contenu": "When someone buys you should get a notification beep like the company used last year did last year every time someone bought we got a notification beep so you knew someone bought didn't have to go check to see like this year"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sheryl Fronek",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T04:59:44.000Z",
          "Titre": "Must live in area to use coupons",
          "Contenu": "I bought this thinking I could use anywhere in wisconsin, didn’t know coupons were only good in Madison area"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jessie Burton",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T21:49:02.000Z",
          "Titre": "Do not like this type platform for…",
          "Contenu": "Do not like this type platform for fundraising. Especially do not like platforms that in order to give a review must consent to having an account created."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "angela box",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T16:22:56.000Z",
          "Titre": "disappointing",
          "Contenu": "contacts inundated with messages and i was unable to make payments to multiple students, all went to one and could not be corrected"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Becky Maggard",
          "Nb_Reviews": 3,
          "Date": "2023-09-08T16:54:25.000Z",
          "Titre": "Exclusionary to the kids who need it most.",
          "Contenu": "I found the app confusing to use, and their tiered ranking system downright deplorable. Offering a team an ice cream party only open to the kids who sell more product and purposefully excluding team members who don't have the parent support structure to sell the product is hazing and bullying behavior. The kids who need community the most are left out of group bonding experiences... it makes me sick.  A product that can not be shipped further narrows the window of support a child can gather in the event extended family or friend networks reside more than 20 miles away. Making monetary contributions - which benefit the organization more than sales anyway - more expensive than purchasing a product (that most people can't purcahse anyway) felt very slimy. Additionally, if a fiscal contribution is made, it doesn't benefit the child as much as selling the product. The rep couldn't answer any questions about the app and did a poor job of creating enthusiasm or confidence in the product. The amount of profit contributed back to the organization was low for industry standard as well. In the future I will not participate in Money Dolley fundraisers even if it means my child is at a disadvantage in her sport."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Emily Milstead",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T18:20:46.000Z",
          "Titre": "I have never recieved the beef Jerry",
          "Contenu": "I have never recieved the beef Jerry. I tracked it to Veradale post office but it was forwarded to my winter home in Arizona. Post office said there wasn't enough postage to send it there."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cal",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T17:29:04.000Z",
          "Titre": "Maybe not the App itself but didn’t…",
          "Contenu": "Maybe not the App itself but didn’t appreciate that the minimum contribution was dictated to me at $35. Then even after I donated, the app asked me to support again?!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AR",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T17:25:37.000Z",
          "Titre": "Texting people I added at all hours of…",
          "Contenu": "Texting people I added at all hours of the day and night, randomly and without my initiation of a message. I had to take our contacts off. We will not use the app again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RobinsonRanch",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T16:34:27.000Z",
          "Titre": "Subpar Company - Not Worth It",
          "Contenu": "I didn’t like that I couldn’t see how my daughter was doing sales-wise in comparison to her teammates. We are a very competitive family and normally we keep track of how each individual is doing and make sure our child is ahead by pushing harder, going out and getting more sales. Since we couldn’t see the progress, we didn’t push hard at all. Also, offering prizes makes for great incentives!When my daughter was first registering for this fundraiser, the instructions said to add contacts that are people who love and support her, but not family. That’s the dumbest idea ever. Family is who supports kids the most! We later went ahead and added family and that's when she started having success.You really ought to come up with better food options to sell. In past experience, the jerky from fundraisers like these are very subpar. And since we have dietary restrictions, jerky is our only option to buy.I know my daughter had lots of people make monetary donations but it never changed her goal total. That needs to change! Monetary donations are even better than sales of a subpar product.I definitely wouldn’t recommend using this fundraising platform to anyone unless major changes are made first. Good try though!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lavonna Braswell",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T20:16:35.000Z",
          "Titre": "I never received my order of popcorn…",
          "Contenu": "I never received my order of popcorn that I placed in November of 2022! But I noticed my credit card was charged the very day I placed the order. Will not be ordering anything else in the future."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carol Easley",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T00:32:42.000Z",
          "Titre": "Email reminders to donors",
          "Contenu": "You continued to email people that had ready donated each week.  That was embarrassing and terrible.   Once someone donates, please take them OFF the email reminder list.  Thank you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Abigail Grancorvitz",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T17:48:46.000Z",
          "Titre": "No need to keep sending reminders once…",
          "Contenu": "No need to keep sending reminders once my purchase gas been made. Also seems like it's phishing link when it comes through."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anne Breeden",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T02:01:43.000Z",
          "Titre": "Never received coupon or any type of…",
          "Contenu": "Never received coupon or any type of confirmation, still have not.  No feedback or type of direction on how redeem.  Just NOTHING."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angela Ervin",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T21:30:53.000Z",
          "Titre": "It’s a shame we have to pay extra money…",
          "Contenu": "It’s a shame we have to pay extra money to be able to contribute to our school functions. This money is suppose to help the kids not some company 😥"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Heidi Szczepaniak",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T03:34:38.000Z",
          "Titre": "The app doesn’t work",
          "Contenu": "The app doesn’t work, I’ve tried using it on the Internet as well, and requires many additional steps of logging in and such, and is more a pain to try to use. Not Worth the hassle."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "E. Cred",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T16:15:32.000Z",
          "Titre": "We did not like that it sent multiple…",
          "Contenu": "We did not like that it sent multiple reminders to our family- even to the people who had already donated! It was embarrassing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amanda Kubin",
          "Nb_Reviews": 2,
          "Date": "2023-01-31T02:31:23.000Z",
          "Titre": "Hard to navigate",
          "Contenu": "Hard to navigate. Could never get actual fundraising screen to open on my end. Lack of options for fundraising, and too high priced."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Helen Ferrante",
          "Nb_Reviews": 2,
          "Date": "2023-08-30T01:36:48.000Z",
          "Titre": "Every time I tried to contribute  an…",
          "Contenu": "Every time I tried to contribute  an error message came up saying it could not load The pageI was unable to contribute on my phone,I had to do it on my son's phone"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T16:42:29.000Z",
          "Titre": "A $35 minimum is ridiculous",
          "Contenu": "A $35 minimum is ridiculous. If people want to donate $5 they should be able to. Every donation helps. Then adding a fee on top of the donation is sad. I do not like this fundraiser type and would not recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rad",
          "Nb_Reviews": 7,
          "Date": "2023-08-16T16:54:09.000Z",
          "Titre": "The money dolly app is glitchy",
          "Contenu": "The money dolly app is glitchy. It doesn't work consistently. Local vendors are always confused when you try to use the deals."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Crystal Naron",
          "Nb_Reviews": 2,
          "Date": "2023-01-29T04:14:50.000Z",
          "Titre": "We never received our items",
          "Contenu": "We never received our items. Several people that ordered from my son are asking about items. Who do we contact to see about receiving items??"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chrissy Tashie",
          "Nb_Reviews": 4,
          "Date": "2023-01-25T15:16:49.000Z",
          "Titre": "This is the biggest joke",
          "Contenu": "This is the biggest joke. The fact that y'all get access to the kids contacts and \"bot\" the former supporters is so disgusting. I hate this platform and think it's criminal. Y'all should all be ashamed"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Janella",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T02:27:44.000Z",
          "Titre": "Does not ship to recipient",
          "Contenu": "I received everyone’s order. They sent it to the school and it was picked up by the student, real inconvenient for those who ordered and live out of town. Now I have to ship the orders to them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sarah Blossick",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T13:21:06.000Z",
          "Titre": "I got charged for something I never…",
          "Contenu": "I got charged for something I never received why ask for someone’s address if you’re not going to send them the items"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "C Lee",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T17:19:17.000Z",
          "Titre": "After I donated I continued to receive…",
          "Contenu": "After I donated I continued to receive requests for donations? The person whose name I donated for never informed me of the donation?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jay neff",
          "Nb_Reviews": 2,
          "Date": "2023-01-18T00:31:14.000Z",
          "Titre": "I purchased it in sep or oct and…",
          "Contenu": "I purchased it in sep or oct and suddenly recently I looked to use it and what do you know, all the discounts had disappeared so yes I was not too pleased."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brittany",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T01:41:08.000Z",
          "Titre": "Difficult to use",
          "Contenu": "The money card has not worked at any of the restaurants so far. The owners appear to not know about the card or how to apply the discount without a QR code to scan."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frustrated",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T22:21:38.000Z",
          "Titre": "Physical cards were So much easier to…",
          "Contenu": "Physical cards were So much easier to sell… we sold 40 cards last year- this year only 13…. Very frustrating"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T15:37:57.000Z",
          "Titre": "Frustrating",
          "Contenu": "The cards are were pretty good, but large donations should count for more than one card. A $100 donation should count for 5 cards. It’s pretty crappy. Players had lots of money donated, but the only thing that mattered was how many cards they sold. Frustrating."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karlee GinkelHall",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T05:25:14.000Z",
          "Titre": "We sold a bunch of cards that people…",
          "Contenu": "We sold a bunch of cards that people weren't able to even download on their phones and use. It needs to be more user friendly for the older generation"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lee Hong",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T18:49:47.000Z",
          "Titre": "Scammers used my email.",
          "Contenu": "You shared my email with a certain Kayden Cherida.  It's not appreciated. I wanted to support. Now I won't."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Judy Riston",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T02:39:24.000Z",
          "Titre": "I haven’t been able to use it since…",
          "Contenu": "I haven’t been able to use it since August . It just shows a woman and never opens . There have been  many comments about this and you never fixed the problem !  I would never recommend this Fund Raiser"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeremy Satre",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T02:50:10.000Z",
          "Titre": "Paid for fundraiser card and never got…",
          "Contenu": "Paid for fundraiser card and never got it. No link, no email, no instructions. NOTHING"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alysia Downing",
          "Nb_Reviews": 2,
          "Date": "2023-02-03T03:28:08.000Z",
          "Titre": "Then I had to pay out of pocket to mail…",
          "Contenu": "Then I had to pay out of pocket to mail cookies or pay people and get stuck with their cookies they did not want anymore"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Doug Stankavich",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T19:50:54.000Z",
          "Titre": "Frankly it's just too expensive",
          "Contenu": "Frankly it's just too expensive.  The two products our girls were asked to sell were popcorn and beef jerky, both were $30.  There was also a donate $ option, but with predetermined denominations, starting at I think $35.  Our daughter was embarrassed to ask our friends and family for this type of commitment so close to Christmas.  While obviously, there's a few who have the disposable income and/or the heart for giving in support of the team, there are many others who do have the heart for giving, just not that much.  We need cheaper options, both in products and in donation only increments. She would have likely garnered many more donations and purchases with 5-10-15 dollar options."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SR",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T16:53:44.000Z",
          "Titre": "Disappointing",
          "Contenu": "If a site is collecting money, the donation amounts should not be pre-populated. The donor should be given an option of how much they feel comfortable giving. And the site should allow the additional fee to come out of the donation amount imstead of tacking on more money at checkout. I was disappointed with this fundraising platform."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Ward",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T20:46:14.000Z",
          "Titre": "The process itself was simple",
          "Contenu": "The process itself was simple. What I had a problem with was the $35 minimum donation. Really? Just skipped right over $20. If anyone else sends me this platform, I will NOT make a donation. That’s way too high for a minimum. Bunk."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paul Sanchez",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T22:12:59.000Z",
          "Titre": "The cost per donation made it very…",
          "Contenu": "The cost per donation made it very unappealing. Half our donors went direct to the school and knowing what I know now I will be doing the same in the future. Additionally, the level of spam/reminder texts were annoying. Should only have one reminder text just prior to campaign ending. Lastly, a thank you text on behalf of the person would be appropriate."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T17:06:50.000Z",
          "Titre": "Wish the school would host fundraisers themselves",
          "Contenu": "Your fees are ridiculous and based on the donation amount. Last app the school used was half the amount. The school would be better off hosting these fundraisers themselves instead of outsourcing. Also, when a person donates anonymously, it should remain anonymous. An email should not be sent to the child's parent stating who donated and how much they donated. At the very least, when a donor wants to be anonymous then the email should also say \"anonymous\"."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T01:23:43.000Z",
          "Titre": "Preset giving amounts Inhibit some from donating",
          "Contenu": "I really wanted to give something, and it was going to be a very small amount, and I thought a small amount is better than no amount but then I saw the minimum. I had pretty much decided that I was going to give the family money directly. For a very specific reason I did make a donation through the app but I doubt that I’ll do that again if it comes up. There are grandparents and friends that are on fixed incomes that will be able to give something but things or so stretched for so many people that it makes that giving the minimum too big a sacrifice. This wasn’t exactly the case for me, so that was not my reasoning for not giving. Instead, it was that I felt coerced into giving a particular amount."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Heather Calhoun",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T21:30:18.000Z",
          "Titre": "The additional fees attached to…",
          "Contenu": "The additional fees attached to people’s orders is completely unnecessary especially if they are providing a monetary donation. Also the excessive emails/texts to people whose numbers we’ve provided is embarrassing. Way too pushy and quite the turn off to those who haven’t donated yet but intend to. Also had multiple people tell me that they received emails/texts when their spouse had already donated."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Donna Dasch",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T23:43:47.000Z",
          "Titre": "Skipping It Next Time.  - I don't like that I couldn't chose an…",
          "Contenu": "I don't like that I couldn't chose an amount that I would want to contribute. There were preset amounts only. There an additional fee for using the service. I continued to receive spam texts from this event about donating after I already donated. I now have received spam texts every day from other companies immediately following this event. I don't give my cell phone out so seems to be a direct relation to MoneyDolly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Unhappy Auntie",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T20:39:35.000Z",
          "Titre": "Disappointed with the \"unit\" calculations",
          "Contenu": "I'm VERY disappointed on how goal \"units\" are calculated.   I am helping my nephew (along with others) to reach the set target goal of 25 units so donated more than $25.  After I hit the pay button I learned that no matter how much is donated only one unit credit is awarded.  (ex: each unit requires $25 donation if you donate $100 only one unit is awarded vs four)  Recommendation:  MoneyDolly add this to the donation page to make sure the kids get an accurate credit count"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Melissa H",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T03:19:24.000Z",
          "Titre": "I loved the idea but not the process",
          "Contenu": "I loved the idea behind the digital format but since the cards were limited to a small area we found it difficult to sell a digital card to strangers. We don’t have family in the area to sell to. Last year we had the physical card and my son was able to walk around on Halloween and sell everything he had on hand. This year he attempted the same thing and not a single person was interested since it wasn’t a physical card. Also the minimum requirement for a monetary donation was to high. We tried to get family from out of town to do donations but they ended up purchasing a card that they couldn’t use just to go with the cheaper option. Finally, when a person uses the digital format for to purchase a card or donation they are charged a fee. This turned away so many people because they wanted to do a simple $20 donation but was charged a fee to do so. As a small business owner I understand the price of service fees being passed onto the consumer but fundraisers should NEVER have a fee attached to them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Parker Girardier & Parent",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T16:06:44.000Z",
          "Titre": "The app was easy to use, but small issues",
          "Contenu": "The app was easy to use except when sending the messages there were 2 problems. One, people couldn't tell that the requests were coming from my Mom's phone & thought she was giving out staff numbers to me (student) which got her into trouble. Second when the repeated texts came through some customers were turned off by it & it caused them to not purchase because it was pushy due to the fact that I was already contacting them & didn't know that there were texts automatically going through."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Douglas Boulware",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T16:14:56.000Z",
          "Titre": "I think you charge entirely too much to…",
          "Contenu": "I think you charge entirely too much to process a credit card payment."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Johna Walker",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T16:11:47.000Z",
          "Titre": "Too difficult for our older family…",
          "Contenu": "Too difficult for our older family members to donate to the fundraiser.   It was a lot of juggling on our part to make their donations happen.  Our school lost money if family or friends couldn’t figure the technology out or simply didn’t want to register.   👎🏻"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shannyn Tirado",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T16:15:21.000Z",
          "Titre": "Online only option made it difficult to sell",
          "Contenu": "It was difficult to sell because you had to have people go online to buy it.  I wish that I could have sold them from a paper like we use to do things.  I like having the online option but I don't feel like it should be the only option.  I also didn't like that there were fees added on to the sale.  If a paper option was available would it avoid those fees?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "FRPS",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T16:51:47.000Z",
          "Titre": "it was too impersonal",
          "Contenu": "it was too impersonal. Large donations need a bit of a personal touch, not a robotic email with robotic responses. Each child should have to respond directly. My nephew never actually reached out to me himself and never said thank you until I advised him of my donation. it may seem to be asking alot of a 14 or 15 yr old, but that is how children can learn today. hiding behind robots is not a long term answer for personal requests of support. this is my opinion only, but i would not donate again unless the system was changed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Happy to Help",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T15:46:05.000Z",
          "Titre": "Too many text notifications",
          "Contenu": "Too many text notifications. Money was allocated to only one of my students, not both equally as I had intended to donate separately into their individual accounts. Very few choices of items to order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sarah Glassman",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T17:12:34.000Z",
          "Titre": "The process was a little annoying and…",
          "Contenu": "The process was a little annoying and also didn't appeal to some older neighbors who prefer having things in their hands vs. on their phones (a card vs an app, etc)"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Tidwell",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T16:08:32.000Z",
          "Titre": "Frustrated",
          "Contenu": "I understand the importance of fundraising, but I feel like money dolly doesn’t calculate units sold in regards to donations.  If a card cost 25 dollars, and a grandparent decides to just give a donation of 100.00, why does that count for 1 unit instead of 4.  If that is indeed the case, then explain that in the link so donors understand how credit is given."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Judy Mawyer",
          "Nb_Reviews": 2,
          "Date": "2023-08-27T06:28:28.000Z",
          "Titre": "From the old school!",
          "Contenu": "I am an older senior citizen that participated in this program. I am not computer savvy. Before they sold cards, which to me would have been preferred. My grandson could have sold more that way because it was more wanted than having to use a phone to access the discounts.I can understand that most people uses a debit card. But I come from a paper coupon generation."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nancy Prewitt",
          "Nb_Reviews": 4,
          "Date": "2023-10-05T03:26:59.000Z",
          "Titre": "I try to help support my grandson but…",
          "Contenu": "I try to help support my grandson but there needs to be just and option to donate money without having to buy the tickets.   I do not live in Allen I live almost an hour away and those tickets mean nothing to me.  But in order to help him I had to buy the tickets.    Make just a donation option would be helpful."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dawn Turner",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T16:21:20.000Z",
          "Titre": "We had older people try to buy items…",
          "Contenu": "We had older people try to buy items but if their credit card wasn't set up as saved in their device wallet app it wasn't letting them set up a card for payment. They decided it wasn't worth the effort to giving the platform. Also, there was no description of the items that you were buying - size, quantity, flavors, or ingredients. We had a hard time getting anyone to order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marjorie Newcomb",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T20:21:21.000Z",
          "Titre": "I now have received all my order.I give your organization 5 huge stars!!So satisfied! Thank you for everything.",
          "Contenu": "I haven't received my 2 different orders. Then I will be able to express my opinion. Thank you. Wish the school good luck.I give your organization 5 big stars!!!I have now received 3 bags of the caramel corn. I paid for 4 bags so I am short 1 bag. I trust you will make it right. No mention in the bag of 1 bag missing. Marjorie Newcomb"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DonnaTea",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T19:55:41.000Z",
          "Titre": "Too many texts",
          "Contenu": "The app texted potential supporters multiple times and then I would receive texts from family or friends stating their frustration with this app.  I won’t do this next year!!!  😡😡"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Erica M",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T16:12:46.000Z",
          "Titre": "Please give the option for supporters…",
          "Contenu": "Please give the option for supporters to choose how much they want to donate to a fundraiser.  Not giving supporters options deters fundraising opportunities."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T23:49:44.000Z",
          "Titre": "No Monetary Goal to Work Toward",
          "Contenu": "Not being able to see an actual financial goal or how much of the financial goal was raised was harmful as I had many people asking \"how much do we still need to raise\" and it was very complicated trying to explain the \"units approach\". Several opted not to donate as a result. Also, not being able to give unless you gave $35 minimum was not helpful. I understand that to qualify for the drawing, but people should at least be able to give $10 and feel valued if that's all they can give."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Trying to support High School",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T17:35:21.000Z",
          "Titre": "Some cards just not worth it.",
          "Contenu": "I purchased a card from the high school football team and there were a variety of food options, gas stations, oil changes, UPS, etc.  Then I purchased a card from the high school swim team & that card has three choices. Two are food (one which is pizza) & one coffee shop.  I am disappointed the football card has over 20 different places to use but for the same price the swim team only offers three choices. I don't know if in the future I would support the swim team card due to the lack of options."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Norma Mitchell",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T19:02:25.000Z",
          "Titre": "I kept getting the same notice about…",
          "Contenu": "I kept getting the same notice about the child needing my help to purchase for band even after I had already purchased the item   It sounded like I didn’t order anything"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Elizabeth Zettlemoyer",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T18:58:24.000Z",
          "Titre": "There is no personal interaction",
          "Contenu": "There is no personal interaction. Also, we dislike the continuous auto-generated texts your company sends out begging people to buy. It makes it seem like the players are being rude."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CC",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T00:28:42.000Z",
          "Titre": "I think it was easy to use",
          "Contenu": "I think it was easy to use. However, the downside is is that when your people donated already you still continue to send random messages asking for donations, thats rude, to keep asking for a donation after someone already donated . Also, you send random messages asking for donations on days like Mother’s Day For instance. Nobody wants to be bothered with a Fundraiser on Mother’s Day."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephanie Donato",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T16:33:53.000Z",
          "Titre": "Our friends received way too many text…",
          "Contenu": "Our friends received way too many text / email reminders. They were annoyed. Even the ones who already donated received multiple reminders."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Grandparent",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T13:47:01.000Z",
          "Titre": "Very disappointed with this fund…",
          "Contenu": "Very disappointed with this fund raiser!  They kept hounding me for a donation even after I made one.  I had to check with my relative to make sure this wasn't a new / different campaign.  I asked MoneyDolly to stop texting me and they offered no way for me to opt out.  I encourage charities to realize how much they may alienate their membership by using this type of approach.  I think I got around six texts even after I donated.Also, I had no way to easily find out how much my granddaughter had raised.  That should be basic.Edit:  I DID use the \"STOP\" feature on my phone but that did not stop the texts from arriving.  I DID contact their support but got no response."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Wendy Woodward",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T17:00:05.000Z",
          "Titre": "Way too guilt-inducing.",
          "Contenu": "I was VERY unhappy with the fact that I was inundated with way too many choices and guilt-inducing 'choices' and 'supporter levels' before I could just buy the product that I promised my student I'd buy.Make it simple.  Make it quick. Drop the guilt. I dread using this program again.The only cool thing was the ability to send a message to the team. This warrented 2 stars instead of 1.Referencing MoneyDolly's reply of 8/29:  I am not talking about the messaging.  I am talking about the webpages you have to scroll through to get to the product you are buying, that have a zillion expensive levels before you reach your paltry overpriced product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lowell",
          "Nb_Reviews": 3,
          "Date": "2023-09-26T16:25:35.000Z",
          "Titre": "App needs improvement",
          "Contenu": "It was slightly difficult to set up but I managed.  I couldn't find it, but you should have the ability to to put multiple kids on the same phone number.  I have 4 kids that were selling the card but we only have two phone numbers, so 2 kids were out of luck."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "AYDRUS",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T16:35:27.000Z",
          "Titre": "Catch twenty two!",
          "Contenu": "You guys didn't say their will be a processing charge for every unit purchased for the amount of $1.50 each. For example I bought 4 units it cost me 6$. It doesn't show up until check out.. That's not right for you'll to get rich of the Generous donation for these kids to enjoying play the sports."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Maria Woodard",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T03:13:43.000Z",
          "Titre": "Not worth the hassel",
          "Contenu": "The taste of the cookies were mediocre. It would be more beneficial for the company to ship the cookies instead of me having to collect the cookies once they came in and then distribute and ship myself. I spent more money shipping the cookies than what they cost to order. Also the option to donate wasn’t counted equally with what it would be if the person purchased cookies. If our team chose this fundraiser again, I would just make a flat donation instead of purchasing any cookies. It was more of a burden than other fundraisers have been in the past for our family and less of a financial gain than others would have offered."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cassandra Ferguson",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T08:21:50.000Z",
          "Titre": "Alot of vendors were placed in  wrong…",
          "Contenu": "Alot of vendors were placed in  wrong categories and incorrect  descriptions of what we receive with coupon. Also some people try to argue the cupon"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Kendall Wicks",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T19:35:23.000Z",
          "Titre": "Our support person was rarely available…",
          "Contenu": "Our support person was rarely available and slow to respond to inquiries, if at all.  There was a vendor that wouldn't cooperate and upset a customer.  And our app was shut down early and had to be reset; this meant for a time our customers were unable to use."
        },
        {
          "Note": 2,
          "Lieu": "PR",
          "Pseudo": "Spoken",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T16:37:39.000Z",
          "Titre": "Minimum too high",
          "Contenu": "The platform is really easy to use, however, the $35 minimum is a bit much especially with a processing fee. There should be an option to enter the amount you want to pay. The minimum may have been set by the school, but the processing fee is still a bit much. I think more could have been raised if there was a lower minimum."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shannon Bryant",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T17:00:38.000Z",
          "Titre": "Accounting for donations",
          "Contenu": "I bought a coupon book and gave a donation in the amount of 4 coupon books. This only counted as 1 unit and was equal to 5 units. Also, higher donations should count as more than one unit.  Sales tax should not be paid on donations."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jana Cruse",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T18:38:16.000Z",
          "Titre": "i would rather write a check or donate…",
          "Contenu": "i would rather write a check or donate cash rather than acquired a credit card processing fee but that was not an option. credit card fees should not be passed off to the donation"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robin Lyle",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T02:12:39.000Z",
          "Titre": "You have to be able to transfer coupons…",
          "Contenu": "You have to be able to transfer coupons some how.In response to Money Dolly’s response to my review…. I suggested that you find a way to transfer “coupons” not cards.  I understand you can transfer the whole “card” or book.  I’m suggesting you be able to transfer individual coupons - not the whole book.  I have 5 ppl in my family that would use individual coupons differently but you’re not able to transfer the individual coupon. It was a fundraiser so I’m happy that I participated, but it’s not user friendly to be able to redeem for the whole family."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alexis",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T16:35:35.000Z",
          "Titre": "Supporters options",
          "Contenu": "I feel there should be a better system for donations. Supporters should be able to have option of how much they are willing to support. A minimum of $35 was a lot and then tax was added on. Also there was not much of a variety with the popcorn. My supporters was looking for different sizes and options."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "A mom",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T22:44:50.000Z",
          "Titre": "Suggestions for improvement",
          "Contenu": "The amount of contribution should be less than the minimum of $35. We lost sponsors because of that. Also, allow the customers to decide if they want to pay the service fee or take it out of the profits- even church’s do this."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeanne",
          "Nb_Reviews": 2,
          "Date": "2023-07-30T05:42:10.000Z",
          "Titre": "Your website is not user friendly,,I…",
          "Contenu": "Your website is not user friendly,,I was unable to donate online and had to give it directly to the staff. Have someone, like a grandparent of the fundraiser try to access and donate; someone who is able to access everything they need,,,and see what happens. I just wanted to donate, not put people on my list,,"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Disappointed grandma",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T16:28:42.000Z",
          "Titre": "Too difficult for many grandparents to…",
          "Contenu": "Too difficult for many grandparents to use whereby causing the team to miss out on hundreds of $$$.  Personally we don’t use charge cards."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GR",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T00:32:13.000Z",
          "Titre": "I prefer an actual card I can carry on…",
          "Contenu": "I prefer an actual card I can carry on me for 2 reasons. First, it is a reminder to use it. With all the business' listed it's a constant reminder to go there and use it. Secondly, as an advertiser on this program we have seen a sharp decline in people using the discount. It's not increasing more customers to shop at my store."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jesus Toledo",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T01:43:21.000Z",
          "Titre": "More negative feedback than positive",
          "Contenu": "Taking 20% of our donations is ridiculous. Luckily I only had 2 ppl do it because they were never given our team Venmo so they can donate and 100% of it gets to the team. $30 for 3 small bags of jerkey is a ripoff too. It’s super hard to sell. The only positive things are how it’s easy to send out the link and that we don’t have to worry about handling payment or delivering the product. Tracking for delivery should be available as soon as money is paid. Not when fundraiser closes. That kept 3 of my supporters from getting their Christmas gift jerkey in time for Christmas."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joey G",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T19:24:33.000Z",
          "Titre": "When listing the places that you get…",
          "Contenu": "When listing the places that you get discounts, it did not say specific locations until after you paid. They are mostly for specific locations in Princeton. I don’t live in Princeton."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T16:45:52.000Z",
          "Titre": "No Fees Please",
          "Contenu": "The process was easy enough. The process fees were sad. Trying to raise money for a group of children to continue to participate in sports should NOT carry fees."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brandy Brown",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T14:40:58.000Z",
          "Titre": "I bought a card that never showed up in…",
          "Contenu": "I bought a card that never showed up in the app. Purchased a second card because he needed one more to make 20 and it did work. People were frustrated over the reminder texts that kept being pushed through. It makes no sense to have a minimum donation of $35 when the cards only cost $25. Out of town family and friends do not want to buy a card and some didn’t give anything because of the limit"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T00:17:06.000Z",
          "Titre": "I much prefer the physical cards",
          "Contenu": "I much prefer the physical cards. We only sold a fraction of what we sold last year because people didn't want to get the app."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shannon Cook",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T16:33:21.000Z",
          "Titre": "Minimum required donation - thumbs down",
          "Contenu": "Any donation amount should be acceptable.  I was very disappointed in the minimum required amount.  It was more than I wanted to donate."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Emma",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T14:18:53.000Z",
          "Titre": "Too many emails",
          "Contenu": "Payment part was fine. But I got way too many emails about the fundraiser, even after I had donated. Absolutely ridiculous. If the emails weren’t from money dolly , I apologize for the low rating."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mel R",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T17:36:13.000Z",
          "Titre": "Update shipping methods",
          "Contenu": "Ordering was easy, however, Molly Dolly should add a link that allows customers to where they’d like to have orders shipped to. My order was shipped to an address I no longer reside."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michelle A",
          "Nb_Reviews": 2,
          "Date": "2023-10-21T12:21:32.000Z",
          "Titre": "No choice in $ amount",
          "Contenu": "I lost 3 donors because they were not able to choose their $ amount . I do believe that by forcing people to donate at least $35 is just greedy."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dale Fair",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T15:51:15.000Z",
          "Titre": "You did not show me how to benefit from…",
          "Contenu": "You did not show me how to benefit from my donation. I do not know what discounts are available and do not know where to get the app. Confusing that you did not let me know what businesses are available."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lynnsei Leach",
          "Nb_Reviews": 2,
          "Date": "2023-03-15T18:07:59.000Z",
          "Titre": "It is hard to use, not everything received",
          "Contenu": "It is hard to use. I thought I oder three bags of popcorn because everything was in threes and we only received one bag of popcorn. I am not sure but thought we ordered some beef jerky too. Either way our order was not complete and no information was received with food to call and try to make it right."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T03:58:14.000Z",
          "Titre": "Getting the app to work is hit or miss",
          "Contenu": "Getting the app to work is hit or miss. Have not been able to gey access to my fundraiser card on several occasions. Will likely skip purchasing another card"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Laura Brown",
          "Nb_Reviews": 2,
          "Date": "2023-01-30T18:10:18.000Z",
          "Titre": "Never ending loop",
          "Contenu": "I got into a never ending loop of it asking for my card number, me putting it in, it saying something was missing, sending me back to the beginning, etc. I ultimately had to do it on my computer as opposed to my phone. Very time consuming and frustrating."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Holly Watt",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T11:56:49.000Z",
          "Titre": "The fundraiser was extended by 5 days then ended 1 day early",
          "Contenu": "The fundraiser was extended by 5 days.  Then on the last day there was 13 hrs left....for some reason it ended early!!!!!  We had at least 5 more cards to enter - people had paid us but we hadn't had time to do it yet.    Not sure why it was extended 5 days just to end it early with no warning!!!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William Eleftheriou",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T06:40:46.000Z",
          "Titre": "The % money dolly charges is absurd",
          "Contenu": "The % money dolly charges is absurd. To have such an unfriendly user platform, to charge so much is wrong. I would rather donate in person, to avoid that much paid to a sub par checkout ap. Almost didn’t donate having to go through them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T12:35:01.000Z",
          "Titre": "Send items purchased sooner",
          "Contenu": "Send items purchased sooner. It's been a couple weeks and still haven't heard any news of my item shipping"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kevin Ligon",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T04:17:52.000Z",
          "Titre": "Did not go as well as I had hoped President",
          "Contenu": "Did not go as well as I had hoped.  Players were having difficulty registering and supporters thought event was a scam because my name was used with a MoneyDolly  number"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Erin Townsend",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T02:32:31.000Z",
          "Titre": "It was easy to donate",
          "Contenu": "It was easy to donate. But .... Money Dolly could up their game by sending donors email or text notification to use the item purchased. Provide more than a money service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Danielle Shea",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T16:03:27.000Z",
          "Titre": "People were not a fan of this…",
          "Contenu": "People were not a fan of this fundraiser. It was very complicated for me to set up and I had no idea what was sent to who. People did not like that you had to choose set increments to donate to, and the fact that there is a few donate is absurd. Once I understood how to use the app it was easy to manage."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Roy Walters",
          "Nb_Reviews": 2,
          "Date": "2023-08-31T17:29:46.000Z",
          "Titre": "I donated $250 and instead of a THANK…",
          "Contenu": "I donated $250 and instead of a THANK YOU, I continued to get inundated with text messages asking for more money!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Justin Naron",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T02:03:42.000Z",
          "Titre": "The platform and concept is great",
          "Contenu": "The platform and concept is great. The variety of items to purchase is very limited. It’s been two months or better and still haven’t received the items we ordered."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T22:52:34.000Z",
          "Titre": "Making those who donate responsible for…",
          "Contenu": "Making those who donate responsible for credit card fees is disappointing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Esteban",
          "Nb_Reviews": 3,
          "Date": "2023-04-27T16:43:18.000Z",
          "Titre": "I have not received my product and i…",
          "Contenu": "I have not received my product and i have not gotten any updates on the shipping either. I paid for the item weeks ago and still haven’t received anything or any updates"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carolyn Ramler",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T00:01:34.000Z",
          "Titre": "I was not able to download the app for…",
          "Contenu": "I was not able to download the app for use and did not find the vendors particularly ones I would use. Looked at this as just a donation to Midlothian HS football team."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T19:33:03.000Z",
          "Titre": "I had difficulty redeeming my Festival…",
          "Contenu": "I had difficulty redeeming my Festival Foods coupon off the Festival Food ca4d that was purchased for thw donation They never heard of it at Festival Foods I went to."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Parker Clift",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T22:54:40.000Z",
          "Titre": "I think it would be better if the app…",
          "Contenu": "I think it would be better if the app didn’t send out messages by itself. I had people who got 3 messages from the app that I didn’t send"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "valpo supporter",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T17:57:28.000Z",
          "Titre": "train kids better!",
          "Contenu": "student did little to introduce/explain what he was selling,(without prompting from me) didn't seem that familiar with product, and couldn't answer questions about how to use the payment system."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kimberly Johnston",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T15:45:39.000Z",
          "Titre": "Having to update an app just to use a…",
          "Contenu": "Having to update an app just to use a coupon. Didn't use a coupon because it would take too long to update app first. A coupon should be straight forward to use."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "None",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T16:09:47.000Z",
          "Titre": "It loses the personal touch and the…",
          "Contenu": "It loses the personal touch and the automated text messages are obnoxious."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jessica Hebert",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T16:27:06.000Z",
          "Titre": "The kids was not clearly told what to…",
          "Contenu": "The kids was not clearly told what to do and how many units they needed to get to get a jacket. Some kids said  that they needed 20 units. Some kids said they needed 25. So us parents was not sure."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryan Munchgesang",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T01:35:50.000Z",
          "Titre": "My son sold 16 cards and did not…",
          "Contenu": "My son sold 16 cards and did not receive all the prizes that was due."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Terri Klein",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T19:05:27.000Z",
          "Titre": "Download trouble",
          "Contenu": "The app never did download correctly on my phone so I never have used any of the deals. Big disappointment."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mr. AHL",
          "Nb_Reviews": 8,
          "Date": "2023-01-18T05:23:57.000Z",
          "Titre": "The purchase choices were EXTREMELY…",
          "Contenu": "The purchase choices were EXTREMELY limited - nothing i really liked. And... it took 7 weeks to arrive!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Peter Oconnor",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T16:41:45.000Z",
          "Titre": "Too complicated to check out",
          "Contenu": "Too complicated to check out. I wanted to use PayPal and ended up have to enter my CC account."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KG",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T20:31:23.000Z",
          "Titre": "Could be better",
          "Contenu": "I didn't like the repeat emails which happened even after you had donated."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sheila Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T17:04:46.000Z",
          "Titre": "not enough good choices that people…",
          "Contenu": "not enough good choices that people really want.. cups and popcorn, pretzels and beef jerky is not it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ashley Williams",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T01:07:12.000Z",
          "Titre": "Hated that the convince fee was per…",
          "Contenu": "Hated that the convince fee was per item and not per transaction. The charges really racked up."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T01:30:43.000Z",
          "Titre": "I’m still waiting for half of my order…",
          "Contenu": "I’m still waiting for half of my order I placed back in November."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "G.H.",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T06:16:01.000Z",
          "Titre": "Expensive cookie dough",
          "Contenu": "Expensive cookie dough. Cookies do not taste good."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Perry Alexander",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T05:30:28.000Z",
          "Titre": "Overly complicated and out to gouge…",
          "Contenu": "Overly complicated and out to gouge every penny possible."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Karen Pless",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T04:22:31.000Z",
          "Titre": "I never received my wreath",
          "Contenu": "I never received my wreath.  Money seemed to go through by t not sure if it was received by the school."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dean Kilburg",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T21:01:08.000Z",
          "Titre": "After you give once….stop sending…",
          "Contenu": "After you give once….stop sending emails asking for more. One ask is enough!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marcia",
          "Nb_Reviews": 2,
          "Date": "2023-05-17T17:43:24.000Z",
          "Titre": "No thank you.",
          "Contenu": "Prefer not to comment. Changed my mind. No use contacting me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Peter Brenner",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T20:16:12.000Z",
          "Titre": "Did not receive a receipt"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Neighbor",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T17:43:12.000Z",
          "Titre": "Very impersonal and presumptuous",
          "Contenu": "Very impersonal and presumptuous.  I'm being asked to contribute, to donate, yet with little personal attachment"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T21:22:50.000Z",
          "Titre": "Limited",
          "Contenu": "Not personal. Too few options."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Janice Pumphrey",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T16:22:25.000Z",
          "Titre": "Took three times to complete order"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gregory Brown",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T21:56:44.000Z",
          "Titre": "I have never received my purchases"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T01:42:20.000Z",
          "Titre": "extra fee online is too much",
          "Contenu": "The fee online is too much extra cost"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 2,
          "Date": "2023-08-18T17:30:24.000Z",
          "Titre": "I resent your fees",
          "Contenu": "I resent your fees. Why must I pay money to donate?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Evelyn Olloway",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T19:00:14.000Z",
          "Titre": "The amount of notifications received…",
          "Contenu": "The amount of notifications received made me and my participants uncomfortable, thinking possible scammers"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TamZ",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T02:22:55.000Z",
          "Titre": "I am trying to use it right now and it…",
          "Contenu": "I am trying to use it right now and it won't load."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "kathie erceg",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T01:03:04.000Z",
          "Titre": "Not very user friendly"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melissa Romo",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:56:18.000Z",
          "Titre": "The process was easy",
          "Contenu": "The process was easy. I appreciated that. I didn't appreciate the service charge. I didn't like that people had to donate a minimum amount. They should be able to donate any amount that is affordable for them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Derrick Green",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T17:26:24.000Z",
          "Titre": "Delivery of product",
          "Contenu": "Your time line for product delivery and notification is very slow.  Why can't you go ahead and ship the product when you receive payment? Why do we have to wait almost 30 days to receive it?  When i purchase from Amazon, I receive my order within a few days. If its about money, maybe you should give the option for people to pay more for postage so they can get their order within a week and not 30 days or more. I usually never buy from a company that says it will be 30 days before they ship when I've already paid my money"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shouse",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T17:05:58.000Z",
          "Titre": "Too many texts",
          "Contenu": "My criticism is the amount of follow-up texts it sends “on behalf” of the person. I understand it’s used as a reminder, but in financially trying times it comes as baggage. People will donate or they won’t, but there’s no need to reach out to them after the initial ask. If the texts continue after the fundraiser ends for advertisement purposes, I will definitely not use the app again in the future."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew W",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T16:25:26.000Z",
          "Titre": "Don't pre-select donor amounts",
          "Contenu": "I did not like the fact that you didn't allow ME to select the amount I wanted to give. You predetermined the amounts one could give---starting with a minimum of $35.You would get a better response if you allowed the donor to select what he or she CHOOSES  to give."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ml",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T19:53:45.000Z",
          "Titre": "The app was great but given they should…",
          "Contenu": "The app was great but given they should have gotten one one unit per 25 dollars they app should reflect  that.  That way everyone will know exactly where they stand and it could create more money donated.  For example if a child had 30 units and another child had 30 units one of them may have pushed harder to get 31 to win over all units.  Since the app only gave one unit for a hundred dollars you never know where you stand against others.  You can figure out how many total units you have if you added them based on your sales but not how many others have so you don’t know if you’re winning even if it says you’re winning."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Xylasha Lucas",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T04:21:54.000Z",
          "Titre": "When people order more than one thing…",
          "Contenu": "When people order more than one thing it only counts as one i think it should count as two same thing with the donations"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "cevans",
          "Nb_Reviews": 4,
          "Date": "2023-10-27T16:33:39.000Z",
          "Titre": "Don't like the Fee",
          "Contenu": "I would rather donate directly to the organization that is raising money for.  I don't like the 'fee' that was added.  I do realize that this organization needs funds to be a business.  It was pretty easy to make the donation.  But, there is so much FRUAD in the world today, that I shy away from things I am not familiar with.  When I first saw this email in my Inbox, my first thought was it was SPAM.  I do support other businesses and charities that don't charge a fee and 100% still goes to the charity."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Olga Barragan",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T23:33:09.000Z",
          "Titre": "My message was not posted on the…",
          "Contenu": "My message was not posted on the donation wall,  was it because I wrote it in spanish? I didn't write anything offensive. That is why I rate my experience with 3 stars. Other than that it was very user friendly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ginni Carlson",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T17:51:48.000Z",
          "Titre": "Easy to fundraise, but be aware",
          "Contenu": "The app os easy to navigate both for the people raising and the people supporting. However, beware- if you add your contacts to your circle, and send one text, the app will continue to send texts woth out you physically sending another, I had more than one supporter complain about this and we lost supporters because of it. It might be best to text people on your own and follow up, not through the app. Other than that, this was a fantastic amd easy fundraiser"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PSL",
          "Nb_Reviews": 3,
          "Date": "2023-11-04T16:25:18.000Z",
          "Titre": "Raising Funds",
          "Contenu": "I like being able to help kids raise funds for their school or project. I disliked that I couldn't give a lower amount than $25, so I ended up getting the popcorn for $10 and I really just wanted to give $10. So I would suggest a lower money value as an option."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CHARLOTTE",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T16:17:40.000Z",
          "Titre": "Personalize the fund raising witu a photograph of the student …",
          "Contenu": "Taking the effort of one on one fund raising by the student seems like an easy way out. My loved one who is fund raising didn’t seem involved at all. At least your company could encourage the student to provide a photograph to personalize the machine operated solicitation !"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tamara Olson",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T15:58:39.000Z",
          "Titre": "Good tracking; bad fees",
          "Contenu": "I liked the ability to see how well my son was doing with his goal, but we received a lot of negative feedback and even some people didn’t want to donate when they heard how steep the service fees were. The coupons on the coupon card could be better targeted to businesses throughout the area the school zone covers versus concentrated in the northern part of the county. This is why I chose to donate versus buying cards."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ebb",
          "Nb_Reviews": 3,
          "Date": "2023-08-20T08:23:19.000Z",
          "Titre": "Much to learn, in my opinion",
          "Contenu": "Your site was easy to use, but I very much disliked the follow-up requests for MORE money. I made a generous donation, yet your company makes the school look bad by continuing to ask for more. I’m sure it worked for you, but it is BAD donation-site practice. I would never recommend your company because of this low standard non-Southern practice."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "VL",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T21:07:21.000Z",
          "Titre": "I would have preferred a dollar goal…",
          "Contenu": "I would have preferred a dollar goal instead of a unit goal. We don’t like to ask friends to donate to our children’s activities and, instead, give the entire amount from our nuclear family. Because of the unit goal, we had to break up our donations into several smaller donations.  You made more money this way, but it cost us multiple service fees."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amanda Walker",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T16:25:10.000Z",
          "Titre": "A few things..",
          "Contenu": "Would suggest a wider range of product options and colors. Also suggest allowing a make your own donation amount, 35$ -$50 as the lowest offerings can be hard for some, even as a one time donation. Our fundraiser was for highschool, being able to take 10$ 20$ donations mightve made an impact within the players peer groups. Including the ability to create and access a single account across different phones would also be helpful - my daughter ended up with 2 accounts during her fundraiser that we could not get combined for accurate rankings. **Please please please be transparent or make a large special note,that your system auto texts anyone added to the circle, we had no idea and had many people wondering why we kept sending them prompts over and over."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "O",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T17:23:01.000Z",
          "Titre": "Easy experience, but the texting was over the top",
          "Contenu": "Easy experience, but very disappointed with how many texts I would get bombarded with about this raise. There needs to be a system where, once you've donated, the texts stop. In a world where we are constantly solicited, it is very annoying. I would happily donate again, but I dont need reminders to donate after I already have."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christine Foster",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T17:42:24.000Z",
          "Titre": "Not everyone can afford your price…",
          "Contenu": "Not everyone can afford your price point. I have eight grandchildren to try and support with fundraising. We should be able to give what we can instead of having to consider not giving anything."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "G N",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T02:52:58.000Z",
          "Titre": "Kinda fishy",
          "Contenu": "I liked how everything was automated and you could “compete” against your teammates. I hated the way they would automatically send messages to people in your contact list “via your team number” I had no idea this was happening and I felt as though I had no control."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sophie Oakes",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T17:28:45.000Z",
          "Titre": "I liked the leaderboard and the…",
          "Contenu": "I liked the leaderboard and the rankings but I wish it wasn’t the average units, but instead it was just what team had sold the most units in all. I also didn’t like that the app sent out texts for me because some of my contacts got very annoyed with that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Monica Bonasera",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T16:12:17.000Z",
          "Titre": "Needs work",
          "Contenu": "I love that my daughter was able to add me as a helper so that we could help push her fundraiser. I don’t like that through out the week that we used the app anyone we sent the link to then continued to get messages for the duration of the fundraiser nagging them to purchase and sent my daughter message over and over again. We also had issues with the fact that if they did not have an apple phone we had to find a new way to send the link as they were not receiving it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T17:20:55.000Z",
          "Titre": "A bad fundraiser",
          "Contenu": "I very much disliked that there was a $35 minimum to donate PLUS the credit card fee if you don’t want to purchase either of the 2 undesirable choices. I almost didn’t participate in this fundraiser. Decided to do it once but will never again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cd",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T03:44:58.000Z",
          "Titre": "I don't know if this is a comment for…",
          "Contenu": "I don't know if this is a comment for Money Dolly or the high school but I didn't like the fact that the $$ donation is more than if you actually bought a product. I also didn't like the fact that if you didn't donate when you 1st got the message you got additional messages until you donated. Please only send out 1 notice. If people can't donate you shouldn't pressure them into donating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jennifer Iverson",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T01:23:14.000Z",
          "Titre": "Need something physical or concrete",
          "Contenu": "It's hard to sell something people can't see or touch. It would be easier if there was a pamphlet, a handout, or a physical card. Especially for older people who aren't as tech savvy or for people who are in a hurry. It's also difficult to scan a QR code when you're already on your phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sonya",
          "Nb_Reviews": 2,
          "Date": "2023-08-05T19:23:58.000Z",
          "Titre": "Says time but not really",
          "Contenu": "When trying to make one last donation it wouldn't let me although it said it had 2 hours 18 minutes until the fundraiser ended that was very frustrating and disappointing because the donor sent it to me to donate after she made several attempts. It never got donated"
        },
        {
          "Note": 3,
          "Lieu": "ZM",
          "Pseudo": "Julia",
          "Nb_Reviews": 5,
          "Date": "2023-09-12T16:10:24.000Z",
          "Titre": "More practical products, please.",
          "Contenu": "I supported because it’s my granddaughter.  But I’d really like to see some different (and more practical) products for sale.  Cookie dough and popcorn are not my thing. Maybe candles?  Lightbulbs?  Wooden spoons?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T16:22:41.000Z",
          "Titre": "Dissatisfied",
          "Contenu": "I do not feel that only digital cards should be available.  Many sales were list due to people not willing to deal with digital. Also the fees that were tacked onto the sale was not liked by many. When looking at the deals there are many not offered on our immediate location. I would be less likely to support this fundraiser next year."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "NP",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T16:32:36.000Z",
          "Titre": "Wouldn't except some of the donations that people wanted to give!",
          "Contenu": "I had people that wanted to donate, $15 and $10 so they input that in the other amount and it would not allow them to donate.  It said that you must donate a minimum of $20.00.  In my opinion, if someone wants to donate, it shouldn't matter the amount they want to give, at this time, every dollar counts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Naomi McKelvey",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T02:53:34.000Z",
          "Titre": "The app was easy to use but…",
          "Contenu": "The app was easy to use, which I loved.  Unfortunately, the content (coupons) for the card that my daughter was selling was very limited.  Many of our friends and family had bought CMR or Bison cards from fall athletes and already had access to the other cards available through card connection.  It was tough to sell another $15 card that only added a couple of coupons.  This was a challenge for her last year too for the same reason. To improve sales, it would help to have a few more coupons offered on the swim team card.  Thank you for asking for feedback!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BT",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T03:59:34.000Z",
          "Titre": "Format of the app is poor",
          "Contenu": "It is good that you are trying to offer more with the app compared to the physical card. But the extra is largely undermined by the poor format of the app. Either the offers should be sorted alphabetically by business, or there should be a search option. Just listing dozens of randomly thrown together. Businesses is really not very helpful. The benefit of being able to add more businesses during the duration of the card is also undermined by the fact that nobody is going to know because of the inability to find anything. These are fairly straightforward fix it so hopefully you will do that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amy P.",
          "Nb_Reviews": 2,
          "Date": "2023-08-25T19:54:44.000Z",
          "Titre": "I did not like that there was a set…",
          "Contenu": "I did not like that there was a set minimum donation or the reminder texts. It made a few relatives feel pressured to donate and those that wanted to help but don’t have a lot of extra money, the minimum donation of $35 was hard to swing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TC",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T16:18:30.000Z",
          "Titre": "Usability",
          "Contenu": "The concept of helping our school team is great and the app works well. I was a little disappointed that the first time I tried to use the discount, the employees didn't know how to do it and told me I had to come back to do it when a specific manager was in. I would probably just give a straight up donation next time as this is probably more trouble than its worth. You may want to work with your vendors on redemption processes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Naomi",
          "Nb_Reviews": 2,
          "Date": "2023-06-29T18:58:17.000Z",
          "Titre": "My only complaint would be that you couldn't get donations less than $35",
          "Contenu": "My only complaint would be that, with friends and family out of town that couldn't use the discount food card, someone couldn't donate less than a monetary amount $35.  My daughter had a handful of people that would have been willing to donate $5 or $10 but couldn't afford $35."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gary Troyer",
          "Nb_Reviews": 3,
          "Date": "2023-08-25T17:56:22.000Z",
          "Titre": "How about “other” for donation dollars…",
          "Contenu": "How about “other” for donation dollars not all senior citizens can afford your minimum amount , we feel it’s kinda ballsy for you to set minimum at $35.00"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lela",
          "Nb_Reviews": 2,
          "Date": "2023-08-20T14:55:55.000Z",
          "Titre": "Convenient",
          "Contenu": "This is a very convenient way to raise funds but would prefer to just do a straight donation to organization and not pay fees.  It would also be great if you would add a paypal option.  I prefer not to give out my credit card information."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T16:53:49.000Z",
          "Titre": "Remove Minimum Donation Amount",
          "Contenu": "I did not like that there was a minimum amount if I simply wanted to make a donation.  I bought a card from my daughter but wanted to donate $10 to two of her friends as well but was not able to as the minimum donation amount was $25 and I did not want to spend an additional $50."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "usandk",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T22:52:05.000Z",
          "Titre": "Bad minimum donation requirement",
          "Contenu": "I didn't care for the minimum donation being a fixed amount of $35.  I also would have preferred being able to access the account as a helper without having to load an app.  We also have older family members who do not have a smartphone so it made their ordering more difficult."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melodie Moyer",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T16:48:27.000Z",
          "Titre": "I don’t think that it should be counted…",
          "Contenu": "I don’t think that it should be counted by supporters but on how much they bought/donated. The fact that someone could donate $200 would count the same as someone who bought a box of cookies is not right."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sheri Kennedy",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T16:39:28.000Z",
          "Titre": "I enjoy supporting my daughter's…",
          "Contenu": "I enjoy supporting my daughter's volleyball team for Hamilton High School.  The assortment of cookie dough is great, and the cookies are delicious!!!  The only part that is hard for my daughter is the points she receives for the donations.  She receives 1 point for each order or each donation.  She needed 30 points to earn a jacket.  She has family on the east coast, so they help with donations.  She received a few donations at $100.00  This is great, but she only receives 1 point for this sum.  I wish the company or school would look at the total amount earned instead of 1 point per person or order.  Something to think about in the future."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T17:46:38.000Z",
          "Titre": "Credits for Donations….Needs to Change",
          "Contenu": "The credit for donations needs to be adjusted. You can’t ask someone for a donation and then tell them how to do it. You can’t say in your message that if you decide to give me money instead of purchasing the item, please enter your donation in smaller increments multiple times so I get more credit. Everyone else in the fundraiser gets the same profit I assume, except for the participant who is having to do all the asking and selling. That’s not fair to the child. A $35 donation and a $100 donation should not be worth the same number of credits. If for example the item being sold cost $20 then someone that gives $100 should count for 5 credits. You should also allow someone to enter a donation amount in case they want to contribute but can’t give at least $35. A $5 donation is still appreciated and helpful.Goals should be based on a total $$ amount and not units."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sherri",
          "Nb_Reviews": 3,
          "Date": "2023-11-02T18:11:48.000Z",
          "Titre": "Gift wrapping paper. Things that are useful or could be given as presentsGet more items to choose from",
          "Contenu": "Get more items to choose from, pricing for less fortunate families with lower income may help get more supporters"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Tatko",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T17:31:23.000Z",
          "Titre": "Good, bad experience",
          "Contenu": "It was easy enough to follow the link and click and buy products to support the kids. I liked that part. The bad part was I was getting numerous non-personal texts which were obviously coming from an automated system. Where is the personal contact? The personal touch? And I supported one player, which is all I could afford. I kept getting texts from two others. Repeatedly. There needs to be a system in place for us to kindly decline."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sarah White",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T17:15:28.000Z",
          "Titre": "Not useful to the older generation",
          "Contenu": "Doing fundraisers all on an app is not the best for all the older relatives, neighbors and friends that are not tech savvy. We lost a lot of our usual supporters doing it all on a phone. Also - no fair on the extra fee, very much NOT appreciated to charge people who are supporting us a FEE."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dianne Wright",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T16:34:21.000Z",
          "Titre": "Minimum",
          "Contenu": "You would have collected more money if you lowered your minimum.  I personally know people who would have contributed if the minimum was less than $35."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-01-30T16:41:21.000Z",
          "Titre": "Misleading text requests",
          "Contenu": "Misleading text requests: I kept getting texts that looked like they were coming from my cousin, but when I responded it said the number was not set up for response (or something like that). That felt misleading. This happened more than once. I am happy to donate but would have preferred to deal directly with the person I was donating to. As well, I'd like a receipt for my donation but I don't see how to get one other than the credit card charge."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marva Marks",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T17:18:04.000Z",
          "Titre": "I did not like the interference of…",
          "Contenu": "I did not like the interference of other ads. There should be a direct link to the specific place or company that your funds are going to and I didn't have that experience. I am a semi-literate computer user, so I can navigate quite well."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T17:00:36.000Z",
          "Titre": "This option was good for me as my…",
          "Contenu": "This option was good for me as my grandchild lives a distance from us.  I perfer donations to buying items.  One thing I didn't care for was the lowest option for donating was $35, I would have liked a $25 option since I have more than one grandchild who bring me fundraisers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kathy L",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T01:53:33.000Z",
          "Titre": "Mixed Feelings",
          "Contenu": "Using Molly Dolly made the fundraiser a little easier, but ultimately I felt uncomfortable with the automated texts that generated without my initiation or me giving the ok. Some of my friends felt the texts were Spam and impersonal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donna Blanchard",
          "Nb_Reviews": 2,
          "Date": "2023-09-04T16:53:35.000Z",
          "Titre": "Disappointed",
          "Contenu": "I didn’t like this year the students gain of a jacket was in the second request. Once they had there contacts give for the school then for the jacket, it should have been reversed.  The kids play the game and take the beating they should have been able to qualify for a jacket.  It was hard to get a second donation so soon. Also too many notices sent once a donation was given."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patrick Clement",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T16:18:55.000Z",
          "Titre": "We have several people that wanted to…",
          "Contenu": "We have several people that wanted to donate to our son but was dissatisfied with not having an option to choose a custom amount to donate…. So instead of have several less than $35 donations he ended up with none"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T17:37:53.000Z",
          "Titre": "Annoying Follow On Texts",
          "Contenu": "I was annoyed to get multiple follow up texts after contributing in response to the first one.  Your software needs a better filter for follow up texts!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mary Ann",
          "Nb_Reviews": 5,
          "Date": "2023-01-18T00:48:58.000Z",
          "Titre": "customer service…",
          "Contenu": "I liked the customer service which was quuck and responsive. Wasn't impressed who you partnered with to get items out to customers. Also didn't like the delay in notification that item was out of stock. I had to email you to find out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rose",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T16:02:29.000Z",
          "Titre": "Specified locations - live out of state",
          "Contenu": "As I live out of the area, I chose the discount card option and after purchase seen it’s specific to the Dallas area. It didn’t say beforehand that it was specified locations so please at that before purchase as I could’ve just donated instead."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ben Boland",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T01:56:09.000Z",
          "Titre": "Lump sum donations should automatically…",
          "Contenu": "Lump sum donations should automatically be separated into units so the students  earn credits towards their goals. The donee should not be responsible for making numerous donations to benefit the students required minimum. Thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T06:53:21.000Z",
          "Titre": "Potentially great but needs changes",
          "Contenu": "It has the potential to be a great app with some simple upgrades. It offers a lot of offers and you can access multiple cards. But this is mitigated that there is no way to search or sort through the offers. So the avalanche of options becomes a liability, rather than an asset. You should be able to search by name, sort A-Z and/or search based on your location and which offers are closest to you. Those would make it a 5 star app."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rose P",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T16:12:25.000Z",
          "Titre": "Easy to donate",
          "Contenu": "Liked the easy of making my donation. Disliked the fact there was limited items to chose from to purchase. Disliked that I couldn't pick the amount I wanted to donated. It was set at a minimum of $35. Maybe I could only do $10, why not give me that option."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nope",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T19:04:42.000Z",
          "Titre": "I didn’t realize when we upload…",
          "Contenu": "I didn’t realize when we upload contacts that it would repeatedly send out reminders to people. I think one text was sufficient. We had multiple people call and ask why they were getting texts once a week. It almost looks like we are hounding them for money and that isn’t ok."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Grandparents",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T21:38:41.000Z",
          "Titre": "The general idea of doing this online…",
          "Contenu": "The general idea of doing this online is great.  I did not like the idea that I could not put in a dollar amount less than $25. Maybe I want to give something but couldn't afford the full $25 plus fee of credit card - then nothing could be donated"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Talva Shipp",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T20:05:00.000Z",
          "Titre": "Limited choices",
          "Contenu": "Well, i wish that the product choices were more variety because some supporters did not order anything due to the limited availability. Hope this helps."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amanda Brulte",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T16:23:49.000Z",
          "Titre": "CONVENIENT BUT CHANGES NEEDED",
          "Contenu": "I did like the convenience of the link, however, I do NOT like the minimum $35 donation amount. That's alot of money. I feel like we lost out on donations because of that minimum. I also do NOT agree with donors being charged a fee to donate. We've fundraised in the past with no problems. This was not as successful for us."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T16:14:50.000Z",
          "Titre": "Useless Coupons unless you live in Mobile",
          "Contenu": "Coupons are only able to be redeemed in Mobile AL.. Useless for us. However, I am happy to donate regardless of a reimbursement."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melanie Richards",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T18:47:31.000Z",
          "Titre": "As a chairperson for our school’s…",
          "Contenu": "As a chairperson for our school’s Easter sale, I found a few cons to the app.  The most inconvenient aspect was requiring a different phone number and email address for each student.  This was difficult for parents of multiple students, especially when needing to receive and enter a verification code every time you logged in.  I had my chairperson account but then needed to use my husband’s phone number for my daughter’s account and could only login if he was around to give me the verification code.The second thing I wasn’t fond of was the ranking system.  We typically choose our top sellers by dollar amount and not the number of units sold, it would be nice if you could choose how you would like them to be ranked.  Also, for the team rankings, if a student signed up but didn’t sell anything, that significantly dropped the team’s average number of units.  They’re better off just not registering.  The ranking system just didn’t seem “fair”."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Girl",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T21:27:18.000Z",
          "Titre": "Units should be less",
          "Contenu": "I feel that units should be ten or five bucks since twenty five is allot but overall I liked the experience and another thing is that the apps sends messages to other people without you knowing which bothered other people"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sharon Odom",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T17:09:46.000Z",
          "Titre": "I  only bought the discount card to…",
          "Contenu": "I  only bought the discount card to help my grandson in the band.  I rarely go out so I wanted to give the card to him so his family could enjoy it.  However, there was no way to do that.  Plus downloading it was complicated for me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KH",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T02:56:38.000Z",
          "Titre": "Annoying fundraiser.",
          "Contenu": "Your organization or app sent out messages too many times to our friends and relatives related to this fundraiser and it became annoying for them.   Will never support this particular fundraiser again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 3,
          "Date": "2023-03-14T16:09:31.000Z",
          "Titre": "I like that I am able to donate to the…",
          "Contenu": "I like that I am able to donate to the fundraiser easily being far from the person that is fundraising.  What I dislike was that the cards only had 2 places that I could patron.  The other is the $3 fee to donate to the fundraiser, it seems a bit high and if the person the fundraiser was for hadn't been family I would not have donated at all."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marjee Zeier",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T16:45:50.000Z",
          "Titre": "It was easy to make the donation but…",
          "Contenu": "It was easy to make the donation but the donated party ignored questions. This entitled ingratitude has soured me on the whole donate online thing. I won't do it again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KZ",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T16:24:47.000Z",
          "Titre": "New experience",
          "Contenu": "I think it is a great way to raise money, but maybe starting the donation amount a little lower. I think the kids would get more, because you have to think about lower income families or families on one income. I know we got that feed back from som that we were try to have donate."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PW",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T16:29:43.000Z",
          "Titre": "okay but not great",
          "Contenu": "Did it make the fundraiser easier? Yes it did.But, they take 65 -70% of the food order and charge a fee on top of that. Ok, it's food I can see that to a point. But they take 20% of the cash donations! AND charge a fee on top of that! 20% for doing what! Next time I'll just ask for Venmo or pay pal, save me and the donator money. Plus I had a issue with my account and profile, and they never got back to me. Is it okay, but there has to be better ones out there for next time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Popp",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T22:30:12.000Z",
          "Titre": "It was difficult for me to use",
          "Contenu": "It was difficult for me to use.  I had to call the coach at NEW Lutheran for help getting my cards which I have not received yet. Duh why send out the survey before receiving a product. To me it was not easy.  Sorry. Not sure the date I went online to order this."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nora E",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T16:48:53.000Z",
          "Titre": "It was nice to be able to get donations…",
          "Contenu": "It was nice to be able to get donations and sell things however there wasn’t much to choose from and it was all very confusing"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Kerner",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T04:15:14.000Z",
          "Titre": "Hard to use because you have to open…",
          "Contenu": "Hard to use because you have to open app.  Cards had a quick easy list of participants and offers, tedious to use electronic system.  My mother in law doesn’t have a smartphone and can’t use."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frazia Foster",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T18:48:44.000Z",
          "Titre": "Review",
          "Contenu": "It said I had 18 hours left and then it disappeared.   I had a few that were going to purchase but didn't get paid till Friday.  If they didn't buy i was going to get the last two for him a shirt.   Also many didn't like purchasing on line so they gave me the money and I had to purchase and had to eat the credit card fees.  Didn't like those fees.  Others were asking if there were other things to purchase besides the card.  I guess it was a pretty good fundraiser.  Hope they did well."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Janet Nolan",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T19:43:20.000Z",
          "Titre": "I did not like the outrageous fees that…",
          "Contenu": "I did not like the outrageous fees that you charge! Also the constant reminder of giving donations."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Denise Hayes",
          "Nb_Reviews": 2,
          "Date": "2023-01-18T00:59:30.000Z",
          "Titre": "I did not like the fact that every item…",
          "Contenu": "I did not like the fact that every item was charged a shipping fee when it was all shipped in the same box. I will not order again because of this. The product was good but that was not."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maritza Jimenez",
          "Nb_Reviews": 3,
          "Date": "2023-08-29T16:56:41.000Z",
          "Titre": "I do not like the fees for the service",
          "Contenu": "I do not like the fees for the service. If it's a donation ALL of the money should go towards the foundation, fees should not be charged for something like this. It makes it hard for people who really want to support the most they can."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "kmn",
          "Nb_Reviews": 3,
          "Date": "2023-04-21T04:26:42.000Z",
          "Titre": "there should be an option to sell paper…",
          "Contenu": "there should be an option to sell paper cards in place of the electronic cards. By not having paper cards, there is a large percentage of the older population that opts not to participate in the fundraiser due to not being able to have a paper coupon that they can present at the participating businesses."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T03:33:05.000Z",
          "Titre": "Too expensive of 1 item of clothing…",
          "Contenu": "Too expensive of 1 item of clothing choice. No secondary product like popcorn to choose or I would've sold more."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ScrimpyMink",
          "Nb_Reviews": 2,
          "Date": "2023-05-25T22:59:27.000Z",
          "Titre": "I didn’t like the fact that they…",
          "Contenu": "I didn’t like the fact that they charged a fee for every donation, I purchased 4 $35 donations and they charged me $2+ for each even though I purchased them together."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maniah Shipp",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T16:07:22.000Z",
          "Titre": "Donation",
          "Contenu": "There should be more donation options for supporters who may not want to purchase but want to support"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shammy",
          "Nb_Reviews": 4,
          "Date": "2023-10-18T17:40:59.000Z",
          "Titre": "I enjoy donating I don’t know what the…",
          "Contenu": "I enjoy donating I don’t know what the $1.50 charge was for I rather it went towards my donation instead of a fee."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Guest",
          "Nb_Reviews": 3,
          "Date": "2023-08-25T18:46:05.000Z",
          "Titre": "Confusing Purchase Options",
          "Contenu": "Did not like the fact that you could “donate” or buy a card but the value of each “unit” differed, according to which you chose!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sandy",
          "Nb_Reviews": 2,
          "Date": "2023-01-25T22:43:43.000Z",
          "Titre": "There are way too many notifications…",
          "Contenu": "There are way too many notifications sent out. I was getting emails and text messages one after the other about this program. I think the program is a good one but there are too many messages."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DMF",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T23:40:16.000Z",
          "Titre": "Can’t trust the automation",
          "Contenu": "I liked the automaton but I couldn’t trust it. I uploaded the contacts from my phone and selected the contacts to include, however, the system sent it out to all my contacts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve Faupusa",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T10:39:08.000Z",
          "Titre": "Not sure if it can be trusted",
          "Contenu": "I didn't like that when I uploaded my contacts and went through them and clicked on the ones I wanted to send out somehow all of them got sent a text from me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melissa Lornson",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T17:32:12.000Z",
          "Titre": "Like the actual wildcat card better..",
          "Contenu": "Like the actual wildcat card better... to me personally this is not convenient carrying phone around and having to pull up app to use the rewards"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T02:35:49.000Z",
          "Titre": "Unfortunately I didn’t receive my order…",
          "Contenu": "Unfortunately I didn’t receive my order out of state.  The host of fundraiser made me aware that she received the cookies and offered to send them to me.  I just stated she could keep them and serve them to her guests."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maggie Nelson",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T16:27:56.000Z",
          "Titre": "I would have liked an option to donate…",
          "Contenu": "I would have liked an option to donate an amount lower than $35.00. It would have been nice to have the option to donate any amount. It was very discouraging that the large donation amount still only counted as one unit"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pam",
          "Nb_Reviews": 2,
          "Date": "2023-04-06T05:08:14.000Z",
          "Titre": "Multiple impersonal emails /texts",
          "Contenu": "Multiple impersonal emails /texts. Would be nice if the kids actually reach out to ask and provide a personal thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ji Eun K Takeshita",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T02:30:41.000Z",
          "Titre": "Like & Dislike",
          "Contenu": "Like:I like that I supporting a good worthy cause … White River Hornets Football player. And you gets something back at the same time.Dislike:The sponsors keeps changing their deals or canceling completely. I waited to use the deals for 2023 and now there’s not to much to use.Would be nice if the sponsors keep it as is ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "M Kelly",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T18:19:51.000Z",
          "Titre": "Great fundraising idea but two issues",
          "Contenu": "Great fundraising idea but two issues: - Improve product selection options and- Too many “follow-up” requests auto generated"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cheryl Clements",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T20:29:58.000Z",
          "Titre": "I am still waiting for my order",
          "Contenu": "I am still waiting for my order, and cannot figure out how to track the package. Not sure if it is even sent??Thank you for following up, that is great customer service! I will be waiting for the email to track. Thanks again for your time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CH",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T03:42:26.000Z",
          "Titre": "No bar code or coupon code or number…",
          "Contenu": "No bar code or coupon code or number for the discount, so businesses’ employees are not sure how to input discounts at checkout."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T17:00:37.000Z",
          "Titre": "Great app with a few tweaks",
          "Contenu": "I think it was great that you could order right through text. Made it very convenient. I think $30 being the minimum amount may have been high for some families. It would be nice if there was a $20 option. It also would be nice if the donations received more unit points. I gave $100 but it only got one unit which was the same as pretzels at $29.99. My son could have reached his goal of 30 units easier had the units of donation been split up differently. It would have been nice to have an easy way to go door to door as well. My son really wanted to hit 30 units but ran out of contacts to connect with. Having a way to reach strangers would have been nice too."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrea Lane",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T14:02:30.000Z",
          "Titre": "I don't love that this is all online",
          "Contenu": "I don't love that this is all online. My son had trouble with messages sent automatically."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jill Murr",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T02:45:47.000Z",
          "Titre": "Id rather have card in hand' easier…",
          "Contenu": "Id rather have card in hand' easier accessability.Easier to give to someone else.Ive never used because of it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jenny Singleton",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T16:49:44.000Z",
          "Titre": "Too many texts",
          "Contenu": "The contacts that were not interested in donated complained of being sent texts repeatedly. There should be a way for them to opt out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rhonda",
          "Nb_Reviews": 2,
          "Date": "2023-02-08T00:58:21.000Z",
          "Titre": "They can improve by putting an actual…",
          "Contenu": "They can improve by putting an actual coupon code on the card so that the restaurants know how to use the card."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nancy Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T18:53:30.000Z",
          "Titre": "Discounts are great",
          "Contenu": "Discounts are great. Having card on phone is a major drawback. We could have sold more but a lot of older people don’t use their phone for something like this."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Randi Bustamante",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T18:17:04.000Z",
          "Titre": "Just ok",
          "Contenu": "Product was expensive for what you got. No option to donate less than $35 unless you buy something first and then add on a donation of any amount."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jack Sinuk",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T16:49:36.000Z",
          "Titre": "I normally do not pay the processing…",
          "Contenu": "I normally do not pay the processing fee associated with a contribution.  I did not have the option."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rene Danos",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T00:09:14.000Z",
          "Titre": "Good and Bad",
          "Contenu": "It was very easy to do. The only negative of the whole deal was after paying I noticed a 6 dollar fee. I think it is a very sad thing when a company has to force profits from generous people thinking they supporting a school."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna Skogen",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T17:25:59.000Z",
          "Titre": "I was disappointed that after I had…",
          "Contenu": "I was disappointed that after I had purchased two of the cards my husband started receiving texts asking for a donation. We feel it was a scam? Said there was only 24 hours to reach the goal and to my knowledge it was already closed. My grandson said he did not send it. The return number was 385-489-5530"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "R B",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T17:30:45.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. I did not lik that fact that if you wanted to make a donation, you had to make a minimum of $20. If I wanted to donate less I was not able to and that caused me to not donate an amount at all."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Isabella Jairala",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T20:38:14.000Z",
          "Titre": "The app made everything easily…",
          "Contenu": "The app made everything easily accessible and helped me be able to see what was going on with my little circle."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ellis Whitehead",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T16:11:20.000Z",
          "Titre": "Experience was good.",
          "Contenu": "Experience was good.. reason I rated it 4 stars instead of 5 is because there is no option for a custom donation. I think more people would have donated to this if they had an option to select how much they wished to donate instead of a set amount. While $35 is not a lot of money it may be alot for some to give."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ruth Whitehead",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T00:45:23.000Z",
          "Titre": "experience was good",
          "Contenu": "experience was good. This fundraiser would be better and rate 5 stars if donors were given the option to customize their donation rather than be forced to give at least $35.00. While that is not a whole lot of money, it could be more than some  people can afford to give. A custom donation would be great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tina Costella",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T16:40:37.000Z",
          "Titre": "Great experience.",
          "Contenu": "Having a couple purchase items along with donation choices is terrific.  However, a few friends and family members wanted to donate, but $35 was out of their budget.  Had their been a $25 option we may have had a few more supporters."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dawc",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T18:21:16.000Z",
          "Titre": "Family Day Raffle",
          "Contenu": "While the site was easy for us to navigate, older family members prefer buying actual tickets.  We forwarded the link to a few people who normally support the Family Day raffle and none of them bought tickets this year."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Noah Macomber",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T13:45:40.000Z",
          "Titre": "Super easy to set up and run not much…",
          "Contenu": "Super easy to set up and run not much work needed. We are out of season which is the only reason it isnt 5 stars, I wish that there was some sort of group message within the app to message all of our own participants."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Reginald Watts",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T06:15:56.000Z",
          "Titre": "I am a busy man",
          "Contenu": "I am a busy man . . . Period! When you step into my world, you are on my time which I do not have much of! Y’all made donating easy and meaningful. And you did not waste my valuable time. . . HALLELUYAH"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathi Holt",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T16:48:50.000Z",
          "Titre": "It was great to have the online option…",
          "Contenu": "It was great to have the online option so friends and family out of state could support without having to rely on mail to get delivered. It would have been nice if anyone who donated more than the minimum $20 could have also gotten the gold card for the discounts. Also an option for an \"other\" amount to donate instead of selected donation amounts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelle Bridges",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T04:20:20.000Z",
          "Titre": "Great avenue for donating",
          "Contenu": "Great avenue for donating!  Simple to use and quick while enabling the user to personalize.   May want to make incomplete info areas more evident.   I kept hitting the submit button but couldn't advance.  Close look, I had neglected to enter my zip.  If that area would have been highlighted, it would have been easier to understand what was missing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aimee Losasso",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T16:22:29.000Z",
          "Titre": "It was so easy",
          "Contenu": "It was so easy! The only thing I wish I would have known ahead of time was to encourage people to break out their donations into smaller denominations so more units could be attained."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AW",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T16:06:15.000Z",
          "Titre": "Offer options",
          "Contenu": "We should be able to input the amount of donations we want to offer. I like that I received an email copy of my receipt."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tonya Speller",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T16:45:16.000Z",
          "Titre": "Light of the World",
          "Contenu": "It was a good experience. The representative was a great help and very motivating. We are great full for his patients and help throughout the process. It was a pleasure working with MoneyDolly. Thanks for everything.               Light of the World Christian                   Center"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jamie Zientara",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T16:06:22.000Z",
          "Titre": "Overall great fundraiser",
          "Contenu": "Overall great fundraiser. They only thing I would want different is to be able to see the comments from donors through the personal page. The only way I was able to see them was to go in as though I were making a donation."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T21:34:16.000Z",
          "Titre": "Easy to use interface",
          "Contenu": "Easy to use interface. Would have liked to be able to specify my own dollar amount, or have options less than $40."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sherrie stevens",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T21:20:17.000Z",
          "Titre": "I was able to participate for my granddaughter",
          "Contenu": "I was able to participate for my granddaughter and this process was easy and user friendly. We appreciate and support our family."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rachel Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T16:15:59.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service. There should be a physical card option. It’s difficult to require someone to download an app. If they’re nice enough to donate, we shouldn’t give them a job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Beth Mckinney",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T16:12:56.000Z",
          "Titre": "Fabulous....with one issue",
          "Contenu": "I love the digital format for the ease and because our relatives & friends across the country can participate. Card Connection is a fabulous feature! I do have a couple critiques regarding the donation side. First, I think it should allow for custom amounts rather than flat and the minimum should be the same price as the card. Second, each increment of a donation equal to a card purchase ($15 card or $15 donation) should equal 1 unit. For example, if I buy 2 cards, the player earns 2 units. But if I make a $35 donation he only earns one. Doesn't seem fair so we just had our customers buy the number of cards that would equal the amount they wanted to donate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hema Powell",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T22:01:16.000Z",
          "Titre": "Very easy process",
          "Contenu": "Thank you for a great experience.  It was an easy process. I did not understand using \"units\" as a goal. The fundraiser was to reach an overall amount of money that was needed to cover costs for our children.  Don't think it matters if it comes from 1 person or 20.  Again, it was very easy, so thanks for that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diana Faison",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T17:32:29.000Z",
          "Titre": "I'm  honored to be able to support…",
          "Contenu": "I'm  honored to be able to support Hampton High school with their fund raisers. MoneyDolly makes purchasing easy and simple."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anali Meza Valadez",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T08:30:31.000Z",
          "Titre": "I liked the fundraiser……….",
          "Contenu": "I liked the fundraiser because they had some items for sale, although I would have liked some more personalized item to choose from. Other than that I loved this fundraiser."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sally from Sunburst",
          "Nb_Reviews": 3,
          "Date": "2023-01-23T05:57:44.000Z",
          "Titre": "Money Dolly Growing Pains",
          "Contenu": "I am nearing 70 years old, so I am a \"tad\" (bolded, exclamation points) challenged with technology.  So, once I downloaded the app. and got the Bison Wrestling Team's discount card up and running, I tried it at two different Great Falls locations.  A Holiday gas station.  And Sonic drive up.  Perhaps my \"confirm\" wasn't pressed at the correct time.  It wouldn't work at either location, so I figure one must be face to face with the business person in order to get it to cooperate.  Stay tuned."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rebecca Ungren",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T03:29:31.000Z",
          "Titre": "Loved the program and ease of use",
          "Contenu": "Loved the program and ease of use! However, grandparents who wanted to donate with cash were unable and others were irritated they couldn’t set the minimum amount to donate.  Not everyone who wants to donate can afford to donate that much but would have been able to donate $15 or so."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joann hollingsworth",
          "Nb_Reviews": 2,
          "Date": "2023-07-02T00:23:58.000Z",
          "Titre": "Northwoodl Falcons Football Fundraiser 2023",
          "Contenu": "I enjoyed this experience with money dolly because she didn't have to go through a whole lot of steps I thought. Always enjoy helping my grandchildren and all their sports events and this will help a lot especially you don't have to wait in a no one wait for your turn to fill out paperwork it's a whole lot easier online and just click here click there in less than 5 minutes you're done. So I really enjoyed filling out the information online and looking forward to football season. Which I will be traveling from Mississippi to watch my grandson play call me  Go Falcons !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mellody Rucker",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T19:40:02.000Z",
          "Titre": "Provide More Credits",
          "Contenu": "It was clear and easy to access everything. The only disappointing thing was that whether we donated $35 or $100, or bought multiple items the student only received one credit. We ended up telling family members to buy one item check out, then go back in to buy another, etc...that way the student received all the credits we intended them to have."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Coach P",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T17:44:45.000Z",
          "Titre": "A program saver!",
          "Contenu": "The efficiency of money dolly is an attribute that isn't valued enough.  The set up is the most tedious part, but once it's running, it really runs itself. Our team has benefited from the use of money dolly,  and we will use it for future fundraising as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brenda Schmitt",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T16:20:09.000Z",
          "Titre": "MoneyDolly was very easy to use",
          "Contenu": "MoneyDolly was very easy to use.  The only thing for me was there was no option for an amount other than what was listed.  The option of \"OTHER\" should also be an option so I can choose the amount I want to give.  I participate in several fundraisers throughout the school year."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kristi Conner",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T21:49:48.000Z",
          "Titre": "Organized over the top!",
          "Contenu": "Everything was planned out completed we just had to add the numbers.  It was even planned out how to make sure to show appreciation. The only suggestion is that it kept sending them to the ones who did not want to participate.  There needs to be an opt out selection as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shelby",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T21:51:22.000Z",
          "Titre": "Constructive criticism",
          "Contenu": "People were worried the multiple messages automatically sent were spam messages. I had people who wanted to donate smaller amounts or enter their own amount. $35 for the starting donation is a little high. A donation is a donation.... Should go in increments of $5 if you ask me. Also when someone made a $30 donation it still didn't count as a \"unit\" which didn't make sense to me either when the card was $20 and it counted."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elyse Kaufman",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T16:22:36.000Z",
          "Titre": "Very easy for donors to access and to…",
          "Contenu": "Very easy for donors to access and to share with potential donors. More options would be nice - beyond cookie dough and jerky."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Sabatini",
          "Nb_Reviews": 2,
          "Date": "2023-10-04T17:37:31.000Z",
          "Titre": "I donated in support of Nicolas…",
          "Contenu": "I donated in support of Nicolas Sabatini and so did my wife Cheryl Sabatini.  Some how a few people donated in support of someone other then Nicolas Sabatini."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carol Berg",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T03:17:21.000Z",
          "Titre": "Simple way to fundraise",
          "Contenu": "It was easy to support someone without trying to connect to either pay or receive my discount card. What I don’t like about it, is that I forget I have the discount card. So I am finding it not as easy to remember to use it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jane Holt",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T20:26:45.000Z",
          "Titre": "Needed more donation options",
          "Contenu": "Needed more donation options.  I could buy the card for $25 (which I didn't want to do), or the lowest amount to donate otherwise was $35.  There should have been an option to donate a specific amount, and I did not see that as an option."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aly",
          "Nb_Reviews": 3,
          "Date": "2023-10-25T16:51:54.000Z",
          "Titre": "Great resource",
          "Contenu": "It would’ve been a better outcome for us if it was during everyone’s pay period."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy Deter",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T21:01:17.000Z",
          "Titre": "Fundraiser guidelines, and points system",
          "Contenu": "Not sure whether the school set the parameters as guidelines for the products offered to purchase for the fundraiser, or MoneyDolly does but it was pretty limited.It also seemed hard for the girls to earn points toward prizes. Wasn’t sure how that computed. I bought two items and donated money as well and my granddaughter only earned two points.Looking forward to my purchases."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Moses Wjitehurst",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T00:49:45.000Z",
          "Titre": "Moses Whitehurst Review!!  Your Process was Easy enough to…",
          "Contenu": "Your Process was Easy enough to Navigate and had the tools in place to make the contribution Easy to make.However there Needs to be a Way to Print My Comments once I make My Contribution."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelin Ambroise",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T03:37:02.000Z",
          "Titre": "It was great working with cal",
          "Contenu": "It was great working with cal, he made everything simple. Only one thing I was hoping there were more choices for the items. Overall it was a great experience, and not to mention helpful to my organization. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amy Deck",
          "Nb_Reviews": 3,
          "Date": "2023-01-18T00:52:23.000Z",
          "Titre": "Convenient",
          "Contenu": "It was nice being able to do everything electronically, however the weekly emails following my purchase/donation were too much.  Once you make a purchase/donation, that should be it, not continued requests for more."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff Moffat",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:58:21.000Z",
          "Titre": "easy to use",
          "Contenu": "easy to use, and good product"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J. S.",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T14:06:17.000Z",
          "Titre": "So easy!",
          "Contenu": "So easy!  I loved that fundraising was made simple. People could pay with a card and I wasn't having to keep track of orders or counting money turned in daily. I did not like not knowing up front that if people made a donation that moneydolly kept a percentage of the donation. I would still highly recommend the service though. Easiest fundraiser I've ever done!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Geeya",
          "Nb_Reviews": 4,
          "Date": "2023-09-06T17:39:41.000Z",
          "Titre": "I don't know how to access the $60…",
          "Contenu": "UPDATE:  I was sent a reply explaining how to access my Digital Cards.I don't know how to access the $60 worth of Festival Foods Cards that I bought. Could someone please let me know how to do this?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Class of",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T14:25:31.000Z",
          "Titre": "The overall process of using the app…",
          "Contenu": "The overall process of using the app was easy and the kids were successful implementing it.  The only reason this didn't receive a \"5 Star\" rating was because the app deducted 20% from donations that were made to students during our fundraiser.  I understand that running apps costs money, but it seems that the fees should only apply to sales made, not charitable donations."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Raegan Jordan",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T16:23:04.000Z",
          "Titre": "It was very easy to send out to family…",
          "Contenu": "It was very easy to send out to family and friends. Ease of use is always great in a busy family. I would like more items as options to order and for it to reflect correctly if my student got a donation over the $25."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kim Hemminger",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T02:24:36.000Z",
          "Titre": "Money dolly was great…but",
          "Contenu": "Money dolly was great. I like selling an item rather then just asking for money. I do not like that MoneyDolly kept sending contacts messages from “me” asking to donate, without asking first or allowing me to shut it off. If I texted someone direct and they donated, we don’t need to ask them three more times. Or if they chose not to, continuing to ask is begging."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph Ward",
          "Nb_Reviews": 2,
          "Date": "2023-07-17T17:49:56.000Z",
          "Titre": "I like the efficiency of listing all…Parent",
          "Contenu": "I like the efficiency of listing all contact and be able to track progress.I would prefer a option or other dollar amount for individuals who want to donate a specified amount not advertised."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jana Sudderth",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T03:07:26.000Z",
          "Titre": "The website was easy to use!",
          "Contenu": "The website was easy to use!! My only issue is the digital cards don't have a barcode or coupon number on the coupons. It confuses the businesses. They don't know how to record the coupon for their records"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elaine R. Prim",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T17:58:48.000Z",
          "Titre": "Choices",
          "Contenu": "I enjoyed this effort, however I was wondering why there wasn't more choices. We only got two(2) things to pick from. Other than that I enjoyed the experience. No door to door and the children were not handling the money."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Hartigan",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T22:35:26.000Z",
          "Titre": "Great donation tool",
          "Contenu": "Easy, good experience. I would allow donators to make their name a variable text field instead of just Anonymous or their credit card name for security and better engagement"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ca",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T05:49:14.000Z",
          "Titre": "I would of like to be able to pay what…",
          "Contenu": "I would of like to be able to pay what I wanted instead of preset amounts. I would of also like to of supported more than 1 player. (ex: if you had brothers,) I would like both to pick insread of just 1 kid. just a thought. 1 transaction fir multiple people."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jodi Martin",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T17:53:44.000Z",
          "Titre": "Easy to use!",
          "Contenu": "Easy to use!Request that donation amount be left up to donor. Pre selected amounts are convenient however, not everyone wanted to donate the minimum of $35."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy Groah",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T18:20:28.000Z",
          "Titre": "Buying the cookies was a good…",
          "Contenu": "Buying the cookies was a good incentive, but I also think you need to give more points when dollar contributions made.. For example.. when someone contributes $ 100 that amount of money should be worth more than a point???"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Austin Lapress",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T16:39:24.000Z",
          "Titre": "The easiness of using the app was…",
          "Contenu": "The easiness of using the app was great. The bad part was not being able to buy the sponge candy, I lost about 30 sales just because the sponge candy was unavailable. Items shouldn't sell out for a fundraiser like that. Limited options was a downside as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sarah Campagna",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T17:17:39.000Z",
          "Titre": "The app is good and convenient",
          "Contenu": "The app is good and convenient. I would like to see a barcode instead of a countdown clock when there are free items offered. Confusing for employees with no barcode."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Latanya Mozeke",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T16:10:39.000Z",
          "Titre": "It was Wonderful to be able to view…",
          "Contenu": "It was Wonderful to be able to view donations as well as our goal I just believe the processing fee was pretty steep."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charlie Duke",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T01:01:46.000Z",
          "Titre": "My experience was great since I didnt…",
          "Contenu": "My experience was great since I didnt have to keep up with paper work and funds it was paid for right there on the Money dolly app fast, easy to use and receive transactions on the account."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cindi Burns",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T05:08:41.000Z",
          "Titre": "Very easy",
          "Contenu": "Very easy. Would love to see you add more cookie dough flavors. Most preferably sugar!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ms G",
          "Nb_Reviews": 3,
          "Date": "2023-08-10T00:10:39.000Z",
          "Titre": "I wanted to cash apps",
          "Contenu": "I wanted to cash app, Zelle, or Venmo some additional funds and that option wasn't available. Can you make that an option in the future?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Travis Ostlund",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T18:35:18.000Z",
          "Titre": "The experience was good",
          "Contenu": "The experience was good. Work on better deals with the vendors. Nobody goes to a fast food restaurant and just orders a burger to get a free one. Something like a meal with another 1/2 off or something would be better.Also, I  don’t need an account created for me to accept your terms. This is what turns people off. I don’t want my info out and about."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandi",
          "Nb_Reviews": 2,
          "Date": "2023-09-22T18:21:14.000Z",
          "Titre": "Great . . . not so great . . .",
          "Contenu": "Great - So many choices of places to use it!  Once you're \"in\", easy to use.The prizes for the kids!Almost always have your phone with you (not like a card)!Good for a whole year!Not so great - People my age don't want to bother (or don't know how) to access/use MoneyDolly.  Unless there is Wi-Fi, can't access it.  Have to get it from the establishment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "frances arlene lee",
          "Nb_Reviews": 2,
          "Date": "2023-07-05T21:53:21.000Z",
          "Titre": "football fundraiser",
          "Contenu": "It was very easy to donate and to keep track of who donated and how much! Only thing I would change would be start donations at $20 instead of $35. You could up required units to 20. I have some donors who personally gave me $20 so I combined them to reach the $35 (and over) limit, plus I added the rest to make the fifty. This took away from number of units sold."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Erica S.",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T16:18:33.000Z",
          "Titre": "It was easy to add contacts and send…",
          "Contenu": "It was easy to add contacts and send request and thanks. I did receive feedback that reminders kept being sent out which annoyed some people."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Will Zender",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T22:37:56.000Z",
          "Titre": "Easy fundraising went well",
          "Contenu": "It was an easy fundraiser but I think the stats should have included donations not just the number of cards purchased"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Johanna",
          "Nb_Reviews": 4,
          "Date": "2023-03-26T14:28:49.000Z",
          "Titre": "Helping my grandson's baseball team…",
          "Contenu": "Helping my grandson's baseball team was\" the\" experience. Since I live 3 hours away from him, I do not get to see him play very often. This was my way of \"cheering him and his team mates on\" and support the program."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KL",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T03:53:00.000Z",
          "Titre": "Very easy ordering process",
          "Contenu": "Very easy ordering process. Product is a bit pricey and the donation amounts are high. If not ordering product, maybe donation amounts could be lessened. Overall good experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Theron Montgomery",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T16:38:13.000Z",
          "Titre": "It was worth the advance",
          "Contenu": "It was worth the advance, it's for a great cause and the display of merchandise was excellent.  I was ecstatic I could be of help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wanda N",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T02:04:06.000Z",
          "Titre": "It is convenient to have the app with…",
          "Contenu": "It is convenient to have the app with the offers on my phone. I wish there was a way to transfer one offer to the person picking up the take out. My husband didn't want the app on his phone. The business didn't know how to use the offer but gave us the deal."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nolan Mcpherson",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T13:55:16.000Z",
          "Titre": "It was overall pretty great",
          "Contenu": "It was overall pretty great, however the constant text messages to people who are in my circle was not appreciated"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rose Lewis",
          "Nb_Reviews": 2,
          "Date": "2023-08-10T03:41:52.000Z",
          "Titre": "Football Fundraiser",
          "Contenu": "It was for a good cause, my grandson's football program. I liked that the site was easy to navigate and check the progress of the fundraiser. The donations began at $35.00 which is why I gave it 4 stars. I felt that it might be a bit much for some that would have liked to give. Everything is so expensive and budgets are tight."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tia Smith",
          "Nb_Reviews": 2,
          "Date": "2023-04-01T16:40:33.000Z",
          "Titre": "The website was extremely easy to…",
          "Contenu": "The website was extremely easy to navigate, but the choices available were extremely limited. Please add a few more options."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Toni Sewell",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T16:05:41.000Z",
          "Titre": "process was relatively easy",
          "Contenu": "process was relatively easy. Im a Senior Citz and technology is tough for me"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J. D.",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T16:30:59.000Z",
          "Titre": "The service was easy to navigate",
          "Contenu": "The service was easy to navigate and the work was done for us! The only downfall would be to have it available to be able to navigate multiple accounts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elana T",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T16:11:08.000Z",
          "Titre": "We made over $9,000 in just 2 weeks!",
          "Contenu": "My fundraising rep (Dravin) was very helpful from the very beginning! He checked in with us along the way and made the process very easy. We made over $9,000 in just 2 weeks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Jackson",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T06:58:25.000Z",
          "Titre": "The easy to order.the order was…",
          "Contenu": "The easy to order.the order was received un damaged ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary Comensky",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T19:37:31.000Z",
          "Titre": "It was easy an easy app with one exception",
          "Contenu": "It was easy an easy app with the one frustrating point was adding a helper option did not work via link or qr code and there was no fix for it. That's why you got a 4/5."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Awilda Gaetan",
          "Nb_Reviews": 3,
          "Date": "2023-04-09T16:12:09.000Z",
          "Titre": "To tell you the truth",
          "Contenu": "To tell you the truth, this is my first time ordering cookies and donating to this company so I couldn't really give you an answer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Coach A",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T07:25:26.000Z",
          "Titre": "Liked that the program was accessible…",
          "Contenu": "Liked that the program was accessible through the mobile phone however, some parts of the program were a little confusing for the athletes/parents. We supported the Digital Card program but unfortunately I feel the money donation percentage kept by the company is too high to support the $ donations to the team."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tyler Shuff",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T16:03:03.000Z",
          "Titre": "Great experience. Easy and profitable",
          "Contenu": "Ian was so helpful through the entire fundraiser. Helpful tips and just helping push me to push the team to try harder. Answered all the questions I had.  We will be back again for sure to do another."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marcos Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T17:31:55.000Z",
          "Titre": "What made this great for me…",
          "Contenu": "What made this great is the fact that my family teams can have a trust worthy platform where we as supporters can do a purchase of donation on line, as well as players not having to worry too much about going from place to place to do sale or collect money."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Derrick R",
          "Nb_Reviews": 2,
          "Date": "2023-07-19T17:36:51.000Z",
          "Titre": "Ordering was easy but I would like to…",
          "Contenu": "Ordering was easy but I would like to see who has ordered under my child's name and give the individual the decision to remain confidential."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leisha Alfred",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T17:19:24.000Z",
          "Titre": "I think there should be a slot for…",
          "Contenu": "I think there should be a slot for sponsors to donate an amount that is affordable to their budget.  Starting at $35 is ok. However, some can only do $20 or less."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerry Keith",
          "Nb_Reviews": 2,
          "Date": "2023-08-20T20:33:16.000Z",
          "Titre": "Quick & Easy",
          "Contenu": "A great way to help your favorite school and your favorite team to accomplish something great!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kylee Mcgoldrick",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T16:08:05.000Z",
          "Titre": "I don't think donations should be…",
          "Contenu": "I don't think donations should be counted in the overall total. I think donations should be counted separately."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Natasha Fuller",
          "Nb_Reviews": 2,
          "Date": "2023-03-16T05:32:36.000Z",
          "Titre": "Add other amount",
          "Contenu": "The app need to remove a set amount to give and allow people to give what they’ll want to give. More people would have gave if it wasn’t for them having to give a certain amount. The app should have other amount."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jane",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T17:22:15.000Z",
          "Titre": "It was very easy and everyone was polite"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Candace",
          "Nb_Reviews": 3,
          "Date": "2023-01-29T14:31:20.000Z",
          "Titre": "Easy use if workers read",
          "Contenu": "Easy use excluding worker at place wanted me to exit out of timer and then back in… not sure why."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 2,
          "Date": "2023-07-28T17:51:19.000Z",
          "Titre": "Helping out a Neighbor",
          "Contenu": "Bought these digital coupons to help out a neighbor's football team."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cindy Looney",
          "Nb_Reviews": 4,
          "Date": "2023-05-01T22:59:45.000Z",
          "Titre": "Being able to order online",
          "Contenu": "Being able to order online.  I did not know about Money Dolly until now.  If I had not known one of the students I selling this product I would not have ordered.  I ordered to help Chastity raise money."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Arthur",
          "Nb_Reviews": 3,
          "Date": "2023-09-12T17:51:46.000Z",
          "Titre": "Fundraising for the team was introduced…",
          "Contenu": "Fundraising for the team was introduced by my sister it was interesting and easy too use I was able to see it grow into the accomplishment it has become today ps continue to grow in your productivity"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "travis caton",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T05:17:48.000Z",
          "Titre": "Easily accessed",
          "Contenu": "Easily accessed for selling but I wonder if there is a easier way for older people"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Solomon Walker",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T17:19:30.000Z",
          "Titre": "The app was easy to use",
          "Contenu": "The app was easy to use. Only wish there were other donation amount option. Not many people wants to donate $20 min."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paula Self",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T04:17:22.000Z",
          "Titre": "This was for our grandson so we donated…",
          "Contenu": "This was for our grandson so we donated $145.00. I feel there was a minimum of $20 and some people wanted to donate $10 but could not. I think any amount should be taken."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Concerned Donator",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T16:24:32.000Z",
          "Titre": "Who decides what the minimum donation…",
          "Contenu": "Who decides what the minimum donation is set at?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rosie Fleming",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T16:11:16.000Z",
          "Titre": "I thought it was gone be hard but it…",
          "Contenu": "I thought it was gone be hard but it was like errthing else#BlessUp"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Betty Spivey",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T04:22:52.000Z",
          "Titre": "The company is supporting our kid and…",
          "Contenu": "The company is supporting our kid and helping to give the a better education."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 3,
          "Date": "2023-09-20T16:43:59.000Z",
          "Titre": "It was quick and easy and more…",
          "Contenu": "It was quick and easy and more important trustworthy"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "FREQUENT FLYER",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T11:40:09.000Z",
          "Titre": "The ease of ordering was good",
          "Contenu": "The ease of ordering was good. I only wish there was more options / choices to pick from."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Owen Hanson",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T21:02:16.000Z",
          "Titre": "They responded quickly to my questions",
          "Contenu": "MoneyDolly was great about reaching out and resolving my concern."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "No Name",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T11:51:04.000Z",
          "Titre": "Thumbs up",
          "Contenu": "It was easy yo donate but the fee to use drove me crazy and the fact that it was a must amount. People should be able to key in their amount."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jared Richardson",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T01:21:32.000Z",
          "Titre": "Simple Process",
          "Contenu": "MoneyDolly worked for our fundraiser for a lot of reasons.  It was an easy fundraiser to set up, and a live person helped me through the process.  The application was easy for our athletes and parents to download, and contacts were easy to add.  The products on the site were good quality and helped us bring in some more dollars for the program.  I will definitely be using MoneyDolly for future fundraisers!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "terry falcon",
          "Nb_Reviews": 10,
          "Date": "2023-12-20T16:47:06.000Z",
          "Titre": "The Kids!",
          "Contenu": "I have donated with moneyDolly in Baton Rouge and D'iberville,the kids really need our help,it's fast and easy to use them,they are Great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron Smith",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T20:18:32.000Z",
          "Titre": "Orlanndo was great to work with",
          "Contenu": "Orlanndo was great to work with. The platform and app is easy to navigate! Unfortunately we didn’t achieve our goal but I am pleased with the overall outcome. We are in a rough spot financially with our kids and their home demographics but I feel like we were successful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JO MARTIN-ADAMS",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T01:05:12.000Z",
          "Titre": "Very easy to use",
          "Contenu": "Donating to my granddaughter's school for her basketball team was very easy. The processing fee was very minimal."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Blakeley Nixon",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T07:18:27.000Z",
          "Titre": "My success with Money-Dolly!!",
          "Contenu": "MoneyDolly was so easy to use, you just provide them with your circle. The circle consists of names and numbers and MoneyDolly did the rest. This was a great fundraiser to participate in, you just set back and wait for your people of circle to do the rest. I would recommend MoneyDolly to anyone looking to raise money for their team or organization. I was very excited and pleased with the outcome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron Wicklund",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T16:08:49.000Z",
          "Titre": "Parkway Baseball Money Dolly Fundraiser",
          "Contenu": "Roger was super helpful in our fundraiser.  He came out and made a great presentation to our team and was in contact with me throughout the whole fundraiser.  Will definitely use this fundraiser again next year."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Isabella Velez",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T16:03:16.000Z",
          "Titre": "Great Fundraiser",
          "Contenu": "Fundraiser was easy! People were able to easily access the app and donate without any face-to-face interaction. Made it easy to get donations from family and friends out of state!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlos Oti",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T18:27:16.000Z",
          "Titre": "Very easy to use",
          "Contenu": "Very easy to use! Provided options for all levels of support!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chad Allan",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T00:26:59.000Z",
          "Titre": "This was my first fundraiser online",
          "Contenu": "This was my first fundraiser online. Draven our guide was very organized and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna Perkins",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T17:52:01.000Z",
          "Titre": "Easiest fundraiser I have ever…",
          "Contenu": "Easiest fundraiser I have ever participated in.  The product offered is delicious and arrives soon after purchase.  I would encourage everyone to join in the fun and support your fundraiser."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Foster",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T16:41:47.000Z",
          "Titre": "Great tool to help raise money for schools.",
          "Contenu": "Very easy to track donations, link was perfect for family and friends to follow."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Jenkins",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T05:20:37.000Z",
          "Titre": "Very easy to contribute"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erin Glasscock",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T01:31:02.000Z",
          "Titre": "Got a text for the fundraiser and was…",
          "Contenu": "Got a text for the fundraiser and was able to donate in seconds! Very convenient!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Francis",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T04:19:05.000Z",
          "Titre": "Greatest Fundraiser Ever!",
          "Contenu": "In 21 years of coaching this is the most organized and easiest fundraiser we have ever done!  We beat our goal by over $4,000, and Mark, our fundraiser organizer was incredible.  He was involved the entire way.  This fundraiser is the best ever!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dianne Smith",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T04:03:25.000Z",
          "Titre": "Kyle was so professional and explained…",
          "Contenu": "Kyle was so professional and explained the program to me and I was so impressed that he took the time to make sure I understood the program!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lou Ellen",
          "Nb_Reviews": 3,
          "Date": "2023-11-16T20:08:42.000Z",
          "Titre": "Easy and Excellent Way to Raise Money",
          "Contenu": "This was an easy, yet powerful way to raise money for my grandchildren's school Booster Club. I appreciate being able to give to support Faith Christian School. Thank you, MoneyDolly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesse",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T21:17:33.000Z",
          "Titre": "The system is user friendly and easy to…",
          "Contenu": "The system is user friendly and easy to send out messages to get donations. The donation steps are fast and easy as well. Overall a great platform to use when fundraising."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alisia  B.",
          "Nb_Reviews": 4,
          "Date": "2023-11-22T18:39:36.000Z",
          "Titre": "Amber’s band charity",
          "Contenu": "It was very easy to support my sweet niece and her school bandmates. The links were easy to follow and use, plus the fact that MoneyDolly is a registered charity support company is paramount."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry Bryan",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T19:47:58.000Z",
          "Titre": "Money Dolly made it secure and easy to…",
          "Contenu": "Money Dolly made it secure and easy to contribute."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela Kelly",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T17:05:43.000Z",
          "Titre": "Very easy to donate and keep track with…",
          "Contenu": "Very easy to donate and keep track with the progress 😃"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Isela",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T21:13:52.000Z",
          "Titre": "Soccer Donation",
          "Contenu": "I ordered a couple of items and they arrived and they are delicious!  Always glad to help my Granddaughter and her school activities."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Penni Aufderheide Keck",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T18:09:23.000Z",
          "Titre": "Awesome Experience, Expert Support",
          "Contenu": "This was a new experience for us.  We have never used an app to fundraise. I honestly don't want to do it any other way again. It was so easy, and we had a successful fundraiser.  The more we move to this kind of fundraising, the more it will be accepted in our community.  I would recommend MoneyDolly as your next fundraiser. Get buy-in from your organization, and you'll do well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christi N",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T23:57:13.000Z",
          "Titre": "MoneyDolly is a great fundraising…",
          "Contenu": "MoneyDolly is a great fundraising platform!! The app is very user friendly and makes fundraising super easy! Much simpler than trying to sell things most people don’t really want to buy. The reminder texts sent are great also! Thank you for this fantastic app!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Evelyn Rencher",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T21:45:13.000Z",
          "Titre": "Helpful…",
          "Contenu": "Loved how helpful everyone was from the first zoom call to the last day of the fundraiser."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dixon’s Automotive Repair",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T16:51:38.000Z",
          "Titre": "We are more than happy to help our…",
          "Contenu": "We are more than happy to help our community and the children."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather Graeff",
          "Nb_Reviews": 3,
          "Date": "2023-11-30T18:54:47.000Z",
          "Titre": "One of the easiest sites I've ever used…",
          "Contenu": "One of the easiest sites I've ever used when buying from a fund raiser or giving a charitable contribution."
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "Kerith Graham",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T01:15:33.000Z",
          "Titre": "The staff at moneydolly make the…",
          "Contenu": "The staff at moneydolly make the experience seamless, sample and straight for ... I will all person who have intention to do a fundraiser to use moneydolly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn Roy",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T18:15:24.000Z",
          "Titre": "It was very easy and effortless",
          "Contenu": "It was very easy and effortless. Easy instructions to follow to make your donations. For a person like me who's not to sure about, all this new technology, cause I'm old school it was simple to follow the instructions. So thanks for that. Would recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra Rockwood",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T16:07:37.000Z",
          "Titre": "It was very easy ordering in the site.I…",
          "Contenu": "It was very easy ordering in the site.I am glad to help my grand children on fundraising and bonus was we love popcorn."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sha Hinnant",
          "Nb_Reviews": 3,
          "Date": "2023-12-04T04:44:08.000Z",
          "Titre": "This fundraiser was for my niece.",
          "Contenu": "This fundraiser was for my great-niece's basketball team.  It was easy and affordable.  Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T16:21:49.000Z",
          "Titre": "By reaching out to many people and…The company was most helpful in all that we needed. I would definitely do business with this company again in the future.",
          "Contenu": "By reaching out to many people and seeing there reaction to want to support the children. MoneyDolly is simple and easy to understand how to order the items and to make a donation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T16:29:20.000Z",
          "Titre": "Well I wanted to help out my… cheerleader girls at Malone Central School",
          "Contenu": "Well I wanted to help out my GrandDaughter Halle Gratton .to be part of this team.and it is like a Dream for her.and she is very excited about it all.and happy for the rest of the girls.and keep up the good work girls. 9:21 am Thursday December 7th .from Leo LaPage Jr"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joyce Mckinney",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T19:38:18.000Z",
          "Titre": "This company is very good because it’s…",
          "Contenu": "This company is very good because it makes easy access to donating to a worthy cause in helping students with their fundraising."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly Mcelrath",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T16:17:45.000Z",
          "Titre": "They give options not enough options though",
          "Contenu": "I appreciate that they give you option to donate but it really sucked that you couldn't donate less then 25.00. We had people that can't afford the minimum 25.00 but could have donated 10.00."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brooke Kelso",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T17:02:42.000Z",
          "Titre": "These wreaths are truly fresh and last…",
          "Contenu": "These wreaths are truly fresh and last a long time! A friend of mine also ordered one and it was still so beautiful and fresh at the end of Jan. When she took it off her door to throw away, her neighbor asked if she could have it to put on her door until it dried up😃💞👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judith Collins Morrison",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T20:05:13.000Z",
          "Titre": "The donations page made it extremely…",
          "Contenu": "The donations page made it extremely easy to donate to my granddaughters wrestling team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T00:05:50.000Z",
          "Titre": "The app made it easy to support the…",
          "Contenu": "The app made it easy to support the kids with their goal when you don’t live close by. It was easy to enter my information, make my selections and print a receipt."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan James",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T18:46:15.000Z",
          "Titre": "Easy secure transaction",
          "Contenu": "I liked that I was able to use my credit card. MoneyDolly made that transaction easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phillip Baker",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T00:06:43.000Z",
          "Titre": "I liked it because I was able to…supporting the team",
          "Contenu": "I liked it because I was able to contribute long distance. It’s a 2 hour drive from where I live to my granddaughters home.  So thank you for being there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chanda S.",
          "Nb_Reviews": 3,
          "Date": "2023-11-16T05:08:09.000Z",
          "Titre": "The site is very easy to navigate and i…",
          "Contenu": "The site is very easy to navigate and i was able to find the products easily and see where the person i was helping to support was withe points. My products came in a timely manner as well!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Germaine Chesnut",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T16:52:59.000Z",
          "Titre": "It was easy to navigate and the items…",
          "Contenu": "It was easy to navigate and the items to purchase were all yummy looking."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dakota West",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T16:07:14.000Z",
          "Titre": "Money Dolly made fundraising easy!",
          "Contenu": "Money Dolly made fundraising easy! Experts stayed in contact to provided professional instruction on how to be most successful with the fundraising interface."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Helen Cherry",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T02:22:10.000Z",
          "Titre": "The easiest way to send money The…",
          "Contenu": "The easiest way to send money The support recieved  by school"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cjay",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T00:15:23.000Z",
          "Titre": "Connected from afar",
          "Contenu": "My niece was able to send me a link to help support her as I live in a different town! So easy and convenient plus I got to leave a message for her!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J. Neil  Stevens",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T16:22:45.000Z",
          "Titre": "Message/donation request was thorough…",
          "Contenu": "Message/donation request was thorough and making our donation was seamless."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Claudia Lopez",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T05:02:03.000Z",
          "Titre": "I like to support students that are in…",
          "Contenu": "I like to support students that are in sports specially if it’s one of my family members and by using Money Dolly I could safely send them money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lashaunda Sample",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T16:22:03.000Z",
          "Titre": "I was able to contribute for a great…",
          "Contenu": "I was able to contribute for a great cause all the tip of my fingertips. The process was an ease. The communication from support team was quick and my issue was resolved quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T04:26:52.000Z",
          "Titre": "Donating money for our grandson's…",
          "Contenu": "Donating money for our grandson's college and the baseball team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "tish",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T19:28:47.000Z",
          "Titre": "supporting HHS girls",
          "Contenu": "just wanted to help other girls on the team. I remember doing this fund raising with my girls when they used to play sports @ HHS"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Manheim",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T19:38:16.000Z",
          "Titre": "special review.",
          "Contenu": "I was glad to be a participant in the Verrado HS school project!  I was able to help my granddaughter achieve her goal and support her High School. Special thanks to her teacher for his efforts!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gloria Davis",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T19:31:52.000Z",
          "Titre": "An easy and convenient way to support…",
          "Contenu": "An easy and convenient way to support friends and family to reach goals. Glad to be a part of this unique way to participate"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peggy Nickle",
          "Nb_Reviews": 3,
          "Date": "2023-11-05T20:41:52.000Z",
          "Titre": "It was easy to order on the site",
          "Contenu": "It was easy to order on the site. And the kids are doing great selling your products. Always happy ☺️ to support them. Thanks for the opportunity to support my local school district!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T23:10:43.000Z",
          "Titre": "I was able to help someone close to me",
          "Contenu": "I was able to help someone close to me, I appreciated the opportunity this website gave me, to do that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glenna Cordell",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T17:53:06.000Z",
          "Titre": "It was very easy to navigate and donate…",
          "Contenu": "It was very easy to navigate and donate to our school.  Just took a couple of minutes and the response from the school was fast saying they had received it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Rhudy",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T17:56:38.000Z",
          "Titre": "Never leave your coupon book at home again…",
          "Contenu": "Great fundraiser that makes fundraiser coupons/discounts at hand, at all times. No coupon book to remember, it’s on your phone, which is always at hand. Brilliant!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gail Hamlin",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T05:02:35.000Z",
          "Titre": "The directions were clear and concise",
          "Contenu": "The directions were clear and concise, very easy and quick to follow."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin West",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T16:51:32.000Z",
          "Titre": "Willing to help out in anyway I can. Success!!!",
          "Contenu": "Willing to help out in anyway I can."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pamela  Whitehouse",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T18:50:04.000Z",
          "Titre": "So easy!",
          "Contenu": "I am not technologically inclined. That being said that this site was very easy for me to donate money. I did it on the first try and that's saying something."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Prentice Walker",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T05:51:12.000Z",
          "Titre": "I found the fundraising system that was…",
          "Contenu": "I found the fundraising system that was used was easy to navigate and easy to donate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy Oligmueller",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T16:59:42.000Z",
          "Titre": "What a great way to keep young students…",
          "Contenu": "What a great way to keep young students engaged in sports and giving them success."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Bowles",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T16:55:58.000Z",
          "Titre": "The Bottom Line",
          "Contenu": "Doing the fundraiser in this form (with the app) is so much easier.  We also did better ($$ raised) this year than we ever have before."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd Sandifer",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T02:46:42.000Z",
          "Titre": "This was the easiest fundraiser ever",
          "Contenu": "This was the easiest fundraiser ever!  Vicky was fantastic!  Our group total exceeded every expectation!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GranMom",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T02:47:42.000Z",
          "Titre": "The site is easy to navigate and…",
          "Contenu": "The site is easy to navigate and allowed the participants to chose what they wanted without any pressure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Viola Callier",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T17:04:58.000Z",
          "Titre": "Support",
          "Contenu": "The ease of making the donation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thedford Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T17:25:06.000Z",
          "Titre": "Dear [MoneyDolly Fundraising Team], I hope this message finds you well. I am writing to express my gratitude for my incredible experience with the MoneyDolly fundraiser, particularly in support of our",
          "Contenu": "Dear [MoneyDolly Fundraising Team],I hope this message finds you well. I am writing to express my gratitude for my incredible experience with the MoneyDolly fundraiser, particularly in support of our basketball team.From the very beginning, MoneyDolly made the fundraising process not just efficient but also enjoyable. The user-friendly platform allowed our supporters to contribute seamlessly, and the various features made it easy for us to share our team's story and goals. This accessibility played a crucial role in the success of our campaign.What truly set MoneyDolly apart was its ability to foster community around our basketball team. The platform was a virtual hub where coaches, supporters, teammates, and donors gathered to rally behind a shared passion. The engagement and encouragement we received through MoneyDolly were instrumental in boosting team morale and creating a positive atmosphere around our fundraising efforts.The updates and progress reports provided by the MoneyDolly team were invaluable. In real-time, seeing how each contribution brought us closer to our fundraising goal motivated us to keep pushing forward. It kept our supporters informed and helped them understand the tangible impact of their generosity on our team's aspirations.I must commend MoneyDolly for going above and beyond to support our basketball team's journey. Your platform has helped us financially and created lasting memories and connections within our community. Participating in such a well-executed and impactful fundraising campaign has been an honor.As we reflect on the success of this endeavor, we look forward to future collaborations with MoneyDolly and the continued support of our incredible community.Thank you for making our fundraising experience with MoneyDolly genuinely remarkable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T22:12:42.000Z",
          "Titre": "The process was easy to follow and the…",
          "Contenu": "The process was easy to follow and the website was laid out nicely"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Rios",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T20:56:45.000Z",
          "Titre": "Very simple process product was…",
          "Contenu": "Very simple process product was excellent. Can’t wait to re-order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juanita Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T18:46:20.000Z",
          "Titre": "It encourages kids to stay focused in…",
          "Contenu": "It encourages kids to stay focused in school and music is an integral part of a well rounded student."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JoAnn",
          "Nb_Reviews": 3,
          "Date": "2023-11-03T18:30:16.000Z",
          "Titre": "I gave to my grandson's endeavor",
          "Contenu": "I gave to my grandson's endeavor by using thier funding site MoneyDolly. It was easy and safe."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Merkel Kennedy",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T19:16:39.000Z",
          "Titre": "Highly Recommended",
          "Contenu": "The fundraiser was easy, profitable, and engaging. I’ve never had so much fun doing this."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheila Gillette",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T18:11:28.000Z",
          "Titre": "Orchestra program at Klein Oak is Awesome!",
          "Contenu": "Love the orchestra program at Klein Oak and want to support it. The fundraiser was easy to  make a donation on !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erael Watts",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T02:21:52.000Z",
          "Titre": "It was easy for everyone to purchase…",
          "Contenu": "It was easy for everyone to purchase their popcorn"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Gaskill",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T16:26:57.000Z",
          "Titre": "This was a very easy experience",
          "Contenu": "This was a very easy experience. I like that the wreaths are fresh. It’s a great way to raise money for your fundraising needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Candice Smith",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T16:13:56.000Z",
          "Titre": "Great way to raise money for our…",
          "Contenu": "Great way to raise money for our children. It was easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donor",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T17:47:52.000Z",
          "Titre": "Super easy to navigate the website to…",
          "Contenu": "Super easy to navigate the website to make a donation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry Carbone",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T21:13:26.000Z",
          "Titre": "The cookies are awesome!",
          "Contenu": "The cookies are awesome. We ordered them last year and were glad to repeat!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C Werner",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T16:06:26.000Z",
          "Titre": "Very easy to donate and also super fast…",
          "Contenu": "Very easy to donate and also super fast shipping for items purchased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monica Mitchell",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T16:45:55.000Z",
          "Titre": "The process was easy and I have enjoyed visiting new businesses.",
          "Contenu": "The process was easy and I have patronized some businesses that I wouldn’t normally visit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Theodore Mccauley",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T17:55:41.000Z",
          "Titre": "Quick and easy",
          "Contenu": "MoneyDolly made it very quick and easy to reach friends and families."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ruby Burnett",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:22:09.000Z",
          "Titre": "Easy to use friendly user"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lawrence Van Liew",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T19:49:52.000Z",
          "Titre": "Simple, easy, effective",
          "Contenu": "The app was simple to use, and we raised a good amount of money for our program."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CBD",
          "Nb_Reviews": 4,
          "Date": "2023-11-02T17:06:36.000Z",
          "Titre": "Really delicious pretzels and popcorn!",
          "Contenu": "Love the popcorn and pretzels we ordered! Everything arrived quickly and it was all delicious!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron G",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T22:00:58.000Z",
          "Titre": "easy peesy",
          "Contenu": "It was veru easy to navigate and donate. Site is secure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trevor Montellano",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T17:40:20.000Z",
          "Titre": "Try to help out schools and students in…",
          "Contenu": "Try to help out schools and students in finding the goals to do what they love doing,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philip Percle",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T01:35:47.000Z",
          "Titre": "Very easy to understand and use"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ellen Ferris",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T16:35:40.000Z",
          "Titre": "Super easy to place my order...great…",
          "Contenu": "Super easy to place my order...great selection on items to choose from..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tina B",
          "Nb_Reviews": 3,
          "Date": "2023-11-11T16:43:21.000Z",
          "Titre": "Fast & easy",
          "Contenu": "Fast & easy I was able to help out my great nephews sports team, even though I live 1800 miles from him."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doretha Smith",
          "Nb_Reviews": 4,
          "Date": "2023-11-17T18:27:56.000Z",
          "Titre": "I was excited to contribute to a…",
          "Contenu": "I was excited to contribute to a fundraiser my granddaughter sponsoring. Really nice!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra Kurz",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T16:21:07.000Z",
          "Titre": "The site was easy to use and it helps…",
          "Contenu": "The site was easy to use and it helps support great organizations. Keep up the great work"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pamela Baker",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T16:41:43.000Z",
          "Titre": "5 stars!",
          "Contenu": "I love my Molly Dolly app!  Not only do I save money at the local businesses but I am supporting the kids and schools!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valerie Lugo",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T21:02:00.000Z",
          "Titre": "Accessible",
          "Contenu": "Easy to navigate and review."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alysa Vandekamp",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T16:28:28.000Z",
          "Titre": "The experience when using MoneyDolly…",
          "Contenu": "The experience when using MoneyDolly was easy to use As well as clear instructions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "No Fears Transport",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T18:06:09.000Z",
          "Titre": "Trustworthy",
          "Contenu": "Was able to help a friend's son w donations for wrestling team"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Evelyn Diaz",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T17:24:07.000Z",
          "Titre": "Great fundraiser! Easy!",
          "Contenu": "Easy fundraiser and seeing the progress!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Silverstein",
          "Nb_Reviews": 4,
          "Date": "2023-12-01T16:36:44.000Z",
          "Titre": "Nice way for schools to receive funds…",
          "Contenu": "Nice way for schools to receive funds for projects."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judy Ricotta",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T18:34:32.000Z",
          "Titre": "ease of use and feeling of security"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angeline Monaco",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T03:48:15.000Z",
          "Titre": "Easy, easy, easy!",
          "Contenu": "So easy to use and easy to track, for the kids doing the fundraising."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Reid",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T16:42:20.000Z",
          "Titre": "Great way for Grand Parents to…",
          "Contenu": "Great way for Grand Parents to contribute to the programs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Octavis Jones",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T18:56:01.000Z",
          "Titre": "It was a very easy process. Great popcorn!",
          "Contenu": "It was a very easy process"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy Laborde",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T18:49:54.000Z",
          "Titre": "It was extremely easy to donate money…",
          "Contenu": "It was extremely easy to donate money and support my granddaughter"
        }
      ]
    }
  ]
}