{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "musicstorelive.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "No thanks",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T00:42:28.000Z",
          "Titre": "Charged restocking for defective item",
          "Contenu": "Sent me a defective item. When I returned it, they charged a 10% restocking fee!  Absolute scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Stark",
          "Nb_Reviews": 1,
          "Date": "2022-04-04T05:12:00.000Z",
          "Titre": "My desk arrived damaged",
          "Contenu": "My music desk arrived damaged, I’ve emailed support/customer service and have not heard back in (at this time) 7 days. I would not recommend dealing with this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim Cray",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T22:40:41.000Z",
          "Titre": "If your service improved it would still be bad",
          "Contenu": "After placing the order the next I tried to cancel it.  I left two unanswered VM's (only 1 guy on your VM system???).  I sent Emails...also unanswered...and ultimately got in touch with someone at Pitbull Audio?  After a week w/o anything from your company I sent the amp back.  A couple of days later I got a note from someone in your returns dept.  You don't get a second chance to make a first impression.  And BTW you have my name wrong."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zachary Massell",
          "Nb_Reviews": 2,
          "Date": "2022-04-07T00:09:27.000Z",
          "Titre": "Initial impressions were high",
          "Contenu": "Initial impressions were high, but upon arrival the guitar neck pickup had issues, the spring on the bass side had actually been cut in half - very odd for a \"new\" guitar... I also reached out on the \"contact us\" form for the specs of the guitar after purchase and still haven't heard anything back - so I had to take the guitar in to fix the neck pickup and it's an amazing guitar (another cost to get this running correctly), this shouldn't happen on a purchase for guitar that costs as much as this does"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Rivera",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T05:48:05.000Z",
          "Titre": "Can not reach an operator on the phone",
          "Contenu": "Can not reach an operator on the phone. No one replied to my return or email!!!"
        },
        {
          "Note": 1,
          "Lieu": "RU",
          "Pseudo": "Paul Ti",
          "Nb_Reviews": 2,
          "Date": "2022-06-04T00:42:43.000Z",
          "Titre": "Didn't get anything",
          "Contenu": "So, on May 30 I allredy flew from Seattle,didn't get any package, so thats it.Today asked my wife to check - still nothing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Caroline Daniels",
          "Nb_Reviews": 1,
          "Date": "2021-05-16T16:29:36.000Z",
          "Titre": "I never received any shipping…",
          "Contenu": "I never received any shipping information and had to email a representative to get any kind of idea of how long it would take to ship my bass. It still has not arrived and I would not have ordered from this website if I knew how long it would take to ship an instrument I paid hundreds of dollars for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-08-25T19:38:21.000Z",
          "Titre": "Worst customer experience ever!",
          "Contenu": "Long story short I bought an amp from music store live.  They claimed they had In stock. Then after I paid for it and tried to contact them multiple times they told me it was damaged and they had to order a new one. Then once it arrived it was the wrong amp. Took multiple calls which no one answered and multiple emails which again no answer. Was finally able to contact them via love chat. Never again will I buy from music store live. Sadly this isn’t the first time something like this has happened."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe Stevens (Indiana)",
          "Nb_Reviews": 1,
          "Date": "2018-11-19T20:41:08.000Z",
          "Titre": "MARSHAL PEDL 91016",
          "Contenu": "I ordered a Marshall PEDL 91016  pedal for a DSL40CR amplifier.I had already looked everywhere and only ordered it through you because you had it listed as in stock. All I got was an email telling me I would be notified when it ships. Now I find out from other sources that it may be in mid December before it maybe ships. It has to made in Vietnam, shipped to  Marshall in England and then on to the U.S.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jesse Mortensen",
          "Nb_Reviews": 1,
          "Date": "2017-06-15T20:01:17.000Z",
          "Titre": "Music Store Live shipping department receives an F-!!!!",
          "Contenu": "$800 PRS Sonzera 20 watt tube amp was horribly packaged.  MSL only used ONE box (not even the original PRS box) and it was barely big enough to get around the amp.  Almost NO padding of any kind was used.  Wound up costing MSL $200+ to fix the damage that was done to the amp during shipping.  The shipping dept. at MSL gets an F-."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gregory Morgan",
          "Nb_Reviews": 1,
          "Date": "2022-04-14T16:33:52.000Z",
          "Titre": "It's been three days and I still don't…",
          "Contenu": "It's been three days and I still don't have a invoice."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ronald Betsworth",
          "Nb_Reviews": 1,
          "Date": "2021-08-08T01:14:23.000Z",
          "Titre": "Still waiting for my order with no…",
          "Contenu": "Still waiting for my order with no updates since July 19!! But the purchase amount was withdrawn from my account immediately! At the very least I’d expect “it’s been delayed” email. Not cool"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Glenn Hallick",
          "Nb_Reviews": 1,
          "Date": "2020-03-21T18:49:08.000Z",
          "Titre": "strings ordered none sent.",
          "Contenu": "I ordered 3 multisets of Elixir strings. They were never sent.They credited my credit card back without saying why or any other explanation.Why would I ORDER  anything from the Music store again?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "New customer",
          "Nb_Reviews": 1,
          "Date": "2021-01-19T15:37:49.000Z",
          "Titre": "Poor service",
          "Contenu": "Poor communication. No advice on replacement guitar for one they were selling that turned out to be \"defective\". Never answers phone, always goes to voicemail."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "gary",
          "Nb_Reviews": 1,
          "Date": "2020-09-22T23:16:51.000Z",
          "Titre": "I never received my product",
          "Contenu": "It has been over a month now and still never received my product, I checked my credit card account and yes the charge was taken from my account.Still waiting!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JP",
          "Nb_Reviews": 2,
          "Date": "2020-08-26T23:37:33.000Z",
          "Titre": "This Was a Bad Experiance",
          "Contenu": "They claim to setup the guitars they sell, but this was obviously not true in my case, because it appears they didn't even look at the defective one they sent me. It buzzed more than a bee hive and that's because it had high and uneven frets from fret 12 to 24. Something that would have been noticed if a basic setup was done, because low E to G buzzed on the open notes. You would think that they would check that an $1100 guitar was playable before shipping it out, but unfortunately for me they did not. The back-plate was scratched up a good bit as well, but to be fair, this could of been caused during shipping. Also the finish had what felt like grains of sand underneath it. I did get a full refund and the service rep I dealt with was responsive, but the entire process was painfully slow. This was a bad experience for me & I will not buy from here again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Byron Mendenhallcustomer",
          "Nb_Reviews": 2,
          "Date": "2018-03-02T01:02:19.000Z",
          "Titre": "No follow up after sale",
          "Contenu": "No follow up after sale. E mailed twice requesting advice on how to set up my Katana 50 amp and Squier Deluxe for a great blues sound. Dead silence. Disappointing!"
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2019-05-25T10:50:33.000Z",
          "Titre": "Awful Experience",
          "Contenu": "I decide to purchase a guitar from Music Store Live. I paid for it early  on a Friday morning expecting it to ship that day, since they showed it in stock. I live in the US. I heard nothing about shipping Friday or the next Monday or the next Tuesday. So I finally called on Tuesday at 12pm pacific time and no one was available to answer the phone. I left a message with my order and phone number. An hour later I left a second message. The messages were DO Not ship till you talk to me. No one returned my call. Later that day I received an email my guitar had shipped, in spite of my instructions not to. I emailed Music Store Live to retrieve the guitar which they did. When they finally responded about the delay and no communications they made all types of excuses for their poor business practices. I ordered the same guitar at a better price from Kraft Music and had it in 3 days with outstanding customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 2,
          "Date": "2021-02-02T19:52:02.000Z",
          "Titre": "0 Stars!",
          "Contenu": "If 0 stars were possible that is what I would immediately give.Reached out on Reverb to confirm an amp that was listed was actually in stock and available.Store responded and told me I could get a few dollars off going directly through them.Immediately reached out through the website, purchased, and paid for the amp.Next day, order still shows as ‘Processing’.  I reach out just to make sure everything is on track and am told amp should be ‘shipping today’.Next day, still shows as ‘Processing’.  Reach back out and they respond ‘absolutely, just backed up with COVID’.Next day, still shows as ‘Processing’.  Reach back out and am told ‘turns out, some other people had the same idea of purchasing the amp and we oversold by 2 people.  My bad’.Buyer Beware - they sell merchandise they don’t actually have in stock (even after they confirm to you it is in stock), string you along for days, and then just tell you ‘my bad’.Too many other places to do business with that don’t play games - will never purchase with them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "K.C.",
          "Nb_Reviews": 1,
          "Date": "2020-12-02T19:15:53.000Z",
          "Titre": "Not playable",
          "Contenu": "I bought a brand new bass guitar and every  string buzzed on every fret. Totally unplayable"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-18T19:46:14.000Z",
          "Titre": "Dishonestly charged a restock fee on a…",
          "Contenu": "Dishonestly charged a restock fee on a return. Buyers be aware of this scheme."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-11-22T19:14:02.000Z",
          "Titre": "guitar pedals",
          "Contenu": "Still waiting for a pedal I ordered,It's been 2 weeks already????"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Williams",
          "Nb_Reviews": 1,
          "Date": "2021-09-25T02:22:30.000Z",
          "Titre": "What happened?",
          "Contenu": "Been a month and no Bass Tracking # ??"
        },
        {
          "Note": 1,
          "Lieu": "TH",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-06-02T18:28:45.000Z",
          "Titre": "Fuc..K You Ben !!",
          "Contenu": "YOUR SHOP IT FUC...KING BAD"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-04-10T06:33:09.000Z",
          "Titre": "Website update necessary"
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "MAJORCRYK",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T09:29:14.000Z",
          "Titre": "Funny",
          "Contenu": "The ad does not correspond to what I received"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jose Romero",
          "Nb_Reviews": 1,
          "Date": "2022-01-12T21:01:02.000Z",
          "Titre": "Guitar not in good condition",
          "Contenu": "I negotiated a price on a cordoba fcwe and bought it as new.  However it was not new, the electronics were damaged, battery dangling inside.  I got a full refund, very responsive service and friendly, just not impressed with product delivery and quality.  I wasted almost three weeks."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jefferson  Brinvert",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T00:41:39.000Z",
          "Titre": "I received my package damaged with…",
          "Contenu": "I received my package damaged with electrical problems. Haven’t had my bass for even a week hopefully they can get this fixed in a quickly manner."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Britt  Williams",
          "Nb_Reviews": 3,
          "Date": "2021-05-07T17:24:50.000Z",
          "Titre": "I love the guitar, BUT....",
          "Contenu": "I love the guitar, but the volume pot for the bridge pickup is difficult to turn after about '7' and seems like it's about to go out. It's obvious and all you have to do is turn the volume knob to find it. Disappointing quality control. I'll have to have the pot replaced. But, overall, I do love the guitar."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-12-27T05:28:05.000Z",
          "Titre": "Takes far too long",
          "Contenu": "I ordered a mic that was on sale a month ago for a Christmas present and I haven’t even gotten the email that it’s been shipped. It took the money and didn’t give me a tracking number at all and after emailing them about the status they never replied"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-06-13T18:58:25.000Z",
          "Titre": "I ordered a set of strings",
          "Contenu": "I ordered a set of strings, and they were in stock. After a week and no word about shipping, or order status, I had to call. Once I called, the service was fine, and the order shipped immediately. But... I had to call to get to that point."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Conrad Jung",
          "Nb_Reviews": 2,
          "Date": "2021-09-27T21:03:39.000Z",
          "Titre": "I have ordered dozens of items now from…",
          "Contenu": "I have ordered dozens of items now from MusisStoreLive and at first they were prompt but the packing has been terrible for some things like heavy effect pedals sent either plain USPS boxes with zero padding, or thin 1 sheet of bubble in white envelopes. Having all my electronics sent this way bothers me, and I now refuse to buy any more of them from this company. I do not know how many items will not work due to transit abuse, and any dunce knows all the carriers throw, kick, drop, and treat packages like rocks. So MusicStoreLive gets a ZERO in packing, thus a bad rating overall from me. Also, they goofed 2 orders of mine by sending wrong size cable, then left out one of two packs of accessories I ordered from them. Someone at the warehouse is very undependable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dan Sully",
          "Nb_Reviews": 1,
          "Date": "2021-05-13T12:22:30.000Z",
          "Titre": "Bait, and Switch",
          "Contenu": "This is A real music store, and they do have a nice customer service... but they also do bait-and-switch tactics. I was looking to buy A Sire acoustic, and they were the only one with them listed in stock. I ordered it, and chatted online with them to verify the model. Four days later, no shipping notification, and the website showed not in stock on my phone, but when I looked at the site with a computer, it showed in stock. I chatted again, and was told it was sold in their store, and not updated in inventory, but they’d be happy to sell me something “similar” at a good price (I used paypal), before offering a refund. I took the refund, and ran. I will say they did immediately refund my PayPal. BUT... The next morning, the same Guitar showed in stock both on my phone, and computer... it’s a discontinued model so they didn’t get more in. As admiral Akkbar said: “It’s a trap”."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Monique Reed",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T21:06:57.000Z",
          "Titre": "Overcharging",
          "Contenu": "Overcharging, Damaged Goods, Terrible Customer Service! Extremely rude."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Christopher Bordeleau",
          "Nb_Reviews": 2,
          "Date": "2017-09-08T02:20:02.000Z",
          "Titre": "The new guitar that i just bought has a …",
          "Contenu": "The new guitar that i just bought has a lot of rus on the frets"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Antonio Labbe",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T19:12:57.000Z",
          "Titre": "I like the Price and friendly service",
          "Contenu": "I like the Price and friendly service. I am indifferent of the service. I don’t see a reason to choose Music Store live of other places. I don’t feel that I have a personal sales person who is graying to actively help me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gabrielle C.",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T21:54:29.000Z",
          "Titre": "Not carefully packed for shipping.",
          "Contenu": "Fast shipping and the items were what I ordered. I received my two guitar pedals in a padded envelope, no box, just their original packaging. In fact one box got crushed during shipping. Since the boxes have the same graphics of the pedals I would have liked keeping the boxes intact. Luckily they seem to work.The price was good as well but disappointed on how they sent the products, I am a little doubtful that I would place another order with them again for this reason."
        },
        {
          "Note": 3,
          "Lieu": "CL",
          "Pseudo": "Gino Mikanovic Parodi",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T21:59:14.000Z",
          "Titre": "after the sale...",
          "Contenu": "In the sales process I have nothing to comment... but in the after sale a disaster... I never had help from the seller again... it shows that he only wants to sell and then does not help the clients."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony (Mobile, AL)",
          "Nb_Reviews": 2,
          "Date": "2020-08-21T17:17:25.000Z",
          "Titre": "Great Sales - Slow Delivery.",
          "Contenu": "I wish you had a rating for Sales and product information I would give 5 stars.For delivery of product I would give 1 star.Based on my conversations with my sales person I was lead to believe that your distributor had the guitar I wanted in stock and that it would take a week to 10 days to receive my order. almost a month later no guitar.  I will give  this another two weeks and still no guitar then I will cancel the order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2019-12-11T04:20:17.000Z",
          "Titre": "Unique selection, but",
          "Contenu": "They carry a unique selection of gear. No sales tax and free shipping is a plus. I recently ordered a hugh end guitar and the case was locked. Called the sales department and only got a \"well you will need to pick the lock\". Never had that happen before. Also no trem arm in the case, gotta buy it separate.  Left a VM about it, 8 days later still no response.  May buy from them in the future but will be very cautious. Shame."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-02-10T18:29:18.000Z",
          "Titre": "The transaction was fine, but the guitar...",
          "Contenu": "The actual process of buying the guitar was easy and the price for the instrument was the best I found online  (G&L Tribute Bluesboy).  The instrument however was not properly setup, not even close; there was zero relief and, well it was a mess and the electronics were bad too ( not fault of music store, but bad G&L quality control).   A couple hundred dollars later I got the guitar set up and working properly.  Good thing I didn't pay full price for it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chuck Collins",
          "Nb_Reviews": 2,
          "Date": "2019-11-23T20:09:51.000Z",
          "Titre": "I'm going with a middle of the road…",
          "Contenu": "I'm going with a middle of the road review as the return policy can't be beat (30 days and shipping covered both ways); however, I had to utilize such due to a guitar being sold as 'new' when in actuality it was a 'demo'."
        },
        {
          "Note": 3,
          "Lieu": "BA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-10-21T18:29:38.000Z",
          "Titre": "They where very helpful and fast",
          "Contenu": "They where very helpful and fast ,  but send me a wrong order , I wanted a SP 500 jacks and 2319 mogami cable and got it a SP 400 and 2314 mogami, in the end it was to much hustle  to send it back from my country"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 3,
          "Date": "2020-04-11T03:36:04.000Z",
          "Titre": "Shop in person or elsewhere.",
          "Contenu": "My experience was only OK. Strongly suggest shopping in person to make sure gear is in acceptable condition. Stuck with some issues I’ll have to deal with. Had better luck elsewhere."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 3,
          "Date": "2022-02-11T17:05:15.000Z",
          "Titre": "Hassle free returns",
          "Contenu": "Hassle free returns? Nope not a thing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-04-27T02:14:39.000Z",
          "Titre": "It says that A full set up would be…",
          "Contenu": "It says that A full set up would be done but I had to pay $75 at a local guitar shop in order for a set up to be done once I got the guitar."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 3,
          "Date": "2018-03-07T19:10:45.000Z",
          "Titre": "Disappointed",
          "Contenu": "The guitar was shipped quickly and packaged properly. After opening the guitar, there was a checklist included from Music Store Live where certain items were checked off as being checked prior to being shipped such as functionality of the guitar, set up, etc. I had asked for the guitar to be set up with .09 strings. It was not. Also, the 5 way switch was not even functional. I find it hard to believe it quit working during shipment but it was never checked. Also the set up was almost unplayable. I had to take the guitar to my own repair shop to have the switch changed and set up. They did however tell me they would refund the cost of having the switch repaired but who wants to take a brand new $1K guitar to get fixed before it can even be played. The guys were polite and nice enough but I don’t think their “in house tech” is doing exactly what he says he’s doing. This is my third purchase from them but I’m not sure if I’ll take another chance or not. Maybe, time will tell. Again Ben was polite and wanted to make it right. It wasn’t his fault but..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-06-15T23:04:24.000Z",
          "Titre": "Claimed inventory on an item that was…",
          "Contenu": "Claimed inventory on an item that was sold out :(Had to follow up to get a refund on purchase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2017-08-04T16:21:48.000Z",
          "Titre": "Received a damaged product",
          "Contenu": "Received a damaged product. Reached out and received no help."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-03-31T01:25:04.000Z",
          "Titre": "Nice guitar for the money",
          "Contenu": "Nice guitar for the money, packaged well. Poor setup."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas Brown",
          "Nb_Reviews": 1,
          "Date": "2017-06-01T21:10:00.000Z",
          "Titre": "Guitar arrived with rusty strings!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-07-14T22:38:41.000Z",
          "Titre": "alright I guess"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Sharp",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T03:52:52.000Z",
          "Titre": "The sales person was very helpful.  Guitar dirty upon arrival.",
          "Contenu": "The sales person was very helpful and professional.  The guitar is very nice.I don't like to complain, but if you want an honest assessment, okay.  When I received the guitar, it had finger print smudges all over the top.  So much so, that I was not sure the guitar was not a demo which the sales person told me the guitar was brand new.  Once I cleaned the guitar, it does appear to be new.  I have never purchased a new guitar and had it show up looking like this one did.  Again, sorry to complain."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael  T.",
          "Nb_Reviews": 2,
          "Date": "2022-04-08T16:31:56.000Z",
          "Titre": "Pleasant Surprise",
          "Contenu": "My item was delivered in a reasonable amount of time and in good condition. However, there were no updates issued in regards to its shipping status and therefore I was pleasantly surprised to see it in my mail on the day that it arrived. The initial and only email about shipping stated that the item was awaiting pick-up from the carrier."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KRz",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T01:07:55.000Z",
          "Titre": "Good overall experience with the…",
          "Contenu": "Good overall experience with the purchase. Only issue was that the guitar toggle switch wasn’t covered up and was pushed through the box during shipment and got slightly damaged."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brendan R.",
          "Nb_Reviews": 4,
          "Date": "2023-03-10T21:30:33.000Z",
          "Titre": "I stumbled across the ebay store for…",
          "Contenu": "I stumbled across the ebay store for Music Store Live and ordered some D'addario strings from my 12 string Fender. Included were a couple free guitar picks. I happened to grab one today and fell in love with the pick! I couldn't find any of the 'free' picks on line so I chatted with Ben via the website and he went out of his way to make sure I could get some of the correct picks! This is real customer service! Music Store Live has my business!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles Roberson",
          "Nb_Reviews": 1,
          "Date": "2022-05-19T20:50:14.000Z",
          "Titre": "Your prices are hard to beat!!!",
          "Contenu": "Your prices are hard to beat!!!!  Customer service as well. Ben is great people.  i have only 2 real issues. 1st, the time it took to get the order in. No real fault of the company however, I was initially told it would be in,..in January.  I didn't get it until late April. That was extremely frustrating. The other issue is that most guitars are already setup out of the box. An initial setup would have been nice. I also had a slight problem with the instrument itself but a friend of mine was able to correct the problem with no way fare. It's been performing flawlessly."
        },
        {
          "Note": 4,
          "Lieu": "CR",
          "Pseudo": "Kaylor Molina",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T16:51:02.000Z",
          "Titre": "The guitar arrive in good condition and…",
          "Contenu": "The guitar arrive in good condition and timely. I am not giving 5 starts because the setup wasnt completely accurate, I had to take it to my luthier to finish the setup of the bridge."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony Harrison",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T20:20:56.000Z",
          "Titre": "You had what I was looking for at a fair price",
          "Contenu": "You had what I was looking for at a reasonable price and shipped quickly.  My only criticism is that my sent email was apparently ignored and never responded to."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Darrell Steely",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T14:35:53.000Z",
          "Titre": "Good transaction."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J.A.",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T22:04:46.000Z",
          "Titre": "The guitar is great…but",
          "Contenu": "The guitar is great, but the neck pickup was collapsed when it arrived. For a guitar that wasn’t “cheap,” this was a bit disappointing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sammy Abdala",
          "Nb_Reviews": 3,
          "Date": "2022-08-22T16:58:25.000Z",
          "Titre": "Customer service was great",
          "Contenu": "Customer service was great. Was able to make an exchange return happen and corrected any problems that arose afterwards."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joel Dalangin",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T21:36:42.000Z",
          "Titre": "Great price",
          "Contenu": "Great price. Quick delivery"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "candidsounds",
          "Nb_Reviews": 1,
          "Date": "2021-10-18T17:18:32.000Z",
          "Titre": "Excellent bass at a very good price, but better packing next time.",
          "Contenu": "Excellent bass at a very good price.  Dinged them one star because it was not very well packed for shipping - one little piece of bubble wrap in the box (and the guitar was in a gig bag, not a hard case).  When FedEx dropped it off there was a large hole in the box, as if a forklift had speared it.  I held my breath as I opened the box and fortunately the bass was fine.  I got lucky this time, but better boxing would help the inevitable issues caused by shippers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "roger rodgers",
          "Nb_Reviews": 1,
          "Date": "2021-07-02T23:27:26.000Z",
          "Titre": "I was really happy to find a place that…",
          "Contenu": "I was really happy to find a place that had the Sire Marcus Miller P10 in stock. I inquired about whether it came with a gig bag, got a quick and friendly response, \"the bass does not come with a bag, but how about $70 off?\". But, I made the order late the night before. So I asked if maybe you could split the difference, throw in a set of strings? Got another quick response..\"we can do that, what kind do you want\"? But did not get the strings. Long story about giving 4 stars instead of 5!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Wilson",
          "Nb_Reviews": 1,
          "Date": "2021-04-12T16:35:12.000Z",
          "Titre": "Mayones 5 string Jabba",
          "Contenu": "Mayones 5 string Jabba I really enjoy the bass from Mayones!  Sound is amazing, playability is fantastic, and of course beautiful!  That said the set up left a LOT to the imagination.  I ended up having to adjust the truss rod, bridge, saddle screws to get it to playability.  Overall I really enjoy the bass....was hoping that a $3,7k bass would be a little more ready to go.  On a plus side...shipping was super fast and the bass was really well taken care of.  I had a few questions about the bass with MusicStoreLive took care of very quickly!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Robert Christopherson",
          "Nb_Reviews": 2,
          "Date": "2019-01-19T02:03:25.000Z",
          "Titre": "Satisfied with this dealer and the product.",
          "Contenu": "Original contact had quick response and pleasant dealings. The first deal was suppose to include an instrument setup by their tech and a gig bag, neither of which materialized, but the deal on the product itself made up for these missing items. I was able to do the setup myself and found a hard case rather than a bag. Good people to deal with though their tech could have caught a couple of things had they checked the item before shipping."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-04-12T23:54:42.000Z",
          "Titre": "A Great Deal for a Great product",
          "Contenu": "Simple transaction and everything showed up in great condition. The only thing is that they did split my shipment up into two deliveries and there wasn’t much communication or details as to which items were being delivered for each delivery. Other than that, it was a great deal and I would use them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2017-06-11T06:55:44.000Z",
          "Titre": "Good experience",
          "Contenu": "Good experience, got the guitar I wanted and it worked well. Would've liked to talk to someone that had played the guitar and had it come set up as the site claims, but this guitar was an older model in a previous warehouse so it did not get the setup but I'm not too upset about it.  Phone call with them before purchase was good, would like to have a few more interactions before I can rate 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Moreau",
          "Nb_Reviews": 1,
          "Date": "2017-06-05T12:03:07.000Z",
          "Titre": "I have dealt with a number of folks at …",
          "Contenu": "I have dealt with a number of folks at Musicstorelive and all have been very helpful and very accommodating.  I am lucky enough to live in the area and have been able to go to their facility to have work done on several guitars as well as pick up the guitars purchased there.  Their employees all seem to be players or musicians themselves and experts when it comes to helping or assisting with info or servicing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael A",
          "Nb_Reviews": 2,
          "Date": "2017-06-02T17:36:40.000Z",
          "Titre": "Good, but would have like more info.",
          "Contenu": "Service was fast, pricing was fair. I would like to have been informed of the merger with another e-retailer and the my item was shipping from San Diego rather than VT. My item arrived in time, and in good working order, but it might not have.  I would much prefer to have been informed of the shipping origin, rather than to have to question it after receiving the tracking info."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jimi",
          "Nb_Reviews": 2,
          "Date": "2019-11-20T17:11:23.000Z",
          "Titre": "Great price and customer service, poor website sales.",
          "Contenu": "I was unable to complete an order via website or instagram link on my iPhone or my Windows PC. After it was left loading each attempt- my paypal had charged each time as a pending charge that took 4 days to return to no charge. After contacting customer service they were thorough and prompt in resolving the order issue and delivering the product on time. I believe it wasn’t directly their fault for the web issue, rather the web host has issues as I order from many other companies without issue all the time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "tomc",
          "Nb_Reviews": 2,
          "Date": "2017-06-01T21:08:40.000Z",
          "Titre": "Very good,  but be careful",
          "Contenu": "Instrument though new was handled let's say. They did do a setup which was decent though i still did a relief action tweak myself later. If I hadn't asked and gotten a deep discount i may have been annoyed at an instrument being sold as virgin which wasn't. But I suspected as much and it is a very good instrument so it's all good in the end."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2017-11-07T22:31:25.000Z",
          "Titre": "The service was good but",
          "Contenu": "The service was good, the guys were nice on the phone, and the setup was good, but I felt the color was misrepresented in the photos. There were a lot of photos up for this guitar and the color was consistent throughout all of them. However, the actual guitar itself is much much darker!! I thought it was a different guitar when I first pulled out out of the box. Anyways, I'll keep it because it's stil a nice guitar, but it was not the color I was expecting."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KEWaters",
          "Nb_Reviews": 1,
          "Date": "2020-04-10T22:48:03.000Z",
          "Titre": "Perffect . . . except",
          "Contenu": "For the only bad: This would have been 5 stars, but when I opened the case, it looked like the 3-way switch was broken.  On further inspection, I found that the switch tip had been screwed on crooked, cross-threaded, and stripped.  I needed to purchase a new tip to replace the ruined one.  Not happy about that, but pleased the 3-way still worked.For the good: An excellent guitar for a great price, and a pleasure working with these guys.  They responded promptly, and shipped quick, even when they were under California's lock-down of non-essential people."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A satisfied customer",
          "Nb_Reviews": 1,
          "Date": "2019-01-09T17:46:24.000Z",
          "Titre": "Excellent Music Store - Ben is The Man!",
          "Contenu": "Overall I had a great experience with Music Store Live. The sales rep I dealt with, Ben, was incredibly helpful, and was quick to answer questions, send me additional pics of the guitar, and give me hands-on and honest feedback about the sound of the models I was looking at. He may be the best sales manager at any guitar store I’ve shopped at - just a pleasure to deal with. They also have a great return policy and fair pricing.  I am only docking them a star because my refund took a LONG time to get back, but that was partially Paypal’s fault."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Renard Flora",
          "Nb_Reviews": 1,
          "Date": "2018-04-05T23:34:27.000Z",
          "Titre": "Good prices and service",
          "Contenu": "Good prices, fast service. Guitar came shipped well packed. I purchased an acoustic electric - the one problem I had was the tape that holds the internal wiring in place was dry and was no longer sticky enough to hold the wires in place so they are hanging, visible through the sound hole. I'll have to wait until I change the strings to change the tape. It's minor but I feel like this should have been caught in the set up and inspection before it was packed and shipped. It's not worth a full point rating, I would rate 4&1/2 stars if I could."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric Yee",
          "Nb_Reviews": 1,
          "Date": "2021-07-13T22:25:45.000Z",
          "Titre": "Great Guitar",
          "Contenu": "Great Guitar, person said it was inspected but neck was a little off... Notes were choking out and had to re-ajust. Not a big deal, but would of rather them not say it was strait from factory than saying it was inspected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eddie Ramirez",
          "Nb_Reviews": 3,
          "Date": "2021-08-24T14:14:48.000Z",
          "Titre": "So far, so good…",
          "Contenu": "I started a process which is not complete yet, but so far it has been simple and painless. The chat feature was very helpful in this particular situation and I’m looking forward to completing this transaction."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David McCann",
          "Nb_Reviews": 1,
          "Date": "2019-10-13T17:29:38.000Z",
          "Titre": "MusicstoreLive is Good...Fedex not so",
          "Contenu": "Bought a sensational guitar at a very good price...the only problem with the whole transaction was the Fedex Home Delivery and sig required thing..Fedex is the absolute worst carrier out there from the customer's standpoint. I do understand the advantages they offer from a seller's point of view. I have made it a personal policy not to buy anything from anyone who uses Fedex for the delivery..I let my guard down on this purchase, and guess what? The guitar comes a day late, after I took time off work to be home and sign for the delivery...this seems to be the case nearly 100% of the time with Fedex in my area...I hate them"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nicole Applegate",
          "Nb_Reviews": 1,
          "Date": "2018-05-16T12:44:32.000Z",
          "Titre": "Easy, Swift Purchase.  Deceptive Listing...",
          "Contenu": "Easy purchase.  Shipped fast.  Packaged well.  Deceptive product listing, but the guitar is still very nice.  My husband was pleased with it.  I erroneously believed the guitar I was getting would be the exact one in the photo.  It was just a stock photo though and the one I got was not even close in gorgeous wood grain to the one shown in the photo.  Wish they had posted several different wood grains and noted that it would be at random.  Instead they had every possible angle of the gorgeous guitar, but that's not what I received at all.  My bad I guess.  But shame on you for not being transparent about that.  Oh well.  Company did great otherwise.  :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-06-12T05:06:01.000Z",
          "Titre": "Fast Shipping",
          "Contenu": "I originally wanted to buy the Sire Marcus Miller V7 4 string bass but it was out of stock for a long time. I decided to get the V3 instead based on good reviews. I got the guitar in just a few days after ordering."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-13T18:44:57.000Z",
          "Titre": "The guitar setup was perfect",
          "Contenu": "The guitar setup was perfect, finish is perfect, but it is visibly a store sample item, string, fret and bridge saddles have visible trace of time and usage. But, I'm still quite satisfied."
        },
        {
          "Note": 4,
          "Lieu": "GH",
          "Pseudo": "Tom Nini",
          "Nb_Reviews": 5,
          "Date": "2020-09-22T12:58:04.000Z",
          "Titre": "Good service and i really love their…",
          "Contenu": "Good service and i really love their services but i do recommended Excellent store and serviceAwesome service and helped me get the right product in speedy times. try it now exaltin.com"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer Damian G.",
          "Nb_Reviews": 1,
          "Date": "2019-11-04T23:01:04.000Z",
          "Titre": "Sire M7",
          "Contenu": "Packing looked good ,bass looks good.However bass would need a full set up there’s buzzing on all strings ,not what you expect for the kind of money spent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sam Hurley",
          "Nb_Reviews": 1,
          "Date": "2020-10-25T14:24:36.000Z",
          "Titre": "Great",
          "Contenu": "I used this site when I was looking for a present for my brother. I like the way you support service works. I got an instant reply."
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "pemburu RECEH",
          "Nb_Reviews": 2,
          "Date": "2020-02-17T07:59:34.000Z",
          "Titre": "Music that is less animating",
          "Contenu": "Music that is less animating, because the music created must be able to animate a vocalist so that listeners can receive the music well"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2021-09-01T23:21:39.000Z",
          "Titre": "There was a  scuff on the back of my…",
          "Contenu": "There was a  scuff on the back of my PRS CE 24 that was not disclosed.  Overall, however, this was a decent experience."
        },
        {
          "Note": 4,
          "Lieu": "GH",
          "Pseudo": "ecart gh",
          "Nb_Reviews": 2,
          "Date": "2020-10-14T12:24:09.000Z",
          "Titre": "so great service but i recommend…",
          "Contenu": "so great service but i recommend exaltin.com to every Artist they are doing a great service interns of music sale and promotion."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aieramix",
          "Nb_Reviews": 2,
          "Date": "2020-08-17T18:41:20.000Z",
          "Titre": "Finally found here the model I was…",
          "Contenu": "Finally found here the model I was looking for so many years. Glad that some businesses still encourage arts over material things"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 4,
          "Date": "2021-07-09T20:54:54.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience. Highly recommend Music Store Live! Great Communication. I would rate this 4 1/2 stars if I could."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customerSteve Parish",
          "Nb_Reviews": 1,
          "Date": "2019-11-06T18:29:21.000Z",
          "Titre": "Guitar was back ordered for 90 days so…",
          "Contenu": "Guitar was back ordered for 90 days so cancelled order but Ben Anderson was helpful through the whole process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-04-16T18:10:06.000Z",
          "Titre": "They have been great with letting me…",
          "Contenu": "They have been great with letting me know the status of my order.   I will be buying from them again soon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew Nguyen",
          "Nb_Reviews": 1,
          "Date": "2021-07-14T20:45:29.000Z",
          "Titre": "I would like to have more frequent…",
          "Contenu": "I would like to have more frequent update on the shipping status. Otherwise everything is great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chad",
          "Nb_Reviews": 1,
          "Date": "2020-05-10T02:52:45.000Z",
          "Titre": "Great experience",
          "Contenu": "Great communication on shipping, fair price and fast shipping.  Great shopping experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James G",
          "Nb_Reviews": 3,
          "Date": "2020-08-04T00:00:05.000Z",
          "Titre": "Very Painless Purchase",
          "Contenu": "The purchase process was very painless and my order was delivered on time without issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Avery",
          "Nb_Reviews": 2,
          "Date": "2017-11-13T19:47:13.000Z",
          "Titre": "Good company",
          "Contenu": "GOT a good deal on amp because it was delivered damaged but it should have been packed better"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jon Jurgensen",
          "Nb_Reviews": 7,
          "Date": "2020-06-20T14:50:06.000Z",
          "Titre": "Good products and pricing",
          "Contenu": "Good products and pricing.  The shipping was slower than I expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-08-27T01:23:00.000Z",
          "Titre": "Ordered some bass strings",
          "Contenu": "Ordered some bass strings, received said bass strings, no problem!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-12-03T06:02:02.000Z",
          "Titre": "Very pleased with my order",
          "Contenu": "As was promised my guitar arrived with a free setup. Nice low action"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Harrison",
          "Nb_Reviews": 1,
          "Date": "2021-06-30T19:21:57.000Z",
          "Titre": "Schecter Banshee Bass",
          "Contenu": "So far so good.  Bass required some set up when it arrived"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joshua Cockey",
          "Nb_Reviews": 1,
          "Date": "2021-09-29T19:08:43.000Z",
          "Titre": "Good price",
          "Contenu": "Good price, good job. Will do business again. Thanks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peter Ragona",
          "Nb_Reviews": 4,
          "Date": "2021-10-22T15:44:58.000Z",
          "Titre": "It has a wide variety of instruments…",
          "Contenu": "It has a wide variety of instruments and gear"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edgar",
          "Nb_Reviews": 3,
          "Date": "2018-08-10T11:49:37.000Z",
          "Titre": "Good overall experience...on time…",
          "Contenu": "Good overall experience...on time shipment...thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-03-01T20:01:50.000Z",
          "Titre": "Good company",
          "Contenu": "Good company; Wanted to make my return go right."
        },
        {
          "Note": 4,
          "Lieu": "UA",
          "Pseudo": "Jane",
          "Nb_Reviews": 3,
          "Date": "2019-10-30T12:37:42.000Z",
          "Titre": "Good",
          "Contenu": "Actually, they are good! Highly recommend."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Louise Morris",
          "Nb_Reviews": 22,
          "Date": "2021-09-24T05:56:52.000Z",
          "Titre": "They have the classic songs too"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-06-21T16:53:20.000Z",
          "Titre": "Service was as expected"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Crash Morales",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T03:54:38.000Z",
          "Titre": "Trustworthy store for high-end gear",
          "Contenu": "I’m a repeat customer. I browse Music Store Live’s  exquisite inventory every now and then. Every time I have made a purchase it has been smooth, uneventful, and I’ve been very satisfied with my purchase. The one time when I wasn’t entirely satisfied (customer error, I didn’t know what “relic guitar” meant and I got myself one), the return was super easy.Once I realized my mistake, I called the store, I explained my situation, and within 5 minutes they had issued my RMA.I strongly recommend this store. I look forward to do business with them in the future again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "vegas johnny",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T05:08:23.000Z",
          "Titre": "great deal",
          "Contenu": "love my new epiphone starling. possibly the best neck of any acoustic ihave played. got a great deal on it for cyber monday as well.i would definitely shop at music store live again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas Stedtfeld",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T15:13:29.000Z",
          "Titre": "Excellent Service",
          "Contenu": "Super fast shipping. Everything arrived pristine which is important when spending $. Quick response from their team when I had a few questions when trying to make my decisions. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gorilla",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T01:25:26.000Z",
          "Titre": "Great experience!",
          "Contenu": "Price was excellent, shipping was fast, guitar packed well and made it safely!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Tommy S",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T06:52:54.000Z",
          "Titre": "Good All Around!",
          "Contenu": "Great customer service, fast shipping and good variety of products. Pricing is fair and just."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roselily Braun",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T00:58:17.000Z",
          "Titre": "Love the store.",
          "Contenu": "When I called for information about the product they were very helpful and patient with me, gave me good and accurate information. The product has a really good sound quality for its price and arrived on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benjamin",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T07:42:27.000Z",
          "Titre": "I got a guitar through Music Store…",
          "Contenu": "I got a guitar through Music Store Live. It came damaged with a crack in the back of the guitar and a cracked knob.I returned the guitar and apparently it got damaged again through FedEx on the return.Their returns/tech people blamed me and tried to put this all on the customer, when in reality it was an issue with how FedEx treats their packages. The return/tech people were stubborn and hard headed.However, Fernando Fajardo, who was the head of this, was great and so understanding, and sent a replacement without question.Sometimes, as the customer you need to speak up when you're not being treated fairly. It doesn't always make you a Karen.If you are an honest person, I doubt you will have a bad time going through Fernando. He's a good man."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Rey",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T09:12:13.000Z",
          "Titre": "Custom ordered Skervesen Raptor",
          "Contenu": "From the beginning of the process to the end, it was great and seamless. The individual, Ben, who assisted me with this was extremely patient and understanding. There was a lot of back and forth as this was my first custom order, never ordered anything custom prior to this, but after this experience I know exactly who and where to go for my custom guitars as this isn’t my last customer order I’ll be placing. Thank you Ben!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brutus!",
          "Nb_Reviews": 3,
          "Date": "2023-09-04T22:05:44.000Z",
          "Titre": "Great place to deal with.",
          "Contenu": "As in the past, MSL has been able to put the guitar I want in my hands within my budget. However, there is still no history of previous purchases that I've made showing up in my acct, also I have never received a guitar within two days, usually at least a week. Other than that, great place to buy from.  Thanks. Bob"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James G.",
          "Nb_Reviews": 4,
          "Date": "2023-06-27T21:54:29.000Z",
          "Titre": "Great, Easy Service! A+",
          "Contenu": "I had been researching a specific Martin guitar for some years and there were none available in my local market. I found it online at MusicStoreLive. After emailing the store directly, Ben got back to me within an hour and after answering a few more of my questions, we had worked out an agreement to purchase the guitar by that afternoon. I needed it for my sister's wedding and he got it to me ASAP. If I lived in CA, this would be my local shop! I would do business with them again."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Lance Nuckolls",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T01:21:20.000Z",
          "Titre": "good communications",
          "Contenu": "good communications, willing to work with me on pricing, quality instrument and perfectly setup."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul mccary",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T14:27:38.000Z",
          "Titre": "Fabulous company",
          "Contenu": "Ben and his team gave me the deal of the century I am very pleased with my purchase. Music Store Live is the best I will make my next purchase thur this company Spectacular customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S. Choate",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T23:59:16.000Z",
          "Titre": "Excellent First Purchase Experience",
          "Contenu": "Customer service was superior. The Loar mandolin I purchased arrived with an excellent setup. I didn't have to do a thing. Shipping was speedy and right in between Christmas and New Years to boot. I haven't had any previous experience with Music Store Live, but their level of service far exceeded what I'm used to with the big online retailers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roy Gaber",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T21:12:29.000Z",
          "Titre": "I had an urgent need for a Sire T7 and…",
          "Contenu": "I had an urgent need for a Sire T7 and MSL had availability.  Something went wrong with the order and I would not be receiving it in time.  MSL went out of their way to overnight one to me.  What fantastic service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J Wallach",
          "Nb_Reviews": 3,
          "Date": "2023-05-05T16:37:53.000Z",
          "Titre": "Always a great experience with Music…",
          "Contenu": "Always a great experience with Music Store Live! They stand behind their goal of bringing the store to the customer. Fantastic in-stock selection, easy and transparent free return process, and excellent advice on the instruments. Ben has assisted me with several purchases, really helpful. He personally played my newest bass, Sadowsky Metroline Limited Edition, so could talk about the instrument. Not an assembly line type of process at all.Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bud",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T20:45:06.000Z",
          "Titre": "Great online shop!",
          "Contenu": "With all the scams out there, I was skeptical to try MSL, but after a little research I decided to take a chance. No regrets here! Contacted them about a limited addition Gretsch, verified they had it and bought it along with another instrument. Both shipped out lighting fast arrived in perfect condition as promised. I will use them again with no worries. Great job MSL!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Uhrey",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T22:49:43.000Z",
          "Titre": "Amazing service",
          "Contenu": "Amazing service. Worked with me the entire way. Shipping went great. Guitar was setup nicely and is absolutely beautiful both in looks and sound. Great experience all around."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Francis",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T03:23:42.000Z",
          "Titre": "Awesome Hendrix Stratocaster",
          "Contenu": "An employee made me aware of a sale on my preferred color of reverse headstock Stratocaster. I appreciate not having to settle in order to get the best price. The guitar is even better than I expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug Burnette",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T18:00:04.000Z",
          "Titre": "The team had my BN5 spec’d perfectly",
          "Contenu": "The team had my BN5 spec’d perfectly, and delivered next day in time for my next day bus call out of Nashville.  My drummer said “dude that bass has sounded like sweet banana pudding in my ears all weekend”.  Thanks to all from the Crabb Family band"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shun Takano",
          "Nb_Reviews": 3,
          "Date": "2022-04-14T15:13:59.000Z",
          "Titre": "Great store for musical gear",
          "Contenu": "MusicStore Live is a great store to purchase musical gear from. I recently ordered a guitar and a gig bag. They shipped quickly and the items arrived nicely packed and safely. There was a problem in that the gig bag did not fit the guitar. I contacted the store and they immediately sent out another one (which fit perfectly). So, they are serious about after-sales service also. I have purchased numerous gears from them and will continue to do so. They have great selections and price as well as a knowledgeable sales staff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Jones",
          "Nb_Reviews": 1,
          "Date": "2022-08-12T01:42:05.000Z",
          "Titre": "A Guitar Delivered Perfect",
          "Contenu": "Guitar was delivered right on time, communication was excellent. They said that a tech would go over it, set it up and it happened, the guitar was perfect out of the box! The little envelope holding the hex key had been opened and taped shut, and I knew the neck had been adjusted. This guitar plays like a dream. I also appreciated the nice discount on the website. I will definitely shop with you again. This guitar was exactly what I wanted at a very reasonable price. Free shipping was another bonus. Can't say enough good about this deal and the vendor."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Atkins",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T17:55:15.000Z",
          "Titre": "These guys are great!",
          "Contenu": "These guys are great! I wanted to purchase a left handed Fender Jazzmaster but I learned to play on a right handed guitar (cursed like Albert King, Dick Dale, etc.). Music Store Live setup my new lefty as a righty with my choice of strings! It plays like butter and sounds beautiful.  Great service, fast shipping and they have a HUGE selection. I couldn’t be happier with them. MSL is my go to guitar store from now on.Thanks guys!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARCK CARTER",
          "Nb_Reviews": 5,
          "Date": "2022-05-04T13:05:41.000Z",
          "Titre": "It is all good.",
          "Contenu": "This was my first purchase from the Music Store Live. I purchased a high end CD recorder/player (Tascam RW900MKII). This is a replacement for my older one that failed after 7 years of use (CD recorders have relatively shorter lives than other hi-fi equipment). It is an excellent piece of equipment that results in exceptional sound quality. The price was the best I could find, their assistance was first-class, and delivery was within days. I am very satisfied with this experience and will consider the Music Store Live for future purchases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan  Spatafora",
          "Nb_Reviews": 2,
          "Date": "2023-07-19T22:37:27.000Z",
          "Titre": "SATISFYING EXPERIENCE !",
          "Contenu": "When I first inquired about the item I was interested in I received prompt and good communication via E-mail. After the purchase was completed a bit later I received free shipping, it arrived on time and was in perfect condition."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Ashrith kota",
          "Nb_Reviews": 1,
          "Date": "2022-05-23T07:27:25.000Z",
          "Titre": "One of the most satisfying online…",
          "Contenu": "One of the most satisfying online shopping experiences I've ever had. This business guarantees that you will be pleased with your purchase. They offer free shipping both ways and a no return policy if you're not happy. I was able to thoroughly test an instrument in the comfort of my own home, without the usual pressure and interruptions associated with music stores. The staff is extremely knowledgable and polite, and they will gladly answer any questions you may have regarding their products. I've always been hesitant to buy an instrument online, but with these company, you don't have to be."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas Kline",
          "Nb_Reviews": 2,
          "Date": "2022-09-19T16:47:57.000Z",
          "Titre": "We'll be doing business again!!!",
          "Contenu": "Ben quickly responded to my email and accepted my offer for a new electric guitar. The order was shipped quickly and in the original box. The guitar arrived in excellent condition and after stretching the strings it's been hard to put down. It's now my #1."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Armando Estrada",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T19:39:14.000Z",
          "Titre": "Ordered my Tascam Model 12 B-Stock and…",
          "Contenu": "Ordered my Tascam Model 12 B-Stock and was totally blown away at the awesome discounted price.  I chatted with Ben, and he went the extra mile to ensure I got what I needed in price and product! Was such a blessing to deal with Ben and they completely came through!  Got my Model 12 in record time, was packaged like it was going to the moon! 😆 The Model 12 was like new even though it said it was B-stock. I guess the imperfections on the box caused them to have to sell it as B-stock but I was completely grateful and satisfied!I am loving my Tascam Model 12 and I would absolutely in a heartbeat recommend Music Store Live to any musicians out there! Sincerely,MM4C Musicman4christ"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glenn Lawson",
          "Nb_Reviews": 2,
          "Date": "2022-05-24T20:48:58.000Z",
          "Titre": "I ordered my Fender Meteroa guitar…",
          "Contenu": "I ordered my Fender Meteroa guitar online on a Sunday,  and I received it early Tuesday morning! Outstanding service. When I opened the gig bag the guitar inside was nothing less than beautiful. It was setup nice and it was even in tune. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 2,
          "Date": "2022-04-12T14:51:23.000Z",
          "Titre": "Music Store Live is always a pleasure…",
          "Contenu": "Music Store Live is always a pleasure to deal with.   They provide quick responses to questions and get you setup with the right item quickly.I work normally work with Ben Anderson, but I am sure the whole group operates under the same high standards."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T23:55:07.000Z",
          "Titre": "Ben is stellar",
          "Contenu": "Ben went above and beyond the entire way. I had some issues with a guitar that was purchased, but he made sure everything was addressed. Will be coming back to purchase more from MusicStoreLive in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle",
          "Nb_Reviews": 1,
          "Date": "2022-04-14T00:02:23.000Z",
          "Titre": "Glorious Sound Desk Pro",
          "Contenu": "I was looking to get a light studio fest for the small place I am in currently. MusicStoreLive went above and beyond to make sure I got the desk I needed. Landed on the Glorious Sound Desk Pro and they had the best price and shipping was far quicker than expected!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria Sollon",
          "Nb_Reviews": 1,
          "Date": "2022-04-14T19:55:53.000Z",
          "Titre": "Couldn’t be happier",
          "Contenu": "Couldn’t be happier! I’ve been waiting to find the right piano that would work for me. I reached out to customer support to ask questions and received immediate help- which helped me make my decision! I’m very happy with the product, the support received, and for finding this company! Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Huber",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T21:34:07.000Z",
          "Titre": "Great place to buy a guitar.",
          "Contenu": "The people there are really helpful and nice. Got a big 10 percent discount on a PRS Special Semi-Hollow Core Model.  I saved a lot."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cody Rasmussen",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T17:29:37.000Z",
          "Titre": "They were fast!",
          "Contenu": "They were fast, friendly and shipped within less than 3 days and was willing to match an offer from another Music Store who was currently out of stock - 10/10"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dominick Allison",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T03:21:39.000Z",
          "Titre": "Happy with the service",
          "Contenu": "I ordered a set of bass stings for my seven string bass. while installing them the G string broke. I called you store with the problem, and despite ur store having nothing to do with the quality of the these products, you associate took care of the problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "chris y",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T16:51:22.000Z",
          "Titre": "First time customer",
          "Contenu": "MSL did a good job. My inquiries re the product were promptly and professionally handled, and I received my purchase well packaged and on time. Can’t ask for more than that. I’m not big on writing reviews but these folks deserve a thumbs-up."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Aleksander Lantukh",
          "Nb_Reviews": 1,
          "Date": "2022-06-06T14:59:57.000Z",
          "Titre": "Great shop and it ships to Europe (Poland).",
          "Contenu": "Found this shop  by accident from some noname youtube channel when I was trying  to find where to buy a particular guitart I wanted and it was great. They ship to  Poland  and the order was processed  immediately. I've  already  received my  guitar and enjoying it :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B B",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T17:28:45.000Z",
          "Titre": "Excellent prices and customer service",
          "Contenu": "The US Mail misplaced my order for a few days - even though Music Store Live had done everything right on their end. Ben at MSL was right on top of it and even offered to resend if it was lost for good. Luckily, it eventually arrived and works perfectly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcus E.",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T05:46:28.000Z",
          "Titre": "Found the guitar I’ve been looking for…",
          "Contenu": "Found the guitar I’ve been looking for for a long time. Not only was I happy to find it, but they gave me a price I couldn’t pass up. They were very responsive to emails and my guitar arrived in perfect condition. All aspects of working with MSL exceeded my expectations!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Kennedy",
          "Nb_Reviews": 2,
          "Date": "2023-05-14T22:44:36.000Z",
          "Titre": "I ordered some speaker cables so I…",
          "Contenu": "I ordered some speaker cables so I could use an attenuator on my older Fender amps. Music Store Live sent me exactly what I needed and I was able to mod my amps."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Greenough",
          "Nb_Reviews": 1,
          "Date": "2022-05-26T19:10:39.000Z",
          "Titre": "Sire S7",
          "Contenu": "The Sire S7 I ordered was delivered per schedule, in great shape, in beautiful Sherwood Green color, and indeed had been set up prior to shipping to me. Great job, Music Store Live!"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Ismael_J_G",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T20:02:42.000Z",
          "Titre": "Excellent service and prices...",
          "Contenu": "Excellent service (Ben Anderson). The variety of products and prices are very attractive. I am very grateful for the care with packaging and shipping. Tks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antonio A",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T05:47:42.000Z",
          "Titre": "Likely a repeat customer",
          "Contenu": "Great service, great communication, bass was in excellent condition after shipping. Fast shipping as well! If I’m in the market for another instrument, I’ll be checking in here to see what they got."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lane Odam",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T07:34:01.000Z",
          "Titre": "I have always had great experiences…",
          "Contenu": "I have always had great experiences with Ben and Music store live.Very communicative and  always responded to my inquiry almost immediately  and even did better than match the lowest price on all of the interwebs. Hell yea! Super willing to go the extra mile . I am now a customer for life and I highly recommend to all my friends. This is how a business should be run. My 1st purchase was  a Roland TD-27 electronic drum kit.Ben was willing to match The lowest price on the Internet.  I wanted to go with a vender in California near me so that I could get my drums sooner than later. I made an offer to Ben and he was willing to go for it and send the drums out immediately. I had them within 3 days.. Next  I ordered more goodies for my drum kit and the same great service ensued. I couldn't be more pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick H",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T23:14:21.000Z",
          "Titre": "Great experience",
          "Contenu": "The sales associate was extremely easy to work with, providing me an accurate out the door price.  The guitar was also shipped very well and was exactly what I expected.  I had Great experiece!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lenny G.",
          "Nb_Reviews": 2,
          "Date": "2022-05-03T13:29:41.000Z",
          "Titre": "Happy Camper",
          "Contenu": "The guitar I ordered came well set up as promised.  Any questions I had were answered almost immediately by email. I would have preferred to be able to get someone on the phone but that didn't seem possible. Oh well, these guys are still good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marty K",
          "Nb_Reviews": 2,
          "Date": "2023-02-13T18:20:58.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "I ordered a guitar which had a bad pickup and Music Store Live made the return procedure easy.  Very professional people that I worked with.  Will look to them again for future purchases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "michael d. hiebert",
          "Nb_Reviews": 3,
          "Date": "2022-07-20T00:58:49.000Z",
          "Titre": "I love this opportunity to say how…",
          "Contenu": "I love this opportunity to say how delighted I am to have the personal touch and great products from Music Store Live!   They handle you with such kindness and care.   Also, the musical instruments they send are the best and I really mean that too.  Special shout out to Ben, who is the greatest!Your friend,Mike"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wayne",
          "Nb_Reviews": 1,
          "Date": "2022-09-09T12:55:27.000Z",
          "Titre": "Alvarez guitar",
          "Contenu": "The guitar was sent in a timely manner, and was what I expected it to be....sounds great and looks great.  Will have to do a little fret work to get rid of sharp edges, but for $160.00 there are no complaints.The guitar had to travel from California to North Carolina and came here boxed well and undamaged.  Over all, a very good experience.  Would recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Desmarais",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T00:17:17.000Z",
          "Titre": "Great experience/Very nice folks",
          "Contenu": "Great experience. Easy to work with, item arrived quickly and in well-protected packaging. I would buy from them again without hesitation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David B",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T00:07:09.000Z",
          "Titre": "Very good communication and fast…",
          "Contenu": "Very good communication and fast shipping of our order. The price was great and allowed us to get the guitar we really wanted but was out of our budget through other stores."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T18:54:29.000Z",
          "Titre": "The immediate response to my emails",
          "Contenu": "The immediate response to my emails, the great deal on my Fender AV II Precision, and the quick shipment. Love dealing with this shop, will continue to be a buying customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phil",
          "Nb_Reviews": 2,
          "Date": "2022-05-15T19:03:29.000Z",
          "Titre": "Hard Case",
          "Contenu": "I bought an Epiphone hard case for a used flying V that was recently purchased. It fits perfectly and was delivered shortly after ordering it online. Happy camper here."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Armando Ramirez",
          "Nb_Reviews": 2,
          "Date": "2022-09-12T15:49:19.000Z",
          "Titre": "Always a Great Experience…",
          "Contenu": "I have been buying gear from MusicStoreLive for a while now. Seems I’m always working with Ben which makes it all the better.This was for a Chase Bliss Mood, however, I have purchased a Friedman Amp and tons of other gear over time. Only complaint I have is that I’m in FL and they are in CA and I just can’t run ito the store! But everything gets here well packed and very quick."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LonnieB",
          "Nb_Reviews": 1,
          "Date": "2022-10-02T23:13:15.000Z",
          "Titre": "Antelope Audio Orion 32+…",
          "Contenu": "I purchased an Antelope Audio Orion 32+ Gen 3 from Music Store Live and the service was straightforward with a good price (better than other companies demo price for a new in box version). The sales guys were timely and responsive to tech questions and the order was packed carefully, shipped quickly and arrived in perfect condition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Castro",
          "Nb_Reviews": 3,
          "Date": "2023-07-18T20:45:57.000Z",
          "Titre": "Great selection",
          "Contenu": "Great selection, fast shipping and sales make MSL an easy choice. Customer Service has been good also."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bernard Kister",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T00:00:18.000Z",
          "Titre": "Fast response on questions and supper…",
          "Contenu": "Fast response on questions and supper quick shipping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MisterKim",
          "Nb_Reviews": 1,
          "Date": "2022-06-12T01:57:23.000Z",
          "Titre": "Eastman T484 purchased last month",
          "Contenu": "First thing to say is that I'm a recreational/hobbyist guitarist -- more of a student of music/guitar at this point than a musician, so take this review with that in mind.The purchase:  My experience with musicstorelive.com could not have gone any better. The transaction was smooth, the guitar arrived in perfect condition, and communication was concise and timely. I unequivocally recommend musicstorelive.com. YMMV, but my personal experience was flawless. I've remotely purchased a number of guitars from Sweetwater and this purchase interaction with musicstorelive.com was easily on par with Sweetwater. The guitar: Intonation of the guitar out of the box was spot on. Customer rep said they do a \"setup\" prior to purchase and the guitar plays perfectly in tune, frets are silky smooth. Great guitar, great seller."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle  Polson",
          "Nb_Reviews": 1,
          "Date": "2022-07-20T21:04:49.000Z",
          "Titre": "Great Experience",
          "Contenu": "Ordering was easy; sales was very helpful and responsive, and everything went as expected! Fabulous bass. Set up perfectly. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Bowman",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T19:59:46.000Z",
          "Titre": "Fender Strat",
          "Contenu": "Love it! My first Fender. Much lighter than my Gibson LP. Was packed extremely well and received with no damage. Good company to deal with and quick responses."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Miguel Rebaza",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T02:20:10.000Z",
          "Titre": "Ben It´s  great at customer service and…",
          "Contenu": "Ben It´s  great at customer service and he helped me no matter what. Really apreciate his patient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles C",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T16:10:10.000Z",
          "Titre": "Easy exchange",
          "Contenu": "Item purchased was truly defective. The exchange process was very easy and hassle free.  Will purchase from them again without concerns."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Walden",
          "Nb_Reviews": 2,
          "Date": "2023-07-15T22:48:12.000Z",
          "Titre": "Competitive pricing...",
          "Contenu": "Competitive pricing, easy transaction, prompt (and free on this item) shipping.  What's not to like?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "bob miller",
          "Nb_Reviews": 8,
          "Date": "2023-07-24T12:58:31.000Z",
          "Titre": "A++ and SUPER FAST shipping!",
          "Contenu": "I had to return a mistakenly purchased item along with the rest of my merchandise and it was as painless as could be"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael H",
          "Nb_Reviews": 1,
          "Date": "2022-04-24T23:55:18.761Z",
          "Titre": "This store rocks",
          "Contenu": "This store is great. Ben was fantastic and super easy to work with. My ESP USA arrived packed to perfection with some cool swag too. Highly recommend these guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shun Takano",
          "Nb_Reviews": 3,
          "Date": "2023-05-23T20:03:10.000Z",
          "Titre": "Great Store for Musical Needs",
          "Contenu": "I've been a customer of MusicStoreLive since 2015 and have been happy with their selection, price and service. The latest transaction was no different. I wouldn't hesitate to recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshia Shedaker",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T18:56:03.000Z",
          "Titre": "Quick and easy",
          "Contenu": "Quick and easy. Items were exactly as described. Gorgomyte is getting tricky to find so I'll definitely be back!"
        },
        {
          "Note": 5,
          "Lieu": "DO",
          "Pseudo": "Edward Rijo",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T18:42:56.000Z",
          "Titre": "thanks for helping",
          "Contenu": "thanks for helping. I got that bass, I had been looking for it for a while, thanks to you I was able to get it and everything went well with the delivery, thanks it was a pleasure doing business with you 🙌🏻"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Volnei Ricardo Sandri",
          "Nb_Reviews": 2,
          "Date": "2022-07-12T17:18:16.000Z",
          "Titre": "5 star seller!",
          "Contenu": "Although I have not yet received the products, I can say that all the negotiation is as agreed. The service was objective and attentive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert B Carey Jr",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T22:24:39.000Z",
          "Titre": "Placed my order They sent it out…",
          "Contenu": "Placed my order They sent it out immediately sent all tracking information and the item is beautiful!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Jeff Cheung",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T15:53:53.000Z",
          "Titre": "Excellent High End Guitar Shop",
          "Contenu": "It is a good music store. Great customer service and a great price as well. Ben did a good job with my purchase. I would recommend this guitar store"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Wilson",
          "Nb_Reviews": 4,
          "Date": "2022-06-11T20:02:02.000Z",
          "Titre": "Always a pleasure shopping at…",
          "Contenu": "Always a pleasure shopping at musicstorelive.  I’ve purchased a couple of basses and loads of accessories. They are the best"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Westerman",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T07:49:04.000Z",
          "Titre": "How to figure out what to buy.  Ask Ben!",
          "Contenu": "Ben Anderson is great at helping his customers.Would certainly do business with him again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T01:18:15.000Z",
          "Titre": "Happy with my experience",
          "Contenu": "Item was new in original packaging, just as described, and was shipped promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan J Fuentes",
          "Nb_Reviews": 1,
          "Date": "2022-09-09T13:20:42.000Z",
          "Titre": "I’m very happy with the accordion bag…",
          "Contenu": "I’m very happy with the accordion bag my accordion fit perfectly and the price was great and fast shipping thanks I will buy again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerry Harmon",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T17:24:29.000Z",
          "Titre": "This business was very easy to deal…",
          "Contenu": "This business was very easy to deal with and shipped out snare quick. I would recomend them to everyone."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Stuart Waddington",
          "Nb_Reviews": 2,
          "Date": "2023-03-08T00:39:23.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent help with a shipment to New Zealand to get the best possible economical postage. Great to deal with thanks"
        },
        {
          "Note": 5,
          "Lieu": "CR",
          "Pseudo": "TB Jose Calderon",
          "Nb_Reviews": 1,
          "Date": "2022-08-20T18:42:24.000Z",
          "Titre": "AWESOME!",
          "Contenu": "you guys are so AMAZING!! super recommended, great service and time to response many thanks!! bless to CRC :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clay Campbell",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T17:15:49.000Z",
          "Titre": "What a helpful team!",
          "Contenu": "These guys are so helpful and quick to respond to any and all questions. I will definitely do business with them again in the future"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron",
          "Nb_Reviews": 2,
          "Date": "2023-05-30T20:15:56.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service! Great deal on guitar! Will be buying from again in the near future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Partl",
          "Nb_Reviews": 2,
          "Date": "2022-05-09T05:02:00.000Z",
          "Titre": "Great products in stock with fast…",
          "Contenu": "Great products in stock with fast delivery. Can't wait to get my project going. I will definitely order with you again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sergio Eratoxica",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T16:22:40.000Z",
          "Titre": "Excellent customer service and to top…",
          "Contenu": "Excellent customer service and to top it all off, great pricing. I am extremely satisfied and would definitely use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al B.",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T08:47:31.000Z",
          "Titre": "Highly Recommnded..!!",
          "Contenu": "Absolutely a great experience dealing with Music Store Live.  Thank you and continue providing such great service.Highly recommeded..!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ernest Yukna Jr.",
          "Nb_Reviews": 2,
          "Date": "2023-08-01T03:40:00.000Z",
          "Titre": "Ben treats me like a customer",
          "Contenu": "Ben treats me like a customer, NOT a number. Always ready to help, and if he cant help me, he knows where to send me to get what I need. Best  ever!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Haendiges",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T20:42:38.000Z",
          "Titre": "helpful and prompt",
          "Contenu": "correspondence was helpful and prompt. The product arrived fast and in great condition. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Jaroslav Smrcka CZ - EU",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T19:57:42.000Z",
          "Titre": "Bill Lawrence L500 XL",
          "Contenu": "Fast solid response, fast delivery. I recommend this store."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Gorzynski",
          "Nb_Reviews": 2,
          "Date": "2022-04-17T14:08:30.000Z",
          "Titre": "Excellent business to work with",
          "Contenu": "Excellent business to work with. Ben helped me every step of the way and was polite and professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luca Shameh",
          "Nb_Reviews": 1,
          "Date": "2023-01-02T08:56:07.000Z",
          "Titre": "Considerate and quick",
          "Contenu": "Awesome shop, helped me out a lot when I messed up during checkout. Super grateful! Happy New Year!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken Efird",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T23:56:10.000Z",
          "Titre": "Fast shipping a no hassle return…",
          "Contenu": "Fast shipping a no hassle return policy, will definitely buy from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony FORTE",
          "Nb_Reviews": 1,
          "Date": "2022-07-27T19:29:05.000Z",
          "Titre": "Item I ordered turned out to be out of…",
          "Contenu": "Item I ordered turned out to be out of stock, so they got one for me from the manufacturer. Great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles  Weaver",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T22:39:59.000Z",
          "Titre": "Good price",
          "Contenu": "Good price. No complaints."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T01:49:12.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. It's difficult to shop anywhere else. If you're going shop online, this is the place."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Evans",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T20:52:11.000Z",
          "Titre": "Ben is a great salesperson",
          "Contenu": "Ben is a great salesperson. He shipped me my new Sire fretless bass asap. I plan to buy various products from him in the future. Michael"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maurice Palumbo",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T22:15:52.000Z",
          "Titre": "Bass Stuff",
          "Contenu": "I liked the interaction online and in person. Pricing was negotiable and the associates try their best to help in any way possible"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ray Buhr",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T16:42:19.000Z",
          "Titre": "Excellent service with free shipping",
          "Contenu": "Excellent service with free shipping! Items arrived in great condition. Would definitely deal with again."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Mauro Poli",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T16:18:58.000Z",
          "Titre": "easy to deal with",
          "Contenu": "easy to deal with, superfast shipping. will do business again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ADAM",
          "Nb_Reviews": 3,
          "Date": "2023-03-15T19:43:54.000Z",
          "Titre": "This place is awesome",
          "Contenu": "This place is awesome. Fast responses, great deal and fast shipping. Highly recommend!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tommy",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T03:06:48.000Z",
          "Titre": "Great Great Customer service!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philip Monzon",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T22:26:48.000Z",
          "Titre": "Ben Anderson",
          "Contenu": "Ben Anderson, your representative was helpful and understood our needs.  Ben provided a competitive price and gave advice on the equipment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Logan",
          "Nb_Reviews": 2,
          "Date": "2022-07-16T04:54:54.000Z",
          "Titre": "A++++",
          "Contenu": "Have bought a few guitars ~ amps ~ pedals  Always excellent prices & service ! A++++"
        }
      ]
    }
  ]
}