{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "mychoicesoftware.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 5,
          "Date": "2023-11-07T17:40:50.000Z",
          "Titre": "**CAUTION** Use caution when purchasing software from MyChoiceSoftware & pay attention to license!!!",
          "Contenu": "If I could give it a zero star I would. I purchased Microsoft Home and Business for my home computer from Mychoicesoftware.com. This worked on my computer, HOWEVER it is not at all clear on their product page that this is NOT a product that you can transfer, or reload. After having this installed on my computer, I uninstalled and went to reinstall on a new computer. After over 2 hrs on the phone with Microsoft, I was told that this was NOT a product for consumer sale (see screenshot), and used a developer license. After reaching out to Mychoicesoftware customer support, was told that this was clear on the product page and that because I loaded it one time they were good. So for a savings of $20 from the full Microsoft license, I don't have any ability to reload a product that was not intended for resale to begin with. Spend the extra little bit and buy direct from Microsoft so you can reload as needed and have for the true life of the product, not only a one time use. Disappointing customer service and even more disappointing they sold a product that shouldn't have been sold and did NOTHING about it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T17:24:01.000Z",
          "Titre": "The software I purchased will not load…",
          "Contenu": "The software I purchased will not load on to my computer. Evidently I don't  have enough space as my computer is several years old.  I contacted the company and was told to call them and they would help me figure it out.  I have tried to call twice and have been put on hold and then disconnected both times.  I contested the charge with AMEX and was told the company wanted to deal with me directly to process a refund.  So, I am stuck in the middle of lots of red tape when all I want is my $100 back for software I cannot use.I received messages from your office on my phone.  When I tried to return the call (from Gabe on 9/22) the first time, I was sent to a voicemail, where I left a message. I received a call from someone else (Alex on 9/25), and then again today.  I am tired of playing phone tag over an issue that I have explained REPEATEDLY.  If you are not interest in returning my money as I asked, so be it.  Let your actions stand as a reflection of your customer service and your commitment to quality service.  I am done!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T21:19:24.000Z",
          "Titre": "Windows 10 product key became invalid…",
          "Contenu": "Windows 10 product key became invalid after a short time of being activated on PC.  Leads me to believe it was an invalid key or used by other PC's and Microsoft deactivated the product key.  Contacted support but no response yet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David E",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T20:39:41.000Z",
          "Titre": "Scam",
          "Contenu": "Scam. Sold me a version of Microsoft 365 for enterprise, told me to download from Microsoft cloud. That requires one to create an admin account, to access software. Had trouble with the download (never received the software) and told mychoicesoftware I was canceling purchase per their warranty. They refused. Said that by creating an admin account I voided their responsibility. Total POS. You might ask where does the warranty say that it will be voided by creating a 365 account with Microsoft, or simply that the warranty that will automatically terminate before you have a product? Never got an answer. Big surprise. They are a sub-par 3rd party seller. I seem to recall litigation between them and Microsoft for similar behavior. Do not trust them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph K.",
          "Nb_Reviews": 4,
          "Date": "2023-06-20T01:04:42.000Z",
          "Titre": "Win install media creation tool will NOT run to load software!",
          "Contenu": "I downloaded the Windows Installation Media Creation tool. It does NOT work! The options are blank. Nothing is shown and does not respond at all! Problem persisted after updated windows."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2021-09-01T16:02:33.000Z",
          "Titre": "I purchased a Office 2019 Home and…",
          "Contenu": "I purchased a Office 2019 Home and Business License on August 30th. I went to install today and the activation failed stating it has been activated the maximum number of times. Which means this key has been used before. I activated thru the phone system after speaking with Blair's Tech support. They acted like this is normal procedure. I do not believe this. They know this key has been used before. I have submitted a complaint and the key to Microsoft"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dr James Okamoto",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T09:18:09.000Z",
          "Titre": "the upgrade key i just purchased is invalid",
          "Contenu": "I bought an upgrade from Windows 10 home to Windows 10 professional, and when I type in the upgrade key it says it is invalid.  I need this upgrade to run my electrocardiogram machine, and everyday that it is not running I am losing business.....I sent an email to support@mychoicesoftware and it fails to deliver to this address....not happy at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Judy Lynn Diaz",
          "Nb_Reviews": 1,
          "Date": "2022-08-14T04:31:47.000Z",
          "Titre": "Just bought Windows 11",
          "Contenu": "Just bought Windows 11. Computer says invalid number. Signed into the help and find that you have to pay for finding out why I paid over 100.00 and still cannot use my computer. Sorry your assistance for purchases should be free at least for the installation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sean McFarland",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T21:58:11.000Z",
          "Titre": "Mychoicesoftware sold me a software…",
          "Contenu": "Mychoicesoftware sold me a software product that had a key that was already used.  I had to call three times and finally decided I did not want the software your company was providing as your company attempted to sell me a software that had a used key and I wasn't able to download the product. It is my opinion that Mychoicesoftware is unethical and has shady business practices. I wouldn't recommend anyone buy and software from Mychoicesoftware.  I have called my CC company to dispute any charges from this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 1,
          "Date": "2021-12-27T18:49:55.000Z",
          "Titre": "I purchased Microsoft Visio a little…",
          "Contenu": "I purchased Microsoft Visio a little over a year ago and just came to find out that I can only install it once...period!  They said that if I purchase it from them, and if I install it on a computer that dies at any point after that (1 second to 100 years), that I will need to buy another copy.  This doesn't seem right to me, but the person at MyChoiceSoftware didn't seem to care.  I was calling them to find out how I can reinstall Visio again on a new computer I just got because the once I installed it on died."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephen Gudeman",
          "Nb_Reviews": 1,
          "Date": "2021-10-20T20:30:45.000Z",
          "Titre": "I ordered Office Home and Student for…",
          "Contenu": "I ordered Office Home and Student for Mac. When I downloaded it turned out they sent it for Windows and obviously would not work. So, I called and they soon sent another download, but that one is called \"360\" and involves a yearly rental fee. So, once again I am calling and have been on hold for about two hours. I cannot afford the yearly rental fee and only need what I ordered. I have written the company by email in addition to remaining on hold by telephone. Very, very bad experience especially with the money involved on a limited budget."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris Blazer",
          "Nb_Reviews": 4,
          "Date": "2023-03-28T01:36:11.000Z",
          "Titre": "The product would not work",
          "Contenu": "The product would not work. I got a message that the license key was already used. When I contacted Microsoft at the support tech's advice, they told me that the license key was an OEM key and would not work. After over a month of calls, emails and complaints, they finally agreed to refund the purchase price less 15% for contacting Microsoft to check if the key had been activated. If it has, I was not the one that used it, so either they sold me a used key or an OEM key; either way, the key will not work for me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "The_Big_One",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T15:45:21.000Z",
          "Titre": "Did not want to refund me for product I could not use.",
          "Contenu": "They will sell you something you can not activate and if you ask for a refund they will charge you 15% which can be a substantial cost, do yourself a favor and purchase from another vendor. I had to go to my credit card company and request they remove the charge because I was sold a product that could not be activated. I finally got my credit card to refund me the cost of the product.I have used the many times in the past with good results, this purchase was not a good experience, and I will never purchase from them again. They lost a lifetime customer over what amounts to very little money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jay Todd",
          "Nb_Reviews": 1,
          "Date": "2022-05-28T04:28:02.000Z",
          "Titre": "This is a fraud",
          "Contenu": "This is a fraud. The keys did not work.  I ended up having to get a physical installation disk as this \"product\" only provided links to MS support sites and the keys they provided me were not recognized. Called support, Dave was very nice, but obviously did not know what he was doing. Promised his manager would contact me.  Week later, nothing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eugene Elcik",
          "Nb_Reviews": 2,
          "Date": "2022-10-19T01:36:22.000Z",
          "Titre": "Horrible service",
          "Contenu": "Horrible service:  I made the purchase for Microsoft 11, and I have spent the last three hours assisting me in downloading the program. Your service is lousy and I would not recommend your company. My next call is to the BBB (Better business bureau.)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sean",
          "Nb_Reviews": 2,
          "Date": "2022-01-15T01:02:27.000Z",
          "Titre": "BEWARE",
          "Contenu": "I purchased Microsoft Office Home & Business 2019 from this site on January 13th 2022.  I've seen this site before but just didn't trust the low pricing.  I should have listened to my instincts.  I went ahead and downloaded the image from the link they sent me.  When trying to install it on a brand new Dell Precision Windows 10 Professional PC, I got an error message telling me the installation was for a 32bit operating system.  That angered me immediately - Luckily Dell had the 64bit installation already preloaded (which I did not know) so it asked if I wanted to install the 64bit, which of course I said yes.  After installing it asked for the license key.  I pasted the license key they sent me in email - and low and behold - the key had already been used the maximum number of times.  How unsurprising.  I will never buy from this scam site again.  I called Microsoft and thankfully they helped me get a legitimate key to activate the software."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 5,
          "Date": "2021-09-23T13:17:18.000Z",
          "Titre": "Horrible experience",
          "Contenu": "Not only did they send me a key that didn't work, they sent me ANOTHER key that didn't work.  When I asked for a refund, I was charged with a 15% \"restocking fee\" for a digital license......that didn't work to begin with.  Will never use this company again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J. Hayes",
          "Nb_Reviews": 1,
          "Date": "2022-06-03T15:57:03.000Z",
          "Titre": "I clicked this because it was the first…",
          "Contenu": "I clicked this because it was the first result when I googled Microsoft Office, and wasn't looking closely. The key they sent isn't even valid, so I essentially got ripped off. Would not use again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Christiana",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T19:36:48.000Z",
          "Titre": "Scammers through and through",
          "Contenu": "Scammers through and through. Bought a license from them, turns out the license is only valid for China, + it's already been activated before they even sold it. I got this info from Microsoft tech support. Do not trust these scumbags."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Herrera Gurrola",
          "Nb_Reviews": 1,
          "Date": "2021-12-06T15:44:32.000Z",
          "Titre": "Do not buy anything from them.",
          "Contenu": "Do not buy anything from them.The worst customer service!I never received the link to download my product and when I write them to complain they rather cancel my order than provide me with the service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jimmy Parks",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T18:57:22.000Z",
          "Titre": "License keys are one time use from…",
          "Contenu": "License keys are one time use from them. Regardless of what Microsoft says. They will not replace a key that gets compromised."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alan Cadena",
          "Nb_Reviews": 1,
          "Date": "2022-08-26T21:04:39.000Z",
          "Titre": "code already used",
          "Contenu": "i got the code and put it in but when i did it said error and it was already used which sucks because i spent 100 dollars on a code that does not even work"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DL Sinjem",
          "Nb_Reviews": 1,
          "Date": "2022-05-13T18:03:38.000Z",
          "Titre": "Dont buy form this comapny",
          "Contenu": "I had to reinstall my system and now I have to buy another subscription...how WRONG is that!!! It is for the same PC. I could understand if it was for a different one. Your company policies stink and I am going to tell everyone I know NOT to Buy from you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Koral",
          "Nb_Reviews": 1,
          "Date": "2022-12-26T19:55:11.000Z",
          "Titre": "Windows 10 loading to laptop",
          "Contenu": "Windows 10 loading to laptop. Loaded, Down load, MEDIA  AND IS TRYING TO UPDATES stuck/froze AR 46% for the 16 hrs. PLEASE ASSIST."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rita Burton",
          "Nb_Reviews": 1,
          "Date": "2022-06-26T20:08:20.000Z",
          "Titre": "We purchased the Office software",
          "Contenu": "We purchased the Office software, 5.23.2022 but it did not upload or update of software. Now we cannot use the Product Key again.  Not sure what happened."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kent Longo",
          "Nb_Reviews": 1,
          "Date": "2021-10-02T18:29:13.000Z",
          "Titre": "product key did not activate for…",
          "Contenu": "product key did not activate for windows 10phone number for support is always busy and there was no reply email"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "WRB",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T18:26:13.000Z",
          "Titre": "Depressingly bad",
          "Contenu": "Depressingly bad!  It's not worth going into details except to say that communication was REALLY poor and that nothing worked."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Indy-IT-Support",
          "Nb_Reviews": 1,
          "Date": "2022-01-13T20:04:00.000Z",
          "Titre": "MyChoiceSoftware is selling USED/PreActivated products",
          "Contenu": "I have purchased SEVERAL dozen Office 2019 product codes from MyChoice over the last few years.   I have noticed that the codes that I have been purchasing are not following the procedures that Microsoft states must be used to \"activate\" those codes.  I have tried to activate several product codes that can not be activated and EVERY code I have received from MyChoice I have had to use the Telephone activation to activate the product.  According to Microsoft agents this is NOT normal and is a sure sign of Fraud.   Today (January 2022) I had a PC that I had purchased Office 2019 for in September 2019. It had run an MS update that corrupted the Office install.  I eventually had to completely uninstall office na dtry to reinstall office.  It would not activate. I tried several methods to activate it and each time it failed.  I contacted MS support adn they told me the product had been activated at least 30 times by 20 different Hardware IDs and it was first activated PRIOR to the date I purchased the product key from MyChoice.  MyChoice maintains that they do not sell used products  but cannot explain explain how my product keys were activated PRIOR to me purchasing them from MyChoice.  They refuse to replace the product key and say that Microsoft's system are in error.   Given all the problems I've had with Activated dozens of Product ID's from Mychoice, it now makes sense what they've been doing.  I spent over 3 hours on the chat with Microsoft discussing all of this and over 1.5 hours on the chat with MyChoice.  I have both transcripts and have filed a fraud case with Microsoft against MyChoice and am contacting my attorney's to begin legal proceedings against MyChoice.  Do yourself a favor and DO NOT purchase from them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "kit kat",
          "Nb_Reviews": 2,
          "Date": "2021-11-16T18:22:36.000Z",
          "Titre": "stay away",
          "Contenu": "stay away, I was going to buy the cd key from microsoft website, and got redirected to this company somehow, sold me a key which is already been used, when asking for a refund they will charge you a 15% restocking fee"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Keith Shay",
          "Nb_Reviews": 1,
          "Date": "2021-04-02T15:13:52.000Z",
          "Titre": "The website is not very up today",
          "Contenu": "The website is not very up today.  It takes hours to download the software and gives you the feeling it is a scam.  I would not recommend anyone to use this site."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Teri Goulart",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T21:20:15.000Z",
          "Titre": "It didn't work and the error I'm…",
          "Contenu": "It didn't work and the error I'm receiving is telling me to go get a valid copy of windows.  Is this a scam?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roland Lamb",
          "Nb_Reviews": 1,
          "Date": "2021-12-29T16:15:36.000Z",
          "Titre": "Being told that it cannot be downloaded…",
          "Contenu": "Being told that it cannot be downloaded securely, system will not allow me to download"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Riddle",
          "Nb_Reviews": 1,
          "Date": "2021-09-15T08:35:24.000Z",
          "Titre": "I've attempted to upgrade my windows…",
          "Contenu": "I've attempted to upgrade my windows from 8.1 to windows 10 three times now and all three have failed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2021-04-13T23:29:21.000Z",
          "Titre": "If I could give zero stars I would",
          "Contenu": "If I could give zero stars I would. Purchased a license. It doesn't work. You sold me a license that is not valid."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "gus hueber",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T00:58:53.000Z",
          "Titre": "Scam",
          "Contenu": "You gave me a junk product key that was already used on another device. I would like a refund"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Capps",
          "Nb_Reviews": 1,
          "Date": "2022-05-27T03:42:55.000Z",
          "Titre": "Install assistant instead of install media",
          "Contenu": "Received a download of install assistant instead of an install file so unable to install windows in virtual machine.  Unable to install because this assistant is confusion and worthless, I need an install image."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Doug Blossom",
          "Nb_Reviews": 1,
          "Date": "2021-04-21T18:51:55.000Z",
          "Titre": "Support was rude and unhelpful and the…",
          "Contenu": "Support was rude and unhelpful and the error says my code is invalid"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "just me",
          "Nb_Reviews": 2,
          "Date": "2023-01-21T20:22:19.000Z",
          "Titre": "It wont let me sign it to Microsoft",
          "Contenu": "It wont let me sign it to Microsoft. I will have to dispute the transaction."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zach",
          "Nb_Reviews": 1,
          "Date": "2021-11-04T05:43:44.000Z",
          "Titre": "It tells me that my key is invalid when…",
          "Contenu": "It tells me that my key is invalid when I attempt to type it in."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Mercer",
          "Nb_Reviews": 1,
          "Date": "2021-10-30T18:57:08.000Z",
          "Titre": "assistant tool just goes to exit",
          "Contenu": "I did every thing listed in the e mail. Tool downloaded ,but just goes to exit when I try to run ot. I think I need a little help"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marlene Calhoun",
          "Nb_Reviews": 2,
          "Date": "2021-10-14T19:20:50.000Z",
          "Titre": "I paid for windows 10",
          "Contenu": "I paid for windows 10, and now I can’t download it. This is the error code Ox80072EE4-Ox20000"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "sharon olveda",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T23:44:28.000Z",
          "Titre": "What a ripoff",
          "Contenu": "What a ripoff It would not download on either computer It wouldn’t take the last letter"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Keith",
          "Nb_Reviews": 5,
          "Date": "2022-03-13T19:06:09.000Z",
          "Titre": "It doesn't work!",
          "Contenu": "It doesn't work!! the serial number seems to be forged."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2021-10-09T20:57:12.000Z",
          "Titre": "I can not get this software to down…",
          "Contenu": "I can not get this software to down load and work on my computer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cole Schieszer",
          "Nb_Reviews": 1,
          "Date": "2021-11-27T17:11:32.000Z",
          "Titre": "Sent me invalid activation key",
          "Contenu": "I purchased an activation key and the one I received was invalid."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lyle Allen",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T00:27:05.000Z",
          "Titre": "unable to install PLEASE CALL 209 723-2671",
          "Contenu": "I was unable to install Please call"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "glenn",
          "Nb_Reviews": 1,
          "Date": "2022-03-07T14:42:19.000Z",
          "Titre": "software did not download"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeffery Owens",
          "Nb_Reviews": 1,
          "Date": "2020-12-20T03:38:42.000Z",
          "Titre": "Activation Code Already Used",
          "Contenu": "I was quite excited whenever I received my activation code from your company. However, whenever I entered the 25 digit code to my product key. It appeared the code I received had already been activated on another device. If I could receive any assistance/refund for my purchase it would be greatly appreciated.. I can provide proof of what I have encountered as well."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonathan Bingham",
          "Nb_Reviews": 2,
          "Date": "2020-07-06T23:23:30.000Z",
          "Titre": "Got some opportunities to improve, needs to respect the customers time more!",
          "Contenu": "Website was extremely user friendly get thumbs up on that. I paid almost $20 for it to be shipped and delivered in 2-3 business days by fedex ground home delivery. Ordered on 6/26/20 and was delivered by the usps on 7/6/20. Called last week about it and got no help or answer about paying for shipping and taking a week to ship out from the my choice warehouse. Unacceptable and poor customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "George Carroll",
          "Nb_Reviews": 1,
          "Date": "2020-03-13T00:12:07.000Z",
          "Titre": "This is the third time I have purchased…",
          "Contenu": "This is the third time I have purchased a copy of Windows 10 Pro and when I install the product activation key, the computer responds that the license has already been installed elsewhere!  MyChoiceSoftware has offered no solution other than to offer modifications to the system but to no avail!  I am very disturbed by my experience with MyChoice Software"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julie Hubach",
          "Nb_Reviews": 1,
          "Date": "2019-10-25T17:43:55.000Z",
          "Titre": "Tried to download an Office product and…",
          "Contenu": "Tried to download an Office product and could not get it to download onto my computer after several attempts.  I sent them an email to this effect and received no response and they refuse to refund the money.  They keep wanting to upload the product and i had since purchased a working copy from another company.  Guess they are just desperate for the $199.  Buy elsewhere......."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Phil Coulson",
          "Nb_Reviews": 1,
          "Date": "2021-01-24T15:37:06.000Z",
          "Titre": "My experience was NOT good",
          "Contenu": "My experience was NOT good. I ordered this software to run on a recently purchased Mac thinking it was a great cost saving over ordering MS Office from Microsoft, only to discover after paying that your software will not run on either a Mac or a PC computer. I would like my money back please!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Diane Weber",
          "Nb_Reviews": 1,
          "Date": "2020-02-22T16:08:02.000Z",
          "Titre": "The upgrade will not download…",
          "Contenu": "The upgrade will not download completely, I have been trying to download the upgrade to Windows 10 since Friday afternoon. It will get to 46% \"getting updates\" then does not go any further.I want a refund of my money now. I am tired of trying to download the upgrade to Windows 10, so please give me a complete refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JC",
          "Nb_Reviews": 1,
          "Date": "2019-01-18T20:53:21.000Z",
          "Titre": "I purchased Microsoft Office 2019 from…",
          "Contenu": "I purchased Microsoft Office 2019 from them, and installed the software. However, the product key was invalid, and after four contacts with the company, they admitted they didn't have valid keys, and said they would refund my money, I have disputed this purchase with AMEX. I then purchased the software elsewhere, but the invalid product code from My choice is creating havoc with trying to set up the new software."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sean B",
          "Nb_Reviews": 2,
          "Date": "2019-01-22T21:20:45.000Z",
          "Titre": "I was ripped off on this company when I…",
          "Contenu": "I was ripped off on this company when I bought a Server 2016 license only gave me a single activation and did not let me activate the 2 virtual machines that were supposed to come with it. This means it had been activated already. There's a reason they sell server licenses so cheap I guess. These are not legitimate licenses. I've reported them to Microsoft."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CHuck Harlow",
          "Nb_Reviews": 1,
          "Date": "2018-09-20T02:07:33.000Z",
          "Titre": "DO NOT BUY FROM THEM",
          "Contenu": "DO NOT BUY FROM THEM!  I have ordered 12 copies of MS Office 2016 Home and Business over a week ago and they still haven't fulfilled the order!!!   They charged my CC over $2000 for these licenses and have not delivered.  Their website says:\" Order before 5:00 pm PT to receive your order within 30 minutes*\"DO NOT TRUST THEM - ITS A SCAM!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Clifton Palmer McLendon",
          "Nb_Reviews": 2,
          "Date": "2017-08-23T20:20:10.000Z",
          "Titre": "I Received POOR Customer Service!",
          "Contenu": "The site where I ordered Windows 7 clearly showed that I would receive the disk in a box, exactly as Microsoft first produced it.I did not receive a disk in a box -- I received a thumb drive.When I telephoned to express my dismay, I was rudely dealt with.(The software worked when I installed it, so this review deals solely with the poor customer service I received, not with the quality of the software.)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris Guthrie",
          "Nb_Reviews": 1,
          "Date": "2020-03-17T17:48:38.000Z",
          "Titre": "Purchased a Windows 10 Home digital, comes back with already used.",
          "Contenu": "Purchased a Windows 10 Home digital key. Waited for about 35 minutes after purchase to get key and then the same minute I typed in the key only to find that it returns with an already used warning/error. Needless to say it was a waste of 130$ as of right now. I have screenshots with times to verify."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Joshua (real person, not a fake review)",
          "Nb_Reviews": 1,
          "Date": "2016-12-08T22:34:19.000Z",
          "Titre": "Don't buy! Fishy stuff going on here!",
          "Contenu": "I paid for MS Office 2013 Home & Business. They sent me a code for Home & Student. Then they fixed that and sent a code for Home and Business - that DIDN'T WORK (or was already used). Save your time and worries, buy direct or get a physical box copy. To be fair, they did give most of my money back. But still avoid this trouble. It does not seem legitimate at all!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eugene Smith",
          "Nb_Reviews": 1,
          "Date": "2018-03-15T21:37:23.000Z",
          "Titre": "Do not buy software from this company",
          "Contenu": "Do not buy software from this company! The say they only guarantee installation for 30 days. I purchased 25 copies of MS Office 2016 and one by one they have unregistered themselves and became invalid. These were installed on one machine per copy and there were no changes to hardware at all. DON'T be fooled by the low prices. Save yourself some aggravation and buy your software directly from Microsoft and avoid this SHADDY company. You've been warned!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Unhappy Purchaser",
          "Nb_Reviews": 1,
          "Date": "2016-07-15T21:15:38.000Z",
          "Titre": "MyChoiceSoftware - Did not give me correct keys-failed at Microsoft",
          "Contenu": "I just received product keys for OFFICE 2016 but unfortunately when I tried to get them activated through Microsoft, Microsoft did not acknowledge them as being valid. I've tried several times to contact MyChoiceSoftware with my issue with these purchased keys, however I only ever received their answering machine with no returned call backs. Would not recommend this company at this time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pissed off",
          "Nb_Reviews": 1,
          "Date": "2016-10-14T15:29:21.000Z",
          "Titre": "beware",
          "Contenu": "I purchased a license for Office 2010. They bundled in \"free\" installs of office 365, neglecting to mention that they will start charging $9.99 to my credit card after one month. You can opt out of this if you catch their email in time. But in general I would describe their practice as unethical. I would use harsher words if Trust pilot allowed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pete",
          "Nb_Reviews": 1,
          "Date": "2016-06-24T18:14:32.000Z",
          "Titre": "Deceptive Marketing Practices",
          "Contenu": "I thought I'd found a good place to buy software but sadly I changed my mind when I started receiving emails about my complementary subscription to Office 365 and how I was going to get charged for it. I called and they told me that there was a box I had to uncheck when I checked out to opt out of the subscription. I feel that they violated my trust with a shady marketing practice and will find a different software supplier going forward."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "glenn",
          "Nb_Reviews": 3,
          "Date": "2020-05-05T16:15:35.000Z",
          "Titre": "Once bitten twice shy What they don't…",
          "Contenu": "Once bitten twice shy What they don't tell you is once you download the file you need an external disc to open up the program than if you have any questions or not that computer savvy than your are a kit blowing in a hurricane don't except to get any real person to help you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brigid Fitch",
          "Nb_Reviews": 2,
          "Date": "2017-05-19T17:17:20.000Z",
          "Titre": "Purchased a copy of Office 365 Personal …",
          "Contenu": "Purchased a copy of Office 365 Personal for download within 30 minutes.  It never came.  Each day I called, I was told it was backordered (??) and would be in, \"either later today or tomorrow\".  This went on for 3 days.  Finally canceled the order.  Mind you, product is still showing IN STOCK on their website.  DO NOT USE!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shirley Elgas",
          "Nb_Reviews": 2,
          "Date": "2020-05-26T15:27:52.000Z",
          "Titre": "Their Windows Pro would not load after…",
          "Contenu": "Their Windows Pro would not load after 3 tries.  When I called them I was told there is a 15% surcharge to go back to Microsoft to verify that I didn't use the Activation Key and that it would take two weeks for a refund the the other 85%.What a shoddy way to do business!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terry Simmons",
          "Nb_Reviews": 2,
          "Date": "2016-08-24T01:47:39.000Z",
          "Titre": "Very unsatisfied and would like my money back",
          "Contenu": "I was unable to download the software. I called support which was not helpful. I  had to take my computer to a repair shop for help installing the soft. they were unable to install it. They also called support, who was unable or unwilling to assist. I wold like to have my money refunded. How do I go about obtaining a refund?Terry"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sharon Lamb",
          "Nb_Reviews": 1,
          "Date": "2017-02-01T18:31:00.000Z",
          "Titre": "Watch out",
          "Contenu": "The product we ordered works great, was easy to download and does what we wanted.  We inadvertently were registered for 365 something and have been charged $9.99 per month. I asked to cancel and receive a refund. I was charged a second time in Dec and that was refunded.  Great - I was still charged in Dec. Lesson- be very vigilant watching credit card charges. The MyChoice representative was calm, understanding and sounds helpful. But I may still need to have bank block charges."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "M. Lowery",
          "Nb_Reviews": 1,
          "Date": "2016-10-21T22:45:08.000Z",
          "Titre": "Worst Software Experience in a Long Time",
          "Contenu": "Nothing will download, open or run.  I have wasted hours trying to get the software to work.  It downloads and then won't extract properly - always says files are missing.  This is a complete waste of time and money.  I will never purchase again from this company.   The only positive, they send email follow ups.  I purchased Vizio from Microsoft.  This is just another reminder of why I now use Apple products and wish I could banish everything Microsoft to another planet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve H.",
          "Nb_Reviews": 1,
          "Date": "2016-09-16T19:54:50.000Z",
          "Titre": "What a mess!  Do yourself a favor and purchase directly from Microsoft.",
          "Contenu": "Mychoicesoftware gave me an incorrect code for the purchase that I made.  I spent 1.5 hours on phone with Microsoft to find out the code Mychoicesoftware gave me was bad.  I was told refund would take a week.  Called today because I hadn't received refund and finally received an email confirmation of forthcoming refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stacy Brewer",
          "Nb_Reviews": 2,
          "Date": "2016-10-31T18:57:33.000Z",
          "Titre": "Spam and Unwanted Software",
          "Contenu": "I made a purchase, so they signed me up for a demo software, and informed me they would charge my card if I didn't cancel within 30 days. I didn't order any trial software and I don't like their tactics and relentless spam. Would not recommend mychoicesoftware.com and will not do business with them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "cheong",
          "Nb_Reviews": 1,
          "Date": "2016-07-22T03:15:33.000Z",
          "Titre": "No good",
          "Contenu": "I purchased a Microsoft Office Home and Student 2013 for $85.94 but I didn't know that was a license. I knew it was a licensed card. so I called to customer service for refund. Mychoicesoftware didn't refund for full but they charged the 15% fee.  I didn't try to install the MS Office 2013 license."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Unhappy Buyer",
          "Nb_Reviews": 1,
          "Date": "2016-06-29T12:59:27.000Z",
          "Titre": "Company misleading buyers on Office Products",
          "Contenu": "I purchased an Office 2016 license for MAC and nowhere in the site did it mention it was a 365 license. I was under the impression that it was a 1 time purchase.  The problem I have is that I could have purchased a full 365 license for the same price that would have allowed multiple installations on my MAC, windows and mobile devices. The first license they provided didnt work because it was already registered to someone else. So buyer beware when it comes to buying software from this company.  In the deali"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bill Marsh",
          "Nb_Reviews": 1,
          "Date": "2020-02-21T20:13:31.000Z",
          "Titre": "two windows 10 Pro upgrades fled to activate…",
          "Contenu": "I paid for two windows 10 Pro upgrades from window 10 home but the licenses given to me didn't active the product. I sent emails for help but have not received and help yet. I'm still hoping they will make this right. I still have one more PC to upgrade."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Groeschl",
          "Nb_Reviews": 1,
          "Date": "2016-08-29T14:58:17.000Z",
          "Titre": "Keys Dont work",
          "Contenu": "All of my keys (5) provided tell me they have been used too many times. I read a few reviews prior to our purchase that said they had similar issues but i couldn't believe they were true so we gambled. I havnt talked to the company about this yet but it shouldn't have even been an issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "C. D. Coppedge",
          "Nb_Reviews": 2,
          "Date": "2020-01-20T22:40:07.000Z",
          "Titre": "Purchased Microsoft Project 2016.",
          "Contenu": "Purchased Microsoft Project 2016.Completely Replaced my Office 2019 with another version.Luckily I have backed up my Office 2019 with license and was able to restore my Outlook, Word, EXCEL, PowerPoint and my VISIO 2019.Stupid way to run a railroad. Need to issue a warning to potential customers that this version of Project will severely mess up any 2019 Microsoft business software already installed. Fortunately, I am an experienced software programmer and was able to recover my \"stomped on\" software. Very disappointed. Installed their VISIO 2019 without this sort of mess."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angela Brooks",
          "Nb_Reviews": 1,
          "Date": "2016-11-08T15:31:22.000Z",
          "Titre": "Never worked and never received help",
          "Contenu": "I was unable to get the product to work so I called technical support. I tried 4 times to get assistance and never got to speak with anyone. After almost a week of trying to get the product working and making unproductive/unanswered calls to tech support, I gave up and asked for a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2016-09-06T04:35:48.000Z",
          "Titre": "The only thing good is Google got me my money back.",
          "Contenu": "I donAn loaded & installed the software but when I went to activate it I couldn't.  I got with tech support but they couldn't do anything.  I called Microsoft & they said the code I was given had already been used 14 times.  I was able to get a refund, thanks to Google."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen B.",
          "Nb_Reviews": 1,
          "Date": "2016-06-29T21:15:54.000Z",
          "Titre": "Trouble with installation",
          "Contenu": "I picked this program because the computer I purchased did not have a CD drive. Had trouble with the downloads, eventually had to give it to an IT friend of mine and even he had issues and when speaking with the assistant for the company found them to be unpleasant and not very helpful."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alexander Dobrolioubov",
          "Nb_Reviews": 1,
          "Date": "2020-01-02T22:27:01.000Z",
          "Titre": "Expired activation key for MS Office 2019 - buyer beware!!",
          "Contenu": "Bought Microsoft Office 2019 but the activation key provided to me Mychoicesoftware.com was expired. Was not able to use this software as a result.Beware of scam. Terrible experience and waste of money - will be disputing the charge with my credit card."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christopher Hull",
          "Nb_Reviews": 1,
          "Date": "2020-04-12T01:29:49.000Z",
          "Titre": "Activation Key did not work!",
          "Contenu": "I installed Windows 10 without issue; however, the Product Activation Key failed to work.  I reinstalled Windows 10 with the same result.  I tried the key several times, and even tried the second key the provided which was for an upgrade.  No Luck :("
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacob Longazo",
          "Nb_Reviews": 1,
          "Date": "2020-03-27T16:21:39.000Z",
          "Titre": "Don't Take The Risk",
          "Contenu": "I tried to buy a Windows 10 Pro license from here and received a key that was already in use. The support office had me try some ultimately useless commands to try and the get the key to work that ended with me on the phone with Microsoft for 2 hours only to find out the key had been used 6 times.  When I asked for a refund, they said they would provide one given Microsoft could verify the key hadn't been used.I read reviews of this place and should have followed the ones that mentioned getting invalid software licenses.  It's a risk whether or not you will get something legitimate from this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Todd P",
          "Nb_Reviews": 6,
          "Date": "2016-07-20T21:41:01.000Z",
          "Titre": "Sold me two different products",
          "Contenu": "I purchased one Product Key for Office 2016 Home and Business and they also signed me up for Office 365 in the same transaction.  Not only did they charge me $168 for a stand alone Product Key they sold me a 365 account by tricky click here, don't click there scheme.  They sold me a product that would have worked fine by itself but sweetened their profits by selling me a separate service paid on a monthly basis. Now to use office 365 I have to eat and loss of $168 I never would have paid had I know I'd get the same product for the monthly costs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marc Sellers",
          "Nb_Reviews": 2,
          "Date": "2017-02-01T23:31:51.000Z",
          "Titre": "automatically added in my shopping cart a subscription based software",
          "Contenu": "horrible business practices, throw add-ons into carts without telling you that will sign you up for monthly subscriptions. if you have purchased anything from them, make sure to check your credit card. it doesn't even show up on the invoice they send you.In respones to mychoicesoftware.  I have the VOICE RECORDING of you saying you SLIPPED it into my account automatically.  (there is a check box that you automatically check)  Kind of like those annoying people who automatically add you to their email lists?  Yeah except you take peoples money every month."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scoobie0116",
          "Nb_Reviews": 2,
          "Date": "2018-06-10T15:05:21.000Z",
          "Titre": "I purchased software and finally…",
          "Contenu": "I purchased software and finally received download almost 2 weeks later, only to have a product key that was bad.  Several emails and phone calls later, I was told I could get a refund if I submitted a screen shot of the error message and that I would have to pay a 15% restocking fee.  That is unacceptable as I didn't change my mind on the purchase, the product was not usable!  If I get a refund, I will be surprised.  I would never recommend this company or its products to anyone.  I will do another reviewer has done - will report this company to Microsoft Corporate and BBB."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christine Rivera",
          "Nb_Reviews": 1,
          "Date": "2018-01-23T02:46:04.000Z",
          "Titre": "Do not purchase Parrallels Desktop 10 …",
          "Contenu": "Do not purchase Parrallels Desktop 10 for MAC. It will not load and work with out errors this version is no longer compatible with the new macOS High Sierra Version 10.13.2. It is not worth purchasing will need to purchase Parrallels Desktop 13 it is a waste of money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Broll",
          "Nb_Reviews": 1,
          "Date": "2021-01-18T20:06:36.000Z",
          "Titre": "Too slow",
          "Contenu": "Wanted a key quickly, didn't get it till 4 hours later.  I ended up just reusing a key for I had intended for something else.  Using other similar service I got key in minutes after purchasing.  Won't be using you again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2019-07-02T18:42:52.000Z",
          "Titre": "Phishy download links.",
          "Contenu": "First download link was broken.  Second download link was spoofed and from a 3rd party.  I had to locate the original installer files myself to ensure that the application was safe and legit.  The only upside was that the purchased product key did work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laurie Wolfe",
          "Nb_Reviews": 1,
          "Date": "2016-09-09T20:19:01.000Z",
          "Titre": "Won't load",
          "Contenu": "When I try to download and open the software it says that it already has been....but it hasn't.  It was something I needed immediately and my child was unable to do his homework.  And they don't give refunds.....so I'm stuck...with nothing to show for my money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Smith",
          "Nb_Reviews": 1,
          "Date": "2016-11-08T23:32:34.000Z",
          "Titre": "Never received the license key",
          "Contenu": "I ordered a Windows 10 Enterprise license, but all I got was a link to the Office 365 portal.  I poked around in there everywhere but it showed no available licenses for any products.Not sure why they can't just email the license key like most everyone else does."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe Thayer",
          "Nb_Reviews": 1,
          "Date": "2018-08-28T15:22:12.000Z",
          "Titre": "Mychoicesoftware appears to be a scam",
          "Contenu": "Mychoicesoftware appears to be a scam. They sold me an 18 month old version of dragon nuance software. Then when I called Nuance to upgrade they said My Choice Software was not a certified reseller and I could not get a refund!!!My choice software (Mychoicesoftware.com) refused to give me a refund or even a credit for the latest version. My poor mother is out $99.  STAY AWAY - there are many valid software resellers out their - MYCHOICESOFTWARE is not one of them.Also note at the bottom of your order confirmation they offer $5 credit for a 5star review. This seems illegal or at least unethical."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marcus Ebert",
          "Nb_Reviews": 1,
          "Date": "2020-05-17T13:47:28.000Z",
          "Titre": "I PURCHASED AN UPGRADE FOR WINDOWS 10 PROFESSIONAL.",
          "Contenu": "I PURCHASED AN UPGRADE FOR THE AMOUNT OF $129.99 AND WENT THROUGH THE INSTRUCTIONS MY CHOICE SOFTWARE SENT ME. HOWEVER THEY HAD ME DISCONECT FROM THE INTERNET WHICH I WAS STILL ABLE TO FUNCTION AND DO AS THE INSTRUCTION SAID, HOWEVER IT DID NOT MENTION WHEN I SHOULD RECONECT TO THE INTERNET UNTIL SETTINGS/ACTIVATION TOLD ME TO. AT THE END I HAD A ACTVATION DONE. YET NO WINDOWS 10 PRO WAS INSTALLED AND I FEEL THAT THERE SOFTWARE SUPPORT TEAM COULD BE QUITE A BIT MORE HELPFUL CONCIDERING MY CONDITION.MY QUESTION NOW IS SINCE THEY SNOW WHAT?AID ONCE THE INSTALLATION IS ACTIVATED IT BECOMES NON-REFUNDABLE.?MARCUS EBERT SO FAR VERY DISATISFIED."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Watts",
          "Nb_Reviews": 2,
          "Date": "2020-10-20T13:18:24.000Z",
          "Titre": "So far I am very disappointed with…",
          "Contenu": "So far I am very disappointed with Mychoicesoftware.  I ordered MS Office Home and Student this morning and waited 2 hours for my email with download instructions and license key, which should have arrived within 30 minutes according to their website.  (My credit card was charged immediately.) I called the customer support and spoke to someone that explained they were out of stock of that version.  I asked about an upgrade to next level of product, since their website states: \"Due to product availability, you may be upgraded\".  This appears to not be an option either. On a positive note, customer service person was very polite and friendly.  Order #2000438221"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Grant H. Butler Sr.",
          "Nb_Reviews": 3,
          "Date": "2016-06-11T18:23:18.000Z",
          "Titre": "HARD TO TELL IT WON\"T SUCESSFULLY DOWNLOAD",
          "Contenu": "Ive tried several times to download this MS Office 2010 package only to continue to get a \"failed to download\" message at the end of the process. Tired of MS and PC issues. Been dealing with this all of my professional career and it's not going to change any time soon, that I'm sure. O yes and just one more thing. You want my opinion and at the end of this survey I have to agree to your \"Terms & Conditions\" to what? More garbage then I already have to deal with.I was tempted to just delete the whole thing and walk away but to make my case I had to give it a go."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TRISHUL GOSWAMI",
          "Nb_Reviews": 1,
          "Date": "2016-12-11T17:20:41.000Z",
          "Titre": "Concerned",
          "Contenu": "I received a charge for 9.99 on my credit card from My Choice Software and I did not purchase anything from the site for that amount. Also, there was no phone number provided to contact someone about this charge. I will not be using this service again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeffery Johnson",
          "Nb_Reviews": 1,
          "Date": "2020-02-15T05:17:48.000Z",
          "Titre": "My license failed to authenticate and…",
          "Contenu": "My license failed to authenticate and activate Windows 10 Pro. When I spoke with Microsoft, I was informed that the key I was provided was an illegally sold volume key, licensed only for business computers, not home computers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "eric wimsatt",
          "Nb_Reviews": 1,
          "Date": "2016-10-03T15:58:52.000Z",
          "Titre": "horrible customer service",
          "Contenu": "three times now i have waited on the phone for someone to answer and everytime 4 minutes into waiting i was hung up on. then to make matters worst if u click to leave a message it will take you to a dead end where no voicemail box has been set up"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cab",
          "Nb_Reviews": 4,
          "Date": "2019-10-15T07:45:48.000Z",
          "Titre": "I ordered a cloud product that never was delivered.",
          "Contenu": "I ordered a cloud product. It should have been delivered in about 10 days after the order was placed. It wasn't. I contacted them again. It should have been delivered again the same time frame. It wasn't. I contacted them again and they said sorry again and resubmitted an expedited order. It should have been delivered in a shorter time period. It wasn't. They blamed their automatic ordering system for ordering the wrong thing, and then cancelled the order. Ummmm, yeah....what's your excuse for the other two times? The dog ate your order and the ordering system couldn't count to one from zero? Overall lame second time using them. Never again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kent Lilyerd",
          "Nb_Reviews": 1,
          "Date": "2016-06-14T18:09:33.000Z",
          "Titre": "Still waiting",
          "Contenu": "We ordered Excel last week then learned we had to purchase a license which we did a few days later.  I registered the license yesterday and I have still not received the Excel product we ordered.  Order numbers:6/3 20001322396/6 2000132785"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer Roberton",
          "Nb_Reviews": 1,
          "Date": "2020-11-17T19:19:24.000Z",
          "Titre": "I purchased Microsoft Home Office from…",
          "Contenu": "I purchased Microsoft Home Office from the My Choice Software site.  Their site indicates you will receive a code within 30 minutes.  I continued to check my inbox and Spam folder for the code and did not receive it.  Approximately 12 hours after my purchase I contacted My Choice and was informed they had sold out of codes and that they might have some available Friday, 4 days after my purchase date.  Their site did not indicate the item was backordered.  I cancelled my order and purchased from Best Buy, who ended up Price Matching my order AND the code arrived immediately to my inbox.  Just out of random curiosity I went back to the My Choice site to see if the item was still listed as having stock and it was."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas Weaver",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T17:31:11.000Z",
          "Titre": "The instructions that were given were…Baffling",
          "Contenu": "The instructions that were given were to activate the software with the key then provided in the initial instructions into the provided spaces, which I did.That allowed me to download the product.After downloading and initiating the program, I was then asked again to provide a key, so I entered the key once again.  It responded with \"that key has been used and cannot be used to activate the program\".  What's with that? What does one do?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andre Bajew",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T14:39:17.000Z",
          "Titre": "Good price but not a legit license",
          "Contenu": "Good price but not a legit license. Upgrading Windows 11 Home to Windows 11 Pro. Delivery of the license was speedy. Then they tell you to disconnect from the internet and use 1st code, then reconnect to the internet and activate with this 2nd code except it had already been used and would not activate. Then was asked for my laptop properties, maybe it was my personal problem & never got a legit license.  Pros: Cheaper & Fast   Cons: Not legit and left a mess for me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ken King",
          "Nb_Reviews": 1,
          "Date": "2022-07-03T00:07:10.000Z",
          "Titre": "False Advertising and Fraud",
          "Contenu": "This site advertises rewards points on every purchase. But, this is a lie and fraudulent. First of all you don't get rewards on \"every\" purchase, you only get rewards on select purchases. Even worse, you can't actually use the points you get for future purchases. I have had to call in no less than 8 times to try and get my points used. They conveniently hide the button that lets you use points for your purchase. I have tried multiple browsers, incognito, deleted cookies and history, none of their suggestions worked. These people are just engaging in a boatload of false advertising."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Diana Dee",
          "Nb_Reviews": 1,
          "Date": "2021-12-12T19:15:36.000Z",
          "Titre": "Office 2019 Home & Business Installation",
          "Contenu": "I purchased Office 2019 Home & Business on Dec. 6. I received my new laptop on Dec. 7 and installed Office Dec. 12. I followed the instructions for installation sent by mychoicesoftware. The setup process did NOT ask for the activation key, but reported that setup was complete.When I opened Word, I was asked for the activation key. I entered it, but a message appeared saying that the key had been used. I was sent to Microsoft activation and had to activate by phone. That process required sending TEN SEVEN-DIGIT numbers, then receiving and typing, TEN SEVEN-DIGIT numbers. What a pain!Two minor points:The sales interface never said this was 32-bit software, not 64-bit.The installation instructions do not tell us to right-click the image drive letter and then choose \"eject.\""
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Lynch",
          "Nb_Reviews": 2,
          "Date": "2021-12-07T19:25:00.000Z",
          "Titre": "I need help in downloading windows 11",
          "Contenu": "I need help in downloading windows 11. I called for help and your employee hung up on me because I could not copy and paste without a mouse on my new laptop,  This leads me without windows 11, So you could say my experience was useless in transferring from Windows 10,"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "PB",
          "Nb_Reviews": 1,
          "Date": "2022-04-16T22:03:40.000Z",
          "Titre": "Spend the extra $ and go right to the source",
          "Contenu": "Purchase was relatively simple, though the email with the activation code for Windows 10 didn't come through for about 12 hours. I followed instructions for installing Windows 10 from a USB thumb drive, and it installed as advertised--but then the activation key didn't work. Microsoft's solutions are a maze of recursion and self-contradiction, and nothing from Mychoicesoftware helped to clear up the confusion. I needed to get Windows up and running swiftly, and I'm coming up on 24 hours into what should have been a simple installation and activation. I know Microsoft is a nightmare, but I'm wishing now that I'd just bought the (admittedly more expensive) option from the Microsoft Store.Followup: Mychoicesoftware gave me instructions as to how to get in touch with Microsoft. Microsoft Support walked me through the verification process and informed me that the software activations had been \"exhausted\" and that they couldn't help me. I've gone back to Mychoicesoftware to see what their solution is but given the time and energy I've invested to get this to work, I am definitely paying for having cheaped out. Will edit again when I have some sort of resolution, but the vibe is bad."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Zach",
          "Nb_Reviews": 1,
          "Date": "2021-04-03T02:48:51.000Z",
          "Titre": "The product would not activate without the proper key",
          "Contenu": "The product would not activate without me contacting support. the activation key sent was not an active key............"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Willie",
          "Nb_Reviews": 1,
          "Date": "2021-08-05T18:43:02.000Z",
          "Titre": "difficult download",
          "Contenu": "it was difficult downloading the Office program on line.a disk would have made it so much easier."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Beverly Policastro",
          "Nb_Reviews": 1,
          "Date": "2022-04-02T16:34:39.000Z",
          "Titre": "I ordered and paid for STUDENT & HOME…",
          "Contenu": "I ordered and paid for STUDENT & HOME ed. last eve. 4-1-22.   Still have not been able to download & install it !Sr. Beverly Policastro"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Disappointed.",
          "Nb_Reviews": 1,
          "Date": "2016-10-01T10:55:33.000Z",
          "Titre": "Not what I expected.",
          "Contenu": "I wanted Nuance 8 as a PDF converter.  With that no longer available, the sales team sent me what they said was equivalent.  It is NOT.  I needed software that would convert not only to a PDF, but convert the PDF to a JPEG or others as well.  It does convert them to word, excel, etc, but to to a JPEG.  So feel as though I waited over a month to get the software, and then found it useless to me.  Very disappointing!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DEE GRAHAM",
          "Nb_Reviews": 1,
          "Date": "2016-06-10T20:03:02.000Z",
          "Titre": "UP Date of Microsoft Office",
          "Contenu": "The download progressed well but  included requirements to remove several earlier version files.  This proved to be a real critical  disaster, moving many of my  very important files to my recycle bin. I need help to recover these lost files!  At the least, you should have included an appropriate warning about potential loss of data..  I probably will never  again download a file from My Choice Software."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sean",
          "Nb_Reviews": 1,
          "Date": "2016-06-17T23:08:49.000Z",
          "Titre": "Windows 10 key does not work",
          "Contenu": "Windows 10 Pro key was not accepted for activation.   Microsoft's verification site doesn't even recognize it as a valid key.  After 20+ years in IT, I'm not going to fight the nonsense anymore with keys that don't work.  I just gave up and used my original Windows 7 install on a new build and explained the situation to MS and got the activation to Windows 10.   Didn't need to buy this at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Liz",
          "Nb_Reviews": 1,
          "Date": "2016-11-15T20:05:14.000Z",
          "Titre": "Difficulty installing",
          "Contenu": "I had a lot of problems installing this package onto my brand new apple computer. In fact, I'm not even sure if it actually worked. I spent approximately 8 hours on chat with microsoft help desk and in the end I'm not sure if my code was actually used or if a free trial was installed. I am extremely displeased and would appreciate help with this problem."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "April Stephens",
          "Nb_Reviews": 1,
          "Date": "2016-04-28T20:08:54.000Z",
          "Titre": "Wrong information given about product",
          "Contenu": "I was told that I could restore a backup file from another Sage 50 product as long as I had a Sage 50 product.  No mention at all that I had to have an equivalent version and now I have spent money that is unnecessary because I cannot restore the file.  The sales associate assured me I would not have a problem.  I am very unhappy that I was given incorrect info.  I would like a refund of the cost I paid for the software."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeff B",
          "Nb_Reviews": 1,
          "Date": "2016-08-27T21:13:18.000Z",
          "Titre": "Emailed me invalid product key",
          "Contenu": "I ordered Word 2007 and they sent me an invalid product key to unlock the program. I emailed customer support, and their reply was \"could you be more specific?\"  At that point I felt like going into specifics about what I'd like to do to them. SEVERAL emails later the situation was resolved. My headache, however, took some tylenal."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Barbara J Black",
          "Nb_Reviews": 2,
          "Date": "2016-08-18T04:11:31.000Z",
          "Titre": "The Instructions Stink!!!",
          "Contenu": "The instructions that came via email are grossly inadequate. I have tried to install Windows 10 Professional several times in the past week without success. My employment makes it impossible to call the Help Desk during their hours, so I am going to have to take time off work and call for assistance.I sure hope that call goes better than my attempts to install this software. Previous experiences with this company have been very positive but this one has been a complete bust so far!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Roger",
          "Nb_Reviews": 1,
          "Date": "2016-08-17T14:28:51.000Z",
          "Titre": "Would not download",
          "Contenu": "Could not download. MyChoice tech support could not fix. Also, the very polite and pleasant tech worker was not understandable half the time. It took twice as long because of that. Finally, Microsoft technician had to fix it. The whole process took over three days. Just buy it from Microsoft. You dont need these guys"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "jh",
          "Nb_Reviews": 1,
          "Date": "2016-09-21T00:36:44.000Z",
          "Titre": "not great",
          "Contenu": "It was hard to download the program.  After I figured out where I could download the program from it said that I did not have a valid Key code for the program so I had to call for assistance.  It should have been as simple as download the program and enter the code but it took much longer and was not that simple."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ted",
          "Nb_Reviews": 1,
          "Date": "2017-10-06T11:42:59.000Z",
          "Titre": "$9.90 / mo. charge",
          "Contenu": "I also got hit with the $9.90 / mo. fee for MS Home Office.  Granted, I wasn't as careful as I could be about checking all the charges on my credit card, but I do keep an eye out for extra fees when I make an initial purchase (especially licenses), so I'm surprised that this one snuck past me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Luke Bergner",
          "Nb_Reviews": 1,
          "Date": "2016-12-06T01:37:43.000Z",
          "Titre": "Frustrating",
          "Contenu": "Link to download the software didn't work, so they sent me a second link which also didn't work so then they sent me a drop file that finally worked, but then the activation code they gave me wouldn't work. Turns out the drop file wasn't compatible with any activation codes. So after about 4 hours of going back and forth with the MyChoice team they suggested I talk to Microsoft directly. Microsoft got me set up in about an hour. Just go with Microsoft directly if you want to avoid friction."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bryan Zayas",
          "Nb_Reviews": 1,
          "Date": "2016-04-20T20:19:09.000Z",
          "Titre": "License previously activated",
          "Contenu": "I bought MS Office Professional 2013 and after installation the activation failed. Apparently the license had already been activated the maximum number of times allowed by Microsoft.\r I end up having to call Microsoft to finish the activation process. I've never had this problem with legitimate software."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Micheline Briere",
          "Nb_Reviews": 1,
          "Date": "2016-05-11T18:52:03.000Z",
          "Titre": "my printer",
          "Contenu": "I bought a printer from you but the cartridges were not in the box. I contacted you but got no answer from you. I had to go out and buy them myself $55.11 This should have been included. To say the least I feel I should be R embers ed for this. I tried to call and even sent me Moe's but still got nothing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Justin Graham",
          "Nb_Reviews": 2,
          "Date": "2016-09-22T22:35:54.000Z",
          "Titre": "This is one of the worst buying experiences I've ever had, from an administrative perspective!",
          "Contenu": "I purchased a monthly subscription to Microsoft Office Business and what was suppose to take just hours to install and activate took almost a WEEK! I'd call everyday and get the same response, \"Oh your lisence is coming directly from Microsoft, not us. We'll send them an email.\" I heard that everyday I called in. It was very frustrating to feel like no one could help me or truly expedite the solution. It was just a waiting game that no one knew the timing of. I'd never do this again. Ever!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Burkett Farquhar",
          "Nb_Reviews": 1,
          "Date": "2016-03-16T17:15:09.000Z",
          "Titre": "subscription wa not clear",
          "Contenu": "I had purchased the program thinking i would be purchasing a copy and not a subscription.  I was disappointed to find that it was not clearly stated when  buying the office suite.  Please be cautious when posting product details. I am not looking forward to having to pay this same fee again next year."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "vanessa weir",
          "Nb_Reviews": 1,
          "Date": "2016-08-14T13:04:37.000Z",
          "Titre": "I didn't get the program that I paid for.",
          "Contenu": "I never got the program that I paid for. After several back and forth E-mails, I finally spoke to a person who took over my computer and downloaded the program; or so he claims. I cannot see or access this program, although he claims that the fault is with my Windows 10 installation."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marcy Bennett",
          "Nb_Reviews": 1,
          "Date": "2016-08-22T02:46:59.925Z",
          "Titre": "Option to intall on another computer not practical",
          "Contenu": "I am a PC user who is most comfortable with microsoft office so I bought it for my new macbook pro.  As I am still learning the ins and outs of my new operating system and also because I have extremely slow DSL, it took more than 24 hours to load the software on to my new machine.  The offer to be able to load it on to my husband's machine for a reduced price only lasted 24 hours so when I called, it was no longer available.  Not everyone is a computer wiz.  Too bad they wouldn't honor the deal.  I won't be doing business with them again"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christina Cummings",
          "Nb_Reviews": 1,
          "Date": "2016-08-23T13:18:08.000Z",
          "Titre": "Confusing and disappointing",
          "Contenu": "I purchased Office 365 Business and I got about 8 different emails over the next couple of days, none of which brought me to where I actually can view my purchase.  I went in circles in some of the registering pages, where it just kept bringing me back or telling me I couldn't access it.  I tried calling customer service several times but it said they were closed, although it was during their working hours.  I ended up canceling the order and purchasing somewhere else, but still was charged a 15% restocking fee from Microsoft.  Very disappointing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Megan Simpson",
          "Nb_Reviews": 1,
          "Date": "2016-09-05T12:21:23.000Z",
          "Titre": "Office 2010: Troubles with activation and errors with Power Point",
          "Contenu": "I was given a twenty four digit activation code. It needed twenty five. Got that fixed.My Office 2010, that I purchased, when I try to open Power Point, it gives me an error message. I' ve been dealing with this for over three weeks without resolution! Very frustrating!!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jerry Mills",
          "Nb_Reviews": 1,
          "Date": "2016-03-24T16:38:11.000Z",
          "Titre": "Sold me a bad product key",
          "Contenu": "I've now sent 10 messages about my bad product key and the company Finally fixed.  I called the tech support line and they logged into my computer and forced Activation by calling Microsofts 1-866 number it seems that my phone hot spot confused Microsoft into believing i was from a group, and would not allow me to perform activation.  However having to wait 7 days to activate my software was unacceptable.   The email address response were cliche at best, trying to tell me I was the problem.  The tech on the line saw my review and told it wasn't his fault."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Helen Meyer",
          "Nb_Reviews": 3,
          "Date": "2016-06-28T22:11:31.000Z",
          "Titre": "Customer service lacking",
          "Contenu": "While we are now satisfied with the product it took 2 emails and 3 phone calls over several days to download. What was supposed to be a simple process was drawn out and frustrating. If we had not all ready paid for the product we would have cancelled and gone elsewhere."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Liz",
          "Nb_Reviews": 1,
          "Date": "2016-10-02T04:19:06.000Z",
          "Titre": "Purchase of Norton Security",
          "Contenu": "My subscription was expiring and needed to be renewed, but it was the 360 version so I had to purchase an updated version.  I followed the instructions in the email but they did not work and sent me to a page that was \"expired or outdated and no longer available.  Basically, the Email links did not work.  Multiple emails back and forth and I included screen prints to show what I was experiencing.   So I had to go to Norton direct to purchase.  Asked for a refund from MyChoiceSoftware, so we'll see if that happens.  I'm not a tech but I am not an ignorant consumer either."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marc DeWitt",
          "Nb_Reviews": 1,
          "Date": "2016-07-08T22:39:01.000Z",
          "Titre": "sent me wrong product, waiting a week for a response still",
          "Contenu": "give me a refund or the correct product i ordered.  i ordered Windows Home Pro, they sent me Windowns Home Premium. i asked for a refund they said we are sending it to our support team, its been a week and no word from the \"support team\". please"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeffrey Nelson",
          "Nb_Reviews": 1,
          "Date": "2016-05-02T17:40:21.000Z",
          "Titre": "Why The MEGA DOWNLOADER?",
          "Contenu": "I received the licenses for the software I purchased in My Email, no problem, I didn't see until after I purchased that COA Labels were Extra.\rThe MEGA DOWNLOAD is intrusive and cumbersome... a secure FTP site would have been cleaner and NO extraneous software required for the customer to install and un-install and block unsolicited emails from MEGA.\rI purchased 8 more Items and will not be downloading the ISO as I have one already.. BTW the ISO that was downloaded, Automatic Updates failed with 800X7000E error code and would not update. Our Dell installation disk did not have that same Issue."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ray Fisher",
          "Nb_Reviews": 1,
          "Date": "2017-07-11T12:08:14.000Z",
          "Titre": "Inadequate Service Reps.. Outright lies",
          "Contenu": "Thank you for reaching out to MyChoice Software! Microsoft has been experiencing intermittent activation issues. BULLDuring the activation prompt, you are asked whether you would like to activate via the web or activate via telephone.  AGAIN BULLHere are the steps to follow:  WRONG STEPS 1.Elect to activate via telephone2. Select your Region. (The prompt will tell you that activation via telephone is no longer supported for your product if your product is older than 2016. That is okay!)3. Take a quick screenshot of the Installation ID included in Step 2 of the telephone activation wizard.4. Send us, in a response, the Installation ID screenshot"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Luis Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2016-08-25T12:01:57.000Z",
          "Titre": "Luis Ridriguez's review",
          "Contenu": "It took me several days to resolve my problem that had an easy solution. Your canned responses which were repeated several times did not help.  It was not until the last person who I spoke to that the solution was evident"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Davd Williams",
          "Nb_Reviews": 5,
          "Date": "2016-09-27T19:30:28.000Z",
          "Titre": "Round 4 Support isn't on top of it.",
          "Contenu": "Round 1I ordered a license key and it didn't work.Doesn't mean that they won't make good, but they don't get excellent if they can't deliver the first time.Heard from Support via email... they haven't helped at all.Tried calling, still sitting on hold.... Round 3Dropped rating by one point. getting frustrated. Waiting for email response... still more time wastedRound 4 Called again.Got someone who had a clue.After wasting half a day screwing around I got a new install key... something that should have been done with the first email.They have good prices, but support is a crap shoot. You might be able to get someone good. They should credit me for for their incompetence."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas Beveridge",
          "Nb_Reviews": 1,
          "Date": "2017-02-07T16:15:58.130Z",
          "Titre": "Couldn't believe this-",
          "Contenu": "Tried to order RAM from these guys. Said it was in stock, took my credit card information, the next day I was emailed about my items not being able to be sent, not being in stock, and not even in MCS possession. Pretty horrible in our technological age to be selling things that you are not in possession of and especially not keeping a current stock of items that you are trying to sell of someone else's. The customer service agent offered me one alternative type of RAM, that was a slower speed and didnt have a heat sink. Although it was a good price, it was totally inferior RAM. Did receive a refund. Awaiting the details on my credit card. Hopefully wont have any more problems with this place. I definitely wont make another purchase from them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 4,
          "Date": "2016-07-20T15:21:41.000Z",
          "Titre": "The product was not as described.",
          "Contenu": "From the website it looked like the microsoft office package was a one time purchase. It turned out to be an annual renewal. I feel I was misled on this and would not recommend these people."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dot Freeman",
          "Nb_Reviews": 2,
          "Date": "2016-12-10T05:43:30.000Z",
          "Titre": "dishonest",
          "Contenu": "I purchased the windows 10 on 11/25/2016 I received a flash drive on 12/9 2016 in between this time I was on the phone several times and the delay was blamed on the post office. when I spoke to the post office they informed me it was the fault of the company they did not even reeive it until the 1st of dec also when I called for help the girl told me to call hewlite pachard because my computer was messing up I called them and there was nothing wrong with my computer it was the original download from your website that had put me in a loop so I figured it out myself and after about 3 hours I finally got the flash drive to download windows 10 all you had to do was be honest with me about the way you send out shipments and help with thw install all I got for all this was a lousy 5 dollar refund"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MICAH BEACH",
          "Nb_Reviews": 1,
          "Date": "2016-11-22T16:44:14.000Z",
          "Titre": "stop with the spam.",
          "Contenu": "When I buy something I shouldn't be spammed almost every day after that. I chose to NOT receive offers or other emails but yet I have received one almost every day."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark Gately",
          "Nb_Reviews": 1,
          "Date": "2016-06-12T03:15:38.000Z",
          "Titre": "Unable to Activate Software",
          "Contenu": "MyChoiceSoftware offers Microsoft software like Visio through volume licensing with only requirement being an .edu e-mail address. Unfortunately, this is delivered via an ISO installer type downloaded from Microsoft, and this installer type is not compatible with other installer types like Click to Run. Simply put, you can get a great price but you may not be able to install it. This isn't MyChoiceSoftware's fault, but this issue isn't disclosed, and they have no other option to get you installed without spending hundreds more for a different install type of the identical software.The company has been responsive with support, but refund is taking longer than it should. In all it has been a big hassle, and the software I wanted is not installed. MyChoice Software has an opportunity to inform their customers of this issue prior to purchase."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2016-03-16T16:18:43.000Z",
          "Titre": "They will tell you what you want to hear",
          "Contenu": "Exceptionally irritated is an understatement. I have a computer that I specifically want to keep off of the web. The software shown on the website was download only. In a web chat with their sales support, I explained my issue and was told that if I purchased a &quot;Retail package&quot; of the software I would be able to load it without a web connection. The retail package cost more than the download and I had to pay shipping. When I received it, there was no disk, only the key code in the package. I called their customer support and was told that I could download the software to a flash drive on a connected computer and then move it to the desired computer and activate it by phone. The reality is that you cannot even begin a download without providing the key code. So much for knowledgeable customer support. Nothing worked but to compromise my sterile system."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Erin",
          "Nb_Reviews": 1,
          "Date": "2016-11-28T16:14:48.000Z",
          "Titre": "Poor service",
          "Contenu": "Didn't receive the license in the time frame I was told, and also wasn't told I would need to purchase an additional license in order to download."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "lchriste",
          "Nb_Reviews": 2,
          "Date": "2017-05-04T16:30:56.000Z",
          "Titre": "I purchased Microsoft Office for Mac …",
          "Contenu": "I purchased Microsoft Office for Mac 2016.  A conflict between Mac OS Sierra and MS Word Mac 2016 surfaced within a month of my purchase (MS Word Open command hangs if Mac Sierra (10.12.3) dictation commands are turned on.  This results in Force Quit of Word and corrupted preferences.  Turning off dictation entirely solves the problem.  If dictation is turned on after opening Word, the problem remains.  The conflict was confirmed by Apple, but they are unable to view Word programming in order to pinpoint the issue.  I have sent logs demonstrating the problem to Microsoft support with no response.  This remains unresolved. This is a major conflict for anyone who uses dictation to help compose written documents, especially those who are physically or visually disabled.My only issue with Mychoice software is that, as a Microsoft affiliate, they have not been able to troubleshoot or advocate for me.Buyer beware."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joey Keith",
          "Nb_Reviews": 1,
          "Date": "2016-08-30T23:25:33.000Z",
          "Titre": "I can get it to work, as simple as that!",
          "Contenu": "I was happy to get this.  I can't figure how to get it to work.  I can get it to do part but not all.  I'm disappointed in the program and me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Barbara Scanlon",
          "Nb_Reviews": 1,
          "Date": "2016-05-01T20:18:30.000Z",
          "Titre": "This program doesn't deserve two stars",
          "Contenu": "I am ready to quit.  I am really disappointed in the installation process.  The assistant I had was NO help."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mindy",
          "Nb_Reviews": 1,
          "Date": "2015-11-29T19:12:17.279Z",
          "Titre": "Problems with Windows 10 download",
          "Contenu": "I've had one long series of problems upgrading to Windows 10.  Initially, I received an email offering me a free update to Windows 10, but when I used the link that was emailed to me, the Windows 10 update was installed, but my Windows 8.1 was not replaced, so my computer seemed to have both systems battling it out. (That was the consensus of our two IT guys, our internet provider, and the two senior technicians at the Microsoft store with whom I consulted.)\r Due to the many problems I experienced as a result of this issue, I decided to just purchase a new Microsoft license and start over. Yesterday I purchased Microsoft License for Home Order #20076620.  When I received my activation code, the email said that the Windows 10 Home version that I had purchased was out of stock so I had received a complimentary upgrade to the Pro version.  I then initiated the Windows 10 download with the link provided, which went fine until I entered the license code that was sent in that same email.  Then I got this error message: \"This key doesn't work with this edition of Windows. Try a different key.\"  \r Overall, this entire process has been very frustrating, as I've consistently followed the instructions in the emails that Microsoft sends."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Hetterscheidt",
          "Nb_Reviews": 2,
          "Date": "2016-10-07T00:40:18.000Z",
          "Titre": "Unable to download",
          "Contenu": "Not sure who was at fault but the program would not download and had to be returned."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Grace Suchyna",
          "Nb_Reviews": 3,
          "Date": "2017-01-04T04:21:30.000Z",
          "Titre": "I won't purchase here again - Product received, but they tried to charge me for things I did not want without my permission",
          "Contenu": "I received my Microsoft Office subscription with no problem.My complaint is that for several weeks after my purchase I received emails telling me that I had received 5 \"complementary\" installations for Office 365 with my purchase to be used on separate computers, and it asked whether or not I would want these. Cool. I didn't know whether I would take advantage of the offer or not, so I did not reply yet. Then after about a month I received an email saying that in a few days I would start being charged $10/month for these subscriptions unless I said otherwise.So... they signed me up for a \"complementary\" subscription that I did not ask for and were going to charge me if I didn't \"opt out!\" I used my credit card on their site to buy one thing - I did NOT give them permission to save my credit card information to be used to purchase other subscriptions that I didn't specifically say I wanted. I did reply and \"opted out,\" but in order to charge me, I should need to opt in, not just not opt out. And after they sent me like 5 emails saying over and over that it was complementary, it could have been very easy to miss the email that said they would start charging me in a few days. Very unprofessional and unethical in my opinion. I won't be purchasing from them again, because I don't trust how they will use my credit card information."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lynda Chalfant",
          "Nb_Reviews": 1,
          "Date": "2020-08-14T15:18:55.000Z",
          "Titre": "after I downloaded the program i was…",
          "Contenu": "after I downloaded the program i was not able to open  the program"
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "D M",
          "Nb_Reviews": 1,
          "Date": "2016-09-23T03:30:06.000Z",
          "Titre": "No receipt",
          "Contenu": "Never received a receipt showing what I bought with total price."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rohit Shete",
          "Nb_Reviews": 1,
          "Date": "2016-03-14T21:03:07.000Z",
          "Titre": "Poor Service",
          "Contenu": "Got wrong PIN for the software, had to call 3 times."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Roger Meyer",
          "Nb_Reviews": 2,
          "Date": "2016-04-20T21:39:52.000Z",
          "Titre": "Reimage",
          "Contenu": "Software purchased was misrepresented."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ellis Sharadin",
          "Nb_Reviews": 2,
          "Date": "2016-10-03T04:46:58.000Z",
          "Titre": "Not as easy as it sounds",
          "Contenu": "After purchasing a license for Microsoft Publisher, I received an email with instructions for downloading the program. It stated only 3 steps were required: \"1. Click on the preferred download link.2. Once the page loads, select \"Download.\"3. Insert key code when prompted and you're all done!\"Well, that was a fabrication! I was given a download link with DropBox and when I got to the page, DropBox told me I needed to sign up for the service.  I contacted MyChoice and they told me to bypass the DropBox signup, so I did, and then I was able to download. However, during Setup after typing in the Product Activation Key, the Software reported that \"too many downloads had been made using that Key\" and refused to let me continue the Setup! So, I had to contact MyChoice again with a problem.  When I got their response a day later, I was told I had to accomplish the telephone call-in to Microsoft to get my software to activate. I had to leave on a business trip so it was 3 days before I could attend to it. The Microsoft activation stuff itself is nuts: you have to carefully copy about a dozen sets of letters/numbers before you finally achieve the activation for your software. In other words, Step 3 above \"insert the Key Code and you're all done!\" is a bunch of baloney, as this took me not only hours of my time directly working on trying to activate the software, but it ran into days because of delays communicating with MyChoice. How is that a good experience? And furthermore, if I should have to re-install my software after reloading Windows 10 at a later date, am I going to have to go through this nonsense all over again?  Sure, Microsoft Publisher now works on my comuter, but believe me, you're better off paying a little more to get the software on a DVD and avoid this activation license procedure! It's too much hassle, especially if your time is valuable to you and you have better things to do than sit at your computer all day. MyChoice Software needs to be up-front about the procedure and tell buyers that it may be much more complicated than they are claiming."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alex Torrella",
          "Nb_Reviews": 1,
          "Date": "2016-07-16T23:00:17.000Z",
          "Titre": "didn't work",
          "Contenu": "Key was locked and didn't work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas Buchner",
          "Nb_Reviews": 1,
          "Date": "2016-03-13T18:50:29.000Z",
          "Titre": "I am having problens",
          "Contenu": "I can not get the software to work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paige McLean",
          "Nb_Reviews": 1,
          "Date": "2020-06-02T19:53:56.000Z",
          "Titre": "doesn't work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sebastian Balfe Dangerfield",
          "Nb_Reviews": 2,
          "Date": "2016-04-20T12:02:17.000Z",
          "Titre": "Okay",
          "Contenu": "okay or maybe okay"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gene Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T02:14:52.000Z",
          "Titre": "easy download",
          "Contenu": "the product was a lot easier to download than I thought it would be."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark & Tiffany Brotemarkle",
          "Nb_Reviews": 1,
          "Date": "2021-11-30T02:49:29.000Z",
          "Titre": "Found I created the human error",
          "Contenu": "After completing my purchase of Microsoft 365, I followed provided link to download my purchase. After entering my product code nothing further happened. I was unable to download Microsoft 365. Very disappointed.After reviewing the product code I copied and pasted, I realized I had included the \":\" in front of the product code which caused the problem. Human Error not anyone's fault but my own."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chuck",
          "Nb_Reviews": 1,
          "Date": "2021-04-13T15:46:29.000Z",
          "Titre": "Be sure to read what you're ordering",
          "Contenu": "Be sure to read what you're ordering, before you order. I order the Microsoft Office Home and Student 2019 and installed it. I had a problem installing it and I called customer support and they were very helpful in getting it installed.  Then  I tried to use Outlook, I was denied and was informed that Outlook was not part of the MS Office that I purchased. I called customer support again and was told that since I already installed Office, I couldn't get a refund nor exchange, since the activation code was a one use code (which I understand). He did offer to give me a $10 off coupon to purchase MS Home & Business $174.99-$10=$164.99.  Customer service would get 5 stars, just that I assumed that outlook was included with the Office version that I purchased for $92."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jerrell Messenger",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T21:13:56.000Z",
          "Titre": "Dislike after purchasing the up to date…",
          "Contenu": "Dislike after purchasing the up to date software for my home computer.  Did not want to install automatic after several hours."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephen Laplante",
          "Nb_Reviews": 2,
          "Date": "2021-09-21T15:56:42.000Z",
          "Titre": "I think the instructions could have…",
          "Contenu": "I think the instructions could have been better. I t took several attempts to make it work. It was a liitle confusing shutting off the internet and when to turn it back on."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wayne",
          "Nb_Reviews": 3,
          "Date": "2023-01-21T00:23:16.000Z",
          "Titre": "MS 2016",
          "Contenu": "It turned out to be more difficult installing this software than I thought it would be. The support staff was great as I needed it several times."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carole Shoquist",
          "Nb_Reviews": 2,
          "Date": "2023-02-25T02:14:28.000Z",
          "Titre": "Clarity on need to activate",
          "Contenu": "Could have been more clear on needed to activate each program."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eugene Elcik",
          "Nb_Reviews": 2,
          "Date": "2022-10-20T02:21:43.000Z",
          "Titre": "TGechs gave up on me.",
          "Contenu": "I am significantly disappointed trying to get help from techs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ICDS",
          "Nb_Reviews": 1,
          "Date": "2020-11-04T21:59:43.000Z",
          "Titre": "The site itself was user friendly",
          "Contenu": "The site itself was user friendly. I found the download and install process to be fairly difficult. I kept having to call in to enter a provider code and then confirmation code before it would accept it (I was beginning to think it was a scam for a while). It did end up working in the end, but it took about 1.5 hours compared to the 20 minutes that it's taken me in the past with other websites."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 7,
          "Date": "2020-08-30T03:53:39.000Z",
          "Titre": "Appears to be a stolen key - Maybe not",
          "Contenu": "Microsoft informs me that the Key I purchased was already in use on another computer.  I quickly received an email and instructions from the company and have successfully registered my software. However, the 3 step process involving special instructions in the command prompt is not something I've ever done before. Not sure why it's necessary."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patrick M",
          "Nb_Reviews": 1,
          "Date": "2018-04-24T02:02:36.000Z",
          "Titre": "I was a little annoyed at the nine day…",
          "Contenu": "I was a little annoyed at the nine day turn around (6business days) for my order to be fulfilled. After speaking to customer support, and having Gabe explain the bulk orders that came in and pushed my order back, I was slightly less annoyed. I would have preferred to be proactively informed of this issue instead of being left in the dark. However, I am one who believes all is well that ends well. So, overall a decent customer experience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Nunez",
          "Nb_Reviews": 3,
          "Date": "2016-11-18T02:42:42.000Z",
          "Titre": "Microsoft Project 2013",
          "Contenu": "The download was next day when I purchased in the evening. Wasn't happy about this. I had some difficulty getting the activation to work. I figured it out myself. The email was confusing. The average person would of been spending time with technical support. It is download and it does work. I was very happy about this. My software hard copy was delivered as promised."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Pierre Deguire",
          "Nb_Reviews": 1,
          "Date": "2016-03-20T13:29:20.000Z",
          "Titre": "Adequate service but lack of guidance",
          "Contenu": "I purchased Office 365 Personal for my new laptop, wishing to add Skype for Business to my laptop. The site I used didn't make it clear about the proper version to buy. Unfortunately I bought the wrong version so had to remove this version and buy the Premium edition. No way for this site to offer any sort of upgrade. So I ended up paying for two licenses , one of which I will never use."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ray G",
          "Nb_Reviews": 1,
          "Date": "2016-03-16T22:17:44.000Z",
          "Titre": "Generally good experience, but..",
          "Contenu": "only problem: I expected to be able to download the software product immediately after my payment was submitted. Instead I got a msg., after paying, that they'd email me instructions for downloading the following business day.  If you're going to take my $ for immediately downloadable software, but not let me do so upon payment, then say so explicitly, in large bold letters. Before I pay."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nate Wheatley",
          "Nb_Reviews": 1,
          "Date": "2016-03-14T14:37:49.000Z",
          "Titre": "Good deal w/ some confusion",
          "Contenu": "This was by far the best deal I found online and I only felt comfortable buying from them because they were rated as a Google Trusted Store.  That being said, the wrong platform product key was sent to me, but they discovered the mistake before I could.  Although, I was still confused and did accidentally validate the Windows platform product key before realizing the alternate email was the new Mac platform product key."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "T.G.",
          "Nb_Reviews": 1,
          "Date": "2016-03-14T17:47:09.000Z",
          "Titre": "License required complicated Microsoft activation but MyChoice Sales Support was helpful in resolving.",
          "Contenu": "Software license didn't work initially.  However, sales phone support person guided me through calling the automated Microsoft activiation support line to get it going.  \rAlso, I ordered MS Project Standard.  It was out of stock, but I was issued a license for Project Professional at no extra charge. \r'Experience could have been much worse for both glitches above."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2016-05-24T19:51:45.000Z",
          "Titre": "Activation Key Was Already Used",
          "Contenu": "The original activation key sent to me was rejected by Microsoft with an error that it had already been activated too many times.  My initial call to tech support at Mychoice required several steps and I never received a new key.  I emailed complaining about piracy and received a new key immediately that worked.So bottom line, they took care of me.  But the excess activation was a flag to me that things might not totally be on the up and up."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Durfee",
          "Nb_Reviews": 1,
          "Date": "2017-06-15T14:08:57.000Z",
          "Titre": "My only issue relates to the download …",
          "Contenu": "My only issue relates to the download link and its incompatibility with different web browsers.  I am on a Mac platform and use Safari as my default browser.  the download link did not work.  It required a phone call to technical department and they suggested FireFox or Chrome.  as with Safari, Firefox did not work either.  downloaded Chrome and was finally able to access the download link.  Would think a \"heads up\" in your instructions would be appropriate."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "April",
          "Nb_Reviews": 1,
          "Date": "2016-05-18T18:34:53.000Z",
          "Titre": "Good Value, but not user-friendly.",
          "Contenu": "The download went smoothly, but I had some difficulties in verifying my license. It was more complicated than I thought.I definitely think there should have been MORE support / explanation / assistance.I couldn't go back to my invoice / transaction page to print out receipt. The email receipt was not clear enough to provide to my company."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matt H",
          "Nb_Reviews": 1,
          "Date": "2016-06-13T15:33:30.000Z",
          "Titre": "Wasn't contacted with payment question",
          "Contenu": "I received confirmation that my order was received, and that I should receive another email with a license code within 30 minutes.  I called 48 hours later to find out what the delay was, and was told there was a question about the payment address.  It was easily resolved, but feel that someone from Mychoicesoftware should have contacted me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kathryn",
          "Nb_Reviews": 1,
          "Date": "2016-03-24T14:37:44.000Z",
          "Titre": "Works perfectly but couldn't register it",
          "Contenu": "Just like my other Publisher and easy to install, but when Microsoft asked for a registration, the code given to me with the software had been used too many times and Microsoft refused to license it.\rSo, as long as I do not want to upgrade in the future or reinstall it, I'm fine.  If one of those two things happen, I will be out of luck."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Harry",
          "Nb_Reviews": 1,
          "Date": "2016-08-23T21:40:00.319Z",
          "Titre": "Could not confirm Add Ins",
          "Contenu": "Attempted to buy Excel 2013, but needed to confirm that the Add-In I required was available for that version.  They could not confirm that, even after consulting with Microsoft.  They were pleasant and professional and tried to be helpful, although I did not  get the answers I needed, so, I needed to get a refund. They charged me a 15% restocking fee and refunded my money after I re-contacted  them 8 days later.  They tried hard, so I gave them 3 stars, and they were courteous the whole time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maria",
          "Nb_Reviews": 3,
          "Date": "2016-04-15T12:36:23.000Z",
          "Titre": "Losing My Faith",
          "Contenu": "I have always had good experiences with My Choice until my last two purchases. I ordered Visio 2016 but it never stated anywhere that you had to have Office 2016 for it to work. They would not give me a refund. That's ok... I'll save it for when we get Office 2016. But then I went back and ordered Visio 2013 and we NEVER could get it to install. Tech support was pretty lackluster on helping to get it resolved.Two weeks later they finally agreed to give us a refund. Not so happy anymore :("
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mr. Locke",
          "Nb_Reviews": 1,
          "Date": "2016-06-03T15:28:40.000Z",
          "Titre": "Software Purchase",
          "Contenu": "The purchase went smooth, but downloading the software did not. I understand that most poor reviews are user lack of knowledge or abilities that then get blamed on the vendor. But I feel confident as a user that the instructions did not line up with the actual procedure for downloading the software."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Russell E McMahan",
          "Nb_Reviews": 1,
          "Date": "2016-11-10T02:56:08.000Z",
          "Titre": "poor experience",
          "Contenu": "I was using Internet explorer 11 to down load. it would get 61% DL and crap out.  Tried the Google garbage and receive software automatic that I did not want.  I ask for a refund and was promised that I would receive it.I has always amazed me about all business can take you money in one day, but takes 7 to 10 days to get a refund. Will become 81 years of age this month and things were simpler back when business were more honest than they are now.  There is hardly a business that does not have some catch to pick your pockets."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CMR",
          "Nb_Reviews": 1,
          "Date": "2016-07-06T12:40:31.000Z",
          "Titre": "Decent price but not without issues",
          "Contenu": "This was a license key order for MS Publisher.  The purchase process was pretty easy and the price was good.  I received a license key fairly quickly.  Unfortunately the key proved to be invalid.  I sent a message to customer support and I was subsequently issued a replacement key.  This key turned to be for MS Office Professional, which is not what I ordered.  I sent another message to customer support and was informed that I was to just use the \"Office\" key and I could install Publisher, which is part of Office Pro."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michele Allen",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T03:23:38.000Z",
          "Titre": "how to launch program",
          "Contenu": "how to launch program?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kailas",
          "Nb_Reviews": 2,
          "Date": "2016-08-13T23:30:23.000Z",
          "Titre": "Not fully trustworthy",
          "Contenu": "The initial Activation code that i Received after the purchase was an incorrect one. After talking to customer service as McAfee (the contact given in the email is not their own service personnel), I was told that the activation code was an inactive one and That I need to contact the company where I purchased it from. With much difficulty, I managed to reach \"Mychoicesoftware\" and did get a new code and installed the product. So it all worked out in the end but for the time and frustration. Not worth the slight reduction in product price, in my opinion."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sci-User",
          "Nb_Reviews": 1,
          "Date": "2016-05-26T22:01:03.000Z",
          "Titre": "Worked out eventually",
          "Contenu": "Was originally sent Windows XP 64-bit, even though I requested 32-bit and it was SP2, not SP3. If you can connect to the internet then I guess it should update/upgrade to SP3, but since I couldn't connect to the internet until it was SP3 (bug with my VM software and SP2) it was a bit of a problem; I want sent a dead link to get SP3 online by customer service and ended up having to find it online myself. All in all, I would say it works and customer service was very quick in answering emails/phone calls, even if they weren't always helpful in solving the issue."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "hylton mcalister",
          "Nb_Reviews": 1,
          "Date": "2016-07-18T18:28:35.000Z",
          "Titre": "BUYER BEWARE !!!!!!",
          "Contenu": "If you are buying Microsoft Office, apparently there are 2 versions.  One you pay for on a recurring annual basis ( this was not made abundantly clear to me );  the other is a one time fee ( about twice the price ) but good forever which is the one I would have selected"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert P.",
          "Nb_Reviews": 2,
          "Date": "2016-05-25T16:59:09.000Z",
          "Titre": "Three of Five due to foul play...",
          "Contenu": "I am happy with their products but I'm not impressed with their tactics. I was offered money to write a review on Yelp, so I did but I have yet to see any money as well as a response from MyChoiceSoftware...Sure, I can do without the $5 but it's just ugly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "perla gascon",
          "Nb_Reviews": 1,
          "Date": "2020-06-23T00:27:21.000Z",
          "Titre": "I was able to download windows 10 with…",
          "Contenu": "I was able to download windows 10 with your Instructions. Now I’m trying to login. It only offer me a choice of Face login. For some reason my computer does not recognize me. What can I do . My original picture was 4 years ago."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Tim Scheybeler",
          "Nb_Reviews": 1,
          "Date": "2016-05-13T02:24:02.000Z",
          "Titre": "problems abound, partly my fault for not following up ( been very busy )",
          "Contenu": "The actual sale was very good, the follow up by \"mychoicesoftware\" was good however. When it came to installing the actual program and the various subsets of the actual program i have had nothing but trouble for some reason. I have been meaning to follow up with mychoicesoftware however i simply have not had the time to do so. It had not been a problem until this week when i needed to use one of the programs and i was denied access because of it NOT being properly installed, i NEED to contact the company but i simply am strapped for time. There should be more soon, as some projects come to a close soon...Tim"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin Eason",
          "Nb_Reviews": 1,
          "Date": "2016-03-14T20:15:08.000Z",
          "Titre": "Not what I ordered",
          "Contenu": "I ordered a boxed product because I have ordered software online in the past and sometimes you get software listed in another user name. Received confirmation that it was in stock and would be shipped soon. A week later received notice the boxed product was no longer available but would be sent as t download product. Tried to download but had to contact mychoice to obtain correct number to download software, the number sent would not work. Software works fine but whole process seemed sketchy. Seems like a software company would have inventory control software that would know immediately what was in stock and notify customers at time of purchase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marianne W.",
          "Nb_Reviews": 4,
          "Date": "2020-08-25T01:52:01.000Z",
          "Titre": "I am rating this company fair because…",
          "Contenu": "I am rating this company fair because it took a lot of explaining and me contacting Microsoft to confirm that the product I purchased was a legitimate, legal product code.  If only the web site informed/educated the customer that the product could not be registered with Microsoft and why, it would have made a big difference in my experience.  Only after a lot of back and forth emails with My Choice Customer Service, who were very patient, and my contact with Microsoft was my concern answered and remedied.  At the end of of it all, all is fine, I am pleased with my purchase, and I would purchase from My Choice again and I will recommend the site to friends.  If my next purchase goes smoothly, I will re-rate my experience and expect it to be 5 stars."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bruce",
          "Nb_Reviews": 1,
          "Date": "2016-03-12T14:43:02.000Z",
          "Titre": "Problems with authorization code",
          "Contenu": "Had multiple problems with Office authorization code which required several interactions with support to straighten out.  Shouldn't have had to go through all that, though it was eventually solved to my satisfaction."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric Atkinson",
          "Nb_Reviews": 1,
          "Date": "2016-11-03T14:05:24.000Z",
          "Titre": "Fast Download and install",
          "Contenu": "This is the 2nd copy of Office Suite 2007 I have bought from MyChoice Software. Both transactions were very smooth and easy. But, this is the 2nd time I have had to go through the extra steps to activate the product as well. It was not as easy as just clicking the activate now button and done. I had to have Microsoft text me a code and enter a code in from the screen to activate. Both copies did activate with no issues after I did this. I have bought copied of this Office Suit from other vendors in the past and have not had to go through these extra steps. Just takes a little more time to do that is all. Overall they were the best priced. I will most likely go back to them for more software as I need."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Edwin Shafer",
          "Nb_Reviews": 1,
          "Date": "2016-07-07T23:02:58.000Z",
          "Titre": "I was told that if I had problems with installing software, call Microsoft.",
          "Contenu": "I felt that there was no support from Mychoicesoftware if I was to have a problem. I had problems with installing the software and with the help of AVG, we finally got it installed with over 6 hours to complete."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Doris Anderson",
          "Nb_Reviews": 2,
          "Date": "2016-03-12T14:30:56.000Z",
          "Titre": "Instructions could be better",
          "Contenu": "The licensing instructions and process could be explained better.  It was confusing and I had to switch to telephone rather than online to get it corrected.  It was confusing for an average computer user."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Barbara Efaw",
          "Nb_Reviews": 1,
          "Date": "2016-06-21T01:54:22.000Z",
          "Titre": "Nightmare Installation Process",
          "Contenu": "Purchase a freeze but then passed on to McAfee site for installation process. One word best describes this, nightmare. Two days later finally managed to wiggle through the  installation process."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marilyn",
          "Nb_Reviews": 1,
          "Date": "2016-03-17T22:44:54.000Z",
          "Titre": "Ok Experience with some reservation",
          "Contenu": "I purchased this download on a Saturday and expected a fairly immediate ability to receive the code for installation.  It took almost 4 hours to receive the code.  I felt this was unacceptable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ron Tosh",
          "Nb_Reviews": 1,
          "Date": "2019-10-20T20:27:54.000Z",
          "Titre": "i was very impressed with the Window7 to 10 upgrade",
          "Contenu": "i was very impressed with upgrading my Windows 7 to Windows 10.Per the Mychoicesoftware email, i downloaded Windows 10 Professional Media Creation Tool.This above tool managed the upgrade and maintained all my documents, Applications and Firefox Bookmarks in Windows 10.I didn't have to go to any of of DVD backups that I created for the upgrade. It took a few hours for the upgrade but i didn't have to deal with any issues.The only small issue was that the Mychoicesoftware email was misleading, it said: We are currently out of stock of the Home version of Windows 10, so we have provided you with a complimentary upgrade to Windows 10 Professional!\t\t\t\tWhen I checked on the Windows 10 that was installed, it was the Home version, not Professional \t\t\t\t\t\t\t\t\t Great Job, Mychoicesoftware !!"
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "XX",
          "Nb_Reviews": 1,
          "Date": "2016-10-17T18:44:26.000Z",
          "Titre": "Product delivered eventually",
          "Contenu": "License was needed quickly (Sunday morning, my IT was closed) but the 30 minute delivery service advertised is only during normal business hours.  You don't find this out until you are further into the purchase. Then it gets trickier with one screen advising it takes up to 4 hours to deliver on the weekend and another place it tells you they batch and only orders received before 10 AM PST will deliver that day.  After 4 hours I really got nervous since I was on the way to the airport for a business meeting out of the country.  I called the company, sent and email and voila the key code arrived.  It all worked out but a lot more stressful than I anticipated.  We had some questions the following week and they were super helpful on the phone (during normal hours)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kim Baumgart",
          "Nb_Reviews": 1,
          "Date": "2016-07-11T04:19:17.000Z",
          "Titre": "trouble but help availableI",
          "Contenu": "I had some trouble getting the programs to download and it took a bit of time to get it fixed - but tech support were very helpful and kind.  They did follow-up to make sure I was satisfied."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BDBTX",
          "Nb_Reviews": 3,
          "Date": "2016-05-28T22:50:04.000Z",
          "Titre": "Good to bad to OK",
          "Contenu": "I needed Visio Pro 2013, so I got it at your web site for a reasonable price. I just upgraded my PC Windows to 2016, I started to do the setup for the Visio 2013 and it told me, at the beginning of the install that I had to put my operating system back to Windows 7 or 8. I sent you're support group with my problem, but didn't get a response till the next day. So what I did was contact Microsoft Office and they registered the 2013 Pro and then sent me the setup for Visio Pro 2016 no charge. When I did hear back from your support, they told me there wasn't anything they could do. Out of courtesy I emailed you're support back on what I did and it was kind of un-customer service that they didn't come back to me with at least, thanks for the heads up."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chuck Webb",
          "Nb_Reviews": 2,
          "Date": "2019-08-06T23:12:10.000Z",
          "Titre": "Dragon 13 on line",
          "Contenu": "Ordering and getting the link to download worked like a charm.  Having problems registering Dragon 13 on line, after a number of attempts.   However I may be dong something wrong."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "D'Arbra Welch",
          "Nb_Reviews": 1,
          "Date": "2015-11-05T02:53:11.000Z",
          "Titre": "MS Office 2010 could have been alot easier",
          "Contenu": "If software is downloaded using Chrome, it will save a lot of time and energy performing installation. All and all, its was a good installation. Everything works successfully as expected."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Rudi Ottodinoto",
          "Nb_Reviews": 1,
          "Date": "2016-10-02T15:54:09.000Z",
          "Titre": "Great software purchase experience but the pricing is a bit confusing",
          "Contenu": "The MS Project 2010 Standard license is a great software and the price is reasonable.   I have no issue with the overall buying experience and the activation process.  My only concern is that the academic edition (AE) cost the same as the standard version ($149 USD) but the AE version license has expiry date.  If that's the case, why would anyone buy the AE version?Mychoicesoftware has responded to me that the note about AE license will expiry is incorrect and AE can only be installed in 1 PC and (I think) the AE cost should be cheaper than standard version.  However, if you see the mychoicesoftware website for MS Office 2010 AE, it still show $149 and indicated the AE license will expire in the description.  This page should be updated to reflect the correct price and description of the AE version."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Phoxrox",
          "Nb_Reviews": 5,
          "Date": "2016-06-17T17:49:39.000Z",
          "Titre": "Great but I don't want Office 365 - be sure to uncheck this box!",
          "Contenu": "I ordered a single copy of Office 2013.  Great product.  Excellent price.  Prompt delivery.  Easy download and installation.  I didn't notice the check box for the \"free\" 5 additional installs of Office 365 and neglected to uncheck it, so now I am being pestered to activate the product so that my 30 days \"free\" trial can quickly expire and I can begin paying $9.90 a month for something I don't need.  I understand that lots of software and other products come with these \"on approval\" items and I should have been more careful to look for this and uncheck what I did not want, but it is not an added value (I can get a free trial and the same monthly price directly from Microsoft).  It takes away from the otherwise excellent experience with MyChoiceSoftware and seems kind of slimy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sharon Dehn",
          "Nb_Reviews": 2,
          "Date": "2021-02-14T00:33:10.000Z",
          "Titre": "No access to Word!",
          "Contenu": "I have not been able to access Word as it says I'm not activated! I have gone through the whole activation steps and still can't access Word."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tiffany",
          "Nb_Reviews": 1,
          "Date": "2016-03-14T17:31:37.000Z",
          "Titre": "It was difficult to download",
          "Contenu": "This software was difficult to download for the average person. I had to have my boyfriend who is an IT professional help me download the software on to my computer."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Brenda Brophy",
          "Nb_Reviews": 2,
          "Date": "2016-03-17T02:54:28.000Z",
          "Titre": "Never did receive package",
          "Contenu": "Paid $200 for a Windows 7 64 bit disk on February 11.  Package was sent by Mychoicesoftware and was to arrive on February 18 in Mississauga, Ontario, Canada.  It's now March 16 and I'm no closer to receiving my package.  While it's FedEx that screwed up I did report to your company that I hadn't received my package and have heard nothing since.  FedEx told me that they weren't responsible and that I'd have to contact Mychoicesoftware.  When I refused to make another long distance phone call from Ontario to California it was dropped there.  They insist that your company give permission to enter a claim.  I'm a senior citizen who lives on a pension and can't afford the loss of $200 and feel that I should not be the one making all of the phone calls trying to track down this item.  Hopefully, some day, I will get my disk or a refund so I can purchase another disk."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Woo",
          "Nb_Reviews": 1,
          "Date": "2016-04-25T14:49:07.000Z",
          "Titre": "Installation problems",
          "Contenu": "Your tech support was good and fast.  However, you didn't explain initially tht older versions of office require telephone registration as opposed to online."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lisa Coder",
          "Nb_Reviews": 1,
          "Date": "2016-05-01T20:32:21.000Z",
          "Titre": "Other Charges",
          "Contenu": "After I downloaded the software, there was a $9.90 charge put on my credit card for some unknown reason.  People should not add charges without notification."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CW",
          "Nb_Reviews": 1,
          "Date": "2016-10-19T19:56:21.000Z",
          "Titre": "Ordered Norton 365 and received Norton Security product serial number",
          "Contenu": "After completing my order I was disappointed about 2 things and they are:1. The on-line store was closed and I had to wait until the next day to receive the serial number for activation. (Never had an incomplete order after payment because an on-line store was closed). If you cannot complete an order you should notify the customer before accepting their payment. When it comes to antivirus software the customer may need the product at the time of the order not the next day.2. I ordered Norton 365 and received a product key for Norton Internet Security. (Wish they had just said only Internet Security was available and explain it is similar to office 365.) I have only used Norton 365 and have no knowledge about Norton Internet Security.Although I am satisfied overall can't say I would readily recommend Mychoicesoftware to someone after the inconvenience of store hours and the product switch."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gerald Davis",
          "Nb_Reviews": 1,
          "Date": "2016-07-11T22:26:39.000Z",
          "Titre": "Disappointing.",
          "Contenu": "What I revived was a well used envelope containing a questionable windows 7 disc which only loaded after numerous attempts. Not sure what I have is leget."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Bonnie Bailey",
          "Nb_Reviews": 1,
          "Date": "2016-08-31T16:25:56.000Z",
          "Titre": "listened",
          "Contenu": "the person on the phone listened to my problem then transferred me to another person who was unable to help me . They are returning my money soon I hope."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kathy S.",
          "Nb_Reviews": 2,
          "Date": "2021-01-21T17:11:55.000Z",
          "Titre": "The web site was surprisingly clunky to…",
          "Contenu": "The web site was surprisingly clunky to use. There was insufficient information about the products. But, the checkout was easy and quick."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bon Tate",
          "Nb_Reviews": 2,
          "Date": "2016-09-28T05:19:29.000Z",
          "Titre": "Wrong item",
          "Contenu": "The product advertised was McAfee Internet Security 2016 but what was delivered to me was McAfee Total Protection. I understand that McAfee Total Protection is a more \"premium\" product than the \"Internet Security\" but the purpose i specifically ordered the \"less premium\" product was that it was the one i specifically needed. I do not need the add on features of the more premium antivirus software as it is for personal use only. Nonetheless, it has been installed and running. But next time, if you advertise selling \"McAfee Internet Security\", deliver what was advertised, \"premium\" product notwithstanding. I usually use Kaspersky and i have an issue with its version of \"Total Protection\" as it eats up more computer resources, the very reason why i switched to McAfee and bought specifically the Internet Security, not the more premium product.Thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wanda Morgan",
          "Nb_Reviews": 1,
          "Date": "2016-08-29T02:27:56.000Z",
          "Titre": "Microsoft Office",
          "Contenu": "I had a few problems but support helped me through it. Haven't  had time to spend checking it all out but I'm sure it'll do what I need."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dwight Hunter",
          "Nb_Reviews": 2,
          "Date": "2016-06-09T03:01:35.000Z",
          "Titre": "Visio Pro 2012",
          "Contenu": "I wasn't told that the Visio Pro 2012 I purchased was an academic version  that I could not register because it had already been registered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2016-11-04T21:34:06.000Z",
          "Titre": "A little frustrating but great",
          "Contenu": "It was a little frustrating getting the download code to work in the beginning but after a little patience and time it finally worked."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Door Service and Repair",
          "Nb_Reviews": 1,
          "Date": "2016-09-22T18:16:16.000Z",
          "Titre": "Product works without issue, tired of getting advertisement emails.",
          "Contenu": "The purchase and install process is easy. They just wont leave me alone. Buy somewhere else if you're sensitive to advertising."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "mike babson",
          "Nb_Reviews": 1,
          "Date": "2016-08-15T21:05:24.000Z",
          "Titre": "Never got software installed",
          "Contenu": "Software wouldn't install,no matter what support did. Awaiting a refund now. They worked hard, but we couldn't get it done."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Hassid",
          "Nb_Reviews": 1,
          "Date": "2016-04-15T18:03:41.000Z",
          "Titre": "No Worries",
          "Contenu": "great software and was easy to set up even though I prefer physical media for software just in case something unfortunate happens."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Mary Jean Pramik",
          "Nb_Reviews": 3,
          "Date": "2016-03-12T22:29:01.000Z",
          "Titre": "Service uncaring, not so goog",
          "Contenu": "Service not so good. Had problems launching ms Office and was dismissed and told to contact Microsoft.  Terrible \"help.\""
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike Bayer",
          "Nb_Reviews": 1,
          "Date": "2016-04-16T14:32:04.000Z",
          "Titre": "Ant-virus software review",
          "Contenu": "Took over 24 hours to have software downloaded. Good customer service but if there is a 24 hour lead time, let me know"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Joanne Kinden",
          "Nb_Reviews": 1,
          "Date": "2016-03-13T19:43:47.000Z",
          "Titre": "Great service",
          "Contenu": "Service was great, but program didn't work on my computer and tech couldn't help...had to purchase program elsewhere"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Mike Volcko",
          "Nb_Reviews": 1,
          "Date": "2016-01-13T22:01:18.198Z",
          "Titre": "Online Provision of MS Publisher 2010",
          "Contenu": "I was looking for an online download for MS Publisher 2010.  I went through the purchase procedure, which went well, and quickly received the link to start the download.  When I started the \"Download to your computer\", I was advised to download MEGA, or \"Continue slow browser download\".  When I selected the latter because I have had my fill of useless third party add-on software, I was redirected back to the \"Download to your computer page\".  I then sent a quick chat describing above but never received a reply.\rThen it gets humorous,  I dialled a help number, 1 800 318 1800 and was asked to answer three questions about taking a cruise.  The old bait and switch, and very unprofessional.  I then called 1 800 318 1439, and a young man advised that I could not download with MS Internet Explorer, and would need Firefox or Chrome.  I said that this was odd as you are selling MS software.  I used Chrome and it downloaded successfully.\rTo send this comment, I am now asked to \"Post and verify with Facebook, which I never use or e-mail.  The e-mail option asks me to create Trustpilot account.  Why would I want to create a Trustpilot account?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Helmut Fritz",
          "Nb_Reviews": 1,
          "Date": "2016-04-26T17:48:42.000Z",
          "Titre": "PPS File (.pps)",
          "Contenu": "Can't open PPS File (.pps) from e-mail attachments\rCan't find if Word has a German spell check"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "HP",
          "Nb_Reviews": 1,
          "Date": "2016-07-13T20:19:37.000Z",
          "Titre": "XP Pro",
          "Contenu": "XP crashed, but it may be hardware drivers. Update later. Everything else was good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas Hilburn",
          "Nb_Reviews": 1,
          "Date": "2016-06-23T17:53:21.000Z",
          "Titre": "dificulty on download, confused to say the least",
          "Contenu": "Needs to be more direct and straight forward. Should not need to go through email."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2020-11-05T00:19:56.000Z",
          "Titre": "Downloaded fine but did not like all…",
          "Contenu": "Downloaded fine but did not like all the info about activation at the end."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Janet Dobesh",
          "Nb_Reviews": 1,
          "Date": "2016-09-09T15:21:27.000Z",
          "Titre": "MS Office Software",
          "Contenu": "The first product key was invalid for MS office; however, the second one did work"
        },
        {
          "Note": 3,
          "Lieu": "MY",
          "Pseudo": "Oliver Tey",
          "Nb_Reviews": 1,
          "Date": "2016-08-24T12:57:01.000Z",
          "Titre": "Speedy download.",
          "Contenu": "Speedy download but software may not work outside US. Great support staff though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2015-10-26T08:47:13.847Z",
          "Titre": "Office 2010 Might not be legit",
          "Contenu": "Purchased Office 2010Pro.  Promptly received a download link and product activation key.  When attempting to activate online, I received a message stating that this key could not be activated because it had been used too many times.  I chose the option for telephone activation, and the process worked fine, the product activated without any problem.\r So why are there so many 5 star ratings?  Because in a follow up email from support at:  s*****t@my******software.com you have the option for a $5 refund on your purchase:\r-------------------------------------------------------------\rWant to earn a $5 refund on this purchase?\r  Complete a 5-star review about your experience with My Choice Software from the link below:\rh***s://www.*****pilot.com/evaluate/my******software.com\r  Send an e-mail to A***@my******software.com   Receive $5 back to your credit card used to make the purchase!\r---------------------------------------------------------------\r I guess I will not be getting a $5 refund.  This store is a \"Google trusted store\" which is why I proceeded with this purchase, but now I am wondering if the product was actually legit.  If it were legitimate, then the online activation should have worked.\r Update:  I was asked to remove references to the actual people who wrote the email, as well as any links to the site being reviewed: so they have been replaced with ***"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eddie Ayala",
          "Nb_Reviews": 1,
          "Date": "2016-04-19T12:51:53.000Z",
          "Titre": "MS Visio",
          "Contenu": "I was send the wrong software but later the problem was fixed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles Werhan",
          "Nb_Reviews": 1,
          "Date": "2016-11-27T03:25:05.000Z",
          "Titre": "Not sure that my computer will accept this level of software.",
          "Contenu": "Has windows 8.0  and i am trying to get it to 8.1"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vicky",
          "Nb_Reviews": 2,
          "Date": "2016-06-22T21:21:05.000Z",
          "Titre": "Behind the times",
          "Contenu": "Very antiquated and less than efficient."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "glenna",
          "Nb_Reviews": 1,
          "Date": "2019-12-17T20:38:47.000Z",
          "Titre": "Still having getting the download"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aaron D",
          "Nb_Reviews": 1,
          "Date": "2016-08-29T19:17:19.000Z",
          "Titre": "They were okay!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Russell Maynard",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T15:10:22.000Z",
          "Titre": "Worked with Tyler - Ordering Server O/S software",
          "Contenu": "I needed to place an order for upgrade software for one of our Windows Servers.  Spoke with Tyler.  He was very helpful and answered all of my questions.  I have purchased many copies of desktop (MS Office and Windows) software from MyChoice, and have always been satisfied."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric Falconer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T01:16:03.000Z",
          "Titre": "Unfamiliar problem issue with a Mac solved!",
          "Contenu": "I was satisfied with my experience because of Finn, the customer service specialist I spoke with. Finn was clear, calm, and knowledgeable when speaking to the subject matter and eventually solved my issue. Having not address this issue on a Mac computer much before, we both learned something new."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Moluf",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T20:03:30.000Z",
          "Titre": "Tyler helped me reactivate Office 2019…",
          "Contenu": "Tyler helped me reactivate Office 2019 after being notified my product was unlicensed. 2nd time in 3 weeks. Purchased in September 2023. Working now. hoping it stays active moving forward. Thanks Tyler"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Judy",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T20:15:58.000Z",
          "Titre": "Ryan was very helpful and courteous…",
          "Contenu": "Ryan was very helpful and courteous after several left messages.  Software worked fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Brown",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T22:41:44.000Z",
          "Titre": "inadequate installation guide",
          "Contenu": "Download and installation guide is woefully lacking much needed information. I was able to locate a step by step guide that someone was kind enough to place online and was then able to perform the fresh install without difficulty. The staff member that I spoke with about not being able to locate the email containing my purchase was very polite and pleasant, immediately re-sending the email for me. Thank you mychoicesoftware.com."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kyle",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T16:31:10.000Z",
          "Titre": "It was flawless...other than the part…",
          "Contenu": "It was flawless...other than the part where it wasn't made certain that you were going to email a link to download, I was thinking that I could download immediately and didn't download the software until the next day...that's all - maybe make that more pronounced at the beginning"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andy",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T18:57:02.000Z",
          "Titre": "Definitely Worth It",
          "Contenu": "So I was a bit skeptical using this site to do a purchase but Google showed me it was trusted. And it also had the software I need, Windows 11 pro for a cheaper rate that Microsoft sells it for. The transaction went smoothly, but it took 24-48 hrs for an online delivery, which was why I gave it 4 stars. I thought if it was purchased online, it would be instantaneous but I had to wait to receive the software. But other than that, this site is legit and I was able to install my Windows 11 Pro on my computer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Brown",
          "Nb_Reviews": 8,
          "Date": "2021-03-17T01:25:50.000Z",
          "Titre": "Good Installation support",
          "Contenu": "Good Installation support. Available human response.Not always as easy to install without their help.Therefor, order early in week and day so if installation takes more than a day, you will not run the risk of not having an activated copy over a night or weekend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Brown",
          "Nb_Reviews": 8,
          "Date": "2021-03-19T23:06:16.000Z",
          "Titre": "Good human telephone support!",
          "Contenu": "Good human telephone support!You will probably need to call for support when the screen comes up and informs you that activation key will not work.  So purchase early in day and allow time to call to be assisted in activating license key.Also, you will probably have to uninstall previous editions of Office to get this product to install correctly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T22:22:29.000Z",
          "Titre": "Downloading Instructions",
          "Contenu": "In the end, the process was simple. However, it could have been made a bit clearer, with the download process explained up front, not in a post purchase email. Not a complaint, just a friendly suggestion."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deb Debbie",
          "Nb_Reviews": 1,
          "Date": "2021-10-09T05:48:41.000Z",
          "Titre": "Bumpy start but GREAT finish!",
          "Contenu": "Initially, I was sent a license for the wrong version of the software (they sent me a newer version, but I wanted the older one). But just one email to support got an BLAZING FAST response, and it was fixed!  Turned out to be a life-saver for me, because the only other sites I could find selling this version were really sketchy-looking or downright fraudulent sites. I saw the negative reviews in places, and the complaints on BBB, but I took the leap to purchase from MyChoiceSoftware because I could see on the BBB page that they were responding to and resolving the concerns of customers who filed the complaints. Even before I purchased, they were very responsive to my emails-- plus it was clear that those responses were coming from real people who had actually read what I wrote! In the end, I think I made a good choice. I got exactly the software I wanted, got it installed, activated, and up-and-running very smoothly!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patti Caldwell",
          "Nb_Reviews": 1,
          "Date": "2022-07-25T21:08:32.000Z",
          "Titre": "I had a tough time getting Windows 10…",
          "Contenu": "I had a tough time getting Windows 10 Pro to activate. I was prepared to only give 2 stars until I called in to support and spoke to Dave. He walked me through a different way of activating and it worked just fine. Because Dave was so patient and he knew his stuff, I've bumped the stars up to 4. Dave saved the day. If I was only reviewing Dave, it would be 5 stars for sure!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jun Kwon",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T20:53:06.000Z",
          "Titre": "Very good overall but one thing",
          "Contenu": "I think the process to purchase was great and the lay out of all information was very clear. My only qualm is how long it took to receive the license informations"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Senior Center",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T16:56:46.000Z",
          "Titre": "A good product but unanticipated delay",
          "Contenu": "I think we will like it, as I have had previous experiences with this product. However, it took about 7 days to get the product code. I tried to be patient but we are a small business and needed the product as described within the 30 min. timeframe."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sherman",
          "Nb_Reviews": 4,
          "Date": "2021-04-26T14:59:41.000Z",
          "Titre": "Had some kind of issue with the Office…",
          "Contenu": "Had some kind of issue with the Office installation.  Took some time to get it straightened out, but everyone I worked with was courteous and patient."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leland Ware",
          "Nb_Reviews": 3,
          "Date": "2023-09-12T15:31:44.000Z",
          "Titre": "Good service",
          "Contenu": "Good service. i am very satisfied with the help provided by Finn O'Sullivan"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "L.L.",
          "Nb_Reviews": 1,
          "Date": "2022-03-16T16:56:43.000Z",
          "Titre": "This site was very helpful and explains how to get your Microsoft 365 easy.",
          "Contenu": "This site was very helpful and explains everything step by step so that installation was easy and headache free."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thelma Frajer",
          "Nb_Reviews": 2,
          "Date": "2023-02-22T00:40:50.000Z",
          "Titre": "installation icon",
          "Contenu": "It was installed as per message but I can not see the icon of office 2021 home and students.not even in my tool bar, when it was installing it was there?there should be an easier way to see it.Thank you for your help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Pieper",
          "Nb_Reviews": 1,
          "Date": "2021-12-15T15:57:41.000Z",
          "Titre": "In the instructions you send for…",
          "Contenu": "In the instructions you send for upgrading, please put Disconnect from Internet as #1 in the list of what to do."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bruno Mazzotta",
          "Nb_Reviews": 1,
          "Date": "2021-03-19T03:03:49.000Z",
          "Titre": "Good value",
          "Contenu": "Good value. minor glitch with Safari not accepting credit cardthis experience process is very convoluted"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Teresa Smith",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T00:07:07.000Z",
          "Titre": "It took a little bit to get it",
          "Contenu": "It took a little bit to get it, it is a download after all, but I'm already putting it to use!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen and Dale W",
          "Nb_Reviews": 3,
          "Date": "2023-01-26T23:37:01.000Z",
          "Titre": "It worked out well",
          "Contenu": "It worked out well. I did not know I was not buying this straight from Microsoft. It seems to be $5.00 more than straight from MS."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T00:52:40.000Z",
          "Titre": "Ease of Process",
          "Contenu": "The process was very easy to purchase the software"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cheryl Quist",
          "Nb_Reviews": 1,
          "Date": "2021-07-27T15:08:29.000Z",
          "Titre": "Just found what i needed to run the…",
          "Contenu": "Just found what i needed to run the microsoft office and ordered it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barbara",
          "Nb_Reviews": 1,
          "Date": "2021-02-23T19:14:49.000Z",
          "Titre": "Great follow up and help support",
          "Contenu": "first of all, I was not getting the email to download the program and requested a couple of times.  Then finally I received.  From there on I had wonderful help in downloading...seemed that I was having problems with the program and also problems with myself in downloading.  Everyone was so patient!  Thanks!!  Barbara McPeake-Powell"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronn Sherrod",
          "Nb_Reviews": 1,
          "Date": "2020-05-06T18:42:22.000Z",
          "Titre": "It was really an easy install as well…",
          "Contenu": "It was really an easy install as well as the purchase. I received my installation package about 30 minutes after my purchase. I had already gone to bed at that time but the next morning was able to enter my product key with ease and proceed. It did take a little more time than expected for the software to load and to get everything set up. I had purchased a brand new laptop that same day with all the bells and whistles...lol."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 2,
          "Date": "2021-02-10T19:30:40.000Z",
          "Titre": "Purchased Microsoft Office 2019 …",
          "Contenu": "I had the software ready to install within 30 minutes of placing my order.  The Microsoft Activation failed but, after 2 emails to My Choice Software they were able to resolve the issue and Office 2019 is up and running.  They are quick to respond and I would definitely buy from them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sister Mary Frances",
          "Nb_Reviews": 1,
          "Date": "2020-02-24T02:37:53.000Z",
          "Titre": "First time to install on my own!",
          "Contenu": "Everything appeared to be going well at first and then, the install failed.  However, I did a scan disk and then, created the media disk and it all went well from then on.  I did email for help and was told that the first installation may have been corrupted and I could get more help in the morning.  However, it wasn't needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elite Computers",
          "Nb_Reviews": 1,
          "Date": "2021-03-02T17:18:03.000Z",
          "Titre": "Invalid discounts",
          "Contenu": "After placing this order, there is a message about getting 10% off on your next order placed today.  That discount can not be applied, because we have used it in the past.  Since I am logged into my account, can't that message be eliminated?  Otherwise let me apply the discount."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronald Powell",
          "Nb_Reviews": 1,
          "Date": "2020-10-26T17:52:55.000Z",
          "Titre": "Bought Microsoft Office 2019 Home & Business",
          "Contenu": "I bought Microsoft Office 2019 Home & Business software.  the software installed without a problem.  However, activation by Microsoft did not work.  Called MyChoice Software and they sent a new product activation key.  Software now works.  Very happy with my purchase.  I recommend this company."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T06:29:13.000Z",
          "Titre": "Easy to follow website and download…",
          "Contenu": "Easy to follow website and download instructions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Harvey Benjamin",
          "Nb_Reviews": 3,
          "Date": "2020-10-13T13:53:30.000Z",
          "Titre": "Good To Deal With Them",
          "Contenu": "Bought Microsoft Office and it eventually downloaded fine, but the instructions need to be a little clearer for someone like me, who is not tech savvy. In the end, glad I dealt with them and savings were significant.When I had a question, was easy to reach tech support and got the help I needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Cassey",
          "Nb_Reviews": 3,
          "Date": "2019-02-08T15:25:48.000Z",
          "Titre": "My Purchase Experience was good",
          "Contenu": "I bought Microsoft office from them and found some problem with it. I immediately contacted with them. As they were so genuine and ready to help their customer, they quickly understood the issue and admitted that the mistake from their end. I love the way they are working and handling the customers. My experience was very good and I was satisfied with their help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Swank",
          "Nb_Reviews": 1,
          "Date": "2016-11-07T23:17:07.000Z",
          "Titre": "SBS 2012 License",
          "Contenu": "We downloaded SBS 2012 from Microsoft and installed on two of our virtual servers (upgrading from 2010).  Researched pricing for the licenses and found best price at Mychoicesoftware.Due to internet problems when purchasing online, I had to call for assistance. The sales rep was very courteous and took care of our issues immediately. We downloaded and installed the licenses with no problems."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "gloria thomas",
          "Nb_Reviews": 2,
          "Date": "2016-10-28T15:36:35.000Z",
          "Titre": "Harder an longer to install software plus extra step for license",
          "Contenu": "Normally when i had bought software online it was easy to install, the license was provided an it was a one step process but with this one i had to get license an install them twice which was a problem for me because i was required to set up software on the phone an made mistake leaving my cell phone with the answering machine, hopefully it gets deleted but its better to do second option"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AJ Burfield",
          "Nb_Reviews": 2,
          "Date": "2016-11-30T17:19:32.000Z",
          "Titre": "Great with follow up!",
          "Contenu": "After buying an older version of MS Office and installing it, I had issues with an installation wizard that wouldn't go away. I chatted with customer service, and they told me how to resolve the issue. Everything is great now and I appreciate the follow up emails! I would buy from this company again! Note: if you buy Office 2010, do NOT use the \"smart phone\" option to verify the installation ID code."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amy Chenier",
          "Nb_Reviews": 1,
          "Date": "2016-08-31T20:37:08.000Z",
          "Titre": "Be aware of the small print",
          "Contenu": "Ordered an upgrade to Windows 10 Professional, and they tacked on a free trial to Office 365 that I did not need.  According to them, because I did not cancel the free trial I hadn't requested nor needed, they began charging my credit card for it.  In the end, they refunded the money, which was much appreciated, but using these kinds of tactics is reprehensible.  So make sure you read the fine print."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janie Pursch",
          "Nb_Reviews": 1,
          "Date": "2016-11-09T13:59:02.000Z",
          "Titre": "Decent experience",
          "Contenu": "Finding, ordering and downloading Office 07 was easy enough but after I put in the product key the problem started.  Apparently someone else had been issued the same product key as me and Microsoft made me go through a process of confirming the key and then they sent me a validation key after 6 hours of dealing with this.  Once I got the validation key everything was good.  So despite that issue I still give them 4 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2016-10-12T04:14:27.000Z",
          "Titre": "Overall a positive experience",
          "Contenu": "The purchase and software download process was pretty easy and straightforward. My only issue was with the software activation. The online activation didnt work. It said that the number of seats had already been exceeded for that product key. However, the over the phone activation did work and it wasn't too painful of a process. Overall, i am happy with my purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2018-11-16T12:18:42.000Z",
          "Titre": "I was really impressed...",
          "Contenu": "I was really impressed with the wide selection of programs available thru Mychoicesoftware.  I was kind of skeptical at first, because I was looking for an older version of a big-name program...  It took an extra bit of effort to get the program registered and working as a full version, but it was worth it!  Thanks so much!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "WJB",
          "Nb_Reviews": 1,
          "Date": "2016-09-26T13:18:05.000Z",
          "Titre": "Works Well",
          "Contenu": "Called sales prior to download with a few questions. Rep was very friendly and informative. The download was simple and we encountered no problems with the installation. Once installed the product works great. Would have given five stars, but like others we had a few issues with the activation... however, it wasn't that difficult to work out. Just followed the steps to get everything up and running. Since then, so far so good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Dingle",
          "Nb_Reviews": 1,
          "Date": "2016-10-11T20:47:32.000Z",
          "Titre": "Purchase MS Office",
          "Contenu": "It would have Been a 5 star, but, the activation key was off by 1 digit. Once I finish playing around and figuring out exactly which digit was wrong, I call  support for help and received  the corrected key in less time than it took the call to go through. I will definitely buy from them again and I have already started recommending them. The support was 5 star."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "sr bryan",
          "Nb_Reviews": 3,
          "Date": "2016-11-23T17:55:51.000Z",
          "Titre": "Initially Skeptical - Now a return customer",
          "Contenu": "I am always skeptical of \"cheap\" software but after 20+ purchases of Microsoft Office and various phone calls/emails I know for sure that they are 100% legit. My only knock and the reason for the 1 star reduction is that they call you and ask all kinds of questions to try and sell you on a partnership plan where you receive 2% back on purchases. It's a neat setup but I can't stand it when a company calls me on my cell without my consent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna Earhart",
          "Nb_Reviews": 2,
          "Date": "2020-12-28T23:38:36.000Z",
          "Titre": "Purchasing Office smooth but some activation issues",
          "Contenu": "Purchasing Office was easy but we did have some problems with automatic instillation - we had to call Microsoft in order to get authorization as it was saying it was already on too many computers.  However, once on with Microsoft it went through without a problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Judith Lakota",
          "Nb_Reviews": 1,
          "Date": "2016-09-24T03:33:37.000Z",
          "Titre": "Thrilled to be back to Microsoft Word & Excel",
          "Contenu": "This is the third review I've written to Mychoicesoftware....I am thrilled to using Microsoft Word & Excel again after a three years since I bought my Mac Book Pro.  I tried Apple's Pages & Numbers applications but find Microsoft Word & Excel much easier to share documents with other people in other who I am working with."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Gigi",
          "Nb_Reviews": 1,
          "Date": "2016-09-20T00:32:39.804Z",
          "Titre": "Good Experience",
          "Contenu": "I got exactly what I ordered within a day (I ordered on a Sunday) and when I had a question, I called the 1-800 number and the agent was extremely friendly and helpful. However, I saw this company on kijiji in Victoria, Canada and thought the price of the software was in Canadian $. I was unpleasantly surprised to see I was charged in USD."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kamala K",
          "Nb_Reviews": 1,
          "Date": "2016-09-02T19:36:53.000Z",
          "Titre": "Great post-purchase service",
          "Contenu": "I recently purchased the Microsoft office 2010 Professional software from MyChoice. I was unable to run the software and wasn't able to sovle the problem via customer service chat session. MyChoice staff was very helpful, they were able to access the computer remotely and setup the software. I will recommend them for software purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kim Fowler",
          "Nb_Reviews": 1,
          "Date": "2016-10-20T21:29:52.000Z",
          "Titre": "Problematic volume license",
          "Contenu": "I ordered Visio through an academic license but it won't install. I called support and the tech was kind and clear but could not help me. I then was sent to Microsoft Support for MS Volume License Support, who then shuttled me to MS Tech. Support, who then sent me to the MS website to submit a request for support - at a cost of 5 times what I paid for the software. I suspect this is not a My Choice Software problem . . . but I am frustrated none the less . . ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JT",
          "Nb_Reviews": 1,
          "Date": "2016-10-01T18:19:54.000Z",
          "Titre": "Good - sent me inconplete instructions but was helpful in fixing it.",
          "Contenu": "I bought a Windows 10 Home Edition key, and since they were out of those I received a Pro Edition key instead.  Expecting a home edition key, I'd already installed it on my PC, but the email they sent out only covered fresh installs of Windows.  Upgrading from home to pro requires a completely different, temporary key, which I promptly given when I called them.  Good service and price, but having both sets of instructions would have saved me a bit of headache."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2016-09-21T20:30:56.000Z",
          "Titre": "Helpful representatives",
          "Contenu": "My purchase wasn't working as expected so I called to ask why.  Turns out, operator error - I bought the wrong version.  Ugh.  I would have given a 5-star review if they could have credited the wrong purchase, but they worked with me on price for the 2nd one.  Probably better details on what's NOT included would help buyers.  ;)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Williams",
          "Nb_Reviews": 1,
          "Date": "2016-12-02T21:30:25.000Z",
          "Titre": "FOR A NOVICE",
          "Contenu": "I was pretty much without experience and had to take another completed schedule, provided by other, and open it on this software to understand the procedure.  I'm still learning the system but with all the open TASK MODE, TASK NAME, DURATION, START etc cells I can somewhat extrapolate what to do to make a construction schedule."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rose Krimmel",
          "Nb_Reviews": 1,
          "Date": "2016-11-23T20:12:20.000Z",
          "Titre": "Great choice",
          "Contenu": "Purchased Office Professional 2010. Everything went smoothly until I entered my product code. I got a message that said it was used too many times. I emailed Mychoicesoftware and they told me to do it by phone.I did and in less than ten minutes everything was fine. I would use Mychoicesoftware again if I had the need for programs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MS",
          "Nb_Reviews": 1,
          "Date": "2016-10-14T20:00:44.000Z",
          "Titre": "Quick delivery, efficient donwload.",
          "Contenu": "Purchased Office with little issue. They were having a website ordering glitch at the time but a message letting you know to call and order it. But refreshing the site let me reorder online. Everything processed quickly and the download link showed up shortly there after. From there there were no issues downloading or installing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gene Jarosh",
          "Nb_Reviews": 1,
          "Date": "2016-12-07T22:04:27.445Z",
          "Titre": "A little difficult but satisfied in the end.",
          "Contenu": "Originally the order was not processed timely.   They said it fell through the cracks due to having to call in a correction on  the billing address.  I called to check the status several days later and it had not been processed.  Once they were aware of this they apologized and all parts of the order were eventually processed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "blackburnj",
          "Nb_Reviews": 3,
          "Date": "2016-10-25T20:52:21.000Z",
          "Titre": "Good Price, easy to install",
          "Contenu": "I was a little nervous about buying from MyChoice Software but the reviews seemed to indicate a good experience.I received my software download instructions the same day. I copied to dvd, following the instructions and installed windows 10 the next day.  Process was very easy and went very smoothly.The price was very good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2016-11-01T15:41:19.000Z",
          "Titre": "Worked Well, but required Phone Activation",
          "Contenu": "This purchase was quick and easy. I would buy again. The only complaint I had was that I got an activation error when trying to activate over the internet. This required me to call into Microsoft and get a confirmation code to continue my activation. I was able to do that successfully. Other than that, I would purchase again!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gail Mitchell",
          "Nb_Reviews": 2,
          "Date": "2016-10-10T18:03:45.000Z",
          "Titre": "Great Service!",
          "Contenu": "The purchase I made with MyChoice Software was MS Office for Mac. I am thoroughly pleased with my purchase. I tried to upgrade my earlier version, but I was unable to do so, therefore I ordered the program from MyChoice Software and received it right away and installed it immediately. I really appreciate their help. Gail"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melissa Pennington",
          "Nb_Reviews": 1,
          "Date": "2016-09-22T12:22:44.000Z",
          "Titre": "So Far So Good",
          "Contenu": "I am pleased with this product, I have yet to read all of the \"fine print\" as I am a busy lady with college and work both full time. Despite this I am extremely satisfied and will look to this website in the future for software purchases. I plan to re-rate this product in a year and hope I am equally satisfied."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CVBSMI",
          "Nb_Reviews": 3,
          "Date": "2016-11-25T16:49:24.000Z",
          "Titre": "Had to reinstall",
          "Contenu": "The software had some problems after installation, i spent a lot of time on the phone with your rep who tried to help me, but in the end i had to uninstall and reinstall the software to make it work right.  I was concerned about the purchase since my software said \"from another computer\" in the properties section of the software,  and i had to wonder about this!  This makes me a bit uncomfortable thinking perhaps this was a used software but the product key was accepted and so i am using it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy Ludowise",
          "Nb_Reviews": 2,
          "Date": "2016-09-13T17:22:57.000Z",
          "Titre": "Mychoicesortware offer great support.",
          "Contenu": "I need Office for my Mac to communicate with some cohorts who use all Microsoft equiptment.  I had trouble setting up my account with microsoft and grew discouraged.  But Mychoicesoftware stayed in touch with emails, and I struggled thru my troubles with Microsoft.  I would buy more software from this company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leland Ware",
          "Nb_Reviews": 3,
          "Date": "2023-09-14T14:55:19.000Z",
          "Titre": "Well done",
          "Contenu": "Well done. Good service from Finn"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William E. Miller",
          "Nb_Reviews": 2,
          "Date": "2016-10-20T15:19:29.000Z",
          "Titre": "Office 2010",
          "Contenu": "Installation is working well. Good price. Quick response to purchase. One problem that led to 4 stars instead of 5 was that the key would not activate automatically over the internet. I had to use the telephone method and get an activation code. Kind of a pain, but it worked and everything is working well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 3,
          "Date": "2016-10-22T19:23:00.000Z",
          "Titre": "Great customer service",
          "Contenu": "Software works fine. Only complaint is amount of time between purchase and ability to download. Took about 30 minutes, so am losing a star for that.But customer service responded on a weekend and helped me understand that another email would be coming with download instructions.Good service and vlaue"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason Harris",
          "Nb_Reviews": 1,
          "Date": "2020-12-08T18:37:54.000Z",
          "Titre": "Order #2000444411",
          "Contenu": "Order #2000444411Hello MyChoiceSoftware,My overall experience was positive but had an issue with receiving the initial install email.  Your support team had sent an email for a hold to verify my information which I responded to immediately by calling.  The support representative notated the issue was resolved and an email would be received with the link.I waited until this morning to no avail.  I had to call support to request to have it manually sent.  I did confirm I did receive it after having to call back.  The representatives were courteous and friendly and did resolve my issue.Thanks!Jason Harris"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Uptime",
          "Nb_Reviews": 1,
          "Date": "2016-11-07T14:16:12.000Z",
          "Titre": "Great and easy software",
          "Contenu": "We've purchased a number of Windows 7 Home to Pro upgrades in support of a project.  It became clear this is a manual process on the back end to deliver the keys so after hours isn't happening but they are very responsive during business hours.  Will use them for this every time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lynda",
          "Nb_Reviews": 1,
          "Date": "2016-09-19T15:23:13.000Z",
          "Titre": "Responsive Customer Service and Support",
          "Contenu": "I needed a copy of Office 10 and Mychoicesoftware was the only place that still was offering that version.  Tried doing the install on a Sunday and ran into problems; checked their support hours which was listed as Monday - Friday - and sent off my email asking for help...really not expecting a response until some time Monday. However, much to my surprise, I got an immediate response!Mychoicesoftware was there the during the whole process and the install was a success.  Thank you.Support means everything!  And your customer service team (David and Alex) were right on."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "No Signifying",
          "Nb_Reviews": 2,
          "Date": "2016-12-06T21:02:36.000Z",
          "Titre": "Good support, pleasant, helpful staff",
          "Contenu": "Needed help downloading Office 2010 which it turned out I'd ordered in error. What I intended to order was 2011. Once I'd successfully installed the wrong program, Mychoice quickly assisted me in correcting my mistake and facilitating the correct installation."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nina Osterhout",
          "Nb_Reviews": 1,
          "Date": "2016-09-15T22:05:52.000Z",
          "Titre": "Microsoft Office 10",
          "Contenu": "I would give this a five, but while trying to download the program, all the links disappeared and I couldn't figure out how to make sure that it had downloaded.  I finally went to windows explorer to make sure the program was there and that I could actually use it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Philip Burr",
          "Nb_Reviews": 3,
          "Date": "2016-10-02T15:56:34.000Z",
          "Titre": "Windows 10",
          "Contenu": "Purchased Windows 10 to install on my MacBook Pro. After getting right file type and assistance from your support staff all was well. Detailed instructions for this would have saved me some time though. Good part was quick support and software runs good on my MacBook"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T18:52:43.000Z",
          "Titre": "Thanks for getting me up to date."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Geri - Entelechy",
          "Nb_Reviews": 1,
          "Date": "2016-09-29T15:52:26.000Z",
          "Titre": "My second purchase from Mychoicesoftware",
          "Contenu": "Easy to order and great customer service.  I did have to call customer service because although I got confirmation of my purchase I was not seeing the payment on my credit card.  The order had gotten hung up somewhere and after the call everything went smoothly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Craig Coffee",
          "Nb_Reviews": 2,
          "Date": "2016-11-15T17:00:42.000Z",
          "Titre": "Good value (Could use a little more QA for keys.)",
          "Contenu": "It's a good value for a windows key, but took several exchanges of email before I got the right key, it appears there may be something broken. To their credit however, they did work through the issue and contacted the software vendor directly. (Microsoft)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vastine Watson",
          "Nb_Reviews": 1,
          "Date": "2016-09-03T02:15:36.000Z",
          "Titre": "Fine But",
          "Contenu": "The call in activation works fine, but the online version never works. If the online version is unsafe, just do away with it, and use the call in only. The problem with that is the customer has to use their personal cell phone to receive the activation code."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RDB",
          "Nb_Reviews": 1,
          "Date": "2016-09-27T13:49:29.000Z",
          "Titre": "First purchase",
          "Contenu": "Placed order and got email that software would need to be substituted for another version.  Was given option to cancel if I wasn't happy.  Software came in worked perfectly.  I appreciated the heads up and how it was handled.  I would order again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "kelly",
          "Nb_Reviews": 3,
          "Date": "2016-11-30T23:50:52.000Z",
          "Titre": "Very Satisfied",
          "Contenu": "Thank you for your help. And the follow up Email. Very good customer Service. As someone who has been in customer Service  for 30 years, I appreciate it I received my purchase yesterday 11/29/16 ,it was a gift for my son. He loved it.thank youKELLY"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sherry Sposeep",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T01:49:39.000Z",
          "Titre": "Overall a good experience",
          "Contenu": "Overall a good experience. It took several hours to receive software as I ordered on a Sunday evening, but that was expected.  Had a confusing message about 32 bit versus 64 bit but installed 64 bit and had no problems."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ginny Nuttall",
          "Nb_Reviews": 1,
          "Date": "2020-08-18T22:43:44.000Z",
          "Titre": "Easy purchase with my choice software",
          "Contenu": "I read a number of product explanations for Microsoft 2019.  I found your site as easy to read as the others. Check out went very well, no problems at all.Directions for installng appear clear and I am about to activate ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2020-10-26T23:17:00.000Z",
          "Titre": "Had a problem downloading Home Student…",
          "Contenu": "Had a problem downloading Home Student 2019, but a call to Support cleared up the problem.  Downloaded fine and installation completed.  Would recommend Mychoice software to anyone looking for affordable software."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Suek",
          "Nb_Reviews": 1,
          "Date": "2020-08-24T16:04:56.000Z",
          "Titre": "I purchased Office 2019 Home & Student…",
          "Contenu": "I purchased Office 2019 Home & Student edition. Best price on the internet. The download went fine. Had to certify license over the phone with Microsoft which took a little time. Programs work great. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronald Hebert",
          "Nb_Reviews": 1,
          "Date": "2016-10-06T00:16:03.000Z",
          "Titre": "The product key you provided does not work. Still.",
          "Contenu": "The product key provided me does not work. When I go to Microsoft support, they recommend I purchase an upgraded product key from them. What's up with this?After posting my initial review, I received an email from the vendor asking for a screen shot of the product key failure error message. After sending this to them, they promptly replied with a new product code for me to try, which I did, twice. It failed twice. I sent another email informing the tech of the results.After the third failed, My Choice has arranged a one-on-one phone resolution of this issue. I appreciate the fact that they strive for 100% satisfaction. Stay tuned."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry",
          "Nb_Reviews": 1,
          "Date": "2016-10-21T05:05:08.000Z",
          "Titre": "Great service",
          "Contenu": "I purchased windows 10 from MyChoiceSoftware and it arrived via email  within 30 minutes. However I did have to call Microsoft support to activate the operating system but that process took less than 10 minutes. Overall great service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 1,
          "Date": "2016-10-27T22:11:12.000Z",
          "Titre": "Works",
          "Contenu": "Everything went smoothly and quickly. I received the codes within 1 hour of my purchase and was able to download smoothly and quickly. Only caveat is I haven't had a chance to fully test, only opened and tested basic function."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diane Drake",
          "Nb_Reviews": 2,
          "Date": "2020-11-17T20:13:13.000Z",
          "Titre": "Aside from the pop-ups",
          "Contenu": "Aside from the pop-ups, the purchase and download went well. The pop-ups, however, are very annoying and often blocked the screen. I saw no x to detele the pop-ups, so I had to try to work around them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Gowler",
          "Nb_Reviews": 1,
          "Date": "2016-08-31T17:16:08.000Z",
          "Titre": "Link Issues But Resolved Quickly",
          "Contenu": "They sent me a couple of links for the download that didn't work. They had me try Chrome and Firefox but they didn't work either.  Then they sent a Dropbox link and it worked fine.  Customer service was very responsive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Petrash",
          "Nb_Reviews": 1,
          "Date": "2021-01-22T15:55:05.000Z",
          "Titre": "Microsoft Home & Student Purchase",
          "Contenu": "Download and installation of Microsoft Home and Student 2019 went fairly smooth.  Did need help installing a couple of times and My Choice Software was quick to respond.  Satisfied with purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 1,
          "Date": "2016-10-23T18:54:08.000Z",
          "Titre": "Good site to buy software",
          "Contenu": "I purchased Microsoft Visio 2013 Pro. At first I had some issue with installing the software on My windows 10 computer. I contacted their support and received a response and solution promptly and got the software installed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Mooth",
          "Nb_Reviews": 1,
          "Date": "2016-11-01T15:28:14.000Z",
          "Titre": "Good Support, SLow turn over",
          "Contenu": "Support was excellent.  I was able to get the help I needed promptly.I was baffled why I could not download the soft ware right away when I purchased it, sort of like iTunes.  However, in all, it is a good service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "P. Weaver",
          "Nb_Reviews": 1,
          "Date": "2016-09-06T19:06:49.000Z",
          "Titre": "Four out of Five ain't bad",
          "Contenu": "I got the software, I got the key, I installed it on my computer and it works. I dinged them one star because of the funky confirmation process but I suppose it's for protection of the customer and the vendor."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Prabhat Malaviya",
          "Nb_Reviews": 1,
          "Date": "2019-05-03T18:00:47.000Z",
          "Titre": "Could not find the activation…",
          "Contenu": "Could not find the activation instructions/key initially and after a single email to them, I got the link and clear instructions and was able to activate it without a hitch. I would buy from them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chip Eichelberger",
          "Nb_Reviews": 4,
          "Date": "2016-11-15T00:58:55.000Z",
          "Titre": "Great customer service",
          "Contenu": "Had a little challenge with the MicroSoft product key but I think it was all on MS not on the MyChoiceSoftward. I had to call a couple times and the rep was very patient and we got it figured out. Very happy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lea Rush",
          "Nb_Reviews": 1,
          "Date": "2017-06-12T03:56:31.000Z",
          "Titre": "The prices are great",
          "Contenu": "The prices are great. The activation process a little more complex than I expected, but it worked the first time, which is better than I can say for a different software vendor. Thanks for the opportunity!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Rogers",
          "Nb_Reviews": 1,
          "Date": "2016-12-04T00:14:53.000Z",
          "Titre": "Good with a small exception",
          "Contenu": "When I initially tried to install the software, Microsoft refused the code.  It turned out I had to call them because it was an old product.  It would have been nice if I had been told that up front."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Loder",
          "Nb_Reviews": 1,
          "Date": "2016-09-10T19:12:47.000Z",
          "Titre": "Office2010",
          "Contenu": "Software download was good, but getting confirmation code to activate was a challenge. I downloaded on a Saturday and had to wait until Monday late morning to activate as I am on the East Coast."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Francois GIRIN",
          "Nb_Reviews": 1,
          "Date": "2021-01-15T14:18:15.000Z",
          "Titre": "Easy process",
          "Contenu": "Easy process but some of the emails went to regular inbox while others (especially the one with setup process and activation codes) went to junk so it delayed process..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry",
          "Nb_Reviews": 3,
          "Date": "2016-09-05T13:42:22.000Z",
          "Titre": "Wonderful Service",
          "Contenu": "With regards to Microsoft Office, the product is well known, but the customer service at MYchoicesoftware was prompt and friendly when I had a small delivery issue. I highlyrecommend them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jenni Silberstein",
          "Nb_Reviews": 2,
          "Date": "2016-11-02T23:10:00.000Z",
          "Titre": "Student & Home 2010 Word & Excel",
          "Contenu": "I got good customer support to install my product. It is working fine. This was the most economical option to give me the applications that I use without having to renew a subscription."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "dale eaton",
          "Nb_Reviews": 2,
          "Date": "2019-04-03T14:56:50.000Z",
          "Titre": "Since I do not understand electronics I…",
          "Contenu": "Since I do not understand electronics I did not this order was sent to my E-mail. I have now installed Windows 10 on this  PC. I hope it works. Thank you for setting straight."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deb",
          "Nb_Reviews": 2,
          "Date": "2021-01-03T20:11:40.000Z",
          "Titre": "Microsoft Office Home & Student 2019",
          "Contenu": "I purchased this for my husband, this is his review: I'll start off with the positive - It's installed and it works now.  Now for the few issues that I experienced.  First, the download initiated as soon as I hit the link.  However, since a new window didn't open, I hit the link several more times before realizing it was downloading in the background!  No problem though.  Then after it was mounted, I got an error that it was a 32 bit, not 64 bit.  But there was an option to install the 64 bit version.  Ok.   Finally, when I input the product key, I got an error message that it had already been used.  The good news was that the Microsoft activation wizard automatically gave me information to contact them by phone if the message was in error.  After some time and giving them a 56 number code & entering back in a 48 number code, everything works fine!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2017-12-07T20:02:12.000Z",
          "Titre": "Service was very good",
          "Contenu": "Service was very good, Spencer was very responsive.  Could use a warning about the software actuation process.  Cost me a lot of time trying to get product (Office 13) activated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregory Copley",
          "Nb_Reviews": 2,
          "Date": "2016-09-25T00:53:47.000Z",
          "Titre": "Responsive and helpful",
          "Contenu": "There were difficulties in online registration of a software package I'd acquired through Mychoice, but the email link ensured a rapid response and resolution of the problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:05:38.000Z",
          "Titre": "Tyler was very helpful and…",
          "Contenu": "Tyler was very helpful and knowledgeable about the problem that I was having. He was able to provide a solution in a very timely manner. I will definitely buy from My Choice Software in the future and would highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Bennett",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:00:14.000Z",
          "Titre": "I want to thank Dustin for the…",
          "Contenu": "I want to thank Dustin for the fantastic job he did.  He not only resolved the issues I had but also gave a follow up call to make sure all is working ok.  He went way beyond my expectations and this is coming from a person that has been a customer service professional for over 20 years.Thanks again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:56:40.000Z",
          "Titre": "Outstanding Support from Finn and My Choice",
          "Contenu": "Finn was amazing in helping me get my software activated.  He went above and beyond to help me and make my activation a success.  It's hard to find people willing to help like that now days and I really appreciate the help and follow through.  Thank you Finn!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lorraine",
          "Nb_Reviews": 6,
          "Date": "2023-12-18T21:25:40.000Z",
          "Titre": "Tyler did a great job",
          "Contenu": "Tyler did a great job! I was a bit lost trying to install this software. Did not realize that I had actually downloaded it, and had no idea what to do afterwards. But Tyler knew everything that had to be done, and did it very efficiently!Thank you so much for your help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Terrillion",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:22:32.000Z",
          "Titre": "Kat, Ryan & Dustin",
          "Contenu": "Kat, Ryan and Dustin provided excellent and very knowledgeable support in the installation of my Microsoft Office product.  Their knowledge of the Microsoft products and the idiosyncrosies of dealing with the Office suite on a new laptop was very important in allowing me to get my new product installed successfully."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monica Hill",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T23:37:31.000Z",
          "Titre": "My experience was great!",
          "Contenu": "My experience was great. I am 61 years old and the young man who took my call explained clearly and sent me detailed instructions. I was able to install the software myself. Unfortunately, I ran into a Bios systems error. I will need a new computer. I called to see if I could get a refund. Kat answered, she was very nice and took care of my problem. You have two great Representatives! :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Miller",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T20:24:44.000Z",
          "Titre": "Out of This World Wonderful!",
          "Contenu": "Wow! I am so impressed! The customer service provided by My Choice Software is \"Out of This World Wonderful!\"  We purchase new computers infrequently.  My husband recently purchased a new store demo computer with Office 365 pre-installed.  I had ordered from My Choice Software in the past receiving discs with the previous orders.  This time we decided to go with a download link of Office 2019. I was a little nervous, but decided to go ahead with this option. First, I called 3 times and the phone was answered very quickly all three times!   My third call was answered by Kat and she was truly a life saver! At this point, I had realized that I should have uninstalled MS Office 365 prior to installing my new Office 2019 software from My Choice Software.  The Office 365 had literally been taking command of the situation and I needed help.  Kat was very patient and kind. She  was able to assist me remotely and removed the pesky Office 365 software for me and made sure that all of the Office 2019 programs were properly loaded. It was such a relief and we are very happy customers!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T21:34:27.000Z",
          "Titre": "There really is help if you call the help number on the download email!",
          "Contenu": "I needed help installing Office 2019 software that I purchased from Mychoicesoftware.com.  I called the telephone number on the instruction sheet and Greg, who was in California, quickly sorted out the installation for me.  He was very knowledgeable, and above all patient.  We had the software up in running in minutes. The download email came very quickly after purchasing the software."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T21:22:06.000Z",
          "Titre": "I needed help with activation code and…",
          "Contenu": "I needed help with activation code and after calling the help number on the download sheet, Tyler, a Tech for Mychoicesoftware, quickly helped me get my software activated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CHARLES",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:54:01.000Z",
          "Titre": "Mychoisesoftware was out of stock when…",
          "Contenu": "Mychoisesoftware was out of stock when I ordered.   They were nice of enough to call me and tell me about this and then gave me a call to tell a couple day later when they had it back in stock and gave me a code to discount my order"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:15:08.000Z",
          "Titre": "Install issues",
          "Contenu": "I was having issues installing the purchased software and after contacting My Choice Software support I was provided a step by step fix in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Mills",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T23:28:09.000Z",
          "Titre": "I was very impressed, with a couple of very minor complaints.",
          "Contenu": "+ I was very impressed and greatly appreciated that they actually answered their phone. The pre-sale support was great, they made sure that they gave me all the time I needed to answer all my questions and evaluate my purchase.- Although minor complaints, the website advertises 30-minute digital delivery, it took 1 hr. 45 min. Also again minor, the download instructions, download, and installation of the software were all flawless, but the software was not current and needed almost four hours of updates.All the above being said, I will recommend this site to my friends, and it will be my go-to site in the future.Thank You, My Choice Software you're doing all the right things, don't let that stop you from continuing to grow even further."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig Etheridge",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T19:49:51.000Z",
          "Titre": "MS Office - Alex to the rescue",
          "Contenu": "The call with Alex shows talking is better than typing,  After multiple attempts through Paypal correspondence, after Microsoft muddied the water with naming everything 365, and after much frustration Alex, a true professional called and took care of all my issies.  Thank you Alex"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Virginia Bender",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T03:26:56.000Z",
          "Titre": "The software is good but the associates, specifically Mr. Finn O.",
          "Contenu": "My experience was greatly enhanced by the support and help given to me by Finn O.  He went over and above to resolve my problem with downloading and installing my software.  He did almost every because I told him I have low vision and was having trouble. His calming demeaner and knowledge and ability helped me to understand that it was going to work this time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Advanced HPC \\ Jeff Tomlinson",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:01:50.000Z",
          "Titre": "Quality Customer service",
          "Contenu": "Thank you for helping me through a Microsoft server 2016 key activation. Ryan and Greg were very helpful. They showed patience and quality time to help me get the key activated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff James",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T01:44:21.000Z",
          "Titre": "There is nothing that O can think of off hand",
          "Contenu": "The gentlemen's name is Finn. Not only did he help me with the issue that I was having with installing the program, but he waited on the line to make sure that it installed properly and was functioning. I repair computers for a living, and I deal with technicians and support all the time and in this day and age it is rare to find somebody as efficient as Finn. I know that if I call up again with any other problems that I can safely say that if the rest of the technicians are half as good as he is I would have no problems that could not be solved.Thanks again and I will be buying my software from your company from this point forward,Jeff James"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gordon",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T19:31:51.000Z",
          "Titre": "I needed to complete a document for…",
          "Contenu": "I needed to complete a document for work on Microsoft Word. When I opened my office, it asked for the product key. Because I had downloaded the program, I searched for the key in my emails, but could not find it.I called you, and Ryan helped me with a new download of MS office 2019. I am back up and working.Great job Ryan, and thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon Harris",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T17:54:02.000Z",
          "Titre": "Awesome guy!",
          "Contenu": "He made it super easy and understood exactly what I needed. He made it enjoyable talking to customer support and we all know it's normally a pain in the butt."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T21:27:36.000Z",
          "Titre": "Smooth transaction",
          "Contenu": "Smooth transaction. Got an email stating item was out of stock and would be several weeks coming in. MyChoiceSoftware offered me a complimentary upgrade due to the stock issue, therefore I got more than I bargain for. It was absolutely a pleasure doing business with you and look forward to doing the same in the near future. Thank you.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 6,
          "Date": "2023-12-18T21:26:48.000Z",
          "Titre": "Greg S",
          "Contenu": "Greg S. helped me with an activation problem,he was very helpfull and made it easy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pat",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T22:47:29.000Z",
          "Titre": "Greg's Outstanding Support",
          "Contenu": "After 3 different agents on 4 different phone calls, and darn near having a nerves breakdown last week, Greg, my agent today, knew exactly what needed to be done, and he got me up and working with forbearance, courtesy and a professional attitude for which I was very grateful.  I'm 74 years old and taking treatments for stage 4 cancer so I truly appreciated Greg's patience.  Greg never showed any irritation at the length of time it took to get this Mac going.  Greg is my new favorite person today."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Cooley",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T05:08:59.000Z",
          "Titre": "Microsoft Office registration key help",
          "Contenu": "Was only on hold a short time getting my Microsoft office student 2019 registration key. Tyler was a huge help and keep it really quick and simple to access!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raheem",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T20:50:10.000Z",
          "Titre": "Tyler V from MyChoice Software is Amazing",
          "Contenu": "Tyler from My Choice Software is an amazing person to work with on the phone when asking questions and leading a helping hand in getting your problem resolved. He was extremely patience with me as he walk me through the steps in getting my Windows 10 Home upgraded to the Pro version Overall, he has amazing customer service skills and deserves a raise for his hard work that he puts when going above and beyond his typical duties."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dongwei Zhu",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T02:01:24.000Z",
          "Titre": "Installation Help",
          "Contenu": "I had some problem with the installation process, and call the help line.  Finn was very patient and walked me through and got everything fixed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T16:34:45.000Z",
          "Titre": "He was great",
          "Contenu": "He was great.  Very patient and bent over backwards to insure that my software was installed correctly.  He made me believe that I was his only priority.  I really appreciated his willingness to go the extra mile."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "williamsfaryahoo.com",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T17:47:38.000Z",
          "Titre": "They have great technical support",
          "Contenu": "They have great technical support. They work hard to try to help me to upgrade my computer, they really appreciate my business"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russell Hagen",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T00:55:41.000Z",
          "Titre": "Greg at My Choice Software tech support was great!",
          "Contenu": "After buying a new computer, I needed additional software. I purchased the software from MyChoicesoftware. Since my new computer ran Windows 11, I was unfamiliar with windows 11, and was having difficulties making the software work. I called the MyChoice Tech support line and talked to Greg S. He was patient, understanding, spoke clearly, and was able to solve my issues. I have never experienced that level of customer service in the past. I would definitely recommend MyChoicesoftware to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russell Blanck",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:55:05.000Z",
          "Titre": "Good coustomer service from Tyler V.",
          "Contenu": "Tyler V. explained the product I intended to purchase and provided a discount coupon.  Great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elaine Avery",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:43:37.000Z",
          "Titre": "Many...many thanks!!!!",
          "Contenu": "I cannot tell you how frustrated I was getting in trying to do something I \"thought\" I could do. Found out how \"non-technical\" I can be and greatly appreciated the assistance (and patience) Tyler provided in talking me through to access the program. Also a shout out to Gage, who initially provided information on removing a program that was still in place and impeding the installation of the program.Thank you both for your assistance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Bauer",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T01:17:11.000Z",
          "Titre": "Tyler was incredibly helpful with my order.",
          "Contenu": "Tyler was incredibly helpful with my order. Due to a high customer volume of orders, you weren't able to get me the software under the deadline I had for installation. Tyler was able to instantly process a refund for me, and his courtesy, knowledge and helpfulness make me feel that Mychoicesoftware is a company I will use if I ever need to place another order in the future. I wish all customer representatives were as good as Tyler!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T01:10:48.000Z",
          "Titre": "Tyler was very helpful on getting me…",
          "Contenu": "Tyler was very helpful on getting me all set up for my software to be installed on my computer this is the 2nd time I used my choice software and I love the customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T17:45:22.000Z",
          "Titre": "Thank you for this opportunity",
          "Contenu": "Thank you for this opportunity, Tyler was extremely helpful, knowledgeableand courteous, but most importantly his guidance got me connected on my computer!Thank you, Lou"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janis",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T21:18:45.000Z",
          "Titre": "First I had a live chat with Tyler",
          "Contenu": "First I had a live chat with Tyler.  Soon after I called the 800# and coincidentally got Tyler on the phone call to get details about a possible upgrade of my Microsoft Home & Student 2019 I purchased in Jun 2021.  He was  very helpful, patient, and knowledgeable on my inquiry for price and features of the available options.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shaw Awber",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T20:58:09.000Z",
          "Titre": "Kat was amazing",
          "Contenu": "Kat was amazing! I bought the wrong product, Windows 10 pro, I needed 11 pro and was about to give up. Kat Answered on the first ring, fixed my issue in a mater of seconds literally."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Z",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T01:49:27.000Z",
          "Titre": "Dustin is THE BEST",
          "Contenu": "Dustin went above and beyond to ensure I knew which Software to purchase as well as how to install it!He made a very scary, nerve racking experience smooth and easy! I really appreciate his patience and help! I will definitely be using My Choice Software for any future software purchases!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Cummings",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T20:21:45.000Z",
          "Titre": "Finn was calm and patient as he walked…",
          "Contenu": "Finn was calm and patient as he walked me through the steps to install Microsoft Office. He went out of his way to call me the following day to insure that the software was properly registered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kris Trout",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T00:45:05.000Z",
          "Titre": "Gregory and Gabe were awesome",
          "Contenu": "Gregory and Gabe at Mychoicesoftware were so patient and helpful. I loved that when I called for Tech Support I got a rep usually within one minute of holding. It was so nice not to hang on hold for an hour like other tech support places. And Gregory and Gabe knew their stuff and stayed with me until my problem was solved. Very satisfied and grateful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jj dai",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T20:05:06.000Z",
          "Titre": "Great sales support for Tyler",
          "Contenu": "The sales manager Tyler helped me to make the final choice of software packages, and answered my questions patiently. As a result, I decided to purchase the packages today."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward Brown",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T06:50:02.000Z",
          "Titre": "Thorny Issue",
          "Contenu": "Thorny IssueIt took several calls to get this issue resolved, but each call allowed me to take the next step in the process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T21:06:23.000Z",
          "Titre": "Awesome!",
          "Contenu": "Greg did a great job. Many hurdles in the installation, but he cleared them all. Very friendly and helpful. Give him a raise!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T03:40:21.000Z",
          "Titre": "The software was exactly what I bought",
          "Contenu": "The software was exactly what I bought, easy to download and easy to install."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Fink",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:23:18.000Z",
          "Titre": "I had an issue about the billing address",
          "Contenu": "I had an issue about the billing address and wanted to assure that the order went through. It did but the confirmation went to my spam folder and Tyler was very helpful in directing me where to look for it.Thanks so much, Tyler!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Zichettella",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T18:26:27.000Z",
          "Titre": "Spoke to Ryan",
          "Contenu": "Spoke to Ryan, he had the answers to all my questions, I got a good feeling of trust with his knowledge and helpfulness.  I will definitely be contacting Ryan if I need more help with the software.  Great Customer Service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Gilbody",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T20:10:17.000Z",
          "Titre": "Tyler is always there to help answer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 3,
          "Date": "2023-11-24T19:40:36.000Z",
          "Titre": "Excellent Help",
          "Contenu": "I was having trouble installing “Microsoft Office Home and Student 2019”. It is a low-priced product compared to most of the software sold by My Choice Software. I called the support number and spoke to Tyler Y for help and he was amazing. He treated me like I had purchased a million-dollar product. He got my software working with-out a problem. Great job Tyler!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phil G",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T02:07:40.000Z",
          "Titre": "Help from Tyler",
          "Contenu": "I purchased software and needed to install it today. I had an issue that would not allow me to add the software. Tyler identified the issue immediately and two minutes later the software was loading. I appreciate the quick response and help to get the software installed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T21:35:28.000Z",
          "Titre": "Tyler was extremely easy to understand…",
          "Contenu": "Tyler was extremely easy to understand (very unusual today) as well as very knowledgeable about your products and support. He made me feel very comfortable about purchasing from your company (first time customer)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Mattano",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T00:39:24.000Z",
          "Titre": "Loading office",
          "Contenu": "Tyler went thru all the steps to get office loaded. I was really frustrated before I talked to Tyler.  He was patient with me, very friendly, and extremely helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T02:14:24.000Z",
          "Titre": "Positive Attitude and knowledgeable!",
          "Contenu": "Positive Attitude and knowledgeable!Tyler quickly helped assess the problem, verified the issue with his team and I was on my way. Gave me his name in case I needed to contact him again.Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T23:34:53.000Z",
          "Titre": "Quality service",
          "Contenu": "Good price and selection of the products. When I had difficulty with the install your customer service rep was able to help me quickly and professionally."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allevia Technology",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T23:07:03.000Z",
          "Titre": "All your server key needs! Quick and easy :)",
          "Contenu": "Sales rep (Gabe) was quick in response, handled all my software needs, and made sure I had all coupons applied for the best price possible! My #1 place to go for my server licenses and keys. Received my codes within minutes of purchase :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CRG",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T23:34:21.000Z",
          "Titre": "Great customer service.",
          "Contenu": "Finn did a great job walking me through a fix for installing my purchase of Microsoft Home and Student 2019.  He was patient and professional.  He knew exactly what to do to assist me and it was greatly appreciated.  Outstanding customer service!  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenny L",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T01:06:58.000Z",
          "Titre": "Tyler was very helpful with my purchase…",
          "Contenu": "Tyler was very helpful with my purchase of Microsoft 365 Office. He’s very knowledgeable and was helpful in answering my questions about the product. He was also was very helpful with guidance and instructions to get it installed on my PC."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T20:28:58.000Z",
          "Titre": "Tyler was very supportive in that I am…",
          "Contenu": "Tyler was very supportive in that I am a novice when installing upgrades. Tyler walked me through the steps without question including helpful web sites for other updates. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A College",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T10:42:09.000Z",
          "Titre": "Dustin is very knowledgeable and he was…",
          "Contenu": "Dustin is very knowledgeable and he was of great assistance in helping me solve my Windows 10 dilemma.  He is also easy to work with over the phone.Excellent employee."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michal",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T00:04:02.000Z",
          "Titre": "Easy to purchase and clear, concise, easy instructions to follow",
          "Contenu": "It was very easy to purchase what I needed and the instructions to install the software were clear and concise; very easy to follow. When I did have to call into customer service for an odd glitch on my end,  Finn was very helpful in assisting me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phil Robinson",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T22:00:27.000Z",
          "Titre": "Purchasing Microsoft Office for Mac",
          "Contenu": "I was having an issue with the latest version of Microsoft Office for Mac. Tyler went above and beyond, in my opinion, in finding a solution. I have work for call center training for years and I must say this has been my best experience. I would give Tyler the best CSAT possible."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheldon K.",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T19:24:22.000Z",
          "Titre": "Tyler helped me more than resolve my…",
          "Contenu": "Tyler helped me more than resolve my order problems.  He went above and beyond.  As such he is an excellent representative for the company.  The next time I'm seeking software, I'll turn to Mychoicesoftware first."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jeffrey evans",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T21:35:55.000Z",
          "Titre": "As my product was not available I was provided an upgrade.",
          "Contenu": "As my product was not available, I received an upgrade without any question or for additional money.  Company was very responsive to my question raised regarding downloading.  Tyler was helpful, professional, and very courteous."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARJORIE KUHN",
          "Nb_Reviews": 4,
          "Date": "2023-11-21T22:38:33.000Z",
          "Titre": "Tyler was great",
          "Contenu": "Tyler was great! He was extremely patient, knowledgeable helping me with both downloading and installing Office 2019. Your company is very lucky to have him as an employee."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeanne Andrade",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T01:49:45.000Z",
          "Titre": "Dustin is terrific",
          "Contenu": "Dustin is terrific. He is very knowledgeable and willing to work with you to solve any issues and he does with kindness, patience, and professionalism. I am very grateful for his help. It was complicated and he found the solution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T18:47:02.000Z",
          "Titre": "Was provided instruction for download…",
          "Contenu": "Was provided instruction for download of software (Win 11 Pro) and it needed more steps and was guided through very professionally"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wes H.",
          "Nb_Reviews": 3,
          "Date": "2023-11-23T22:55:04.000Z",
          "Titre": "A Seamless Experience",
          "Contenu": "I had a seamless experience finding the exact software I required for my new PC and then going through checkout. The whole process only took a couple of minutes!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Jensen",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T23:42:31.000Z",
          "Titre": "Tyler went above and beyond to assist…",
          "Contenu": "Tyler went above and beyond to assist with my problem.Tyler V.  was very help and spent the time to make sure that we were able to resolve the issue I was having.  He truly went above and beyond what I ever expected.  Walking through a number of different steps to help me secure my product issue.  He was Knowledgable and quick to answer the questions.  He demonstarated way above bar performance in customer serivce, knowledge of process, and commitment to the job.  If all were like Tyler in this regard people would have a great expereince with customer service reps."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "timothy adams",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T23:27:11.000Z",
          "Titre": "exceptional service",
          "Contenu": "While I thought I kinda sorta knew what I was doing,  I ended up making some dumb mistakes & could not figure out how to resolve.  On several occasions that same day,  I called mychoice for support.  Each time I called,  I did not have to wait long at all for a person & the man who answered was fabulous at listening to my situation,  assuring me that we'd get it all sorted out & helped me get things resolved.  The customer service they provided was top notch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stratford Courtyard",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T19:21:10.000Z",
          "Titre": "I had the pleasure of having 2 of the…",
          "Contenu": "I had the pleasure of having 2 of the most friendly and helpful young men assist me today. Both Tyler and Gregory were patient, friendly, and extremely helpful. If they are an example of your customer service representatives then you are very blessed to have such amazing employees."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynn Bergman",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T16:42:43.000Z",
          "Titre": "Good experience from beginning to end.",
          "Contenu": "The web site was easy to navigate, and the product information clear enough to make meaningful comparison to similar products.  Competitive pricing and easy installation process made me very happy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "E.M.A.A.",
          "Nb_Reviews": 3,
          "Date": "2023-11-28T19:24:46.000Z",
          "Titre": "Kat gave me very professional guidance…",
          "Contenu": "Kat gave me very professional guidance and helped me through the uploading program process with great patience.  I am very thankful to her."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raheem",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T00:25:11.000Z",
          "Titre": "Excellent customer service!",
          "Contenu": "Tyler gave amazing customer service in assisting me with installing Windows 11 Pro product key and taking his time to answer all pressing questions regarding what I did wrong on my end. Overall, he was exceptionally amazing in getting to the bottom of resolving my issue and getting my Windows 11 Pro license active."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Fidelman",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T19:50:32.000Z",
          "Titre": "Solving Complex Problems",
          "Contenu": "Although I'm not in the habit of writing reviews I must comment on the assistance of Mr. Gabe M from MyChoiceSoftware. It was a complicated problem in my experience and he worked through what I may call non-obvious solutions to get me up and running. His work was intelligent and efficient, a rarity in this world, especially in IT support. MyChoiceSoftware has won me over as a customer and I wish others would follow my lead if only for their own benefit. Can not say enough as a compliment to Gabe M."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Leanne Kamel",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T20:22:43.000Z",
          "Titre": "Helpful with activation",
          "Contenu": "I needed help activating Microsoft Office on my laptop. Tyler helped me activate it over the phone and then followed up by email to make sure that everything was working properly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marty Brown",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T22:14:19.000Z",
          "Titre": "Quick and Helpful Support",
          "Contenu": "When I call My Choice Software for Support, they answer quickly and they are always polite and professional. Tyler helped me this afternoon and now I am up and running!! Thanks Tyler"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Natarelli",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T02:12:30.000Z",
          "Titre": "Ryan is one of the best people I have…",
          "Contenu": "Ryan is one of the best people I have every worked with in this industry and I have been doing it for 30 years. Really fast response times and answers all my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T20:12:23.000Z",
          "Titre": "The reason that I would recommend Mychoicesoftware is how easy it is to select the right product that you want.",
          "Contenu": "The reason that I would recommend Mychoicesoftware is the ease of ordering and if you need to chat with anyone that is simple and painless.  Also, the response time from the Support department is also very timeless and with very good direction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Baker",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T22:14:46.000Z",
          "Titre": "Top-notch, timely service",
          "Contenu": "I was just about to register the software I purchased when Greg from MyChoiceSoftware called to see how I was making out.  He stayed on the line and helped me successfully register the software.  His timing was perfect, and his help was greatly appreciated!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony D",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T17:19:39.000Z",
          "Titre": "Tyler review",
          "Contenu": "I talked to Tyler today. He was very polite, knowledgeable, and efficient.  This was one of my best customer service representative."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T20:30:14.000Z",
          "Titre": "Gregory was very informative and made…",
          "Contenu": "Gregory was very informative and made good suggestions for my purchase. I installed the program without a problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "karen white",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T23:52:23.000Z",
          "Titre": "phone call",
          "Contenu": "Tyler was very helpful with his explanation"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Grist",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T00:13:19.000Z",
          "Titre": "Software Installation Problem",
          "Contenu": "I bought a new computer yesterday. I purchased a Microsoft software product from Mychoicesoftware today. I spent hours trying to install it with no success. Until, that is, I called and related my problem to Tyler. Tyler managed to fix my problem and had the software up and running in minutes. Many, many thanks to Tyler."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benjamin Rathke",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T00:28:36.000Z",
          "Titre": "Supportive and Understanding",
          "Contenu": "The caller (Greg) was polite, straightforward, understanding of my situation, and even though I had to take time to stop a few tasks I was doing at the time of the call, he was patient the whole time and I never felt rushed.  Good thing he called at all too, because I would've been met with one of Windows' notorious \"invalid key\" errors, and Greg walked me through the tedium of the workaround.  I wasn't expecting a call in the first place, but ended up glad it happened!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenda",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T00:02:31.000Z",
          "Titre": "The My Choice representative was very helpful.",
          "Contenu": "The My Choice representative was very knowledgeable and helpful. He took the time to remote into my computer and fix the problem I was experiencing. I have been working on this problem for several weeks, Greg was a great help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dean Krause",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T00:31:33.000Z",
          "Titre": "Helpful and being patient with my…",
          "Contenu": "Helpful and being patient with my questions.I was not sure what product I needed and with his help it was easy to make the choice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Harris",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T20:12:24.000Z",
          "Titre": "Helpfulness",
          "Contenu": "Tyler was able to explain when I am slated to receive my product ordered. I couldn’t tell for definite on the email + links which is what prompted my call. I appreciate being able to reach a live person quickly, as like many, our free time is so limited. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Malcolm Oliver",
          "Nb_Reviews": 3,
          "Date": "2023-09-19T23:32:20.000Z",
          "Titre": "Excellent Technical Support",
          "Contenu": "I purchased Office 2019 which was very straight forward. However, I had a problem loading it, which was most probably my fault. I called the technical assistance hotline and spoke to Gregory. He could not be more helpful. He understood my problem, did a little research and then walked me through the solution. Perfect, my software then worked as it should. I am a very satisfied customer. Mychoicesoftware was recommended to me and now I understand why."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane P",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T15:03:29.000Z",
          "Titre": "Finn was excellent!",
          "Contenu": "Finn was excellent!  He guided me through the process of getting the software loaded and didn't hang up until I was confident we were complete.  Very personable and professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bernie Keller",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T04:26:53.000Z",
          "Titre": "Excellent Service",
          "Contenu": "Purchased M/S Office Professional-2021 based on company’s excellent reviews, and price was more than reasonable.  Greg S. was extremely helpful with the installation of this software, and genuinely concerned in assuring my satisfaction.  Can’t remember the last time I was so impressed! I would definitely recommend doing business with mychoicesoftware, you won’t be disappointed!  Excellent service and a friendly experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "taylor hilton",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T17:00:41.000Z",
          "Titre": "MY HERO",
          "Contenu": "I was in such a panic before I got on the phone with Dustin about my Microsoft issue. I have been trying to find answers to my questions online, with nothing coming up, or the ability to call Mircosoft. Dustin was kind and helpful for the 20-minute call. That's all I needed was 20min and I got my questions answered and my software up and running! Even with my background in tech, I needed help and I'm so thankful to have had Dustin in my time of need!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra Martin",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T22:06:01.000Z",
          "Titre": "Greg was very patient with me...",
          "Contenu": "Greg was very patient with me.... All my issues were resolved in a timely manner... He was very professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Abels",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T18:40:50.000Z",
          "Titre": "the agent was knowledgeable",
          "Contenu": "the agent was knowledgeable, quick and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christie",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T23:10:44.000Z",
          "Titre": "I reached out because I hadn’t received…",
          "Contenu": "I reached out because I hadn’t received my office home and student 2021 yet. Ryan was very patient and explained my options. Decided to purchase the 2019 so I could have immediate access. Sent me the refund notice and the link for download. One I started to download I had issues and called back and spoke to Justin. He was exceptional with helping me through the complete download…nothing is ever easy for me on the computer. He was patient and kind explaining and helping to make sure everything worked for me in the end."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan Curran",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T01:30:52.000Z",
          "Titre": "Finn was my CS rep",
          "Contenu": "Finn was my CS rep. He listened to my installation issue and got right to work to resolve the problem. in a few minutes I was up and running. Spot on Finn."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Norman Steadman",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T21:19:06.000Z",
          "Titre": "very good",
          "Contenu": "you were very helpful and took care my problems"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Young",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T19:13:52.000Z",
          "Titre": "Excellent experience with Customer Service",
          "Contenu": "Very little wait time.  Tyler, the Customer Service rep, was genuinely interested in my problem, researched it during our call, and resolved it quickly.  He actually followed up to make sure my problem was resolved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick Jovanovich",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T00:20:36.000Z",
          "Titre": "Exceptional Service",
          "Contenu": "I recently ordered software from Choice Software for my computer.  The technician (Gabriel Magana) was exceptional.  He was very thorough and helpful in this process.  He made this process very easy.  I rate him and his company as an A+ (top rating) and would certainly use Gabe and his company in the future for other software needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GEORGE",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T00:59:44.000Z",
          "Titre": "Finn was extremely patient and solved…",
          "Contenu": "Finn was extremely patient and solved my problem"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jewel Ikawa-Kotomori",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T23:20:51.000Z",
          "Titre": "He was excellent!",
          "Contenu": "He was excellent stayed on the phone with me to troubleshoot and walked me through the process. Very easy to talk to and helped me get a chat started with Microsoft let them log on to complete my issue. He hung up and called me back to ensure I was able to get everything resolved. The fact that he called back and double checked is amazing customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed Fallon",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T20:54:05.000Z",
          "Titre": "Tyler and Greg",
          "Contenu": "Tyler and Greg are knowledgeable and very personable. they were able to walk me through the steps to fix my problem with ease and patience. So nice to speak to an English speaking Techs. I was very impressed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Stokes",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:10:20.000Z",
          "Titre": "Tyler was Great!",
          "Contenu": "Tyler was able to work through the issues quickly and efficiently."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darlene K",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T21:17:22.000Z",
          "Titre": "Tyler is SUPER",
          "Contenu": "Tyler was SUPER!  I was so frustrated beyond words that I couldn’t get my Office purchase activated.  Tyler was so calm and collected the whole time, walking me through it all, and it was completed with ease.  I would recommend him to anyone.  KUDOS TO TYLER!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T15:05:31.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Alex was kind and patient as he answered my questions and solved the small installation problem that I was having due to a trial version of the same product being on my computer.  Before he hung up, he walked me through the phone installation process that I would encounter with Microsoft.  He made everything go smoothly.  I have recommended My Choice Software to others and will continue to do so."
        }
      ]
    }
  ]
}