{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "mypassportphotos.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "La Le",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T01:04:25.000Z",
          "Titre": "passport photo was not accepted",
          "Contenu": "passport photo was not accepted because the background was considered grey and not whitealso the format was disappointing. I thought I would receive the option to make a print with multiple copies of the photo but was just sent one single image and there is no option on the app to reformat the picture yourself onto a 10x15 print"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "IHAB ABUJARAD",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T21:19:33.000Z",
          "Titre": "I sent a photo with a blue background",
          "Contenu": "I sent a photo with a blue background. I received it with a white background instead!!Waste of money and I ended up paying extra for Walgreens!! Scam at it's best"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "mathias munro",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T18:34:22.000Z",
          "Titre": "the photos i got were rejected by the…",
          "Contenu": "the photos i got were rejected by the canadian government so i wasted 2 months of waiting for my passport to be rejected because of the photos i bought from here."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barrie Culver",
          "Nb_Reviews": 2,
          "Date": "2023-04-07T16:34:30.000Z",
          "Titre": "Wrong size photo plus they wanted…",
          "Contenu": "Wrong size photo plus they wanted additional money for the photo. Extremely poor customer service, no phone number to talk to anyone. MUST email very, very, bad. Won’t use or recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marion MEUNIER",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T03:45:04.000Z",
          "Titre": "Never received my pictures and had to…",
          "Contenu": "Never received my pictures and had to take PTO to get them done before my appointment"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "C.",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T10:55:37.000Z",
          "Titre": "First to try out the services",
          "Contenu": "First to try out the services. I thought I would be able to use my selected photo. After I submit for verification standards, I went to print out my photo. Unfortunately, I wasn't able to use due to size needing to be 2x2 and on matte paper and to fit the size for my passport etc. The price wasn't the issue, which was just 5.99. But I wasn't able to receive a refund from ivisa etc. Moving forward, I know what to do and to just visit my local CVS store to obtain a passport photo etc. Which I did and still save $ and at CVS I was able to get a great discount and only paid $5 there. I have no issue with ivisa, mypassport.com. I just went to alternative route and use other services for a passport photo in person."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Irene Caporali",
          "Nb_Reviews": 4,
          "Date": "2023-04-12T20:57:00.000Z",
          "Titre": "need a date and signature to validate…",
          "Contenu": "need a date and signature to validate the photo without it the photo is just a photo and not valid for any document."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LaDonna Gordon",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T18:20:05.000Z",
          "Titre": "It was very confusing",
          "Contenu": "It was very confusing! I applied because I thought ivisa was for my visa. I don’t need a passport photo now how do I get a refund"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "C Cusack",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T23:38:51.000Z",
          "Titre": "Wrong dimensions… poor customer service",
          "Contenu": "I ordered a passport photo for an Irish passport application.  They did not cut at the correct dimensions for Ireland.  When I reached out to customer service, I received kind of a bizarre unintelligible response that didn’t even make sense. Hi"
        },
        {
          "Note": 1,
          "Lieu": "CI",
          "Pseudo": "Angba lucien Amon",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T21:53:36.000Z",
          "Titre": "I don’t know if you are serious or not",
          "Contenu": "I don’t know if you are serious or not. I paid all the fees before I completed the application for UK visa. So today , I don’t know what about this application, no mail to explain me the next step"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "C.P. Bachowski",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T07:11:02.000Z",
          "Titre": "Didn't get my product",
          "Contenu": "Made two $20 orders, shipping was supposed to be 2-4 business days. It's been 8 days and nothing. $20 and doesn't even come with a tracking number."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MorganStern",
          "Nb_Reviews": 2,
          "Date": "2023-02-11T16:24:32.000Z",
          "Titre": "Digital Photo Rejected in Passport Application",
          "Contenu": "The digital photo I bought got rejected in the online .gov passport application for not being enough pixels. I contacted customer service for ivisa for a refund and got a generic response. I ended up using the unedited photo I took on my iphone and it worked perfectly. Zero stars!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David McKenzie",
          "Nb_Reviews": 2,
          "Date": "2023-03-03T01:00:53.000Z",
          "Titre": "I was unable to print my picture",
          "Contenu": "I was unable to print my picture, and I have a pretty good printer. I was told that I might choose another printer or have my picture sent to a pharmaceutical drug store. I chose this company because it appeared to be easy but easy was not the word I would use."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eunice",
          "Nb_Reviews": 4,
          "Date": "2023-02-11T02:01:21.000Z",
          "Titre": "I asked for both digital and printed…",
          "Contenu": "I asked for both digital and printed copies of CANADIAN PR passports. That specifies a 2” x 2.75” passport.First, I was only sent the digital copy and had to send multiple emails before the printed copy was sent over a week after the order was placed.Then the printed copy arrives and it is not the right specification. It is not the required 2” x 2.75” neither is it even the usual American 2” x 2”!!!I already told them, this is not proper business etiquette. Would not recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Unhappy customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T20:55:12.000Z",
          "Titre": "My order never arrived"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "EOL",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T16:38:29.000Z",
          "Titre": "Improvement Needed",
          "Contenu": "Unfortunately my experience with this company was not a good one at all.  There were tremendous delays, lack of responsiveness with customer service, and a very unclear process for securing a refund (which I was never able to get)."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Anatoli",
          "Nb_Reviews": 2,
          "Date": "2023-02-27T21:49:55.000Z",
          "Titre": "My ordered photos never arrived.",
          "Contenu": "I ordered passport photos and paid for an Expert review. 1 month later, the photos never arrived and I was told that I can't get my refund.Shame on you, scammers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chantalynn",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T02:13:53.000Z",
          "Titre": "Photos have not arrived!",
          "Contenu": "I ordered my passport photos a week ago on 2/16/2023. It showed me that it was shipped the same day. It also said 2-4 business days. It is now 2/23/2023 and my photos did not arrive. I had to forgo a passport appointment today. Not happy.When I emailed customer support, I was told that if my photos don’t get here today, I can contact them and they can send it to a local CVS for me to pick up. Why isn’t this an option right from the beginning?!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Friendo",
          "Nb_Reviews": 2,
          "Date": "2023-02-20T02:20:25.000Z",
          "Titre": "Are you really asking me this?",
          "Contenu": "Are you serious? I thought this was a scam after I got my order!  Stll seems scammy to me.  Ordered passport photos advertised to be \"100 government compliant\". Not only were they way too big, but then when I asked them to fix it, they obviously didn't know how do they sent me the same exact wrong thing again. Then, when I asked for a refund, they tried to tell me they filed it with the government already and they can't refund my $4.09 because of it! They did not file PHOTOS with the government! What a silly reason to lie about to avoid a refund. Then when I told him this, he reluctantly refunded me $3.68, when the order was $4.09 to begin with! Worst experience I've ever had with anything. Terrrible service you have there. Wow! Got it done at Walmart no problem."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Diane",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T02:13:39.000Z",
          "Titre": "Poor service",
          "Contenu": "Took multiple tries to get a photo that works. Poor customer service. No service recovery."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Asfaw",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T05:35:21.000Z",
          "Titre": "They didn't deliver",
          "Contenu": "I really counted on this service but was disappointed. Ordered 12 photos for an urgent trip. Went to the Walgreens I selected for pick-up only to be given 4 photos. Contacted customer service and was told they reordered it for me but I couldn't pick it up until the next day, so I had to go get my photos taken and incurred an urgent photo fee. Only use this service if you're not in a hurry."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Simon Rolfson",
          "Nb_Reviews": 2,
          "Date": "2023-01-10T18:16:59.000Z",
          "Titre": "If I could give you a zero I would",
          "Contenu": "If I could give you a zero I would. Horrible experience. Sent me the wrong passport size photos. I ordered Canadian size passport photos and I got something else. Had to go to Walgreens. Won’t supply a refund for their mistake."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elyse Vane",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T17:19:32.000Z",
          "Titre": "Unacceptable editing on my passport…",
          "Contenu": "Unacceptable editing on my passport photo. Zero chance it will be accepted. I have received nothing in the mail. I will be calling my bank to report this as a scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dan Badescu",
          "Nb_Reviews": 2,
          "Date": "2022-11-27T18:43:54.000Z",
          "Titre": "9 days no photose. Had to retake at different place",
          "Contenu": "I ordered the photos 9 days ago, I payed around $80 for 3 sets of 12 pictures and they did not arrive. Since time was important I had to go to a physical place and retake them. At $80 charge you could have afforded a tracking number of a courier that ensures a 2-3 day delivery."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jasmin Tohidi",
          "Nb_Reviews": 2,
          "Date": "2022-11-18T19:25:44.000Z",
          "Titre": "For one family of four failed to send…",
          "Contenu": "For one family of four failed to send one family member and instead gave duplicate of another family member.  For other you never sent out the photo to my address.  Will never use again.  Wasted my time and clients time."
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "Abdiaziz abdullahi Ali",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T21:55:01.000Z",
          "Titre": "ivisa charged me 49$ for my bolovia…",
          "Contenu": "ivisa charged me 49$ for my bolovia visa and they didn't issue me anything"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "KCi",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T23:38:07.000Z",
          "Titre": "The photo was not updated as per…",
          "Contenu": "The photo was not updated as per Malaysian visa requirements. The background should have been white whereas the photo I received had a blue background. It was useless. Very disappointed with this service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SusanSagarin",
          "Nb_Reviews": 5,
          "Date": "2022-10-05T06:30:55.000Z",
          "Titre": "I’m very disappointed in the product I…",
          "Contenu": "I’m very disappointed in the product I purchased from your app. The claim was: enter the name of country you are visiting and we will ensure that your pictures are the proper size and meet the country’s requirements. Wrong. I ordered photos for a visa to Cameroon and they were too small! I had to delay sending my visa application to the embassy while I rushed to my local Staples and got perfect visa photos for far less than you charged. I will not use your service again."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Clayton Trevor",
          "Nb_Reviews": 4,
          "Date": "2023-01-12T22:19:37.000Z",
          "Titre": "Absolutely the worst photo and…",
          "Contenu": "Absolutely the worst photo and experience I’ve ever had, more importantly the photo was rejected by the government and the customer service, my god, plus no refund?!?! Do not use this service regardless of what that CNN makes you feel!"
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "JERRY GEORGE ABRAHAM",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T17:44:26.000Z",
          "Titre": "I had requested for the blue code to…",
          "Contenu": "I had requested for the blue code to travel into China. I was told everything ok and ita under process. But when time came for the flight,  I had nothing ready from your side and I was denied boarding and was stuck in Korea for couple days before i could get everything sorted on my own."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ARG",
          "Nb_Reviews": 2,
          "Date": "2023-02-19T22:07:35.000Z",
          "Titre": "I was unable to use the photos provided…",
          "Contenu": "I was unable to use the photos provided since they could not be printed in actual 2x2 format."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fabio R.",
          "Nb_Reviews": 2,
          "Date": "2022-10-25T00:27:08.000Z",
          "Titre": "Photos did not meet passport requirements",
          "Contenu": "Photos that I took and submitted for your review did not meet the requirements for an Italian passport. The service was a complete waste of money and I had to run and get other photo taken."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Theresa Ann Masterman",
          "Nb_Reviews": 2,
          "Date": "2022-11-05T23:19:15.000Z",
          "Titre": "You led me to believe that you could…",
          "Contenu": "You led me to believe that you could secure me a visa from India. I was misled yet you charged me for something I do not want. It was at the end of the day when you advised me that you couldn’t help a Canadian citizen get a visa for India!Be an honest company and refund my money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 3,
          "Date": "2023-01-07T02:34:38.000Z",
          "Titre": "My passport photos did not turn out…",
          "Contenu": "My passport photos did not turn out great. They looked over edited and grainy. It could have been the photo I uploaded. I went through another service and was able to get pretty for photos"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sheila",
          "Nb_Reviews": 2,
          "Date": "2022-11-07T03:17:10.000Z",
          "Titre": "Photo was not accepted after you gave…",
          "Contenu": "Photo was not accepted after you gave it a green light good. Waste of money. Instead, I used one my roommate took in our garage and it was accepted by the passport people."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mark Chaskelson",
          "Nb_Reviews": 10,
          "Date": "2023-01-03T18:10:40.000Z",
          "Titre": "Expensive and useless",
          "Contenu": "I paid a small fortune to use their service, it has been 2 weeks and the photos have not yet been posted! Unacceptable!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Irene",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T19:31:32.000Z",
          "Titre": "I was charged twice so emailed to the…",
          "Contenu": "I was charged twice so emailed to the customer service but they never respond and didn’t get refund for that."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kathryn Sheaffer",
          "Nb_Reviews": 2,
          "Date": "2022-11-17T22:07:26.000Z",
          "Titre": "I received my photo back very quickly…",
          "Contenu": "I received my photo back very quickly which was great. However, it did not match up with the template at the post office so I had to pay for a new picture that day."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carol Hill",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T05:26:31.000Z",
          "Titre": "Don’t Use This Service",
          "Contenu": "Too hard to work with!  Never got the correct size photos.  Had to ask for a refund.  Who knows if I’ll get one.  Took my money before I even sent in a “good” photo."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Connie",
          "Nb_Reviews": 5,
          "Date": "2022-11-18T17:58:08.000Z",
          "Titre": "I tried sending a passport photo maybe…",
          "Contenu": "I tried sending a passport photo maybe 20 times!  Had to pay extra for your “expert to get it accepted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ali",
          "Nb_Reviews": 2,
          "Date": "2022-12-26T20:27:49.000Z",
          "Titre": "it is said mailed",
          "Contenu": "You supposed to send my photos with mail and it is said 3-4 days. Ans now over one week and l don’t have my photos. I had so much problem because of this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ahmed Gomaa",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T23:11:14.000Z",
          "Titre": "I received the wrong items for the…",
          "Contenu": "I received the wrong items for the second time, the photo size are not the right size. The egyptian passport photo should be 4.5 cm in height and 3.5 cm in width, the photo you sent is much smaller."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Robert King",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T00:44:50.000Z",
          "Titre": "I have not gotten my photos."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ahmed Eldemerdash",
          "Nb_Reviews": 7,
          "Date": "2023-01-24T03:35:37.000Z",
          "Titre": "Received the wrong photos for another…",
          "Contenu": "Received the wrong photos for another person and yet to receive mine"
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Pooja Passi",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T09:40:14.000Z",
          "Titre": "I wanted a photo for Malaysia visa and…",
          "Contenu": "I wanted a photo for Malaysia visa and the photo was not accepted"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Helen Parkins",
          "Nb_Reviews": 2,
          "Date": "2023-02-17T02:51:36.000Z",
          "Titre": "I am still waiting for my photos to…",
          "Contenu": "I am still waiting for my photos to arrive."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sam Varghese",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T04:05:51.000Z",
          "Titre": "Package delayed beyond 5 business days",
          "Contenu": "Still waiting for the package to arrive. It is beyond 5 business days now."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jjj",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T12:41:14.000Z",
          "Titre": "Garbage service",
          "Contenu": "Garbage service, would chargeback if I could. Photos provided were useless.  Don't use this service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jordan Berger",
          "Nb_Reviews": 3,
          "Date": "2023-03-19T16:29:05.000Z",
          "Titre": "I never received my photos"
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "BETRAND NGU ACHU",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T08:13:27.000Z",
          "Titre": "This the worst service I have ever had…",
          "Contenu": "This the worst service I have ever had in my life. You guys deserve no stars. You you guys are thieves."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elisabeth Campbell",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T03:32:32.000Z",
          "Titre": "It’s been 6 business days and I still…",
          "Contenu": "It’s been 6 business days and I still do not have my passport pictures."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "valerie tavernier",
          "Nb_Reviews": 1,
          "Date": "2022-10-23T21:15:37.000Z",
          "Titre": "Background is bad",
          "Contenu": "Background is bad, the picture is not acceptable. I hope to be refund"
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "MArouane Rmal",
          "Nb_Reviews": 1,
          "Date": "2022-11-19T14:54:56.000Z",
          "Titre": "Paid for nothing because pictures were…",
          "Contenu": "Paid for nothing because pictures were denied on my visa application"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Michael Toop",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T14:05:31.000Z",
          "Titre": "Poor Service Very poor No photos after…",
          "Contenu": "Poor Service Very poor No photos after 15 days and No explanation"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ahmad Samim",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T20:15:58.000Z",
          "Titre": "I have not received my passport…",
          "Contenu": "I have not received my passport pictures yet."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ahmed Eldemerdash",
          "Nb_Reviews": 7,
          "Date": "2022-12-19T15:42:08.000Z",
          "Titre": "Had to order it and pay for it twice…",
          "Contenu": "Had to order it and pay for it twice and still did not get the photos on time ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richelle Devine",
          "Nb_Reviews": 1,
          "Date": "2023-02-25T20:21:20.000Z",
          "Titre": "Wrong size",
          "Contenu": "The passport was too big I had to have it re-done"
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "JP Viviers",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T09:09:09.000Z",
          "Titre": "What was promised was not what I…",
          "Contenu": "What was promised was not what I received. The photo quality did not match was was required."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gaston Nichols",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T05:27:04.000Z",
          "Titre": "Still waiting on my pictures"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amber Roberts",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T22:14:50.000Z",
          "Titre": "Wrong size for passport pic given",
          "Contenu": "Wrong size for passport pic given. They would not give a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hafizur Rahman",
          "Nb_Reviews": 1,
          "Date": "2023-02-05T14:06:46.000Z",
          "Titre": "unprofessional",
          "Contenu": "They are not a responsible agent."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul Beighley",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T01:30:19.000Z",
          "Titre": "Locations on app not available."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "D Su",
          "Nb_Reviews": 5,
          "Date": "2023-01-24T02:12:40.000Z",
          "Titre": "I still have not received my passport…",
          "Contenu": "I still have not received my passport pack,!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shamantha Venkatappa ramadas",
          "Nb_Reviews": 4,
          "Date": "2023-01-06T01:38:44.000Z",
          "Titre": "The photo got rejected at online…",
          "Contenu": "The photo got rejected at online passport service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bruno Dias",
          "Nb_Reviews": 1,
          "Date": "2022-09-04T15:44:22.000Z",
          "Titre": "not reliable",
          "Contenu": "Website promised to deliver the photos in 2 to 4 business days. I needed them in 5 business days so thought it would be ok. Did not receive them within the deadline and there is no way to track the delivery or to know when they will arrive, even if you call customer service. Had to buy the photos again at a physical store."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jenny",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T03:09:34.000Z",
          "Titre": "not good",
          "Contenu": "get expensive every time...."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nishant Dixit",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T00:06:00.000Z",
          "Titre": "I paid for 12 photos and got 2",
          "Contenu": "I paid for 12 photos, but only 2 were printed. There seems to have been an error when this was given to the third party print company because I was charged $16.45 which is the price for 12 photos. I elected to have them picked up at Walgreens and received just 2 photos on a 4x6 print and nothing else."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "bohdan starygin",
          "Nb_Reviews": 4,
          "Date": "2022-10-01T04:13:34.000Z",
          "Titre": "Haven’t received my photo after 5…",
          "Contenu": "Haven’t received my photo after 5 working days"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alicia",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T19:06:44.000Z",
          "Titre": "Passport photos never got to my house",
          "Contenu": "I ordered some passport photos. 2 weeks after my order, I had not received them (when you order they say they'll get to you in 4 days). I talked to somebody and had my order re-processed. Again, they never got to me. In the end, I requested to have them printed at Walgreens and luckily I could do that at no extra charge, so at least the customer service help wasn't terrible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Asia Bailey",
          "Nb_Reviews": 3,
          "Date": "2022-07-22T16:11:49.000Z",
          "Titre": "There’s supposed to be a 2-4 business…",
          "Contenu": "There’s supposed to be a 2-4 business day guarantee delivery and it’s been 6 days without any updates or delivery. I ordered photos once already from a different site and they never came, so I ordered from here because I heard good things about their service but my passport photos STILL haven’t come! What’s going on??? If someone doesn’t deliver on their “guaranteed” services, I’m not going to get my passport in time and that irritates me a lot."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ronald Lee Roberts",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T17:25:55.000Z",
          "Titre": "When I went to upload the photo",
          "Contenu": "When I went to upload the photo, the visa sites said that the file size exceeded the limit so was not able to use the photo.I ended up just taking my own personal photo and using that."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rebecca",
          "Nb_Reviews": 1,
          "Date": "2022-07-12T05:31:39.000Z",
          "Titre": "Careful!",
          "Contenu": "The website was unclear--we assumed we were purchasing photos for a US passport because we checked that box. However, because the website also asked us where we were traveling (Guatemala) while we thought we purchased 7 photos for a US passport we actually purchased 7 visa photos. All of our photos were rejected when we applied and iVisa refused to refund us."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alyssa Mathis",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T17:37:32.000Z",
          "Titre": "I’m definitely a bit frustrated",
          "Contenu": "I’m definitely a bit frustrated.  I spent the money to even have it reviewed and the passport office told me that I had a shadow over my eye and it looked like it had been photoshopped and would not accept it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GERRY Z",
          "Nb_Reviews": 3,
          "Date": "2022-07-12T16:52:17.000Z",
          "Titre": "This service is nonsense.",
          "Contenu": "This service is nonsense. Never got a confirming email, photos never arrived at Walgreens. Then, when I made other arrangements (for a fraction of the cost), iVisa refused to give me a full refund and only issued 90%. DO not use this service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sandy Shwe",
          "Nb_Reviews": 6,
          "Date": "2022-06-22T20:41:34.000Z",
          "Titre": "So so bad!!! wrong size printing!!",
          "Contenu": "So so bad!!!I paid $10 and I want my money back!!Even though I selected 2x2 passport pictures, when I collected it wasn't even 2x2! I had to redo everything at the store. I thought this was a convenient way!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Erin Straub",
          "Nb_Reviews": 1,
          "Date": "2022-08-06T01:47:32.000Z",
          "Titre": "I was sent pictures that are too small…",
          "Contenu": "I was sent pictures that are too small for passport requirements. I have requested replacements of the correct size with no response. Will be pursuing a refund at this point."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alex Vincze",
          "Nb_Reviews": 2,
          "Date": "2022-12-11T04:01:21.000Z",
          "Titre": "Never actually received the photos I…",
          "Contenu": "Never actually received the photos I ordered."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Varun kumar Kommanaboyna",
          "Nb_Reviews": 1,
          "Date": "2022-07-11T21:18:01.000Z",
          "Titre": "I dont know whete the pictures are and…",
          "Contenu": "I dont know whete the pictures are and the edited picture looks like garbage , it cant be even used who highlights the natural color of the person to white light , utter disrespect"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Karen English",
          "Nb_Reviews": 22,
          "Date": "2022-08-22T11:54:45.000Z",
          "Titre": "not a good experience after four tries…",
          "Contenu": "not a good experience after four tries i had to go to a photo booth and pay another 9 pound to get z photo ghat actually passed wouldnt reccomend"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jon Spanka",
          "Nb_Reviews": 1,
          "Date": "2022-07-12T22:00:44.000Z",
          "Titre": "Did not receive photo in 4 hours as stated it took 22 hours",
          "Contenu": "Because after I send the photo it said I will receive an email within 4 hours after I emailed you the next day got an email saying I sent you an email with a attachment I sent it back and said no attachment then when I finally got got my photo after 22 hours I stated that I had a passport appointment at 2:30pm and when I tried to send it to walgreen it was going to take an hour. Not enough time. So I understand up paying $15 for the photo. I sent several emails back and forth and kept getting the same response we sent you the email I told them to read the email from the start. I was told by 1 person I would receive 90% back I said ok. I kept getting emails offering 20% off for my passport application. The last email said the would send it to CVS for me the day after my appointment. Like I said read the email from the start."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nilotpal Shyam",
          "Nb_Reviews": 4,
          "Date": "2022-07-18T01:43:48.000Z",
          "Titre": "incorrect size",
          "Contenu": "Two photos were provided stating that the photos are configured for 4*6 print. When I took the print the photos came out to be 54*54 and not 51*51 or 2\"*2\"."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "FA",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T00:01:01.000Z",
          "Titre": "I paid extra for the picture to be…",
          "Contenu": "I paid extra for the picture to be revised by an expert but I honestly don't a difference. It's not worth the price. The one I did myself looks even better."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Adr",
          "Nb_Reviews": 1,
          "Date": "2022-06-26T07:52:02.000Z",
          "Titre": "Cheated",
          "Contenu": "Cheated ! They charge for 2x2 individual pic which costs $9.99 but ordered a 4x6 printout which only costs 0.39.Could have done that myself if u wanted to print out 4x6"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Saravanabalaji Shanmugam",
          "Nb_Reviews": 1,
          "Date": "2020-08-04T00:04:26.000Z",
          "Titre": "Very worst experience and will never…",
          "Contenu": "Very worst experience and will never recommend this site to anyone. Poor customer care and never get a reply after you place the order for next day pickup. First, they mess it with pick-up location, and later when provided alternate location never responded to any email for 2 days. No other way to contact them other than email. Never ever try this site if you are in need of your photos for any urgency."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hemayat Azizi",
          "Nb_Reviews": 2,
          "Date": "2020-07-04T07:45:24.000Z",
          "Titre": "a ONE star rating!",
          "Contenu": "Indeed, I double ordered my passport photos because I haven't received my ordered photos on time, so I just ordered it again through Walmart photos that I just received it on time. The ordered photos through your website is a waste of money and I just dropped it away. Unfortunately, your service is too slow and unreliable based on the urgency that a client might have."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alicia Torres",
          "Nb_Reviews": 1,
          "Date": "2020-10-05T23:00:11.000Z",
          "Titre": "Everything went well while we took and…",
          "Contenu": "Everything went well while we took and uploaded the pictures; however, my local CVS never received the pictures or file to print. I was not able to reach anyone to speak to regarding this nd my emails have not been answered. (Their email said to “chat with them on their website” , but there is no such option.) Very disappointing...."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Out of Stock!",
          "Nb_Reviews": 4,
          "Date": "2020-04-30T00:19:51.000Z",
          "Titre": "The customer service is horrible,  My passport photos is a scam.",
          "Contenu": "The customer service is horrible. The photo tips from the site say RX glasses are ok 4/28/2020. The company emailed me  4/29/2020  for another photo without glasses, I took the photo sent it the same day as the request. Today, I called the Walgreens I selected my order to be sent to for pick up,and was told no order was received and they have never heard of this company.  My passport photos is a scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lilia Carasciuc",
          "Nb_Reviews": 1,
          "Date": "2020-05-13T13:10:21.000Z",
          "Titre": "Slow and dishonest service",
          "Contenu": "My passport photos arrived two weeks after I ordered them, at three times the cost of printing them at CVS. All photos were on one sheet of paper, so they were not cut to be passport size. When I complained that the photos weren't coming soon enough, this company gave me the option to go print them at CVS myself, event after I paid them to do this work. Unprofessional."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "D “DMR” Rogers",
          "Nb_Reviews": 1,
          "Date": "2020-08-12T13:34:29.000Z",
          "Titre": "Very disapointed",
          "Contenu": "I expected to receive two passport photos that I could simply take out of the envelope attach to my passport application. No!  Instead I received two pictures on a piece of photo paper that were uncropped.  I had to carefully cut the photos from the paper.  Had I know this I would have simply gone to my local photo store that provides photos ready for use. Delivery was very slow and  they never responded to my complaints when made  via email. Very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dario",
          "Nb_Reviews": 3,
          "Date": "2020-05-17T01:09:26.000Z",
          "Titre": "Service was quick but they 1) adjust my…",
          "Contenu": "Service was quick but they 1) adjust my pictures colors and brightness without me asking. This was noticeable on the JPEG they sent me that was eventually sent to print 2) cropped in pictures algorithmically rendering them incorrect and unacceptable. On top of that, the store printed them even worse. Had to re-do them. Will ask for a full refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2020-01-08T17:56:36.000Z",
          "Titre": "Never received my passport pictures",
          "Contenu": "Never received my passport pictures.  USPS and UPS were unable to help me as the vendor does not provide a tracking number (red flag).  I emailed the vendor twice, but they will not respond much less issue a refund.  I strongly recommend that everyone avoid this company and just have your pictures printed at your local Target, CVS, et cetera.  The frustration is not worth saving $5.  Awful experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2020-04-23T17:42:23.000Z",
          "Titre": "Do NOT use this service",
          "Contenu": "Do NOT use this service. This is a scam. They will never send you the photos after paying for it. I tried to communicate with them via five emails across two weeks, and they keep saying that I need to provide more information, which ended up with a never-ending and meaningless loop. I totally wasted my time and money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Howard Ross",
          "Nb_Reviews": 1,
          "Date": "2020-10-07T19:51:17.000Z",
          "Titre": "Was asked to submit another photo…",
          "Contenu": "Was asked to submit another photo without smiling. Attempted to logon and was not able to do so. Sent multiple emails with new photo and never got reply. They sent finished product with old photo. Trying to do this again with new photo. Very frustrating to have to pay twice for this service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "G H",
          "Nb_Reviews": 1,
          "Date": "2019-03-29T11:50:34.000Z",
          "Titre": "Never received my mailed photos.",
          "Contenu": "Never received my mailed photos.Then requested that they be sent to Walgreens.What I received at walgreens was two snapshots on one photo paper.  These passport photos must be cut to size when turned in and depending on the nationality of the passport that size and be different.  I will now have to cut them myself and hope I get it correct.  The advertisement left me to believe that I would receive photo's ready to go.  Not the case."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2018-12-30T03:41:52.000Z",
          "Titre": "Bad service, and removed my review",
          "Contenu": "Took over a week to arrive - several days to ship. Not speedy at all.  Photo not cut to correct size.  Then - by e-mail to my spam folder - got a notice that my review was removed because they didn't think it was legitimate.  It certainly was - you have to ask yourself what their average score would be if they weren't removing the negative reviews."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "VR",
          "Nb_Reviews": 1,
          "Date": "2019-11-20T18:35:19.000Z",
          "Titre": "Customer Service 👎",
          "Contenu": "I provided my picture and uploaded it for online order (2) 2x2 photos. When ordered sent a phto copy of application, for actual dimentions / size for photo. When I  picked up order at CVS, the size was incorrect. The photo does not fit the required size 2x2 format on application. I followed up with email to both My Passport and Kodak Photo explaining issue. I requested order be corrected or refunded. No company response and no number to call. 1st time and last ordering. Not a good experience !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Yiyi Ma",
          "Nb_Reviews": 1,
          "Date": "2020-05-12T14:14:50.000Z",
          "Titre": "17 DAYS STILL NO PHOTOS. AVOID!!!!",
          "Contenu": "I ordered my photos on April 25th, today is May 12th, and I still don’t have my photos ! Even though the website’s estimate was “5-7 days” due to COVID.  Like all terribly run businesses, customer service was not helpful at all and of course they continue to blame everything on covid. AVOID !!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CHARLES D",
          "Nb_Reviews": 5,
          "Date": "2020-09-26T16:55:20.000Z",
          "Titre": "Complete rip-off",
          "Contenu": "Complete rip-off. Paid extra to have an “expert” evaluate the photo and make sure photo was “passport ready.”  Went down to the passport office at the post office and to my surprise was told photo was too large! All that waiting - for nothing. So irritated! $12.00 down the drain..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carlota",
          "Nb_Reviews": 1,
          "Date": "2020-07-07T19:44:59.000Z",
          "Titre": "I still havent received my pictures",
          "Contenu": "I still havent received my pictures. There is no contact number and they havent answered as to where my pictures are. I paid a lot of money to have these pictures delivered professionally, otherwise I would have done it myself. This is super ridiculous, if you think that people actually take this service because they are under timeframes on legal procedures that require timely document delivery. My deadline for that is actually today. I have insisted on contacting them, but there's not really an intent to fix the issue on their part"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Xiaoya Huang",
          "Nb_Reviews": 1,
          "Date": "2020-04-27T14:30:59.000Z",
          "Titre": "This is the worst business ever",
          "Contenu": "This is the worst business ever. If you do want to receive photos, don't order from them. I've been waiting for my photos for more than half month now, and still don't know when I'll receive it.  I contacted them, however, after one reply saying just wait, they never respond again. I used another way to get photos, and I'm asking them to refund the order that I never received. But they just don't reply. I'm extremely frustrated now, I wish I didn't use them as all. That will save some sanity."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Denise",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T22:53:21.000Z",
          "Titre": "Only one of 2 was correct size",
          "Contenu": "I had 2 pictures made and appreciated that they let me know one had to be at a different angle, however the size printed and sent with the application to renew Passports, only one was the correct size.  When paying this much I expect success."
        },
        {
          "Note": 2,
          "Lieu": "HK",
          "Pseudo": "Sonu",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T05:35:41.000Z",
          "Titre": "1) The photos specs are very picky",
          "Contenu": "1) The photos specs are very picky - esp as it will be issued on a separate eVisaIf after submission pic unclear can always ask for another photo or an interview to verify identify 2) allow to upload multiple pages for eTix n accommodation proof - right now only one page allowed n have to snip n paste onto one page n then upload (only on pdf) - again super painful process I was very disappointed - it took me few hours to submit - it was easier to come to the consulate n submit docs"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Maria",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T18:30:36.000Z",
          "Titre": "Unreliable for delivery",
          "Contenu": "The uploading and reviewing of the photos was easy but paid for them to be delivered to my house and after a week, they haven't arrived. They don't provide a tracking number and the secondary option is to re-send them or pick them up at a store, which have extra fees."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "efaf mansouri",
          "Nb_Reviews": 2,
          "Date": "2023-01-27T17:39:22.000Z",
          "Titre": "Very Expensive!",
          "Contenu": "Very expensive for being just the middle-man website.  You'll end up paying for the CVS papers separately (Less than $1), but the website charged me $30 just to send 2 photos to CVS to print. The photos that \"I\" took, \"I\" cropped to fit the size and basically did all the work. And then on top of all, I had to go pick them up myself and deal with CVS not finding them and all too. So, really they're charging for nothing! Eventually got the job done, but I won't use them again or recommend anyone using them"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brynn",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T14:57:36.000Z",
          "Titre": "No tracking link & slow shipping",
          "Contenu": "No tracking link. Took well beyond the 2-4 days and still hasn't even come yet. Had needed them last week. The preview photo looked a bit blurry and was edited to be more bright to the point that my eyes look extremely bright blue. At least customer service is quick to answer, but didn't even let me have the option of adding on one more photo--had to be two."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kristine Stone",
          "Nb_Reviews": 1,
          "Date": "2022-10-29T04:42:32.000Z",
          "Titre": "Photos came and are WAY TOO large for…",
          "Contenu": "Photos came and are WAY TOO large for Singapore visa requirements. I can't use them. They came in a timely fashion, though. I appreciate getting electronic copies also. But, won't be purchasing from them again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ying Liu",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T05:35:28.000Z",
          "Titre": "shipping takes longer than claimed",
          "Contenu": "shipping takes longer than claimed,  which delayed my visa application"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Abdulkarem Alsamiri",
          "Nb_Reviews": 2,
          "Date": "2023-04-06T10:40:36.000Z",
          "Titre": "Still waiting for my pictures"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "dwayne patterson",
          "Nb_Reviews": 1,
          "Date": "2022-07-18T15:20:50.000Z",
          "Titre": "not what we expected",
          "Contenu": "not what we expected!  honestly we are not sure where the fault lies, but the photos we received appeared to look cartoonish.  maybe it was the printer at the local drugstore.  Although we requested the certified review option offered by IVisa for our passport pictures they were not acceptable by the local government agency :("
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Monique Pelletier",
          "Nb_Reviews": 4,
          "Date": "2022-07-13T02:22:24.000Z",
          "Titre": "The requirements for a Canadian…",
          "Contenu": "The requirements for a Canadian passport photo require the photographer to document the photo. This was not done and ivisa.com requested that i do the documentation for them on the back of the photo. Also, though the photo met Canadian passport requirements, it was not precise and probably wont meet the requirements"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lost patience",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T17:07:27.000Z",
          "Titre": "Digital photo was great, BUT.....",
          "Contenu": "Digital photo was great, but after 11 days from supposed shipping of the printed photos via first class mail, they have still not been received...so much for timeliness."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MamaD",
          "Nb_Reviews": 5,
          "Date": "2022-09-22T10:48:17.000Z",
          "Titre": "Wrong picture was sent",
          "Contenu": "Wrong picture was sent. I had to upload several and the last one I uploaded was approved but it was not the one you approved."
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "Guillermo Velasco Sicilia",
          "Nb_Reviews": 1,
          "Date": "2020-05-07T15:34:00.000Z",
          "Titre": "Horrible service",
          "Contenu": "I bought my photos in the middle of the pandemic, so I knew the post service would take long. But it took them more than 2 weeks to print and ship them! Obviously, the total time, with delivery, was almost 5 weeks. And when the photos finally arrived, they didn't cut them! It was one big photo paper with both photos printed just by each other (which makes it really hard to cut them, obviously). Horrible service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel Redford",
          "Nb_Reviews": 1,
          "Date": "2018-03-13T01:09:18.000Z",
          "Titre": "Still have not received the passport…",
          "Contenu": "Still have not received the passport photo.  After a day got an email that Rite Aid was no longer accepting applications.   I had to do the research to find another drug store.  When I called with the information I was told I would receive an email with instructions on how to pick them up and that the photo would be at the drug store within an hour.  That was 8 hours ago. Still have not heard back."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Terry",
          "Nb_Reviews": 1,
          "Date": "2020-04-08T19:06:54.000Z",
          "Titre": "I was nickle and dimed to get a proper…",
          "Contenu": "I was nickle and dimed to get a proper passport photo. First was the cost of the photos. No problem. Then and cost to have it reviewed and edited if needed.  Who would not want this to be done right the first time? Then a cost for delivery, this is what I think was deceptive. No one would order photos if they did not want them delivered (it is an online service). This additional cost to be delivered should have been rolled up into the initial cost. Then, when I had it delivered to Walgreens, I was charged again although small."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "K G",
          "Nb_Reviews": 1,
          "Date": "2019-03-29T19:31:41.000Z",
          "Titre": "I just returned from CVS",
          "Contenu": "I just returned from the CVS where I was supposed to pick up my photos. There was nothing there in my name or in the name of the company. I’ve asked to have my money refunded. False advertising.Update:  I emailed the company and immediately Hanan refunded me.  A shame--I really wanted those photos for my passport."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MamaG",
          "Nb_Reviews": 1,
          "Date": "2016-05-07T16:00:23.000Z",
          "Titre": "Lack of Communication",
          "Contenu": "I received an email that my picture may not be acceptable and I tried to communicate that I didn't want it then. We had an appointment at the passport office within 48 hours. I sent multiple messages on the \"chat\" but no one ever responded. I was charged for pictures that I will never use, and that I had to have redone at the passport office. Overall displeased."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gabriela Miyakawa",
          "Nb_Reviews": 3,
          "Date": "2020-06-12T22:14:24.000Z",
          "Titre": "Very expansive for what its worth",
          "Contenu": "Very expansive for what its worth. Thought it was a bit expansive but worth it at first because of the hassle of taking the photos on the spot... It was not clear before I finished my order that I would have to pay an extra when I'd pick it up on the store. You don't have a clear and easy channel to refund and although is less then 2 dollars, when you add up $4 + $4 + $4 + $2, its a lot of money and not that much of a convenience... Even when delivered at home, 7 days its just too much time...  won't be using my passport photos the next time"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lise",
          "Nb_Reviews": 2,
          "Date": "2017-09-27T11:20:58.000Z",
          "Titre": "The photos I received are unusable as …",
          "Contenu": "The photos I received are unusable as passport photos. I'm sure there was user error involved, but I used the app by taking a photo of myself head on in front of a white wall, selected the US passport option, and even took the step of paying for the professional editing to make sure what I received was usable. What was sent to me was laughably unusable. I then drove to the nearest Walgreens and paid another $15 for the same service. Now I'm out $30. Oh well, at least it's done!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "J P (sticks)",
          "Nb_Reviews": 1,
          "Date": "2019-11-05T12:56:34.000Z",
          "Titre": "What am I saving with this service??",
          "Contenu": "$6 for two pics + $4 expert review to make sure it passes + $3 shipping to CVS to pick it up saves you $0.00. (zero point zero)CVS is also $13 with coupon and since I am going there anyway, why risk having photos that may not pass as some other reviewers have noted."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Phyllis deQuevedo",
          "Nb_Reviews": 1,
          "Date": "2015-04-16T21:54:36.000Z",
          "Titre": "The photos were unacceptable to the Canada Passport office.",
          "Contenu": "The people I was in contact with at the site were communicative, even helpful. Bottom line Canada Passport will not accept on-line photos even if they are printed by Walgreens or CVX and I have been unable to find a service that can shoot and print them the correct size which is different than a US passport."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Scott",
          "Nb_Reviews": 3,
          "Date": "2016-01-21T00:46:38.000Z",
          "Titre": "Online fine....collection disaster",
          "Contenu": "Service was fine until I went to my nominated cvs to collect 24 hrs after receiving an email notifying me that they were ready to collect.....the pictures weren't ready, they hadn't heard of the service, didn't know what to do....took over 30 mins to get the pictures"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marlene Rodgers",
          "Nb_Reviews": 3,
          "Date": "2015-01-29T20:56:52.000Z",
          "Titre": "so far, not so great",
          "Contenu": "I found no place to indicate a choice of pick-up places when placing my order. I then get an email after placing the order to choose a convenient pick up location yet no link to do so and I find nothing on the website. Language is also unclear about time it takes."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Aki Ueno",
          "Nb_Reviews": 1,
          "Date": "2016-10-19T03:02:19.000Z",
          "Titre": "Print quality at Walgreens and cvs are bad.",
          "Contenu": "Customer service is great. I don't think the partnership for print out at local pharmacy should be re-considered. Print quality is just so bad and varies by location that I don't want to use that photo for a passport which stays 5-10 years with you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Vincent van Haften",
          "Nb_Reviews": 1,
          "Date": "2017-05-21T14:47:15.000Z",
          "Titre": "Good quality but",
          "Contenu": "The quality of the photos was good, the process was easy and online help is available. The support person informed me the photos would be cut in the required size which wasn't true nor could the pick up location trim the photos so they are useless."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Younji Nam",
          "Nb_Reviews": 1,
          "Date": "2016-04-02T21:54:24.000Z",
          "Titre": "I think they didn't check photo before they send.",
          "Contenu": "I order for my son's passport photo\rIt was easy to take picture at home \rAnd older but..\rI open it up today get by mail.\rI ordered two pictures one of picture on\rhis eye's look like got smokey make up on. I can't use this photo wast money."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Seraphim",
          "Nb_Reviews": 1,
          "Date": "2018-07-08T04:58:13.000Z",
          "Titre": "Poor customer service",
          "Contenu": "Paid extra for Expert Photo Edit, but the photo ordered didn’t satisfy the VISA requirements. Contacted customer service and they sent a replacement, the second one picked up was better than the first one, but not perfect. Paid extra in store for printing, but only got partial refund for that cost. Didn’t receive any email or phone call to address my concern as they promised in the last email I received. Tried online chat several times, took forever to get a response. Better go to Walgreens or CVs if there’s one in town, they do different sizes of passport photos, I found out while waiting for the photos this website sent, and glad I brought additional photos I took instore to the interview.Update: was issued refund after I posted the review."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "L. Dwyer",
          "Nb_Reviews": 1,
          "Date": "2015-04-23T17:09:24.000Z",
          "Titre": "Excited at first...",
          "Contenu": "I was pleased with how easy the system was to use. However, when it came time to pick up my prints, it was a mess. First, my pictures were not sent to the place I requested. When I went 20 minutes out of my way to the place the email told me to go, I was informed by the manager that they do not have a photo shop and they have no idea how mypassport confirmed that the pictures were sent to their store. I then requested they be sent to the place I originally requested, but was told that the pictures would instead be sent to a place even further away than the place I had already driven 20 minutes out of my way to!  After all that, I told them to email me the pictures and I would go print them myself (and pay for it). I was REALLY hoping this would work out."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brenda Surber",
          "Nb_Reviews": 1,
          "Date": "2015-04-03T23:02:39.000Z",
          "Titre": "Not up to my expectations",
          "Contenu": "Although the process was very simple. The quality of the editing and photo is not acceptable for a passport.I feel that it was a waste of money and will probably not use this service again."
        },
        {
          "Note": 2,
          "Lieu": "HR",
          "Pseudo": "Anna",
          "Nb_Reviews": 2,
          "Date": "2020-08-13T03:19:02.000Z",
          "Titre": "be aware, you will have to pay an extra at pick up!",
          "Contenu": "Basically they set up the picture to be printed at your local CVS or Walgreens and then to pick them up you still have to PAY AN EXTRA......Very disappointed!!!!!!!!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Beige",
          "Nb_Reviews": 7,
          "Date": "2022-07-16T22:02:28.000Z",
          "Titre": "need improvement",
          "Contenu": "the shipping was standard. but the quality and size was not ideal and I wanted the pictures to be cut."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2019-08-21T15:09:26.000Z",
          "Titre": "Poor customer support.",
          "Contenu": "I ordered passport photos from mypassportphotos.com and they were never delivered, although my order was marked as complete (delivered).There is no support: emails reference contacting them via chat, but there is no chat functionality on their website.  With some digging, you can find the company is related to ivisa.com, but calling their support # leaves you on hold indefinitely.  Their chat support agent told me my order # was invalid and then ignored me for minutes at  a time.  It was clearly a robot.-- Updated to 2 star: Aug 21I received a customer support contact after leaving a 1-star review. The company offered to send the photos digitally to a Walgreens or CVS of my choice and pick up the prints there. I accepted this offer to at least get something from my order, although it defeated the purpose of using an online passport photo company at all - which was to avoid having to drive around town to get photos.The photos received were properly sized and cropped."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CK",
          "Nb_Reviews": 1,
          "Date": "2019-10-04T19:15:49.000Z",
          "Titre": "passport phots",
          "Contenu": "It seemed really easy and decent price, but I still had to pay when I picked up the photos. Not great. Why are they so expensive anyway??"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tracie",
          "Nb_Reviews": 2,
          "Date": "2019-04-03T20:27:35.000Z",
          "Titre": "Disappointed",
          "Contenu": "I was sent a email that you needed another photo, I tried to send a new photo and I could not figure out how to send it for free."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Karla",
          "Nb_Reviews": 1,
          "Date": "2017-01-05T17:22:37.000Z",
          "Titre": "Awful costumer service",
          "Contenu": "My credit card was charged and didn't get an email from them  also I can't find my order on their website. And to top it off. I tried talking to a chat person \"costumer service\" which I really think it's not a real person maybe a machine or a really lazy woman (Angela?) and I wasted 15 minutes waiting for a reply and never got one. I'm very frustrated!Update The above review is for a second order I placed on January 3. The second order was sent to cvs. I had to reorder my prints because they were really, really, dark the first time. My son's face looks practically orange. Despite the fact that PassportPhoto don't even have records of me reordering (this time at cvs, not Walgreens) I called cvs and was able to get help from them.Thanks for trying to prove me wrong, but yes I received all those emails the first time I ordered. But the second time. I didn't get anything. Also I did not ordered directly from cvs. I have prove that on Jan 4 my credit card was charged $8.98 by PassportPhoto, not by cvs."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John J. DiGilio",
          "Nb_Reviews": 2,
          "Date": "2016-02-08T19:34:31.000Z",
          "Titre": "Not a good experience!",
          "Contenu": "Saw some really good reviews of this service, so I thought I would try it. The app is buggy.  Uploading the pic went fine and so did entering my info. When I tried to pay via Paypal, the whole thing crashed - twice.  Each time I had to re-uplaod and re-add my info.  I finally just gave in and used my credit card directly.  The next morning, I got an e-mail saying that the CVS I chose for delivery was not available and asking me to send a different pick-up location.  I did.  Hours later, there was no update.  I went online and my order still showed more info was needed.  So I e-mailed again.  No response.  I went to the online chat that they recommended in the original e-mail and no one ever responded there either!  I finally found their number and called directly.  The gentleman was helpful, but their connection was terrible and it was hard to hear.  He seemed to be flustered just trying to find my info!  He told me he would pass on the message and I would hear from them.  So now I wait . . .   Not nearly as easy or convenient as I was led to believe."
        },
        {
          "Note": 2,
          "Lieu": "PK",
          "Pseudo": "Anbia Anbia",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T17:55:54.000Z",
          "Titre": "not good Bsc you are too late"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Zhihao Wu",
          "Nb_Reviews": 1,
          "Date": "2022-07-31T05:43:31.000Z",
          "Titre": "I haven't got my photos",
          "Contenu": "I haven't got my photos via USPS, which is strange."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott Diamond",
          "Nb_Reviews": 4,
          "Date": "2019-07-19T15:50:47.000Z",
          "Titre": "Wrong size",
          "Contenu": "I ordered square 2\"x2\" passport photos and I received rectangular photos."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Samuel Carroll",
          "Nb_Reviews": 2,
          "Date": "2017-05-17T03:28:53.000Z",
          "Titre": "So far one of my passport photos has …",
          "Contenu": "So far one of my passport photos has been turned down.  Lots of money for nothing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "miguel perez",
          "Nb_Reviews": 1,
          "Date": "2020-05-21T22:17:30.000Z",
          "Titre": "My photos were stained",
          "Contenu": "My photos were stained. Not happy with that."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Dhanwant Singh",
          "Nb_Reviews": 1,
          "Date": "2018-08-18T08:07:41.000Z",
          "Titre": "Goog",
          "Contenu": "I am happy,your performance is too good."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "kirk sauerwein",
          "Nb_Reviews": 1,
          "Date": "2015-11-11T17:01:21.000Z",
          "Titre": "have not recieved my photos yet"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Hisao Ito",
          "Nb_Reviews": 1,
          "Date": "2017-03-29T22:39:46.000Z",
          "Titre": "There was no cut pictures."
        },
        {
          "Note": 3,
          "Lieu": "IE",
          "Pseudo": "Annoyed",
          "Nb_Reviews": 2,
          "Date": "2023-04-06T13:11:24.000Z",
          "Titre": "2 visa photos done for my wife and myself…",
          "Contenu": "2 visa photos done for my wife and myself. one photo was able to be uploaded straight away but the other took ivisa 4 or 5 attempts over several days before they sent me a jpeg that could be uploaded. Ivisa knew the max file size but repeatedly sent file sizes that were too large before they finally got it right.So 1 good experience and one not so good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rich Colfer",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T07:16:35.000Z",
          "Titre": "Difficult getting the photo image lined…",
          "Contenu": "Difficult getting the photo image lined up correctly on your AppOtherwise, very easy to use and communication with staff was awesomeI’ll let you know my final thoughts when/if my passport photo is approved by the government"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karen Costley",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T15:41:37.000Z",
          "Titre": "A bit confusing pricing structure and…",
          "Contenu": "A bit confusing pricing structure and extremely expensive to print at CVS after. Good service if you have time to wait for the mail at reduced cost. I can’t recommend the digital service if you plan to print out at one of the big box stores as they charge normal passport costs per print, when you can just do them there for one lower cost."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Dimitrios",
          "Nb_Reviews": 6,
          "Date": "2023-02-07T08:16:54.000Z",
          "Titre": "Communication from support was very…",
          "Contenu": "Communication from support was very average to say the least. The photos were good at the end."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "PRADEEPKUMAR PRAVINCHANDRA SHA",
          "Nb_Reviews": 1,
          "Date": "2022-10-01T09:38:20.000Z",
          "Titre": "Rubbish",
          "Contenu": "Rubbish ttok money £26 no refund without using your service"
        },
        {
          "Note": 3,
          "Lieu": "HK",
          "Pseudo": "VISITACION GUZMAN BATAD",
          "Nb_Reviews": 2,
          "Date": "2022-12-15T17:23:03.000Z",
          "Titre": "I'm very thankful for this site \"Ivisa\" they have a great service 😉",
          "Contenu": "Ivisa they are great and fantastic service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LUIS CHANONA",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T23:46:43.000Z",
          "Titre": "I spent 6 days waiting the photos."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patricia Taylor",
          "Nb_Reviews": 1,
          "Date": "2020-07-11T23:58:29.000Z",
          "Titre": "Could’ve been worse...or better",
          "Contenu": "Didn’t print all the pics I ordered and paid for, but I made do. I ordered two prints of  two different pictures as options for our passports. We got four prints but only of one pose of each of us. 😕. I did not contact you as it was too much trouble to ask for the correct prints or a refund. As I said...I made do with what I got. Pics were good quality and quick."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lashundra Facyson",
          "Nb_Reviews": 1,
          "Date": "2020-08-21T18:03:41.000Z",
          "Titre": "Better off just going to the store itself",
          "Contenu": "I thought with the price I paid, everything would've been covered. To pay one price and still have to pay a printing fee in store didn't make sense to me. I could've just went to Walgreens and paid $14.99 for 2 passport pictures and recieved them within an hour instead of paying over $10 + store printing just for 1 picture...Just my opinion"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Annie",
          "Nb_Reviews": 7,
          "Date": "2020-01-20T07:45:14.000Z",
          "Titre": "Just fine but there are better programs",
          "Contenu": "I tried it once and, as I've said in the title, the service was just fine but I prefer making my ID photos with the help of another passport photo program called Passport Photo Maker. It is easier and I do my photos in about 10 minutes. The printing costs about $9-10 in our local print store so it is not the point. PPM is just kinda faster for me but you also did a good job, thanks!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sally",
          "Nb_Reviews": 2,
          "Date": "2022-08-19T08:56:48.000Z",
          "Titre": "Service is good for finalizing the…",
          "Contenu": "Service is good for finalizing the photo to the country specifications, but really clunky if you want it sent nearby for printing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lynn C",
          "Nb_Reviews": 1,
          "Date": "2020-06-02T11:40:24.000Z",
          "Titre": "Seemed straightforward enough",
          "Contenu": "Seemed straightforward enough.  Liked that i can upload my own pic.  Wish the original $6.98 i paid for one picture to be printed actually included the cost of the picture. Figured this was included.  No,  it's an additional charge,  albeit a small one,  at the drugstore, to be able to get this. Would have shopped elsewhere."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pierre Benjamin",
          "Nb_Reviews": 1,
          "Date": "2020-07-05T03:31:40.000Z",
          "Titre": "Not totally satisfied with this service",
          "Contenu": "It's a good service and I was able to get my passport pictures quickly. The one thing that turned me off and the reason why I would not recommend this service to others is the cost. They charged you for the service and did not tell you that wherever you pick up your photos they will charge you also until after you place your order. So you are double charged when you can simply go to CVS or somewhere they take passport photos. Overall it's cheaper to get everything done in the store"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jessica Gourlay",
          "Nb_Reviews": 1,
          "Date": "2019-07-16T20:42:13.000Z",
          "Titre": "My photo was not approved",
          "Contenu": "My photo was not approved!!! I went though the entire process and got to my appointment, only to have the photo declined as my teeth were visible. The only reason I have updated my review from 1 to 3 stars is that I was refunded promptly and offered free photos, however I do not have time for this and just paid for photos to be taken at the post office at the time of my passport appointment."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ted Liu",
          "Nb_Reviews": 1,
          "Date": "2020-01-21T22:36:43.000Z",
          "Titre": "Size different than ordered.",
          "Contenu": "First time using this service.  I ordered 12 photos and specified 2\" x 2\".  The photos arrived 11 days after ordering (way too long, imo) and were 1-3/8\" x 1-3/4\". Not at all what was promised.  Unusable as passport or visa photos.Update: MPP addressed the issue by sending me 12 photos in the correct size and refunding me the entire purchase to compensate.  So I changed my initial 1-star review to 3 stars for the excellent customer service and follow-up."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Barbara M",
          "Nb_Reviews": 1,
          "Date": "2020-07-02T17:03:50.000Z",
          "Titre": "I think the service is great---BUT",
          "Contenu": "I think the service is great. The delivery, no so much.They were lacking transparency at the time of the order, which complicated everything. They should disclose everything up front about how long it will take.Also, giving the restrictions of COVID etc , they should go the extra mile for customers, instead of making excuses. Your company should ask their affiliates which CVS WalgreenS  RiteAid etc have DRIVE THRUs for your customers' safety. One extra thing -- upfront about timing--- and then you're over 100%"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas Archdeacon",
          "Nb_Reviews": 2,
          "Date": "2018-09-21T00:43:52.000Z",
          "Titre": "The service",
          "Contenu": "The service, price and convenience was really good, but I shot my photos on a white background, and for some UNKNOWN reason, you still took my image and cut it - like it was done with scissors, an outline of me - making my hair look like a helmet and making it obvious that the image is now \"doctored\" but it absolutely did not need to be done, and  I don't understand why this was done."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eran",
          "Nb_Reviews": 3,
          "Date": "2019-03-29T03:11:46.000Z",
          "Titre": "Process unclear",
          "Contenu": "It is not made clear that the background is erased until you see the ready result - which hints that the photo was altered (I believe this is against the official guidelines).In my cast - a photo of an infant - there's more leniency about the rules, but still it would be helpful to see why my photo was cut the way it was (leaving too little space around the face). Perhaps show the guidlines on the photo, or alongside it, in the confirmation email."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Raul Voltani",
          "Nb_Reviews": 1,
          "Date": "2019-03-07T17:28:20.000Z",
          "Titre": "Photos are OK (not good not bad)",
          "Contenu": "1st. Tried yesterday to get the photos at CVS, no good at all. 2nd. Tried today, drove 15 miles to find a Walgreens, get the photos. I would say photos are OK (not good/ not bad). Digital photos are good but the final print quality is still far away from a good one, not sure if the pictures will be accepted for an oficial document."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe Mac",
          "Nb_Reviews": 1,
          "Date": "2017-08-28T15:25:57.000Z",
          "Titre": "Hi after i had sent in my pictures for …",
          "Contenu": "Hi after i had sent in my pictures for a passport i got on your site to ask a couple questions because it was the fist time ive used this site and was having a hard time receiving a response so after a couple questions answered i gave up with my others. I only did one although I need 1 to 3 more passports because I wanted to see how things went do it this way and i picking up this first set later today. Thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jimbo",
          "Nb_Reviews": 3,
          "Date": "2016-11-26T19:28:42.000Z",
          "Titre": "Walmart?",
          "Contenu": "Received the photos from a Walmart in Bentonville, AR.  Hopefully the quality will be acceptable to the visa people.   Look OK  but at their request I took and sent more photos which apparently weren't used or necessary.   Was miscommunication apparently.  Happened again with my wife's photos but haven't received them yet so I don't know if the request to retake was also unnecessary..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Justin Jordan",
          "Nb_Reviews": 1,
          "Date": "2019-07-16T17:48:06.000Z",
          "Titre": "You should get buy in from the stores…",
          "Contenu": "You should get buy in from the stores you deliver to. Asking for help to cut the photos out was very embarrassing. I don't know if it reflects more on CVS or you guys, but being told \"I should have thrown these away since you didn't go through us...\" left me questioning the way i did this."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ashley",
          "Nb_Reviews": 1,
          "Date": "2019-06-26T23:49:36.000Z",
          "Titre": "Bad Service",
          "Contenu": "I thought it would be easier to upload my passport pictures and be able to pick it up the next day, but no. It's been 4 days and they still haven't replied back to me about my new picture or even when I asked to just cancel it.They did get back to me and issued my refund as I requested."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles Brush",
          "Nb_Reviews": 3,
          "Date": "2019-09-09T18:51:53.000Z",
          "Titre": "Ok but...",
          "Contenu": "Ok, but it's tickytac on charges.  You get charged 2.99 whether you have it sent to your house or pick up at pharmacy.  Then the pharmacy charged another $.42.  not a lot of money but they don't tell you there are extra fees.  Got photos and they appear to be functional."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "robert nelson",
          "Nb_Reviews": 1,
          "Date": "2017-08-25T13:35:26.000Z",
          "Titre": "The ordering process went smoothly, however...",
          "Contenu": "The ordering process went smoothly.  They even emailed me saying my submitted photo wouldnt be acceptable.  They were quick to respond.  After the order, though, they failed to respond twice to a concern I had about my order.  Turns out, the order was ok, but they have yet to respond to my concerns."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Randy M",
          "Nb_Reviews": 1,
          "Date": "2016-02-03T14:36:03.000Z",
          "Titre": "PayPal snag",
          "Contenu": "Was able to load photos for passports easily. Seems to work well. Email notifications were prompt. I should be receiving them soon. The only snag was when I tried to pay using PayPal. It just didn't seem to work. I even attempted to use the \"chat\" feature and never received a response. So that's no good. \rI finally used a credit card to pay which makes me nervous. If the photos come and I like the quality, I'm happy, as long as my credit card is not used in Chechnya or something."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cj",
          "Nb_Reviews": 1,
          "Date": "2018-04-03T10:35:59.000Z",
          "Titre": "I wanted to make 4 differerent passport…",
          "Contenu": "I wanted to make 4 differerent passport photos for me and my family.   I couldn't figure out how to do that without checking out and making a new order for each photo which meant I didn't get the discounted price for buying more than one.    The site wasn't easy to use."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sherry Spencer",
          "Nb_Reviews": 1,
          "Date": "2019-04-29T22:11:31.000Z",
          "Titre": "Multiple prints were off",
          "Contenu": "I ordered a single passport photo which was mailed, and it was fine. I then ordered duplicates to be picked up at my local Walgreens, and they were off. The cropping was different on each, and Walgreens insisted that this was MyPassportPhoto's fault. Frustrating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gail Sandler",
          "Nb_Reviews": 2,
          "Date": "2016-06-01T18:43:23.000Z",
          "Titre": "Not completely happy",
          "Contenu": "When I started taking pictures for passports, they were most helpful. They even sent me an email saying one of the pictures might not work. It was absolutely impossible to chat with someone on line about what to do. I called on two consecutive days and left messages. No one returned my call. This is not a way to run a business. Finally I was able to connect with a \"chat\" and he told me how to send the new pictures. They had said to simply hit reply, but the messages were undeliverable. All settled now as I await my photos."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fei Weng",
          "Nb_Reviews": 1,
          "Date": "2015-03-12T15:58:09.000Z",
          "Titre": "Wish the photo can be download more quickly",
          "Contenu": "It takes time to verify the picture before you actually see the picture and decide to use it or not. The process can be designed in another way, take photo- see if you like it either retake or go next step - then verify if it is complient...\r I only purchased the digital copy, which didn't come through email within 30 minutes. Thought I lost it…wish it could come more quickly.\r Photo is sent as a picture email, not as an attachment, I had to do my own work to make it a seperate jpg file.\r Overall, photo looks fine. Worth a try. More process improve needed for this app."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jean",
          "Nb_Reviews": 1,
          "Date": "2016-10-28T01:47:39.000Z",
          "Titre": "It takes too long to receive the photos.",
          "Contenu": "Don't pick shipping, it takes almost 2 weeks to get it. When you pick the pick up option, it's confusing which pharmacy you can pick it up as. It would be better if there was a map that lists all the pharmacies in the area you can pick it up at."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rachel Scott",
          "Nb_Reviews": 1,
          "Date": "2019-12-27T14:36:35.000Z",
          "Titre": "Passport photos",
          "Contenu": "One set of photos was quick and easy. Definitely the cheapest, easiest way I know of to do passport photos.The second photo of my daughter they sent back because of shadows on my daughter's face (within 12 hours). They requested a new photo— which I sent within an hour. It took almost two days for a response (tried texting/emailing several times)-- but then they responded VERY quickly after I posted a negative review of the slow customer service . As the second picture I had sent was also not adequate, they refunded the charge and offered to process the photo for free because of the delay. I had already had her photo taken at Walgreens, but I appreciated the sentiment."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2015-01-07T17:22:17.000Z",
          "Titre": "Confusing payment process",
          "Contenu": "I've placed two orders over the last month and, both times, the payment process was confusing. When I chose \"pay by credit card\" and entered my card and clicked submit I was taken to a PayPal login site, and there was no indication that my payment had been submitted. I had to click \"Back\" and submit a second time before it went through. And then I wasn't sure if it had been submitted twice... This happened during both orders.\r Also, requiring customers to send an email indicating which RiteAid they want to pick up at is a little \"clunky\" (as opposed to having an option during ordering)."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "andreia dasilva",
          "Nb_Reviews": 1,
          "Date": "2017-05-22T14:12:24.000Z",
          "Titre": "Not so bad for the money.",
          "Contenu": "The photos were not high quality but they do what they promised. I had a problem with the quantities of the photos but it was a misunderstanding.And finally they tried to contact me to resolve the matter. Which seemed good to me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mtnjilly",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T20:30:12.000Z",
          "Titre": "Placed 2 orders, only received one.",
          "Contenu": "Placed 2 orders, only received one. Chatted online and was told I could pick up photos from a CVS, was told to wait for an email, but then heard nothing more. Tried to chat online on 2 other occasions and nobody came online.Update: after posting this review I was contacted by email and they sent me another set of photos in the mail and also arranged a set of photos for me to pick up at my local CVS the next day.My original 1 star wasn't because I only received one set of photos (we know the postal service isn't perfect) it was the lack of response from their online help. However, they eventually went to some effort to get the photos to me. Thank you !!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sandra Meyer",
          "Nb_Reviews": 3,
          "Date": "2018-02-23T00:11:01.000Z",
          "Titre": "Camera phone",
          "Contenu": "I sent four photos, but the first one that was (supposed be bad) was used . The Passport agency said a camera phone picture was  good. The websute fir Passport Photo saud ut had ti be done by a digital camera. I was confused."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hillary",
          "Nb_Reviews": 1,
          "Date": "2015-03-13T20:19:59.000Z",
          "Titre": "Fixed error",
          "Contenu": "I wrote a review that I could not get a hold of customer service and was contacted within an hour of posting the review. They comped my photos which turned out great and I received them on schedule. Thank you for fixing the error."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TB",
          "Nb_Reviews": 5,
          "Date": "2020-07-26T03:24:25.000Z",
          "Titre": "Ordered Passport Photos for another Use",
          "Contenu": "I ordered passport photos that I was using for something other then a passport. My Passport sent me an Email advising me that the photo may not pass for a passport photo and to send them another photo, but if I didn't send them another photo within a certain time period they would go ahead with my order and my order would be ready within 24 hours. I didn't send them another photo because I didn't need it to be that precise and in 24 hours they sent me another Email again telling me to send them another head shot. This wasted  almost two whole days for me. They should have a check box stating I know and agree to have the photo printed ASAP. The photos were good and the price was right, but the hassle will have me rethinking whether I will use them again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "bh",
          "Nb_Reviews": 1,
          "Date": "2018-10-14T01:05:09.000Z",
          "Titre": "Good quality on print, but shipping is 7 days",
          "Contenu": "The print quality is good, but the shipping took a little long, 7 days, it went through from UPS to USPS, to my home. If I remember correctly, there is $2 charge for shipping. I was expecting 3~ 5 days."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2015-03-26T19:28:00.000Z",
          "Titre": "Concerned",
          "Contenu": "After placing my order I am concerned the passport photos will not be up to government requirements. I did not pay the additional amount as I felt this was excessive and should not be required."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Dieck",
          "Nb_Reviews": 1,
          "Date": "2018-09-27T22:59:32.000Z",
          "Titre": "Shipment Tracking Issues and Frustration",
          "Contenu": "Photo processing was fast but shipping took over a week without adequate tracking causing confusion and frustration.  Shipping and tracking of the product need to be improved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donna Marie - Customer",
          "Nb_Reviews": 1,
          "Date": "2015-02-07T14:00:18.000Z",
          "Titre": "Lets see the pictures for Donna Marie!",
          "Contenu": "Hello, unfortuently, no pictures cane with this message.\rWould would love to see them so plsease send then on to us!\rAll of them.  Only then can we give you our honest opinion..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vincent Dutat",
          "Nb_Reviews": 1,
          "Date": "2017-12-15T03:29:20.000Z",
          "Titre": "When I went to the CVS store to pick up …",
          "Contenu": "When I went to the CVS store to pick up my visa photos, they were not printed, then they asked me to pay $0.99 even though I paid already the full price on the wbsite."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jonas Doerr",
          "Nb_Reviews": 1,
          "Date": "2020-07-10T18:03:25.000Z",
          "Titre": "Slow delivery",
          "Contenu": "Ordered 2 passport photos on June 11th. Expected that those would ship in a timely manner since I had my appointment the end of the next week and they charge a significant price for a signle photo.Since they didn't arrive I went to Walgreens and got some (not so great) passport photos for 14.99. As of June 27th the photos are STILL not here - in other words: If you need your photos in a reasonable time look elsewhere. I'm unable to judge the quality of the product since it's still not here.Edit: +2 stars since I eventually received my order (after around 3 weeks) and the seller was quick to mitigate the issue and refunded. I stand to my opinion: Order here but only if time is not an issue and you want the convenience to (eventually) have your photos delivered to you. I obviously don't need those photos anymore since my new passport arrived just one week after I got the photos..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff Tung",
          "Nb_Reviews": 1,
          "Date": "2019-07-07T20:21:47.000Z",
          "Titre": "Ordered 2 photos of 2x2",
          "Contenu": "Ordered 2 photos of 2x2. They were printed on the same  sheet of 4x6 and store won't cut them off for me. Got to be a way to make it a bit more convenient."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Fasano",
          "Nb_Reviews": 1,
          "Date": "2020-08-13T15:02:01.000Z",
          "Titre": "Said I could wear glasses if…",
          "Contenu": "Said I could wear glasses if prescription I did couldn’t use photo. Then had to retake the photo several times because of “lighting” very aggravating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PC",
          "Nb_Reviews": 1,
          "Date": "2018-05-18T02:42:56.000Z",
          "Titre": "i requested to have my passport photo…",
          "Contenu": "i requested to have my passport photo cut in 2x2 but it wasn't done.And also it took like a week to receive my photos, little bit longer than i expected."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2019-09-19T17:49:41.000Z",
          "Titre": "The delivery took longer than…",
          "Contenu": "The delivery took longer than advertised and they were unable to deliver in the end. The price and quality were fine. Quick and responding to my query"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Manny Abad",
          "Nb_Reviews": 1,
          "Date": "2020-01-13T09:50:16.000Z",
          "Titre": "Experience",
          "Contenu": "The overall experience was okay. In store price is approximately $16 for two copies & with you guys it was $10. The savings of $6 does require additional effort. I had to take my own photo. I never received an email that my picture was ready, which made me go to the CVS Store to follow up. I think this more so falls on CVS end. I was expecting two pictures and received four. This isn’t bad.  After paying online, I had to pay an additional amount in store. I wish it was all included within one price. However, the reason being is because not every drugstore accepts payments online. You are emailed this information after your purchase & should be reimbursed. The pictures are printed out in a 4x6 picture with outlines to help you cut each individual photo. I didn’t see this information online, however was informed by a customer service member that the information is provided online. A savings of $6 is fine just be aware it requires additional work on your end."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patsy Lovelady",
          "Nb_Reviews": 5,
          "Date": "2015-02-04T01:37:44.000Z",
          "Titre": "PASSPORT PHOTO ORDER",
          "Contenu": "everything was great until I couldn't put in my CVS location for next day pickup.  I still don't know where its going tomorrow????"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mahesh Sabhnani",
          "Nb_Reviews": 1,
          "Date": "2019-06-24T14:16:20.000Z",
          "Titre": "Took more than 3 days to get photos",
          "Contenu": "Took a lot of back and forth on pickup location. Ideally would have liked to see store options for delivery based on zipcode."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hrod",
          "Nb_Reviews": 1,
          "Date": "2020-08-11T19:37:01.000Z",
          "Titre": "I sent to print 2 passport photos with…",
          "Contenu": "I sent to print 2 passport photos with you, arrived 15 days later and the photos without cropping! It's a botch!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Martha",
          "Nb_Reviews": 1,
          "Date": "2015-03-28T20:28:21.000Z",
          "Titre": "CVS Unaware of App",
          "Contenu": "I arrived at CVS to pick up my photos, and the manager of the photo area was completely unaware of the app and its connection with the store.  It caused quite a bit of friction as he explained to me over and over that this is not how the process works to obtain a passport photo. When I finally convinced him to check the computer for the files, he found that they were in fact there and ready to be printed, and continued to argue with me that the photos must meet government specifications and that these would not work.  While My Passport Photos is not responsible for the poor service I received at my local CVS, I think both CVS employees and customers would benefit from stronger communication about the existence of the My Passport Photos app and its relationship with CVS.  \r Also, the file for my personal passport photo may have been corrupt, as the righthand picture that came out had a white line through the middle of it.  My friend's passport photos came out fine. The angry man printed it twice to check that it was indeed the file and not the printer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Taka tonbo",
          "Nb_Reviews": 2,
          "Date": "2018-02-18T19:54:11.000Z",
          "Titre": "Over priced for services provided",
          "Contenu": "Over priced for services provided. Why a 2.99 charge for self pick up. Plan not to use your service again. GK"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BBet",
          "Nb_Reviews": 2,
          "Date": "2019-09-16T16:26:04.000Z",
          "Titre": "Satisfaction achieved with effort.",
          "Contenu": "Received photos, good quality, however communication is severely needing improvement.  It wasn't until after several days of emails (some auto generated stating that I had received my photos) and finally posting a negative review, that I finally got through to someone and got some action.  He was very quick to respond after that and also refunded my money.  Several days later, I did receive the photos in the mail.  However, it shouldn't take that kind of effort on the customers part to get satisfaction.This is what it took to get a response:\"Missing Photos and no response from you. I have now left several messages regarding this issue.  I went to the website to try to “chat” with someone, but that is not an available option.  I just noticed in several reviews that I am not the only one who has had this issue with you. I received an email saying the pics were delivered – they were not.I checked the tracking – it still does not show them as being delivered. IF I DO NOT GET A RESPONSE WITHIN THE NEXT 24 HOURS – NOT ONLY WILL I LEAVE A NEGATIVE REVIEW, BUT I WILL ALSO CONTACT PAYPAL AND HAVE THEM BEGIN A DISPUTE REQUESTING MY MONEY TO BE REFUNDED. I do not want to have to go this route, but I will if I do not hear back within 24 hours.(24 hours later) I have not heard back, so I am proceeding with this action.\""
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Betsy Santarlasci",
          "Nb_Reviews": 2,
          "Date": "2020-06-24T14:54:26.000Z",
          "Titre": "the photo image has to be at most 1 3/8…",
          "Contenu": "the photo image has to be at most 1 3/8 inches, and ours is taller than that"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MTF",
          "Nb_Reviews": 2,
          "Date": "2018-04-28T12:09:57.000Z",
          "Titre": "US Postal Better",
          "Contenu": "Our passport photos were washed out.  The US Post Office took better pictures!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LINDA DAVOLT",
          "Nb_Reviews": 1,
          "Date": "2016-05-07T23:50:24.000Z",
          "Titre": "Passport pics",
          "Contenu": "What was sent to cvs was one pic and had to reprint a second"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sameeh  Gardner",
          "Nb_Reviews": 1,
          "Date": "2017-08-05T10:18:41.000Z",
          "Titre": "Pics came out a little dark with shadow …",
          "Contenu": "Pics came out a little dark with shadow under eyes"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jerry yang",
          "Nb_Reviews": 1,
          "Date": "2015-03-27T17:17:06.000Z",
          "Titre": "Passport review",
          "Contenu": "Good clean interface with multi-country options"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Julie Ashley",
          "Nb_Reviews": 1,
          "Date": "2019-05-22T23:30:18.000Z",
          "Titre": "My photos for schengen visa was wrong…wrong size",
          "Contenu": "My photos for schengen visa was wrong size."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ravil Asadov",
          "Nb_Reviews": 1,
          "Date": "2016-12-12T04:45:01.000Z",
          "Titre": "A little slow than I expected",
          "Contenu": "It takes a little more time than I expected."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kristina Maxwell",
          "Nb_Reviews": 2,
          "Date": "2017-07-16T00:15:37.000Z",
          "Titre": "It's was great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony Kissack",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T18:19:13.000Z",
          "Titre": "Overall a pretty easy service to use",
          "Contenu": "Overall a pretty easy service to use. However, they do not offer tracked deliveries which is disappointing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave Rogers",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T14:04:28.000Z",
          "Titre": "So far it has been great",
          "Contenu": "So far it has been great. They process my visa tomorrow so hopefully all goes thru fine"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Susanne",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T08:28:47.000Z",
          "Titre": "My first 2 submitted pictures were not…",
          "Contenu": "My first 2 submitted pictures were not acceptable and were returned without specific reasons. I sent an email to support and asked for actionable guidance because I couldn’t see what was wrong with the pictures. Support responded within hours ( maybe even within the hour, I don’t remember off hand). I followed guidance and sent in a third. Bingo! All is well. This service was critical for me because I needed to send passport pictures to a government agency from abroad. It saved me good money in postage. I will use this app again and recommend it. Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 4,
          "Date": "2023-05-06T19:21:16.000Z",
          "Titre": "The procedure was easy. But there were two flaws",
          "Contenu": "The procedure was easy.One flaw is that I did not get to see the pic before I had to order it.The delivery to a close by Walgreens worked seamlessly.Another flaw is that I did not get a digital copy of the picture, even if I paid all together almost $30 for for prints."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Hashim Muhammad Khan",
          "Nb_Reviews": 2,
          "Date": "2023-07-24T18:23:18.000Z",
          "Titre": "I like this site",
          "Contenu": "I like this site, it's so constructive and an easy approach to apply for visa, but still have some ambiguities especially when uploading pic. I hope the management will hand over on it soon. Furthermore, I will also suggest rest of the user."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sema",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T04:37:25.000Z",
          "Titre": "At first I thought it was a trick since…",
          "Contenu": "At first I thought it was a trick since I had a similar experience. So happy I took the chance with Iviza. The pictures were well edited with a reasonable price. If I could change one thing it would be the time of delivery. However its a great company"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Danielle A",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T16:40:09.000Z",
          "Titre": "Easy to do at home!",
          "Contenu": "This was pretty helpful to do at home. Instructions were pretty clear and easy to submit the photo. Photos can incredibly fast!The one issue I had was when my photo was rejected, the link didn’t work from the email. But eventually the link was fixed and it worked to resubmit the photo."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ACC",
          "Nb_Reviews": 1,
          "Date": "2022-10-01T06:42:14.000Z",
          "Titre": "Fast turnaround",
          "Contenu": "Fast turnaround, received the picture within an hour. The picture cropped looks the same as the one I sent so it looks like I am just paying for the cropping service and no enhancement of the photograph (like the lighting)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maria Cristina Summers",
          "Nb_Reviews": 2,
          "Date": "2023-06-03T15:26:47.000Z",
          "Titre": "Need to offer option of passport book AND card together.",
          "Contenu": "It would be nice if you offered the passport book and card together as an option. I would have likely ordered the combination. Picture came out fine."
        },
        {
          "Note": 4,
          "Lieu": "GE",
          "Pseudo": "AISHA VILAYET QIZI RAMAZANOVA",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T07:35:58.000Z",
          "Titre": "online application is good",
          "Contenu": "online application is good, it would be better if the procedure did not take so long"
        },
        {
          "Note": 4,
          "Lieu": "KW",
          "Pseudo": "Bappi Chesti",
          "Nb_Reviews": 2,
          "Date": "2023-08-16T06:59:35.000Z",
          "Titre": "Good",
          "Contenu": "I just new in ivisa service taker, overall first experience is very good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hongbin Zhou",
          "Nb_Reviews": 3,
          "Date": "2023-01-25T19:26:10.000Z",
          "Titre": "THIS COMPANY USED TO BE PERFECT",
          "Contenu": "THIS COMPANY USED TO BE PERFECT, BUT NOW IT IS NOT AS GOOD. IT IS STILL A GOOD COMPANY, THOUGH. THE COMMUNICATION BETWEEN ITS EMPLOYEES DOES NOT LOOK SMOOTH ENOUGH."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-02-05T02:19:15.000Z",
          "Titre": "Digital photos looked great",
          "Contenu": "Digital photos looked great. I would include 3 or 4 images instead of 2 and space them out. The 4x6 print is mostly white otherwise."
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "Jayzel Hynson Sarigumba",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T06:36:44.000Z",
          "Titre": "Very responsive and team are very…",
          "Contenu": "Very responsive and team are very helpful!!but I thought its printed together in the form ! But generally all are good 👍 very responsive! Good luck have a nice day! You do your job well!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PSUser",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T03:26:52.000Z",
          "Titre": "It's a good service",
          "Contenu": "It's a good service. For something potentially time-sensitive, and given the ubiquity of shipment tracking, I think that tracking should be offered as part of the package."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Betty Bakk",
          "Nb_Reviews": 3,
          "Date": "2023-03-03T23:30:02.000Z",
          "Titre": "The shipping wasn’t as quick as I would…",
          "Contenu": "The shipping wasn’t as quick as I would have hoped - but it was a letter thru the post office.  USPS not very dependable.It was very easy and no visit to a populated store!  Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sharee Gatto",
          "Nb_Reviews": 3,
          "Date": "2023-04-05T22:05:36.000Z",
          "Titre": "Fast service",
          "Contenu": "Fast service. Didn't catch a smile in one photo and had to resubmit after asking about it, but they took care of it very quickly."
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "ABDUL RAZZAQ",
          "Nb_Reviews": 2,
          "Date": "2022-11-19T11:58:02.000Z",
          "Titre": "BUT I DIDN'T GET MY HEALTH HEALTH…",
          "Contenu": "BUT I DIDN'T GET MY HEALTH HEALTH DECLARATION FORM."
        },
        {
          "Note": 4,
          "Lieu": "JM",
          "Pseudo": "Cora Yap",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T03:49:34.000Z",
          "Titre": "Visa to China",
          "Contenu": "Applying for a tourists visa to visit China"
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "Nichakarn Promthagol",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T02:35:17.000Z",
          "Titre": "This website retouched background so…",
          "Contenu": "This website retouched background so well. It looks so real."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kelly Ponce",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T03:34:15.000Z",
          "Titre": "I received the re-touched image very…",
          "Contenu": "I received the re-touched image very quickly via email. The printed image did not arrive in the mail as quickly. It was estimated to arrive in 2-4 business days, but it was more like 5-6 days. I did not need the print in a rush, so no worries."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MIRIAM DUNBAR",
          "Nb_Reviews": 11,
          "Date": "2023-08-18T01:46:13.000Z",
          "Titre": "Satisfied",
          "Contenu": "The photo looks good and it arrived quickly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jack Anderson",
          "Nb_Reviews": 2,
          "Date": "2022-08-15T07:12:50.000Z",
          "Titre": "Sent in my photo for editing because my…",
          "Contenu": "Sent in my photo for editing because my passport needed renewal and it was just as advertised, the picture was edited appropriately and to the correct size, I would definitely be using their services again in the future."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Etsuko",
          "Nb_Reviews": 1,
          "Date": "2022-07-27T22:48:04.000Z",
          "Titre": "I love your service and efficiency",
          "Contenu": "I love your service and efficiency. When I first ordered the photo from you, the photo was cropped perfectly. (Which was for Japanese passport) The second time when I send the exact same photo to match the criteria of Canadian PR, someone who helped me edit/resize photo made my shoulder look like a rugby player by photoshop liquifying lol I understand that you needed to do some adjustment to fit the frame or change the background to pure white or something but please don't make it look so awkward. I LOVE the first order product but not the second one. But other than that this is really great service! I will come back for more."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Kim",
          "Nb_Reviews": 1,
          "Date": "2020-02-17T13:38:40.000Z",
          "Titre": "Sent in wrong photo but they replied quickly and resolved the problem",
          "Contenu": "Sent in wrong photo and they replied back quickly. I was able to swap out the photo without having to cancel the order.I knocked down a star because it was slow to get here.Using UPS-USPS is slower than just using USPS, which I would have preferred.  I sent in a photoshopped picture but they photoshopped it even more, but it turned out OK."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keith Christensen",
          "Nb_Reviews": 4,
          "Date": "2019-08-02T02:49:01.000Z",
          "Titre": "So easy and quick",
          "Contenu": "Easy to use website for making a passport photo from camera photos. The email from them with concern about the photo supplied not fitting the expected criteria was nice and helped show what may be considered wrong, and gave the expected response time to upload a new photo to have it used for the passport photo print out. I picked up the photo next day from my local drugstore. Pleasant and quick, great experience for me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CJ",
          "Nb_Reviews": 1,
          "Date": "2019-03-18T11:54:55.000Z",
          "Titre": "Some issues with pickup",
          "Contenu": "When I went to pick up my photos, it was not listed under “my passport photos” or my name, but the name of someone I’ve never heard of, so it wasn’t the easiest to get my pictures. Thankfully I went not long after they had been printed so the woman who printed it was able to find them. I also didn’t expect to pay an additional fee to the drugstore—I thought all of that was covered"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Dreps",
          "Nb_Reviews": 2,
          "Date": "2019-03-01T13:51:13.000Z",
          "Titre": "Photos are good; however...",
          "Contenu": "Photos are good, customer service is good, and service is fast. The problem I have experienced every time at my local CVS is that the staff have no idea how your service works, and we have to figure it out, always with a manager involved. The numbers you give them don’t match the two different order numbers I receive. Your instructions help, though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cristina Ochoa",
          "Nb_Reviews": 1,
          "Date": "2018-08-24T13:44:37.000Z",
          "Titre": "After I purchased my photos and…",
          "Contenu": "After I purchased my photos and selected the ship to me option, I noticed that shipping would take 7-10 business days. However, I was able to get ahold of a representative within minutes who spoke directly with the production team and had my photos set for pick up at my local CVS that evening. Great help in addressing the problem!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 5,
          "Date": "2017-04-27T17:20:39.000Z",
          "Titre": "nice photo, helpful site",
          "Contenu": "The photo turned out well, the delivery was fast and efficient.  I had no idea that producing a passport photo would be so difficult, but I couldn't find any of my local usuals (CVS, Walgreens, Fred Meyers) could do a 2X2, so MyPassportPhotos was my solution.  I still paid the $.29 at Walgreens on top of the MyPassport fees, but it was still cheaper than any other option.  And I could control the photo.  So, all in all, a good experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerry Floyd",
          "Nb_Reviews": 1,
          "Date": "2017-10-04T21:59:41.000Z",
          "Titre": "You did not have my name attached to my …",
          "Contenu": "You did not have my name attached to my order and your ref # did not work. . CVS had a difficult time but eventually found my photos.  Also, when I called the customer service # I reached a recording with the message of how important my call but then stated you would get back to me with 24 hours. Not a good message to hear when I made a special trip to CVS. Otherwise, very happy with photo at a great price. CVS charged me $.29 for each photo. Great deal."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debbie Bowen",
          "Nb_Reviews": 4,
          "Date": "2016-06-09T22:36:43.000Z",
          "Titre": "Follow-up Review",
          "Contenu": "My PassPort Photos emailed me stating that my passport pictures were not compliant but only gave me 24 hours to respond and correct the situation.  Since I didn't see the message in time, I was sent pictures I could not use.  I emailed them back but the order wasn't cancelled and I was charged.  I complained and they have bent over backwards to make it right.  Thank you for the responses, My Passport Photos."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Traveller",
          "Nb_Reviews": 1,
          "Date": "2016-06-22T22:53:12.000Z",
          "Titre": "Conscientious about making things right",
          "Contenu": "My photo did not turn out right (was trying to get an Italian student visa photo and it was altered), but MyPassportPhotos was very conscientious about making sure I was happy, and when the photo did not work out, they refunded me the cost.  I was very impressed with their speedy follow up, and would guess that they're quite competent with simpler passport photos."
        },
        {
          "Note": 4,
          "Lieu": "KH",
          "Pseudo": "Linda",
          "Nb_Reviews": 4,
          "Date": "2017-05-24T04:31:28.000Z",
          "Titre": "Pictures are OK – but not more",
          "Contenu": "I needed a few new pictures for my passport. After some research I stumbled across this site. Because of the reasonable prices I gave it a try.It took me some time to get my pictures right. So, I appreciate the given feedback on my photos. The overall quality of the pictures was OK. But, as I said before, not top-notch. The colors were a bit dull and flat.In total, my experience was OK. No troubles. The pictures were available at the selected CVS location on time."
        },
        {
          "Note": 4,
          "Lieu": "BG",
          "Pseudo": "jonathan garoutte",
          "Nb_Reviews": 1,
          "Date": "2014-11-28T18:48:25.000Z",
          "Titre": "timely answers to questions.",
          "Contenu": "This is the first time i have used this service for my passport photos and i have found that customer service is quick to answer conserns and questions. I have just ordered my photos a few hours ago so i have not received my photos yet. But having the next day pick up at a cvs a very convinient option especially if you can not get off work to get your passport photos taken."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kyle W",
          "Nb_Reviews": 1,
          "Date": "2016-01-01T00:39:42.935Z",
          "Titre": "What u see is what u get. Simple.",
          "Contenu": "No complaints. This is my third go renewing my family's ppts. I used iPhone 6S square shot in natural not bright sunlight through the window against a white living room wall.  Took several shots to get the shadows and body angle optimal. Didn't require expert touch up service. Mail seems slow, though they have options if you're in a hurry."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Areatha Mendenhall",
          "Nb_Reviews": 2,
          "Date": "2019-05-31T22:19:40.000Z",
          "Titre": "Got them all",
          "Contenu": "The photos are fine, but the one that was questioned as acceptable, had two more photos sent and took a couple of days to get here.  They are the right size for our passport pics and they are very clear.  I would just recommend not waiting until the last minute.  For the price they are outstanding!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christina  Sloop",
          "Nb_Reviews": 1,
          "Date": "2015-04-20T00:50:20.000Z",
          "Titre": "Great idea and service",
          "Contenu": "I really appreciate the ability to shoot my own passport photos and have them delivered. With so many details in my day each day it is wonderful not to have to coordinate a trip to a photographer with my two busy teenagers. Great idea and great responsive service. Still\rNeed to actually pick up my photos at the local CVS store but so far so excellent!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kulwinder Singh",
          "Nb_Reviews": 1,
          "Date": "2016-01-15T07:10:12.000Z",
          "Titre": "Excellent Service with cheap rates",
          "Contenu": "service was excellent but I'm giving 4 stars not 5 because you can only select Walgreens for same day pickup, there was Walgreens just near to my house but they said they are unable to deliver my photos to that store instead they send me the address of Walgreens where service was available but that store was 4 miles away from my house."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AF",
          "Nb_Reviews": 1,
          "Date": "2019-04-23T03:00:08.000Z",
          "Titre": "Fast service as promised",
          "Contenu": "Fast service as promised. Customer Service reached out to me to make sure the order was right. Their service was quick. Only thing I would suggest is for the orders to the drug stores to be prepaid as opposed to having the customers paid an additional charge (which is later refunded is requested)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stacy",
          "Nb_Reviews": 1,
          "Date": "2018-07-07T00:26:36.000Z",
          "Titre": "Passport photo came out great, but got lost in mail",
          "Contenu": "Passport photo came out great. The process of taking the photo and submitting it to the app was easy. I opted to have the photos sent to my home address after reading other reviews that stated there were issues with having the phtots sent to CVS. Mine got lost in the mail! They did finally arrive after a week of waiting. I was given a tracking number, but that was useless. To this day it says my photos are still in another state.  I wouldn’t recommend having them sent to your home if you need them in rush."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "EDIE TROCKI",
          "Nb_Reviews": 16,
          "Date": "2019-02-27T22:34:04.000Z",
          "Titre": "Would recommend very fast service",
          "Contenu": "Would recommend the service which was very fast and the photo quality was good. My only exception for not giving five stars was that when the photos were picked up at the local CVS. CVS charged an additional fee which there was no previous indications that there would be any additional fees."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brandon Burke",
          "Nb_Reviews": 2,
          "Date": "2017-12-27T08:00:38.000Z",
          "Titre": "Overall went ok",
          "Contenu": "Initially drug store could not find my photo. Had to email vendor and then come back another day it was found finally. Store waives the extra fee after I explained I paid in full online. I had to cut the photo myself but looks fine. Post office had concerns of the shirt worn in the photo and warned we may need to retake if an issue. Overall after a snag was able to get what I needed. Primary communication with vendor is email which gets annoying when you want a live person and don't want to wait hours for reply."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenna Childress",
          "Nb_Reviews": 2,
          "Date": "2020-07-08T14:00:42.000Z",
          "Titre": "Easy/quality process",
          "Contenu": "The entire process was easy and clear. I especially appreciated having an expert review of my photo. My only complaint is that I had to pay my pickup location (CVS) an extra fee ($.42), which I had not expected. It is a very small amount but still a surprise."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JS",
          "Nb_Reviews": 1,
          "Date": "2019-03-05T19:51:05.000Z",
          "Titre": "When picking up the photo",
          "Contenu": "updating my review: when arrived at CVS to search for my photo, the print was under the company name not my name.  It was my fault for this information was correctly provided in the confirmation email.  As for the fee charged by CVS even though a full payment was made at the time of my order, it does clearly state that a refund will be made for any additional charge. I do encourage the company to sort this out with vendors to lessen the hassle for customers.  They are very prompt to respond to my concern and review.  Switching from 2 stars to 4 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maria Costantini",
          "Nb_Reviews": 1,
          "Date": "2015-03-17T21:11:15.000Z",
          "Titre": "MyPassportPhotos experience",
          "Contenu": "I'm grateful for this service because I believe it meets a need. Hahah did a good job of making the photo I sent passport compliant, but there was a\rmixup at the Rite-Aid store where I picked up the package. It took them about a half hour to locate it, even though I had a print-out of my order with the order number. The problem turned out to be that my name was not on the outside of the envelope. There was Hanah's name instead. So, my suggestion is to make sure this doesn't happen again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Outdoorsy",
          "Nb_Reviews": 1,
          "Date": "2016-08-25T20:29:13.000Z",
          "Titre": "Global knowledge",
          "Contenu": "This app let me select the country so that it will print the correct size photo for that country. An improvement would be for the app to frame the face in the image while taking the shot, to ensure correct positioning for the photo. I'll know if it worked great when I receive the updated passport."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 1,
          "Date": "2017-10-23T21:55:58.000Z",
          "Titre": "Paid for 12, got only 2, but customer service was good",
          "Contenu": "I have ordered 12 photos and got just two. John from Customer Service was very effective in sending the missing photos. I have updated my review once I got what I have paid for, as promised. Although I had some issues, I still recommend the service since MyPassportPhotos.com reacted promptly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Spowart",
          "Nb_Reviews": 1,
          "Date": "2016-03-12T04:21:53.000Z",
          "Titre": "Excellent Value",
          "Contenu": "My Passport Photos offers a convenient and cost effective method of getting your photos. Quality of the photos received is very good at a much better price than is quoted at other places. Only thing that could make the service better: provide an option for a delivery service that is faster than USPS."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carolyn K.",
          "Nb_Reviews": 2,
          "Date": "2016-01-16T17:20:20.749Z",
          "Titre": "Costs more than advertised",
          "Contenu": "This seems like a great price at first look. Then when you've uploaded the photo, you learn that there's a substantial charge to have the photos mailed to your home in a few days, or a larger cost to pick them up at your local store the next day.  Then there's the email telling me it's ready and I should pick it up at the store at no additional cost, Walgreen 's still charges an additional $0.61 for the two sets of photos. Still a bit less than the store would have charged but only a very small bit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LGC123",
          "Nb_Reviews": 1,
          "Date": "2017-01-11T17:23:08.000Z",
          "Titre": "convient service, off dimensions",
          "Contenu": "Great and convenient experience. Initiated process (using a personal laptop) at 8:30pm and had my pictures in 12 hours picked up at the local CVS. The dimensions are unfortunately a little off--by 1.5-2mm, which is critical. Would be helpful to have cut individual pictures option available."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nikki",
          "Nb_Reviews": 1,
          "Date": "2016-09-05T17:21:55.000Z",
          "Titre": "Great service",
          "Contenu": "We needed photos for our visa application so they didn't have to be perfect. I didn't want to pay $13 per person for photos. This was a great way to get a quality passport size and style photo for a great price and excellent service. The only reason that I didn't give it five stars is that the location finder didn't work - so I had to look up the Walgreens address myself. Not a big deal, but I didn't know if Walgreens could actually do the photos until I sent a follow-up email clarifying that they could do it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 2,
          "Date": "2015-03-20T00:22:31.000Z",
          "Titre": "Pretty good pretty fast",
          "Contenu": "I like be the fact that you can take your own picture with a cell phone until you get it right. I didn't have a white background but the wall in my bathroom was yellow and with the photo edit they offer the background was edited to white. Really fast with the in store pickup, just one day. Only downside is the picture looks a bit light like the \"brightness,\" was increased a bit to much. Other than that the picture is great and as long as it's alright with the passport people it's alright with me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Breck Frazer",
          "Nb_Reviews": 3,
          "Date": "2017-02-22T02:35:13.000Z",
          "Titre": "Timeline was unclear",
          "Contenu": "They advertise that they have the pics shipped to you the day after next. I added expert review. I don't know if that requires extra time. I'm moving and want to submit my passport renewal ASAP. The notice I received from these people said I will receive them in 7-10 business days"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mari",
          "Nb_Reviews": 1,
          "Date": "2015-03-11T18:52:28.000Z",
          "Titre": "Easy",
          "Contenu": "Very easy to take the picture and fast processing I used the digital download! I didn't know how to print it out, so I asked the lady who emailed my pic and she said it was 2x2 but didn't give me an explanation. I figured out that using the program paint you can print it out 2x2 perfectly!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sachi Plummer",
          "Nb_Reviews": 5,
          "Date": "2018-06-09T03:21:01.000Z",
          "Titre": "I got the extra service for optimum…",
          "Contenu": "I got the extra service for optimum editing....the photos did not look like anyone had edited them. Hope the Visa Office accepts it because there was a very slight shadow in the photo.Ordered the mail option....took very long with one order. the other order came fairly quick."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2015-01-07T18:11:10.000Z",
          "Titre": "Go through whole process for each person",
          "Contenu": "This was simple and easy.  Except I need passport photos for my whole family, and unfortunately there was no \"take another photo\" before going to purchase... so I had to write my contact info, credit card info, etc multiple times, once for each person.\r I used the iPhone app."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2014-12-06T23:36:19.000Z",
          "Titre": "Overall exceptionally pleased",
          "Contenu": "I've experienced very quick and friendly correspondence with the company. The application is easy to use and very convenient. The only thing I would change is the process at the end of the transaction when the application checks your photo for compliance and then approves the photo even if it is not compliant. It seems misleading, but this is redeemed by the fact that a company representative will then email you to discuss the compliance of your photo and give you 24 hours to provide a compliant photo. Overall exceptional service. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennilyn Fife Rock",
          "Nb_Reviews": 1,
          "Date": "2015-11-25T23:27:14.803Z",
          "Titre": "Walgreens",
          "Contenu": "Never did get them in the mail, but as I communicated with customer service they took care of me at Walgreens.  They were prompt in contacting me as I waited.  If yours don't make it in the mail don't wait like I did, just contact them right away and they will help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "C.S.",
          "Nb_Reviews": 1,
          "Date": "2015-12-11T11:39:11.596Z",
          "Titre": "Passport pictures",
          "Contenu": "I was very impressed with the customer support I received. After ordering passport pictures which were printed at our local Walgreens and did not live up to my expectations (they weren't cut to size and the paper was not a god quality) I complained and was contacted promptly and offered a full refund or a set of pictures printed by them. Unfortunately I was pressed for time and could not wait for the pictures to ship. So I don't know if the second set of pictures would have been better, but based on my experience I would be willing to try again in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles Buddemeyer",
          "Nb_Reviews": 1,
          "Date": "2015-02-21T02:50:05.000Z",
          "Titre": "Confused!",
          "Contenu": "After paying for my order, I checked my e-mail for the conf. # . I made the mistake of not Responding to the E-mail. The instructions were not clear. There was no where to Select the proper store for pick-up. The CVS that I wanted to use did not have a working machine or computer and wanted to charge me $22 to retake the photo. I left and went the Rite Aid 2 miles away. They explained that maybe I should reply to the e-mail and give them their address info. Well, I have and maybe by tomorrow I will get the photos that I need... a day late for the school. Lesson learned."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "R. Wright",
          "Nb_Reviews": 1,
          "Date": "2015-02-20T12:47:17.000Z",
          "Titre": "quick and easy",
          "Contenu": "Instructions were easy to follow using my laptop cam.  Nice feature to know that the picture conformed to standards immediately and received confirmation of purchase within minutes.  Have not received prints yet, so cannot comment on delivery or quality of the photos."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jane wang",
          "Nb_Reviews": 1,
          "Date": "2015-03-30T14:55:53.000Z",
          "Titre": "convenient and reasonable price",
          "Contenu": "The quality of the pictures are good. The website is very easy to use. I chose the mail to home option, which took one week even though I got a message the next day to say that the printing was done and it was in the mail. Would definitely use it again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Steward",
          "Nb_Reviews": 2,
          "Date": "2016-12-12T20:12:58.000Z",
          "Titre": "Good Passport Photo Solution without the Offline Hassle",
          "Contenu": "Very good customer service to deal with issues and a good finished product as well.Site could be improved if vendor added a list of approved vendors rather than making the user trying to choose one that they support. Note: I am a repeat user!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Robbins",
          "Nb_Reviews": 1,
          "Date": "2017-02-11T02:13:06.000Z",
          "Titre": "Great service-fast delivery",
          "Contenu": "It took me several tries to get my photos \"compliant\" . . . it is still a great service. I only had leave home to pickup the completed photos and take them with my application to the post office. Completed photos were of good quality."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ukulele",
          "Nb_Reviews": 2,
          "Date": "2018-08-15T07:07:37.000Z",
          "Titre": "No problem with the photo quality, however..",
          "Contenu": "No problem with the photo quality, however..I believe some people can not wait for one week including myself.It would be much better if I could have received them in two days or so just like Amazon Prime even if extra fee is charged."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valérie",
          "Nb_Reviews": 1,
          "Date": "2018-02-04T13:52:41.000Z",
          "Titre": "Easy and very quick to apply !",
          "Contenu": "Easy and very quick to apply !! Convenient and efficient !My only negative point would be that the pick up store address I had given has not been respected !! So I had to drive 30 mn instead of 10.But I would reuse this site anyway !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Natasha Green",
          "Nb_Reviews": 3,
          "Date": "2018-05-15T00:28:25.000Z",
          "Titre": "First Time User",
          "Contenu": "I appreciate how fast and attentive you were, but my order was half complete.  And thank you for responding to my complaint and sending the missing pics. I also thought you would cut the pics for me instead of my having to do it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Noon Schluntz",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T16:26:18.000Z",
          "Titre": "Good quality photo",
          "Contenu": "Good quality."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mac",
          "Nb_Reviews": 1,
          "Date": "2016-02-20T01:40:51.000Z",
          "Titre": "Actually pretty fast",
          "Contenu": "I took photo by myself then upload to the app then just picked up in the next day in cvs, the one of unconvinced thing that PayPal was not connected to the directly payment, only can pay by credit card.\rAnyway, the photo pretty nice:)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JP  Alishahi",
          "Nb_Reviews": 1,
          "Date": "2018-06-07T18:36:54.000Z",
          "Titre": "Customer service was great",
          "Contenu": "Photo came out way to zoomed in barely showing shoulders. Customer service was quick to respond and did a fantastic job handling the situation. Although there was some friction, I will still recommend this website to others!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ann B",
          "Nb_Reviews": 1,
          "Date": "2017-01-23T02:19:08.000Z",
          "Titre": "So far so good.",
          "Contenu": "It was quick and easy to order my photos online and reasonably priced. I haven't received them in the mail yet so I can tell you about the quality or how quickly they came since I only ordered them yesterday. Time will tell"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "S M Mosharraf Hossain",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T09:31:39.000Z",
          "Titre": "Marhoma Hossain",
          "Contenu": "Good Service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steelergirl86",
          "Nb_Reviews": 2,
          "Date": "2017-01-12T18:32:26.000Z",
          "Titre": "Passport photos",
          "Contenu": "I had no real issues with the passport photos that I received.  Once I got the proper email notification, process was smooth.  Found this site very easy to work with and follows through with commitments in a timely manner."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Estelle",
          "Nb_Reviews": 2,
          "Date": "2016-07-26T22:52:07.000Z",
          "Titre": "Prompt and Easy",
          "Contenu": "I appreciate the promptness in responses from My Passport Photos.  They informed me when my first photo wasn't a high enough resolution and I was able to email a better version.  It was easy to work with them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cheryl Paulson",
          "Nb_Reviews": 2,
          "Date": "2018-04-03T14:56:58.000Z",
          "Titre": "I was pleased with the ordering process…",
          "Contenu": "I was pleased with the ordering process and photos but bummed I had to pay an additional $1.08 at Walgreens to pickup my photos after I already paid $20.99 online for my 3 three kids by passport photos."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Esther",
          "Nb_Reviews": 1,
          "Date": "2017-11-22T23:09:05.000Z",
          "Titre": "Very pleased with my pictures",
          "Contenu": "Very pleased with my pictures. Just one issue-when I went to CVS to pick up, they couldn't find them as the name given was Prints, My Photo. Not sure why the site didn't use my actual name."
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "ABDUL RAZZAQ",
          "Nb_Reviews": 2,
          "Date": "2022-11-17T08:26:14.000Z",
          "Titre": "PHOTO IS BUT APPLICATION TO LATE PROCESS TIME",
          "Contenu": "VERY GOOD SERVICES"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cassandra S.",
          "Nb_Reviews": 1,
          "Date": "2018-05-03T22:51:38.000Z",
          "Titre": "Easy to use; good pictures quick",
          "Contenu": "It was very easy to use and the pictures came out great.  A bit more expensive than just having CVS do it, but well worth it for my special needs child who has trouble with eye contact."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Huong Le",
          "Nb_Reviews": 1,
          "Date": "2016-09-23T13:28:37.000Z",
          "Titre": "Great customer service. But pick up location limited",
          "Contenu": "My chosen location (CVS) is unavailable for online printing. I have to choose another one (Walmart), and it delays my time to pick up. But great customer service make it not uncomfortable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer #783743",
          "Nb_Reviews": 3,
          "Date": "2018-03-28T22:47:33.000Z",
          "Titre": "The passport photo is acceptable",
          "Contenu": "The passport photo is acceptable. The color is washed out a bit, compared to what was sent, but I'm sure the National Passport Processing Center will accept it. Exactly 2x2!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Priscilla Growney",
          "Nb_Reviews": 2,
          "Date": "2016-04-04T19:34:10.000Z",
          "Titre": "Prompt Service",
          "Contenu": "The passport pictures arrived promptly as promised.  We paid extra for touch up service and nothing appears to have been altered so I'd recommend skipping those additional fees."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DAVID",
          "Nb_Reviews": 1,
          "Date": "2016-07-23T17:04:30.000Z",
          "Titre": "Just what I was looking for.",
          "Contenu": "Picture turned out to be exactly what I needed.  Color, clarity, and aspect ratio were perfect for my license renewal needs.  I would recommend the service to anyone.  Great Job !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ChrisD",
          "Nb_Reviews": 2,
          "Date": "2015-02-08T20:17:07.000Z",
          "Titre": "Great customer support",
          "Contenu": "Just placed my order in for my passport photo. The process was easy and customer support is there to answer any questions you may have during the process. Overall a good experience!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julee Huy",
          "Nb_Reviews": 3,
          "Date": "2014-11-20T23:00:28.000Z",
          "Titre": "PrettyGood",
          "Contenu": "It said I could have it shipped to a local Rite Aid but never let  me choose a location. I was later contacted by email, it seems like they need a system update, but so far so good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary M.",
          "Nb_Reviews": 2,
          "Date": "2015-03-07T18:25:01.000Z",
          "Titre": "Great convenient site to get passport photos.",
          "Contenu": "Loved the convenience of the site.  Was unable to bring up the camera on my macbook however.  Worked around the issue by saving a photo from another app.  Otherwise worked great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2015-11-25T04:29:02.736Z",
          "Titre": "Quick and easy",
          "Contenu": "I looked around for places to get pictures and was very pleased to be able to do everything online. Only question is whether shipping option will arrive by the time I need them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randall L",
          "Nb_Reviews": 3,
          "Date": "2019-02-15T04:35:25.000Z",
          "Titre": "Good quality prints and easy to order",
          "Contenu": "Good quality prints and easy to order. Shipping could be faster and communication isn't perfect but still a quality service for a fair price. I would use again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Veda Smith",
          "Nb_Reviews": 3,
          "Date": "2015-03-04T23:39:24.000Z",
          "Titre": "No clear instructions once photo is picked but the customer service was great.",
          "Contenu": "I tried to use this site because I don't really have time to go to CVS or Walgreens and take a picture for my passport. The process broke down once I attempted to send my photo to the CVS of my choice even though I emailed the support team, I still was not given instructions on what to do once I picked the store. They need to make sure that instructions are given once you actually pick the store. This experience coud have been a whole lot better. UPDATE*******Once I contacted the support team again I was given exact instructions on how to obtain my photo's......Thanks Hannah and Sergio for all of your assistance. For those of you who are trying this process out for the first time, once you receive your confirmation email and select the store of choice reply back with that location and you should receive your pictures."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Natalie  balemi",
          "Nb_Reviews": 1,
          "Date": "2015-01-29T02:21:28.000Z",
          "Titre": "Passport photo",
          "Contenu": "I was unsure about this at first, but then received a lovely email to help with the photo and extra services.Photo now has been accepted. Thank you so much for your help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rahul",
          "Nb_Reviews": 1,
          "Date": "2016-02-02T13:07:18.000Z",
          "Titre": "Customer service is good.",
          "Contenu": "This rating is for their customer service only as I haven't checked out my photos yet. Will leave a review on that later. I found them to be responsive and helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen C",
          "Nb_Reviews": 1,
          "Date": "2020-01-22T02:21:00.000Z",
          "Titre": "You get your photo, but with some caveats",
          "Contenu": "Overall a good experience. Got my photo in my hands a little after 24 hrs from when I actually uploaded the picture/submitted my order, which is pretty fast.Was really scared after purchasing because I read some reviews that made me think it was a scam. Especially since some of the 5-star reviews seem fishy/unreliable. Luckily, it was not! However, for $11 for one photo I would have expected a little better. I wasn't told that I would have to cut the photo out by myself until my order was ready for pick up, so that was a little disappointing to find out. I also didn't realize that they would charge a printing fee at the store ($0.43). However, customer service refunded me the fee within 3 hrs of my request! I paid extra so that my picture would be compliant with the Chinese visa application, and that worked out. Also, they gave me two pictures instead of one so that was nice."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Rajegopal Shanmugan",
          "Nb_Reviews": 2,
          "Date": "2023-01-14T00:01:44.000Z",
          "Titre": "Good",
          "Contenu": "Quick response Good value for money"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Antonia Youngwirth",
          "Nb_Reviews": 3,
          "Date": "2017-07-28T00:31:33.000Z",
          "Titre": "Pictures came just fine",
          "Contenu": "Pictures came just fine. What did surprise me is that they were printed at Wallgreens and came in a Wallgreens envelope inside the mailer. Good service overall."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew  Shoyer",
          "Nb_Reviews": 1,
          "Date": "2014-12-14T20:48:26.000Z",
          "Titre": "Very helpful app when it works",
          "Contenu": "Dealing with the vendor has been great.  I had a very specific need (digital photos for Cambodian e-visas) and the app is set up well to provide them.  At first I tried do get a visa-compliant photo myself, but without great success.  I resubmitted and asked for the vendor to edit the photo to ensure that it would be visa-compliant, and the vendor refunded the money that I originally spent.\r Dealing with the app on my iPhone 4S has been frustrating.  About half the time, after getting all the way to the end of the checkout process, the credit card option did not drop down, so I was not able to pay.  The problem occurred without any warning, and I could not figure any way to go backwards, so I had to start again from scratch.\r The app does not permit me to use my flash.  One is encouraged to use natural light against a white background so as to avoid shadows."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Judith Odoom",
          "Nb_Reviews": 1,
          "Date": "2022-07-17T18:42:18.000Z",
          "Titre": "Good",
          "Contenu": "Received with many thanks.  It is a kind of good work  but delivery was too long than expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Manuel Pilier",
          "Nb_Reviews": 1,
          "Date": "2020-07-16T19:16:07.000Z",
          "Titre": "quick response but you advertized a…",
          "Contenu": "quick response ..I was at first very confused about the confirmation email mentioning a 4x6 but am glad i received an email with clarification."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tammy R",
          "Nb_Reviews": 1,
          "Date": "2020-04-23T22:47:52.000Z",
          "Titre": "Though my photos did muster when we…",
          "Contenu": "Though my photos did muster when we arrived at post office, when I let My Passport Photos know about the problem, they fully refunded all costs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christine OConnell",
          "Nb_Reviews": 1,
          "Date": "2016-08-22T20:10:16.000Z",
          "Titre": "Easy to use!",
          "Contenu": "This service was easy to use and there was actually a person on the other side to make sure everything was done correctly.  I would recommend to anyone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul C",
          "Nb_Reviews": 2,
          "Date": "2018-02-08T00:40:05.000Z",
          "Titre": "Good experience",
          "Contenu": "Good experience - I was not able to upload a replacement photo on the website so sent it to a customer service rep instead which worked just as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Tannen",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T07:17:06.000Z",
          "Titre": "Easy quick & inexpensive",
          "Contenu": "Easily, quicky, & inexpensively got my photo transformed to one that I could use for my visa"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Meredith M van Tys",
          "Nb_Reviews": 4,
          "Date": "2023-11-05T13:47:30.000Z",
          "Titre": "Great service",
          "Contenu": "Whenever I was tired to changed photos during all the daythe treatment was humanitarian no matter what."
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T02:44:01.000Z",
          "Titre": "Recommended Apps",
          "Contenu": "Easy, they’re clear with their guidelines and keep their promise to deliver."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin P",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T14:16:15.000Z",
          "Titre": "Fast and easy process",
          "Contenu": "Fast and easy process. They do go over submitted photos and let you know if it passes or has to be redone. Printed on my home printer and pics were perfectly sized"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "matthew p",
          "Nb_Reviews": 4,
          "Date": "2023-07-09T22:41:07.000Z",
          "Titre": "I needed to renew my passport and i was…",
          "Contenu": "I needed to renew my passport and i was easily able to take a picture in my house . The background was mild tan or almond but not white . They reviewed and expertly changed the background to white. I printed on photo paper and attached to the application . Very simple and easy to do. I did not realize that they also do full paperwork to renew and would have used them in retrospect . Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "melissa",
          "Nb_Reviews": 2,
          "Date": "2023-04-19T00:02:25.000Z",
          "Titre": "I saved more than $40 in photo fees by…",
          "Contenu": "I saved more than $40 in photo fees by using iVisa. iVisa made the picture-taking process for my visa easy. iVisa provided short demonstration videos and tips to ensure my picture was compliant with the requirements. It was also easy to upload the digital file to my visa application. The printable images were sized for the requirements."
        },
        {
          "Note": 5,
          "Lieu": "MZ",
          "Pseudo": "Narciso Djedje",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T07:30:31.000Z",
          "Titre": "It's the best",
          "Contenu": "I have been experiencing a lot of up and downs from the embassy and couldn't make it. I even cancel my trip, because I was tired of their stories. until the day I saw the advertisement on my phone, I decided to restart. I hope don't be disappointed again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sylvia Leary",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T13:10:01.000Z",
          "Titre": "I had been back and forth six times…",
          "Contenu": "I had been back and forth six times yesterday trying to get a photo that was acceptable for my Irish passport renewal and each photo failed every time. I had given up when I found you online and when I received my photo it was accepted first time I uploaded it. Now my passport will not expire. Thank you so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clarence Harris",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T05:43:11.000Z",
          "Titre": "Get Passport pictures that work with Foreign Gov websites",
          "Contenu": "I tried getting my Evisa for Kenya and failed four times due to errors with my passport picture size and photo. In frustration, I sent my picture to your company. The expert determined the photo would not work and got back to me immediately and ater the second try I received my photo to upload to the Kenyan government site. It worked first time!  I am very appreciative of the outstanding service and the extremely affordable pricing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MG",
          "Nb_Reviews": 2,
          "Date": "2023-03-16T23:22:34.000Z",
          "Titre": "Simple and Quick",
          "Contenu": "Simple, Quick and extremely helpful.Good customer support.I was not happy with the first copy sent to me (prob was with the lightning in the original picture itself) ..They asked me to send another one over mail and regenerated a compliant copy.No issues printing them.What else do you neeed !!! Super Happy."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Trembovetska Tetiana",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T12:16:04.000Z",
          "Titre": "Yes the company was helpful and…",
          "Contenu": "Yes the company was helpful and everything went very easy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Spivey",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T03:29:32.000Z",
          "Titre": "I was frustrated trying to do my visa…",
          "Contenu": "I was frustrated trying to do my visa photo by myself and it kept getting rejected. Then I tried my passport photos and in 5 minutes they had it done and the photo was excepted. Thanks passport photo!!! I will definitely use you again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rosa T",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T16:01:17.000Z",
          "Titre": "Recommend!",
          "Contenu": "They reached out when they thought the picture I provided would not pass passport standards! Really appreciate that since we were doing this to prepare for an upcoming trip. And this service was cheaper than taking pictures at my local Walgreens. Recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jill h.",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T23:36:09.000Z",
          "Titre": "Fantastic",
          "Contenu": "Fantastic! When the picture wasn’t the quality needed they responded immediately and fixed it right away. Even fixed my husbands picture to the same specifications when they saw his order come in. Very very helpful and would definitely use again!"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Kenneth",
          "Nb_Reviews": 2,
          "Date": "2023-08-22T15:35:01.000Z",
          "Titre": "Speed of return and the fact that when…",
          "Contenu": "Speed of return and the fact that when there was issues with the uploaded pictures they immediately let me know so there was zero delay"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Barnes",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T15:44:00.000Z",
          "Titre": "I’m pleasantly surprised by how easy…",
          "Contenu": "I’m pleasantly surprised by how easy this process was. I didn’t have to run around to get my photo taken, find the proper form, go to the post office, etc.Good, timely communication and tracking throughout. I felt the fee was definitely worth the money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 2,
          "Date": "2023-04-14T21:32:35.000Z",
          "Titre": "You made it easy to produce a compliant Passport Photo",
          "Contenu": "You made it very easy to produce a compliant photo from home.  I so appreciate your coaching on my improper version, and the touch-up work on the background of my ultimate photo.  I sent your PDF to Staples, who easily printed the photo for my application."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WE",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T05:27:43.000Z",
          "Titre": "Easy to use and provided helpful…",
          "Contenu": "Easy to use and provided helpful information."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tibby",
          "Nb_Reviews": 2,
          "Date": "2023-05-17T14:42:45.000Z",
          "Titre": "Great experience",
          "Contenu": "It was quick, painless, and tailored to the type of photo I need. I wish I had done the entire VISA application, but I started at the country’s website before I knew IVISA existed. Well done!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JANET D.",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T13:11:08.000Z",
          "Titre": "Prompt Service",
          "Contenu": "My requested photos are in special dimensions. I’m very impressed by their prompt responses and quality of work. I picked up my pictures from Walgreen. The cashier at Walgreen said that they charge even more than what I have to pay."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gillian Pearce",
          "Nb_Reviews": 5,
          "Date": "2023-01-27T22:20:32.000Z",
          "Titre": "Visas Made Easy",
          "Contenu": "Application for my husband’s visa was so easy, clear and concise ! Having used another company to complete my visa - the difference was amazing ! The process was much clearer and concise - also, if problems occurred, help was readily and easily available. Excellent company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wayne Martinez",
          "Nb_Reviews": 3,
          "Date": "2023-07-23T15:43:34.000Z",
          "Titre": "Excellent Service",
          "Contenu": "Sent the photo and within minutes I received a confirmation email. I had to re-take the photo and I received instructions on how the photo should be taken. The photo is perfect. Thank you. I highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David Jory",
          "Nb_Reviews": 2,
          "Date": "2023-06-14T19:13:56.000Z",
          "Titre": "Excellent ,,⭐⭐⭐⭐⭐",
          "Contenu": "Excellent ,,⭐⭐⭐⭐⭐They really did go above and beyond to provide a great service.Always replied quickly to my messages. Superb value for money.Highly Recommend 👍"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Fiona Crehan",
          "Nb_Reviews": 6,
          "Date": "2023-06-06T12:18:41.000Z",
          "Titre": "The ivisa app was easy to use",
          "Contenu": "The ivisa app was easy to use, Including selecting the country you live and the one you want to get a visa to enter. The photos were then tailored for the visa requirements. I got a response with my photo emailed in less than an hour."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jody",
          "Nb_Reviews": 13,
          "Date": "2023-04-18T20:31:43.000Z",
          "Titre": "Very good and quick service",
          "Contenu": "Very good and quick service! Got visa approved even though I’d taken a selfie photo against the white wall - they told me my first photo wouldn’t work but sent me a response very quickly and the 2nd photo got me my visa within days!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lyna",
          "Nb_Reviews": 2,
          "Date": "2023-06-05T15:02:16.000Z",
          "Titre": "Convenient option to get a passport…",
          "Contenu": "Convenient option to get a passport photo. Very quick to do adjustments and ship. I didn’t have to try to find somewhere to get a photo taken. I could retake until I was happy. No more bad passport photos!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KG",
          "Nb_Reviews": 4,
          "Date": "2023-08-04T13:22:09.000Z",
          "Titre": "So easy and great to run by an expert…",
          "Contenu": "So easy and great to run by an expert so you know that the photo that you’re using will be excepted for your passport. It was quick and I was able to get my paperwork off. Thank you so much for all your help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sarah webb",
          "Nb_Reviews": 2,
          "Date": "2023-06-04T22:25:15.000Z",
          "Titre": "Other sites repeatedly reject",
          "Contenu": "I used a different website first to create my passport picture and they kept rejecting it. I used the same picture on iVisa and they accepted it on the second try!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M B",
          "Nb_Reviews": 2,
          "Date": "2023-03-17T17:36:18.000Z",
          "Titre": "So fast and easy!",
          "Contenu": "So fast and easy!! I used this company a few years ago and again last week. It's so nice to see a company continue excellent customer service. Will continue to use!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Richards",
          "Nb_Reviews": 3,
          "Date": "2023-01-13T02:40:31.000Z",
          "Titre": "Application was easy to use and…",
          "Contenu": "Application was easy to use and appreciated that it gave me tips and wouldn’t take the picture if I smiled too much. Pictures came quickly. All in all a good experience."
        },
        {
          "Note": 5,
          "Lieu": "VI",
          "Pseudo": "Tim Sherry",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T00:34:52.000Z",
          "Titre": "Received photos within a few days and…",
          "Contenu": "Received photos within a few days and I’m in the Caribbean! As long as the passport people like the photo this will have been a great experience!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela Heithaus",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T00:46:07.000Z",
          "Titre": "I was very impressed with the service",
          "Contenu": "I was very impressed with the service!  I was back and forth several times with your team and they were most helpful in fulfilling my requests quickly!  I’m so grateful for your assistance!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pieter Johannes Zeelie",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T15:37:17.000Z",
          "Titre": "Great service",
          "Contenu": "The photo was uploaded and done within 24 hours. The price was half of what a post office charges. Thank you for a great service"
        },
        {
          "Note": 5,
          "Lieu": "SO",
          "Pseudo": "Abdikarin mohamud ibrahim",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T15:27:44.000Z",
          "Titre": "there characters",
          "Contenu": "Thank you very much for your email, next time I am a business person with university education, once again thank you all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leah Greene",
          "Nb_Reviews": 8,
          "Date": "2023-02-20T00:23:57.000Z",
          "Titre": "Easy & Cheaper than doing it at the store",
          "Contenu": "So easy to do and not having to leave the house! Mostly I could continually take a new picture and after like the 7th retake I  realized it’s not the picture it’s me, lol I am so old looking."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DM",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T18:41:46.000Z",
          "Titre": "Perfect service from start to delivery…",
          "Contenu": "Perfect service from start to delivery and an easy website to navigate. I'm pleased with the quality of the photo prints. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Feifei Yeung Lopez",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T15:17:47.000Z",
          "Titre": "They made several suggestions to make…",
          "Contenu": "They made several suggestions to make sure my photo was perfect.  They answered my emails within 24 hours!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Thompson",
          "Nb_Reviews": 3,
          "Date": "2023-01-18T11:43:23.000Z",
          "Titre": "Went the extra mile!!",
          "Contenu": "Very fast service, and help when you need it to assure a good picture. The Post Office lost mine during the winter storms and these folks got replacements to me ASAP. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Claire L",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T21:29:33.000Z",
          "Titre": "Everything was great I had issues with…",
          "Contenu": "Everything was great I had issues with submitting a good photo but the team corrected it and I'm pleased with the results thanks for your assistance 😊"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Caroline Willard",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T18:07:39.000Z",
          "Titre": "It was very easy to use that app and…",
          "Contenu": "It was very easy to use that app and the instructions were great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gene Riley",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T20:09:26.000Z",
          "Titre": "Photos",
          "Contenu": "This was the absolute best thing to help with Passports, and renewals. Strongly recommend their services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bonnie Sherman",
          "Nb_Reviews": 3,
          "Date": "2023-08-21T20:34:48.000Z",
          "Titre": "Easy process",
          "Contenu": "Easy process, photos ordered 5pm on sunday, ready for pickup Monday morning."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alain Galeba",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T19:27:05.000Z",
          "Titre": "Had some issues on my side for correct…",
          "Contenu": "Had some issues on my side for correct presentationWhich were quickly reolved by your staff"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ana Gladis Contreras",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T00:07:17.000Z",
          "Titre": "They made the process of applying for a…",
          "Contenu": "They made the process of applying for a travel visa a lot easier and their customer service was very helpful. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Helen W Strouphauer",
          "Nb_Reviews": 3,
          "Date": "2023-02-26T21:29:56.000Z",
          "Titre": "Great job in getting the work done and…",
          "Contenu": "Great job in getting the work done and also answering the questions I had on related subjects after the fact."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kacey Cawley",
          "Nb_Reviews": 3,
          "Date": "2023-01-27T15:27:02.000Z",
          "Titre": "Made everything turn key",
          "Contenu": "Made everything turn key. Even reached out when they felt my passport photo needed to be edited. It was a simple re-upload and super fast turnaround."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T13:15:08.000Z",
          "Titre": "I like the ability to have an expert…",
          "Contenu": "I like the ability to have an expert review the picture to make sure it won’t be rejected, especially with having a toddler who can’t sit still long enough to get anything clear and is worse with strangers trying to take her picture."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LHB",
          "Nb_Reviews": 2,
          "Date": "2023-01-13T16:32:58.000Z",
          "Titre": "Very fast",
          "Contenu": "Very fast, efficient and so much better than trying to use the on line Dept. of State website. I will continue to use this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "IMELIN C",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T23:27:42.000Z",
          "Titre": "Quick and so efficient",
          "Contenu": "Quick and so efficient. Cuts the time of actually finding a place to take a picture. Can do it from home and they print and send it to you that every day. Takes 2-3 days to get it. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Mullen",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T00:44:16.000Z",
          "Titre": "Good job, Kenya",
          "Contenu": "Great, if extensive, website with a fast, easy turnaround to correct a mistake. Good Job, Kenya."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DM",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T17:59:46.000Z",
          "Titre": "A hassle free experience!",
          "Contenu": "A hassle free experience getting an India compliant Visa photo. I highly recommend this service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory Gardner",
          "Nb_Reviews": 2,
          "Date": "2023-08-28T15:35:31.000Z",
          "Titre": "Great service with quick accurate…",
          "Contenu": "Great service with quick accurate response. Will use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SAMANTHA THORSON",
          "Nb_Reviews": 2,
          "Date": "2023-07-07T13:59:15.000Z",
          "Titre": "Quick and professional service",
          "Contenu": "I needed a passport photo sent digitally. The process was quick, easy and inexpensive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rob Craft",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T05:26:48.000Z",
          "Titre": "Online capability",
          "Contenu": "Online capability, with shipping is the best route for busy people like myself."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ARL",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T04:07:15.000Z",
          "Titre": "Quick and reliable service",
          "Contenu": "Service was quick and reliable. Photos came out as expected and was able to get them within a week."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antiequa Harper",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T13:28:36.000Z",
          "Titre": "Amazing service",
          "Contenu": "Amazing service. I was able to use my own picture and have the perfect passport photo that will worl with no issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J. G.",
          "Nb_Reviews": 4,
          "Date": "2023-02-04T21:22:31.000Z",
          "Titre": "Very Fast Return",
          "Contenu": "I couldn't believe how fast I received my digital photo. They said approx. 4 hs...it was about 20 minutes!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lana",
          "Nb_Reviews": 4,
          "Date": "2023-04-19T23:42:20.000Z",
          "Titre": "Would definitely recommend!",
          "Contenu": "The photo quality was great and they came right on time. We used them to print the passport photos of our 9 month baby that we took at home. We are so grateful for this service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicole C.",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T21:24:23.000Z",
          "Titre": "They delivered my digital photo within…",
          "Contenu": "They delivered my digital photo within a few hours and it was approved right away for my online passport renewal."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Berenice",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T21:45:57.000Z",
          "Titre": "You were so helpful",
          "Contenu": "You were so helpful. Every time I sent a incorrect photo you walked me through the issues and shared links on how to get it right! Thank you for your patience!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick G",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T22:44:33.000Z",
          "Titre": "So easy and quick",
          "Contenu": "So easy and quick. I ordered on a Friday, they shipped the same day, and I received them the following Wednesday."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Y",
          "Nb_Reviews": 2,
          "Date": "2023-07-05T00:14:27.000Z",
          "Titre": "Easy to set up, quick turnaround",
          "Contenu": "Easy setup process. The photo guideline image was great so that I only needed to take a single photo to send over. Quick turnaround all things considered. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ying Zhu",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T00:31:01.000Z",
          "Titre": "IVisa helped streamline the entire…",
          "Contenu": "IVisa helped streamline the entire process: size spec; tips on selfie; and printing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebecca E.",
          "Nb_Reviews": 2,
          "Date": "2023-04-27T16:40:28.000Z",
          "Titre": "The review process ensured my photo…",
          "Contenu": "The review process ensured my photo would work for US Passport guidelines."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Suzanne",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T02:50:54.000Z",
          "Titre": "The representative worked with me…",
          "Contenu": "The representative worked with me through several iterations to make sure I had the photo just right, then corrected the color, cropped, and sized it to meet all the country requirements."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Traci",
          "Nb_Reviews": 3,
          "Date": "2023-09-03T22:22:16.000Z",
          "Titre": "Quick easy and lots cheaper than other…",
          "Contenu": "Quick easy and lots cheaper than other options"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jorge Herrera",
          "Nb_Reviews": 2,
          "Date": "2022-11-03T18:23:50.000Z",
          "Titre": "Quick",
          "Contenu": "Quick, effective and professional. The size and editing of the pictures was exactly what was needed!"
        },
        {
          "Note": 5,
          "Lieu": "OM",
          "Pseudo": "Mohammad akbar Ali",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T18:56:43.000Z",
          "Titre": "I Interesting for visiting abudabi and…",
          "Contenu": "I Interesting for visiting abudabi and saudi. This tow country good loking and good place."
        },
        {
          "Note": 5,
          "Lieu": "AR",
          "Pseudo": "Valeria Natalia villalba",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T13:12:19.000Z",
          "Titre": "It’s so easy and fast",
          "Contenu": "It’s really fast and efficient"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Anne",
          "Nb_Reviews": 4,
          "Date": "2023-02-05T07:31:43.000Z",
          "Titre": "Easy!",
          "Contenu": "The process was very easy and the photos came back within 4 hours as promised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Y.",
          "Nb_Reviews": 3,
          "Date": "2022-11-07T22:09:19.000Z",
          "Titre": "Quick return",
          "Contenu": "Had to retake and resubmit my photo, but once the specs were met the pics came back quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ann Komura",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T23:12:41.000Z",
          "Titre": "The response time was great",
          "Contenu": "The response time was great.  Got my documents done at home...didn't need to leave to take picture."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Grace Ipigbe",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T23:06:55.000Z",
          "Titre": "This  company is  perfect  I  come…",
          "Contenu": "This  company is  perfect  I  come across  them  and I  went through  there instruction  followed and took my photo  within  two minutes  I  received  a message within another  fifteen minutes  my photo was ready sent to me  put it into my visa application and it was received perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy Paxton",
          "Nb_Reviews": 2,
          "Date": "2023-01-26T14:11:20.000Z",
          "Titre": "Using the service was quick and easy",
          "Contenu": "Using the service was quick and easy, and a heck of a lot cheaper than going to the drugstore. They charge $20."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vijay kumar",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T13:59:41.000Z",
          "Titre": "very user friendly",
          "Contenu": "very user friendly.  Easy to use for people with less computer experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sumit",
          "Nb_Reviews": 2,
          "Date": "2023-01-07T21:14:14.000Z",
          "Titre": "The website was easy to use",
          "Contenu": "The website was easy to use. Great service and received the photos on time without any issues."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Mmesoma",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T23:03:06.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience! Liked the quick feedback!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe White",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T17:35:08.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, supper price.   Entire process took less than 2 hours."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katie",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T04:31:58.000Z",
          "Titre": "Super easy and pick up of photos was…",
          "Contenu": "Super easy and pick up of photos was seamless."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Y. C.",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T01:15:25.000Z",
          "Titre": "Really fast turnaround",
          "Contenu": "Photos came much faster than I expected and they were perfect."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "A Batten",
          "Nb_Reviews": 3,
          "Date": "2023-10-31T14:42:31.000Z",
          "Titre": "Quick helpful and met expectations"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Constance",
          "Nb_Reviews": 2,
          "Date": "2022-12-09T02:04:56.000Z",
          "Titre": "The Best Service …",
          "Contenu": "The instructions and screen shots were very help and the wonderful turn around,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shirley Willams",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T16:38:48.000Z",
          "Titre": "The fact that I could control how my…",
          "Contenu": "The fact that I could control how my pic looks with lighting and able to take pic at home."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RB",
          "Nb_Reviews": 2,
          "Date": "2023-01-06T18:17:40.000Z",
          "Titre": "They did an excellent job",
          "Contenu": "They did precisely what they said they would and did it well. This is the second time I’ve used them and have been very satisfied both times."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Brian Wood",
          "Nb_Reviews": 2,
          "Date": "2023-06-27T01:37:50.000Z",
          "Titre": "Found on Google search",
          "Contenu": "Found on Google search,  did exactly what I wanted at very low cost and in a very short time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Cangemi",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T15:39:59.000Z",
          "Titre": "Easy to use; fast response",
          "Contenu": "Easy to use app; fast customer service response"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra Doyle",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T01:31:26.000Z",
          "Titre": "This made it so easy",
          "Contenu": "This made it so easy.  I did not have to drive anywhere and the photos are the correct size for my purposes."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "DANIEL",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T14:54:02.000Z",
          "Titre": "A fast and reliable service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandi",
          "Nb_Reviews": 7,
          "Date": "2023-02-28T23:50:22.000Z",
          "Titre": "Very easy process and very quick",
          "Contenu": "Very easy process and very quick.  If you can print photos it's a great deal.  Still saves you about $5 even if you have to pay for someone else to print the photos."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Antonia Edward",
          "Nb_Reviews": 5,
          "Date": "2023-04-13T18:34:04.000Z",
          "Titre": "Excellent service in minutes!",
          "Contenu": "Excellent service in minutes!Would definitely use them again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carolyn",
          "Nb_Reviews": 3,
          "Date": "2023-06-29T03:27:27.000Z",
          "Titre": "Highly recommend",
          "Contenu": "Fast shipping, high quality, easy to use website!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JCL",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T05:44:37.000Z",
          "Titre": "Our photos arrived in a timely manner…",
          "Contenu": "Our photos arrived in a timely manner and are as promised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Woody Benson",
          "Nb_Reviews": 2,
          "Date": "2022-12-08T23:10:57.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience. They worked with us to get desired result."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 5,
          "Date": "2023-08-05T18:12:09.000Z",
          "Titre": "Super fast",
          "Contenu": "Super fast, this photo was as expected"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth Gray",
          "Nb_Reviews": 8,
          "Date": "2022-12-08T20:21:23.000Z",
          "Titre": "It was an easy experience and saved me…",
          "Contenu": "It was an easy experience and saved me time and gas. They delivered very quickly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T04:04:54.000Z",
          "Titre": "Super helpful",
          "Contenu": "easy to use and photo was actually accepted."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sumanth",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T15:24:42.000Z",
          "Titre": "Fast response",
          "Contenu": "Fast response, got my photos earlier than expected, great service"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "James Mccrave",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T17:06:06.000Z",
          "Titre": "Very good to deal with and the passport…",
          "Contenu": "Very good to deal with and the passport requirements where spot on"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Blandon law-Landaverde Law Lan",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T15:39:50.000Z",
          "Titre": "the fast responsive service",
          "Contenu": "the fast responsive service. great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rhoda",
          "Nb_Reviews": 2,
          "Date": "2023-06-23T17:12:58.000Z",
          "Titre": "Super simple!",
          "Contenu": "Super simple, good review process, quick turnaround"
        }
      ]
    }
  ]
}