{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "myticktalk.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JD",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T16:15:49.000Z",
          "Titre": "DO NOT TRUST REVIEWS AFTER ONLY 5 TIMES USED THE WATCH WONT TURN ON",
          "Contenu": "All of the reviews are after immediately receiving the watch. Which at first it was great. I bought this watch 13 months ago with a 1 year warranty. So of course I am ONE month over the extended warranty. My son has only used this watch FIVE times on field trips. The watch is in excellent condition zero damage. It will not turn on. I charged it for an hour tried different outlets and charging bases and still nothing. I am reading this is a common issue and that’s why they have it on their FAQ and for returns. For the price I should definitely get more then 5 uses out of it. He is going on a trip today and I had planned on him wearing it and now we’re stuck with nothing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eugene Baldrate",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T02:09:54.000Z",
          "Titre": "You sent me a new charging cord",
          "Contenu": "You sent me a new charging cord, but you sent it to the billing address rather than the one that I directed you to'  It was supposed to go to my grandsons address so that he had communication when he is home alone.  The final insult is you changed me $50 to send the charging cable to the wrong address.  You should refund that to me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TijanaS",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T15:30:36.000Z",
          "Titre": "kids GPS watch",
          "Contenu": "kids GPS watchI bought this watch in June 2023 and returned it after two weeks. My little one was sitting by my side when checking accuracy; however, on my app, it was showing her 3-4 miles away. I tried to get some help from customer support, but it didn't work. I got tired of making something that expensive work, and in the end, I returned the product.However, along with the product itself, you need to buy a monthly plan, and that is fine. The thing is, if you decide to return the product, remember to cancel that plan. It has been showing on my account for the last four months, and when I tried to dispute it, the merchant replied that I signed the terms and conditions.That is very convenient; if you disagree with the terms and conditions, you can't use the product, right? 😊😆 Anyways, beware of these merchant tricks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jill Hillemeyer",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T19:00:35.000Z",
          "Titre": "DO NOT PURCHASE THIS WATCH",
          "Contenu": "DO NOT PURCHASE THIS WATCH. I was so excited to purchase these watches for my kids for Christmas and wish we had purchased something else. The watch band keeps breaking on my daughters watch and they admitted that the watch bands are faulty. They said they are willing to replace the item each time it breaks since they know it is faulty, but they will not replace if it ever gets lost. Even though they know the bands are faulty and break. On top of that, the GPS was off by two cities and they said they can update the server but can't promise the GPS will be accurate. I am so disappointed in these watches and my experience with customer service. These were an investment for my family."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GARY P TONE",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T17:19:32.000Z",
          "Titre": "the band broke off the watch a couple…",
          "Contenu": "the band broke off the watch a couple months after i bought it. i had also purchased the warranty. but they will not replace the band cause it's not covered under the warranty."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Emmilynn",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T23:30:16.000Z",
          "Titre": "GPS fail",
          "Contenu": "I was really excited about this watch, but had to return it and go with something else. My son has autism, and has recently started to elope, so we needed something with gps that would work. Unfortunately, the gps was very inaccurate, and would tell us he was several miles away when he would literally be sitting right next to me. Other than the inaccuracies of the GPS, I liked everything else about the watch. Lol."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cassie Limas",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T02:12:12.000Z",
          "Titre": "Always connecting to server",
          "Contenu": "Always connecting to server. I've had this watch for a week and haven't been able to text my kid once. Very disappointing that she can only text me, as her dad cannot even login for some reason. And I can't even receive the texts. She should be able to text any of her contacts. Her family shouldn't have to download an app that doesn't work anyway. Exploring other options and will likely return this product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laura Karpinski",
          "Nb_Reviews": 3,
          "Date": "2023-05-30T17:19:39.000Z",
          "Titre": "Purchased the TIck Talk 4 for my sons…",
          "Contenu": "Purchased the TIck Talk 4 for my sons birthday, the main reason i bought the watch was for the location tracking feature. We live in Oregon and the watch shows its location as being in Southern California. I did a watch reset and it has not improved."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Melissa Kidrowski",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T01:44:10.000Z",
          "Titre": "Poor product and customer service, beware",
          "Contenu": "Or watch quite working correctly a few months after getting it. Tried to get a replacement one under warranty, then the replacement watch was defective! Go to find out that there is a big batch of defective watch bands being shipped out to people knowingly by the staff, when they say 90% chance the band will be broken that's concerning. Knowledge of selling items that may not work in area. Staff also contradicts themselves when saying what is wrong with the product. Customer service was not good along with they make you pay deductible for the replacement (even after you already did a deductible)--even when they have to replace their defective watch, an error on their side. Very disappointed in how customer service handled things. When asked to take to the manager, it was the manager I was talking to!"
        },
        {
          "Note": 1,
          "Lieu": "BH",
          "Pseudo": "Ali Alsayed",
          "Nb_Reviews": 2,
          "Date": "2023-09-05T09:47:35.000Z",
          "Titre": "The watch doesn't work!!!",
          "Contenu": "The watch doesn't work! Extremely low cellular reception. Doesn't place calls. Support are not responsive. Money down the drain!!!"
        },
        {
          "Note": 1,
          "Lieu": "BH",
          "Pseudo": "Ali Alsayed",
          "Nb_Reviews": 2,
          "Date": "2023-09-05T09:46:53.000Z",
          "Titre": "The watch doesn't work!!!",
          "Contenu": "The watch doesn't work! Extremely low cellular reception. Doesn't place calls. Support are not responsive. Money down the drain!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "S Weber",
          "Nb_Reviews": 2,
          "Date": "2023-02-20T20:06:18.000Z",
          "Titre": "CANNOT TEXT WITH THIS WATCH WITHOUT A SPECIAL APP",
          "Contenu": "Very disappointed that you can not text with this app unless you have the TickTalk app. This was NOT made clear in any of their advertising. We will be returning for a watch with true texting capabilities."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T02:49:17.000Z",
          "Titre": "Everything has gone wrong from Day 1…",
          "Contenu": "Everything has gone wrong from Day 1 with Tick Talk. We are now on our third defective watch in a year and a half. It is a crappy product. Both technical and physical defects. And the customer service sucks too. This is a terrible company and you should stop selling this product immediately."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jessica johnson",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T21:25:38.000Z",
          "Titre": "Watch broke within a week",
          "Contenu": "Watch broke within a week! We had 2 previously that broke in the same exact spot and customer service said I had to pay 100$ each to replace and have no warranty. So bought 2 more with extended warranty and sure enough SAME EXACT place it broke. So round and round we go. Something very fishy with the quality."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AR",
          "Nb_Reviews": 3,
          "Date": "2023-07-18T22:55:22.000Z",
          "Titre": "Company is Refusing a Refund Offer",
          "Contenu": "I have been in contact with customer service to get the refund you publicly offered me as a response to my review in March. I continued to try to get the watch to work and it has not.  I am now being denied the refund, quoting me that I had 30 days to respond to the offer of a refund when that was not included anywhere.  There have been over 80 emails with your service to determine the app not notifying issue with Android, which you put an alert out for, and now to attempt to get the refund that you offered me but are now refusing to give me.  Unfortunately this company does not have a watch that will notify of texts on android and further say one thing publicly and another when I try to get a refund. I would never do business with this company again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AR",
          "Nb_Reviews": 3,
          "Date": "2023-07-17T13:55:06.000Z",
          "Titre": "Watch Does Not Notify - Customer Service Issues",
          "Contenu": "UPDATE: No one has reached out to me so far.  Can I please just have a refund?I have attempted to get a refund for my watch that does not work due to not notifying me of texts and I'm being told by support that because I waited to long after the \"offer\" of a refund was made I cannot get the refund any longer. I have attempted to make this watch work for an additional 4 months so that my son could call his grandparents, etc and it is just not working.  We have exhausted all avenues of trying to get it to work and I am asking for the refund that was offered to me.  No where did anyone say there was a time in which I needed to respond to get the refund offered to me in a response to my review.  The watch does not notify of texts on androids and i've missed several important ones from my son.  Too many now have added up over the last 6 months of owning the watch that I just want a refund. A replacement will not fix the problems I've had with the watch."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 4,
          "Date": "2023-06-12T21:13:01.000Z",
          "Titre": "the product did not work properly and is garbage",
          "Contenu": "the product did not work properly. the instructions to set it up were inadequate and confusing--AND even when I tried for hours, it did not work.long after the fact - when it was too late and i had cancelled the service and arranged for my two watches to be returned - they sent a message offering to help.  way too little and way too late.  the customer service is abysmal and the product does NOT work well.  avoid like the plague."
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "World of Melissa",
          "Nb_Reviews": 3,
          "Date": "2023-06-03T02:26:56.000Z",
          "Titre": "I made an order and closed the order…",
          "Contenu": "I made an order and closed the order within 12 hours as they said that the watch would not work in Canada and they did not refund the entire amount of the order, although I sent them a screenshot of how much they took from my account and how much they returned, but they keep saying that I was wrong. I do not advise anyone to buy this watch, because if there are problems in the future, they will simply ignore you and not return the full amount."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Harlin Sun",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T00:07:18.000Z",
          "Titre": "Every time I call the customer service",
          "Contenu": "Every time I call the customer service, I have to repeat the same thing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "New Phase",
          "Nb_Reviews": 1,
          "Date": "2022-12-26T15:46:52.000Z",
          "Titre": "Doesn't work on att services so never…",
          "Contenu": "Doesn't work on att services so never got turned on and after just letting a brand new watch sit for some months now it won't turn on or take a charge. Wasted 200 dollars..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Kovaleff",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T03:03:09.000Z",
          "Titre": "I ordered the watch as a gift",
          "Contenu": "I ordered the watch as a gift, chatted with customer service online, and was told that if I paid for overnight it would arrive by the next day. I was called a couple of hours later and was told that it did not ship in time and would arrive the second day. It did arrive and would not activate. I was told to wait until the morning which I did. It did not activate by next morning, now 3 days behind on gift giving, and was told to call back at 5 if it did not activate. It did not activate and I was told to wait until the next morning, which I did and it still did not activate. I told the rep that I no longer wanted the phone. I was ultimately refunded everything, including the overnight shipping costs. I liked the concept of the watch but never got it to work. On a side note, the size of the watch was rather large. I ended up buying an Apple Watch SE which activated within a few minutes."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AR",
          "Nb_Reviews": 3,
          "Date": "2023-03-01T23:47:45.000Z",
          "Titre": "0 stars if I could...",
          "Contenu": "I have edited my review down to 1 star as the app is not notifying me of texts/communication from my son. I have always had the appropriate settings on my Android that TickTalk referenced in communication on February 16, 2023 (I've had these settings correct on my phone since December 2022). I notified TickTalk of this issue on January 31, 2023. They refused to help me as I couldn't take a video of my phone not getting notified from the watch.  I emailed again a week later as the issue was continuing. Since then I've had 53 emails back and forth with Support. Now they are asking for screenshots of the phone not having notifications. I have provided screenshots and a video of the app not notifying. I have provided all information from my phone and the watch and they ignore my requests for a resolution date. I am thoroughly disappointed in TickTalk - the very reason for the watch is to be able to communicate with a child. I can't communicate with them unless I refresh the app every hour to make sure I didn't miss a message.  Support has been completely unhelpful and the watch itself is a timekeeper at this point."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "prescilla orozco becerra",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T00:48:48.000Z",
          "Titre": "Activated February 28th still not…",
          "Contenu": "Activated February 28th still not service on the watch. I might just return it. I like the concept but to be charged for my service I paid March 1st and I still don’t have the service for my son. Besides him being on wifi. Could be better for the price."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aidar Artykbayev",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T20:31:00.000Z",
          "Titre": "The location of the child shows the…",
          "Contenu": "The location of the child shows the location of a different state which is Texas not Florida."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T00:01:50.000Z",
          "Titre": "Why can't I buy the god damn charger…",
          "Contenu": "Why can't I buy the god damn charger without spending $20? you guys suckEdit: a workaround? F off. You decided to not sell them so you could sell a higher margin charging base. It's anti customer. You make enough money on the watches and the deals with cell providers. Just be honest. You think people will put up with it so you don't care. The charger base is a cable with cheap plastic around it. Stand by your decision to be greedy, but don't also be a weasel about it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carrie White",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T01:22:09.000Z",
          "Titre": "The GPS is inaccurate",
          "Contenu": "The GPS is inaccurate. It shows that my son is in a different location than he is. And it’s spotty at best service. Thinking of returning it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "L L",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T22:16:40.000Z",
          "Titre": "The wristband cannot be changed for a…",
          "Contenu": "The wristband cannot be changed for a bigger size, and it digs into my wrist. This is the only smart watch I know of where the wristband cannot be changed. You put the antenna in the wristband and the watch is already as big as it is 😆. Now I have to return it, the warranty, and accessories. Waste of time and money 👎"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julia",
          "Nb_Reviews": 2,
          "Date": "2022-10-04T04:24:32.000Z",
          "Titre": "was so hopeful, but so disappointed",
          "Contenu": "was so hopeful, but this is the most disappointed I’ve been with a product in a long time. In the first month there were numerous times the watch was suddenly offline, would not turn on for days at a time, or needed the SIM card to be reinserted suddenly.I bought the warranty to be safe. On day 38 the watch would not turn on, would not respond to charge, nothing. At this point, I just want a return because it has failed me and my kid in too many important moments, once where he was hurt and couldn’t call me, and had to run home sobbing. They said I’m outside my return window and gave me some (seemingly bogus and cumbersome) instructions as to “reboot” which did not work. It’s been 30-some days and the watch has failed in MULTIPLE different ways, at least 5-7 times (which is a lot since it’s only worn after school on some days) and now it is completely dead. Useless. The gps was never helpful and often times just reported to the nearest cell tower, which of course is not helpful. For a $200 product that fails completely on day 38… or even in the first year! and the customer service to basically say, woops, sorry!, that seems like a scam to me, so without warranty, I can only imagine how many completely out of luck with a bad product and no remedy. Hopefully, they honor the warranty at least for a replacement, but I honestly would feel bad even selling this to another parent. I’m bummed, but if they would honor my return (for my watch under warranty), I would feel like they were at least trying to service their customers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kelly Wahl",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T03:28:03.000Z",
          "Titre": "Not durable! Son hated it",
          "Contenu": "I bought this watch for my 9 year old son. He is a typical boy and he rides his quad and dirt bike. This watch was specifically to keep track of him. First he went trailing and of course he had no service at all. So I couldn’t track him. He wore the watch for a couple of weeks and both chargers ended up breaking. We then realized that we needed to move him to a different device since it was accurate and he started to hate it. I reached out to customer service and they said yes return it for a refund. I sent everything back except one charger because we threw it away. The other charger I sent back even though it was broken also. I sent back the watch, which worked just fine when we sent it back. I also sent the charms and everything that came with our order. Customer Service told me they cant send me a refund because the watch was damaged. I know that watch worked when I sent it. I personally powered it off when returning it. However this was supposed to be a 100% money back guarantee and a $30 fee for damaged product…. Which the chargers were damaged. They use their terms lightly. 100% money back guarantee is a fraud. This is a KIDS watch. It wont look perfect if a child had worn it. I wont recommend this product to anyone. I have a younger child that will not be getting one these either. Im extremely disappointed about how they handled this… and NO I dont want a replacement. This product ended up not working out and not being durable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julia",
          "Nb_Reviews": 2,
          "Date": "2022-10-04T04:21:15.000Z",
          "Titre": "I was so hopeful, but so disappointed",
          "Contenu": "I was so hopeful, but this is the most disappointed I’ve been with a product in a long time. In the first month there were numerous times the watch was suddenly offline, would not turn on for days at a time, or needed the SIM card to be reinserted suddenly.I bought the warranty to be safe. On day 38 the watch would not turn on, would not respond to charge, nothing. At this point, I just want a return because it has failed me and my kid in too many important moments, once where he was hurt and couldn’t call me, and had to run home sobbing. They said I’m outside my return window and gave me some (seemingly bogus and cumbersome) instructions as to “reboot” which did not work. It’s been 30-some days and the watch has failed in MULTIPLE different ways, at least 5-7 times (which is a lot since it’s only worn after school on some days) and now it is completely dead. Useless. The gps was never helpful and often times just reported to the nearest cell tower, which of course is not helpful. For a $200 product that fails completely on day 38… or even in the first year! and the customer service to basically say, woops, sorry!, that seems like a scam to me, so without warranty, I can only imagine how many completely out of luck with a bad product and no remedy. Hopefully, they honor the warranty at least for a replacement, but I honestly would feel bad even selling this to another parent. I’m bummed, but if they would honor my return (for my watch under warranty), I would feel like they were at least trying to service their customers."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "HUGO LEAO DOS SANTOS",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T10:27:39.000Z",
          "Titre": "Very disapointed",
          "Contenu": "Very disapointed, i ordered with the Tock Talk watch a Tick Talk Power base, the Power base was not delivered."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amber West",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T20:16:18.000Z",
          "Titre": "Did not work",
          "Contenu": "Watch would not recognize SIM card had to return."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Katie Cutcher",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T00:23:57.000Z",
          "Titre": "They won’t answer the phone",
          "Contenu": "They won’t answer the phone, or respond to emails. GPS is inaccurate"
        },
        {
          "Note": 1,
          "Lieu": "QA",
          "Pseudo": "ISSA",
          "Nb_Reviews": 2,
          "Date": "2022-10-07T04:29:57.000Z",
          "Titre": "No repair",
          "Contenu": "In general good product but no Auto WiFi reconect.Can't be repair ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Yanjun Gan",
          "Nb_Reviews": 2,
          "Date": "2023-01-11T00:22:36.000Z",
          "Titre": "The watch cannot be charged in less…",
          "Contenu": "The watch cannot be charged in less than half a year.  As a children's watch, it's price is not cheap, but the quality is really poor!"
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "Lin MA",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T00:57:41.000Z",
          "Titre": "Terrible Quality and Poor Customer Service",
          "Contenu": "Summary of a long review: if you are outside of the US, don't buy from them. The bands broke within a couple of months, and they will not honor their warranty for international buyers who purchased from Amazon, despite the stated warranty policy on their own website. The current state of the product: my defective watch is still with them, and they still insist on charging me $100 to replace it. I am still in the middle of frustrating email exchanges with their customer support. Parents, if you don't want to be in my shoes and are looking for peace of mind, take your business elsewhere.I will keep this updated until it is resolved, and the detail is as follows.--------------------------------------2nd Update (2023-09-16). From the reply below and my communication with their support, at least they implicitly walked back the claim that those purchased from Amazon are used ones. That's good to know.Now, the argument has changed: their warranty does not cover those purchased from Amazon. This is interesting because their own website stated, which I quote here, exactly the opposite: \"TickTalk smartwatches purchased from authorized third-party retailers, including Amazon and/or Walmart, are eligible for our 1-Year Limited Warranty.\" And this one-year limited warranty also extends to international buyers, as per their website: \"For international customers, you are responsible for any shipping fees, duties, and/or taxes associated with warranty claim.\" Indeed, they followed this clause to the letter, so that I paid out of my pocket to ship the defective watch back to them (see my original review).Last issue: are the broken bands covered under limited warranty? My watch was purchased in Dec 2022, during the defective holiday batch. It falls into the category of \"basic hardware defect in workmanship.\" On their own Facebook community page, the company announcement dated May 5th, 2023 also stated the limited warranty covers the broken bands in the affected batches, and their policy is to offer a free replacement. So my first question is, why am I charged $100 to repair a watch with a basic hardware defect covered under a limited warranty?My second question is, why does a customer here, a frustrated parent, need to spend so much time writing countless emails to communicate with a company about their own defective product? How far are they willing to go to avoid taking responsibility for their own defective products? This is pretty ironic for a product advertised to offer peace of mind for parents. I am documenting all these back-and-forths with them to show how much frustration a customer needs to go through to cover their basic rights. I hope the other parents do not need to go through the same and can find their peace of mind from some other companies.I am eager to see their reply to my points above.--------------------------------------First update (2023-09-13): Now the support team tells me that this watch from Amazon is not new but a used one, so they don't have any liability to repair or replace it. They inferred that my watch must be used because it is sold at a discount. My purchase price tag is around USD 200, which is higher than the price on their website. The Amazon receipt also states that this is a new product. I am no longer angry, I am now just curious to see how far they will go to avoid honoring their warranty. For any parents watching this, I will keep you posted.--------------------------------------The original review:In short, if you live outside the US, don't buy from them. The watch broke within a few months; they do not cover return shipping, and eventually, they charged me $100 to replace their faulty watch while all within the warranty period. The details are as follows:After a couple of months of everyday use, one band broke. At the time, we thought, fine, it is a kid's watch, and it breaks. We glued it back, and after another month, the other band also broke. In the meantime, the speaker sometimes works and sometimes does not. The watch also fails to charge occasionally due to a poorly designed magnetic charger.After the second band broke, we Googled online and discovered this is a common defect of their watches. We contacted customer service to ask for a replacement. To add icings on the top, they refuse to provide free shipping for customers outside of the US. Ultimately, we have to pay to return their defective watch.This is absolutely the last time that I purchase from them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Yanjun Gan",
          "Nb_Reviews": 2,
          "Date": "2023-01-11T00:26:02.000Z",
          "Titre": "The watch cannot be charged in less…",
          "Contenu": "The watch cannot be charged in less than half a year.  As a children's watch, his price is not cheap, but the quality is not so good!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marcie M",
          "Nb_Reviews": 2,
          "Date": "2023-05-10T21:42:09.000Z",
          "Titre": "Literally says my child is in a…",
          "Contenu": "Literally says my child is in a different state right now! She’s with me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kate Bridges",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T15:29:25.000Z",
          "Titre": "My package was never delivered so I…",
          "Contenu": "My package was never delivered so I give zero stars"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brenda Alejandro",
          "Nb_Reviews": 1,
          "Date": "2022-09-10T19:11:49.000Z",
          "Titre": "Not water resistant.",
          "Contenu": "The website shows kids playing with waterguns and how it's water resistant and all that stuff. My son wore his watch for two days, he got caught in the rain at the bus stop and now we're in the process of returning the device. The policy says if they find water damage they'll charge you $100. They should remove the whole Water Resistant advertising because it cleary isn't."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ann Orr",
          "Nb_Reviews": 2,
          "Date": "2022-09-10T07:11:54.000Z",
          "Titre": "One of the worst purchases ever",
          "Contenu": "One of the worst purchases ever.  Said I would use AT&T but instead Of it being linked to my plan it’s a highjack/bait and switch to your profit center! I have wasted >4 hrs due to poor install instructions and a slow help desk response.Still not connected and out $300, plus a plan!BBB is my next step to resolve this horror show."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 4,
          "Date": "2023-03-01T20:46:56.000Z",
          "Titre": "ABSOLUTE JUNK AND PRODUCT and EVEN WORSE COMPANY!",
          "Contenu": "Update to Response: Your reply lets EVERYONE know how much of a Dishonest company you are. Watch is past the 30 day return window and Amazon wants to charge a $40 restocking fee to return you DEFECTIVE device. But you know that!!------------If you are buying this to keep tabs on your Childs location in case of emergency. DO NOT BUY!If you are buying this watch so your child can reach you in an EMERGENCY. DO NOT BUY!If you want your child just to be able to tell time buy them $20 kids watch.If you are buying this because your kids are tech savvy and like playing with devices like this. DO NOT BUY!After some company research it appears this company... \"TICKTALK TECH\" was operating under TICKTALK, INC and was suspended by the State of California so as a work around they registered the same company under a slightly different name to get around their state suspension. Suspended - FTB is the official Status!What does FTB suspended status mean?A business entity is typically suspended, or forfeited, by Franchise Tax Board (FTB) for failure to meet its tax requirements, such as File a state tax return. Pay. Taxes.Read on to find out why all this is relevant to my review...I thought for the price I was buying a product I could rely on to track my 9-year-olds location. As a Parent and the current state of our country with the things going on at schools. My wife and I wanted a means to contact our son and for he to be able to contact us in Emergency. I as a parent was really sold on the GPS tracking. Come to find out the GPS tracking NEVER and I mean NEVER works. It is either COMPLETY inaccurate or never works. Will say offline all the time. If you go to their FB page, you can see MANY if not MOST complaining about the same thing.The company will give you a bunch of bogus excuses and bogus remedies. Things like poor reception and poor battery life or just blame your kid themselves. My son charges his watch EVERYDAY after school so always very well charged when he is wearing it. As for reception well the fence in my backyard literally separates our property from my son’s school. At home great reception and at school the same as at home as it is less than 100 yards away from my backdoor. Both at home and at school the GPS never puts him remotely close to wear he is REALLY at. Sometimes it’s so bad it has him across town MILES away! Now let’s get to the company. A couple months ago the operating system of the watch was sent an update with Bricked the watch. Meaning it became frozen and unresponsive and stuck on startup screen!I called the company and thought some simple trouble shooting would fix it. Nope! Instead, I was basically told we are aware of the DEFECT, and you must send it back. This of course was after 30 minutes of back and forth and my common sense blowing their excuses out of the water. I then stated I would be leaving BBB and States attorney complaints. Now generally when it gets to this point with a BAD company, they will then try to do the RIGHT thing. NOPE not this company. Instead, I was told by the Manager I was threating her personally and was abruptly hung up. I filled out the warrant form sent it back and waited two weeks to get it back. Upon arrival they forgot to put the sim card door in the return box. So, they sent me two in the mail. Crazy thing is they were the wrong size. I then had to wait another week to get the right size. Now today my son comes home from school his watch is flashing all types of colors and not working AGAIN.Turns out another update was sent to watch while he was at school, and it bricked the watch AGAIN. So, I call again. It appears they are aware of this DEFECT and their ONLY solution is every time the watch is updated over the 5g network and not Wi-Fi this is likely to happen. So, you then must let the watch sit a couple days, so the battery drains and the watch turn off. This is their fix. Not to recall and fix their defective product.I was told we must monitor our kids and make sure they only try to update the watch when they are being supervised by an adult to be sure the watch is on WI-FI. As a Parent we all know, best of luck with that with how savvy our kids are with electronics today. I told the Manager this is not a solution and I need either new updated version of the watch or a REFUND. I was essentially in not so many words told to go pound sand. I was then asked by the MANAGER if I am an UNHAPPY person? She asked are you married. What makes you suck and unhappy person? Now normally this would seem INSANE to come from a manager of a company to a paying customer dealing with a DEFECTIVE product. But since being hung up and told I was threatening the person last time when I mentioned BBB and States attorney complaints. This surprising did not shock me!So, as of now I am stuck with an OVERPICED toy that will need to trouble shoot my kids watch after every update and not know where my kid is at."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "sri",
          "Nb_Reviews": 3,
          "Date": "2022-08-24T18:37:17.000Z",
          "Titre": "Waste . Not tracking on real time",
          "Contenu": "It’s gets logged out when me and my spouse open the app  both togeather from our individual phones , the gps is not real-time bother there is any option to refresh it to show the correct location . The calls some time are not clear . Also unlike cosmo this watch doesnt have the feature where by you can take picture remotely from your childs watch ...let say when she in school ...i take pics remotely to know where she is exactly etc , Absolutely waste of $180. Cosmo is far better than yours . Stupid watch. Rubbish"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Disappointed in NY",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T22:51:17.000Z",
          "Titre": "Broke after 2 weeks- not covered under warranty…",
          "Contenu": "I do appreciate that you \"fixed\" my daughter's brand new Tic talk 4, however felt incredibly frustrated that it was purchased BRAND NEW and she wore it for only 2 weeks before it broke.  The upper right button is permanently pressed in.  You would not stand behind the product without me sending you $100?  That is a crime!  Since the product has not even been on the market for a year, it clearly is not over a year old.  Therefore it seems that the one year warranty should be in effect.  Beware purchasers!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Abdul Ford",
          "Nb_Reviews": 2,
          "Date": "2022-08-03T20:33:25.000Z",
          "Titre": "A change of mind!",
          "Contenu": "This watch is Simply Amazing. My daughter loves all the features she used to have a gizmo.UPDATE: only the features was cool everything is else is horrible. No reception no signal location accuracy all over the place; State, country.This product would not give you a safe piece of mind.I return product after one week of use... going back to Gizmo."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jt Ehl",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T22:51:54.000Z",
          "Titre": "I would like people to know my son had…",
          "Contenu": "I would like people to know my son had this item less the 5 days and was running outside. OUTSIDE and the band broke and they want me to pay $100 more to fix something that shouldn't break from a kid running. I would recommend not buying this and get something else. It's garbage"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Danielle DeMars",
          "Nb_Reviews": 2,
          "Date": "2022-08-30T21:10:18.000Z",
          "Titre": "The number we got belonged to hector…",
          "Contenu": "The number get got belonged to hector meses.  I was told to ignore it by customer support.   When I turned my app on this morning - it said my daughter was in WV but then reset to the approximate location.  I may need to return this product"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christine Loy",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T00:44:11.000Z",
          "Titre": "Already broken",
          "Contenu": "Already broken. How can a kids watch be so delicate."
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Dhanuka Ranasinghe",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T13:51:28.000Z",
          "Titre": "I still didn't receive my item."
        },
        {
          "Note": 1,
          "Lieu": "SA",
          "Pseudo": "Chadi Kouatly",
          "Nb_Reviews": 1,
          "Date": "2022-08-05T07:16:50.000Z",
          "Titre": "The watch is unreliable",
          "Contenu": "The watch is unreliable. I had the Model 3 and it worked. Did the same settings on 4 but the watch never worked. Support was unable to help. I will now request a refund and will not buy it again or recommend it to anyone ever again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cynthia",
          "Nb_Reviews": 1,
          "Date": "2022-03-16T16:15:38.000Z",
          "Titre": "Customer service couldn't fix the…",
          "Contenu": "Customer service couldn't fix the issues I was having. The notification wouldn't  pop up, video chat would freeze before planning the call, couldn't use my high speed internet wifi to place calls or locate the device, emergency calls wouldn't go through. Problems all around. Loved the concept but it needs to be improved drastically"
        },
        {
          "Note": 1,
          "Lieu": "CZ",
          "Pseudo": "Monika U.",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T18:53:49.000Z",
          "Titre": "My credit card evaluated by TickTalk…",
          "Contenu": "My credit card evaluated by TickTalk system as a medium/high fraud risk and admin insist to provide via email scan of credit card and ID.Something what is high fraud risk for me and difficult to accept!So order cancelled and I already purchased alternative product / Explora X5 play.Sad"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Abdul Ford",
          "Nb_Reviews": 2,
          "Date": "2022-08-03T22:22:46.000Z",
          "Titre": "The worst product..",
          "Contenu": "The worst product... hands down. Not safe for kids.  Horrible,.. no reception, continuous busy signals when calling device.  Location accuracy all over the country and State. Almost laughable"
        },
        {
          "Note": 1,
          "Lieu": "KW",
          "Pseudo": "Zeyad",
          "Nb_Reviews": 1,
          "Date": "2021-11-06T00:35:44.000Z",
          "Titre": "Poor technical support and problems",
          "Contenu": "Poor technical support they would rather you return the watch then fix the problem as international user the data line works however when selecting option silent listening you receive a message stating you will receive a call and you don’t 2 the watch identifies the carriers but does not send or receive calls 3. You cannot add another approved app user"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JJ",
          "Nb_Reviews": 1,
          "Date": "2022-01-03T22:04:54.000Z",
          "Titre": "Poor Quality.",
          "Contenu": "Poor quality. Bought three for my 3 sons and only one made it past a year before breaking. Luckly the warranty helped replaced them but broke again, and now i was told I could see if they qualify for a $30 trade in if i wanted to upgrade. Not reliable, wouldnt buy again if i had a choice."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 7,
          "Date": "2021-09-07T20:17:34.000Z",
          "Titre": "Horrible customer service",
          "Contenu": "Horrible customer service. Company doesn't back up their faulty products, instead blames the consumers. Markets the watches as kids water resistant watches but they are clearly not as they cannot even handle kids washing their hands and water simply getting splashed on the watch. Then company blames you and refuses to fix it."
        },
        {
          "Note": 1,
          "Lieu": "KW",
          "Pseudo": "Ze",
          "Nb_Reviews": 1,
          "Date": "2021-12-14T05:52:41.000Z",
          "Titre": "Needs software update international version",
          "Contenu": "1.watch goes offline with cell towers close by2.GPS must be checked 2-3 times to get accurate readings3.Remote listening doesn’t work 4. Company needs to update software for international version outside U.S  use + country code then city code code be 1-2-3  numbers then mobile number"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2021-07-26T20:40:35.000Z",
          "Titre": "The band is so stiff and hard it gives…",
          "Contenu": "The band is so stiff and hard it gives my child blisters.  The music feature is only available in the US. Customer service maintains that it said “us customers only” but I can’t find it on any of the Kickstarter material.  This is the second version we have purchased and I regret spending the money on this one."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Yvone Curtis",
          "Nb_Reviews": 1,
          "Date": "2020-11-30T01:12:18.000Z",
          "Titre": "Sad birthday",
          "Contenu": "I ordered on the 19th of November.  The shipping was created and I have YET to receive the watch.  It was supposed to be here by the 24th and it is currently the 29th.  My sons birthday is tomorrow and now it's completely ruined.  I saved up for this watch.  For some 149$ isnt alot but for our household it is alot! I cant afford to buy him anything else now.  I'm writing this in tears."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "SLC",
          "Nb_Reviews": 1,
          "Date": "2021-06-01T00:16:32.000Z",
          "Titre": "Ready for a refund",
          "Contenu": "Received the watch a few days ago. Cannot make or receive calls 99% of the time. SOS function does not work. Will not complete the call when pressed. When a call is received it comes up as private caller. My child will not answer a call without knowing who it is. Used online support to try and figure things out but didn’t get any resolve. They had to let me go after nearly two hours because their shift was over. Not a good first impression of customer service when the product isn’t working. Frustrating to say the least."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Teya",
          "Nb_Reviews": 1,
          "Date": "2021-06-01T17:25:44.000Z",
          "Titre": "Nothing works properly GPS is useless unless you are on WiFi",
          "Contenu": "We are connected via T mobile service and the watch has pretty much no connection via face time , GPS tracking only works via WiFi, completely useless. If I was able to return the watch I would have. Purchased exclusively just for the GPS tracking and unfortunately it does not work"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AF",
          "Nb_Reviews": 1,
          "Date": "2022-01-06T22:42:31.000Z",
          "Titre": "Black Screen - does not work upon arrival",
          "Contenu": "I ordered this for my 8yo daughter. The watch does not work. I am now waiting on someone to email me about an exchange/return/refund. Due to not hearing from anyone yet, I am not very impressed with this product or its customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joshua Shumelda",
          "Nb_Reviews": 1,
          "Date": "2021-06-08T18:22:44.000Z",
          "Titre": "Are you a luciferin company?",
          "Contenu": "Let’s try again I don’t think I’m being heard. The ONLY character you have to send through text message other than the emoji face is a devil. An ENTIRE line, 1/5, of your chums is a devil. kids may like the devil icon because they are more animated, please do not respond with there are five options.Psychologically the devil icon is associated with mischievousness and chaos.For anybody reading this there is no other additional option in the text for kids to use other than a devil. And no I am not Christian I just do not like being fed any agenda. Are you a luciferin company?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shanin Vaquero",
          "Nb_Reviews": 1,
          "Date": "2021-09-07T23:39:54.000Z",
          "Titre": "My package was lost and I am still…",
          "Contenu": "My package was lost and I am still waiting for a refund. I’ve reached out to customer support and filed a missing package case with USPS. Didn’t even get a chance to get the watch but still being charged for it. Still waiting for a refund."
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "Simit  Parikh",
          "Nb_Reviews": 1,
          "Date": "2021-12-22T05:39:50.000Z",
          "Titre": "The watch came defected",
          "Contenu": "The watch came defected. Cannot be charged. Cannot start. The product arrived in time for christmas but i cannot gift to my son on time. He is very upset. Support team and staff are helpful and response is quick."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer Parker",
          "Nb_Reviews": 1,
          "Date": "2021-06-10T14:28:28.000Z",
          "Titre": "Not useful.",
          "Contenu": "The functionality was misrepresented.  You can’t text without the app, the watch can’t find a network and the gps falsely shows my daughter in Virginia but we live in California.  Waste of money and poor customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mom of Two",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T22:03:06.000Z",
          "Titre": "False Advertising",
          "Contenu": "I am extremely disappointed in the functionality.  While some of the features work, others do not.  The tracking was most important to me, but that is available on all the kid watched (T-Mobile Sync, Verizon Gizmon, Angel, etc.).  My kids were very interested in the step tracking so they could have competitions with their friends.  Tick Talk should NOT advertise that they offer step tracking.  What they have is a movement tracker.  The steps are WAY off.  I reached out on this and was told \"if the hand is shaken it may be counted as a step\".  These are kids, they are always moving.  It was giving my son steps as we were sitting in the car.  For a $200 watch I'm extremely disappointed this is not accurate and even more disappointed that the company is falsely advertising this is a feature they offer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aaron D Conway",
          "Nb_Reviews": 1,
          "Date": "2021-06-04T18:10:25.000Z",
          "Titre": "Terrible customer service. No one responds to calls emails or chat.",
          "Contenu": "Terrible. I have been trying to talk to someone since May 28th about our Tick Talk that only worked for 3 days. No answer on calls, no answer on chat, one answer on email 6 days ago that was a one line question."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dina Muldrow",
          "Nb_Reviews": 4,
          "Date": "2021-08-18T22:49:58.000Z",
          "Titre": "Completely disappointed",
          "Contenu": "Completely disappointed.  Got the watch, set it all up, got the cell service added contacts, everything and now the piece of crap won't even charge, I have 2 chargers neither work...  complete trash!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2021-06-25T21:11:40.000Z",
          "Titre": "It’s been three days since we got the…",
          "Contenu": "It’s been three days since we got the watch and the website to activate the sims card can’t seem to send me an email so even with their teams of people working on it. No one has answers. Biggest joke!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Savanah Ekman",
          "Nb_Reviews": 1,
          "Date": "2021-10-05T00:03:47.000Z",
          "Titre": "DO NOT BUY!",
          "Contenu": "The proces to get this watch and get it working has been ridiculous! I DO NOT RECOMMEND THIS WATCH OR COMPANY OR RED POCKET! I bought this for my 5 year old son mostly for the video chat, tracking, and music features. After a month dealing with the service company to get it turned on, the watch said it was \"overheating\" anytime we used these features and would get very hot. Obviously I don't want my son wearing something on his wrist that is overheating and extremely hot and could burn him. After multiple phone calls and troubleshooting and it still not working properly I was over it. Now they're saying it's too late to get a refund. I want my money back especially after all this wasted time and frustration. I DO NOT RECOMMEND THIS PRODUCT OR COMPANY!"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Richa Shrivastava",
          "Nb_Reviews": 1,
          "Date": "2021-07-12T13:14:36.000Z",
          "Titre": "Worst product award of the year.",
          "Contenu": "Worst product award of the year.the battery wont last 8 hrs even after charging for 100% even you close, bluetooth, wifi and cellular data.Imagine how miserable can be a product"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Yesenia Rodriguez",
          "Nb_Reviews": 2,
          "Date": "2021-05-12T16:15:51.000Z",
          "Titre": "I ordered a strap and charger for my…",
          "Contenu": "I ordered a strap and charger for my daughters tick talk 3 only the strap came i called to let them know and I have yet to receive a email confirmation on where my charger is at."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Christian Morneau",
          "Nb_Reviews": 1,
          "Date": "2021-07-08T18:34:42.000Z",
          "Titre": "Broke the wristband in 2 weeks of…",
          "Contenu": "Broke the wristband in 2 weeks of normal use. Try to get new one but apparently need to send back to repair for 100$ plus 100 more for shipping…. Wish never bought this"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Manu H",
          "Nb_Reviews": 2,
          "Date": "2021-05-11T17:23:41.000Z",
          "Titre": "Ordered a charger replacement",
          "Contenu": "Ordered a charger replacement. The shipping label was created 10 days back but item is not yet shipped. You should create a shipping label unless you are ready to ship."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wendy Cromwell",
          "Nb_Reviews": 2,
          "Date": "2021-08-09T20:06:37.000Z",
          "Titre": "Not good",
          "Contenu": "Well, despite the Postal Service saying that we received our daughter's watch, we have not. We are in contact with the Postal Service and Police Department."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lizbeth McGee",
          "Nb_Reviews": 1,
          "Date": "2022-12-25T23:50:57.000Z",
          "Titre": "No Sim card",
          "Contenu": "No Sim card, can not active"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christopher Trinemeyer",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T18:46:52.000Z",
          "Titre": "I was provided a code for a discount…",
          "Contenu": "I was provided a code for a discount but my code was never accepted because the website wouldn't load it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Teresa Douthit",
          "Nb_Reviews": 2,
          "Date": "2021-07-25T13:22:24.000Z",
          "Titre": "Watch band didn’t last a week",
          "Contenu": "The Tick Talk 4 watch is fine but the band broke within a week of giving this to my son. One week. I superglued it and then it broke in another spot. I called customer support. They told me I have to send the entire watch back so they can determine if the band can be replaced. If it can, they will. If it can’t they’ll replace the watch for $100. WTH???? You mean this isn’t covered by the warranty? Apparently not. They told me I can buy the extended warranty. How can a watch band not be replaceable? If the thing fails immediately after purchase they should stand behind it. Period. This is less than 10 days old. Apparently the warranty that comes with the watch is meaningless. So now I have to decide whether to send it back and hope they deem it replaceable or whether to try to superglue this brand new watch back together so my son can continue to use it. My son has not been hard on this watch. He just wears it while going about his normal business. Without a functioning band the watch is nearly useless."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Eachus",
          "Nb_Reviews": 1,
          "Date": "2021-06-10T01:39:08.000Z",
          "Titre": "We purchased this watch for our son for…",
          "Contenu": "We purchased this watch for our son for his 7th birthday. First off, it did arrive on time. Unfortunately the included SIM card was defective out of the box. After no useful help or explanation from TickTalk’s service provider, we took the watch to our cellular provider and had a new line added to our plan. Three days later, both cameras have moisture under lenses and watch will not function. He has not been near any water while wearing it but had spent most of the day before outside in high humidity weather. When we contacted tech support, they stated rudely that they could not do anything as they are to busy with other customers. They did say that they could do a onetime replacement but could not give a refund due to water damage not being covered by warranty. We plead our case to them that normal moisture from a child’s rust should not constitute water damage and that we wanted a refund. Their response was simply “No”. I would not recommend this product to anyone living in the southern area of the United States."
        },
        {
          "Note": 1,
          "Lieu": "MY",
          "Pseudo": "Pauline",
          "Nb_Reviews": 1,
          "Date": "2020-12-06T08:13:49.000Z",
          "Titre": "Don’t Cheat your Customer!",
          "Contenu": "I’m a first time customer from abroad and have just purchased the TickTalk 3 watch (end of November 2020).Despite my repeated emails, TickTalk Team completely ignored, neglected and failed to respond.TickTalk Team has no courtesy at all to at least respond or reply to my queries/follow up emails -It appears that TickTalk fails and refuses to honour what they had promised/represented to me, to deliver to me a free wrist band and hence completely ignored all my follow-up emails.If TickTalk company is incapable of delivering its promise/representation to send me (its customer) a free wrist band, then why made such a promise/representation in the first place if it cannot honour?   Don’t CHEAT the customer!Surprisingly, TickTalk Team is incapable of  handling such a mere wrist band issue and failed to build its customer’s trust from a first time customer abroad like me.Perhaps that’s how TickTalk is running its business, giving FALSE promise/representation to its customers from abroad as they know they can easily get away with.Truly disappointed and regret for shopping with TickTalk."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hans  Blomdahl",
          "Nb_Reviews": 1,
          "Date": "2020-09-02T02:07:51.000Z",
          "Titre": "I cannot activate the account and…",
          "Contenu": "I cannot activate the account and redpocket is not providing support. So the product is useless to me and my child."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "laura",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T19:47:31.000Z",
          "Titre": "the watch does not work"
        },
        {
          "Note": 1,
          "Lieu": "GR",
          "Pseudo": "ANASTASSIOS MANOS",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T05:37:23.000Z",
          "Titre": "Ι did not receive yet the watch",
          "Contenu": "Ι did not receive yet the watch. I paid for express delivery but we have over 10 days without news."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "True puppys",
          "Nb_Reviews": 1,
          "Date": "2021-03-31T13:25:40.000Z",
          "Titre": "Over 6 weeks still not recieved my…",
          "Contenu": "Over 6 weeks still not recieved my watch for my son it was the £10 deal through tick tock m roberson"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony hanni",
          "Nb_Reviews": 2,
          "Date": "2021-09-28T13:01:11.000Z",
          "Titre": "I loved the 3- the 4 sucks!!",
          "Contenu": "I loved the 3. Great watch with great connectivity. The 4!!! What the hell happened. The watch has a few apps, and they crash. Good luck playing music, I was never able to get it to work. ALSO I bought the watch to call my kid. Guess what? The new watch was downgraded for connectivity. My favorite gripe, When a kid doesn't answer the phone, you can't leave a message because the kid hasn't set up voicemail. But guess what? There IS no voicemail. The kid will never be able to set it up. Why would you do this? What is the point? just say, there is no way to leave a voice mail message- goodbye. I wanted this to work sooo much. The previous one was great, but I didn't get a full year out of it, doubt I'ld get a year out of a watch that doesn't really work right out of the gate. Why does the watch disconnect from the wifi so frequently? Why does the music app not work? Why am I not able to call my kid in the Bay Area with fabulous reception?. Great idea- but it got too clunky and non functional. The customer service is fabulous! Thats the other part that pisses me off, They care about their customers and I wanted to be one. Just need a watch that does what you claim it does. Call me as most reviews are fake. Tony 6504443271"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fereshteh Amiri",
          "Nb_Reviews": 1,
          "Date": "2022-09-15T21:31:13.000Z",
          "Titre": "Received wrong color",
          "Contenu": "I ordered black color, but I received blue color."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marlon Marshall",
          "Nb_Reviews": 1,
          "Date": "2021-09-28T12:27:02.000Z",
          "Titre": "Product offline when I need it",
          "Contenu": "Product offline when I need it. Should have service at all times for child safety."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chrissy",
          "Nb_Reviews": 2,
          "Date": "2021-11-18T09:03:23.000Z",
          "Titre": "The gps location is inaccurate and…",
          "Contenu": "The gps location is inaccurate and customer service is slightly slow to respond"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Molly Jones",
          "Nb_Reviews": 1,
          "Date": "2021-09-04T18:57:54.000Z",
          "Titre": "Half of my order is missing and haven't…",
          "Contenu": "Half of my order is missing and haven't heard from customer service in days"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MJB",
          "Nb_Reviews": 1,
          "Date": "2021-06-10T23:36:48.000Z",
          "Titre": "Live chat not great",
          "Contenu": "Slow and ambiguous response from staff, when contacted via email and online chat."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DG",
          "Nb_Reviews": 1,
          "Date": "2021-07-15T00:15:36.000Z",
          "Titre": "Better instructions needed",
          "Contenu": "The instructions for upgrading from 3 to 4 were lacking."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ERROL JACKSON",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T00:04:51.000Z",
          "Titre": "Your \"NUMEROUS EMAILS equate to…",
          "Contenu": "Your \"NUMEROUS EMAILS equate to harassment!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lyndsay Ellis",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T19:46:32.000Z",
          "Titre": "Still have not received my order"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charlene Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2021-06-08T19:57:42.000Z",
          "Titre": "As of today still have not received my…",
          "Contenu": "As of today still have not received my order"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Brent Scafidas",
          "Nb_Reviews": 1,
          "Date": "2021-06-29T07:07:52.000Z",
          "Titre": "No response after 7 days to my e-mail."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MT",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T05:23:37.000Z",
          "Titre": "Hard to use, huge, and useless FaceTalk",
          "Contenu": "This comes with no instruction manual. We’d love to know what the different symbols on the watch mean. We couldn’t get the tracking feature on the watch to work. After a lot of time on YouTube, we figure it out. Also, the FaceTalk feature is nearly useless. It would have been nice to know ahead of time that you can only use FaceTalk for 3 minutes before the watch overheats. I sincerely regret this decision and wish we would have just gone with the Gabb watch. It’s more popular for a reason. Also, like other reviewers said, this watch is very large and clunky."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2022-11-26T18:44:00.000Z",
          "Titre": "GPS Tracking function is working fine…",
          "Contenu": "GPS Tracking function is working fine and it does its job. Parental control interface is easy to use. Shortcut call icons to parents is good idea. Voice call works just fine too.FaceTalk used to work when I first received it but now it stops working on wireless network and WI-FI without video. In addition, during audio call (not phone) using data, I cannot hear anything from the watch. I tried to reset the watch and it still did not work. Also tried firmware/apps update but it’s not required so all software should be up-to-date.When sweeping the screen, it’s insensitive and the user often needs to try several times to switch to other screen pages. When pressing on the screen, the touch-screen is overly sensitive and often gets one-level down to the function interface."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "PATRICK MCLAUGHLIN",
          "Nb_Reviews": 2,
          "Date": "2023-08-05T20:18:53.000Z",
          "Titre": "Watch dotracking issue.",
          "Contenu": "Watch doesn't refresh signal."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joshua",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T17:35:07.000Z",
          "Titre": "Bad gps tracking signal",
          "Contenu": "Watch itself worked ok besides not being able to hear them to good at times unless they hold the watch close to the face. Also the gps is way off it shows my kid is on the other side of town at times when I know he isn't. Even connected to his school wifi it says he is down the road. For a watch just for calling it works good but for gps your better off looking for something else. I am very un happy with the watch mainly because I mainly bought it for gps tracking to know where my kids is but it don't do that. The plus side is I can call him or voice message him anytime but that's about all the watch is good for I'm very unsatisfied with the watch don't waste your money if you plan on using the gps tracker! If just for talking it works ok but could use a little better speaker to be able to hear them better"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Krystal",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T23:06:05.000Z",
          "Titre": "GPS is a big issue",
          "Contenu": "The concept is great, the watch functions well. The issue is the GPS. The watch will be in the other room of the house and when checking the location it will show the watch is 50+ miles away. This happens daily. The main purpose of it is to keep watch on my child that is learning responsibility. I've had to completely reset and repair the watch to my phone on 2 occasions (I've had the watch for 5 days.)"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jessica Creekmore",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T05:16:49.000Z",
          "Titre": "Disappointed",
          "Contenu": "We just activated TickTalk 4.  The GPS initially told me the watch was across the street.  Now, is says it’s 45 minutes away even though it’s charging in my kitchen.  It worked great for phone calls to child but not worth the price tag to be that inaccurate on the GPS."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Todd Wesley",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T23:01:27.000Z",
          "Titre": "AT&T Technical Issues",
          "Contenu": "We received our TickTalk 4 watch on 2/23/23, and attempted to set up a TickTalk Wireless account with our AT&T SIM card.  As of today, that account is still “pending” due to a technical issue on AT&T’s end.  While I appreciate this may be out of TickTalk’s control, there could have been measures taken at the onset of AT&T’s issues by communicating to your customers at the point of carrier selection and only allowing T-Mobile SIM cards until AT&T’s issue was resolved.  So after nearly a week, I have a $200 watch that is useless to me and my child; this certainly does not meet my expectations.  I did have positive email interaction with TickTalk’s customer service in 2/24/23, but beyond that there’s been no communication as to the status of AT&T’s issue, nor any other option provided to me other than to wait."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sunyoung Lee",
          "Nb_Reviews": 1,
          "Date": "2022-09-20T23:04:33.000Z",
          "Titre": "Don’t make excuses you can’t handle.",
          "Contenu": "When adding the watch to the cart. Along with getting ready to make the purchase. No where did it stated it would be back ordered. I had emailed the company and the CS at that time wanted to make excuses and screen shot an image about the back order date. Keep in mind she did this while emailing back and forth. So how does that solve my answer at the time I made my purchase."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Hudson Murch",
          "Nb_Reviews": 2,
          "Date": "2022-09-21T01:02:18.000Z",
          "Titre": "The gps isn’t always accurate",
          "Contenu": "The gps isn’t always accurate.  At one point it said my son was in Florida (he was at school in Illinois) and the other time he wore it he said he was still at the roller rink and he had just rang our doorbell.  It’s been disappointing so far."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Penny Ziv",
          "Nb_Reviews": 1,
          "Date": "2022-08-26T22:17:11.000Z",
          "Titre": "There's a couple things",
          "Contenu": "There's a couple things. The website wasn't working when I went to activate the watch. Called customer service and they're zero help. Just told me to wait for awhile and try again. Then, the info about the watch is misleading. It says unlimited calls and texts, but it can only text through their app. I'm the admin so I have the app, but no one else we know does. Same for video calls. So basically, it's just a watch that can call the contacts I've approved. No one else is going to download the app just to be able to message and video call with my kid."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Elvira Guerrero",
          "Nb_Reviews": 1,
          "Date": "2022-09-09T20:53:47.000Z",
          "Titre": "We have had it for a couple of days",
          "Contenu": "We have had it for a couple of days, it says it’s supposed to be user friendly but it’s annoying how everyone has to download the app to talk to the child. It is hard to press at times. It has no keypad for some stuff."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Channing Teeter",
          "Nb_Reviews": 2,
          "Date": "2022-08-22T22:14:19.000Z",
          "Titre": "Two thumbs down.",
          "Contenu": "I am very disappointed with the quality of the Tick Talk watch. It was replaced under warranty and has since broken again, but cannot be replaced under warranty. We have also had to replace the SIM card multiple times from normal wear."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Katie Hall",
          "Nb_Reviews": 1,
          "Date": "2022-09-07T02:14:21.000Z",
          "Titre": "I bought two of these for my kids and…",
          "Contenu": "I bought two of these for my kids and neither one tracks them accurately. The tracking shows them in another state or city. Emailed customer service and have heard nothing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ian",
          "Nb_Reviews": 1,
          "Date": "2022-02-25T20:18:16.000Z",
          "Titre": "-2 Stars for Setup,  -1 for response",
          "Contenu": "-2 Stars for Setup. No mention of a known minor manufacturing defect that cost over 5hrs working with the SIM provider, when a note or acknowledgement would have taken 5 mins to fix.Really disappointed so far.EDIT: in response to reply: This has nothing to do with RedPocket, but is a result of a bad installation of the dummy SIM coming from the Watch's factory. One that the your CS-agent, knew immediately how to fix (because they had clearly done it multiple times already) but hadn't been surfaced externally in any way."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Erika C",
          "Nb_Reviews": 1,
          "Date": "2021-10-26T03:35:03.000Z",
          "Titre": "Would not recommend",
          "Contenu": "The watch gets warm when used which makes me feel it is not safe. The location is not accurate. Messaging can only be done though the app which is frustrating. The child can not type any texts and needs WiFi for texting. I was extremely disappointed for the amount of money I spent on this product. I would not recommend it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gina T.",
          "Nb_Reviews": 1,
          "Date": "2021-06-22T20:56:30.000Z",
          "Titre": "Watch not working the way it should.",
          "Contenu": "While the purchasing experience was fine and received the watch in a timely manner the setting up was very frustrating and it still is not working the way it should.  95% of the time it is telling me its offline and I would have thought the battery would last longer.  On a side note I have not given upon the watch I just need time to call the help line to see if they can possibly help with the issues I am having ."
        },
        {
          "Note": 2,
          "Lieu": "SA",
          "Pseudo": "Michael Fejsa",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T15:40:56.000Z",
          "Titre": "Sent watch back for replacement…",
          "Contenu": "Sent watch back for replacement recently. Received message from shipper that watch was received 2 messages to Support Team to confirm that it was received and cant get anyone to respond. Very bad customer service. Communication is a very important part of customer service"
        },
        {
          "Note": 2,
          "Lieu": "MA",
          "Pseudo": "AHLAM TAHIRI",
          "Nb_Reviews": 1,
          "Date": "2022-04-19T16:21:25.069Z",
          "Titre": "poor battery",
          "Contenu": "the watch seems to be good, but the battery can’t stand more than 8 hours in standby mode, it’s a real issue , if the kid take it to the school, he should take the cable with him and look where to plug his watch !!!!"
        },
        {
          "Note": 2,
          "Lieu": "HK",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T23:35:45.000Z",
          "Titre": "Slow / unhelpful responses to emails",
          "Contenu": "Slow / unhelpful responses to emails, no assurance of help even though the watch was defective. Get the impression international customers do not matter to this company. Have had to but a second watch just to get the replacement sooner."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ChrisC",
          "Nb_Reviews": 2,
          "Date": "2021-09-20T18:03:34.000Z",
          "Titre": "Received watch, DOA",
          "Contenu": "Received watch.  DOA.  Elongated and clunky process to deal with return and replacement.  Will see how replacement does.  DOA devices always an indication of poor production and fulfillment QC.  Ineffective support experiences an indication of poor CX commitment."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Yesenia Rodriguez",
          "Nb_Reviews": 2,
          "Date": "2022-04-27T05:58:24.801Z",
          "Titre": "When I first bought my daughter the…",
          "Contenu": "When I first bought my daughter the tick talk 3 I was very pleased and happy with the watch and all the features, we had that watch for about 6 years then gave it to my younger daughter and decided to upgrade it for the tick talk 4 since we were pleased with the service and all its features then shortly after paying 189 plus tax for the upgraded version and giving to my daughter for Christmas it gets stolen from her backpack(yes it should have been on her but she's 7 and had to take it off in class) I contacted tick talk got little to no help locating the watch and told me I had to purchase another one and only got a small discount for the new one. The customer service and lack of sympathy or warranty on a watch I had just bought really seemed like a rip off of my hard earned money."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Green Vision",
          "Nb_Reviews": 1,
          "Date": "2021-06-08T23:08:00.000Z",
          "Titre": "Unreliable location tracking",
          "Contenu": "Unreliable location tracking. Tried two different sim cards still the same results. Contact customer support for assistance but no resolution. Other features works fine. If location tracking is important for you then look for other options."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tt customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-29T20:26:20.000Z",
          "Titre": "Issues with accurate location and short…",
          "Contenu": "Issues with accurate location and short battery life. Upgraded to tick talk 4 hoping for improved battery life which is stated by sales rep and website to be 100 hours but it’s 100 hours in standby/airplane mode which was divulged after purchase. The watch during normal use still only provides 4 to 6 hours of battery life. In addition I have 2 watches and only 1 tracks the accurate location in real time the other lags 3 to 5 miles on a trip behind if it even registers in close proximity. Also location is not concise as the tt2 e.g. tt2 showed kids in home now watches show they are in strip mall parking lot 500 feet away. Disappointed in the upgrade and marketing tactics are below board"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ML",
          "Nb_Reviews": 1,
          "Date": "2021-06-16T21:23:33.000Z",
          "Titre": "We ordered a replacement when the first…",
          "Contenu": "We ordered a replacement when the first one we bought got wet. Replies from customer service were quite slow and now the watch has not shown up for weeks. Whenever we ask for updates, they say it is on the way."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rem",
          "Nb_Reviews": 1,
          "Date": "2022-07-06T21:52:53.000Z",
          "Titre": "It always seems to be offline",
          "Contenu": "It always seems to be offline. When it works it’s great, but more often than not, it shows as offline and defeats the purpose of the phone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jennifer Ayers",
          "Nb_Reviews": 3,
          "Date": "2021-07-01T19:13:58.000Z",
          "Titre": "I hate the fact that my trusted…",
          "Contenu": "I hate the fact that my trusted contacts have to sign up for your app with all their personal information, the watch is huge and dangles off of my daughters wrist, thinking about returning"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Donovan Walker",
          "Nb_Reviews": 1,
          "Date": "2022-03-17T03:23:28.000Z",
          "Titre": "Way too expensive for the little…",
          "Contenu": "Way too expensive for the little features it has. Volume is way too low. You literally cannot hear if you are anywhere where there is noise."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 2,
          "Date": "2022-11-21T21:36:11.000Z",
          "Titre": "Complicated set up"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jennie",
          "Nb_Reviews": 2,
          "Date": "2021-12-27T18:24:53.000Z",
          "Titre": "Sound is poor on video and voice call",
          "Contenu": "Sound is poor on video and voice call. You can barely hear the person on the other end. Watch gets hot quickly and stops working."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rick Davis",
          "Nb_Reviews": 1,
          "Date": "2021-06-01T19:53:50.000Z",
          "Titre": "Still waiting to receive watch",
          "Contenu": "Still waiting to receive watch. Cant review something I am still waiting to get. FedEx has changed the date 3 times since address was changed."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Christopher Ward",
          "Nb_Reviews": 1,
          "Date": "2021-12-07T00:52:17.000Z",
          "Titre": "MCanadian buyers",
          "Contenu": "For Canadian buyers you should have a custom process for how to activate as well as customs clearance in the order process."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Travis Newton",
          "Nb_Reviews": 1,
          "Date": "2021-07-07T18:59:53.000Z",
          "Titre": "OK product, Not very good service",
          "Contenu": "I purchased 2 watch bundles during the Kickstarter campaign.  Communication was good and received the items, as expected.  Watch is a little bulky but works pretty well.  The kids like them.  Within a month, the watch band broke on 1 watch.  The way the band connects to the body is a little odd; it can't be laid flat and it's not obvious if you can even replace the band.  I don't think it's a very good design.  On a previous kids' smartwatch we replaced the band several times and never had an issue.  In this case, the connection point broke into pieces, not just the band or pin.  I contacted TickTalk about a replacement.  It has been almost 3 weeks and I still don't have a replacement; I'm told it has shipped.  Every email would go 1-2 days before getting a response.  I tried the chat on the site with no response.  I was able to talk to a person when I called.   Overall, extremely disappointed in the service.  This was a very simple transaction; most companies could have handled it in a couple of days.  Waiting days for responses to email simply isn't acceptable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Courtney Furr",
          "Nb_Reviews": 1,
          "Date": "2022-07-03T07:08:51.000Z",
          "Titre": "Gets hot when in use",
          "Contenu": "Gets hot when in use. GPS not accurate in real-time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nathan failing",
          "Nb_Reviews": 1,
          "Date": "2022-01-08T23:33:43.000Z",
          "Titre": "the service seems fine",
          "Contenu": "the service seems fine, but is not accurate with tracking my son."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Phung Phan",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T03:50:50.000Z",
          "Titre": "Lacks a few features",
          "Contenu": "It would be perfect if it had a gps fence to alert me if my child is outside a set perimeter...like if some kidnapped my kiddo from school or yard.Also, if the GPS location was better with wifi. In my house wifi, the watch shows that the kiddo is 2 miles away.Would it hurt to make the task alarms more customizable. Why can't I customize specific task labels or for calendar reminders?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John doe",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:05:35.000Z",
          "Titre": "Charged me twice otherwise was simple"
        },
        {
          "Note": 3,
          "Lieu": "SA",
          "Pseudo": "Usman Awan",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T20:57:39.000Z",
          "Titre": "Still more progress need to be made…",
          "Contenu": "Still more progress need to be made regarding 2 way communication but it is fineNThe location tracer is not so quick and accurate but ok than other productsTickTalk please call me I have more suggestions to makeRegardsUsman+966503150799"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Josh Rubero",
          "Nb_Reviews": 2,
          "Date": "2023-08-17T00:35:59.000Z",
          "Titre": "Good Watch, with limitations",
          "Contenu": "The watch is generally pretty good, however, it does have it's limitations.  A QR code to fill out information on a website would be better than using the extremely small alphabet on the screen.  The location doesn't always update easily.  It's cumbersome to get grandparents connected to the watch, however, once it's done everything is good.  All said, I like the watch, but it just has a few small things I think could be better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Leidy Ray-Wyn",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T02:13:41.000Z",
          "Titre": "I like this watch for more reasons than…",
          "Contenu": "I like this watch for more reasons than I dislike it. The designed purpose of this watch is 100% achieved. It has served me well as an assistive health device for my 7-year-old who has a medical condition. I however didn't like the fact that the watch didn't survive a year of usage. The wristband broke off completely. Even though there is a warranty for the watch, I am being asked for a review, in exchange for a $100 fee waiver for the watch replacement."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ramesh parsa",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T22:05:31.000Z",
          "Titre": "Video call is not working with our wifi…",
          "Contenu": "Video call is not working with our wifi and does not show the location immediately and it takes about few minutes to update. Sometimes I have to re open the app then it shows"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Spencer S.",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T20:22:50.000Z",
          "Titre": "Great but NOT waterproof",
          "Contenu": "TickTalk 4 watch’s are awesome but they advertise them to be waterproof which they are not.  Customer service even said it on the phone.  They are ok to have on in like a drizzle rain but that’s about it. This was a huge reason why I purchased 2 of these and now after 1 got ruined due to water damage, I’m being told they actually aren’t waterproof.  For the record ticktalk did replace it free of charge which was great, but I was still down a watch for 2 weeks and it’ll probably just happen again since ya know, they’re kids.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sherita",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T23:33:25.000Z",
          "Titre": "I like the remote call feature that…",
          "Contenu": "I like the remote call feature that allows me to listen in without my child knowing, the ability to disable the watch being powered off or data being turned of by the watch, and the reminders setting. So far the gps service is not as accurate as I would like but I did just contact customer service and they said they will basically reboot it and to test it out again in 24hours so fingers crossed that resolved things...it was showing my child being in California when she was right next to me in GEORGIA! Will follow up again after more time passes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mrs. T",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T01:24:18.000Z",
          "Titre": "Power Base Charger Purchase",
          "Contenu": "I recently purchased the power base charger for my daughter’s watch. The power base charger worked well, but I had to find the correct USB adapter. It could have charged the watch faster if it had been included with the power base charger—other than that, I am pleased with my purchase so far. I also purchased the single wire charger it also came without the USB adapter. I also notice this particular charges stop working quickly in comparison to my cellphone charger. This will be the first charger I have purchased since buying the watch. I have not had the watch for an entire year yet, but the charger completely stopped charging. I bought the power base hoping it would last longer than the wired charger."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Megs",
          "Nb_Reviews": 1,
          "Date": "2023-05-07T05:10:37.000Z",
          "Titre": "Great watch too bulky",
          "Contenu": "My son got this watch for Christmas. Love a lot of the settings. He likes the iheart radio app, control over contacts, can see all messages they receive, drop in feature is amazing. However the gps isn’t as precise as I was hoping for he can be across the street and 2/3 houses down and it says he is in my back yard or in the neighbors backyard in the opposite direction he is in. He really won’t wear the watch, he is 7 but not a stalky kid more average and it’s too bulky. Is there a softer casing for the watch available?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jaimee C.",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T19:01:31.000Z",
          "Titre": "Good for occasional calls",
          "Contenu": "My child has had this watch for a few years and it seems to work well. He’s not a big texter, so he uses that feature very infrequently. He doesn’t use the music feature at all, and likewise, I never use the gps or remote answer features, so can’t speak to those. For us, the phone is just used for basic communication (occasional calls) which it has been sufficient for. A few cons:1. The watch is a little bulky for a child’s wrist.2. Once in a while I’ll get a call from the watch when my son hasn’t actually called me. The watch could benefit from a redesign to make it less easy for a child to inadvertently make an accidental call. 3. The watch sends a lot of notifications (updates, etc.) which can make the wearer think that they are getting incoming texts, which can be disruptive. The watch is water resistant and seems pretty rugged. The band has held up and not needed replacement. In general, we are pretty happy with it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 2,
          "Date": "2023-01-09T00:05:23.000Z",
          "Titre": "Watch accidentally calls out often",
          "Contenu": "This watch accidentally makes calls all the time. Seems it is very easy to accidentally bump it and unknowingly have it make a call and then the person receiving the call doesn’t know what’s going on. Maybe my child is just extra clumsy but I feel like her coat sleeve sets it off often. Or maybe it’s just something glitchy with the watch’s system, like others have suggested. Not a big deal though once you realize that. Other than this issue, I think this is a great watch."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T02:37:05.000Z",
          "Titre": "Our son has thoroughly enjoyed his…",
          "Contenu": "Our son has thoroughly enjoyed his watch over the past few months as well as us. It is a simple watch and the face has been fairly durable for a 10 year old boy. However, the band broke while he was jumping on the trampoline. We are currently working with customer service on getting this fixed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jessie",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T02:44:39.000Z",
          "Titre": "Broken band, great customer service",
          "Contenu": "The watch has all the basic functions that I was looking for, especially the dnd function is super useful, however we never managed to make the facetalk function work…  The big issue for us with this watch is the band, it was broken within 2 weeks of normal use.  The band is fixed to the body of the watch with no wiggle room, so be super careful with it.  The customer service is great, super responsive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tammy L Rojas",
          "Nb_Reviews": 5,
          "Date": "2023-03-02T22:46:01.000Z",
          "Titre": "I have these watches for my 2 sons and…",
          "Contenu": "I have these watches for my 2 sons and my grandson I love that I can track them and call them while playing outside. I gave 3 stars because the watch band breaks easily and instead of being able to replace the band only you need to buy a whole new watch."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valerie",
          "Nb_Reviews": 2,
          "Date": "2023-03-17T23:07:04.000Z",
          "Titre": "Updating subscription and texting notifications",
          "Contenu": "Was not easy to switch from the $20 per month subscription to the $10 per month subscription. I ended up waiting it out and resubscribing after it ran out. Also, when my daughter text me it does not always notify me from the app. Often my app will have me signed out and I have to sign back into it again. I wish there was a way to text back and forth regularly, without the use of the app. I understand it helps to monitor the texting. If she had the ability to text only her approved contacts, without having to use the app, that would be ideal."
        },
        {
          "Note": 3,
          "Lieu": "SA",
          "Pseudo": "Faisal Yar",
          "Nb_Reviews": 1,
          "Date": "2022-11-26T06:20:24.000Z",
          "Titre": "Looks like a great product with amazing…",
          "Contenu": "Looks like a great product with amazing options. Unfortunately couldn't get it working. Emailed the tech support team (had to reach them on twitter to get a response) and I was told to try a different carrier. I live in Saudi Arabia and I'm using STC sim card. I tried another SIM but the issue still persist. Will try another one as recommended by the tech team (Zain). Hopefully it will work------Update: 26NOC2022Tech team has been incredibly supportive (Tiffiny) and the watch is working perfectly now with Zain. I hope soon it would work with STC (Saudi's & the region's biggest telecom company).I changed the rating from 1 to 3 star because of the battery life and the fact that the default music player doesn't work in Saudi Arabia and there's no alternative.  Apart from that, it's a great watch for kids. I'm likely to buy a new one for my daughter"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jennifer D",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T01:07:13.000Z",
          "Titre": "GPS not accurate enough",
          "Contenu": "The GPS always shows my kid is a 1-2 houses away. I wish my kid could free text rather than just voice text or choose pre-set texts. I wish it was not so big and bulky. I love that my kid can reach me when needed and vice versa. Set up was pretty straight forward. Battery life is good. You need wifi for video calling but if you purchase the monthly plan you don't need wifi for calling and texting."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gail Santamaria",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T23:03:12.000Z",
          "Titre": "Loving the watch, though use caution around the band.",
          "Contenu": "My son loves the watch. It has all the features we needed. Overall it’s built well, however the part of the band that is attached to the watch snapped after a couple of days. It’s not a part that should move around, like on most watches, so be careful of that! Everything else is sturdy. I’m working with customer service now about the broken part. They are responsive. I will update upon resolution of the problem."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "sportsmom",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T22:21:34.000Z",
          "Titre": "It's good when it works...until it dies",
          "Contenu": "This is my third time buying a TickTalk watch.  The first was a TickTalk 3 for my older son.  The battery life of that model was terrible.  We then bought a TickTalk 4 for my younger son.  It worked pretty well, but sometimes it would stop working or charging, and after trouble shooting we got it to work again.  We uses it mostly for texting or calling to communicate with my son to pick up from school, and it served its purpose.  But after 1-1/2 years, the watch stopped charging for good.  My only option at that point was to mail it in at my cost to have the company test it, and if they could not revive it, then I could pay $100 to have it replaced.  A new one cost $150 with the Easter discount.  So I decided to buy a new one at that point, in order to have a working watch sooner, and with the cost to ship the old one back it would not have been far off from $150.  Honestly, I cannot wait until my younger son is old enough to have a phone.  At least then it would be more reliable and won't die so soon."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Satisfied Customer",
          "Nb_Reviews": 2,
          "Date": "2022-11-29T18:34:52.000Z",
          "Titre": "The battery life is not what was…",
          "Contenu": "The battery life is not what was expected.  The location data has improved since AT&T added a new tower in my town."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carrie",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T19:59:27.000Z",
          "Titre": "I like that it's easy to use",
          "Contenu": "I like that it's easy to use. Don't like that video calls don't work. Data fees are a bit expensive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Cheung",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T23:10:31.000Z",
          "Titre": "Good watch,but lots of calls from…",
          "Contenu": "Good watch,but lots of calls from unknown people. Number was most likely a recycled number resissued."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Catherine",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T00:46:32.000Z",
          "Titre": "It does the job",
          "Contenu": "It does the job. How ever the GPS is not accurate as portrayed.  It's usually at least half a mile to a mile off."
        },
        {
          "Note": 3,
          "Lieu": "PE",
          "Pseudo": "ALEJANDRO MONTEVERDE",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T06:43:42.000Z",
          "Titre": "It got so hot the first day that it…",
          "Contenu": "It got so hot the first day that it burned my daughter. I liked that the watch arrived quickly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anita",
          "Nb_Reviews": 1,
          "Date": "2022-09-12T14:42:36.000Z",
          "Titre": "I feel like it works sometimes",
          "Contenu": "I feel like it works sometimes. Currently it is not working and I cannot figure out why. Location is iffy. Sometimes it is an expensive paperweight. Remote calling is the only reason I like it and I feel like maybe that available elsewhere so why so expensive if it’s so iffy? No customer service available, it’s a voicemail. Expensive China toy. I’m considering returning it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Seeya",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T01:40:24.000Z",
          "Titre": "Love the watch, but not the software issues",
          "Contenu": "Love the watch, but we have only had it for four days and it is now rebooting over and over and totally unusable. Called customer service who said it is a software issue and that I have to submit a form, wait for support to reply, then send in the watch and wait."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rebecca N",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T23:36:56.000Z",
          "Titre": "The watch works great but I mis read…",
          "Contenu": "The watch works great but I mis read about the features and most of them are limited to the brand of watch.  The watch can not text approved contacts unless they are with ticktalk so only the call feature works as the kids in the neighborhood have all different brands.   I also had a different impression of the warranty until I had to use it and realized it didn’t cover much.  Over all the watch is great and love the gps feature and listen in feature.  The gps does get wacky if it’s on wifi and shows he’s in a different state which kinda sucks."
        },
        {
          "Note": 3,
          "Lieu": "SA",
          "Pseudo": "Ahmed ElKhayal",
          "Nb_Reviews": 1,
          "Date": "2022-08-20T08:04:51.000Z",
          "Titre": "You Must Buy to your Kids",
          "Contenu": "It is awesome and my kid loves it, easy to use track his location, communicate with him without getting mobile at end it’s mandatory to buy for your kids instead of mobile I do recommend to add below:1. can share my kid location or get direction to his location 2. add walkie talkie in the app and watch.3. greeting card should be more to covers more religions and cultures."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nima Derakshan",
          "Nb_Reviews": 2,
          "Date": "2022-09-12T00:19:55.000Z",
          "Titre": "Great Device....but needs work",
          "Contenu": "Great Device....but needs work. when compared to Watches from Tmobile and Verizon.  My Son loves the rugged design and the Camera.What needs work...-Video Call is limited to 3 minutes on Wife!?? Why? its using Battery power, its heating up ?? But you start another Video call right after?? super Annoying !!...Please increase to something reasonable.. 10min or calculate based on battery percentage. Cannot Text contacts outside of the app...Other Watches like TMobile...you can text to approved USERS...you dont need to install Ticktalk app for everyone. very Useful for emergencies. No Geo Fencing. Does not have GSM for more accurate location."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shanshan Jiang",
          "Nb_Reviews": 1,
          "Date": "2022-08-12T13:52:20.000Z",
          "Titre": "Locations tracker inaccurate",
          "Contenu": "Locations tracker inaccurate！！ I have to return this product and pay for shipping cost by myself！I used my cell phone’s SIM card in  the watch, the SIM card in my phone works great, but in the watch… the location shows me in somewhere 30 miles away. And location keep changing from north to south. Useless"
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Colin Marais",
          "Nb_Reviews": 2,
          "Date": "2022-05-19T08:38:06.000Z",
          "Titre": "Bit of false advertising..",
          "Contenu": "Bit of false advertising... NOT a GPS watch but uses same flawed cell tower technology as other cheaper watches.. GPS ONLY if all Cell towers down, and no public wifi.. Means your child can suddenly appear to be in china if wifi in area is still registered there!!!.. Son sits next to me and shows 5 miles away... If you need SAFE connectivity with child (blocks other sms/calls) then a great product... if you need GPS location... Think apple watch"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elizamar Beltran",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T23:23:38.000Z",
          "Titre": "Good watch but Tracker not working",
          "Contenu": "The call, video, text and music are awesome and for the most part easy to use but for some reason the tracker isn’t working it keeps saying my child is offline which I’m really bummed about"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Susie Jones",
          "Nb_Reviews": 1,
          "Date": "2021-12-25T22:24:43.000Z",
          "Titre": "On the Fence",
          "Contenu": "Just got this watch for my 11 year old for Christmas and I am already concerned by it's tight fit. In theory, it looks like it will work for our needs. He keeps losing his cellphone so I am hoping with this being attached to his body he will keep up with it. I love the easy setup, app, and watch features. Just worried that my son will outgrow the wristband fairly quickly. Will update later"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Julie Y",
          "Nb_Reviews": 1,
          "Date": "2022-01-05T12:36:04.000Z",
          "Titre": "Good product, a few issues.",
          "Contenu": "This product is great when it comes to limiting who your child has contact with. Kind of confusing to set up if you are just a family member getting the app to contact the child. I live in a good service area but my child has a hard to sending voice to text messages. It fails almost every time. No issues with just voice texts. The battery life is less than desirable.it won’t last a day. Also, the gps is always off by at least a mile and a half. But, I’m glad my child can call friends and family when they need."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sara Ericson",
          "Nb_Reviews": 1,
          "Date": "2021-09-30T22:13:14.000Z",
          "Titre": "I’ve been loving the Ticktalk with some…",
          "Contenu": "I’ve been loving the Ticktalk with some reservations until today, when I went to check my sons location and it told me he was in Detroit (I am in Minneapolis, as was he.) Setting it up is somewhat complicated, and the phone service they recommend starting with attempts to send him Messages upselling data and minutes. On the plus side it’s been incredibly convenient to be able to get ahold of him, but I no longer trust the location service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kristy",
          "Nb_Reviews": 1,
          "Date": "2021-08-17T22:10:23.000Z",
          "Titre": "The watch is huge- way too big for my…",
          "Contenu": "The watch is huge- way too big for my daughter to wear comfortably. (She just carries it in her backpack).  I bought it to take to school and be able to monitor her as she gets off the bus and walks home. GPS service is very inconsistent. They blamed it on AT&T but I have the same carrier for my phone and don’t have the problems this watch has. She’s able to text/call without problems as long as she’s connected to WiFi."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dad in Indiana",
          "Nb_Reviews": 1,
          "Date": "2021-08-03T00:02:55.000Z",
          "Titre": "I love almost everything about the…",
          "Contenu": "I love almost everything about the phone. My boys can call me, they can listen to music, they can take pictures, I can block features I don't want them to have, etc. However, with the T-Mobile version, I can't get many bars of service despite living in the city, and therefore the GPS is off by about 1/2 mile most of the time - GPS was my primary reason for getting the watch."
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T02:00:23.000Z",
          "Titre": "We upgraded our TickTalk 3 to Ticktalk4…",
          "Contenu": "We upgraded our TickTalk 3 to Ticktalk4 and the battery lasts a lot longer. The product itself is good. But the Customer service definitely has room to improve. Maybe because we're international order, we don't get the same support as local orders. We don't get things sent as replacement just because we're not in the States. With our TickTalk 3, we had problem with the charging cable and customer service agree to send us a new cable. But at the end, it never got sent after waiting for a few months. Then they said I need to send the whole watch back. We got a replacement watch but the monitor didn't work after a few months. And since it's out of warranty, there's nothing they could do. We just felt like things would've been different if they'd just send us a new cable. The replacement watch lasted only a few months."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sarah Carver",
          "Nb_Reviews": 1,
          "Date": "2021-06-30T03:04:40.000Z",
          "Titre": "Very disappointed in service",
          "Contenu": "Very disappointed in service.  70% of the time it says she's in Florida when she's really in Georgia. The main reason for buying this watch was for tracking and I don't trust it all all now.  Getting other people connected with her though the app was too difficult and there were days when it wouldn't even let me the MAIN ADMINISTRATOR call her"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rklbrady",
          "Nb_Reviews": 1,
          "Date": "2021-06-01T17:37:55.000Z",
          "Titre": "Love the watch but not customer support!",
          "Contenu": "I love the product and my child loves it but wish that customer support was a little better. I purchased the new TickTalk 4 from Kickstarter but did not receive any site points on myticktalk.com even though they pushed really hard for watches and accessories to be purchased from there. I have an account on myticktalk.com and can't attach my order to it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Apurv Singh",
          "Nb_Reviews": 1,
          "Date": "2021-11-11T13:27:34.000Z",
          "Titre": "Android 12 not supported location tracking is so so",
          "Contenu": "Android 12 is still not supported by the app. I am unable to make video calls from or to the device. Additionally, device lacks robust location tracking features. No way to setup geo fencing to notify that the watch is out of a certain area or when the device enters a specific area."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2021-05-21T22:24:25.000Z",
          "Titre": "Watch great bad customer service!",
          "Contenu": "The watch is great. If I have to rate the watch I’ll give it 5 stars but if I have to rate TickTalk.com I can’t give it 5 or 4. The auto we service is a truly important part of a company... try to call or chat for information. The lady that answer is the same in both! She is not helpful or nice! They have bad customer service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KeepingMyKidSafe",
          "Nb_Reviews": 1,
          "Date": "2022-03-25T20:38:11.000Z",
          "Titre": "I love the concept but…",
          "Contenu": "I love the concept but texts are a challenge as the voice to text is not accurate and we have yet to figure out how to type text. I’d have liked an owner’s manual to be included. I am a kinesthetic learner and that would make it easier for me to learn how to use this. Lastly, customer service is a challenge. My purchase was listed as shipped on a Friday. I paid an  exorbitant  amount of money for overnight shipping and it did not arrive until Monday.  Customer service does not understand my concern that no where in the policy does it say over night shipping on Friday is actually next business day. I wouldn’t have selected that option had I known."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MimiOfTwo",
          "Nb_Reviews": 1,
          "Date": "2021-01-16T05:40:33.000Z",
          "Titre": "Different band material!",
          "Contenu": "Love love love the functions of the watch I bought for my grandson! My only complaint is the band. My grandson complains that it’s hot &  “itchy”, & it’s too big. Therefore, he takes it off, & that’s not a good thing. Kinda defeats the purpose. I’d like to see a smaller (shorter) band made for smaller children, like a 4 yr old, & a different material that isn’t so hot & itchy for a little one. Thanks!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lucy Harrison",
          "Nb_Reviews": 1,
          "Date": "2021-06-10T18:56:08.000Z",
          "Titre": "I was unaware that a video call could…",
          "Contenu": "I was unaware that a video call could not go over 3 minutes. I thought this would be a good way for my daughter to keep in touch with her grandparents, and 3 minutes is just not enough time. Otherwise the product does work well. My daughter dislikes that the watch does not have games, but that was a plus for me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2021-12-14T22:36:33.000Z",
          "Titre": "Pretty ok",
          "Contenu": "I would prefer if authorized contacts could text outside the app using a regular phone. The location is sometimes very inaccurate, sometimes by more than a mile.He sometimes has a hard time hearing callers on the watch. Other than that, so far so good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AVA",
          "Nb_Reviews": 1,
          "Date": "2021-07-20T18:57:18.000Z",
          "Titre": "Tick Talk 3 vs Tick Talk 4",
          "Contenu": "My daughter has a Tick Talk 3 and it gives an almost exact location of the watch. However, we bought a Tick Talk 4 which gives a location that can be up to 2 miles away from the actual watch. This defeats the purpose of tracking location.The Tick Talk 4 is a bit clunky and seems to keep rotating around the wrist.The Tick Talk 3 velcro straps seem to loosen over time as well.  I wish the Mom and Dad icons would allow an actual picture to show. It doesn't make sense to have a picture uploaded and then it does not display when selecting a contact."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Yana Klimov",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T01:02:54.000Z",
          "Titre": "The watch is great but the themes are…",
          "Contenu": "The watch is great but the themes are not child friendly- I have 3 girls who don’t have much of options for themes on the watch-  and not very impressed with the clock face option- for how much the watch is not impressed. But the watch works great with the calling option."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KO",
          "Nb_Reviews": 1,
          "Date": "2020-12-21T16:00:30.000Z",
          "Titre": "I bought two tick-tock watches and…",
          "Contenu": "I bought two tick-tock watches and there was an add that said Black Friday $40 off. It was not honored which was very disappointing since I had a screenshot of the discount. Other than that, my experience was fine. We haven’t used the watches yet since they are Christmas gifts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike Cesca",
          "Nb_Reviews": 2,
          "Date": "2021-01-02T23:49:09.000Z",
          "Titre": "Exactly what I was looking for…with one huge issue",
          "Contenu": "This was exactly what I was looking for my 8 year old daughter.  I don't want her glued to a smart phone, but wanted to know where she is in the neighborhood at any time, can text or phone me and not have a huge monthly bill.  Though it works with T-Mobile which is a nice option.  Unfortunately this smartwatch ultimately was disappointing as it uses a low end battery.  Even on standby it won't last a day...my daughter uses it a few times and the battery is dead in 4 hours or less.  Can't give it more than 3 stars...close to greatness but falls short."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Krystal Dunn",
          "Nb_Reviews": 1,
          "Date": "2021-08-31T02:46:44.000Z",
          "Titre": "Screen went out",
          "Contenu": "I received the watch very quickly. My daughter was thrilled and immediately put it on to go show her friends. She wore it for 2 hours and I noticed the screen looked like it was going out.  I put it on charge then the next morning the screen would not come on at all. I believe it was a random defect because I have heard nothing but good things about this watch. I applaud their customer service department for a prompt response to my email. They sent me a return label and offered a free chum for the Inconvenience. Of course my daughter was devastated to have to send it back but hopefully we will not have this problem again. I’m still awaiting the replacement watch."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AM",
          "Nb_Reviews": 1,
          "Date": "2021-07-13T19:30:34.000Z",
          "Titre": "Great watch- location function needs improvement",
          "Contenu": "We have two TickTalk 4 watches for my 8 year old twins. There is much to like about these & overall we are happy with them the main disappointment is the location feature. Recent within the same hour while we were on the coast of Washington state my daughter was shown as being  in the ocean in town,  and most surprisingly in Los Angeles. Typically their location is off by several blocks in Seattle.  One of the reasons we got the watch is because they will be going on a road trip with their grandparents this summer and based on what we’ve seen I don’t think the location feature is going to be very insightful.Wish the location function was better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin McHugh",
          "Nb_Reviews": 1,
          "Date": "2022-06-20T21:55:44.000Z",
          "Titre": "Beware of the limited warranty",
          "Contenu": "After a little less than 1 year the band fractured at the connection to the camera.The limited warranty specifically excludes this as though it is a known issue."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 2,
          "Date": "2021-06-01T18:05:49.000Z",
          "Titre": "Customer service never got back to me…",
          "Contenu": "Customer service never got back to me on how to update new ticktalk 4. I called several times and was told someone would call me back and nothing. Other than that the product got to me quick and my daughter loves it!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Death Vader",
          "Nb_Reviews": 1,
          "Date": "2021-08-25T01:28:03.000Z",
          "Titre": "Video quality is bad enough that it…",
          "Contenu": "Video quality is bad enough that it probably shouldn’t be a feature. Pretty cool device with great gps tracking. Probably could cut out some unnecessary features and make it cheaper or produce a “basic” line."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Autumn Edge",
          "Nb_Reviews": 1,
          "Date": "2020-12-27T19:17:14.000Z",
          "Titre": "We ordered our daughter a watch for…",
          "Contenu": "We ordered our daughter a watch for Christmas. Design, colors, and apps are great!! The only issue I have found is that the battery runs down very quickly. Is this were to be fixed, I’d give the watch 5 stars."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bryan Wheeler",
          "Nb_Reviews": 1,
          "Date": "2021-06-03T23:45:58.000Z",
          "Titre": "I would have given 5 stars if the power…",
          "Contenu": "I would have given 5 stars if the power base I also baught had arrived with the watch. The Talk 4 is a very good watch for kids and works much better than the T-Mobile timex kids watch.  The customer service via email was alright but do not like having an email sent implying I did something wrong. I also have not heard back from them for almost 1.5 wks after I sent pics of the watch box and the shipping box to them. Reason again for 3 stars is I absolutely hate to pay for something and not receive it.  To me this is fraud.If I hear back and have the power base sent I will consider reevaluating to a 5 star rating.  As I said the watch itself is awesome for my 8 yr old. No need for a phone he may loss or drop and break and the tracking is pretty accurate.  Works very well with T-Mobile."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Megan",
          "Nb_Reviews": 1,
          "Date": "2021-08-02T22:25:01.000Z",
          "Titre": "This watch is great for my son, but broke quickly",
          "Contenu": "This watch is great for my son. He can keep track of time and we can get a hold off him. Unfortunately the side where the band goes through broke, so he was unable to wear it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mariah Elliott",
          "Nb_Reviews": 1,
          "Date": "2021-10-08T00:33:20.000Z",
          "Titre": "Not waterproof",
          "Contenu": "It works well enough. However, my kid took a shower with it on and it isn’t working now. I thought it would be more waterproof. Very expensive to try to replace. Sigh"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian Skehan",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T20:58:40.000Z",
          "Titre": "1) The clarity between the service of…",
          "Contenu": "1) The clarity between the service of Red Pocket being \"Supported with T-Mobile and AT&T\" or just solely using T-Mobile (In my case) is not clearly explained. There is extreme confusion that even your tech support could not explain correctly. 2) The typing keypad does not work well and many icons do not register a touch.3) There is no ability to turn off the Step-Counter.4) The watch does not always send a notification of a text message. This is extremely important!5) The WiFi connection does not appear to work when wanting to play music. This is false advertisement and just plainly a lie if we can't get it to work.Update 6 Apr, 2022...6) My son just received a call from a stranger who said she was returning a call from this number. As I questioned her she stated the call came to her as \"No caller ID\" yet, she called the number. This indicates she was lying and was working a scam. This is alarming!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roy",
          "Nb_Reviews": 1,
          "Date": "2021-08-12T22:35:23.000Z",
          "Titre": "Average",
          "Contenu": "Overall .. performs as described..Occasionally the watch will go \"offline\" at random times and duration.. and I am unable to communicate with my child .."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-05-10T00:00:46.000Z",
          "Titre": "I bought the watch for my Grandson",
          "Contenu": "I bought the watch for my Grandson, he is up and running; I have not connected yet.  It is a process to set up the app."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elizabeth Bayer",
          "Nb_Reviews": 1,
          "Date": "2021-06-12T17:09:52.000Z",
          "Titre": "Screen great; connection not the best",
          "Contenu": "Love the size of screen.  Not crazy about band on TickTalk 4.  Also have trouble with keeping watch connected to app.  Disconnects frequently."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Beth Lynne",
          "Nb_Reviews": 1,
          "Date": "2021-09-01T01:58:13.000Z",
          "Titre": "We love our TickTalk 4 with one major…",
          "Contenu": "We love our TickTalk 4 with one major problem. The band isn’t comfortable and doesn’t seem to have a way to change it. Neither of my kids can put it on easily or take it off easily which defeats the independence I was hoping to promote. If I could figure out how to get a Velcro style band on there they would wear it every day. Features are great. I considered TickTalk 3 to fix the band situation but I haven’t heard great things in the screen sensitivity. Plus, I already paid for these.  It’s a bummer bc I really want to love them. If anyone finds a band solution, please let me know. I’d be happy to shell out another $25 to make them more comfortable and on/off friendly. I’m considering creating some type of band cover that Velcros but I don’t know if it would be worth it. I’ve told them that I’m going to cancel red pocket if they don’t start wearing them more… giving it another month. How is this great tech worth it if it’s so uncomfortable? Both my kids are on the smaller end but they got home from school and immediately wanted it off."
        },
        {
          "Note": 3,
          "Lieu": "EG",
          "Pseudo": "Tahani Alorabi",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T19:45:18.000Z",
          "Titre": "The delivery is fast",
          "Contenu": "The delivery is fast But why did the driver ask for 57 SAR??NEXT TIME WRITE THE TOTAL PRICE"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Brennan hyska",
          "Nb_Reviews": 1,
          "Date": "2021-06-08T18:10:20.000Z",
          "Titre": "Mostly satisfied update are done quick…",
          "Contenu": "Mostly satisfied update are done quick but the usability of the watch when not with a carrier is not what I would like"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amanda Madrid",
          "Nb_Reviews": 1,
          "Date": "2021-09-02T02:40:14.000Z",
          "Titre": "There were no paper instructions",
          "Contenu": "There were no paper instructions, I relied on YouTube. For almost $200 per watch it should include a charger base."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mamamamamama",
          "Nb_Reviews": 1,
          "Date": "2021-10-08T15:58:36.000Z",
          "Titre": "Good and bad of TickTalk 4",
          "Contenu": "The speakerphone function does not let me hear my child's voice when his arm is hanging down to his side. The speakerphone seems to be inferior to that of the TickTalk 3.  He has to hold the watch phone right next to his mouth in order to be heard and that was not the case with the 3.  Also even though the phone is on silent, a beep is still made when a call is hung up. That is NOT silent mode. Please fix that.  I'm much prefer the external watch design of The ticktalk three because the tick tock four has so many little nooks and crannies that collect with dirt. The speaker on the floor is also wide open to collecting dirt.  I miss the Velcro band.Overall the telephone reception of the watch from a signal perspective, and from a programming perspective, seems to be superior.I don't like not being able to select what stations my son can listen to on iheartradio. Even the family app includes negative cultural references that I don't appreciate. There needs to be a selection of a Christian channel.  Many Christian families use this watch to safeguard their children from negative side effects of other phones.  Offer a Christian music station please. Thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Corina Tinoisamoa",
          "Nb_Reviews": 1,
          "Date": "2021-10-18T18:48:50.000Z",
          "Titre": "Update: 10-18-2021",
          "Contenu": "Update: I had finally received my sons replacement, even though it took awhile to get and 2 replacement later. He finally is able to wear it and I’m finally able to get peace knowing I can locate and talk to my son. The only thing I would say is I wish there was something to cover where the charger port is. I cover my sons with a small band aid. I live in AZ and it’s hot and it’s natural to sweat. Plus the band is made of silicone so It’s bound to happen.When I first received my sons watch it was working fine for about a month before it stopped charging. I purchased the 2 year extended warranty and made a claim. I sent my watch with the charger that it came with. When I received an email stating my watch was delivered. I checked my mail and received an envelope which was weird because I thought it would be in a box. But the envelope only had just the charger port. Not the wire or watch itself. It’s going on 3 weeks and still have not received my wire or watch. I’m so upset because I cannot get a hold of anybody on the phone and I keep getting an email saying it was delivered. I emailed them back with a picture of my mail. Im so upset because This whole warranty has been a nightmare and feels like I wasted money."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kristin",
          "Nb_Reviews": 1,
          "Date": "2021-08-16T19:01:15.000Z",
          "Titre": "Nice watch. Rough customer service.",
          "Contenu": "My son tried a few different watches before using TickTalk for almost a year. The TickTalk watch had a good platform and was easy to use. I like that I can reject all incoming calls, except for certain numbers. What really sold us was the band. Which unfortunately they got rid of on the TickTalk 4. This was a big problem with other watches always sliding around. He could have it for his exact size wrist. The battery life was VERY short. He needed to plug it in EVERY day or it would die. The charging port is awful. If it's not in the absolute perfect position it doesn't charge. After 10 months the watch stopped charging after installing a new update. Customer service was awful. Took days to get back to me. Promised 2-3 day turn around time and still nothing almost 2 weeks later. We liked the watch but was really frustrated with customer service saying the watch had water damage when the watch continued to work just fine, it just wouldn't charge after the update. After reading other reviews I realized the batteries all had problems and there were a lot of complaints. Clearly there's an issue with them that needs to be addressed. Sounds like the warranty is utter crap too. How frustrating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tony hanni",
          "Nb_Reviews": 2,
          "Date": "2021-10-14T13:25:51.000Z",
          "Titre": "Updated review by a real person!! Swing and a miss",
          "Contenu": "Updated Review: I have been using this watch for the last few weeks and after the update, I would like to change my review. Even though, what I said is still true, the watch has performed well thus far. There is still no better option out there. As far as kids watches go, there can be easy improvements, but it's still head above shoulders better than anything out there. And when you call them, they ANSWER!!!! I recommend this watchThe phone is huge, the music app never works, when you go to send a message the contacts do not autopopulate, only 1 person. The call reception is worse than the previous generation and that's its main function. PLUS!!!! you only have a few interactions with the staff to get help. I think they're done dealing with me so I'm left with this POS!!! could've done great, the concept is fabulous, no games. Theres too many yes people in that office who aren't giving you guys good advice moving forward, but whatever. I'm sure everyone wants to be surrounded by people who think their ideas are great, while destroying the product. In an effort to keep your job. problem is, is that's its still probably the best in class in that cztagory, feels like accepting subpar or wishing I can buy a previous generation"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fal",
          "Nb_Reviews": 1,
          "Date": "2021-10-19T09:44:48.000Z",
          "Titre": "What I Wish TickTalk 4 Had",
          "Contenu": "Edited to add: there is a “me” icon on the map, but no directions to my child. I would need to leave the app and type in a hopefully accurate address. What I wish it had:1) In-app GPS directions from me to my child 2) Louder phone call volume. Child must have quiet surroundings in order to hear me at all3) Geofencing (like Gizmo has) so I can be alerted when my child goes beyond set boundaries 4) Auto answer (like Gizmo has) so I can speak to child instantly Please add these features to updates on TickTalk4!What I love:1) Super hearing feature! Gizmo doesn’t have this, although their auto answer feature might accomplish something similar. 2) GPS tracker (though address shown when he’s home is always next door 😬, so accuracy could be an issue in an emergency). All watches may struggle with total accuracy. 3) My kid loves the 2-sided camera, allowing for fun picture taking and video calls. This sets it apart from Gizmo and other watches!4) Comes in black instead of ONLY retina-burning blue and pink like Gizmo offer. Note: cheapest phone plan available is $10/mo, so when considering the expense, you will not only be paying for the watch, but also an annual fee of at least $120...which is certainly worth lowering the risk of my child going missing, but still something to keep in mind."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lakeisha F.",
          "Nb_Reviews": 1,
          "Date": "2022-06-10T19:07:53.000Z",
          "Titre": "The TickTalk watch is pretty good",
          "Contenu": "The TickTalk watch is pretty good. It has some features that are important, like gps tracking, and blocking unknown callers. However, there are some features I wish it had and some I wish it didn’t have. It would be better if the contacts we approved to contact the watch did not have to download the app and create an account just to text and FaceTime. I understand the level of security but when you have over 20 contacts for your child, it gets tiring when everyone has to make an account and pair their phones to the watch. It’s just too many steps. It would be better if they could just contact the watch without having to do the whole set up. I also don’t like that we can’t see and review the messages between the other contacts. Since everyone has their own login, me as the admin, is unable to see what and who my child is texting. That’s a level of security that I think is very important. How are we supposed to monitor what is going on if we can’t review and see what is being said. Also, the in call volume on the watch is too low. There is no way to turn it up higher once it reached max level in a call and myself and children can’t hear the other person on the phone. Lastly, the contacts on the watch. If my child is scrolling to find someone specific to call and accidentally touches another name, it calls that person automatically. There should be a confirmation asking if they want to call that contact so it gives them the option to back out and keep scrolling. Overall, the watch is okay, if the features I mentioned isn’t important to a potential customer then I would recommend it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ross M",
          "Nb_Reviews": 1,
          "Date": "2020-12-28T17:04:28.000Z",
          "Titre": "Bought 2 TT3s, one worked great, the other not so much",
          "Contenu": "We've been looking for two SIM watches for about a year.  We were convinced the TT3 would be better for us than the Gizmo (Verizon).  The website was helpful, and Red Pocket seemed like a good choice for us (also a good website).  We received the watches a few days before Christmas and set them up (not the easiest process, but the videos on the TT website were clear and helpful.   Where we ran into trouble was 1) One of the two TT3s we bought worked great, basically just as advertised.  The other, however, had a microphone issue -- my youngest could hear me, but I couldn't hear her.  2) There was no live tech support from Xmas day until the following Monday!!!  That was a total shock.  If I'm releasing a new version of my tech device, I can't imagine not having live tech support for 4 days after 1000s of these watches are opened by eager children on Christmas.  We then dialed in Monday and the chat-support has seemed to be pretty clearly totally overwhelmed.  They're supplying us with a return label and are offering to replace her band with a color she's more excited about, so that's great.  We'll just see if the return goes smoothly (crossed fingers).  If so, and the new watch is delivered as promised and works like my other daughter's, then this review would go up to 4 stars -- when working, the watches seem really good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Randi Dooley",
          "Nb_Reviews": 1,
          "Date": "2021-06-01T20:17:00.000Z",
          "Titre": "TickTalkers For Life",
          "Contenu": "First, I want to start out saying, we love TickTalk. We have 3. Two TickTalk 3s and now a 4. We’re customers for the long haul! The Kickstarter campaign and communication about the product were tremendous! Shipping was great. We love the easy setup and the app is GREAT!I do have some feedback about the 4 and things were noticing.1. When my son makes a call or receives a call, the screen then dims and he’s never able to hit the “end” button. Even if he presses the wake button, it doesn’t take him to the call screen. It just takes him to all of his other options, so the call just keeps going in the background. Also when he’s on a screen, there isn’t a back button or anything to get out of the screen he’s in. Maybe we’re missing something.2. Our pictures do not appear on his screen when we call him or he calls us. It just says our names even though we’re added as contacts with pictures (like I said, we have the 3s and it works on those. The 4 is set up the same way with our pictures). I called when we first got it, and they said this is a glitch and an update would be released within the week to fix it but it’s still happening.3. While I love the improvement and higher quality of the watch and screen (MUCH easier to press options ☺️), are there talks of a screen protector? Within a day of my son wearing it, there were significant scratches. Since, we’ve put liquid glass on it but I’m not sure how well that’ll do.Just some questions. No concerns ☺️ Thank you for your amazing product!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Juan Luis Delgado",
          "Nb_Reviews": 2,
          "Date": "2021-12-25T16:09:35.000Z",
          "Titre": "Phone works well",
          "Contenu": "Phone works well. App is giving some problems to set up"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alberto",
          "Nb_Reviews": 1,
          "Date": "2022-09-17T21:08:21.000Z",
          "Titre": "A rough user experience but with a decent device (TickTalk 4)",
          "Contenu": "The version that ended up ordered was on the AT&T network instead of T-Mobile. The interface and cart details could be improved to avoid this. Then I got a T-Mobile SIM but couldn't activate it on the TickTalk Wireless site. Turns out that although the SIM was white-colored and the QR code sticker took me to the TickTalk Wireless site, it was a Red Pocket SIM. There was no visual or evident indication of the Red Pocket network. How would a customer know this? After waiting the whole weekend to talk to support on Monday, I was then thrown at the Red Pocket site and basically told to \"figure it out... you have to call Red Pocket if you encounter any problems\". Not a great customer experience. I was then able to create an account and figure things out on my own. Red Pocket's interface is bad. The overall activation experience is cumbersome and not user friendly. It would be nice if customers could have the ability to choose the wireless network provider when making their purchase or if TickTalk could properly identify the SIM card or provide instructions to identify it.The overall apps/sites experience is also not great. You have 3 different usernames/passwords: one for the TickTalk site (orders), another for TickTalk Wireless, and then another one for the mobile app. The whole thing is complicated if you are not tech savvy. Also, the login screen in the mobile app is not password manager friendly.That said, there are not many comparable smartwatches out there, so customers (like me) do their best to navigate these user experience issues. Once you configure everything, I can't deny that the smartwatch has been pretty reliable. Parental controls are a little tricky to understand at first, but they have some very good options. It's only a week of use, but the device has already been a game changer in terms of communicating and knowing where our kid is. The group chat feature has been the best way to simplify communications between our kid and both of us parents. The charger is just a USB A cable with a special terminal connector that plugs in the back of the watch. It would be nice if the USB wall charger was provided with the device. After reading so many reviews and looking at all options available (in 2022), my experience is that the TickTalk 4 seems the best option to give our kid a phone-like device with parental controls without actually handing them a phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "WENDYLIZ GUZMAN",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T00:44:03.000Z",
          "Titre": "Like is so far only thing I don’t like…",
          "Contenu": "Like is so far only thing I don’t like is that it gets hot"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matt Read",
          "Nb_Reviews": 1,
          "Date": "2021-06-09T13:12:43.000Z",
          "Titre": "Hanging in there as we wait....",
          "Contenu": "I contacted technical support through email when one of our Tick Talk 4 watches kept disconnecting from the network while he was at school.  This made it unable to track him and caused the watch to stay in do not disturb mode (DND) until we restarted it.  We have a second Tick Talk 4 for our other child that works without issue while he is at the same school.The response from technical support was that I should reset the watch and start from scratch.  I was not pleased with this answer as it didn't make sense as the watch worked perfectly when it was not in DND mode.  I then asked if I could restore my son's data from the T-Cloud when I reset it, but I was told that I couldn't and my son would lose all of his settings and photos.The next thing that happened was the watch just shut off and wouldn't turn back on.  When I contacted technical support again, I was told that it may be because his watch was out of data.  As you can understand, this was a frustrating suggestion and I responded to let them know that.I was then told that I could send the watch in for inspection, but that if the watch has any water damage, then we have to pay $100.  This seems like a setup since the watch never worked right from the first day we received it, yet this allows the customer service department to declare it is our fault without proof.  The other issue we now have is that we are without a watch for our son during the Summer.  I use this to allow him to go to the park and visit friends so I may keep an eye on him while I work from home.  It may be several weeks (they use USPS for mailing) for the broken watch to be received and the new watch to arrive at our house.  I would make the following recommendations to Tick Talk 4 due to my situation:1.  When a watch doesn't work right from the beginning, please do not threaten a $100 fine for water damage.  2. Send a replacement watch while the damaged watch is being sent back.  You could always put a $100 hold on the customer's card while you inspect it.  This allows the customer to use the product while they wait for the damaged watch to be inspected."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Luis Endo",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:34:08.000Z",
          "Titre": "Work in Brazil",
          "Contenu": "Brazilian phone numbers does not seems to be configured well. Internet functions work well"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David McKinley",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:34:13.000Z",
          "Titre": "Customer service is solid",
          "Contenu": "Customer service is solid, and the watch is great for a young teen/tween.  The app is a bit buggy at times."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nicole Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T15:05:58.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "We chose the TickTalk watch so my 9 year old could send actual text messages.  It is wonderful when it is working and she will check in frequently!  The GPS is typically very accurate for us.  The watch itself is a bit bulky compared to others but it doesn't seem to bother her.  We have had to send the watch in a twice as it stopped working.  Both times, the customer service has been excellent.  They pick up the phone immediately, work hard to trouble shoot, and respond near immediately when the watch is received for repair.  Tiffany especially went above and beyond to help with the most recent repair."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stan Ku",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T22:17:02.000Z",
          "Titre": "Great peace-of-mind, excellent customer service",
          "Contenu": "Have the watch for a little over a year for my 9-year old boy. Having him wearing the watch when he's out playing with neighbors is a nice peace-of-mind. Kids are not very careful with wearable devices, and I need to have the watch replaced twice now with screen issues, but TickTalk's customer service is excellent, and I can always reach a real person to help when needed - this unfortunately is not a standard expectation nowadays, so I really appreciate the personal touch."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Germain Uitz",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T06:53:50.000Z",
          "Titre": "The watch has honestly surprised me on…",
          "Contenu": "The watch has honestly surprised me on how advanced it works and how much you can control in the app and how clear the images are. All in all has been great for my first time purchasing a watch for my daughter and it gives me a sense of comfort. My only drawback was the GPS using hotspot and approximate location rather than exact location but maybe im missing something. Would definately reccomend"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kiandra Williams",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T19:56:33.000Z",
          "Titre": "A Great Watch for Kids!",
          "Contenu": "We had recently moved to a new state and wanted to sign our 6 yr old up for summer camp in our new area. We felt like he was too young for a phone but really wanted a way to communicate with him and to be able to keep tabs on his location. After doing a little research for the options that are currently available, we decided on the Tick Talk watch. It has definitely met and exceeded expectations for both of us parents, and our 6 yr old loves all of the features as well.We did have an issue with the band snapping off about 2 months after purchasing (daily use), but the company was quick to respond, and getting it replaced was quite easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shannon Gowen",
          "Nb_Reviews": 2,
          "Date": "2023-09-16T22:58:16.000Z",
          "Titre": "Intuitive watch to stay connected with…",
          "Contenu": "Intuitive watch to stay connected with your child in a safe way! This watch is much bulkier than others I’ve tried, but I love all the parental settings and video calling option that many others don’t have! I bought this for my 6 yr old to stay connected with both parents (divorced) while with the other. Would recommend!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Katy",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T15:26:02.000Z",
          "Titre": "Good watch for my daughter",
          "Contenu": "watch is working as it should. Had it for almost a year now. It would be better if the GPS location is accurate, it show my daughter in a different state sometimes. Pros:Remote listeningparental controlDo not disturb mode (best part of the watch, no accidental dial)Cons:GPS can be betterwatch is bulkyshould come with free screen protector (kids are not careful)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T07:04:57.000Z",
          "Titre": "Very good overall, but a few accidental calls",
          "Contenu": "The Tick Talk 4 has been very good overall in the 6 months our daughter has used it but there have been a few times that the watch has called out on its own.  I’m not sure if the shortcut key is a bit sticky or if she accidentally hits the button but sometimes I’ll get a call that wasn’t intended."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rae Miller",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T04:31:51.000Z",
          "Titre": "8 year old loves it, mom does too",
          "Contenu": "This smart watch was very easy to set up and my 8 year loves exploring it. As a parent, I love the safety measures that he can't access the internet or make outgoing calls or texts to any phone number I don't pre-program. That said, as a heads up, he can receive incoming calls from anyone initially (but you can block unknown calls, thank goodness)! My kiddo absolutely loves the texting feature and that there is a kid-friendly spooky podcast through the I-heart-radio built-in app. The only downside so far (aside from battery life) is that it's a little too easy for him to accidentally call me, and on the first day, it happened at least 10-15 times. Overall though, this is an excellent product, and my kiddo is thrilled."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa Bagger",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T01:15:40.000Z",
          "Titre": "Get the insurance!",
          "Contenu": "This is our second Tick Talk purchase because our son forgot he was wearing it and jumped in the lake.  We like the watch enough that we purchased another one, but certainly wish we would have purchased the insurance the first time. :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hatem Gubein",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T01:42:53.000Z",
          "Titre": "Getting Tick Talk 4 for my son provides independence",
          "Contenu": "Getting Tick Talk 4 for my son has been a great decision. He has the ability to feel independent, while I know that he’s safe. He enjoys the long battery life, dual cameras, being able to stream music and just having his ‘phone’ on his wrist. Customer service has also been amazing as they are direct and respond quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yating Chang",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T01:22:06.000Z",
          "Titre": "My kid loves the watch!",
          "Contenu": "My kid loves the watch and wears it all the time. The screen is bright and the functionality is honestly hard to beat after searching high and low at all the options out there. It was easy to set up and I love the fact that parents can control everything through the app. The app was a pleasant surprise being very responsive and easy to use. The only thing I would call out is the calling feature. It definitely works but the calls can drop sometimes but the texting feature seems solid. Overall great watch that kids will enjoy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Evan R.",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T15:04:10.000Z",
          "Titre": "Bought their TickTalk 4 watch",
          "Contenu": "Bought their TickTalk 4 watch. Overall this is a good watch for small kids. They can call you quite easily. You can listen in to make sure they're OK. The battery life is good unless the reception is poor. Then it can drain quickly searching for a signal. A flaw in the watches design is how it charges. Bare connection on the underside are susceptible to sweat and water (like when a small child washes their hands). Another issue is the GPS positioning. Sometimes it's spot on, others it's a 1/2 mile off. But like I said, overall it's a good watch for keeping an eye on your child. Their support / customer service is pretty responsive and helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "S N",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T21:00:54.000Z",
          "Titre": "Watch is cool and good, so far, but...",
          "Contenu": "Watch is cool and good, so far, but Customer Service has been a little difficult getting full and complete answers out of, which is the reason why I only gave 4/5 stars. When signing up for the plan, there aren't any details on overages, fees, additional charges, etc., and when I reached out to TickTalk to find out more, they never really answered my questions fully and it took a few back-and-forth attempts for them to even respond to my queries. The nice thing is, they were prompt in their replies and the watch is working great, so far!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rahul Golani",
          "Nb_Reviews": 1,
          "Date": "2022-11-27T23:54:40.000Z",
          "Titre": "TickTalk4 experience",
          "Contenu": "Ordered a TickTalk4 from the company directly for Black Friday. Plugged in my data only SIM card and most functions work flawlessly. Of course you can't dial out but that was expected with a data only SIM card. What I would improve - (1) Allow parents to change icon order in the watch UI, (2) Allow facetalk/facetime to work on cellular connections not just WiFi. Overall good experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John And Les",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T12:46:57.000Z",
          "Titre": "We’ve ordered 2 TickTalk 4 watches for…",
          "Contenu": "We’ve ordered 2 TickTalk 4 watches for our sons (8 and 6), and they’ve been pretty easy for them to use to message or call us if needed and have been a mostly good purchase. The only real issue we’ve run into is with one of the watches the hinge where the band attaches to the case, it has broken twice, this last time after only 5 months. The watches are not generally worn unless we’re out of the house and not used during play. The original watch has several years of use without issue. What’s offset the issue with the second watch is the great customer support we’ve experienced, most recently with Tiffiny Adams who quickly responded to our message with the offer to replace the watch. Great customer service is definitely keeping us with the company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wil Yumz",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T16:30:30.000Z",
          "Titre": "kid loves it",
          "Contenu": "purchased ticktalk4 for our 10 yr old...we didn't want to get him a device which can access an internet browser or social media. This turned out to be a great purchase...he loved the watch.Pros: Good build quality, clear and responsive touch screen, has gps tracking, works w/ Mint mobile, can limit usage and set times when watch can't be used for activities other than tracking and clock. Battery can be good for a little over a day when you set the location tracking to on demand and do not disturb modes are set up.Cons: Battery life might be a problem if you leave tracking on often, the watch is big for smaller kids, on screen keyboard typing (when setting up wifi, etc.) is painful to use, direct messaging only within the ticktalk app if your firewall is enabled, ticktalk app does take a little time to set up fully and there is a small learning curve for the parents.Overall: good features, quality build, and just what we needed for our kid."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mat",
          "Nb_Reviews": 2,
          "Date": "2022-12-06T03:39:31.000Z",
          "Titre": "Got it for our son for his 7th bday",
          "Contenu": "Got it for our son for his 7th bday, Okay watch, lacks some configuration options I’d like to see to add some additional limitations to what my son can do. Also it’s impossible or I’m doing it wrong adding a dnd schedule during evening until next morning to prevent him being able to mess with it when he’s supposed to sleep. Simply doesn’t allow schedule to be from one day into another…other than that, call quality is good let’s hope the watch lasts some years."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hayley",
          "Nb_Reviews": 2,
          "Date": "2023-01-14T02:36:50.000Z",
          "Titre": "My son loves his watch!",
          "Contenu": "My son loves his watch! The tracking isn’t as reliable as I had hoped (it showed him states away today when he was on the school bus headed home), but I love the ability to reach him immediately when necessary! I don’t care for some of the settings, as I thought he’d be able to FaceTime his friends that also have the watch (he can’t FaceTime or text them). There is a learning curve that I’m still working on, but overall the service has been good and the ability to reach my child has been wonderful. The watch seems durable-although bulky, but does seem like it will withstand a child for a while."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joel S",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T12:48:46.000Z",
          "Titre": "TickTalk4 - Good upgrade",
          "Contenu": "Overall the TickTalk4 watch is a big improvement over the previous model and is well worth the invetstment. My child really likes the music app addition. One area that needs improvement is the SIM cover on the back. It is extremely difficult to remove even with the removal tool and did hit me in the face"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Preston Sharpe",
          "Nb_Reviews": 1,
          "Date": "2022-10-08T17:13:35.000Z",
          "Titre": "A Great Way to communicate and keep up with your kid's whereabouts",
          "Contenu": "Overall, pretty pleased with the product. Can locate my child and communicate if need be. My only real gripe thus far is that there seems to be no way to monitor minutes used on the app or the watch. Perhaps, an intentional decision. Other than that, the product works as intended. Pleased customer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "D Miller",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T04:05:16.000Z",
          "Titre": "Quick setup, works well, a few quirks, kids love it",
          "Contenu": "I bought one for each of my sons. They are pretty easy to set up but there are a few things that could be improved. It would be nice to manage contacts for both devices in one place instead of having to do that for each one from the app. It would also be nice if you could send texts directly to the phone instead of having to use the app for messages. It would be nice if you could toggle calls and/or texts messaging for contacts so you didn’t have to set up the app for each person that wanted to message the device. Also, my sons can’t message each other’s TickTalk4 except through a group message. Please make texting the device possible instead of requiring the app for messages."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brittany Jacobs",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T18:41:51.000Z",
          "Titre": "great way to stay connected",
          "Contenu": "Ticktalk has been a great way to connect with my ten year old when she's out of the house, without getting her a phone. I also like the tracking feature so I can see when the school bus is on its way. I wish the GPS was a little more accurate and refreshed more often, but overall I am happy with function. The band randomly broke though after just a couple months of use. Customer service has always been very helpful and responsive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "T C",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T15:04:00.000Z",
          "Titre": "Great watch so far",
          "Contenu": "We’ve had the watch for about a week now, and it works better than another watch we tried. Had some issues at first getting the calls to work. Once we turned off face call using wi fi only, we had much better luck getting it to work. Love the features, especially the music. School mode blocks everything, which wasn’t an option on the other watch brand. Also, really love the option to give limited access to family and friends, instead of everyone having full permission to use it. The plan cost $10 a month, and gives plenty of minutes and texts. So far so good, but we’ll see how it holds up after a while."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sherry Fitts",
          "Nb_Reviews": 1,
          "Date": "2023-02-19T01:25:01.000Z",
          "Titre": "Grandparents’ dream connection",
          "Contenu": "Gave our 8 year old grandson who lives in a different town a Tick Talk 4. We love being able to talk and text with him! The battery life isn’t great and the gps isn’t perfect. Usually shows he’s a couple of houses away from his home. But our main purpose was to be able to chat with him at our convenience and not have to wait until his parents phones were free Also love the safety of him not being able to use it unless we approve the contact. Overall very happy with purchase!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-30T15:54:07.000Z",
          "Titre": "Great customer service",
          "Contenu": "Customer service is great.  Watch is generally very good, but my son is starting to complain that it is very bulky.  And sometimes the location function is not accurate.But 5 stars for customer service, which has been very responsive every time I've had a question regarding the watch."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kimberly R.",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T19:03:16.000Z",
          "Titre": "Christmas Gift replacement",
          "Contenu": "We received the watch quickly and very easy set up. However quality through shipping made this review 4 star because the band broke and the watch needed to be returned. Solid 4 star because customer service was great and resolved the issue quickly in order to do a replacement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T04:55:48.000Z",
          "Titre": "This watch is great",
          "Contenu": "This watch is great - my son loves it and it's easy to keep in touch with him while he's out in the neighborhood. We've had a few warranty issues but Tiffiny and the customer service team always respond very quickly to solve any issues."
        },
        {
          "Note": 4,
          "Lieu": "RO",
          "Pseudo": "Albert Radu",
          "Nb_Reviews": 1,
          "Date": "2023-05-28T07:41:44.000Z",
          "Titre": "Good but not perfect.",
          "Contenu": "I have purchased two pcs. of TickTalk 4 watches for my 6 and 8-year-old boys. It quickly became their number one toy.But as a parent, I have a few concerns: because we live in Romania, Europe, we are unable to use the music application, which is promoted on the website and is not explicitly mentioned to be available only in the US. The second aspect is GPS tracking, which is inaccurate both outdoors and indoors where the phone is connected to the family's Wi-Fi network.In the dedicated application, after each action I perform, the message \"operation successful\" appears and remains on the screen until I dismiss it. I would prefer it to automatically disappear after 1-2 seconds.I don't know how other models behave, that's why I'm only talking about my experience with these watches. I offer this feedback for the improvement of the services provided and not as a complaint."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 3,
          "Date": "2022-10-15T02:08:21.000Z",
          "Titre": "1st phone/watch for my 9yo",
          "Contenu": "This is the 1st phone/watch for my 9yo. We were looking for a child-safe watch that would have specific features like GPS, messaging AND picture/video capabilities. So, we saw the TickTalk4 had all of those and purchased it. PROS: Overall, it's great. High quality. Got to us fast. Got an answer back quickly I had asked. Fair price. Easy setup. CONS: Things that I hope will be improved with the next edition: sound quality, added/approved people able to send regular text messages, different monthly data plan options, and we are having issues with the wi-fi connection to allow the watch to do wi-fi calls and video chat. Thank you for giving us a good, safe and reliable option for our family."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jer",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T21:50:05.000Z",
          "Titre": "Great and safe watch for kids",
          "Contenu": "My son had his Ticktalk4 for almost a year and he really enjoys it. He loves the design of it and doesn't think that it is too big. he enjoys being able to customize a few things and what we like the most is to stay connected via text or calls.We did not give 5 stars because the GPS connection is sometimes off (like placing my son in chicago whereas we are in Cleveland) and because the brand broke after 9 months. But the customer service was very responsive to help us deal with the issue.The app is easy to use.Overall i recommend it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rob Miller",
          "Nb_Reviews": 2,
          "Date": "2022-12-22T22:16:41.000Z",
          "Titre": "Haven't used it much yet",
          "Contenu": "Haven't used it much yet, just setting it up for Xmas. I don't like how you can't use the watch while it's charging, and I expected for it to be able to video call at any time, not just when it's connected to wifi, but other than that it seems fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mila",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T01:38:42.000Z",
          "Titre": "location is off",
          "Contenu": "Love the watch however his location is not 100% accurate, it is off half a mile which is verry important when he is at a friends house but it shows he is in the neighbourhood pk."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "s.s.",
          "Nb_Reviews": 2,
          "Date": "2023-03-22T22:53:08.000Z",
          "Titre": "Overall Pretty Good",
          "Contenu": "Likes:  Good call and video quality; remote check in feature,  decent battery life,  feels sturdy,  helpful customer serviceWhat could be better:  A video remote check in feature would be nice; need ability to rearrange watch icons, would be nice to be able to input contacts one time and apply it to multiple watches,  weekend customer service needed"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dara Monestime",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T19:57:58.000Z",
          "Titre": "I contacted your support desk VA email…",
          "Contenu": "I contacted your support desk via email twice this week to let the support desk know that we did not get our package and we're trying to figure out why we did not get our package. No one from support desk responded. I needed to know where FedEx or which door they drop it at so that I can go to that neighbor and ask them for the package. I sent that email to the support email about 2 hours after FedEx claim to have dropped the package. I haven't heard from anyone.Update: Called their customer service spoke to Tiffany they apologized immediately and reached out to the delivery agency. The product was in the mailbox. When you received it Thank you Tiffany from customer service. My only advice is to make clear in bold capitalized letters where the product is placed to minimize confusion. That would have allowed me to give a five-star."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 2,
          "Date": "2023-01-14T16:19:27.000Z",
          "Titre": "We gave this watch to my daughter for…",
          "Contenu": "We gave this watch to my daughter for her birthday. She loves it and it has a bunch of cool features. Unfortunately the watch band broke off of the watch within 2 weeks. Customer service has been good so far about replacing the defective product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NM",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T18:44:41.000Z",
          "Titre": "Loved This Watch - Literally a Life Saver",
          "Contenu": "We bought this watch for our 9 year old for a gift and it was one of the best decisions we made - it literally saved a life! Out child was walking with his grandparent with they tripped and fell and were unconsious. Our child was able to call for emergency help as well as contact us using the watch to let us know what happened. Using the app we were able to locate their whereabouts and get to them quickly. Sadly the watch strap recently broke and the watch stopped charging. I was able to easily contact customer service and they walked me through the replacement steps. We eagerly await the new watch!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michele MaGinn",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T23:33:57.000Z",
          "Titre": "We had an issue with the on/off button…",
          "Contenu": "We had an issue with the on/off button approx 3 months after our purchase. We returned the defective watch and we were given a new replacement watch with no charge in a timely manner :)!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diyana",
          "Nb_Reviews": 1,
          "Date": "2022-10-06T23:43:49.000Z",
          "Titre": "Ticktalk 4",
          "Contenu": "So far the TickTalk watch has been very reliable for my child and I. It’s a great way for her to learn responsibility and a little more organization. Also as a parent I feel at ease knowing I can check on her whenever we’re part."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J. Merritt",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T03:24:23.000Z",
          "Titre": "The TickTalk4 is great for parents…",
          "Contenu": "The TickTalk4 is great for parents needing a device that gives you access to your kids. Parents have total control and supervision of the watch. My son loves it. He is very comfortable wearing it all day. My only concern about the Tick Talk4 is that the location of the watch tends to get off. When we are home, it always has his location across the street from our home. That’s the only thing I would love to see updated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Tonn",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T01:37:41.000Z",
          "Titre": "Positives & Negatives",
          "Contenu": "Overall, this is a great watch.  We love it, but there are some things I hope improve.Positives:+Great Price Point+Very Durable+Dual Camera+Daughter loves itNegative:-Not a lot to do with app.  I would like to see a digi pet or something fun.-Sometimes the watch disconnects for wifi/data.  The watch still works and you can call, but sending pictures and video gets difficult.-Interface is effective, but not inspiring.  I could use some more \"wow\" in the design."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark C.",
          "Nb_Reviews": 2,
          "Date": "2022-11-16T20:18:13.000Z",
          "Titre": "Smart product, innovative",
          "Contenu": "We purchased a TickTalk 4 watch for our daughter. It allows us to communicate with her when she is out of the house and we need to arrange where to pick up from school, when she needs to come home from a friend's house, and know where she is if we haven't heard from her. RedPocket is a decent cell service for a reasonable price.Pros:- Decent call quality- Limit phone calls to/from known contacts- Prevents text messages from unknown contacts and sends them to Admin phone (parent)- Useful shortcuts to call mom/dad- Recorded voice messages are very usefulCons:- Will not let you type a text message - must be transcribed voice-to-text- Will not let you face time on data- Does not use phone plan \"text message\" allotment for sending texts - that uses data- Requires data to provide GPS (we use a not-unlimited RedPocket plan, so when data runs out, you can't know where the watch is until the new billing cycle)- Limited emojis/stickers for text messaging- Touch screen is somewhat difficult to use and not very responsive around the edges"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Denise A",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T03:22:17.000Z",
          "Titre": "Great Option to Replace Cell Phones",
          "Contenu": "We received the watch but it was delivered without the requested SIM card. We contacted customer service and they were able to ship it out the same day. We received it within 2 days. The setup has been a little tricky but over all not bad. I am really hoping the functionality is as good as I feel like it will be. We will update again once we are really into our 30 day window. I have had to call customer service twice & have been pleasantly surprised. So far we are happy with this purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kate",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T15:22:59.000Z",
          "Titre": "Our son loves his watch",
          "Contenu": "Our son loves his watch. We got the black one so it resembles a military, police officer type watch look. It has been extremely useful to call and talk to him and vice versa. We had 1 issue with it tracking him. It said he was stillOn our street when he was actually at school. But it corrected itself. We decided on this watch brand because in the future I want to be able to send him reminders and things."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ashley Benton",
          "Nb_Reviews": 1,
          "Date": "2022-11-20T20:44:05.000Z",
          "Titre": "This watch has been great for my son",
          "Contenu": "This watch has been great for my son.  He's able to text me or call anyone he wants with no issues.  The battery doesn't last as long as I'd like but it works for his purposes.  Customer service has been exactly what I could ask for.   When I had difficulties they have been responsive and assisted with all issues I could ask for."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rich",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T15:31:16.000Z",
          "Titre": "Solid watch for an 8 year old",
          "Contenu": "I was looking for a watch for my 8 year old son. He spends most of his time outside with his buddies running through the neighborhood. The ticktalk watch has been a perfect fit for him. It has all the security I was looking for. I have the ability to block outside calls and set his contacts. The watch has a GPS tracker so I know where he’s at in the neighborhood and a bunch of fun features for him to play with. The only knock I would have is its durability, but that could be my sons fault. The customer service team has been great so it’s not really an issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mrs Archna Patel",
          "Nb_Reviews": 4,
          "Date": "2023-03-11T03:44:41.000Z",
          "Titre": "Game Changer",
          "Contenu": "My son LOVES to run around and away from us. No matter how often we tell him to stay close by, he always gets excited and just runs off. We got this watch as a way to be able to keep track of him and also be and to reach him. This watch has been a game changer and has reduced my anxiety 10-fold. The sound quality of the calls are excellent, I like how we can control everything through the app, and my son can take pics and texts us whenever his watch is active. The only reason for 4 stars is that the watch is a bit bulky and broke within 4 months of use. My son is 7, and I don't think he is the most responsible with his watch, but at the same time I don't think he was intentionally rough with the watch for it to break so soon. However, customer service has been extremely helpful and are working to help us resolve the issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Drew",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T19:28:28.000Z",
          "Titre": "4 stars for the watch, 5 for the service",
          "Contenu": "For the watch, I will give 4 stars. It has met our expectations and done the job we wanted it to.We gave this to my elementary school aged son. As parents, we like that we can keep in touch with him easily and can see his location if there are any concerns. Being strapped to his wrist, there is lower risk of losing it compared to a smartphone.The watch is not as full featured as an Apple or Android smart watch, but it's appropriate for this age group. It is also rugged and the watch itself has withstood the rigors of an active 10 year old. I recommend purchasing the screen protector to mitigate scratching to the watch face itself.My son enjoyed the additional independence the watch afforded, and particularly enjoyed taking pictures on the built-in camera.The reasons why I'd not give the watch 5 stars are that the strap broke (I see other reviewers had the same issue), and backups are not automatic. We lost my son's pictures due to the watch failing to power on right around the time I was sending it in for the strap issue. I was advised that we should run the backup weekly or so to avoid this in the future.Tiffiny has been great to work with as we navigated the warranty process for addressing the broken strap and non-powering watch issues. She has responded promptly to my questions and has come to a fair resolution. Sometimes devices break, and it's frustrating, but having effective customer service smooths over those issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Olga",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T18:11:42.000Z",
          "Titre": "My kid still gets phone calls that go…",
          "Contenu": "My kid gets phone calls that go through to his watch from unapproved numbers. Got an answer from ticktalk the same day, changed the settings, hopefully it works!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lynndon",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T07:24:35.000Z",
          "Titre": "Great multipurpose communication device.",
          "Contenu": "We have very pleased with basic functions such as texting, voice calls and location tracking. My son loves the music and the activity tracker as well."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Leah Barker",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T22:02:09.000Z",
          "Titre": "I love the product",
          "Contenu": "I love the product. By far the best watch without games and internet. My only complaint is that the tick talk 4 is not waterproof and it is extremely bulky. Geo fencing alerts would be nice but not a must have since the gps tracking is accurate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jensen",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T00:17:01.000Z",
          "Titre": "Ticktalk 4",
          "Contenu": "We received the watch Friday night. Packaging is nice.Setup: setup is easy and great instructions on getting started were provided. We used the SIM card that came with the watch and it was cheap to add a line. The one thing that was frustrating is we were unable to complete setup because the watch kept saying deactivated. Because it was the weekend we were unable to fix it with customer service. Monday I did the live chat and they quickly activated it. Natasha did a great job with customer service. Setup on the app is easy and I like the parental controls. Functionality: my child loves the watch, he thinks it’s so cool. Messages work well but I wish that the messages would go straight to my phone instead of the app but I understand the security reasons. It would be nice if the app notification on my phone gave me a preview of the message. GPS works well to see where he is at. Overall we are pleased with the TickTalk 4 watch so far and look forward to using it more."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Phoebe",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T21:34:27.000Z",
          "Titre": "As someone who is not technologically…",
          "Contenu": "As someone who is not technologically advanced, it was mostly simple to set up, and when I did have trouble, customer service was a quick 1 minute call away to help.   👍"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hailey Sherbondy",
          "Nb_Reviews": 1,
          "Date": "2022-12-29T14:41:10.000Z",
          "Titre": "Overall great",
          "Contenu": "My kids got tick talk watches for Christmas, so far they work great. Battery life could be a bit longer. Everything “fun” about the watches will drain the battery quicker. Video calls are limited to 3 minutes and will automatically end. But I wanted the watches for peace of mind and they serve that purpose well. I can track their location, and I can contact them at all times."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gentry Lange",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T04:46:27.000Z",
          "Titre": "The phone is everything we wanted so…",
          "Contenu": "The phone is everything we wanted so far. Basic phone service, no games, gps tracking.Hardest part was understanding the phone plan setup. But in the end it's actually easy and I made it harder than I should have."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Omar Sabbahi",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T04:02:15.000Z",
          "Titre": "Product is great and very user…",
          "Contenu": "Product is great and very user friendly. It took us time to get all the right settings in place but overall it does the job. Wished we could customize the do not disturb or school profile options to keep some reminders on. Kids is happy!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chauntel Burdette",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T21:51:07.000Z",
          "Titre": "Great watch for kids",
          "Contenu": "We have been happy with the tilk talk 3 watch.  We have had some issues but the customer service has been awesome.  They respond quickly and have solutions.  My daughter loves her watch and uses it frequently.  It gives me peace of mind when she is out with her friends or baby sitting."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lupe",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T01:47:20.000Z",
          "Titre": "I got this watch for my son and it’s…",
          "Contenu": "I got this watch for my son and it’s definitely worth it! As a worried mother having my child in school Its given me some sort of peace! Super easy to use with the app. I do wish there was a way to change the language though, just like a phone. Other than that its been great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Brooks",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T23:30:50.000Z",
          "Titre": "TickTalk 4, good so far.",
          "Contenu": "Quick delivery, easy set up, easy to use.  I liked the camera and it was easy to set up others to be able to call the watch. The unit itself is a bit big, the battery life is so-so, and the watchband can't be replaced so when it brakes, you need to get a new watch.  Overall, we have liked it as it has worked well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "C.G.",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T21:22:29.000Z",
          "Titre": "Good starter \"smart watch\" with nice features for parents",
          "Contenu": "My son has had his tick talk watch for almost a month now. He loves it and thinks it's cool. He likes the music app (buy the headphones or you will regret it!!!) So far, my favorite features are GPS and drop ins. GPS seems to be pretty accurate though it would be nice if I didn't have to reopen the app to see when location changes. We have used the face feature several times and it almost always works great. I wish it stayed on longer then 3 minutes though. Oh! I forgot about reminders - I set daily reminders to keep him I'm schedule while I'm working. I love that part tooBefore ordering, I was hesitant about the size of the watch. I promise it's not as big as it looks online. It fits my 10 year olds arm just fine.I went with 4 stars instead of 5 just because the band/attachment broke after less then a month of use. According to my son, he didn't do anything to break it (granted he doesn't always tell the truth). However, as a product made for kids it, should be able to handle wear and tear pretty well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debi D.",
          "Nb_Reviews": 2,
          "Date": "2023-08-18T23:25:27.000Z",
          "Titre": "Great investment for family with kids",
          "Contenu": "I got the Tick Talk watches for my twins.  I feel a lot more at ease with the kids wearing them.  It's nice to be able to communicate with them and them with me when needed.  Customer service is also really great.  Setting up the first one took me a bit of time and the 2nd one was easy. Lots of good features and I like that there’s no games or apps on here aside from camera, group and single texting options and different themes for the home screen and app display which are cool, colorful and fun. They have gotten lots of compliments on them and when we explain to them how it works, it’s even more impressive. It was easy to add family members and a few friends. But I learned that in order for family members to contact the watch, they must have the TickTalk app on their phone as well. I’m sure it’s simple enough to set up.  The only issue I have been having is when my kids are in school, they don't always show the accurate location.  My daughter was in Hawaii the other day according to her watch. I am not sure what is causing this however, I still think these watches are a great investment. Also, the reception in one of the kids classrooms isn’t that great so it’s constantly searching for a connection and draining the battery😏.  You can't put a price on your child's safety so I am happy to know, that we can communicate and I would definitely recommend this to family’s with young children as an alternative option to cellphones."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrea Bertulis",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T01:47:39.000Z",
          "Titre": "Overall I'm pretty happy with my tick…",
          "Contenu": "Overall I'm pretty happy with my tick talk 4. The GPS tracking seems to be off every once in awhile so that's really my only complaint. My daughter has been able to call and text me when she needs and that gives me peace of mind."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yang Liu",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T23:45:10.000Z",
          "Titre": "Please provide automatic cancellation option",
          "Contenu": "It would be helpful if you set up cancellation process to be automatic. It would show the customer that you are confident about the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew DeSorbo",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T01:17:56.000Z",
          "Titre": "Great ordering experience and clear set…",
          "Contenu": "Great ordering experience and clear set up directions.  All my questions were addressed and answered very quickly and fully."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "odifrog",
          "Nb_Reviews": 2,
          "Date": "2022-11-24T12:05:19.000Z",
          "Titre": "I was trying to decide between the…",
          "Contenu": "I was trying to decide between the Gizmo 2 and the SyncUp at first however the reviews on those watches were not great.  Most reviews stated bad call quality and spotty GPS which are the main purpose of kids GPS watches, so I was a bit disappointed.  That led me to do some research on other options and I am glad I did.  TickTalk is different as you do not used a typical watch line addon via your cellular service, it uses a full cell phone connection line, which TickTalk offers for the same price as it would have been to add on a watch line to my cellular plan.  The reason for this is that this uses more data than the other guys and this leads to a more stable connection, better gps and clearer voice calls.  This also allows the watch to do video calls which is very cool.  The watch has of great features that include 2 cameras (my son loves this), the ability for an adult to lock the phone to just a clock screen via the app during school hours if you want (I love this), and ingoing/outgoing calls only to approved people who have downloaded the ticktalk app. I gave it 4 stars as there 2 drawbacks in my opinion, the size of the watch and its not waterproof.  The watch is big so if you have a child with a smaller wrist this might be an issue.  The watch only has a IP67 rating so it will be ok if it gets wet for a short time but swimming/showering with the watch is not recommended.  I would definately recommend this over the other main GPS watches for kids due to better overall call quality and better GPS stability for tracking."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carrie",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T20:04:26.000Z",
          "Titre": "Awesome for a one of a kind watch",
          "Contenu": "We researched a bunch of different kids watches. This was the only watch that had everything we wanted. I'm able to call, text, video call even and she's able to do the same. This watch even has voice to text capabilities so you don't just have the preset texts which is amazing. I did get the prepaid T-Mobile sim with the purchase, but decided to just add it to your T-Mobile account as another line instead. So far I feel like the watch is well worth it. My kid loves the I heart music feature and we bought Bluetooth headphones that she can listen and make phone calls on. The music feature seems to cut out a lot and visit extremely clear, but hey this is just an extra feature,but definitely one reason she wanted this one. We did have an issue with the GPS showing her several miles away from where we were, watch in my hand. I don't know why it showed her being somewhere we had never taken the watch, as we had just said it up a couple of hours before. I tried to update the GPS and did the live tracking feature and it still said she was in that spot, but after I rebooted it, it finally updated the GPS to the correct location.That is a major concern to me because that is one of the main reasons I bought this watch, so that I could know where she is at all times. If the GPS is off by several miles, that's a problem. An exact location off by just a few blocks is expected, but not that far off. We just set the watch up yesterday, so hopefully it won't do that again and we will have better luck with the GPS for the future. Overall I'm very happy with this purchase as long as the GPS works correctly and I'm considering getting more for my other children."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "odifrog",
          "Nb_Reviews": 2,
          "Date": "2022-11-24T12:28:40.000Z",
          "Titre": "Was trying to decide between the Gizmo…",
          "Contenu": "Was trying to decide between the Gizmo and SyncUp watches for my 8 year old.  The reviews on those watches were not great with the main issue being spotty GPS and bad call quality.  As those are the main purpose for the watch I kept searching to see if a better alternative was available.  The best reviews on a kids watch was for the TickTalk and after getting the watch I can see why.  The watch provides a much more stable and  clear connection than my sons friends watch which is because you have to get a full cellular plan on this phone.  TickTalk offers the cellular plan for the price of what a watch plan would cost me with my cell provider.  I ordered the watch directly from TickTalk as they were running a good sale and as I wanted to talk to customer service as I had questions about the features and connection requirements.  I talked directly to a person!  Not a voice command service, which drives me nuts, and the service representative was very helpful as well as very polite.  Love when you can speak with someone in customer service who knows what they are talking about.  The watch has great features with 2 cameras, incoming/outgoing calls to only approved contacts who have to have the TickTalk app and be approved by a parent, and the ability to lock the phone via the parent app to a watch face which is very useful during school hours! The only cons I have noted is the size, this is a large watch, bigger than my smart watch and it is only IP67 rated which hopefully will not be an issue if my child remembers to take it off before swimming.  These 2 cons are the reason I gave this 4 stars instead of 5.  IMO this is a best GPS tracking watch available right now for kids.Thanks TickTalk"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-10T19:01:45.000Z",
          "Titre": "3 stars given the cons.",
          "Contenu": "Update: customer service is very responsive as can be seen here in the reply. I'm adding one more star in return.3 stars given the cons.Cons:1. Too bulky. I knew it was the bulkiest out of them (Gabb watch 2/3 as bulky). But I decided to go with it because of the pros. 2. Extremely poor documentation. The little paper that came with the watch doesn't explain the most basic thing about the watch: what do the 2 silver and red buttons do? How to get to the settings screen on the watch (you're supposed to swipe left a few times)? How to put the sim card in?3. Poor Q&A from untrained support. I asked what the red button do, support answered \"look at this youtube video\" which doesn't even talk about the button at all. When I told them the video was not helpful and a waste of my time, there was no apology. Only then did they give me the answer they should have given in the first place.4. Price is the steepest, which would be fine if documentation and support was a bit better.Pros:1. The software and hardware is pretty good. Call quality good. Interface good (once you know to swipe left to access other screens!)2. Location service accurate.3. Affordable service plan."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Never Again",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T17:31:25.000Z",
          "Titre": "Good option for in case of emergencies",
          "Contenu": "Tricky to set up if you're not tech savvy. But I called the helpline and they walked me through it. My kid loves the watch and we like being able to contact her in case of emergency."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aziz Essabry",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T00:22:14.000Z",
          "Titre": "This is my first time using Ticktalk 4",
          "Contenu": "This is my first time using Ticktalk 4, the watch very nice and has the features and kids safety parents need, the only down side is the location tracking is not accurate it always showing my kids miles away from their actual location."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anabel Castro",
          "Nb_Reviews": 2,
          "Date": "2022-11-15T02:47:48.000Z",
          "Titre": "Fast shipping easy set up it’s not…",
          "Contenu": "Fast shipping easy set up it’s not perfect but I don’t regret my purchase!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RUSHABH N JOSHI",
          "Nb_Reviews": 2,
          "Date": "2023-05-16T01:36:31.000Z",
          "Titre": "Great for a 10 year old",
          "Contenu": "The product is working as described. It was easy to set it up. The phone app looks a bit dated and could use an upgrade. Overall, my daughter loves her watch!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bryan Pritchard",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T23:55:00.000Z",
          "Titre": "Overall a good device",
          "Contenu": "Overall a good device. The location services are a little slow and showed my son in China for a few days which was really strange."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Javonda Rachelle",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T20:18:25.000Z",
          "Titre": "Stopped working spontaneously 3 times.",
          "Contenu": "I bought this watch for my 6 year-old son in June 2022, because we both had anxiety about him starting day camp with weekly field trips.  I loved the tracking, text, and voice/video features of this watch…so I purchased one.The watch is bulky; however, the features are awesome and intuitive…when they work.  A minor issue is that the gps isn’t always accurate, but with a refresh or two…it corrects itself. The first time this happened, I panicked, because it appeared my son was in a neighborhood near his day camp…instead of at camp.  He was actually safe and sound at camp though.  My biggest issue, is that the watch stopped working spontaneously 3 separate times in a 2 month period, for no explicable reason. The screen would go dark, and then we’d get a blue screen...lasting a day or two. Some of the features may or may not work during that time.  Like, I could call…and it would ring, but he couldn’t answer.  There were no icons displayed. The most disturbing incident was when my son tried to call me, and the watch stopped working as he was trying to call.  Because we were abruptly disconnected…I stopped what I was doing and drove to his camp location. He was in tears, and the staff was concerned, because they’d never seen him so emotional.  He told me he needed me and couldn’t reach me.  I’m glad he was in a safe environment when it happened…but it made us question the reliability of the watch.   We kept wearing the watch, but it happened two additional times. Once…while he was at home with me, shortly after putting the watch on.  We were preparing to leave the house. He looked down…and it was the blue screen of inoperability again. That is the last time we used it.Customer service responded quickly.  Sent us a shipping label for us to return it. It took me a while to send it back, because my son left his portable charger a a family members home…and we couldn’t find it for the return. Once we found it, it was still within the warranty period, so I returned it. They sent the same watch back with new chargers…saying they couldn’t replicate the charging issue (that I never reported nor had an issue with). When I informed them that there was never a charging issue…they then said they couldn’t identify a problem, but they updated the operating system.  Hopefully the watch doesn’t have an issue again, because the warranty period is coming to an end.  I can only assume this is a defect of the product…because they did not replace the watch, and my only experience has been problematic.  Because of this, I do not recommend this product. It has not been reliable. I’d have recommended it had it functioned properly consistently. I’m still working with customer service (as they remain responsive) to remedy this issue.  I will update my review if there are any changes.Update: There is a lifetime warranty on hardware defects.  So I have increased my rating from 2 stars to 4 stars.  Hopefully with the OS update, there will he no more issues with the watch."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bryan Rohrbacher",
          "Nb_Reviews": 2,
          "Date": "2023-02-09T05:19:03.000Z",
          "Titre": "My son's watch broke and they are…",
          "Contenu": "My son's watch broke and they are sending a replacement"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T19:11:08.000Z",
          "Titre": "I bought it for my 5 yo son last year",
          "Contenu": "I bought it for my 5 yo son last year. We love it! It’s easy for him to use and I feel very safe with track/Call system!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Robertson",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T21:48:07.000Z",
          "Titre": "Solid smart watch for a child",
          "Contenu": "Solid smart watch for a child.  My 10yr old loves it.  Wishes it had games but nice that it does not.  I do wish the app integration for contacts did not have to pair with the watch for each contact.  My mom lives a few hours away and it is a shame she cannot video chat with my son today, on his birthday.  It seems logical for a parent to approve a contact and connect them to the phone manually in some way."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amelia Wieber",
          "Nb_Reviews": 1,
          "Date": "2022-09-07T21:06:02.000Z",
          "Titre": "This watch is actually pretty cool",
          "Contenu": "This watch is actually pretty cool. It does all the things and only the things I want my 8 year old to be able to do with a smart watch. Setting up was not the easiest, and I do wish it came with clearer instructions. We are still figuring some things out. Also, the speaker isn’t great and I would recommend the head phones so you can hear your kiddo."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Skyler  Ashmore",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T23:39:42.000Z",
          "Titre": "TickTalk works for us.…",
          "Contenu": "We are one our first week of having TickTalk and so far we are happy with it. I will say that the location service is generalized, and it takes a little bit to update sometimes, which is the reason for 4 stars instead of 5. However, I am very happy that we are able to communicate with our 6 year old in a safe way. This watch gives us peace of mind, even when in Do Not Disturb mode he could make an emergency call to us."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John N. Schreidl",
          "Nb_Reviews": 3,
          "Date": "2022-09-16T19:50:46.000Z",
          "Titre": "The service rep was great but I am…",
          "Contenu": "The service rep was great but I am upset overall because when purchasing the two TickTalk 4's for our son and daughter, I did not see any mention at all for an available extended warranty.  Had I seen it, I would have purchased them as well at the time of original purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T19:10:33.000Z",
          "Titre": "Good so far",
          "Contenu": "Good so far. Hopefully we never have to use the emergency feature but it is good to have the SOS options and the GPS seems to work well enough. Not 5 stars because the facetalk only works if the phone is on a wifi connection. Also the water resistance is only good the watch is not submerged so your child will have to remove the watch if they happen to have swim class at school or need to use showers for a sport. Functions work well and set up is not too bad to follow."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ohad Kravchick",
          "Nb_Reviews": 2,
          "Date": "2022-09-06T08:07:18.000Z",
          "Titre": "Good product overall",
          "Contenu": "Quite good product so far. My daughter like the watch. She enjoys calling us on phone and video and we really appreciate the trackability. She also loves the music playing feature. She was missing playing games, but we actually didn't want the watch to distract her at home or school."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mama Bear",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T16:18:39.000Z",
          "Titre": "Great watch, just 1 thing….",
          "Contenu": "My son and I love this watch and all of the different features on it.  Since he can call and text with our immediate family I feel as though this is a good alternative to getting him a phone at a young age. However, I mainly purchased this so that I could track him walking home from school.  Unfortunately the gps lags so it takes a good 30-60 seconds to update his location.  I was wanting something that continually tracks him instead.  This is why I gave the watch 4 starts and not 5."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kristen Starks",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T22:12:03.000Z",
          "Titre": "I ordered this for my kids since they…",
          "Contenu": "I ordered this for my kids since they were going to summer camp - I wanted them to be safe, to know where they were at all times, and to be able to contact me. This hit all the marks, as they aren’t old enough for a phone. The only reason I give 4 stars is that the GPS isn’t accurate. I even looked up AT&T versus T-Mobile coverage in my area, and went with ATT since it was shown to be better in my area - but the GPS is always a bit off."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kim",
          "Nb_Reviews": 2,
          "Date": "2022-09-09T01:57:21.000Z",
          "Titre": "Watch works great and love all the…",
          "Contenu": "Watch works great and love all the features, I do wish that it could type text and not preset messages and it would be nice if video call lasted longer but I understand reason why the watch does get hot when being used."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chase S",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T15:32:03.000Z",
          "Titre": "Improvement with the 4",
          "Contenu": "The tick talk 4 seems to be a big improvement from the 3. I do worry about the screen breaking because the corners are not as protected as each of the sides. The app definitely needs improvement in it's engineering. It logs me out constantly and so the messages from my kids don't come through until I log back in."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Young",
          "Nb_Reviews": 1,
          "Date": "2022-07-08T06:15:36.000Z",
          "Titre": "Work in process",
          "Contenu": "When I purchased the watch, it was not updating the location properly. I opened up a ticket with the support team. They are diligent in solving my issue. While the ticket is still open, I can say my child loves the watch and I like all the features as well. One thing I would like to see added is the ability to view text messages from allowed contacts/friends in the app. I can only see what was blocked."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lauren Christensen Bone",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T09:49:19.000Z",
          "Titre": "Tick Talk 4",
          "Contenu": "We recently ordered this item for my 11 year old son. I compared it to other options and felt like this gave the most functionality for the best monthly price. Set up was easy, customer service has been great so far, the app is simple, and it works really well (sound quality, service, GPS, alarms and calendars). So far I am happy. The only thing that I don't like is that if you want to text you have to use the app. It's not terrible, but it makes it so that friends with other similar devices won't be able to message him, but they can at least call each other. That is the reason behind my rating of 4 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rebecca",
          "Nb_Reviews": 7,
          "Date": "2022-07-18T20:46:22.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good. Had to contact support a couple of times at the beginning but was able to get the issue figured out. Wish I could text my son without going through the app but I guess I knew ahead of time that that’s how it works. Location is always accurate, phone works and he’s figured the settings so we’re happy"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alindsey Kramer",
          "Nb_Reviews": 1,
          "Date": "2022-07-14T05:15:19.000Z",
          "Titre": "Great watch",
          "Contenu": "We have twin girls and there are some custody issues and needless to say some fears and needs to facilitate communication. We had Gizmos, but the app was so limiting and very few numbers allowed and the gps rarely updated and they don’t call 911. The TickTalk watches are amazing. They can call 911 and 50 numbers. The app allows more interaction. The kids can FaceTime. There is a I heart radio connection with kid friendly stations. The only problem is that the watch is a little bulky, but girls don’t care, they love it!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sabrina Parker",
          "Nb_Reviews": 2,
          "Date": "2022-09-26T23:38:07.000Z",
          "Titre": "We love this device!",
          "Contenu": "We love this device! It’s the perfect alternative to buying your kid a phone. We are still learning all the functions on it but we got the basics and it’s really all you need."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Iowa Mom",
          "Nb_Reviews": 1,
          "Date": "2022-06-10T02:07:05.000Z",
          "Titre": "Worth every penny",
          "Contenu": "This is a great watch. I compared many other watches to this one and nothing comes close. The only reason I gave it 4 starts instead of 5 is because of the gps accuracy. It’s close, but not 100%. It also doesn’t have geofencing like many of the others. I do think it’s bulky, but my son has never complained and likes to wear it. So it’s a win! I do not regret purchasing this watch."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nicole Shaffer",
          "Nb_Reviews": 1,
          "Date": "2022-06-08T17:00:10.000Z",
          "Titre": "Great product",
          "Contenu": "Great product.  We have struggled with it not staying connected to the internet, but other than that, we love it.  I highly recommend the watch to parents.  My son says it is comfortable to wear, and forgets he has it on sometimes.  It gives us a way to communicate with him when he is at summer camp, or away from us without the worry of him having a phone.  This product fit our needs perfectly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NewTickTalkCustomer",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T08:44:22.000Z",
          "Titre": "The battery life needs more testing but…",
          "Contenu": "The battery life needs more testing but right now it seems it may not live up to what support advised would be 5 hours of talk time on a full charge. That said, the emergency features are what we wanted and seem to work without issue so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eve Channels",
          "Nb_Reviews": 2,
          "Date": "2022-08-16T20:10:07.000Z",
          "Titre": "I love the all of the features of this…",
          "Contenu": "I love the all of the features of this watch! I haven't had the full 30 day experience but $10 a month this purchase has definitely provided me with peace of mind knowing that I can get in contact with my little one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "R Randall",
          "Nb_Reviews": 1,
          "Date": "2022-06-05T18:38:31.000Z",
          "Titre": "Overall good watch",
          "Contenu": "Got the TickTalk 4 for my child. I liked that it had no games on it. Overall we like the watch. Two issues lower the rating in my mind. First, the watch would not initially charge and I had to email the company to find out how to get it to begin charging. It involved plugging and unplugging the watch 10 times. The email response was swift but this information is not available online in the FAQs. Second, the GPS is not as precise as other devices we have that use GPS, it is off by about a half city block."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Danny",
          "Nb_Reviews": 1,
          "Date": "2022-05-30T20:52:52.000Z",
          "Titre": "Great Site! Awesome Watch!",
          "Contenu": "The MyTickTalk site had all the info on the latest TickTalk 4 laid out in a fun and easy way to consume. I ordered a watch for my 3rd grade daughter going on her first field trip post pandemic without her mom as a chaperone. She was nervous...they both were. The watch came through with accurate location at any time. The remote answer is awesome and pics up sounds clearly. Hope to see geofencing and full waterproof added soon. Loving the watch! All her friends are asking their parents for one!"
        },
        {
          "Note": 4,
          "Lieu": "QA",
          "Pseudo": "John Dizon",
          "Nb_Reviews": 1,
          "Date": "2022-05-03T00:23:51.000Z",
          "Titre": "Almost perfect! Hope to add one more feature in the future",
          "Contenu": "Thank you for making such a wonderful tracking watch. Product and app is high quality. My only concern is that I hope there is at least one or two games available in the watch to give my toddler incentive to wear it. For the parents, all the features are perfect. But for the toddler he/she doesn't have much incentive to wear an oversized watch.Hope there will be a software update in the future for this, that will make it perfect!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Baker",
          "Nb_Reviews": 1,
          "Date": "2022-05-12T00:15:42.000Z",
          "Titre": "Works as advertised",
          "Contenu": "My son has been using the watch for 2 weeks and it does everything as advertised.  The app is easy to use and can provide a lot of detail if needed.  Th only minor complaint is battery life, would be great if a charge lasted more than 3 days with light use (voice/text - no streaming or video).  Looks like its 2 days at this point."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie Diec",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T00:55:48.000Z",
          "Titre": "Works great with AT&T!!!",
          "Contenu": "We were upset when we went into AT&T and they were trying to sell us an apple watch as our only option for our 7 year old.  They said they have no kid friendly watch and when others tried getting them elsewhere they couldn't connect it.  We were lucky a friend recommended this watch to us as her son uses it and has AT&T also.  It works great!  We love it for our son and it was easy to add him onto our plan."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Knight",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:47:07.000Z",
          "Titre": "Tiffiny Adams",
          "Contenu": "Tiffiny Adams, I'll say it again for those in the back, Ms. Adams, is the best thing since canned beer and sliced bread. I called the 1-800.. And didn't have to wait for an automated voicemail, I connected right to a representative, in which it was Tiffiny, she was super helpful in regards to the incident in which I was having and offering a solution to the problem. 100/10 would recommend.The watch, I love it, because I have peace of mind with my son, knowing where he is, and he can communicate without the additional toxicity of being exposed to the internet. I've had no issues with the watch, it's extremely dependable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emily Honda",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:32:30.000Z",
          "Titre": "Piece of Mind",
          "Contenu": "My son just turned 6 and recently started school.  It was a big step trusting him with people we don't know personally.  Being able to track him and contact him if we need to and him being able to contact us has been a huge relief.  We love it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David H",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:41:36.000Z",
          "Titre": "TickTalk Support Rocks",
          "Contenu": "Natasha walked me through what I needed to do, this included troubleshooting - she kept me informed, was very kind and assisted in replacing the unit. Thank you!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denielle Abrecht",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:08:53.000Z",
          "Titre": "User friendly app and VERY accurate location service",
          "Contenu": "The ticktalk app is very user friendly and the location function is extremely accurate. We used another watch that came with a terrible app that told us my daughter was in China half the time. Ticktalk is definitely worth the extra cost. The best part is you can use almost any service you choose so you aren't forced to pay for an expensive phone plan. I wish the watch was not quite as bulky but I believe it is best for kids to have a well protected watch while they are outside playing. This company has excellent customer service and I will continue to recommend this product to friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth S",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T21:11:42.000Z",
          "Titre": "Great product for tween",
          "Contenu": "Shipping was very quick.  We had a little trouble figuring out how to set up text messages, but our granddaughter loves her new watch/birthday present."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sanju",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T19:10:03.000Z",
          "Titre": "Tick talk watch is a great watch I…",
          "Contenu": "Tick talk watch is a great watch I bought second watch for my son, I already using one for my daughter, great watch I recommended to buy its a great product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T05:39:06.000Z",
          "Titre": "Customer service rocks !!!",
          "Contenu": "So I called customer service and spoke with someone without going through automated and was able to answer all my questions as why I purchased it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela Zambito",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T00:23:02.000Z",
          "Titre": "Great response from Tiffany in customer…",
          "Contenu": "Great response from Tiffany in customer service.  Was able to get a replacement watch for the one my son lost."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darra E.",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T23:17:16.000Z",
          "Titre": "Super easy to purchase",
          "Contenu": "Super easy to purchase.  It’s a Christmas present so I can’t comment on anything else now."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nirupal Mehra",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T18:58:16.000Z",
          "Titre": "Overall its a great kids watch",
          "Contenu": "Overall its a great kids watch. I only wish it had flashlight, it was waterproof and had a glow-when-light falls on it band for kids safety when going out at night."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "zhenye wu",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T17:12:00.000Z",
          "Titre": "Thanks to TickTalk watch",
          "Contenu": "Thanks to TickTalk watch, I am able to see when the school bus arrives as the school bus app is not working and it’s been running late recently. With the watch, I don’t have to wait at the bus stop for a long time until the bus comes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Annie Huang",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T05:04:15.000Z",
          "Titre": "My son loves this and I have to point…",
          "Contenu": "My son loves this and I have to point out it is the easiest set up ever!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CE Stewart",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T00:27:22.000Z",
          "Titre": "Tick Talk is a great watch for kids . 6 months on and working perfectly.",
          "Contenu": "Easy to order a couple of new screensavers for Grandson’ Tick Talk , which is working perfectly.  He is 11 and loves it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan Ellett",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T01:47:26.000Z",
          "Titre": "The TickTalk watch and service is great",
          "Contenu": "The TickTalk watch is great, as we now feel comfortable letting our son ride around the neighborhood without us and we always know where he is and can reach him if needed. It’s been very reliable! Unfortunately, it was almost destroyed by a dog at a friend’s house. Thankfully, Tiffany Adams in the customer service department has been very helpful and efficient in helping us get a replacement. We’ve had no problems with the watch or the company. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beverly",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T06:23:18.000Z",
          "Titre": "Happy 1st time customer!",
          "Contenu": "The ordering process went very smooth and my products are being delivered the next day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lacey Hernandez",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T17:55:56.000Z",
          "Titre": "10/10 recommend!",
          "Contenu": "A few months ago I decided to give my self a little peace of mind and purchase multiple TickTalk watches for my three littles. I have nothing but great things to say about them. The location is always accurate, the service is wonderful and my kids say they are super comfortable. I had the pleasure of speaking with Tiffiny in customer service and she was beyond helpful! Thank you all for everything you do to help out babies in this crazy world!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Claire",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T13:10:52.000Z",
          "Titre": "I really can’t leave a review yet cause…",
          "Contenu": "I really can’t leave a review yet cause this gift is for my grandson fir Christmas 🎄 so if you can get back to me later I will leave a review can’t wait to give it to him"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nur",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T04:04:45.000Z",
          "Titre": "Excellent customer support!",
          "Contenu": "I ordered a replacement charging cable for my Ticktalk 4 watch from the website as the original one was damaged. Unfortunately, the wrong cable arrived. I immediately reported the issue to customer support via email. Within just a few minutes of my report, they processed a refund! To my surprise, two days later, they sent the correct cable without any hassle on my part. I am grateful for such quick and impeccable customer support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DGS",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T20:43:13.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service - responsive and kept their word exactly as they said they would."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bahl Family",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T06:22:32.000Z",
          "Titre": "Feel safe about giving your child independence!",
          "Contenu": "Were were so excited to get these watches for our twin boys when they were 8 years old.  We have had them now for over a year and they are invaluable! We love the freedom and independence that it gives them and are extremely grateful for the product's impressive durability and functionality. Customers service has been incredible as well! Whenever we have had a problem, we have experienced quick responses and total satisfaction with their help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rajasekar parthiban",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T23:52:16.000Z",
          "Titre": "\"TickTalk Watch - Freedom for kids and parents",
          "Contenu": "We are thrilled with our TickTalk watches! Acquired for our kids at ages 5 and 7, these watches have shown impressive durability and functionality. They provide our kids the freedom to play with friends in the neighborhood, offering peace of mind for parents through the app to monitor and track their location.Tiffany Adams from customer service has been incredibly helpful and efficient, demonstrating great responsiveness. We're thoroughly satisfied with both the watches and the exceptional customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah L.",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T22:20:45.000Z",
          "Titre": "Love our TickTalk watches!",
          "Contenu": "We love our TickTalk watches!  We bought both of our kids TickTalk watches when they were 6 and 7 years old.  These watches are durable, my kids have worn them almost every day for nearly 2 years and they are still working well.  We wanted to give our kids a little more freedom to play with their friends in the neighborhood and these watches allow us to do so, while knowing their location and allowing us to get in touch with them when we want to check on them or call them home.  The customer service TickTalk provides is top notch.  When one of our sons lost a part of the end of his band, they promptly mailed us a replacement part at no cost.  We are very happy with these watches and the customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheila",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T16:23:36.000Z",
          "Titre": "Peace of Mind",
          "Contenu": "I bought my daughter a tick talk watch for Christmas last year and have had to contact customer service a few times due to some updates and user questions. Customer service always responds quickly and are super helpful and always kind. It gives me peace of mind knowing I bought a watch that I can communicate with my daughter at any time and knowing customer service is always there to help. Definitely recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebecca",
          "Nb_Reviews": 7,
          "Date": "2023-10-31T22:06:20.000Z",
          "Titre": "Very happy with customer service",
          "Contenu": "Very happy with customer service. Had an issue with the watch and Tiffiny Adams helped solve my problem right away and made it easy for me to get a replacement. I always get a quick response when I contact them with questions or a problem. Love the tick talk because my son can play outside with his friends and I can always tell where he is and contact him if I need to. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victor Scott",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T02:18:34.000Z",
          "Titre": "I got all the details I needed when it…",
          "Contenu": "I got all the details I needed when it came to my options between buying a new one or having the old one repaired. I was also provided with all the steps to ensure it worked out of the box. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joleen Valerie Villegas",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T01:09:11.000Z",
          "Titre": "Worth every penny",
          "Contenu": "Been using this watch for 3 years, no issues. While the parent app does sometimes log out, my son's watch works great. Love the parental controls and safety features. Love being able to keep track of him even if it's not the most accurate. He can make calls to us and he loves to send us pictures throughout his school day. He is in second grade."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hollis von Summer",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T06:25:06.000Z",
          "Titre": "Great Watch & Great Customer Service!",
          "Contenu": "My daughter has been using the pink TickTalk 4 for nearly a year now. She loves it! It took a little while to explain to family and friends how to download the app and figure out how they can communicate with her, but I like that it makes it difficult for strangers to break through that system and so she is protected. Recently our dog chewed the strap and she burst into tears when she saw it. Tick Talk customer service responded very quickly when I contacted them about the problem and made the repair process simple and speedy. Overall, a much better experience than when my son had a Gizmo watch. I would definitely recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mareena Finke",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T17:14:46.000Z",
          "Titre": "Customer service was great and super…",
          "Contenu": "Customer service was great and super helpful! Solved my issue in a flash!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jake E.",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T21:01:37.000Z",
          "Titre": "I highly recommend",
          "Contenu": "I did a hefty amount of research for this purchase and luckily I was able to find TickTalk.  There were just a handful of other potential companies that seemed to be as on point and highly rated.  The option to not go through a 3rd party minute/plan provider was a key factor, along with all of the bells and whistles.  My kids love them (when they're not at school - and it's just a watch) and it provides me a ton of peace of mind as I work toward continuing their teaching(s) of independence."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marie August Helphenstine",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T19:37:29.000Z",
          "Titre": "We have had a TickTalk watch for our…",
          "Contenu": "We have had a TickTalk watch for our daughter for over a year now, and it has been a huge benefit to our lives. The comfort of being able to reach out to her when she is playing with neighbors is a great quality of life upgrade. Being able to find her if she is separated is wonderful. I can't imagine going on a trip without it. The parent control features are very useful. I love being able to set the watch to do not disturb during school hours. And we really love that she is not being exposed to social media.The customer service has also been great. We have had some recent damage issues with the watch, but they are quick to respond and help us and are sending a replacement.We've already recommended this watch to most of our friends, and gladly recommend it to the public in this review."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "First time satellite internet user",
          "Nb_Reviews": 3,
          "Date": "2023-09-01T19:01:45.000Z",
          "Titre": "Tick Talk Support Specialist Outstanding",
          "Contenu": "Tick Talk Support Specialist, Natsha, took great care of us.  She was extremely knowledgable, offered great suggestions how to quickly resolve our issue and followed through on all her commitments.  She represents the best of Tick Talk"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa Ptasienski",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T21:05:31.000Z",
          "Titre": "Top Notch Customer Service",
          "Contenu": "The products are great but the customer service is what made this experience incredible. My son's strap broke and Tick Talk was going to replace the watch. The package got lost in the mail and our Tiffiny went above and beyond over the course of 1.5 months, working with me to provide a new watch despite the lost package. The service was unexpected at that level but extremely appreciated and I have nothing but wonderful things to say about my interactions with Tiffiny!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth Liu",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T04:38:05.000Z",
          "Titre": "We have had TickTalk 4 for about a…",
          "Contenu": "We have had TickTalk 4 for about a year, very good option for my 11yr old boy. No games on it, but very fun for him to take photos, check reminders, call me anytime he needs to, and mostly I can check where he is whenever I want to. It made me feel settled. The customer service is also 5stars, whenever I have a question to call them, they always provide with detail instructions and help to solve the problem. Highly recommended!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tairon Cotton",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T19:34:48.000Z",
          "Titre": "Great technical support and customer service!",
          "Contenu": "I bought my 8 year old a ticktalk because I wanted something that he could understand was not a toy or for games but just for calling and texting. Very durable and service was pretty reliable. I did have an issue with the watch not charging but ticktalk support helped get me a replacement and I also had to get a replacement SIM card that I could not get to work but ticktalk support helped me get it working as well. My son loves it and I have complete control over who calls or texts him and can find him on GPS when needed so all in all very happy with purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melanie Martin",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T19:57:20.000Z",
          "Titre": "TickTalk 4 is a win/win!",
          "Contenu": "Just received our TickTalk 4 for my 8 year old son - it is a great introduction to tech. He had been asking nonstop for a phone/tablet and this watch was a perfect compromise. His ability to now call/text me has given him a lot of comfort, and he loves being able to stay connected with his extended family and buddies. I LOVE the GPS feature! I can track him when he's out playing with friends or riding his bike which provides us a greater level of safety. The watch is very intuitive and easy for him to operate, he loves it so far! I am also hoping (especially with the fact that he had to earn the watch) it will provide a good opportunity for him to learn about personal responsibility and taking care of possessions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Crystal Nelson",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T05:22:49.000Z",
          "Titre": "Highly recommend",
          "Contenu": "So far (less than a week) we have two watches for our kids. This is our second purchase of this type of smart watch. The TickTalk has more than enough features: secure calling texting, GPS, kid friendly, music, pedometer, camera, ect. For us, the security, GPS, and the reception are most important. Potential Cons: price point is higher, monthy service only (no discounted year subscription offered), also you must buy warranty to get wear and tear replacement/ fixed such as watch band, screen, water damage. It would be nice if this was included in original packaging at least in the first year as this is a product for kids."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicki",
          "Nb_Reviews": 2,
          "Date": "2023-08-31T16:54:34.000Z",
          "Titre": "I have been very pleased with the…",
          "Contenu": "I have been very pleased with the TickTalk watches I have purchased. It provides fun abilities for my kids to communicate with each other as well as with me and their grandparents. It has fun features where they can listen to songs and sometimes stories as well. I feel like TickTalk has captured everything I wanted to help me have access to my kids when I’m worried about them and provide them with the feeling of security knowing they can reach me whenever they need me. I also love the photo features. The one thing I wish they’d offer is an option for a softer/smaller wristband for my tiny kindergartener. Her watch slides slightly on the smallest setting and it bothers her. But she is very small for her age too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erin",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T00:20:05.000Z",
          "Titre": "Fast and friendly customer service",
          "Contenu": "We bought my son a Tick Talk 4 over a year ago. Customer service helped up set it up when we first got it. It worked great for over a year, until my son forgot to take it off while swimming, it won't turn back on now. I contacted customer service and they got back to me within an hour and offered to replace the watch. It was an easy process. I truly appreciate the speed and friendliness of Tiffany from their costumer service. I highly recommend Tick Talk for both their products and customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth O.",
          "Nb_Reviews": 2,
          "Date": "2023-08-16T18:33:47.000Z",
          "Titre": "Very satisfied",
          "Contenu": "We had two incidences with this watch. Once we took it to Mexico and the battery died completely we put it on the charger, but it still wouldn’t charge. We didn’t have the charging station for the watch, but after sending it in to customer service, they gifted us a charging station along with sending us his fixed and working watch back. Now the straps on the watch have broken off and Customer Service is willing to waive $100 fee in exchange for a review. I think that’s great customer service experience. I would recommend this watch to everyone, no matter the little kinks we encounter they all get resolved in a fairly fast and pleasant manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebecca",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T18:34:47.000Z",
          "Titre": "My son has been SO happy with his watch!",
          "Contenu": "My son has been SO happy with his Tick Talk watch, he loves the look of it, that he can stay in contact with his friends and family, and he especially loves being able to take photos when he's out and about. But the camera lens recently cracked, and now the camera is unusable. I realized the watch might still be under warranty so I reached out to customer service and spoke with Tiffany Adams, who was very helpful in figuring out my next steps to get the watch replaced."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cynthia Henderson",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T03:57:58.000Z",
          "Titre": "Ticktalk is great",
          "Contenu": "We love our ticktalk 4.0 because it’s easy to use for our 8 year old and provides peace of mind while giving her more freedom to play in the neighborhood. It’s extremely user friendly and the customer support answers questions promptly. My most recent interaction with Tiffiny Adams was 10/10. She was helpful, polite, and funny!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Troy Miller",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T18:05:24.000Z",
          "Titre": "Great kids smartwatch with great…",
          "Contenu": "Great kids smartwatch with great features.  Got this for my 8 year old son and it has everything he needs with nothing extra.  Ability to set his own timers is a great feature.  He also loves being able to group text with us and his grandparents.  We love the GPS tracking and Do Not Disturb feature for school.  Only complaint is that the water resistance could stand to be stronger.  My son left this on the edge of a hot tub for an extended period of time and we think the steam penetrated and caused some issues.  However, our warranty experience with Tiffany from TickTalk was fantastic and she helped us get a speedy replacement."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jordan C",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T23:07:21.000Z",
          "Titre": "Worth every single penny mom and dad!",
          "Contenu": "I got to ask all my questions before actually making a purchase. You work seamlessly with my mobile carrier even in a rural community. It’s everything parents want and kids need. It’s been a great way to build trust and responsibility and independence within age appropriate boundaries!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T19:58:04.000Z",
          "Titre": "Great Watch; Great Customer Service!",
          "Contenu": "My seven year old son has been using a TickTalk4 for the last year.  He loves it!  Battery life and ease of use are great.  The watch provides us comfort when wanders the neighborhood with his friends.  We researched the other options (Apple Watch, Gizmo) and felt this was the best option out there.  We were right!  As a bonus, customer service is responsive and helpful."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Charalampos Stampouloglou",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T23:57:07.000Z",
          "Titre": "The support is excellent",
          "Contenu": "The support is excellent. I was in warranty and the charger went of  and these guys send me three cables and a docking base for free to match up the shipping cost I had to pay because and I was international customer. Thumbs up!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "quwiyah winfield",
          "Nb_Reviews": 2,
          "Date": "2023-09-15T21:07:36.000Z",
          "Titre": "My daughter loves her watch and it’s…",
          "Contenu": "My daughter loves her watch and it’s school appropriate. She can call me and her dad whenever she wants and we can see where she is at all times. I love the safety features of this watch, especially on T-Mobile network. This is better than her last one from another brand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adrienne Pennell",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T21:51:21.000Z",
          "Titre": "Very happy!",
          "Contenu": "We ordered two watches-one for our eight year old and the other for our ten year old. We are very pleased with the functionality and safety of the product. Its exactly what we wanted! We have the peace of mind knowing our boys can call us (or select family members) and we can easily see their GPS location via the app.  The app is very easy to use and it was quick and easy to set up the watches and add family members.  The boys were so excited to receive their watches for their birthdays and quickly figured out how to use them.  I spoke with Tiffiny in customer service and she quickly answered my questions and had excellent customer service. We will definitely purchase another watch for our youngest!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Megan B",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T22:14:06.000Z",
          "Titre": "We purchased the TickTalk 4 for our…",
          "Contenu": "We purchased the TickTalk 4 for our son’s 10th birthday. We wanted him to have communication capabilities without the cost of a cell phone and he loves it! He can play music, takes pictures/video, text and the GPS function is amazing :) The set-up was quite easy, just required one quick call to customer service and they were amazingly kind and helpful. Otherwise I was able to set up the watch and have it functional in under an hour right from home. Fast forward 9 months and the watch was accidentally damaged while playing. The process to have it replaced has been quick and easy and the warranty options are fantastic. I would recommend this to anyone considering a bridge to a cell phone for their child."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcel Van Ommeren",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T22:18:07.000Z",
          "Titre": "Quick response.",
          "Contenu": "We recently ran into an issue with our daughter's watch (Ticktalk4) and I decided to reach out to understand our options to resolve the issue.  The response and communication from Tiffiny Adams over at TickTalk was amazing.  Very helpful and prompt with her replies.  I honestly was not expecting this quick of a turnaround for my issue.  I am happy to know that something we use to keep track of my kids has this level of support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie Reed",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T21:56:53.000Z",
          "Titre": "Great Watch, Great Customer Experience",
          "Contenu": "We have two of these watches, one for each kid. It allows us to let our kids be a little more independent and safe without having smartphones. We love how sturdy they are, and they work flawlessly with the app. The battery life is excellent. One of the watches did eventually break, due to kids being kids, but the customer service has been great. We sent it in, and they responded quickly, and are willing to replace it. Great watch. Great company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mel",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T21:16:53.000Z",
          "Titre": "Love our Tick Talk",
          "Contenu": "We’ve had Tick Talk watches for a few years now. I’m glad to have the security of the watch to communicate with my child without the concern of opening the Pandora’s Box of the internet. Tick Talk watch makes it easier to postpone getting my child a phone. You can limit who your child can contact & there is also gps, which is reliable most of the time. There is Iheart radio on the watch - the one thing I don’t understand is why it has a Disney Pride radio station for kids & not just a plain old Disney music station (as there is on Sirius XM). Customer service is very responsive -they stand behind their product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Courtney Buck",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T19:00:11.000Z",
          "Titre": "Great watch for a 7 year old!",
          "Contenu": "We weren’t ready to give him a phone yet but wanted a safe way for him to connect with family. It’s nice to check on him while he’s outside-or when he’s moved further from the house then he’s supposed to. The GPS is fairly accurate… very close to actual location. The texting has been great and he loves face calling his sisters. The step tracking is a bonus—he’s been excited everyday to tell me he beat his previous day goal. If you want to connect with your child without all the distractions of games, social media, adds, etc. then this watch is perfect for you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie Parvin",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T00:19:58.000Z",
          "Titre": "My granddaughter will love it",
          "Contenu": "Had lots of great features- came within a week of being ordered and have received several emails with use instructions"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed K.",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T01:12:26.000Z",
          "Titre": "TickTalk4 is terrific watch for kids with excellent support",
          "Contenu": "Absolutely terrific and beautiful watches for kids' tiny wrists.  We have two boys who loves their TickTalk4 watches. Lots of features, camera, games. Bottom line is: lots of fun for kids with many learning opportunities for kids, learning skills like being on time or letting mom knows whats going on at real time and very helpful during daily routines for busy families. Excellent choice for parents who wants to know where their kids are at any time (great continuous location tracking), Parents and kids can easy communicate with each other. Parents can also add any additional phone number to the list. There is emergency button for rapid communication as well. Teachers allowed my kids to carry their watches on their wrist at all times even though we have \"no electronic devices policy\". There is a feature that limits the use of watches during the school time without disconnecting emergency features. Overall beautiful and useful product helping family to stay in touch and feel more secure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Krista Blowe",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T03:17:50.000Z",
          "Titre": "Tick Talk has been excellent…",
          "Contenu": "Tick Talk has provided excellent customer service to me. They've always been prompt and clear I their responses. I spoke with Tiffiny Adams who helped me with support for my son's Tick Talk 4 watch. She was so friendly and knew exactly how to resolve my issue. My son loves his watch and it has been great using it to keep insomuch with him right after school and as he becomes more independent. I highly recommend this company for parents with young kids!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenny Hazen",
          "Nb_Reviews": 3,
          "Date": "2023-05-09T22:39:18.000Z",
          "Titre": "My son’s love their TickTalk watches…",
          "Contenu": "My son’s love their TickTalk watches and they are so easy to use!  I have peace of mind sending them to play at a friend’s house or bike to school because of their watches.  I’ve had to talk to TickTalk customer service twice because my son’s damaged their watches (which is VERY hard to do I must add) and customer service is EXTREMELY knowledgeable, professional and friendly.  I’m so glad we gave them our business!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Firej",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T02:51:48.000Z",
          "Titre": "Great watch for what we bought it for",
          "Contenu": "Great watch for what we bought it for, to keep track of our son while he is out playing with his friends. The durability could be a little better though. He’s an outdoorsy kinda kid. Tiffany with the customer service department has been a great help. Definitely would recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allison S.",
          "Nb_Reviews": 2,
          "Date": "2023-05-17T06:32:44.000Z",
          "Titre": "Great Watches, Great Customer Support!",
          "Contenu": "My kids (10 and 7) love their TickTalk watches! It’s been very useful and convenient for them and for my husband and I to communicate instantly when they are at school, play dates and extra curriculars. As they get older, they want more freedom (within reason) and having these watches helps with that. My son’s watch recently stopped working (later to find out due to water damage) and Tiffiny from customer support was quick to address my claim. She even sent me a shipping label so they could inspect the watch. That was Friday and by Tuesday, she responded with a solution. As a busy parent, I appreciated how Tiffiny kept the process moving so quickly and smoothly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "VHaugen",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T04:23:33.000Z",
          "Titre": "Great Product and Great Customer Service!",
          "Contenu": "Quick shipping, prompt customer service, and they even did a price match - really pleased with this company so far! My son also really enjoys his new watch - a great bridge between nothing and a smartphone. He loves to tell me how his day is going and I love how well he's been communicating his emotions more with the device!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura oneill",
          "Nb_Reviews": 2,
          "Date": "2023-07-13T21:47:10.000Z",
          "Titre": "I had a great experience with TIckTalk…",
          "Contenu": "I had a great experience with TIckTalk thus far. My son got his phone a few days ago, and everything is working as promised. I had several questions, that were answered very thoroughly through the phone customer service. I like that the watch gives my son some independence but allows me to get in touch with him when needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Usman Khan Jilani",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T19:20:51.000Z",
          "Titre": "Must have",
          "Contenu": "This watch has been a great help to the safety of my child. I absolutely love the customer service I have received and I would recommend this to every parent who is looking for a reliable means of communication for their child."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pavan Kumar Sharma",
          "Nb_Reviews": 2,
          "Date": "2023-07-21T05:58:24.000Z",
          "Titre": "Awesome Watch",
          "Contenu": "I have purchased this watch on 6th July 2023 and till than my child is using. I have choose the AT&T network for this and really what a coverage of network as i can call to my child any time and even he can call me any time. Audio, Video , voice , all types of call works great. I will recommend this watch for everyone. Earlier i have purchased other company watch which i have to return after 2 days due to network connectivity and lack of features but this watch is having all the features which is required for your child."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicki",
          "Nb_Reviews": 2,
          "Date": "2023-05-31T09:35:31.000Z",
          "Titre": "Comfort watches for me and my child..",
          "Contenu": "I have owned these watches for my children for the last 4-5 years and I have really liked the features they have to offer. I am happy to see them expand their accessory line and hope to see more band options again in the future for ticktalk 4. I do wish there was a way to connect them to a computer via Bluetooth to be able to download the pictures and videos, because my kids are hilarious with their little photo taking. But I do recommend this product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Starlyn Weller",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T21:41:13.000Z",
          "Titre": "We bought two watches for a big family…",
          "Contenu": "We bought two watches for a big family trip to Disney.  We wanted to make sure we all felt safe as well as providing a little more independence to our kids.  We based our purchase off of reviews compared to other watches.  They recently died unexpectedly but customer service was outstanding and helped us navigate and troubleshoot.  We ended up having to send them in and we were given a prepaid label.  The process to find a fix has been easy and smooth.  I highly recommend this product to other families who are looking for a way to give their kids more independence without having a cell phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elise Orozco",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T20:51:03.000Z",
          "Titre": "WE LOVE THIS WATCH!!!!",
          "Contenu": "WE LOVE THIS WATCH!!!!! The watch has given us so much peace of mind as we navigate my son getting older and wanting freedom. He is able to reach me anywhere and I can track what he's doing. We have grown reliant on this technology and would recommend it to anyone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M Cap",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T21:28:32.000Z",
          "Titre": "Superb",
          "Contenu": "The customer service has been superb! The troubleshooting and communications was not lacking at all. Our tech, Tiffiny Adams, work endlessly to resolve our issues. One being a cord replacement and other a found issue with missing a gold prong for the SIM card to work.  We are excited to get my child’s watch back working as it is a great tool to keep in touch and not be concerned about the internet! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Becky Ellender",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T02:25:14.000Z",
          "Titre": "We absolutely love our tick talk 4.0!!!",
          "Contenu": "We absolutely love our tick talk 4.0. With everything going on today, it has given me peace of mind to be able to communicate with my child when we aren't together. I researched several other options before giving the tick talk a try and I definitely feel like we made the right choice. If you are looking to curb internet access but still allow some fun, this is the device! I can communicate clearly with my child via voice messaging, phone call, or text. I recently reached out to customer service because we had a small issue with the watch band. Tiffiny Adams responded swiftly and is extremely professional. She was really helpful with this issue and took care of it immediately! Highly recommend this company and the tick talk 4.0."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "xue leng",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T04:08:38.000Z",
          "Titre": "Prefect little watch for the kid",
          "Contenu": "Prefect little watch for the kid. The prenatal control is great. I am able to set school time where the watch won't work when she is in class. Keep up with her location at all times"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred Marubayashi",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T20:29:13.000Z",
          "Titre": "We’ve had the watch for around 6…",
          "Contenu": "We’ve had the watch for around 6 months. We’ve had 2 issues we needed help with and the customer service and warranty department has been incredible. Very responsive and timely in their actions. The phone help people are incredibly helpful and patient as well. We have been very happy with the service and the product. I cannot recommend the device enough and have many friends who bought the watch because we suggested it for them. Overall great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alopez",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T04:36:14.000Z",
          "Titre": "TickTalk, great product and exceptional customer service...",
          "Contenu": "The TickTalk watch is a great product to stay connected with kids. It has phone call, video call, messaging, and emergency call functionalities and best of all the app allows complete control of the watch to make sure your child only uses the features you want at the time you want. The watch recently stopped working and the customer service from TickTalk was exceptional. We got a very quick response to email and Tiffiny Adams was excellent providing a simple process to have the watch replaced. Overall extremely satisfied with TickTalk and highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Delana Carter",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T21:01:04.000Z",
          "Titre": "U S based small company with great…",
          "Contenu": "U S based small company with great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Jeffs",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T03:18:23.000Z",
          "Titre": "TickTalk customer service is the reason…",
          "Contenu": "TickTalk customer service is the reason that I would recommend this watch and I have recommended it to my friends with children. They are so helpful and eager to make the customer happy. The company has empowered thier team to stand behind their product and do what is necessary to make the customer happy. Their superb service has convinced me that when my youngest child is ready, I'll be coming back to this company to make another purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Orlando Dranguet",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T02:48:26.000Z",
          "Titre": "Watch and customer service experience",
          "Contenu": "First I have to say my daughter and I are very happy with her Tick Talk watch. She has had it since September and she takes it everywhere. A couple of her friends have gotten the watch because of her. Recently we I contacted customer service due to a minor repair the watch needed and they were very accommodating. Overall very happy with the device and the company service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beth",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T03:35:26.000Z",
          "Titre": "We have loved having our ticktalk",
          "Contenu": "We have loved having our ticktalk. It gives our son some much desired freedom while also giving me piece of mind. We had an incident with some damage and the customer service has been great. Tiffiny has been quick to reply to messages and very helpful. We have been satisfied with our purchase!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather Wattai",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T23:20:51.000Z",
          "Titre": "Great watch and great company!",
          "Contenu": "I reached out to customer care with a question about one of the two watches that we purchased this past year. Tiffiny Adams provided exceptional customer service. She was expeditious in responding to my questions and provided an immediate resolve! The watches have given us peace of mind and also granted our children some additional independence. Great watch and great company to deal with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad Colyer",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T18:57:47.000Z",
          "Titre": "Fantastic customer service",
          "Contenu": "Fantastic customer service. Reached out with an issue on my son’s watch. Service rep Tiffiny Adams responded quickly and was able to help me solve the issue without hassle. It’s rare to have a company care about individual needs in this way. I’m truly appreciative of their service and assistance. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melanie Dunn Burns",
          "Nb_Reviews": 2,
          "Date": "2023-05-30T05:59:27.000Z",
          "Titre": "We’ve had nothing but great experiences…",
          "Contenu": "We’ve had nothing but great experiences with TickTalk, particularly with customer service! When we initially got the watch, the SIM card wasn’t connecting with the watch, and the customer service agent I worked with gave us some quick fixes that had it working in 5 min! And recently when my son dropped his watch and broke the face, I worked with Tiffiny at customer service who was able to help me get the watch covered to be repaired! We’ve had great experiences with the watch and would definitely purchase again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ibtissam",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T16:02:06.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good. I got this watch for my son as his very first smartwatch. Set up was pretty straight forward; if you're planning to add the watch line to your T Mobile account make sure you add it as a voice line and not a watch line as it won't work. I like that it functions as a phone but without the distractions of games and social media. A great way to stay connected with your kids; would recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ethan Chen",
          "Nb_Reviews": 2,
          "Date": "2023-07-04T23:41:41.000Z",
          "Titre": "best customer service",
          "Contenu": "The customer service is the best I have had. Tiffiny is very responsive and helpful. We got the feedback and detailed instructions for troubleshooting the next day after we contacted them. When that did not work, they sent the replacement right away. That is the top notch customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "May Poo Saelee",
          "Nb_Reviews": 2,
          "Date": "2023-05-11T14:51:21.000Z",
          "Titre": "The watch and been really great…",
          "Contenu": "The watch and been really great to have.  Being able to contact my child and track her has really helped my anxiety when allowing my child to take the school bus to school.  Horror stories of kids being left at the wrong stops forced me to find a solution to this potential problem. But it’s also been great to have to contact my child directly when they are with the other parent or other caregivers. The battery life is decent. We get about 2days of use before a charge is needed and it doesn’t come with a bunch of games to drain the batteries or if you are worried about screen time you don’t need to be with this."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth",
          "Nb_Reviews": 2,
          "Date": "2023-08-30T20:19:03.000Z",
          "Titre": "Product Value and Customer Service",
          "Contenu": "Hello, I purchased this product and I am very satisfied about the product and the customer service I have received. Product is as described and I feel so much more in control knowing I can find my child at a moments notice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kaleena Barnes",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T06:55:53.000Z",
          "Titre": "Great product! Great Service!",
          "Contenu": "My son has had the TickTalk watch for almost one year and it has been such a relief and security knowing I can see where he is and call/FaceTime anytime. He recently came back from visiting with friends and family and the watch face was not damaged yet unresponsive. I spoke with Tiffany and she provided clear steps on how to return the watch for diagnosis and the replacement process. I received the shipping label and within two days Tiffany contacted me with the results and replacement options. Excellent product and service that supports it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Lewis",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T20:07:33.000Z",
          "Titre": "We are so thankful we found Tick Talk…",
          "Contenu": "We are so thankful we found Tick Talk for our two boys. It is so nice to be able to get a hold of them whenever we need to but also monitor anyone that is their contact. I can check on their messages to make sure that everything is appropriate. Also, I’m able to do video chat with them. As far as Tick Talk is concerned, they have impeccable customer service, and are very quick to respond to any issues that may arise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Candice Coleman",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T21:08:49.000Z",
          "Titre": "Fantastic watch, excellent customer service!",
          "Contenu": "We have had 3 tick talk 3 and 3 tick talk 4 watches. The 4 was a great improvement! We use them constantly, the calls always go through, and the location is accurate. The customer service is fantastic. When you call, you actually talk with a real person. If you email, they respond quickly. I needed a new charger and they put one in the mail within 24hrs. For busy, active kids this is a worthwhile investment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Kuo",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T22:42:25.000Z",
          "Titre": "Great watch and great customer service!",
          "Contenu": "I bought my 9-year old a TickTalk watch for Christmas in Dec 2021. It's been perfect for both of us. For me, I can reliably track his whereabouts, and for him, he can call me as needed from anywhere. The watch has held up great for 1 1/2 years, except for the watch band, which just broke. I contacted customer service, and Tiffiny Adams got back to me promptly and even offered to waive the $100 replacement fee.  Great watch and great customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lindsay Schaefer",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T00:40:40.000Z",
          "Titre": "Great watch to communicate",
          "Contenu": "Tick Talk watch is great for parents looking for something for their kid(s) with reliable security and parental controls to be able to communicate with their kid(s). It’s cost-effective and has great customer service and support if needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anandan Loganathan",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T23:19:36.000Z",
          "Titre": "Excellent Customer service and replacement policy",
          "Contenu": "Strap broken within three months...and the replacement came with in a week!!! with no charge!!!!!. Excellent customer service!!!! Rigid watch ..good for kids..nice interface in phone to update the watch and easy to see where the kids are...."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fritz",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T05:04:34.000Z",
          "Titre": "Great kids phone/watches",
          "Contenu": "We bought two watches for the kids , 7 and 9yo. They really love them, and what’s better is that the watches are great. They seem very sturdy, are comfortable, and also work very well. We wanted a way to call and text them without access to other things like social media or browsing and these are just perfect."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Belalcazar",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T14:16:32.000Z",
          "Titre": "My 10 year old has had the watch for a…",
          "Contenu": "My 10 year old has had the watch for a little less than a year now and so far still working great and she loves it. we can effectively communicate via text or calls. The app is an amazing safety tool, everything goes through the adult in charge first. the quality of calls is just like any cell phone and the GPS locator also accurate. Customer service has been prompt and helpful every time. Thank you i will continue to promote the company with friends and family because i truly do love and feel my child is safe using the device."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristy",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T22:01:54.000Z",
          "Titre": "This is a great way to give your kids a…",
          "Contenu": "This is a great way to give your kids a bit of freedom but still know exactly what they are doing. It allows you to track them via GPS and also call and text them. You do need to adjust the parental controls though so your child cannot call or text strangers and receive calls from u known numbers. It is fairly easy to setup and the plans are reasonable. $9.99 for basic and $19.99 for unlimited."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jelly",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T01:52:53.000Z",
          "Titre": "Best kid watch on market",
          "Contenu": "I purchased this watch in August 2021 along with a blue one for both my kids. I am so impressed with how well these watches work. My kids wear them daily to school and when we are out in big crowds. I am able to track their location at school in real time. I don't have to worry about random people calling and texting them with the firewall feature. They don't have internet access, which gives me peace of mind. Also the monthly cellular service is very economical and reliable. I trust the brand since I purchased the ticktalk 3. Highly recommended. Recently one of the watches needed as small repair and I heard back from the customer service team in less than 24hrs. Very satisfied with the product and service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wardak",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T03:09:43.000Z",
          "Titre": "I've been using the tickTalk watch for…",
          "Contenu": "I've been using the tickTalk watch for 3years now because I needed a way to keep in touch with my child at anytime while he plays in the neighborhood, this device has been a lifesaver.  It's a phone that's worn as a watch. Simple and reliable and not a distraction, he simply wears it and we keep in touch.  The battery lasts all day.  The company backs up their product with a responsive service desk who are helpful and address any questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T22:55:19.000Z",
          "Titre": "TickTalk 4",
          "Contenu": "Great product, great service. Thank you GPS could be a little more accurate. Your employees do well with customer service. Natasha helped me with a purchase and a few other items being from michigan. She’s top notch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Grady Gill",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:10:55.000Z",
          "Titre": "Problem was fixed",
          "Contenu": "Situation was handled by company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benjamin Banning",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T16:07:59.000Z",
          "Titre": "I was recommended the watch by a…",
          "Contenu": "I was recommended the watch by a coworker who ordered one for his son. After doing a good deal a research, I decided to give the TickTalk watch a try. It arrived quickly and was very easy to setup. After having my 8 year old use it for about a week, we both loved it so much I ordered two more for my 6 and 7 year old. I love all of the parental safety features and the ability it allows me to connect with my kids and the access it gives them to connect with me and the extended family. I love the emergency SOS button and the GPS tracker. It puts me more at ease when my kids are out and about away from home. I would definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emily Field",
          "Nb_Reviews": 2,
          "Date": "2023-09-10T13:11:11.000Z",
          "Titre": "TickTalk customer service solved my problem",
          "Contenu": "The TickTalk agent solved my SIM card problem when the RedPocket folks kept me on a chat for an hour, gave me wrong information, and did not solve my issue!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Seth",
          "Nb_Reviews": 2,
          "Date": "2023-07-22T04:51:32.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "I recently purchased a TickTalk 4 watch and called customer service for setup help. After 3 rings an actual person answered the phone. She gave me great customer service and told me everything I needed to know."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leona Trout",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T22:39:42.000Z",
          "Titre": "This is great",
          "Contenu": "This is great! We bought this watch for our 7 year old. We travel for work and stay in campgrounds most of the time, this allows him to go to the playground by himself for a short time and we are able to see exactly where he is at. (Not that this Momma bear still doesn't go down and check on him anyway) this give him a little bit of independence. He loves being able to call his Grandparents, his Aunt and his older brother when he wants."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amber Foott",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T22:19:10.000Z",
          "Titre": "Watch is amazing",
          "Contenu": "Watch is amazing, and I have recommended it to several friends and family members. We had an issue with the band recently, and recieved a very quick response from customer service. They sent us a new watch immediately after they received the broken one, it is rare to see companies that stand behind their product like that!"
        }
      ]
    }
  ]
}