{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "navepoint.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Bracke",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T15:20:59.000Z",
          "Titre": "I absolutely regret purchasing this…",
          "Contenu": "I absolutely regret purchasing this product. Seems like solid construction but the screws included in the kit are nowhere near enough to mount a full rack. The spec sheet seems to specify both M6 and 12/24, which are completely different size screws. I ordered both and neither one actually fits the frame. Are the screws for this rack a non-standard size? Why would you make me figure out what screw fits? Terrible experience. I even purchased other navepoint products and even those screws don't fit on their own product!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gordon Ale",
          "Nb_Reviews": 2,
          "Date": "2023-08-23T15:33:07.000Z",
          "Titre": "Placed an order",
          "Contenu": "Placed an order, received the order, put the parts in my data center to be used later.  Assembled the rack.  Went to assembled the rack mounts and one didn't have the correct rails.  Contacted customer service.  They told me they would send out the correct part, have not heard from them after 4 emails.  Long time customer.  Will not buy from them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Randy Patton",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T17:28:43.000Z",
          "Titre": "I was double charged for shelves I…",
          "Contenu": "I was double charged for shelves I wanted. The shelves were not drilled correctly so I had to modify them to make them work.  I would not buy from this company again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stacy Kaufman",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T20:16:32.000Z",
          "Titre": "I was excited to purchase your IT rack…",
          "Contenu": "I was excited to purchase your IT rack system, however it did not fit into my IT closet.  It seems that you left off the Outside Dimensions for the rack that I bought, thus it is too big.Despite your company not having the complete description of the item, you refused to pay for the return shipment.I have returned the item at my expense and have received a refund.I'm now out the freight to return it and you have lost a customer for life.Not sure if this is what you think is good business or not?Respectfully,Stacy KAUFMAN"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Oliver  Fernandez",
          "Nb_Reviews": 1,
          "Date": "2022-02-21T16:58:45.000Z",
          "Titre": "deliver on time purchase rack did not…",
          "Contenu": "deliver on time purchase rack did not meet expectations. Try calling but after waiting for agent on hold calls keeps dropping. would not recommend or use on future projects.If you are a professional don't buy this waste of time and resources."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tyrone Farrell",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T08:56:46.000Z",
          "Titre": "Your logistics needs a lot of work.",
          "Contenu": "Your product was awesome, best 36u rack at any price,  not being able to track the item after shipping was a nightmare. The link provided did not work,  customer service didn't have a clue, all I had was a good faith promise and 1200.00 dollars removed from my account.  And with all the fraud and identity theft in this day and age, no one should have to use pay pal to pay for delivery. It should be added in the main price,  and all logistics properly taking care of."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jae  Ha",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T23:47:52.000Z",
          "Titre": "Order Missing",
          "Contenu": "I placed an order on 11/27/2022. I received an order confirmation stated the order shipped. I then reached out to customer service on 12/7/2022, and they asked that I confirm the address. I have not heard anything since and have yet to receive my order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KC O.",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T21:01:28.000Z",
          "Titre": "Be warned!",
          "Contenu": "I was lured into ordering a shelve and cabinet by a customer service rep. Only to be called a few days later that I need to pay an extra $150+ before I can have my order delivered to me because it comes in a pallet. I have had several heavier items delivered to me in a pallet by other vendors such as my media room furnitures without having to request a separate delivery fee after the fact. This is a very unprofessional behavior and one that I least expected from a Company like this. The fact I actually called them on the phone, gave all the details and they sent me a link to pay for my order online, which i did immediately; only for them to call me a few days after charging my credit card and demanding more money/delivery fee, is what is very worrisome. I would beware of this Company. I have asked that my order be fulfilled as is or canceled and refunded, but they've gone radio silent on me in the last 2-3days as of today Feb 3rd. I am currently exploring my options."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Duane Sheets",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T23:25:04.000Z",
          "Titre": "The 18/2 speaker wire is several times…",
          "Contenu": "The 18/2 speaker wire is several times the resistance it’s supposed to be. Do not use for runs longer than a few feet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brad",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T20:18:03.000Z",
          "Titre": "Made a purchase through Amazon and…",
          "Contenu": "Made a purchase through Amazon and never received the product.  While I believe the product to be good.  I would select your purchase platform carefully."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2022-10-15T23:04:49.000Z",
          "Titre": "ordered a rack with next day delivery…",
          "Contenu": "ordered a rack with next day delivery at almost $300 and did no receive it. No email no phone call and no-one to speak with and no tracking info."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Luis B Castro",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T20:57:51.000Z",
          "Titre": "After I paid for the article",
          "Contenu": "After I paid for the article, 3-4 days later they want me to pay another 100.00 for shipping. THAT’S WRONG!!!!!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim Zimmerman",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T13:05:33.000Z",
          "Titre": "Damaged Shipment - No Support from CS",
          "Contenu": "Item (server rack) received damaged. Upon discovery, immediately emailed customer service with supporting pictures to which no response was received. Followed-up by calling customer service number five days later. Call taker promised someone from appropriate department would call back the same day and that did not happen. First and last time doing business with NavePoint."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Manju",
          "Nb_Reviews": 1,
          "Date": "2022-08-20T01:08:16.000Z",
          "Titre": "Return experience is horrible",
          "Contenu": "Return experience is horrible. I am stuck with broken product and unresponsive customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Maldonado",
          "Nb_Reviews": 1,
          "Date": "2022-05-13T13:50:47.000Z",
          "Titre": "Wrong address didn’t get my order"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gordon Farnsworth",
          "Nb_Reviews": 1,
          "Date": "2022-01-10T13:34:02.000Z",
          "Titre": "Kindergarten art class quality",
          "Contenu": "One is many time too many stars. Just unpacked, attempted to assemble and repacked a portable cabinet and scheduled a return. The tolerances presented in it construction would only work if they sent with the screws, a lot of baling wire and bubble gum. The unit could not, in any way, be assembled as provided. Some of the holes drilled were barely in the same zipcode."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason Matlof",
          "Nb_Reviews": 1,
          "Date": "2021-11-04T00:40:47.000Z",
          "Titre": "I had a return of product due to a…",
          "Contenu": "I had a return of product due to a misquoted shelf size. The Navepoint support team provided ZERO help in trying to cost-effectively return ship the product despite numerous emails and phone calls. Due to the lack of concern nor help, the return would've cost as much to ship as the cost of the product. The box sits in my garage. Thanks so much for your concern and help. NOT!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Corey",
          "Nb_Reviews": 1,
          "Date": "2021-10-14T19:36:09.000Z",
          "Titre": "My company will never buy from…",
          "Contenu": "My company will never buy from navepoint again. The quality of the rack I bought was subpar compared to other manufacturers. The fact that they didnt calculate shipping correctly when i purchased on their website and made me go through paypal to pay for shipping was extremely annoying since I am already busy as it is. Purchasing items should not be this difficult. If i add something to my cart and pay for it then i expect it to be shipped and delivered not contacted about it and pay more for extra shipping."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Axel Maldonado",
          "Nb_Reviews": 1,
          "Date": "2021-04-27T19:58:38.000Z",
          "Titre": "Horrendous service & shipping policies",
          "Contenu": "Horrendous service & shipping policies. Free shipping is advertised on the whole page but only one tiny hidden disclaimer that declares shipping is extra and expensive ($50) for non continental US addresses.Edit replying to navepoint: Yes you do publish your shipping policies on the site but there is no excuse for hidding it. It should be on your check out page not hidden away."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Marks",
          "Nb_Reviews": 1,
          "Date": "2021-01-10T13:58:19.000Z",
          "Titre": "The ordering process of waiting on…",
          "Contenu": "The ordering process of waiting on NavePoint. Gonna be honest I am a first time customer that will be last time. The shipping is horrifyingly slow. I had packages comes from california in 4 days and we are going on 8 days and navepoint keeps telling me there is a delay. Only delay I see is you after getting all 37 of my packages in a week except my navepoint server rack rails. I won't shop here again. Pretty sad when small time ebay sellers ship faster then an established company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Asus delux",
          "Nb_Reviews": 2,
          "Date": "2020-05-29T13:46:50.000Z",
          "Titre": "The keystone jack patch panel clearly…",
          "Contenu": "The keystone jack patch panel clearly has an issue and it is still available for sale... no alternative was suggested. My 24 lines are now terminated with keystone jacjs tha3do not fit the patch panel despite stating that they are compatible with the keystone patch panel for sale... i was offered a refund for the parts but the work is done and its my loss.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bryan Knight",
          "Nb_Reviews": 1,
          "Date": "2019-06-15T20:16:38.000Z",
          "Titre": "Fans are LOUD!",
          "Contenu": "The fans in the cabinet are very loud, the holes cut in the back of the cabinet for mounting are 17 1/2\" apart. The studs (which the cabinet has to be mounted to) in all houses are 16\" apart. The details on their website say a mounting bracket is included, IT IS NOT! Coustomer service offered no solution for the loud fans, and suggested I purchase plywood to mount the cabinet to my wall."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wade  Bagley",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T09:10:47.000Z",
          "Titre": "I never received my order."
        },
        {
          "Note": 1,
          "Lieu": "PR",
          "Pseudo": "Carl Soderberg",
          "Nb_Reviews": 1,
          "Date": "2019-01-30T18:53:02.000Z",
          "Titre": "Ship to Puerto Rico.",
          "Contenu": "I am from Puerto Rico, I buy you a 22u rack and you send it to me. Now I buy a sencond one and you call me that you have to cancel the order because you dont ship to PR. I you already have send it to PR. why now you dont. You can do much more bussines is you fond a carrier that send to PR. you will thank me. also if you want a Rep in PR. you can call me and do some business."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rauf",
          "Nb_Reviews": 1,
          "Date": "2017-01-23T18:17:41.000Z",
          "Titre": "Assembly instructions",
          "Contenu": "Product itself is good. Instructions to assemble needs to be clear to save time for those doing it the first time. Instructions that came with the product had complicated pictures with little to no description. I called support and they sent me instructions that were too wordy and without clear pictures.My suggestion would be to break instructions into several steps with clear pictures and descriptions."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carlos Blandino",
          "Nb_Reviews": 1,
          "Date": "2022-02-16T02:36:25.000Z",
          "Titre": "I have not received my order because I…",
          "Contenu": "I have not received my order because I got the free shipping and it takes longer to receive it therefore I can't give it a good review, maybe once I get my order I will be able to give a better review"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deborah Bino",
          "Nb_Reviews": 2,
          "Date": "2017-10-09T23:55:44.000Z",
          "Titre": "your phone people are not well …",
          "Contenu": "your phone people are not well informed.  Your products shown on website are confusing (listed SAME two items for different price because it is \"used for another application is STUPID.  I received a product I absolutely cannot use, $40 down the drain.  I don't want to have to deal with shipping it back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ted Pierce",
          "Nb_Reviews": 2,
          "Date": "2019-02-14T16:39:09.000Z",
          "Titre": "Ordered a 4 post 42u server rack",
          "Contenu": "Ordered a 4 post 42u server rack.  Was only shipped half of the rack.  Called customer care immediately and it took 4 days to have the remaining pieces sent out.  Was not shipped with any kind of urgency.  When I would call back I would be told that they were busy and would get it out as soon as possible.  Why would a mistake that you made not take priority and not be shipped out overnight??  To have to call everyday and receive the same excuse.  it was Monday we were busy, it was Tuesday we were busy.  Will never purchase from this company again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony Newton",
          "Nb_Reviews": 1,
          "Date": "2018-12-18T00:08:30.000Z",
          "Titre": "Order got returned",
          "Contenu": "I placed an order and the shipper returned it back to you. The note on the shipper said the address was incorrect. I checked in my recent order status and the correct shipping address was there. Thanks to this I missed a deadline and will probably lose the account."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JC Smith",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T18:31:23.000Z",
          "Titre": "My product has been delayed by 1 week…",
          "Contenu": "My product has been delayed by 1 week and the never offered to help. Still waiting for the product. Very disappointed and would not recommend this company to family, friends or colleagues."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dent Office",
          "Nb_Reviews": 1,
          "Date": "2021-03-17T23:10:22.000Z",
          "Titre": "Average information provided about…",
          "Contenu": "Average information provided about shipping. When we clicked on the link it took us to usps which was not the courier.  Waited all day on what was supposed to be the deliver day. Lady on the phone was nice however."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Farr",
          "Nb_Reviews": 1,
          "Date": "2016-09-08T16:54:35.000Z",
          "Titre": "falling apart",
          "Contenu": "purchased 8 rack drawers, most have screws missing after first week many more falling out, 3 of 8 unusable now - have to be rebuilt. replace missing guide screwsvery poor assembly- no lock nuts or chemical lock on screws."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bob Bennett",
          "Nb_Reviews": 1,
          "Date": "2022-01-16T17:32:12.000Z",
          "Titre": "The one out of five shirts I bought and…Great product the 1 out of 5 I’ve recieved",
          "Contenu": "The one out of five shirts I bought and paid for almost a month ago is awesome.  They still owe me 4 shirts and I will start trying to contact them again…………………………"
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Saira Bano",
          "Nb_Reviews": 1,
          "Date": "2022-02-07T12:36:46.000Z",
          "Titre": "No one call back me I need to buy some…",
          "Contenu": "No one call back me I need to buy some things but no one help me.  My what’s app number 1 26 76659052.  Please call me. Other office number 12678884732"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2022-01-20T19:28:10.000Z",
          "Titre": "NavePoint 18U 450mm Depth Wallmount Networking Cabinet",
          "Contenu": "The cabinet was poorly packaged and arrived damaged.  After multiple conversations with customer services the issue still has not been resolved."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "I hate NavePoint...They're shi",
          "Nb_Reviews": 1,
          "Date": "2021-02-27T20:28:25.000Z",
          "Titre": "I've had two of their products and one…",
          "Contenu": "I've had two of their products and one was ok. The other is trash. Just like their customer service.I bought a 15U unit that worked fine except for the fact that the locks didn't lock correctly. Fine, I message them and they send me new side panels free of charge. Cool! The side panels have the same issue (the lock doesn't clear the frame to lock right.) What do I do now? I take a hammer to it and bend the frame so it works correctly.I buy another unit that you have to assemble the frame. I follow the instructions but the holes for the screws aren't large enough and i have to DRILL INTO THE FRAME to make the holes bigger. Whatever. As I attach the vertical rails to mount equipment to...THE RAILS ARE TOO SHORT TO ATTACH TO THE FRAME...This company is garbage and it's a wonder how they're in business. Their products are horrible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marcus Edwards",
          "Nb_Reviews": 1,
          "Date": "2021-07-22T14:47:45.000Z",
          "Titre": "Delayed Shipping",
          "Contenu": "the web portal said that when i placed my order before 2pm it would be shipped the same day; that was over a week ago and I still havent received it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "M.C.",
          "Nb_Reviews": 1,
          "Date": "2019-04-30T17:59:06.000Z",
          "Titre": "Screws not standard rack thickness",
          "Contenu": "Screws provided were too think for my rack rails and striped both the rack holes and screws provided by NavePoint. Gonna have to find different screws for it now."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laxman Chethan",
          "Nb_Reviews": 1,
          "Date": "2018-12-02T01:54:09.000Z",
          "Titre": "The bursh cable management didn't fit…",
          "Contenu": "The bursh cable management didn't fit the opening. Spoke to your customer rep. and i was told there isn't any brush cable mgmt accessory for the 15U rack ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew Chrostowski",
          "Nb_Reviews": 1,
          "Date": "2022-02-17T17:41:07.000Z",
          "Titre": "Refunded my order for no reason.",
          "Contenu": "Refunded my order.  Still shows in stock on website.  No reason given.  No communication.  Now project is delayed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mitsuru Yazawa",
          "Nb_Reviews": 1,
          "Date": "2021-04-27T20:56:26.000Z",
          "Titre": "I bought a rack online my order was…",
          "Contenu": "I bought a rack online my order was accepted and I was later called my a sales person saying they don’t have the product on stock."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2021-10-08T21:02:31.000Z",
          "Titre": "Poor Customer Service",
          "Contenu": "The product was fine. It didn't ship with a lock. Called \"Customer Service\" twice. They never called back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Jenkins",
          "Nb_Reviews": 4,
          "Date": "2021-10-06T18:33:29.000Z",
          "Titre": "The package arrived open and damaged",
          "Contenu": "The package arrived open and damaged. I  feel that I should not pay for damaged or open package, I want a full refund!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Huff",
          "Nb_Reviews": 1,
          "Date": "2021-03-17T20:50:06.000Z",
          "Titre": "Customer Service Slow to respond",
          "Contenu": "Still waiting for instructions how to return product for refund.  I have called and sent multiple emails."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bruce Hill",
          "Nb_Reviews": 1,
          "Date": "2021-03-23T14:19:16.000Z",
          "Titre": "Ordered 2 racks",
          "Contenu": "Ordered 2 racks, one came in as expected, the 2nd delivered late and was missing parts."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mel Witharana",
          "Nb_Reviews": 1,
          "Date": "2021-11-27T18:54:00.000Z",
          "Titre": "it came DOA",
          "Contenu": "it came DOA , send a request for refun but did not hard back from sales team ?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicholas Pharo",
          "Nb_Reviews": 1,
          "Date": "2021-10-17T17:39:38.000Z",
          "Titre": "Still have not received product I…",
          "Contenu": "Still have not received product I ordered.  Customer service seems to not care"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shiva Shahmir",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T03:34:15.000Z",
          "Titre": "We ordered 7 and only received 6",
          "Contenu": "We ordered 7 and only received 6. Tried to follow up and never heard back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mp",
          "Nb_Reviews": 1,
          "Date": "2018-03-11T14:59:15.000Z",
          "Titre": "Great price",
          "Contenu": "Great price, shipped quick, but it was the wrong product. Waste of my time and money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Josh Meeks",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T19:39:57.000Z",
          "Titre": "1 mount is so loose it will not hold…",
          "Contenu": "1 mount is so loose it will not hold the monitor up"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ralph Ragomo",
          "Nb_Reviews": 1,
          "Date": "2021-09-23T16:05:11.000Z",
          "Titre": "great company",
          "Contenu": "great company, great product, great customer service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Not yo fool",
          "Nb_Reviews": 1,
          "Date": "2020-12-12T23:01:28.000Z",
          "Titre": "Still has not been delivered think…",
          "Contenu": "Still has not been delivered think maybe lost on fed ex"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nathan",
          "Nb_Reviews": 1,
          "Date": "2017-05-24T11:59:48.000Z",
          "Titre": "Product was dented and chipped upon …",
          "Contenu": "Product was dented and chipped upon opening the package."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jaime Jeffreys",
          "Nb_Reviews": 1,
          "Date": "2021-04-14T21:31:21.000Z",
          "Titre": "It still hasn’t arrived!",
          "Contenu": "It still hasn’t arrived!! STOP USING FEDEX!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Conti Jr.",
          "Nb_Reviews": 2,
          "Date": "2016-10-09T11:11:16.000Z",
          "Titre": "Not good",
          "Contenu": "I never received the expensive item I purchased"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2020-12-23T13:55:05.000Z",
          "Titre": "Return policy is garbage"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Del Re",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T20:16:08.000Z",
          "Titre": "DONT BUY FROM NAVEPOINT",
          "Contenu": "So I have had ok service from Navepoint in the past. Previous purchases online or on location went ok, but it was never a super good experience, so this time I tried to place my order on the phone. When I called they refused to take my order so I asked the sales rep for the part number. After I had the items purchased and paid for online with the part number I was given and had it drop shipped directly to the customer, I then found out their sales rep gave me the wrong part number. When I arrived at my client's to begin the install and seeing the wrong part was shipped I immediately called customer support. I informed Navepoint this piece had to be installed as there was fines if I missed the deadline. Navepoint being in Libertyville and I and my client were in Oak Lawn about 85 min. apart. I informed customer support what happened and they said \"I'm sorry but we will send you a tag to return it and when we receive it we will send you a new one. Keep in mind it was $150.00 a day for every day we were late so I said well in that case I will put the rack in with what I have and just bring in the pieces that are wrong next week. Feeling that was fair, again I was told \"no sorry the only way to do it was the way previously stated\" I then said I could send a courier out with the parts and they would not agree to that either. I then demanded to speak to a sales manager and she told me they could not possibly do that. Getting no where, I then asked for the owner Russ. I had dealt with him over wrong parts they had sent me in the past and according to the sales manager Russ was not in the building, how ever not 45 seconds later he was there letting me know that this was not his fault. Yet I informed him his sales team gave me the wrong number but mistakes happen right. I would never never by any thing from them again. The sales people don't tell the truth, the sales manager lies and they never take responsibility for their mistakes. I have a lot of friends in the IT business and put it on Facebook. I received  25 phone calls from that and more than half of them agreed with what I said. People think if you open a business people will just beat down your door with sales but it is a relationship you build with customers that makes them want to deal with you. I think this is an example of what not to do.I called another vendor they had one delivered to my in 3 hours and they were cheaper than Navepoint. Since then I have spent over $3500.00 in three weeks at the new vendor"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas Marinelli",
          "Nb_Reviews": 1,
          "Date": "2019-08-24T10:43:52.000Z",
          "Titre": "Comments already noted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ishmael Befera",
          "Nb_Reviews": 1,
          "Date": "2020-08-24T02:48:20.000Z",
          "Titre": "It didn’t fit"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Timothy Wills",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T22:07:15.000Z",
          "Titre": "Order item on Thursday for a 2 day…",
          "Contenu": "Order item on Thursday for a 2 day delivery and now its Sunday and still has'nt been delivered. Would like my money back for the added shipping cost.Regards,Tim Wills"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Russ P",
          "Nb_Reviews": 3,
          "Date": "2023-10-17T01:25:02.000Z",
          "Titre": "Missing Screws and damaged enclosure",
          "Contenu": "Missing Screws and damaged enclosure. We installed but we may go back to a competitors enclosures"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Harun  Khan",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T21:10:54.000Z",
          "Titre": "Product description did not have enough…",
          "Contenu": "Product description did not have enough clarity. Most of equipment did not fit into the rack, especially Dell Servers and KVMs. I had to buy another rack from different vendors."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Duvall",
          "Nb_Reviews": 1,
          "Date": "2022-08-27T01:12:17.000Z",
          "Titre": "Both Boxes where ripped open in several…",
          "Contenu": "Both Boxes where ripped open in several places. Also items inside were damaged by the shipper. I have already notified Customer Service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joe N/A",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T23:31:14.000Z",
          "Titre": "good product but horrible logistics",
          "Contenu": "good product but horrible logisticsI have been trying to get a rack delivered for about a month"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Greg Nahmens",
          "Nb_Reviews": 3,
          "Date": "2022-02-03T14:23:38.000Z",
          "Titre": "I am disappointed with your Customer…",
          "Contenu": "I am disappointed with your Customer Service's lack of response to my telephone message and my email, requesting that you contact me regarding the necessary return of part of my order #19136.   Please email, or text/call me at the contact information associated with my order and messages.  Thank you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Will Judy",
          "Nb_Reviews": 2,
          "Date": "2022-01-10T19:21:30.000Z",
          "Titre": "NavePoint excludes Alaska from their…",
          "Contenu": "NavePoint excludes Alaska from their free shipping, however they let you place an order with free shipping.  They then contact you after the fact and ask for shipping ($65 in my case for a single rack).  I canceled my order and ordered directly from Amazon (For $20 less than their website) and got free shipping."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David LeClair",
          "Nb_Reviews": 5,
          "Date": "2021-11-25T13:01:49.000Z",
          "Titre": "Two cabinets received on time",
          "Contenu": "Two cabinets received on time, severe damage on 1 unit, minimal (but noticeable) damage on 1. RTV 1 unit, customer service slow to respond.2 shelves received late, 3 days after cabinets. Damaged, RTV 1 shelf, will use 2nd shelf.EVERY SINGLE order received since October has had damage, but have used them. Appears damage sustained at manufacturing location, at time of original packaging. Have mentioned this numerous times to sales & customer service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert E",
          "Nb_Reviews": 2,
          "Date": "2021-11-27T19:54:05.000Z",
          "Titre": "Enclosure received with damaged frame",
          "Contenu": "Enclosure received with damaged frame.  Damage appears to have taken place at the factory.  Contacted support sent photos of damage on 11/22.  An Email response was quick to sending a replacement part, however replacement of part still has not been sent.  Sent an enquiry to support and was told that I would receive an email when the part shipped.  This was on 11/23/21. The first email regarding this issue was on 11/22.  It is now 11/27 and tThis project is now behind schedule."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Meyer",
          "Nb_Reviews": 1,
          "Date": "2021-06-28T00:28:23.000Z",
          "Titre": "Delivery was fast but issues with installation",
          "Contenu": "Delivery was fast. I installed the 1 U sever shelf rails. When I went to slid in the Cyberpower rack mount UPS it would only go in half way. I have the identical Navepoint server shelf rails installed above it for my 4U server. It turns out the end of the UPS hits the lip of the bottom piece of the shelf above it. The spacing between the shelfs is off by about 1/8 inch.  Very disappointed. For now I have just lowered the server shelf rails for the UPS by 1U."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Erick",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T17:01:42.000Z",
          "Titre": "Customer service fails order from Amazon",
          "Contenu": "I’ll give them with two stars because product build is good but in shipping came bent on some shelving. I had to band the metal back myself because Customers service never Returned my calls or email for a refund. Your best bet is to order from Amazon it easier to get a refund there."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brian Gregory",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T16:47:50.000Z",
          "Titre": "The online order was as simple as…",
          "Contenu": "The online order was as simple as possible I I do have a big problem with recieving a item iv ordered & it wasn’t professionally packaged I’m sure if you sell items online you have to know about how shipping companies handle products . My item was bent I don’t know if it was already bent or was bent during shipping but it put me in a bad position of buying other products that I have locally vs what I ordered online"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Justin Krause",
          "Nb_Reviews": 1,
          "Date": "2019-08-14T00:05:40.000Z",
          "Titre": "Item was received damaged",
          "Contenu": "Item was received damaged. The back cover was bent the edges, the door edge is dented in right in the middle, etc. It's not enough to warrant the hassle of a return, but this isn't what I paid for either. It was also missing some of the assembly materials. The parts were laid out and counted and I'm missing a nut and a washer, so one of the screws was left out until I can get another one. Again, it's not enough to make it unstable, but enough to not buy from this brand again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Bossi",
          "Nb_Reviews": 3,
          "Date": "2018-10-12T16:57:07.000Z",
          "Titre": "I ordered a rack with additional…",
          "Contenu": "I ordered a rack with additional shelves and panels.The rack was out of stock so they canceled this line item and refunded my CC.  They made no attempt to inform me of this.  I have no rack to install my items. Stuff happens but you got to call me and tell me whats going on. I should not be the person doing the leg work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2016-10-05T15:32:57.000Z",
          "Titre": "numbering of the punch down block wrong!",
          "Contenu": "Good quality product, well made and sturdy. The punch down numbers on the circuit board were not in the correct location. This forced us to ring out all connections and re number the blocks and start over from the beginning. If they included a wire diagram this would have helped but it should be numbered to the standard."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-29T19:35:19.000Z",
          "Titre": "It came in but I had some small problems.",
          "Contenu": "I tried to create an account when I made the order but wasn't able to create a password that it liked. I never got an e-mail with the tracking number. I had to call the customer support for that. The package was supposed to show up 2 days later but turned out to be a week after I ordered it. The rack came in with what looked like half the box being wet and smelled of mildew. The rack was packaged nicely and the rack had no damage (which I have had issues from in the past where components are damaged). All that being said the rack works and it fits my need. I just won't be using Navepoint to fulfill the order anymore."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Goldberg",
          "Nb_Reviews": 1,
          "Date": "2017-05-01T13:27:33.000Z",
          "Titre": "Wrong size hardware included? Or bad powder coat job on the screw holes?",
          "Contenu": "Shipping mishap aside, when I received the rack it was easy to assemble and mount to the wall. The problems arose when I tried to install devices; patch panels, switches, a shelf, small 1U UPS; the included rack screws didn't fit. I first started routing out screw holes so the screws would fit. Then I tried using smaller rack screws which were tough to get in, but worked.Not exactly a great first impression, especially with a tough time frame to get everything installed, which is why I started off with the \"shipping mishap\"."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Todd Wooton",
          "Nb_Reviews": 1,
          "Date": "2021-07-06T21:08:59.000Z",
          "Titre": "Poor Customer Service",
          "Contenu": "I placed order #12969 on 6/29/21 and on the same day, left a message with customer service to cancel it.  No one ever called back on on the next day, the order shipped.  Now I have to pay to have it returned."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-08T13:22:44.000Z",
          "Titre": "My last navepoint purchase, 15u wall mount cabinet",
          "Contenu": "I bought 15u rack from navepoint.  I already had a 12u rack from them that was great.  the 15u rack arrived dented, scratched, the parts were tough to fit together.. the included cage nuts were already stripped (luckily I had more), the locks barely turned because of the rough cuts and condition of the rack I received.I ordered the 12u from amazon as an open box item and it came in better condition that this NEW rack I bought DIRECTLY from navepoint.  Like I said, while I still was able to get the rack together I was disappointed with the quality product I received based upon past experience - I expected more from navepoint in terms of quality.  I'll be switching brands for my next rack purchase"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Phil Nuss",
          "Nb_Reviews": 1,
          "Date": "2021-11-04T05:06:16.000Z",
          "Titre": "After I emailed you twice you never…",
          "Contenu": "After I emailed you twice you never sent an RMA or called me to return the shelf that did not work with the cabinet I purchased from you as well. Still have not received an RMA."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jesse Bosma",
          "Nb_Reviews": 1,
          "Date": "2017-03-24T16:55:38.000Z",
          "Titre": "Poor instructions",
          "Contenu": "We received our package in a very timely manner. Opened the package and there were virtually no instructions. A paper with a poor at best drawing... Also the product description does not say that it should be installed on a block or concrete wall. The mounting tabs were not big enough to get more than 2 screws in a stud each side.  And the shelf that is advertised with the bracket is NOT a corner shelf. One would think that with a corner TV bracket it would be a corner shelf. The shelves are not deep enough to hold a DVD player, or most cable/dish boxes. The good part of the shelf was it had EXCELLENT installation instructions. Had I known all of this I don't know that I would have purchased it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kiki",
          "Nb_Reviews": 1,
          "Date": "2020-07-03T17:38:18.000Z",
          "Titre": "The rack itself is decent, the customer service not so much",
          "Contenu": "The rack itself is decent. However ours was missing over 16bolts to put it together. As well as there were not enough rack screws. We were contacted by Greg Jenson who happens to be the sales guy in our area. He asked if we needed anything. We informed him we had to purchase over $25 worth of bolts because they didn’t send enough. He didn’t take care of us. Just told us that we should contact them next time before we buy. Unfortunately the job we were on timing was crucial as we were wiring a movie theater and waiting for screws when the should have already been sent is unacceptable. We may buy NavePoint again in the future, but as a brand and customer service they definitely didn’t win us over as solid customers going forward. Still in the hunt for that company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "richard",
          "Nb_Reviews": 1,
          "Date": "2017-06-28T15:44:18.000Z",
          "Titre": "Good finish -  Bad Tread on front of rack",
          "Contenu": "Good finish. Good metal work. No sharp edges.Had to re-tap the 12-24 tread holes in the front of the rack. If you dont have a tap and die set this rack is a problem. It was not a  plug and play experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrew Bicknell",
          "Nb_Reviews": 2,
          "Date": "2017-03-31T23:55:44.000Z",
          "Titre": "Not enough stock.",
          "Contenu": "This order you did not have enough stock to meet my needs.  I needed 20 vented 1U panels any you only had 15 in stock and no indication on when you could supply the remaining quantity that I need."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rod Doe",
          "Nb_Reviews": 2,
          "Date": "2017-11-13T01:39:14.000Z",
          "Titre": "I was unable to use this cable",
          "Contenu": "I was unable to use this cable.  My purchase was based on seeing (what looked like on the web site) 5 rca connectors into 3 rca connectors. It was actually 5 connectors on both sides."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Derek",
          "Nb_Reviews": 1,
          "Date": "2017-10-24T15:44:35.000Z",
          "Titre": "NavePoint change shipping company & follow with customers",
          "Contenu": "don't even know if product is good since I've have not received it as of 10/24/17. Your company may want to get a contract with a better shipping company. They called me 10/19 to inform me they were going to deliver on 10/20 and if we had a loading dock which we do. I told them I won't be in the office on 10/20 and emailed Wills Freight 3 count it 3 contact names with cell phone & lan line numbers. I came back on 10/21 to hear a voicemail message from the shipping company saying they're trying to contact me after all the info I gave them. I left a message for the driver and still haven't heard back. Not good for business. For this reason cheapest isn't always the best route. I work for the State of CA Government and they want us to purchase from the lowest quote not always the best move like in this case. Hope NavePoint uses a better shipping company in the future."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark S Groves",
          "Nb_Reviews": 2,
          "Date": "2017-02-02T15:09:12.000Z",
          "Titre": "The assembly instructions are the worst I have ever used.",
          "Contenu": "Quality control is obviously not a priority. One of the supports was drilled at an angle resulting in a screw hole aligned to the edge.  THis piece has to be replaced.  Customer service is some what helpful but parts fulfillment is slow.  I like the rack case, but I spent days trying to figure out how to properly mount everything to fit my existing rack rails.  After five attempts I figured out a method that would allow me to close the front door with the back door mounted and using my existing slides.  This configuration unfortunately does not work with the three shelves or the middle support brackets shipped with the cabinet. They are very shallow compared to the depth of the cabinet. Assembly has been a very frustrating and time consuming experience.  This is not my first rack installation, but I hope it is my last. Update:  I did receive my replacement brackets and they sent an extra one for some reason."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 2,
          "Date": "2017-05-19T22:57:23.000Z",
          "Titre": "Mechanism loose so TV will not stay …",
          "Contenu": "Mechanism loose so TV will not stay level in spite of level mount.  Screws soft and heada stripped easily.  Design great. Poor implementation."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brian Sharby",
          "Nb_Reviews": 2,
          "Date": "2021-10-13T16:49:20.000Z",
          "Titre": "No response from Customer service",
          "Contenu": "No response from Customer service.  Never received my product.  Have to call the bank to dispute"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryan St. Amand",
          "Nb_Reviews": 2,
          "Date": "2021-04-26T16:07:22.000Z",
          "Titre": "Second time ordering from this company…",
          "Contenu": "Second time ordering from this company and second time receiving a rack drawer with bent ears."
        },
        {
          "Note": 2,
          "Lieu": "TH",
          "Pseudo": "Alex Kot",
          "Nb_Reviews": 1,
          "Date": "2019-03-07T05:42:26.000Z",
          "Titre": "The on-line purchase at NavePoint site…",
          "Contenu": "The on-line purchase at NavePoint site didn't work, I had to go back to Amazon to order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "marcus twain",
          "Nb_Reviews": 1,
          "Date": "2016-12-20T20:52:48.000Z",
          "Titre": "never received a customer service response",
          "Contenu": "asked customer service why the shelves didn't fit my unit and they never responded."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryan Samuels",
          "Nb_Reviews": 1,
          "Date": "2020-02-12T19:46:37.000Z",
          "Titre": "The top cover was bent in 2 places",
          "Contenu": "The top cover was bent in 2 places. Had to use pliers to straighten out."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-08-21T20:46:04.000Z",
          "Titre": "The front door came with a dent and it…",
          "Contenu": "The front door came with a dent and it is bent"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tom Stone",
          "Nb_Reviews": 1,
          "Date": "2020-12-15T02:19:36.000Z",
          "Titre": "Shipping issues"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steven H.",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T04:46:07.000Z",
          "Titre": "Nice but used.",
          "Contenu": "The network server cabinet I purchased was supposed to new but it was obviously used - sold previously.  It was fine but I normally don't buy used equipment - especially at new price.  The quality of the cabinet is great.  I love the purchase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Walter Moran",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T18:58:56.000Z",
          "Titre": "The enclosure is too shallow",
          "Contenu": "The enclosure is too shallow, I will need to cut out the back panel."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Adam Lucas",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T04:41:00.000Z",
          "Titre": "Good Product. Two Problems.",
          "Contenu": "We have installed a lot of NavePoint enclosed racks with the glass doors. They are built strong and have a professional look to them. The price point is pretty good compared to similar racks we've used in the past. To improve we continually have 2 problems. The shipping almost always has boxes ripped due to weight and sometimes hardware is falling out and scratches on corners (Reinforce packaging). During operation on site the built in fans generate lots of complaints as they get very loud. Most times we have customers unplug them as they sound horrendous. If you punch rack a couple of times it will get quiet again (Better fans and secure them better to rack)."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ray",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T03:29:35.000Z",
          "Titre": "Wall weight limit is only 50lbs",
          "Contenu": "Pros: Product was well packaged, reasonable in price, shipping was quick. Customer service was courteous, empathetic, and helpful. Cons:Poor documentation; the build instructions were not as clear as they should be but were workable. Was missing a step about grounding wire. The datasheet was inaccurate, listing a 130 pounds weight limit that applies only when floor mounted or on casters. Wall weight limit is only 50lbs and this was only found out after attempting to load equipment, the rack sagging significantly,then contacting support."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris J",
          "Nb_Reviews": 1,
          "Date": "2022-12-31T03:42:10.000Z",
          "Titre": "Slight damage during shipping",
          "Contenu": "The product ordered was slight damaged during shipping.  The server drawer attachment tabs were slightly bent upon arrival some of the paint on the tabs was sratched as well.   I suspect the damage was caused during shipping but better packaging around the corners and attachment tabs of the drawer could have prevented this.  The damage is easily fixable and I will not be returning.   Aside from this damage caused during shipping the drawer is very high quality and better than I had expected."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paolo",
          "Nb_Reviews": 4,
          "Date": "2023-03-30T22:16:43.000Z",
          "Titre": "great products, horrible customer care",
          "Contenu": "5 stars for the products.1 star for customer care.I like their products, I kept buying, and I'll keep buying.I hope I'll not need to talk to them because they do not care. I have a pending request from March 18, still unanswered. I do not expect at this point any support/answer in the future.Quite happy with the products and with delivery experience, everything is great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe Anderson",
          "Nb_Reviews": 2,
          "Date": "2023-03-01T02:52:50.000Z",
          "Titre": "I bbn think your product is good....it…",
          "Contenu": "I bbn think your product is good....it would be better if you had a 16\" wall mount availability I have to do extra work to mount your product on the wall.  Also those 2\" lag screws are to short and the lag screws are metric heads...pain in the ass !!  You do not have reseller pricing...so my customers get this rack at the same price I do...."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian Erle",
          "Nb_Reviews": 4,
          "Date": "2022-06-04T13:21:51.000Z",
          "Titre": "Good products, but Shipping details need to be more revealing and prominent",
          "Contenu": "Navepoint's products are as advertised and well made.  However, if you are needing something shipped expeditiously, please read all of the fine print regarding 1 day, 2 day shipping before purchasing because 2 day shipping, could in fact turn out to be more like 5 days depending on the time of the day you place an order, the fact that weekend days do not count as shipping days, and if there is a holiday on a Monday or a Friday that does not count either, so buyer beware because you may end up shelling out hundreds of dollars to get a product shipped quickly, only to find out you won't get it when you expect.  This opinion sounds like personal experience, and it is.  I will hand it to Navepoint in that they refunded part of my shipping cost when this scenario unfolded for me after a bit of arm twisting.  I would like to see the shipping details more prominently displayed especially when 1 or 2 day shipping is being selected.  I understand we are all responsible for ourselves, but the buying experience here with regard to shipping can be improved in my view."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dennis L. Garrett",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T20:51:33.000Z",
          "Titre": "Everything was good it would help when…",
          "Contenu": "Everything was good it would help when you pick a product you could have the choice to easily see what works with the product chosen.  i.e. shelving, power mgmt etc."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "mark Moore",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T22:30:50.000Z",
          "Titre": "Called for info was told someone would…",
          "Contenu": "Called for info was told someone would email or call back neither happen"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric Silva",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T03:59:13.000Z",
          "Titre": "The overall structure was very weak",
          "Contenu": "The overall structure was very weak. It was not as sturdy as I thought it would be."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Goldthwaite",
          "Nb_Reviews": 1,
          "Date": "2021-09-20T14:18:25.000Z",
          "Titre": "Just OK",
          "Contenu": "This is the second rack drawer I've gotten from these people. The first one has a very slightly bent side on the front of the drawer which prevents it from closing all the way. This new one the drawer doesn't even seat properly and close all the way. They look like factory B stock but there is no mention of that on the site when you buy it. Not sure I'd order from these folks again. They do ship very quickly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2022-01-03T20:54:05.000Z",
          "Titre": "The rack I ordered was a great deal and…",
          "Contenu": "The rack I ordered was a great deal and a nice addition to my studio.  Unfortunately, it was missing some hardware that was instrumental to the assembly. I reached out to customer service and we exchanged a couple of emails regarding the issue.  I provided pictures and descriptions of what I needed. I never got a follow-up or indication that they were going to send me the missing items. After a couple of weeks, I went to the hardware store and Amazon to order the parts I needed. In summary, great products, but lacking customer service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David LeClair",
          "Nb_Reviews": 5,
          "Date": "2021-11-15T15:21:49.000Z",
          "Titre": "Every single order has had damage",
          "Contenu": "Every single order has had damage, mostly minor abrasions in the same spots, apparently caused by mishandling or insufficient packaging at the manufacturing source. However, the last order (early NOV 2021 had severe damage of the the cabinet top and it was reported to NavePoint. Photos were sent to Navepoint Customer Service.Other than that, orders are usually confirmed and shipped in a timely manner and we're pleased that shipments are made using FedEx. Our order from 11/10, however is late and not yet received as of 11/15/21.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve D",
          "Nb_Reviews": 1,
          "Date": "2021-03-23T20:14:58.000Z",
          "Titre": "Defective data jacks",
          "Contenu": "Shipping, Service are great. Most products are well priced and of decent quality.I have had multiple problems with the 00406362 50 pack of cat6 keystone data jacks. In each 50 pack I have had an 8 to 10 percent failure rate. It is not worth sending a tech back to replace the defective jack. I have had this discussion with Navepoint in the past with other orders.I"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard Clark",
          "Nb_Reviews": 1,
          "Date": "2021-06-17T21:11:58.000Z",
          "Titre": "The products are great, but the service was disappointing.",
          "Contenu": "The products are great, but the service was not so good.  There was no indication that the vertical cable manager could not be mounted to the 4 post rack (purchased on the same order).  I asked for help using the messaging system, but it took more than 2 weeks to get a response.  That response (which included my order number) just asked for the sku number for the two parts.I ended up drilling new holes in the vertical cable manager so it could be mounted on the rack.  I still haven't heard back from the on-site messenger."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sarah Wiswell",
          "Nb_Reviews": 2,
          "Date": "2021-06-17T12:26:02.000Z",
          "Titre": "Shipping out of California",
          "Contenu": "I used to order from NavePoint and would get the order in a day or two at the most.  My last few orders have shipped out of California so it takes a full week to get the order.  I'm on the East Coast.  I'm not sure why this changed, but it is worth noting to plan ahead timewise."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dave G",
          "Nb_Reviews": 1,
          "Date": "2020-10-14T12:20:28.000Z",
          "Titre": "Good rack. Had door fitment issues.",
          "Contenu": "The rack is what I wanted and needed for a project we did for a client. Bought based on the recommendation by a friend that uses these a lot. The door didn’t close properly. Required time to bend metal so it would. Not sure if it’s a packing issue and happened in shipping or just not made well. Other than the door the rack is nice."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Spencer",
          "Nb_Reviews": 1,
          "Date": "2020-08-09T21:35:53.000Z",
          "Titre": "Bent edges give poor fitment.",
          "Contenu": "Product was shipped flat packed which is expected and acceptable.  However, either due to the flat pack of the product or the manufacuting of it some of the edges were bent.  I bent back, as best I could, the edges into not quite a straight line. This made fitting the pieces together difficult and some of pieces fit either a little snug or loose.  The product over all is good and I would buy it again, but the bent pieces show either a lack of care in packaging and shipping or in manufacturing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Leo Larrahondo",
          "Nb_Reviews": 2,
          "Date": "2019-07-03T21:43:35.000Z",
          "Titre": "Some good and some bad feedback",
          "Contenu": "Some good and some bad feedbackNavepoint 12U 450mm Depth Network Cabinet Consumer SeriesGood- The order arrived on time as expected.- The price was good for the network cabinet size and features. Bad- The instructions to assemble the network cabinet are terrible and very difficult to follow.- The network cabinet had some bent edges that had to be adjusted to assemble the cabinet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donn Wilmott",
          "Nb_Reviews": 2,
          "Date": "2018-12-30T14:33:03.000Z",
          "Titre": "Assembly was a process...",
          "Contenu": "Assembly was a process... had to take apart and try a second time. Slight bends in top and bottom made problems with hole alignment and rail mounting. In the end, 11:30 pm, the finished product was exactly what I expected when I ordered it on-line, a very functional 9U Consumer Series Data Cabinet. For the price worth every penny... just not the long assembly process."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "B. B. Helsabeck",
          "Nb_Reviews": 1,
          "Date": "2021-08-25T15:48:18.000Z",
          "Titre": "I bought a \"consumer grade\" equipment…",
          "Contenu": "I bought a \"consumer grade\" equipment rack to house my NAS, Modem, Router, ARLO Camera Base Stations and a few other items. My issue is there is no accommodation for access for a power lead to the Power Strip I mounted, nor any designed access for the Modem Cable. I was able to \"jury rig\" access through one of the wall mounting holes for the Modem cable, and one of the Latch accesses on the side panel for the power cord. I did not \"wall mount\" the device, it is free standing. A designated , designed access port at the top and bottom of each side panel would be very helpful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Todd McNutt",
          "Nb_Reviews": 1,
          "Date": "2019-07-31T19:12:07.000Z",
          "Titre": "Build Quality",
          "Contenu": "Build Quality: Our technical folks have been coming back with complaints concerning the build quality.  Mainly how much labor it takes to put together many of the wall racks, as well as the durability of the materials used.  They have said if they come mostly put together, and are made of slightly thicker metal would be a real benefit."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ruth Medina",
          "Nb_Reviews": 1,
          "Date": "2020-11-06T03:24:42.000Z",
          "Titre": "Caution. Before assembly make sure there are no dents on the rack!!",
          "Contenu": "I was looking for a server wall mount rack and couldn’t decide on a brand...After a lot of research I decided to go with NavePoint and ordered the Glassdoor 12U pro series. When my item arrived I immediately opened the box and started the assembly process and found a big dent on the metal holding the glass door... I literally paid extra because the glass door makes the rack looks more professional...I thought about calling and request a refund but at that time I had assembled 90% of the rack. Now I’m stuck with a big dent on the front of my rack."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason Harper",
          "Nb_Reviews": 1,
          "Date": "2020-01-21T19:44:43.000Z",
          "Titre": "Left to desire more..",
          "Contenu": "The online ordering process was good, and I did receive the product.  However, I was not able to check my order online for 2 days, nor received any emails about my order (received, processing or shipped).  When calling for a status of the order the rep could not look it up and stated he would check and call me back.  I never received a callback.  Not a good start to a relationship with a new enterprise customer.  I would expect thorough communications (verbal or email) with a representative about my orders."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Virgil W",
          "Nb_Reviews": 1,
          "Date": "2021-10-27T15:15:42.000Z",
          "Titre": "I returned a vented shelf as per…",
          "Contenu": "I returned a vented shelf as per directions from a person in customer service.  I was seeking a refund since it didn't fit my Navepoint Rack.  I waited literally weeks even sending a message via the issue portal and NOTHING.  I finally had enough so I was on the chat and the person told me to follow the same procedure.  I told them I had and yet NO response and NOW what is the next step to resolution.  A Customer Service called me and processed the return they had received weeks previously.  The Rep apologized for the delay and said they were the ONLY person in that role.  She needs help from management to get more resource working the CS Desk."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 2,
          "Date": "2016-08-10T22:28:18.000Z",
          "Titre": "Awesome",
          "Contenu": "The product is awesome and very sturdy. The price is perfect and can be used for different servers without the need for additional parts or modifications. The only issue is that the shipping by Fedex ground took longer than it should and showed on the Fedex website without any explanation as to why or correct and accurate tracking information for the customer"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JB",
          "Nb_Reviews": 1,
          "Date": "2017-03-29T21:49:16.000Z",
          "Titre": "Mediocre",
          "Contenu": "Included instructions define tilt as 15 degrees while on line literature states 20 degrees.There's no \"stop to keep the TV fro sliding off either end of the mount. The arms are not interchangeable and that's not explained in the directions.The directions are very sketchy, should be much more specific and detailed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric Stephenson",
          "Nb_Reviews": 2,
          "Date": "2021-09-07T20:49:30.000Z",
          "Titre": "Partly really good and partly really aweful",
          "Contenu": "For the ability to buy on line and updates to the order status I would give you 5. For the lack of basic telephone queuing set up and reply to my follow up email I give you 1-I still have not had a reply from the middle of last week"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris B",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T15:40:30.000Z",
          "Titre": "Arrived quickly but had multiple dented…",
          "Contenu": "Arrived quickly but had multiple dented parts.  It was fairly simple to put together alone but took extra time to try and adjust it so that the door was properly aligned. For the price, I expected better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew Bicknell",
          "Nb_Reviews": 2,
          "Date": "2018-10-10T20:47:11.000Z",
          "Titre": "Your rack shelves are excellent",
          "Contenu": "Your rack shelves are excellent. However your blank rack panels are oversized and not in compliance with standardized dimensions. On the 1RU vented and non vented panels the size is approximately 1/32\" over height. If I try stacking multiple panels after stacking about 6RU the screws won't align with the rack threads.  I don't know if mechanically you allowed for the thickness of the powered coating. Your 1, 2 and 4RU models all exhibit this issue.  Good quality panels with a great finish but not dimensionally correct."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JASON",
          "Nb_Reviews": 1,
          "Date": "2021-10-28T16:41:30.000Z",
          "Titre": "They ship with FedEx.",
          "Contenu": "Everything was fine when placing the order. NavePoint shipped it right away. I give them three stars because they shipped with FedEx. My network rack has been sitting at the local fedex warehouse for 7 days now. 7! FedEx has come up with every excuse in the book not to even attempt a delivery . I can’t even go there and get it because it is the type that has no shipping center or customer support. All I can do is request it be held at a different facility. I was given three choices all of them at a Walmart. Now I have to wait for them to deliver it there just so I can go pick it up. Will likely be 10 days total, this doesn’t include the actual transit time. Please stop shipping with FedEx."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Willis",
          "Nb_Reviews": 1,
          "Date": "2019-01-12T01:36:04.000Z",
          "Titre": "Damaged Products - Internal",
          "Contenu": "This the second shipment that I have received from NavePoint that has had internal damaged to  the components. They quickly took care of the first one in 2018 and I have just sent them a E-Mail about a recent shipment. The shipping box had no visible signs of damage by the shipper."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "George Rapino",
          "Nb_Reviews": 3,
          "Date": "2017-04-28T17:51:49.000Z",
          "Titre": "I enjoy Navepoint products",
          "Contenu": "I enjoy Navepoint products. However, living in a big city like N.Y.. getting large items shipped to my home with FedEx is aggravating. It's unfortunate for Navepoint to suffer due to fedex shipment practices. So, I will most likely stop buying Navepoint altogether. Not worth the trouble!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sid Moorhead",
          "Nb_Reviews": 1,
          "Date": "2018-12-12T04:59:36.000Z",
          "Titre": "Acceptable quality, terrible instructions",
          "Contenu": "Acceptable quality, terrible instructions.I like the case but the actual rail supports are flimsy. I had to reassemble the entire case as the printed instructions were extremely blurry. Case is great, but 2 stars off for both the instructions and the flimsy rack points."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jeff Clark",
          "Nb_Reviews": 1,
          "Date": "2018-01-03T22:15:20.000Z",
          "Titre": "Good products overall",
          "Contenu": "Over the last year or so I've placed a couple orders for NavePoint rack shelves.  Each time, the experience was the same.  Some of the shelves are fine, while others arrived bent or with chips in the paint.  I was able to bend the shelves back into shape, so I kept them.  Not sure if it's shipping damage, or if they came that way from the factory.I also have one of their 4 post racks, that I'm quite happy with.  Their pricing is also very competitive.I've never been able to use the PayPal feature on their site, they need to fix it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SteveD",
          "Nb_Reviews": 6,
          "Date": "2018-02-08T23:20:23.000Z",
          "Titre": "Love the company and products...your …",
          "Contenu": "Love the company and products...your website is terrible.  Selecting the coupon offer disables ability to log into my account.  Clearing cookies and log in worked, but when purchase items are selected, they disappear when I try to checkout....ugh!Get a more focused IT guy."
        },
        {
          "Note": 3,
          "Lieu": "DO",
          "Pseudo": "Enrique Reyes",
          "Nb_Reviews": 2,
          "Date": "2018-05-08T22:36:02.000Z",
          "Titre": "The product is great but could be…",
          "Contenu": "The product is great but could be better is how they are packed and shipped. The rack ears have come bent on the shelves I have ordered. With some effort they can be bent back into shape but there should be a way that in shipping the ears don't get bent. Thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeffrey Bur",
          "Nb_Reviews": 3,
          "Date": "2020-07-21T01:18:53.000Z",
          "Titre": "Not enough bolts",
          "Contenu": "Not enough bolts, washers and screws for equipmentFlimsy rack railsSquare holed racks harder to mount equipment.  Pre tapped rack rails are much better, and save a step for mounting equipment.Very difficult and time consuming build"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sun Ha",
          "Nb_Reviews": 2,
          "Date": "2020-12-15T16:59:59.000Z",
          "Titre": "The rack is good",
          "Contenu": "The rack is good, but the shelf send with wrong screw for my rack. Call customer service then make me to pay for the screw. After complaints then said will ship to my with in 48 hours. But never see the screws almost a week."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 3,
          "Date": "2017-10-17T02:06:01.000Z",
          "Titre": "Great experience, but why?",
          "Contenu": "Great experience, but why?  Why does the 1U drawer (00401459) only opens 7.5\"?  I cannot even reach my hand in far enough to hit the back wall.  Small parts like headphone adapters roll to the back and you need a tool to extract them.  In today's age all quality drawers should have full extension, especially on a drawer this shallow.  Nice product, but I'll be looking to replace the drawer slides.Edit:  4 Stars to 3 Stars - I wondered why NavePoint is selling the same product listed in multiple categories with different pricing.  After posting my review I see others have confirmed this unethical pricing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BushwickRick",
          "Nb_Reviews": 2,
          "Date": "2018-11-05T00:34:23.000Z",
          "Titre": "Well..you get what you pay for",
          "Contenu": "Well..you get what you pay for. I went for the consumer series 9u enclosure. Right out the box, I had to grab a pair of pliers and straighten out some pieces that were bent. Not good. The included instructions were horrible. I feel sorry for anyone that has never built one of these enclosures. They will have a hard time for sure. I´ve built several of these over the last couple of years and have learned to just go to the website and download the instructions they have there. Once assembled, the enclosure is pretty decent. Next time I have to purchase another enclosure, i´ll go for the Pro series. Seems to be better built and sturdier."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Naticchia",
          "Nb_Reviews": 1,
          "Date": "2020-08-03T16:31:42.000Z",
          "Titre": "So the wire seems quality",
          "Contenu": "So the wire seems quality, much larger than I anticipated,  more like 14 ga. Instead of 18ga. Made it difficult to use as intended, but with splicing 20 ga. On hand, made it work. Just never seen an 18ga. 4c so large"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CT",
          "Nb_Reviews": 2,
          "Date": "2021-03-09T20:14:48.000Z",
          "Titre": "Pricing has gone up and you STILL dont…",
          "Contenu": "Pricing has gone up and you STILL dont have a place for us to enter a PO# on orders....Makes tracking in our warehouse very very difficult.  I've been told several times to stop buying from you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christian",
          "Nb_Reviews": 2,
          "Date": "2017-01-07T04:13:22.000Z",
          "Titre": "The Monitor stand is nice, but it's not quite what i expected.",
          "Contenu": "I ordered a 3 Monitor stand for up to 27\" screens, however not all three 27\" screens fit without overlapping the others... I'm a bit disappointed by the fact that I didn't quite get what I had hoped..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Javier Ferrer",
          "Nb_Reviews": 1,
          "Date": "2016-09-16T13:35:52.000Z",
          "Titre": "Good quality products, not so well protected inside the box",
          "Contenu": "The quality of the products is good. Unfortunately, the items were not well protected inside the box, one 1u vented cantilever shelf and one 1u horizontal rack mount cable management metal raceway unit came came bent."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel McCafferty",
          "Nb_Reviews": 7,
          "Date": "2020-04-29T13:25:51.000Z",
          "Titre": "Sturdy",
          "Contenu": "Sturdy, well crafted, excellent sliding mechanism. However one major negative. Most of the holes did not line up with my rack rails. I managed to make both drawers work but it took some effort."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bruce",
          "Nb_Reviews": 3,
          "Date": "2019-05-03T18:42:51.000Z",
          "Titre": "Great selection, good products, need help with packing.",
          "Contenu": "NavePoint's selection is great, and their prices are very reasonable.  Unfortunately, one of the items I ordered -- a rack shelf -- was damaged in shipping: one of the 'ears' was bent badly, and unusable as received.  These things happen, but in my opinion the shipping box was insufficiently packed with filler to keep the items in place during shipping.  I was able to bend the shelf back to useful shape, but of course, some of the paint chipped off and had to be touched up.To NavePoint's credit, they quickly offered to either a) replace the item, or b) give me a discount for the damage.  Because I could not wait for a replacement in this situation, I took the discount.I would be inclined to give them another try at a later time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "esstek",
          "Nb_Reviews": 3,
          "Date": "2017-10-23T17:20:32.000Z",
          "Titre": "My rack shelf and (missing!) 50 pack of …",
          "Contenu": "My rack shelf and (missing!) 50 pack of cage nuts and screws arrived in a large box that was taped ONLY at the center seam, and not very well, at that. I'm 99% sure the hardware pack slipped out of the box, due to the LARGE GAP that was evident when you flexed the box. When I called CS to report the shortage, they were largely incredulous that the 50 pack of hardware was not in the box, even insisting that I \"look carefully\" in the box once more to make sure they weren't really there. I did not appreciate their disbelief or condescension. They DID ship a replacement bag of hardware, but the experience really made me question their commitment to customer service. How can they NOT KNOW HOW TO PROPERLY TAPE A BOX???"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard Bisetti",
          "Nb_Reviews": 2,
          "Date": "2021-07-17T19:41:34.000Z",
          "Titre": "Slow shipping",
          "Contenu": "Slow shipping. Order has not arrived after 8 days…Small Order,Still waiting, payed extra for shipping ……14/2 White speaker wire, unable to finish surround install."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe N/A",
          "Nb_Reviews": 2,
          "Date": "2022-01-03T23:48:34.000Z",
          "Titre": "navepoint always makes good products",
          "Contenu": "navepoint always makes good products. However the price increases were way too much. Now the price points is much higher than other similar products."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jelle",
          "Nb_Reviews": 1,
          "Date": "2018-12-03T22:03:52.000Z",
          "Titre": "Great quality product. Order and shipment info needs improvement.",
          "Contenu": "Didn’t receive an order or shipment notification, so had to contact support. Support was helpful. Great product once received! Quality of product surpassed my already high expectations."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Curtis Tallman",
          "Nb_Reviews": 3,
          "Date": "2017-05-31T22:07:37.000Z",
          "Titre": "Great shelves - horrible experience with website",
          "Contenu": "The shelves I purchased from NavePoint are great.  My issue is with their website.  After I selected the shelves, I elected to pay using PayPal, but the site would not ever let me complete the transaction.  I totally closed out my browser and tried a different browser after getting some online \"help\", all with no success.  I then backed out and tried to pay with my credit card I couldn't even get to enter the card number..  I finally tried using Amazon Pay and that finally worked.  I can't begin to describe the frustration I felt before finally getting their site to complete the transaction.  After that, however, the shipment was scheduled for delivery the next Wednesday, but he they showed up on the Friday before - SUPER fast.  And again, the shelves themselves are great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jessica Orlando",
          "Nb_Reviews": 1,
          "Date": "2020-10-16T18:32:51.000Z",
          "Titre": "I ordered from your company and paid an…",
          "Contenu": "I ordered from your company and paid an enormous amount for overnight and the product didn't arrive until that following Tuesday. This is just unacceptable!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MJ",
          "Nb_Reviews": 1,
          "Date": "2020-02-24T13:24:09.000Z",
          "Titre": "Delivery process",
          "Contenu": "Living in a rural location I was disappointed to find my package dropped off next to my distant mailbox next to a busy rural road instead of being left by my house."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "I hate fedex",
          "Nb_Reviews": 1,
          "Date": "2018-11-08T04:22:53.000Z",
          "Titre": "On arrival",
          "Contenu": "On arrival, the box was falling apart. The spindle was damaged with splinters protruding. It doesn't roll anymore. The cable itself is undamaged at the very least."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Kerr",
          "Nb_Reviews": 1,
          "Date": "2018-07-13T00:37:50.000Z",
          "Titre": "No product accessory matching",
          "Contenu": "No product accessory matching. Shelving does not fit all cabinets, so each shelf or cabinet should include compatibility matrix so products aren’t ordered incorrectly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Guest",
          "Nb_Reviews": 1,
          "Date": "2018-12-25T18:22:33.000Z",
          "Titre": "The front door sags requiring you to…",
          "Contenu": "The front door sags requiring you to \"lift and push\" to properly close and lock it.  The assembly was straight forward and the directions were fine."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-16T18:41:47.000Z",
          "Titre": "Good sturdy frame",
          "Contenu": "Good sturdy frame. Powder coating quality is good.  Would give 5 stars if there would have been enough fasteners to mount all of the components."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chuck Maes",
          "Nb_Reviews": 2,
          "Date": "2019-02-21T04:06:42.000Z",
          "Titre": "One of the frames was not built right…",
          "Contenu": "One of the frames was not built right and would not fit.  Waiting to see how you correct it and how fast it is corrected. Otherwise quality units"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas Dudek",
          "Nb_Reviews": 2,
          "Date": "2021-09-02T20:46:36.000Z",
          "Titre": "Received damaged",
          "Contenu": "Received damaged 1 frame support bentNeeded to install that they cannot wait for a replacement.Box was undamaged."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "julius roussel",
          "Nb_Reviews": 1,
          "Date": "2020-06-01T19:22:45.000Z",
          "Titre": "Wire looks good but reel and box…",
          "Contenu": "Wire looks good but reel and box supports all are broken and can't feed wire out of box,Have to unroll wire to use."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Louis Hudson",
          "Nb_Reviews": 1,
          "Date": "2020-05-06T19:17:27.000Z",
          "Titre": "Not Your Fault Fed Ex Sucks",
          "Contenu": "My issues are not your fault.But, Fed Ex SUCKS!!  I am still waiting for a rack that should have been here 3 days ago."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Boatman",
          "Nb_Reviews": 1,
          "Date": "2020-06-24T19:36:52.000Z",
          "Titre": "No problem with navepoint",
          "Contenu": "No problem with navepoint, my problem lies with usps...they are slow, very slow....start shipping with ups/fedex"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rbrownpa",
          "Nb_Reviews": 1,
          "Date": "2019-01-23T12:24:54.000Z",
          "Titre": "I hesitated to purchase my NavePoint…",
          "Contenu": "I hesitated to purchase my NavePoint 22U enclosed rack based on some harsh reviews I read online. Packing arrived damaged, metal is bent or will not align, and poor set up instructions were the most troubling. The alternative was something double, or more, in price with not great reviews. I ordered the product. All of the issues in the reviews are accurate. The package was damaged, but not terribly. The parts inside were protected well, so I don't think they were damaged in transit. The instructions were for a much smaller unit and did not have instructions for all of the parts included on my unit. It wasn't enough of a problem to keep me from getting it assembled. There were bent and scratched parts and the door will not stay closed without being latched. All of these issues are preventable with a little more quality control before shipping. One design feature change I would like to see is a removable back panel similar to the side panels. Overall, the online reviews are correct, but not necessarily bad enough to make it a bad purchase. If you can work with the issues, buy it. If you want perfection pass."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Woods",
          "Nb_Reviews": 1,
          "Date": "2019-01-28T13:48:11.000Z",
          "Titre": "Good product and delivery",
          "Contenu": "Good product and delivery. No directions and screws sent were useless without cage nuts needed to secure shelves."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-12-13T04:52:26.000Z",
          "Titre": "My order never arrived",
          "Contenu": "My order never arrived. However, customer service was fairly prompt and offered me a full refund."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jose",
          "Nb_Reviews": 8,
          "Date": "2021-11-16T17:13:53.000Z",
          "Titre": "The cabinet is okay but it could be…",
          "Contenu": "The cabinet is okay but it could be made stronger with thicker walls and better locks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jose Jimenez",
          "Nb_Reviews": 3,
          "Date": "2020-05-20T01:07:59.000Z",
          "Titre": "They need improvements in CAT 6 is very…",
          "Contenu": "They need improvements in CAT 6 is very weak the cable breaks very easy when making the patch"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Keilan Williams",
          "Nb_Reviews": 4,
          "Date": "2021-06-14T17:42:49.000Z",
          "Titre": "It didn't come with all of the parts or…",
          "Contenu": "It didn't come with all of the parts or an instruction manual or paper."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "asdf",
          "Nb_Reviews": 1,
          "Date": "2020-06-05T20:03:21.000Z",
          "Titre": "the screws didnt fit",
          "Contenu": "the screws didnt fit, literally had to peel away metal to screw them in"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marvin Boaaz",
          "Nb_Reviews": 1,
          "Date": "2018-11-06T22:40:21.000Z",
          "Titre": "poor instructions",
          "Contenu": "poor instructionsgood product when finally assembled"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Harold Allen",
          "Nb_Reviews": 7,
          "Date": "2020-07-07T00:18:14.000Z",
          "Titre": "Cable has to much twisted memory and is…",
          "Contenu": "Cable has to much twisted memory and is had to pull"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Reggie Saghafi",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T18:16:36.000Z",
          "Titre": "on this delivery we were short one item!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "G D",
          "Nb_Reviews": 1,
          "Date": "2020-11-10T13:53:55.000Z",
          "Titre": "they didn't stick as well as I expected"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Me",
          "Nb_Reviews": 1,
          "Date": "2017-11-12T01:07:26.000Z",
          "Titre": "Product good",
          "Contenu": "Product good, shipping horrible"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Len",
          "Nb_Reviews": 1,
          "Date": "2018-07-18T17:48:24.000Z",
          "Titre": "Site states free shipping - but be advised",
          "Contenu": "Update: 7/18/2018I have yet to receive a follow up from Navepoint as to why my package was shipped via Fedex home service - when being delivered to a work (non residential) address. Their customer service rep said she would get back to me and has yet to do so as of this update. Update: 6/28/2018I was contacted my NavePoint Customer Service. They expressed  that they intend to investigate this matter. I still don't have an answer as to why my parcel was sent using FedEx Ground to Home service - which effectively took my parcel hostage from me. I remain hesitant to order any new racks from the NavePoint site until I know what happened to my parcel and what their new shipping process and timeline is to resolve this matter moving forward. NavePoint is going to send me some additional rack screws (thanks NavePoint - I do appreciate that). In response to my question as to why they don't provide that many screws. 1. The rack I ordered was a starter kit and comes with minimal screws. To that I said, the rack should include enough screws to accommodate mounting 6 (six) 1U items. The CS rep said she will pass that comment onto the product team. 2. They assume that network equipment providers provide their own mounting screws in the box with their equipment. I advised the CS rep that there are at least 2 different U.S. and 2 different Metric thread size standards. Assuming that the mounting screws provided by the network equipment manufacturer will fit the NavePoint rack is an incorrect assumption. The CS rep said she will pass that comment onto the product team.  I will provide updates to this review as they become available. I am updating the rating based on their effort to call me and express interest in correcting the matter. +++++++Original ReviewSite states free shipping - however - doesn't declare the shipping method used. In my case, Navepoint chose to use FedEx ground to home delivery - which only delivers Tuesday through Saturday. My parcel was scheduled for delivery on Saturday to my company, which is closed on Saturday. When I contacted FedEx to have the package re-routed, I was told there was nothing they could do (I could not have the package routed to a FedEx facility, FedEx retail location, scheduled for a Monday pickup at a FedEx location). It was hostage to FedEx.  To make matters worse, they said it would not be delivered on Monday either - as the \"shipper\" used a home delivery (Tuesday through Saturday) shipping method. I ordered this with plenty of time to be delivered to the SF bay area without falling into the day of the week trap. I needed this rack for a network install. I'm disappointed with both Navepoint and FedEx for having put me into this experience. One small win however. The parcel was unexpectedly delivered to me on Monday (even though FedEx emphatically told me it wasn't going to be delivered to me). This enabled me to complete my network install the following Tuesday AM. I would have to think long and hard before I order anything from Navepoint again. There are other options.- I may consider paying extra for proper shipping on/from Navepoint site- I can purchase the item(s) through Amazon (which costs more, but comes with Prime shipping. - Alternatively, I can order products from either Monoprice or PI Manufacturing - both of which have reliable shipping processes.   The FedEx home delivery shipping method is the worst - ever. They just don't care.Other items of noticeable concern. Navepoint only provides like12 screws for their 6U rack. That's only enough to mount 3 (three) 1U items. How about a few more screws folks, they're like .002 cents each. I have come across machining issues with the threads on some of their racks. I've mentioned this to them before. Never heard anything back. Nothing like being out in the field only to find that some of the screw-holes are not properly threaded.I'm giving this review 2-stars as I realize the issues with FedEx are not entirely Navepoints problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jeffery byard",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T17:22:35.000Z",
          "Titre": "Door and cabinet damage",
          "Contenu": "Door and cabinet damage, definitely left factory like this, not do to shipper, box was undamaged, hopefully they will make it right and I will rewrite my experience! I understand sometimes things happen. Hopefully they will make it right.! After emailing and speaking with someone live from NavePoint , they did resolve some of my issues and sent me new parts and my complaints were handled, reasonably and quickly!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T16:12:49.000Z",
          "Titre": "Easy selection/shopping experience",
          "Contenu": "I found the site very easy to navigate, and the pictures/descriptions of the items helped me shop confidently. Keep adding more products to your line; I will return to your site to shop again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elizabeth  Jamison",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T21:25:11.000Z",
          "Titre": "Person/Representative actually answered…",
          "Contenu": "Person/Representative actually answered the phone versus a recording instructing to leave a message. Representative responded to questions happily and professionally. Would have given 4.5 stars; rarely give 5 stars. First time working with NavePoint."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "EMI Security",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T17:30:30.000Z",
          "Titre": "Experience was great",
          "Contenu": "Shipping was very prompt and we feel the cost of the unit was fair. We have not installed the case (was purchased for a clients installation), but we assume it will be simple- if not we will contact support."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Doe",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T10:01:43.000Z",
          "Titre": "A very nice well built rack",
          "Contenu": "A very nice well built rack  , but when buying shelves it does not state which selves will work with what rack , found it hard to get ahold of anyone to answer that question."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brent Cox",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T16:19:37.000Z",
          "Titre": "I don't give anyone 5 stars",
          "Contenu": "I don't give anyone 5 stars.  That said, I'll definitely order from this company again when the need arises. Fast, fast, fast shipping.  That was most excellent."
        },
        {
          "Note": 4,
          "Lieu": "DO",
          "Pseudo": "Bill Riley",
          "Nb_Reviews": 2,
          "Date": "2022-08-19T19:33:12.000Z",
          "Titre": "we really like your products and have…",
          "Contenu": "we really like your products and have made it a standard part of our solutions. The ordering process is easy and availability is great. The only challenge i have is the margins we have the ability to make without exceeding published price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bryan Bredl",
          "Nb_Reviews": 1,
          "Date": "2022-03-14T23:59:23.000Z",
          "Titre": "It was over a great product I wish it…",
          "Contenu": "It was over a great product I wish it had knock-outs on the top and bottom flaps with a gromit or an adjustable flap with a gromit for protection. Over all nice setup, easy install, if I need another I know where to get it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lewonda Maiden",
          "Nb_Reviews": 2,
          "Date": "2022-07-07T20:41:28.000Z",
          "Titre": "The product arrived quickly and was…",
          "Contenu": "The product arrived quickly and was easy to install.  The only reason I have a 4 rather than a 5 is that it doesn't allow for enough room under monitors, even when you place the monitors at the highest point."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T20:10:36.000Z",
          "Titre": "Tax Exempt Status",
          "Contenu": "Often companies have a convoluted process for getting a tax exempt status.  Navepoint made this process easy and painless."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "tyler",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T17:55:36.000Z",
          "Titre": "Decent starter rack I just didn’t…",
          "Contenu": "Decent starter rack I just didn’t realize that it has pre threaded holes and not square holes for rack nuts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Corey",
          "Nb_Reviews": 1,
          "Date": "2022-04-30T17:46:47.000Z",
          "Titre": "Great Product, minor shipping damage on 2 different deliveries...",
          "Contenu": "Your product is great and have bought 2 of your drawers recently... both are what I needed however the 2 drawers, ordered 2 weeks apart both came with a bent corner.  Was easily repaired but should not have been needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Strickland",
          "Nb_Reviews": 2,
          "Date": "2022-12-11T18:02:25.000Z",
          "Titre": "Great wire",
          "Contenu": "Great wire, good price, quick shipping, only issue is the cardboard used for the wire boxes seem to be single use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Swain",
          "Nb_Reviews": 5,
          "Date": "2023-06-18T18:10:30.000Z",
          "Titre": "Fast shipping of what I ordered.",
          "Contenu": "Found just what I needed to expand my rack.  Included the needed hardware, and was shipped that day and I received it the next day."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenneth Brown",
          "Nb_Reviews": 3,
          "Date": "2023-08-11T17:10:56.000Z",
          "Titre": "Always easy to order",
          "Contenu": "Always easy to order, and delivered fast!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tommy Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T01:43:54.000Z",
          "Titre": "My orders are always shipped promptly…",
          "Contenu": "6/24/2023My orders are always shipped promptly and I receive my items very quickly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bass Enterprises",
          "Nb_Reviews": 2,
          "Date": "2022-04-13T01:45:35.000Z",
          "Titre": "I received a good product with fair…",
          "Contenu": "I received a good product with fair price. This product sound have come with enough hardware to use the product. If you can’t mount all of your amps it won’t do any good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Arthur Jenni",
          "Nb_Reviews": 2,
          "Date": "2022-03-10T14:50:39.000Z",
          "Titre": "It would be nice if your company would…",
          "Contenu": "It would be nice if your company would have a dealer program."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LEWIS BLACKBURN",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T13:08:03.000Z",
          "Titre": "server cabinet 22 u",
          "Contenu": "quality product just a little difficult to assemble"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lloyd Storr",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T17:25:41.000Z",
          "Titre": "Exactly as advertised and at a great…",
          "Contenu": "Exactly as advertised and at a great price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lyle Smitson",
          "Nb_Reviews": 2,
          "Date": "2022-04-17T15:56:10.000Z",
          "Titre": "Phone support wasn’t answered but chat…",
          "Contenu": "Phone support wasn’t answered but chat support was spot on"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tomasz Wiszkowski",
          "Nb_Reviews": 3,
          "Date": "2021-10-31T23:26:00.000Z",
          "Titre": "Great store but impossible to create customer account",
          "Contenu": "I started doing shopping with NavePoint thanks to broad selection of items that fit very specific needs that i have. I love the service, shipping time, prices, responsiveness.The only problem i have is that there is no way to set up an account with them. Literally every generated (and not) password i tried is rejected, even though it meets the criteria. Oh well.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David LeClair",
          "Nb_Reviews": 5,
          "Date": "2021-10-07T14:54:47.000Z",
          "Titre": "2nd order from NavePoint, but a different size",
          "Contenu": "Ordered a different size of cabinet and Patrick in sales was very helpful. The shelf for the cabinet is sold separately and was only available from their CA location. For a minimal charge, Patrick ensured that the shelf was delivered in a timely fashion...which it was.Cabinet was received on time and was packaged better than our initial order a month earlier.Overall, well satisfied, will be re-ordering soon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chandrasekaran Iyer",
          "Nb_Reviews": 1,
          "Date": "2021-08-08T14:44:55.000Z",
          "Titre": "Pros and Cons",
          "Contenu": "Pros:I am happy with the product. I ordered 22 U where I can keep two receivers power conditioner and laptop. It works. Cons1. It will not come with the rack. So please reach out cistomer support to order appropriate rack.2.Little bit damage in the front door. If the damage is not there then I would have given t star.3. Exhaust fan is bit louder If they can replace the door it would be appreciated"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "EMILIO P",
          "Nb_Reviews": 1,
          "Date": "2022-02-09T20:49:16.000Z",
          "Titre": "The rack shelves I order are great and…",
          "Contenu": "The rack shelves I order are great and sturdy looking and arrived quickly. My only complaint was the rack screws that came with it are massive and do not fit in my rack case so I have to go out and buy different ones. Other than that, I’m a repeat customer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Webb",
          "Nb_Reviews": 1,
          "Date": "2021-06-19T21:23:46.000Z",
          "Titre": "Arrived Damaged - Fixed Myself",
          "Contenu": "Purchase was easy enough though I had to search their site for rack rails in order to find them. These were needed to secure the rear of the shelf. Delivery was fast. The shelf, however, arrived with a bent right front ear which I easily fixed with a pair of pliars. And the rack rails did not include screws to affix them to my wooden rack unit. Also, if you’re a musician, your rack uses a smaller screw size than those included with either product. Fortunately, I had them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jerrod rowcliffe",
          "Nb_Reviews": 1,
          "Date": "2021-06-21T16:37:19.000Z",
          "Titre": "Good Rack System",
          "Contenu": "Assembly: Easy, Everything fit well good instructionsFunction: No removable back panel punch-out I have to cut a hole in the back for power outlet.Everything fit in perfectlyThe hanging System was week for the weight this box is built to hold. I re-enforced it and use lag bolt to the structure."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Tyler",
          "Nb_Reviews": 2,
          "Date": "2021-06-05T14:13:35.000Z",
          "Titre": "Dose not have enough mounting bolts",
          "Contenu": "Dose not have enough mounting bolts. The bolts you supplied was only enough for 2and a1/2 boards. The advertisement say up to 8. So where are the bolts? Not a real big deal if you have a part store with the bolts, but there probably not going to be black so get a can of black spray paint to."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Murphy",
          "Nb_Reviews": 1,
          "Date": "2019-02-05T19:35:36.000Z",
          "Titre": "Great products, price, and delivery, but strange design",
          "Contenu": "Products arrived in great condition with no issues. Products were affordable and great quality. One of the racks I ordered is meant to be wall-mounted but the mounting points are 18\" apart. A typical American house has studs that are 16\" or 24\" apart, so it's strange that they chose 18\". Basically it requires the rack to either be mounted to a backboard, or to the studs at the top."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bobby C",
          "Nb_Reviews": 1,
          "Date": "2021-07-23T21:44:48.000Z",
          "Titre": "My 6U Rack Mounted Drawer arrived with…",
          "Contenu": "My 6U Rack Mounted Drawer arrived with the corners of the rack ears bent out a little bit, but nothing I couldn't fix with a wrench and a little gaff tape (to protect the rack ears from the wrench). Bent back to form easily enough and racked up beautifully."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan E Dalrymple",
          "Nb_Reviews": 1,
          "Date": "2019-08-09T16:32:37.000Z",
          "Titre": "Slide tracks are a little stiff",
          "Contenu": "The size of the shelf was perfect for what we needed. I was able to adjust it to fit my rack, and the tray size was just the size needed to support a USB turntable for my wife’s AV rack in her offic at work.  The only thing keeping it from five stars, is that the slide tracks are very stiff and it takes a lot of effort to slide the tray out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 2,
          "Date": "2018-09-22T19:19:38.000Z",
          "Titre": "Good product fast shipping...",
          "Contenu": "I am very pleased with the construction of the unit however packaging for shipment was somewhat  lacking for commercial shipping. The box arrived and it showed the rough handling by the carrier. As such one of the rack mount ears was bent away and needed to be bent back into place. Lucky for me it didn’t break off.  That said I am very happy with the product. It should last for years."
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Johannes B.",
          "Nb_Reviews": 3,
          "Date": "2020-08-25T13:27:32.000Z",
          "Titre": "Fast delivery, good value.",
          "Contenu": "Fast delivery, good value.The only thing I'm missing is being able to get a version of the cabinet without the super loud 120V fans - I replaced them with different fans that were about 20dB less noisy, and now I have some fans lying around that I won't need.Would definitely order again!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Krzysztof Karasewicz",
          "Nb_Reviews": 2,
          "Date": "2018-11-15T16:40:58.000Z",
          "Titre": "9U Consumer Series Wallmount Network Cabinet",
          "Contenu": "I bought consumer series wallmount network cabinet 9U for a $70 it is no brainer. Quaility to price is great. Only issue what I have with it was bottom and top pieces was little bend on a sides but nothing to worry about I fixed it with a hand. Next thing is that the door are not parallel to the cabinet it's little offset, but I can live with that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barney Ireland",
          "Nb_Reviews": 1,
          "Date": "2018-06-23T00:41:51.000Z",
          "Titre": "NavePoint 18U network enclosure",
          "Contenu": "Assembly instructions could have been clearer. Images were too small to make out the detail to avoid making mistakes with ambiguous orientation of pieces. Someone should observe a novice assembling this enclosure to  improve documentation. I made several errors that were not apparent until late, requiring significant disassembly and some frustration. Once complete, the enclosure is fantastic and is exactly what I wanted it to be."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ABD",
          "Nb_Reviews": 1,
          "Date": "2018-03-13T21:39:20.000Z",
          "Titre": "After purchasing through Amazon…",
          "Contenu": "The server rack was double boxed, which was good.  But when I pulled out the inside box there was one whole side of the inside box that was not taped.  Two of the columns for my server rack landed on asphalt and got scratched and dinged up.  I did receive the order fairly quickly.  And Navepoint contacted to me to address my review and issue.I would do business with them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J Mc",
          "Nb_Reviews": 1,
          "Date": "2020-12-29T13:16:33.000Z",
          "Titre": "NavePoint 12U 450mm Depth Wallmount…",
          "Contenu": "NavePoint 12U 450mm Depth Wallmount Networking Perforated Cabinet (Pro Series): Great cabinet, quick shipping, decent price. Negatives: quick shipping although never received tracking information. No instructions for grounding cabinet. My old cabinet had a built-in ground stud."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron Richer",
          "Nb_Reviews": 1,
          "Date": "2018-01-08T18:00:25.000Z",
          "Titre": "\"A\" rated service and product",
          "Contenu": "I recently purchased a tilt & swivel 2-arm wall mount for a new TV from NavePoint.  I was very pleased with the quality, and everything I needed was in the box.  They even shipped it FedEx at no extra charge. The only reason I didn't give them 5 stars, is that they didn't let me know that they had received my order and that they would be able to ship it the next day."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melissa Manos",
          "Nb_Reviews": 1,
          "Date": "2018-05-04T22:32:34.000Z",
          "Titre": "I needed expedited shipping for my…",
          "Contenu": "I needed expedited shipping for my order and was able to use my own Federal Express account to ship out overnight. I had my doubts as to whether this would actually happen but to my surprise and relief, I received the order next day. The customer service rep I worked with was very pleasant and helpful.  Have you considered changing your shipping policies?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan Joyce",
          "Nb_Reviews": 1,
          "Date": "2017-11-06T22:42:36.000Z",
          "Titre": "Very happy with the purchase process",
          "Contenu": "Very happy with the purchase process, the rep I spoke with, shipping, and quality of cabinet. The only item that should be better is the first page of the instructions. The written description was not great and the first few illustrations were very poor, so much so that I could not make out which way some of horizontal rails mounted. I recommend creating your own first few steps and illustrations, possibly with actual pictures if not illustrations."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nicholas T Ruffner",
          "Nb_Reviews": 1,
          "Date": "2017-03-14T19:08:10.000Z",
          "Titre": "Customer Service",
          "Contenu": "Received incorrect item. Multiple calls to customer service, no answer, transferred to voice mail. Left two voice messages and sent one email. No response. Third day call answered; issue resolved. As far as the item purchase, not yet received, no comment.Upon resolving issue correct Item shipped and received in three days. Item was as described and good quality."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ARMIN M",
          "Nb_Reviews": 1,
          "Date": "2019-07-10T16:20:30.000Z",
          "Titre": "Great rack drawer but the key doesn't really work.",
          "Contenu": "Navepoint has fantastic prices and speedy delivery as well as great customer service. However, the rack drawer I purchased has a very finicky key that works sometimes and I was also under the impression that the holes in the back of the drawer would be there from Navepoint. We had to punch the holes ourselves."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Corey Scobie",
          "Nb_Reviews": 1,
          "Date": "2018-03-04T22:36:35.000Z",
          "Titre": "Nave point 15 inch floor mount.",
          "Contenu": "The product is great but the assembly instructions are horrible!! I was 90% built following every written detail when I had to reverse course and completely dissassemble. Not good.*Follow-up: After posting this review I was contacted directly by the Navepoint team to see what they could do to help. I gave them my feedback and they assured me that assembly instructions were something they were already enhancing. Changing my review to 4 stars for the positive customer follow through."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gabriel Rivera",
          "Nb_Reviews": 2,
          "Date": "2018-12-05T21:58:15.000Z",
          "Titre": "Product and price is great",
          "Contenu": "Product and price is great. Assembly instructions could improve a little bit. Minor improvements to door hinge might help with front door aligment. Also, the door closing could be improve by adding a magnet to keep the door closed while is not locked. Overall, I am very satisfied with product and recommend it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BreezeSS",
          "Nb_Reviews": 1,
          "Date": "2018-05-02T03:02:00.000Z",
          "Titre": "Great product and customer service",
          "Contenu": "Great product and customer service! Solid rack & sturdy equipment rack. Shelves and drawers were perfect. The only reason I didn't give it 5 stars is because the instructions to build one of the rolling racks wasn't very good. I figured it out, but it just seems like it could have a been a little clearer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 3,
          "Date": "2020-06-19T16:01:44.000Z",
          "Titre": "15U Performance Series Rack",
          "Contenu": "Got the 15U Performance rack. A little damage in shipping, nothing i couldn't fix with a multitool. Putting the rack together was straight forward, instructions sparse but ok. I would have liked a little info on the ground connector in the rack. Im pleased with the rack."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George Martin",
          "Nb_Reviews": 1,
          "Date": "2018-01-03T18:29:40.000Z",
          "Titre": "I bought the Full-Motion Corner Wall …",
          "Contenu": "I bought the Full-Motion Corner Wall Mount Bracket and completed installation today. The Mount is GREAT!. The instructions are very poor -  absolutely NO information regarding how high to place the Mount above the floor. I made a drawing with measurements: 1) Desired height of bottom of TV from floor, 2) Height of Bracket Hooks from bottom of TV when Brackets are mounted on TV, 3) Distance from Bracket Hooks Mounting Bar to Wall Mounting Holes, 4) Calculate height from floor for Wall Mounting Holes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "carey bruce",
          "Nb_Reviews": 1,
          "Date": "2020-05-28T19:02:41.000Z",
          "Titre": "3u rack ears screws strip holes",
          "Contenu": "Five stars for service and rapid response to questions. If it was totally based on that 5 stars. The reason for the four star review is the 3c rack mount ears, every screw provided strips the hole. I know this should drop the review lower but they are on point with service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Colin",
          "Nb_Reviews": 1,
          "Date": "2019-07-18T18:24:30.000Z",
          "Titre": "Shipped fast, price was right, great build quality",
          "Contenu": "Shipped fast, price was right, great build quality. Unit dimensions were a bit confusing, smaller than I expected. I wish they provided distance between front and rear rails, as that was what I was expecting the depth measurement to be. Thankfully I was still able to fit everything in it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Edwards",
          "Nb_Reviews": 1,
          "Date": "2019-02-27T20:47:46.000Z",
          "Titre": "I bought the 4 post 42U and really like…",
          "Contenu": "I bought the 4 post 42U and really like it.   It is well built and complete with hardware.  I had no trouble building the rack but there could be more installation guidance about properly sizing the rack depth. The quality and value is excellent. The only item missing is a Keystone patch panel."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Duff",
          "Nb_Reviews": 1,
          "Date": "2016-10-25T04:08:37.000Z",
          "Titre": "Good product",
          "Contenu": "I have a smaller flat panel TV mount that works great but the larger articulating one did not work as well since I cannot tilt the TV flat; just faces in a downward tilt. Not bad but could be better... May have just gotten a defective unit but haven't contacted NavePoint. Overall, great price and fast delivery."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gooryoumboul",
          "Nb_Reviews": 1,
          "Date": "2016-10-18T01:28:17.000Z",
          "Titre": "greta product and fast shipping.",
          "Contenu": "it was my first time buying from the web site and things went pretty well. this is my fourth time buying the product and I'm satisfied with it. it's not hard to put together and looks really good on the wall. suggestion: I don't mind paying extra to have it ship already assemble. saves a lot of time"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Trey K.",
          "Nb_Reviews": 1,
          "Date": "2017-04-21T02:34:29.000Z",
          "Titre": "Very well built and competitively …",
          "Contenu": "Very well built and competitively priced cabinet. Package was received with some damage to the packaging as well was portions of the cabinet. Nothing so extreme that warranted waiting on a replacement.Shipment was received in a a timely manner. Overall very satisfied with my experience and will order again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Olson",
          "Nb_Reviews": 2,
          "Date": "2020-06-23T20:32:33.000Z",
          "Titre": "High quality equipment",
          "Contenu": "The equipment is professional looking and built well.  The only issues were: 1) provide a slip of paper with some rack install directions would have saved some time, 2) the shipping package was destroyed when it arrived with both ends completely ripped off and missing.  I called NavePoint immediately to give notice that something may be missing or damaged.  No one returned the calls.  Thankfully, nothing was missing and the bent rail repair was minor, 3) of the four shelves, one hole was drilled with the wrong diameter bit.  How that could be was beyond me.  I drilled it myself."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jay Campofiori",
          "Nb_Reviews": 5,
          "Date": "2017-04-11T02:16:45.000Z",
          "Titre": "Excellent product with very good …",
          "Contenu": "Excellent product with very good quality. This product was easy to install.The only issue I had were the mounting holes in the base were too big. I did not use the large lag bolts and anchors provided.Instead I drilled smaller holes to uss # 8 x 1-3/4 rock to rock screws and mounted to stud behind wall."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fidel",
          "Nb_Reviews": 6,
          "Date": "2021-10-20T16:43:40.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, I am very happy. Easy install and sturdy. I just got too few of the M6 cage nuts, I had to improvised using some stuff I found in home depot but I had to order a bag of them to have them handy next time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2017-09-02T23:20:31.000Z",
          "Titre": "Products are well made for the price …",
          "Contenu": "Products are well made for the price you are getting them for. Compared to other websites, these are VERY affordable options from what I've seen. I had a couple shelves come in with rails that popped off, but that's an extremely easy fix, but something to expect(I feel anyways) from this price range. None of my stuff came in damaged or dented, and the shipping was fast. If I have anything else I need to buy for my server rack I'll be keeping this company in mind. Affordable, good quality, and good customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Grucza",
          "Nb_Reviews": 1,
          "Date": "2021-12-27T22:35:46.000Z",
          "Titre": "Bought a 9U rack",
          "Contenu": "Bought a 9U rack. Overall quality is good, but the bolt holes didn't line up with the pre-installed nuts. I had to drill out two holes to get the rack together. Likely would have worked if I had clamps."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Parla",
          "Nb_Reviews": 1,
          "Date": "2017-01-03T17:16:36.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "Customer service was terrific. Helped me out to figured which item I needed and did not rush me through at all. Received item in two days and with free shipping. The only negative I have to say is the TV mount I purchased was pretty heavy. It weighed over twice as much as the television itself."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "william c",
          "Nb_Reviews": 3,
          "Date": "2019-09-04T15:29:50.000Z",
          "Titre": "Quality parts and easy navigation.",
          "Contenu": "This company has quality parts and displays them with an easy to browse web page.  Navigation is simple and easy. They have  been on time and the materials are as I have ordered.  This seems to be a no hassle company to purchase from. I will continue to buy from them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Home job",
          "Nb_Reviews": 1,
          "Date": "2020-09-12T20:05:11.000Z",
          "Titre": "Good deal for the price",
          "Contenu": "Prompt shipping and rack was a great deal for the price. Just wish it was a little more stiff under its own weight when hanging on the wall. I have to lift the front up a bit to get the side covers on since the openings tend to parralellogram a bit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Francis McNally",
          "Nb_Reviews": 1,
          "Date": "2017-08-05T17:01:50.000Z",
          "Titre": "Very well built, just mind the attachment packaging",
          "Contenu": "Physically, a very, very solid product. My only qualm was they didn't label the different kinds of nuts, bolts, and washers that came in the box. I'm sure I ended up mixing certain nuts that were meant for washer-&-bolt use, with other nuts that were meant to be used only to attach frame elements.I suggest keeping every one of those nut/bolt/washer packages in their wrapping until you have thoroughly read through the assembly instructions (which are very short anyway). This annoyance aside, the rack is an outstanding product!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 3,
          "Date": "2019-05-20T16:56:19.000Z",
          "Titre": "Hole configuration in hanger bar does not meet US wall stud spacing standards",
          "Contenu": "If the cabinet is to be hung on a wall, the cabinet hanger bar is not configured for US wall standards where wall studs are on 16 inch centers.Since I am building a new house, my builder will install additional wall studs to accommodate the holes in the hanger bar."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Donnelly",
          "Nb_Reviews": 2,
          "Date": "2017-09-20T17:30:52.000Z",
          "Titre": "Good company-1 Concern",
          "Contenu": "Excellent company - exceptional material.  Main concern:  Parts in the equipment enclosures are not identified enough - specifically, such that when order additional or replacement parts, there is a fair amount of guessing to is that the correct screw (size, length, etc), nut, etc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Morinishi",
          "Nb_Reviews": 1,
          "Date": "2017-06-27T16:49:39.000Z",
          "Titre": "purchased Cantilever Server Shelf",
          "Contenu": "purchased Cantilever Server ShelfIt is rated to hold 55 pounds, but the 14\" shelf is very weak and flimsy.The product was actually bent out of shape when it arrived. So was the 10\".NavePoint has offered for me to return them. I'm asking for a better, sturdier shelf."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "T. Hong",
          "Nb_Reviews": 3,
          "Date": "2018-02-06T12:05:19.000Z",
          "Titre": "Second order -- quality product, competitive pricing...",
          "Contenu": "This is the second time I've ordered from NavePoint.   Products are as I expected -- good quality and competitive pricing.   I would like to see NavePoint improve their order tracking: With my first order, I did not check out as a logged in user.   I did not receive a tracking number.   With my second order, I completed my transaction as a logged in user, received my tracking link to USPS, but the link didn't work.   I emailed NavePoint's Customer Service and they sent me another link.   At this point, I'm not sure if the problem lies with NavePoint or USPS."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MH",
          "Nb_Reviews": 1,
          "Date": "2020-09-29T23:06:16.000Z",
          "Titre": "Good quality/ Good price",
          "Contenu": "The item shipped quickly and came packaged nicely. One of the bars was damaged/ dented but not enough that I would complain. Overall I am satisfied with the 15u cabinet and if it wasn't dented it would have received a 5-star rating."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hank",
          "Nb_Reviews": 2,
          "Date": "2019-08-16T10:25:13.000Z",
          "Titre": "15u cabinet",
          "Contenu": "Very sturdy and quality product. Came with a couple of dings. Assembly instructions could have been either more specific or clearer illustration. Overall will buy again cause the end product look and perform great and doesn't take up alot of space."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "david bundy",
          "Nb_Reviews": 3,
          "Date": "2021-09-06T22:21:29.000Z",
          "Titre": "The rack came very quickly",
          "Contenu": "The rack came very quickly, was easy to assemble and is very sturdy.  My only complaint is that they still use styrofoam packing which is unnecessary and a menace to our environment.  To me, that is a big deal"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom R",
          "Nb_Reviews": 3,
          "Date": "2021-09-14T17:25:17.000Z",
          "Titre": "Wall Mount Rack review",
          "Contenu": "Great value for the money.  Website very navigatable, easy to order, fast shipping.  Only issue that can be improved upon is the packaging.  Almost half the racks we have ordered in the past have been dented."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Smith",
          "Nb_Reviews": 1,
          "Date": "2020-09-08T23:48:43.000Z",
          "Titre": "Every thing was great",
          "Contenu": "Every thing was great. The only issue was  the shipping. The box was damaged on the ends and the rack was bent just a little on the ends. I repaired the ends and it worked out fine. The shipping people should be careful when delivering"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peter Rockwell",
          "Nb_Reviews": 1,
          "Date": "2018-04-10T18:19:07.000Z",
          "Titre": "Excellent addition to my home theatre cabinet",
          "Contenu": "I use a Navepoint wall-mounted cabinet to contain my home theatre equipment. The sliding shelf was shipped promptly. It supports my newer, bigger AV receiver very well and greatly improves access to the rear connections. The only technical issue: The shelf tends to slide forward because of the inherent springiness of the cables/wires in the rear. This happens even though I have right-angle banana plugs terminating all speaker wiring and have generally organized the wiring pretty well. It would be good to have a magnetic catch to keep the drawer stationary when it's all the way in."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill from Cincy",
          "Nb_Reviews": 2,
          "Date": "2018-07-09T14:14:17.000Z",
          "Titre": "Need more than one shipping option on website",
          "Contenu": "I would give NavePoint a 5 based on overall experience, but only having one \"free\" delivery option on the website and taking a week to then deliver the equipment was not very helpful. Product is great, price is right, website is easy to use, but..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Doug",
          "Nb_Reviews": 2,
          "Date": "2016-10-13T13:03:24.000Z",
          "Titre": "Just what we were looking for",
          "Contenu": "Purchased a 22U to house AV equipment in a public building. Looks great, appears strong, removable side panels are great . Some sheet metal parts were slightly bent on corners from packing or handling, but they did not look bad or cause any problems. Great price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Prahl",
          "Nb_Reviews": 1,
          "Date": "2019-03-04T19:08:13.000Z",
          "Titre": "Consumer series 9U wall mount",
          "Contenu": "I bought the consumer series 9U wall mount cabinet and became somewhat frustrated with the assembly as the instructions and assembly diagrams were not complete (not all parts were identified in the part list).   Also, the unit itself appeared to be designed with very tight tolerances, which caused me lots of problems with the assembly.  NavePoint's customer service was exceptional and very patient with hearing me out and providing the clues I needed to get the job done.   I'd buy from them again (I think) but would hope that they make minor adjustments to the instructions and possibly the design tolerances."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Myles Capen",
          "Nb_Reviews": 2,
          "Date": "2018-02-28T23:36:20.000Z",
          "Titre": "Solid Cabinet",
          "Contenu": "Excellent cabinet. Easy to assemble and install. The documentation could be a bit better in the layout of the vertical rails. And there could be more options on the cable openings...specifically the covers..need more like a broom to slide cables through"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony Dillehay",
          "Nb_Reviews": 1,
          "Date": "2020-08-27T22:02:35.000Z",
          "Titre": "I just started using your products",
          "Contenu": "I just started using your products. So far it has been a great experience. Quick turnaround on orders. Sales team could be a little more educated on your products. But overall great thank you for being there for me and my team."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TM",
          "Nb_Reviews": 1,
          "Date": "2017-10-04T14:37:30.000Z",
          "Titre": "Cabinet is great looking.",
          "Contenu": "Cabinet is great looking.Very cost effective.Mounting is not as robust as expected.Full size switches tend to make the cabinet sag. Additional internal bracing or possible mounting change to accommodate.Could not find a recommended load wt in specs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nneka lyn",
          "Nb_Reviews": 1,
          "Date": "2018-06-05T19:45:44.000Z",
          "Titre": "Screws?",
          "Contenu": "Great products. Sent me screws that didnt fit. One got two different sizes (i guess to choose options), but my second one came with screws that didnt fit at all. Have to go to the store to buy more. Shipping was quick. Would buy from them again!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Will H",
          "Nb_Reviews": 1,
          "Date": "2021-10-15T23:27:17.000Z",
          "Titre": "Good….But….",
          "Contenu": "I am extremely impressed and satisfied with the level of engineering that is evident in the product and very pleased with the value (level of quality for the money).  I would have given it 5 stars had there been triangle braces from the top of the back to the front of the bottom.  We mounted the cabinet on the wall, and the front sags such that I had to push up on the front to snap in the side panel.  I will go to Lowe’s or Home Depot to purchase braces and hardware to fix the problem.  It’s unfortunate your engineering people didn’t figure out that when a box is hung on the wall without angle bracing the front is going to sag.  We have one PC, an APS battery back-up, and a 16-port switch inside—not more than 40 pounds.  If it were sitting on the floor, no problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeffrey Byler",
          "Nb_Reviews": 1,
          "Date": "2018-02-15T19:13:44.000Z",
          "Titre": "This survey comes a little too soon…",
          "Contenu": "This survey comes a little too soon because my order won't arrive for another day. So my opinion is not valid at this point. Now if the order arrives tomorrow and it is as described without damage, then I will say 5 stars are worthy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel McCabe",
          "Nb_Reviews": 1,
          "Date": "2021-01-03T16:48:06.000Z",
          "Titre": "No frills. Just right.",
          "Contenu": "No frills. Just a straight-forward shopping experience. Cabinet was purchased, shipped, and it arrived. Shipping was provided. Nothing extremely exceptional so no 5 stars, but also, no errors, so just perfect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roger Biringer",
          "Nb_Reviews": 1,
          "Date": "2019-12-22T18:45:13.000Z",
          "Titre": "Nice product",
          "Contenu": "Nice product.  Took a long time to assemble.  Should note to customers that short shelves that come with the package are not compatible with standard shelving.  I had to order new shelving to match the shelving that I had."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 1,
          "Date": "2018-12-21T01:27:57.000Z",
          "Titre": "22U 1000mm Open Frame Rack",
          "Contenu": "I recently purchased and received my 22U 1000mm 22U Open Frame Rack. The build quality and finish is fantastic, I foresee this rack lasting a very long time. The packaging for the server rack left a lot to be desired however. When I received the package one end of the box was broken open and rails were essentially hanging out of the bottom. I opened it up to find that there was no manual, no casters, no cage nuts, nor any M6 nuts or bolts to assemble it. I called support and they quickly sent out a complete package of hardware at no cost to me and I had it within two days. Overall I'm satisfied with my purchase and would recommend NavePoint to others."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Guest",
          "Nb_Reviews": 3,
          "Date": "2019-04-02T21:33:43.000Z",
          "Titre": "Most of the equipment purchased seems…",
          "Contenu": "Most of the equipment purchased seems solid, however a couple of the plastic racks are not as sturdy as I'd hoped.  Sadly, the cost of shipping for returning some of the products is close to what I'd get on the return."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-11T13:37:29.000Z",
          "Titre": "Didn’t receive a confirmation email - sent fast tho",
          "Contenu": "Didn’t receive a confirmation email, which unnerved me, so I had to email them. However, the speed the item came in was incredible, and by the time they sent me the tracking info, the item was at my house!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hank",
          "Nb_Reviews": 2,
          "Date": "2020-05-07T12:01:07.000Z",
          "Titre": "18u Performance Cabinet",
          "Contenu": "Besides the little dents and dings probably from shipping the cabinet it self is great and easy to assemble. Quality is sturdy and the functionality and appearance is spot on. Would definitely recommend to anyone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Everyday SysAdmin",
          "Nb_Reviews": 1,
          "Date": "2020-06-02T21:27:44.000Z",
          "Titre": "Almost there...just need more precision.",
          "Contenu": "The holes on the back of the cabinet are not 16\" on center so they cannot be drilled directly into the studs in the wall, other than that the build quality is pretty good on the 6U rack and vented trays."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kyle",
          "Nb_Reviews": 1,
          "Date": "2018-06-04T16:15:02.000Z",
          "Titre": "damage in shipping, poor instructions",
          "Contenu": "Like many others, some pieces were damaged in shipping and had to be bent for things to go back together, and the instructions are very poor. Good enough to get it put together and seems like it will serve my purposes well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ricardo Sarabia",
          "Nb_Reviews": 1,
          "Date": "2018-07-09T19:51:57.000Z",
          "Titre": "The rack was pretty easy to order and…",
          "Contenu": "The rack was pretty easy to order and arrived on time. The rack looks good, I need to install the equipment to find out how is going to handle the weight. A few more screws and cage nuts would've been nice. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Byron Sutherland",
          "Nb_Reviews": 1,
          "Date": "2020-10-15T00:21:00.000Z",
          "Titre": "Product is as advertised",
          "Contenu": "The rack was as advertised only problem was ther was not enough cage nuts. The quantity of  screws were ok. Thats my reason for only 4 stars. I would definitely order other components from this company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2018-02-09T23:01:47.000Z",
          "Titre": "The product that was sent was not as …",
          "Contenu": "They really turn things around from a bad first experience. After I got the delivery of a product that wasn't what I expected, their customer service team reached out and very politely and very quickly fixed everything."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Farrow",
          "Nb_Reviews": 2,
          "Date": "2020-08-11T19:39:17.000Z",
          "Titre": "Products are greatgreat product minor headache",
          "Contenu": "Products are great. The only issue I had was when trying to install the cable management plate I recieved it can with two packages of screws. Not nuts. So I’m waiting for the screws to finish my product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2017-03-21T00:10:55.000Z",
          "Titre": "Great product...assembly, not so much.",
          "Contenu": "The product itself is great. The only thing that keeps it from getting five stars was that the screws on the roller track were all loose and one was stripped out. Whomever assembled this unit probably needs more training."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KilybOx",
          "Nb_Reviews": 2,
          "Date": "2017-04-19T07:38:19.000Z",
          "Titre": "Great price on cat6..I knew what I was …",
          "Contenu": "Great price on cat6..I knew what I was getting but CCA should always have a warning about heat and or outdoor install suggested...The \"pull\" box leaves room for improvement...BUT again the price CANNOT be beat."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "wilmot dennis",
          "Nb_Reviews": 1,
          "Date": "2020-11-12T18:38:41.000Z",
          "Titre": "Thanks for the prompt service and…",
          "Contenu": "Thanks for the prompt service and shipment of our order.Sorry for the delay of our survey. We installed the product and wanted to observe the reliability of the product. Thank you again. Wilmot"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Schiada",
          "Nb_Reviews": 1,
          "Date": "2019-09-15T17:38:11.000Z",
          "Titre": "Shipping and delivery was excellent but…",
          "Contenu": "Shipping and delivery was excellent but some of the instructions to put together the rack were unclear.  The hinge on the door also didn’t fit properly without sliding a small spacer underneath the spring loaded bar so it didn’t hit the top of the cage.  Additionally, the included rack had to be jammed into place and there were no instructions for installation.  Fans are also pretty noisy, but this is to be expected to keep everything cool.  It would be nice to offer an option for quieter fans or to be able to change the fan speed, but as far as convenience, these do the job well.  I’ll probably be swapping out the fans for quieter ones but other than a few nit picky items, the quality of the product is top notch!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Backes",
          "Nb_Reviews": 1,
          "Date": "2018-10-19T13:30:13.000Z",
          "Titre": "Case Fan Packaging",
          "Contenu": "Hello,Only problem was the package delivery.  Our case fan was delivered in a US post office envelope; was torn, had been taped up.  May want to look at packaging your shipments with more protection.Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven  Seiden",
          "Nb_Reviews": 1,
          "Date": "2019-09-26T17:41:04.000Z",
          "Titre": "The door on the rack did not close…",
          "Contenu": "The door on the rack did not close correctly. We had to make some adjustments with washers in order for the door to close without hitting the bottom of the rack. Was a bit surprise to encounter this issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2018-11-05T02:29:24.000Z",
          "Titre": "Nice cabinet",
          "Contenu": "Really like the cabinet. Although it is bigger than I thought it would be. Happy once it was together but wish the instructions were better. Would love to see a YouTube on the step by step putting it together."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nivola Systems",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T16:26:48.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "I made an error with my first order and had to send back the rack upon arrival. The customer service team called me and after explaining the issue, they refunded the money and didn't even charge for shipping. NavePoint is going to be my primary source from now on !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kult Sayaves",
          "Nb_Reviews": 5,
          "Date": "2023-12-16T16:23:39.000Z",
          "Titre": "Reliable Patrick.",
          "Contenu": "Patrick is always great ! Buying something from Navepoint is always a pleasant experience.  Always have what I need, and delivery is always timely."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "anthony amos",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T20:32:05.000Z",
          "Titre": "The shipping was great",
          "Contenu": "The shipping was great, product came the next day. Also excellent quality of the product and the price was very reasonable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken H",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T04:48:37.000Z",
          "Titre": "Great astatic addition!",
          "Contenu": "The inserts were so easy to install and they add class to the interior."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Pesta",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T20:58:03.000Z",
          "Titre": "Very satisfied.",
          "Contenu": "Easy ordering, blindingly fast delivery and an overall great product when it arrived."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chad Nelson",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T06:16:23.000Z",
          "Titre": "Very impressed. Satisfied customer, excellent product!",
          "Contenu": "I bought a U22 43 inch tall 23 inch deep rack cabinet for some amateur radio equipment. Very impressed with the kindness, professionalism and caring. The customer service agent showed during my order process. The rack purchased is second to none and I’m very impressed with the high-quality construction and thought that went into the cabinet. I would definitely buy other products from this company. Highly recommend products from this company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott H.",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T15:51:30.000Z",
          "Titre": "Friendly and responsive",
          "Contenu": "Friendly and responsive. Do what they say they will do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kult Sayaves",
          "Nb_Reviews": 5,
          "Date": "2023-11-10T11:32:17.000Z",
          "Titre": "Patrick Quinn",
          "Contenu": "I was not put on hold, Patrick Quinn was very polite, friendly, and professional. He also reminded me if I needed anything else and of course I forgot the little things. That's why I placed another order 5 minutes later. A very pleasant experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T21:20:44.000Z",
          "Titre": "I easily got what was needed!  My order was fine.",
          "Contenu": "I easily got what was needed!There was a minor issue after my purchase and working with the staff to resolve the problem was a breeze.NavePoint lived up to all their promises.  I got a quality product, when promised, and great customer support before and after the sale.I purchased an enclosed rack with locks for physical security to meet the requirements of our company's security team's standards.I intend to purchase more from NavePoint in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Kellerman",
          "Nb_Reviews": 5,
          "Date": "2023-10-30T15:28:34.000Z",
          "Titre": "Great products, great prices!",
          "Contenu": "NavePoint has great products at exceptional prices.  The only real issue is the shipping.  They ship the cabinets in the boxes they come in, not shipping boxes and the units are sometimes in pretty rough shape.  I have no other issues with anything else at NavePoint.  The people are great as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "lawrence cardenas",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T11:43:12.000Z",
          "Titre": "Item arrived quickly",
          "Contenu": "Item arrived quickly.  Quality of the product was superb..made my install job easy.  Highly recommended vendor."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kult Sayaves",
          "Nb_Reviews": 5,
          "Date": "2023-11-10T11:35:45.000Z",
          "Titre": "Tina Fahlsing",
          "Contenu": "Tina Fahlsing was very polite and professional. I always prefer to speak to a live person and Navepoint never let's me down. A very pleasant experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Azdeano",
          "Nb_Reviews": 3,
          "Date": "2023-10-18T12:44:56.000Z",
          "Titre": "Great Place for Audio Cable!",
          "Contenu": "I needed some audio cable to install in-wall and in-ceiling speakers for my surround system.  NavePoint had exactly what I needed and got it to me very quickly.   Once I got the product I was even happier as it is a great quality cable!   I would buy again from NavePoint."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Will Melick",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T15:33:45.000Z",
          "Titre": "Consumer 6U cabinet is excellent.",
          "Contenu": "The Consumer Series 6U cabinet arrived in great shape and very quickly.  Assembly was easy (a very minor bug - the large washer for the front door lock assembly was slightly too large to fit against the frame of the glass panel.  Grinding down one side of the washer fixed the issue).  Tracking information from NavePoint mistakenly linked to USPS rather than FedEx - no big deal."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marlin Corson",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T23:42:05.000Z",
          "Titre": "Very quick and easy to order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodney Gray",
          "Nb_Reviews": 7,
          "Date": "2023-07-28T02:20:34.000Z",
          "Titre": "Navepoint, my online source for racks & cabinets",
          "Contenu": "Navepoint has always had a easy to use, web interface with very detailed descriptions of the products. The pricing is on par with industry averages for the quality that you purchase. They haven't steered my wrong yet."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heath Riewe",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T21:54:02.000Z",
          "Titre": "The networking rack was exactly what I…",
          "Contenu": "The networking rack was exactly what I needed to clean up my networking gear.  It was easy to set up.  The unit was a little out of square, having a bit of a problem with the top not laying flat on the rack, but not a real problem.  Otherwise thrilled with the build quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Kellerman",
          "Nb_Reviews": 5,
          "Date": "2023-10-03T03:12:51.000Z",
          "Titre": "There was a problem with the order",
          "Contenu": "There was a problem with the order, but NavePoint was very quick to rectify the problem.  Great customer service.  I will continue to use this company for my low voltage needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BobP",
          "Nb_Reviews": 6,
          "Date": "2023-02-02T20:58:16.000Z",
          "Titre": "Ingenious hinged rack created sanity from chaos!",
          "Contenu": "We had an almost inaccessible tangle of cables servicing components for our custom home electronic organ.  They were in a tight space under a counter.  The NavePoint 6U hinged rack fit perfectly and allowed full access to all the components.  It created sanity out of chaos!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ricky Hill",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T14:30:35.000Z",
          "Titre": "Reliable Products",
          "Contenu": "I have a unique network cabinet.  It only allows certain size equipment to be placed inside. Because of this, I have been extremely reliant on NavePoint for my shelving. You always have what I need to make my projects work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dante",
          "Nb_Reviews": 5,
          "Date": "2023-05-21T08:31:13.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "I wasn't sure what type of shelf I needed and called at 15 minutes before closing. The customer service person went out of their way to get me the answer I needed from two different departments at the same time. Needless to say, I got exactly what I needed!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pamela Santana",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T18:56:56.000Z",
          "Titre": "Exemplary Customer Service",
          "Contenu": "They worked through an issue with us that took some time to figure out.  In the end, it was our mistake, but they were patient and extremely helpful through the entire process.  I really appreciated their customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcus Baines",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T18:21:47.000Z",
          "Titre": "The rack was exactly what I needed and…",
          "Contenu": "The rack was exactly what I needed and arrived on time.  One rail was bent, but that appears to have been caused by shipping as the box was banged up pretty bad when it arrived.  Nothing that pliers couldn't fix."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony M",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T16:10:28.000Z",
          "Titre": "Needed a small wall mount rack and…",
          "Contenu": "Needed a small wall mount rack and found pleanty of options available.  Website well constructed and informative.  Overall easy experience, then way it should be.  Shipped in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kult Sayaves",
          "Nb_Reviews": 5,
          "Date": "2023-08-23T19:59:08.000Z",
          "Titre": "This is at least the second time I have…",
          "Contenu": "This is at least the second time I have had the pleasure of dealing with the same sales representative. She is always fantastic.  Spoke clearly, very patient and polite."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T02:57:54.000Z",
          "Titre": "Great customer service",
          "Contenu": "Was purchasing a server rack for home use and had some questions. Very helpful customer service team. Also great response time on the phone - no being hold at all"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Y",
          "Nb_Reviews": 3,
          "Date": "2023-01-06T17:58:09.000Z",
          "Titre": "Surprisingly fast",
          "Contenu": "This was my first order directly through NavePoint. I placed my order on a Wednesday for a variety of items I needed for a job. I expected a week to 10 days for delivery, especially since we were in the holiday delivery season. Instead, everything was on my doorstep in two days. Having everything arrive so quickly I was able to prep some of the work I needed to do prior to going to the job site. Everything I ordered was packaged well and seems to be of quality construction. Fortunately I am familiar with Krone type connectors and had the proper tool for the patch panels. Make sure if you need patch panels to verify the connector type. Krone and 110 are sufficiently different from one another that the proper tool matters."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Whit_Reeve",
          "Nb_Reviews": 5,
          "Date": "2023-10-19T01:40:01.000Z",
          "Titre": "I've placed many orders over the years…",
          "Contenu": "I've placed many orders over the years and all of them have been shipped quickly and accurately. I especially like to free shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 2,
          "Date": "2023-09-25T17:00:17.000Z",
          "Titre": "I have ordered from NavePoint a few…",
          "Contenu": "I have ordered from NavePoint a few times. I am always surprised at the speed of delivery. The directions are easy to follow and the quality is unmatched."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T18:36:09.000Z",
          "Titre": "I called in for pricing",
          "Contenu": "I called in for pricing, and Patrick was exceptionally helpful. He explained everything perfectly and had a quote over to me in minutes. Great overall experience and good pricing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J. Cutler",
          "Nb_Reviews": 1,
          "Date": "2022-12-18T20:22:25.000Z",
          "Titre": "Very solidly built.",
          "Contenu": "I am very happy with my purchase. Heavy-duty construction and generally simple assembly. Though some parts may be easier with a second pair of hands, everything can be put together by one person."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodney Gray",
          "Nb_Reviews": 7,
          "Date": "2022-10-14T21:14:12.000Z",
          "Titre": "Navepoint has always been a great…",
          "Contenu": "Navepoint has always been a great source for cabinets and cabling for me for the last 7 years. They have great products with really competitive pricing. They are my goto source for cables, cable management, cabinets, racks, and cable accessories. I started using them when I was not able to find items locally and history was made. Give them a try"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick+Batley",
          "Nb_Reviews": 2,
          "Date": "2023-02-06T04:03:49.000Z",
          "Titre": "Quality Product",
          "Contenu": "Easy to order, great quality. This is my second order and both have been great experiences. The product is nicely finished, including all the tapped holes actually being cleaned out (saves the time I’ve taken in the past running through every hole with a tap). May be slightly more money, but worth every penny."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Shaw",
          "Nb_Reviews": 2,
          "Date": "2023-07-22T02:21:45.000Z",
          "Titre": "Super FAST shipping",
          "Contenu": "Super FAST shipping. Got my order like the next day, I couldn't believe it. Also good, real person, customer service when I made a mistake ordering."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce B from Westfield",
          "Nb_Reviews": 4,
          "Date": "2023-02-17T23:19:53.000Z",
          "Titre": "Expert Recommendation Saved Me $$",
          "Contenu": "I ordered a cabinet and some shelves online but followed up with an email to customer service asking for validation that the shelves would work in the cabinet. I quickly received a call from them informing me that the shelves would not work. Another cabinet was recommended and it came with two shelves. That bundle was less expensive than what I selected. The original order was canceled and I ordered the recommended bundle for a savings of about $50. That’s great service! I look forward to receiving the cabinet in a few days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CK  Harris",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T03:17:41.000Z",
          "Titre": "Well Built Rack and Shelves",
          "Contenu": "Rack and shelves came in a very timely manner. Rack is a solid unit after I finished putting it together. Very well built. The only suggestion I would have is to make it a bit easier to access the nuts for the bolts in order to tighten them. I did struggle a little trying to find the right combination of tools to snug them down. Other than that, I am very pleased with the product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T16:42:21.000Z",
          "Titre": "Had the cables I wanted at the best price!",
          "Contenu": "Had the cables I wanted.  Product description verified the attributes I was looking for.  Price was very competitive.  Free shipping helped save me money.  I will definitely consider and use them again…."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ChrisB",
          "Nb_Reviews": 2,
          "Date": "2022-10-19T22:56:15.000Z",
          "Titre": "Third purchase of a NavePoint Cabinet",
          "Contenu": "Third time purchasing a NavePoint cabinet. These are high quality and far less expensive than what my distributors are charging.Sales rep was super helpful and the online documentation answered all my questions.Would definitely order again.Thumbs up!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Bonilla",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T00:36:35.000Z",
          "Titre": "Their products are great quality that's why I like coming back!",
          "Contenu": "The quality however, I would like to see more different colors for keystone stones since we deal with customers who require a certain color. Outise of that, NAVEPOINT is great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jefferson Tebo",
          "Nb_Reviews": 2,
          "Date": "2023-01-28T23:39:09.000Z",
          "Titre": "Easy to order online",
          "Contenu": "Easy to order online. Great delivery to our front office door. Products we received are as advertised on the website. I will be ordering more equipment in the future for my other locations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathan Wicker",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T13:36:37.000Z",
          "Titre": "Navepoint had exactly what we needed…",
          "Contenu": "Navepoint had exactly what we needed and had various options at that. They ship the products out quickly and they always arrive well packed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SHAWN WAYNE",
          "Nb_Reviews": 4,
          "Date": "2023-06-29T00:06:39.000Z",
          "Titre": "Great Products - Reasonable Prices - Always In Stock",
          "Contenu": "Great Products at a reasonable price. I haven't found a situation where NavePoint didn't have a product to suit my needs indoors. Great Customer Service as well!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bowhead Communication Services",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T18:05:01.000Z",
          "Titre": "A+++",
          "Contenu": "Quick to respond and provide quotes. Friendly customer service, but still professional. Top notch!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Slodowski",
          "Nb_Reviews": 4,
          "Date": "2022-12-21T20:23:21.000Z",
          "Titre": "Amazing service and fast shipping",
          "Contenu": "We use NavePoint to purchase our 42U cabinets. NavePoint has always been reliable and support has been outstanding. The cabinet that we ordered was delivered the next day without any issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AVAJEN",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T17:53:51.000Z",
          "Titre": "Everything was SUPER easy to find",
          "Contenu": "Everything was SUPER easy to find. We love NavePoint for their cabinets and they have great prices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Telephone Connection ☎️",
          "Nb_Reviews": 2,
          "Date": "2023-02-11T18:55:48.000Z",
          "Titre": "Great experience",
          "Contenu": "I haven't received my last order because I only ordered it 2 days ago. But it said it shipped the next day. If it was like the last order it will arrive very soon. I really like the racks I ordered and the shopping and shipping experience was awesome!I will continue to be a repeat customer. I am very happy with the company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Brits",
          "Nb_Reviews": 3,
          "Date": "2023-11-17T20:49:46.000Z",
          "Titre": "Great Service",
          "Contenu": "Great Service, Great products. A+ experience all round."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tierra-Lynn Turner",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T20:23:21.000Z",
          "Titre": "5 STARS SINCE THE BEGINNING",
          "Contenu": "We've been purchasing from Navepoint for over a year now for equipment needed for many of our installations. Pricing is always good, shipping is always fast & customer service is always amazing. Thank you, Tierra-LynnDiscount Telecommunications, INC."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Fogle",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T12:39:43.000Z",
          "Titre": "Smoothest transaction in a great while",
          "Contenu": "Smoothest transaction in a great while. Fast shipping and service. Would do business with again with no reservations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Gerstel",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T14:09:54.000Z",
          "Titre": "For the first time using Nave Point",
          "Contenu": "For the first time using Nave Point, we are very satisfied with everything about the process.  The representative that gave us the quotes was very attentive and accommodating with all the changes we made to it.  The prices for the quality of the products are amazing, and the free shipping is a no brainer.  The only product that we purchased that did not live up to the expectation are the cat6 Keystones.  They are really hard to work with even with cat5 cable.  They are not a bad product, just really tight.  You really have to squeeze the cables into them.  Other than that everything else was amazing.  High quality shielded cable, the wire baskets are more sturdy than any I have ever worked with.  I would for sure recommend them to anyone who needs to have quality products for a pretty unbeatable price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Snyder",
          "Nb_Reviews": 4,
          "Date": "2023-03-02T22:25:49.000Z",
          "Titre": "Always look to them when buying racks…",
          "Contenu": "Always look to them when buying racks or cabinets.Always ships timely and good quality, make sure you count your U's being used is the key!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "curtis lindsay",
          "Nb_Reviews": 2,
          "Date": "2023-08-18T12:13:59.000Z",
          "Titre": "Rack",
          "Contenu": "I needed to Upgrade my order and have my original order canceled before it shipped. Their people were right on it and took care of it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Duane Brown",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T14:42:29.000Z",
          "Titre": "Fast shipment"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karl Durm",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T05:43:57.000Z",
          "Titre": "9U Performance Enclosure …",
          "Contenu": "Quick Shipping and felt like materials were well built. Not difficult to put together. Installed with 200LB #12 Drywall anchors."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Barbalat",
          "Nb_Reviews": 4,
          "Date": "2023-02-09T23:53:51.000Z",
          "Titre": "Easy order process and package arrived…",
          "Contenu": "Easy order process and package arrived on time. Unfortunately, there was no packing slip and one of the boxes were a little damaged."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric simmers",
          "Nb_Reviews": 2,
          "Date": "2023-08-12T17:52:44.000Z",
          "Titre": "Fancy DJ now",
          "Contenu": "Cabinets and fan and shelves I bought fit my pro x box perfect, nicely made and made my flight box look very nice"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas G",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T00:52:20.000Z",
          "Titre": "Top notch customer service",
          "Contenu": "Top notch customer service. They stand behind their products and rectified issues to customer's satisfaction in a very timely fashion. 10/10 would recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RC Global",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T20:52:04.000Z",
          "Titre": "Good costumer service",
          "Contenu": "Good costumer serviceMy order was delivered on time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jorge Rodriguez",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T19:29:27.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "It is always a pleasure working with the customer service team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Young",
          "Nb_Reviews": 4,
          "Date": "2023-09-13T00:57:54.000Z",
          "Titre": "Customer service. Who would have thought?",
          "Contenu": "Navepoint does a fantastic job. Their products are well made and well priced and their shipping is really fast. I won't buy from anywhere else."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kurtis Williams",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T14:07:40.000Z",
          "Titre": "The server rack we purchased worked out…",
          "Contenu": "The server rack we purchased worked out perfectly. It was easy to maneuver into place and the ordering process was seamless. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dante",
          "Nb_Reviews": 5,
          "Date": "2023-05-11T02:54:05.000Z",
          "Titre": "Delivery was on time with great packing to protect the product.",
          "Contenu": "Website made it easy to find what I needed for a network rack, and delivery was on time with great packing to protect the product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Osborne",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T02:16:43.000Z",
          "Titre": "Product came bent and a replacement was…",
          "Contenu": "Product came bent and a replacement was shipped out immediately.  Thank you.  Good support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jorge Rodriguez",
          "Nb_Reviews": 2,
          "Date": "2023-09-15T18:41:39.000Z",
          "Titre": "Tina was the last person I talked to, but enjoy talking to any member.",
          "Contenu": "I really enjoy talking to any member on their team. Best customer service team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Ferris",
          "Nb_Reviews": 5,
          "Date": "2023-11-21T17:00:28.000Z",
          "Titre": "Fastest service ever",
          "Contenu": "Fastest service ever!  Thanks again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SCOTT STAGNER",
          "Nb_Reviews": 5,
          "Date": "2022-12-30T23:26:07.000Z",
          "Titre": "was directed right to a sales…",
          "Contenu": "was directed right to a sales consultant. Patrick, he understood what I needed, quoted and followed up. GREAT SERVICE"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2022-10-13T00:12:34.000Z",
          "Titre": "NavePoint offers quality products with integrity",
          "Contenu": "NavePoint pre sales support was very helpful in answering a list of my questions prior to the purchase. One of those questions was “What happens if the something is damaged during shipment?” I’ll circle back to that topic later.When asked, NavePoint explained the benefits of each cabinet series; they have several to choose from. I selected the NavePoint 15U 600mm Depth Wallmount Networking Cabinet (Professional Series) and 2 NavePoint Fixed Vented Shelves for 600mm Cabinets.Unfortunately, some of my cabinet parts were damaged in shipment. I would have rejected the 86-pound shipment, but the box only appeared to be slightly damaged. NavePoint customer service requested photos of the damaged parts and promptly shipped the replacement parts to me at no cost. It was that simple, yet impressive.The cabinet build instructions were clear and the fit and finish met my expectations, which are higher than most as I work for a global information technology firm. The finished cabinet is a show piece and houses network, surveillance and smart home equipment. My NavePoint experience, start to finish, was great. I would not hesitate to recommend NavePoint to a friend or colleague.This was a personal purchase at full price for home use. I am in no way affiliated with NavePoint.-James"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Bean",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T22:50:30.000Z",
          "Titre": "Customer service was very helpful in…",
          "Contenu": "Customer service was very helpful in helping me identify the right part to order.  They called me back the same day I sent in pictures of the rack.  Very prompt!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas N. Dooley",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T21:07:33.000Z",
          "Titre": "website was easy to navigate for us to…",
          "Contenu": "website was easy to navigate for us to place our order"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Burgess",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T17:06:48.000Z",
          "Titre": "User friendly website",
          "Contenu": "User friendly website. Great prices. Fast shipping. Have not experienced any issues with NavePoint."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike P.",
          "Nb_Reviews": 3,
          "Date": "2023-02-22T02:33:30.000Z",
          "Titre": "You will not be disappointed",
          "Contenu": "Great quality wall rack for a lot less.Shipped same day! Received super quick after was ordered.Couldnt be happier.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Len Ness",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T23:09:15.000Z",
          "Titre": "Mistakenly placed a duplicate order",
          "Contenu": "Mistakenly placed a duplicate order. Got a no questions asked RMA in a day. Great customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Carroll",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T00:12:23.000Z",
          "Titre": "Instructions were easy to follow.",
          "Contenu": "Instructions were easy to follow. The unit was what I desired and so far has fulfilled expectations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Eberlein",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T23:46:10.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping.  Great product. Amazing price.  Will be coming back next time I need another case."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dave",
          "Nb_Reviews": 2,
          "Date": "2023-04-02T08:53:42.000Z",
          "Titre": "swing gate wall mount rack…",
          "Contenu": "I ordered a swing gate wall mount rack .. fourth one for three different projects .. great product .. quick ship .. a a good and easy experience .. now it's time to go pull and punch down some wires"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shirley Danforth",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T00:14:16.000Z",
          "Titre": "Was very helpful with helping me find…",
          "Contenu": "Was very helpful with helping me find the correct rack I was looking for."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory Trail",
          "Nb_Reviews": 2,
          "Date": "2023-02-15T23:02:33.000Z",
          "Titre": "Ordering a few boxes of Cat6 wiring…",
          "Contenu": "Ordering a few boxes of Cat6 wiring with Navepoint was quick and easy no hoops to jump through."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Clack",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T00:28:33.000Z",
          "Titre": "Placed my order over the phone and the…",
          "Contenu": "Placed my order over the phone and the rep I spoke with was very helpful and knowledgeable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AncientGeek",
          "Nb_Reviews": 2,
          "Date": "2023-01-21T12:59:15.000Z",
          "Titre": "Good products, helpful website, good service",
          "Contenu": "I was easily able to find the rack I wanted.  NavePoint shipped it quickly to my desired location.  The rack arrived in great shape and in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken Curcio",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T16:55:58.000Z",
          "Titre": "Very easy to do business",
          "Contenu": "It was very easy to get a quote.  The price was very fair, and they shipped really fast.  We have not installed the cabinet yet but from appearance it is a well-built unit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Zagnoli",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T23:06:17.000Z",
          "Titre": "Had exact item I needed and shipped…",
          "Contenu": "Had exact item I needed and shipped quickly.  Also processed a return for me in a timely fashion."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-04-26T13:16:30.000Z",
          "Titre": "Excellent product",
          "Contenu": "Excellent product, everything fit together great, well packed and shipped quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Shaw",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T15:10:36.000Z",
          "Titre": "We regretfully were unable to use the…",
          "Contenu": "We regretfully were unable to use the product, we needed to return it, but customer service is excellent and there was no re-stocking fee."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Garrett Graham",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T03:12:45.000Z",
          "Titre": "6U Swing Gate Series",
          "Contenu": "The 6U Sing Gate Series was prepped and shipped quickly. The packing was pretty well done and the product is exactly what I needed. There was a few minor blemishes on the chassis, but it is in good shape."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcos",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T14:09:30.000Z",
          "Titre": "Awesome product and customer service",
          "Contenu": "Awesome product and customer service. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelly Paddock",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T21:31:03.000Z",
          "Titre": "Navepoint takes care of us with fast…",
          "Contenu": "Navepoint takes care of us with fast shipping, and good customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Whit_Reeve",
          "Nb_Reviews": 5,
          "Date": "2023-02-03T08:15:36.000Z",
          "Titre": "I've used a number of Navepoint products",
          "Contenu": "I've used a number of Navepoint products and found them to be sturdy and well made. I especially like the free shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PETE ABDO",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T07:46:10.000Z",
          "Titre": "Excellent transaction Wire used for 7.2…",
          "Contenu": "Excellent transaction Wire used for 7.2 surround  sound. Super happy with my purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tuan Nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T16:46:31.000Z",
          "Titre": "Impressed with the quality for the…",
          "Contenu": "Impressed with the quality for the price. Purchase is easy and delivery was quick. Will buy again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Howard Butler",
          "Nb_Reviews": 1,
          "Date": "2022-10-22T15:17:54.000Z",
          "Titre": "Excellent",
          "Contenu": "Chat person was actually available instantly, understood the products and was clear and concise and enabled me to make a decision on what to purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glenn Hall",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T01:19:39.000Z",
          "Titre": "4-Post Server Rack",
          "Contenu": "Ordered online. Arrived in a hurry. Easy instructions and plenty of hardware."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Telephone Connection ☎️",
          "Nb_Reviews": 2,
          "Date": "2023-01-10T22:41:04.000Z",
          "Titre": "Fast",
          "Contenu": "The equipment racks we purchased arrived quickly.  The products are quality and the website is easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Spivey",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T00:06:05.000Z",
          "Titre": "Exactly what I needed",
          "Contenu": "NavePoint had exactly what I needed and it was simple to find it in their online store."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony Porter",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T02:02:45.000Z",
          "Titre": "Exactly what I ordered with on time…",
          "Contenu": "Exactly what I ordered with on time overnight delivery!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allevia Technology",
          "Nb_Reviews": 2,
          "Date": "2023-05-12T22:28:18.000Z",
          "Titre": "Fast and Simple",
          "Contenu": "Fast and Simple. We've been buying Navepoint for years and have once again had great products shipped safely and work every time. Thank you Navepoint."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monica Castro",
          "Nb_Reviews": 3,
          "Date": "2023-09-20T22:54:30.000Z",
          "Titre": "The support agent was extremely helpful…",
          "Contenu": "The support agent was extremely helpful and kind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dina Hinton",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T01:20:41.000Z",
          "Titre": "Tina to the rescue",
          "Contenu": "Tina was able to resolve our issue quickly with a great attitude!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Walton",
          "Nb_Reviews": 1,
          "Date": "2023-02-19T04:28:50.000Z",
          "Titre": "Website is easy to use",
          "Contenu": "Website is easy to use, shipments were on time and as expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SHAWN WAYNE",
          "Nb_Reviews": 4,
          "Date": "2022-10-13T00:19:23.000Z",
          "Titre": "Quality Racks",
          "Contenu": "Quality Racks, fast shipment, Great packaging. Excellent price point."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOHN J. LACKI",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T04:33:22.000Z",
          "Titre": "Good communication",
          "Contenu": "Good communication Great customer service willingness to go the extra mile for answers to your questions. On time delivery.2"
        }
      ]
    }
  ]
}