{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "nexcess.net",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gaston",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T07:33:41.000Z",
          "Titre": "II was a customer for 6 years",
          "Contenu": "II was a customer for 6 years, after so many years I needed support, a disaster, more than 30 days without solving the problem, they ask me again and again the same thing, more than 60 messages sent and they don't solve anything..."
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Max",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T16:35:50.000Z",
          "Titre": "Worst Hosting Ever !!!",
          "Contenu": "These guys don't know what they are doing. I was checking in with them if they are better than cloudways and I can switch to them. I called them as their sales chat was not working (most times it doesn't work). They told me they are better than cloudways and I should move to them. I got convinced by them and moved to them. Placed order and then they said they can't provide me hosting because their system believes My IP is blacklisted OR I had previous account with them OR billing address has problem. I told them that there is no such thing like what they are mentioning. IP is good, address is good and I never had account with them before. But they are not humans, they reply on robotic work. All that are saying after convincing me to switch to them and taking invoice payment from me. I left cloudways for them and they made me stuck, fortunately next day I found better hosting provider. Don't go with these guys, they have no common sense. They don't care about your time, they care more on their robotic system and robotic type humans."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T23:17:11.000Z",
          "Titre": "Support is not knowledgeable.",
          "Contenu": "On call support is not knowledgeable. Pushes help to support ticket which takes several days of back and forth before a solution. Server admin portal is slow and not user friendly. Certain setting changes might not even take effect and no indication is given."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Robert",
          "Nb_Reviews": 52,
          "Date": "2023-07-23T16:57:29.000Z",
          "Titre": "Tech falling apart with bugs",
          "Contenu": "Great support , would be better if restoring a backup worked and wordpress updates worked as described… hence most of their automatic features stopped working without bugs.I’ve used their hosting a couple of years and these were great, however currently most fail."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Marketing Qualifica Group",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T12:33:45.000Z",
          "Titre": "Very bad service.",
          "Contenu": "Hello everyone, they deserve one star because they make you open the account, set up the account for payments, pay, but they don't activate the service. They reply to you that IP is blacklisted, strange, in account activation and payment they don't check IP?Then they close your account, so that you can no longer log in, and tell you, refund made in 7 days.Very bad service."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Ahsan Sial",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T09:42:43.000Z",
          "Titre": "30 days website down",
          "Contenu": "30 days website downI was using Nexcess 2019 and go email Your account has been terminated for violations of our Acceptable Use Policy (AUP) outlined here: They have not provide any specific information and give us very short time to remove all website i was host many sites on nexcess but they provide short time to move other hand they will delete server.our website goes down 30 days huge business loss[Ticket #: 11370638] Account Termination"
        },
        {
          "Note": 1,
          "Lieu": "PE",
          "Pseudo": "Ruddy Gunawan",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T17:09:22.000Z",
          "Titre": "Nexcess (liquidweb) is a scam company, stay away",
          "Contenu": "This is a scam company. I wanted to try this service on Saturday, and their chat support told me to pay the invoice before I can use their wordpress hosting service. I paid the invoice on Saturday, and suddenly they told me they couldn't activate my hosting plan because their billing team was away until Monday. This logic doesn't even make sense, if their billing team was the only one who could activate the hosting, why did they suggest me to pay the invoice? Why they didn't tell me to wait until Monday? This is a fraud company"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Wordpress Lover",
          "Nb_Reviews": 2,
          "Date": "2023-08-16T10:05:55.000Z",
          "Titre": "Worst Experience Ever…",
          "Contenu": "This has most likely been the worst experience of migrating to a new hosting service. In particular, the support has been poor. Constantly chasing support tickets. Slow replies - 7 hours sometimes.Chat engineers are limited in their abilities to investigate technical issues and the opening support tickets. Then support ticket staff replying to the same problem with different responses contradicting the other.The company has too many different people working in support. It needs to be streamlined and get staff on board who have the skills they advertise - WordPress etc.Also, escalation to their 'onboarding manager' and other senior staff resulted in one email reply from one person. No one else in the thread. Nothing after that.Most of the solutions were then actually done by our own staff in-house.If you have a large website, compay reputation depending on it - do not use this host. Look at someone who really does care about new customers amd providing support that you expect."
        },
        {
          "Note": 1,
          "Lieu": "VN",
          "Pseudo": "Pham Long",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T05:02:45.000Z",
          "Titre": "The bad manager hosting",
          "Contenu": "will have a review about the lousy service nexcess gives. too many errors happen and there is no system to check. no notifications or anything like that. the client has to manually check the server's performance? too bad for a service and the money spent to rent it.I have never used a management service that is so unprofessional and unsafe. error always occursTicket #11698312"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "The Street",
          "Nb_Reviews": 2,
          "Date": "2023-01-27T02:04:03.000Z",
          "Titre": "Since Nexcess took over Futurehosting things are BAD",
          "Contenu": "Since Nexcess took over Futurehosting, their customer service has become worse and worse and worse. They've gone from like 3 minute response time to sometimes up to 12 hours (guess why, outsourcing to Asia...). They have messed up my website, they cannot provide the services they used to - and they are by NO means WP experts any more. Very sad."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anita Bennett",
          "Nb_Reviews": 2,
          "Date": "2023-01-26T10:55:36.000Z",
          "Titre": "Shoddy Hosting Service",
          "Contenu": "My website was taken offline for a \"three hour scheduled maintenance\" on their servers. Once the maintenance ended, they were unable to restore service to my website for seven plus hours. They claimed they were \"conducting a disk restore on the hypervisor,\" which did not work. This is extremely poor service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AB",
          "Nb_Reviews": 3,
          "Date": "2023-03-31T00:20:22.000Z",
          "Titre": "Not very user friendly",
          "Contenu": "I signed up for hosting and after I paid and signed up I was informed i couldnt transfer my domain due to it being newer than 60 days. There is no information or any type of popup or note informing people of this if they are trying to transfer a domain. I was told that they would do everything on the technical end of it but its not true and if you are looking for a more user friendly way to set up hosting, don't waste your time and save yourself the headache and go somewhere else. I am also still waiting on my refund that has been longer than expected."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GHeymach MD PhD",
          "Nb_Reviews": 1,
          "Date": "2022-06-05T06:00:21.000Z",
          "Titre": "25 minute wait for an untrained technician ( his assessment)",
          "Contenu": "25 minute wait for a technician who was “new” and couldn’t help. Referred to a second technician 15 min later— the first man could not get anyone to help him.2nd guy said it was the password- but never mentioned you had changed incoming and outgoing sign on on registry so NO mail could come in or out.Our firm was never advised of the necessary changesIs there something below 1 star?"
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "K.",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T22:35:41.000Z",
          "Titre": "Make payment 24 hours ago but could not…",
          "Contenu": "Make payment 24 hours ago but could not reached control panel. Waiting e mail from billing department for my tickets also they are not available for chat.  Not recommended.Edit:After 3 days could not get any service and my payment was refund. Now I am trying to remove my account and credit card info."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jordan M.",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T17:22:16.000Z",
          "Titre": "Buyer Beware - Nexcess Is Not Best",
          "Contenu": "Nexcess seems to have fallen apart in recent months. The support is completely outsourced and often times unwilling and unable to provide any real assistance with their go to line of being \"Work with your developer.\"I have been a customer since 2017 and am working to move all of my sites off Nexcess, which has become a difficult task in itself."
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "Tony",
          "Nb_Reviews": 2,
          "Date": "2023-02-25T02:50:53.000Z",
          "Titre": "A SCARY WEB HOST destroying people's…",
          "Contenu": "A SCARY WEB HOST destroying people's businessOur site doesn't even receive much traffic from complained files and we adhere to all DMCA removals. If you tell us what we have to do to stay on, we are more than happy to comply. Our site is for streamers/indies to share their works, not to promote infringing music. You guys determined to destroy someone's business upon investigation and do it within 2 hours and not provide proper notice? As you said, we are not even 1 day or 1-month customer. We have been there for 10+ years and this is how you treat us? It takes a LONG time to migrate a big site. Right now our site remains down because it is really hard to find a windows 2008 server nowadays. Trash web host.DON'T HOST HERE IF YOU DON'T WANT TO LOSE YOUR BUSINESS IN LESS THAN 2 HOURS!"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Tawfik Dukhan",
          "Nb_Reviews": 8,
          "Date": "2023-05-21T06:45:49.000Z",
          "Titre": "BE CAREFUL THERE POSITIVE REVIEWS ARE FAKE!!",
          "Contenu": "right now I am sure about their positive reviews are 100% FAKE.Cannot believe with service like this someone will give you a good rating!! they cannot handle CRON JOB issue!! so, how about the complix sitiuations!! when chatting with them, they are asking to call for faster response, when I call they spending hours with no result and then asking me to open a ticket for faster response, finally when I opened a ticket, my ticket goes to stupid bigginer people who do not know how to manage servers and resolve a small issue like this!! Its almost one complete day of working with a small issue and till now no one fix it. MY SITE DOWN !!!!!!I spend more than 3 hours in calling from Germany to US with no solution. ALL THEY SAID OPEN A TICKET FOR FASTER RESPONSE!!!!!!I cannot trust or respect a company like this to handle my business."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-02-22T23:12:29.000Z",
          "Titre": "The base installation of Magento 2…",
          "Contenu": "The base installation of Magento 2 software from them was an old version, which is a major security problem.  The admin panel had erroneous information available that, according to support, could not be updated. Support took days to respond and ultimately could not reset our portal with a base system that was up-to-date. Will not be using them again and advise others to stay away."
        },
        {
          "Note": 1,
          "Lieu": "VN",
          "Pseudo": "Pham Kevin",
          "Nb_Reviews": 2,
          "Date": "2023-03-01T07:56:03.000Z",
          "Titre": "My website is down for a long time",
          "Contenu": "My website is down for a long time. Reported to the tech but they couldn't get the site to work. Technically weak as well as irresponsible to users Disappointed to pay the cost to get such results"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Brian Horvath",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T20:35:41.000Z",
          "Titre": "Terrible service and support",
          "Contenu": "Terrible service and support. Nexcess \"upgraded\" our service without regards for whether we wanted it or not.   We had a website that worked perfectly now it's not working for my customers and to top it off I hear that it's not their platform but one of my plug-ins.   Well it worked for years without their upgrade.  They put it on me to figure out using ssh.   I was paying for a managed site now they say they are phasing that out.   Well maybe check to see how it works before and after and fix the issue before it's migrated.   Customers should be just handed a tech doc and here figure it out.  It's still unresolved.    In all my years of working on sites I've never seen anything like this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Skiing and Porsches",
          "Nb_Reviews": 1,
          "Date": "2022-06-23T21:30:08.000Z",
          "Titre": "Nexcess is a huge regret",
          "Contenu": "Nexcess is a huge regret, they are overpriced and have terrible customer service. There are much better hosting providers that treat their customers with respect - this is not one of them."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Luis Badalona",
          "Nb_Reviews": 3,
          "Date": "2022-11-29T08:34:26.000Z",
          "Titre": "Bad service",
          "Contenu": "Bad serviceOne week with the website down.No matter how many times I asked for help, they did not resolve the incident.They have people who don't know the technical part and can't solve the problems.For me, a week with the website down means losing a lot of money.Update:If I had unpaid invoices because it just so happens that they had not sent me the URL, nor the username and password to be able to pay the invoice. How am I going to pay it if no unpaid invoice appeared in the Nexcess client area.In addition, I made a query about the DNS for the migration and after half an hour they unsubscribed the old server, with which 6 websites were automatically down, unavailable. They did not notify me, they simply told me that they were confiscating the server on a Friday. Bad day to carry out this type of action. They did not notify me.Then I make the DNS change and the SSL certificate fails on a website and I had to send numerous tickets to get the problem resolved. Each support technician said something different and no one solved the problem. I've been with Future Hosting for 10 years and nothing like this has ever happened. It is unfortunate. A bad service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T06:09:59.000Z",
          "Titre": "It's really simple for me",
          "Contenu": "It's really simple for me.  FutureHosting was a company acquired by Nexcess.  FutureHosting had no phone support at all.  They only used a ticket system and they promptly replied to tickets. It saved a great deal of time for both FutureHosting and its customers, and provided a convenient record of the progress toward solutions.Today, I submit tickets to Nexcess that seem to confuse the support staff for a day, until they ultimately determine that I was a FutureHosting customer, and then they have to re-type my messages into the old FutureHosting system.It would make a great deal of sense to just allow me a way to post tickets directly to the FutureHosting support staff.  I always provide all the necessary details and access accounts, URLs & passwords so that they can navigate my systems.  I should be able to bypass the confusion & delay the current ticket system adds to FutureHosting customers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Catherine Armatage",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T04:00:19.000Z",
          "Titre": "How to on using StoreBuiler…",
          "Contenu": "How to on using StoreBuiler disappeared. Requested resend. No resolution. Doing on own. Low income senior. Project draining my funds. Not happy."
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "Luis",
          "Nb_Reviews": 3,
          "Date": "2023-01-07T16:24:48.000Z",
          "Titre": "Autoresponder Email Nightmare",
          "Contenu": "I have a Managed WooCommerce hosting Starter plan with Nexcess but use a domain registered elsewhere. I needed to set up an autoresponder email because I was going on vacation and something as simple as that has become a nightmare. Firstly, Nexcess platform does not allow setting up an autoresponder from my main domain, instead the response email is sent from the default Nexcess hosting domain; this means our customers will email \"@mydomain.pt\" and get a response from \"@XXXXX.nxcli.net\" which is completely unprofessional in my opinion. We contacted Nexcess support, and a collaborator said that they could change the settings themselves to have the autoresponder come from our main domain. When the time came to activate the autoresponder, the email was still coming from the wrong email address and while we were already on vacation Nexcess support said they couldn't do a thing about it. One week later of having the autoresponder coming from the wrong email address, we came back and asked to turn off the autoresponder; two days have passed and it is still active; we cannot turn it off because this was set by the support team. Overall this was a terrible experience, I wouldn't recommend using Nexcess email service, and the customer support was totally unhelpful in this case, in fact they made it worst."
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Y.I",
          "Nb_Reviews": 2,
          "Date": "2023-03-25T00:37:15.000Z",
          "Titre": "Stay Away from Nexcess Hosting: Unreliable Services, Inadequate Technical Support, and Slow Response Time",
          "Contenu": "I had a terrible experience with Nexcess hosting. Their services were far from satisfactory, and I cannot recommend them to anyone. The response time to my tickets was extremely slow, and I would sometimes have to wait up to 2-4 days for a reply.Furthermore, my website would crash whenever there were more than 800 or more concurrent users, even though I had the most expensive plan they offer. This was unacceptable, and their technical staff could not fix the issue. They promised me multiple times that they had resolved the issue, but it kept happening repeatedly.During a livestream event with paid members, my website was down for more than a day, which is totally unacceptable. Their services are not reliable!After switching to Hostinger recently, I had no issues with my website, and it could handle up to 5000+ concurrent users without any problem. It's clear that Nexcess hosting does not have the capacity or technical expertise to handle high-traffic websites.I should also mention that I had a similar experience with Futurehosting, which ran the service before Nexcess took over. At least with Futurehosting, the support team answered queries quickly, but the site still crashed in same way like with Nexcess. They do not have the capacity or technical staff to fix anything or help out when needed.I advise everyone to stay away from Nexcess hosting. Their services are unreliable, their technical support is inadequate, and their pricing is not worth the hassle. Choose other hosting services that can provide better support and handle high-traffic websites."
        },
        {
          "Note": 1,
          "Lieu": "CO",
          "Pseudo": "Jorge",
          "Nb_Reviews": 3,
          "Date": "2022-07-15T02:10:59.000Z",
          "Titre": "since liquidweb bought futurehosting, malo malo el soporte",
          "Contenu": "since liquidweb bought futurehosting, which was my provider without problems and with an excellent support service for 13 years, here with nexcess the support has been quite bad, they take more than 4 or 8 hours to respond and sometimes they don't even give them and That said of the solutions, it seems that they take the time looking for a solution on the internet before applying them to the requirements made.In fact, sometimes searching the internet for a solution to a server problem, I have been able to solve it faster than nexcess support.And equally the commercial support, very slow"
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "Tony",
          "Nb_Reviews": 2,
          "Date": "2023-02-25T00:54:06.000Z",
          "Titre": "HORRENDOUS HOSTING From Nexcess / Liquid Web",
          "Contenu": "HORRENDOUS HOST since acquired by Liquid Web / Nexcess. Been with Futurehosting + Nexcess for over 13 years and all it took for 1 DMCA complaint and they shut us down in 2 hours after serving notice. It is 12 am at my place when served the notice and shut us down at 2:30am... Seriously horrendous service and hosting provider. Reading other's reviews, I am not sure if I will get my files back. They just destroyed a $150,000 business in 2 hours of time. Don't ever host on Nexcess / liquid web if you have any business that's making money. They will shut you down within 2 hours notice. It a freaking crazy unreliable company. There are many reliable hosting out there.  Don't bother with these guys. They will DESTROY your business. It might not happen now but it WILL happen one day when you are unexpected. These guys are unreliable as a server crash. It will happen anytime and they will come and shut you down within 2 hours notice. No negotiation, no what, no if. They will treat you like dirt. Like you are destroying their business but they don't care if they are destroying other people's business. They just destroyed a $150,000 business with a 2 hours short notice. These guys are a joke.-TonyUPDATE: So nexcess hosted us for 10+ years and then suddenly determine our business is not right for them and terminate us in 2 hours. As a long time customer, maybe, just maybe, as a courtesy, could have provided a proper warning and enough notice period for us to move? IF YOU DON'T WANT TO LOSE YOUR BUSINESS, BE WARNED THESE GUYS WILL NOT TREAT YOU PROPERLY. As other reviewer has said, they will terminate you and destroy your business within 2 hours!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Robert Szakal",
          "Nb_Reviews": 44,
          "Date": "2023-04-13T15:12:55.000Z",
          "Titre": "Avoid",
          "Contenu": "The support is very, very slow.The portal is clunky.Support seems to be outsourced.Garbage tier web hosting, go elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "G Barrows",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T18:35:38.000Z",
          "Titre": "Failed",
          "Contenu": "Failed to provide a fix to a serious email issue."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Tawfik Dukhan",
          "Nb_Reviews": 8,
          "Date": "2023-07-16T14:33:55.000Z",
          "Titre": "Unauthorized Charges",
          "Contenu": "Another review to express my deep frustration and disappointment with the ongoing attempts to charge my credit card, despite the fact that I have cancelled my plan with Nexcess. This continuous and unauthorized billing practice is not only unethical but also amounts to an act of theft and a blatant violation of my consumer rights.I had initially signed up for a plan with Nexcess with the understanding that it would provide the services and support as promised. However, the experience has been nothing short of a nightmare. Not only did I encounter numerous technical issues and poor customer service, but the problems persisted even after my decision to terminate my subscription. This persistence in charging my credit card without my consent or authorization is completely unacceptable.I have made multiple attempts to resolve this matter with your customer support team, but I have been met with indifference and unhelpful responses. Despite providing clear evidence of my cancellation and requesting an immediate halt to any further charges, this company has continued to disregard my rights as a customer.I demand that you cease all attempts to charge my credit card immediately and refund any unauthorized charges that have been made since the cancellation of my plan. If this matter is not resolved promptly and to my satisfaction, I will have no choice but to escalate the issue by reporting Nexcess to the appropriate consumer protection authorities, as well as asking my  legal counsel to recover the funds that have been wrongly taken from my account. I am prepared to pursue all available avenues to hold Nexcess accountable for its unethical and illegal actions."
        },
        {
          "Note": 1,
          "Lieu": "CO",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-29T16:19:03.000Z",
          "Titre": "We are having many issues with our…",
          "Contenu": "We are having many issues with our websites"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alexandra McLarty",
          "Nb_Reviews": 10,
          "Date": "2022-06-23T01:31:53.000Z",
          "Titre": "Nexcess is one of my biggest business regrets",
          "Contenu": "I signed up with Nexcess due to the glowing recommendations from my network and sites like Trust Pilot. I was moving over 30 sites away from WP Engine due to costs associated with that many sites on a single server. I wish I'd chosen a different company.Things already seemed a bit off during the migration process. The initial copying of my sites over to Nexcess caused a multitude of different and seemingly random issues on all but two of my sites - content switched to lorem ipsum, functionality disappearing despite the plugin behind it still being enabled, posts set to the wrong author, just all kinds of strange stuff that shouldn't happen with a routine migration. It took me over 10 hours to identify all of the issues across my sites to request they be fixed. When it came time to actually migrate the sites, two of the migration staff I worked with were lovely, but the other one was really frustrating. He didn't communicate with me for three hours after my migration was scheduled to start, and then when I reached out to cancel the migration that night since it was already so late, he began putting all of my sites in maintenance mode and even taking some of them offline without responding to me. Things didn't improve once I was up and running on Nexcess. My sites kept experiencing short downtimes, but support would gaslight me whenever I reached out to find out what had happened. \"I don't see anything in the server logs, must have just been your internet.\" Right, that's why two separate uptime monitoring services both reported the site down...One of my sites that had been using PHP 7.4 for over a year on WP Engine began having spontaneous intermittent downtime one day. Support attributed it to a PHP 7.4 issue and told me I must have changed the PHP version and broke it (I didn't?). The site began to work again a few hours later, and Nexcess was never able to explain to me what happened to cause the issue. They said they saw nothing in the logs. It's still a mystery what took my eCommerce site offline in the middle of a business day.Pushing staging sites to production with Nexcess is, unfortunately, also a deeply frustrating experience. Unlike other hosts, there's no way to click a couple of buttons and push from one environment to another. You have to use WP Merge or Blogvault. WP Merge is powerful and a nice perk, but it's extremely complex to use and it's really easy to muck up your database with it. Blogvault is really easy, but takes much longer to copy a site from staging to production, and the site is down the entire time when doing so. At one point, Blogvault was giving me an error when trying to copy from staging to production. I reached out to support for help, but they couldn't figure it out. They suggested I try WP Merge, which overwrote all of the staging changes (despite supposedly copying from staging to production, not the other way around), forcing me to restore a day-old backup and re-do several hours worth of work. With both options not working, Nexcess had no solution for pushing my site to production to meet its launch schedule. Fortunately, the staff at Blogvault were very helpful and gave me a free trial to attempt migrating without using Nexcess as a middle-man, which worked perfectly. 22 hours later, someone at Nexcess support finally figured out what was wrong with Blogvault. I needed to include https:// in \"destination site url\" field, but not the \"host/server address\" field, or it wouldn't work. 22 hours and a late launch just because of their finicky setup (regular Blogvault worked perfectly whether https:// was included or not).The straw that finally broke the camel's back - and mind you, I only joined 3 months ago - was a huge outage last week. All of my sites were offline for over 2 hours sporadically throughout the day. Nexcess's status page was not informative about the status or reason behind the outage, and their support staff, as usual, couldn't tell me anything. Over a week later, the issue behind the outage hasn't been resolved and we experienced another, albeit shorter, outage yesterday that again took all of my sites offline multiple times. When the outage recurred yesterday and I first reached out to Nexcess to see if it was the same issue, they again began by blaming it on my personal internet before admitting there was another outage. I asked for information about the outage so I could explain to my clients what happened and what was being done to prevent it, and they closed my ticket without responding.I'm finally taking the time to migrate all of my sites away from Nexcess only 3 months after joining, and I'm counting the hours until I never have to deal with this platform again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Day one customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-07T01:34:41.000Z",
          "Titre": "Used to be amazing",
          "Contenu": "Used to be amazing, personal, extremely competent service; now support tickets take half a day or more for a response and usually come back as \"looks like the site is up now?\" after the issue has resolved itself. Imagine the most amazing piece of art you've ever beheld, and then imagine it set on fire, dragged backwards through mud for 1,000 miles (still on fire) and then finally extinguished by your tears, and you won't begin to come close to the experience of watching Nexcess degrade since acquisition."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jasonful",
          "Nb_Reviews": 1,
          "Date": "2021-09-23T15:22:57.000Z",
          "Titre": "Features break with little hope of getting them fixed.",
          "Contenu": "We chose nexcess because they had daily backups and automatic Wordpress plugin updates.  Now neither of those features is working.  Plugin updates haven't worked for months, and support is not optimistic about getting backups working anytime soon.  May be time to cancel. (Account ID 98461)"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2021-02-02T13:52:27.000Z",
          "Titre": "AVOID LIKE THE PLAGUE",
          "Contenu": "AVOID LIKE THE PLAGUE. Was a customer for many years, been billed monthly for years no contract. Emailed Cancellation request, 31/11/2020. Continued to charge over 1.5k per month. Still getting the run around, it’s being processed blah blah.. criminals avoid at all costs.Update 03/02/2021: Please note this has now been sorted by Nexcess."
        },
        {
          "Note": 1,
          "Lieu": "CO",
          "Pseudo": "joshert Parra",
          "Nb_Reviews": 1,
          "Date": "2020-12-11T19:45:29.000Z",
          "Titre": "We have gotten extremely problems to…",
          "Contenu": "We have gotten extremely problems to update or download data from nexcess server.We try to update some changes that was working from in other page but same server, same user account, this is part of our process. But her conection is extremly slow and problmatic.We ask support how we could do it, the answer was \"you have to paid me every time that you update the page, includind if it's a page inside our server and is in a page in the same account\"."
        },
        {
          "Note": 1,
          "Lieu": "CO",
          "Pseudo": "cartman",
          "Nb_Reviews": 1,
          "Date": "2021-06-18T08:39:50.000Z",
          "Titre": "Nexcess, a bad experience.",
          "Contenu": "I have been a nexcess customer for 8 years. From the last 2 years, things are good until you need help from technical support. They take days without responding without solving anything. It is a mediocre team with no service attitude or professionalism. What they call technical support is disastrous. Now I decided to change hosting company; I leave you with your problem. I do not recommend nexcess as a hosting provider. It's a bad experience at an exorbitant price that is not worth it, ...even if they offer $150 Gift Cards for writing favorable reviews!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph Kahn",
          "Nb_Reviews": 3,
          "Date": "2021-04-19T21:39:36.000Z",
          "Titre": "The support responses are not helpful",
          "Contenu": "My 1 star review is because I have yet to get a site successfully migrated over without issues. The support responses are not helpful and act like the problems are yours rather than theirs. (even though everything was fine on the other host)They claim you get first level support, but at all times, chat has been moved to 2nd tier even though sales said that wouldn't happen. My site has been down all day with errors!The portal still hasn't recognized my DNS properly and work-arounds have to be used. Which makes me suspect on why things don't work properly. :("
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chaim",
          "Nb_Reviews": 3,
          "Date": "2021-07-22T20:35:33.000Z",
          "Titre": "went from great to disastrous",
          "Contenu": "Been a customer since 2011 - that's 10 years.They definitely used to be the best out there.But I guess as they grew and merged, the quality customer service and fast response times disappeared.Would not recommend to anyone looking for new hosting in 2021.On dedicated servers, hours could go by before you get any kind of response.You could always call in to try and trigger an immediate response, but that's only good if the hold time is not too long.I was a very happy customers for many years but it's time to face reality and realize that this is no longer what it used to be, time to move on."
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Alain Puystiens",
          "Nb_Reviews": 3,
          "Date": "2020-09-11T06:36:20.000Z",
          "Titre": "POOR support.",
          "Contenu": "Terrible support.waiting few days for a simple request = no answers.When we started few years ago was support TOP but since months ago so slow in responding tickets, we keep on sending reminders and mails but always on time to send invoices.@Nexcess invest in people!"
        },
        {
          "Note": 1,
          "Lieu": "PE",
          "Pseudo": "Fernando Vz",
          "Nb_Reviews": 1,
          "Date": "2021-12-29T23:27:40.000Z",
          "Titre": "I come from another hosting company…",
          "Contenu": "I come from another hosting company they bought. They shut down my servers before migrating them, I can't enter their platform. It's almost a day without service. Support just asks for more time."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Kilt Suits",
          "Nb_Reviews": 1,
          "Date": "2022-02-08T10:58:18.000Z",
          "Titre": "Delete my 2 live website without backup and terminate my account",
          "Contenu": "I have two live website hosting Nexcess and They terminate my account without any warning two website files and database also nexcess deleted they dont provide backup Big loss for my business I email to their billing team and support no one help just termination not able to login with their portal They must provide reason for termination or give some time to migrate website to another hostingHello,Your account has been terminated for violations of our Acceptable Use Policy (AUP) outlined here: Regards,Darcy K.Ticket #10049668Nexcess.Net, LLCHelp ArticlesNexcess StatusCall us at +1.866.639.2377Fax +1.248.281.0473If you have business website you never host on Nexcess their support is stuck not helping with this issueVery frustration"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Francois Morin",
          "Nb_Reviews": 1,
          "Date": "2021-05-31T17:22:50.000Z",
          "Titre": "Nexcess decided to increase the price…",
          "Contenu": "Nexcess decided to increase the price for hosting Magento 1 website from 24,95 to 39.95  by forcing you to add a software they impose when using Magento 1.  Very frustrating, I'm taking my site out of there."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Bartlett",
          "Nb_Reviews": 10,
          "Date": "2020-09-24T19:45:11.000Z",
          "Titre": "woeful billing system",
          "Contenu": "the platform seems to be solid, with some deficiencies, but the billing and payment system is woeful. I have spent hours on the phone with Help team and submitted countless tickets. the problems persist."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Goldy",
          "Nb_Reviews": 1,
          "Date": "2022-03-29T14:56:57.000Z",
          "Titre": "Nexcess was an amazing company- NOT Anymore",
          "Contenu": "Nexcess was an amazing company. I have hosted my site with them for the last 10 years. It was $600/ month but well worth the charges as support would answer within an hour & get it right the first time.The last year, I have noticed a massive delay in email responses. It can take days until there is a response. And then the response is not clear, it is almost canned as if they are reading off a checklist. Calling is no better. When calling, the calls are now answered by unexperienced agents who play around with various things trying to figure out what to do. After an hour, they finally give up & say, ok , I need to transfer you to a higher level technician. On top of that, everyone is working from home & the phone connections are terrible, very scratchy and difficult to hear. Calls get dropped. horrible.This is a disaster! Can someone advise a better hosting company"
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Martin Skallerup",
          "Nb_Reviews": 31,
          "Date": "2021-02-17T21:55:37.000Z",
          "Titre": "Ordered a WooCommerce plan",
          "Contenu": "Ordered a WooCommerce plan, but now 7 hours later I still don't have any hosting product. I have been contacting support multiple times, and I was told it could take some hours (other hosting companies offers storage within seconds or few minutes). After my 3rd chat I was told that they suddenly need documentation for potential fraud. Fair enough, but why only tell me this after I reach out to the chat? I provided the details right away, and now they tell me:\"...due to the extreme weather condition in several parts of the States, the billing team members are suffering from a power outage which is why they are not online at the moment.\"I have never experienced a worse boarding from my +15 years of experience with hosting companies. I hope to get a refund right away.Cannot recommend this company to anyone.REF: 42508431850"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Lee Packman",
          "Nb_Reviews": 13,
          "Date": "2021-04-25T12:24:34.000Z",
          "Titre": "Nexcess sort your s*** out.",
          "Contenu": "As far as web hosting goes this is the worst experience ever. Sorry to say that support is useless. Tickets do not get answered and when you finally do get a reply after having to make contact by other means just to get them to look at your ticket the solutions are not even valid. When you post another response you end up waiting days for another reply!I can not recommend this company to anyone who wishes to run a successful online store, if you hit any issues at all you will be totally on your own.What I find funny is it seems they spend more time replying to reviews on here than they do to their support tickets! My support ticket LJWY-0791 was opened 11 days ago! Still no solution to offloading backups to FTP or S3, I was advised to install WPVivid this plugin also fails, reported this 2 days ago and still no response.Chat doesn't connect to agent when you need them, support telephone connects puts you in a que then drops the call after 20+ minutes. Nexcess needs to sort their s*** out."
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "Mariana Barbosa",
          "Nb_Reviews": 1,
          "Date": "2021-11-17T16:13:49.000Z",
          "Titre": "They dropped the ball on support…",
          "Contenu": "They dropped the ball on support lately. Very poor technical support taking weeks to solve hacking attacks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "rikkitodd.com",
          "Nb_Reviews": 1,
          "Date": "2021-12-20T22:49:51.000Z",
          "Titre": "Abysmal Service",
          "Contenu": "My mother taught me that if you don't have anything good to say...DON'T SAY ANYTHING AT ALL!!!"
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Ahsan Ali",
          "Nb_Reviews": 3,
          "Date": "2021-10-17T21:27:51.000Z",
          "Titre": "Not recommended",
          "Contenu": "Hi NexcessTicket #: 09178930Our competitor submit DMCA Takedown noticeThe complainant does not hold the copyright to the material in question and therefore lacks standing to assert that our use of the material is a violation of any of the owner's rights. They have reported our web pages/ websites to end the competition because we are working in the same niche. When i submit counter notice and ask them its fake and submitted by competitor they disable our website two month and i will purchase new hosting plan and I was paid 239 USD not getting refund and I have paid twice one here disable website and 2nd buy new hosting.They dont response with counter notice and just reply message \"We are not able to continue hosting for the site unfortunately. You were told that if the DMCA notices continued, the sites we get them for would need to be removed from our network\" If your competitor sending fake DMCA takedown Nexcess will not care about your business and disable your websiteNot happy with their legal team also if someone submit fake dmca takedown nexcess will be disalbe your websiteI think they have only one person who manage Legal issue they dont investigate about DMCA takedown fake Brock B never response to counter notice just said remove from here and disable your business"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jojo Wu",
          "Nb_Reviews": 3,
          "Date": "2020-10-12T05:09:40.000Z",
          "Titre": "Indeed a helper of Fake DMCA Abuse!!",
          "Contenu": "Further correspondence has been useless. Later I find the complainer's own website has been offline since 16th March 2020. The website is entirely inaccessible. So I wonder how this could be called a valid \"DMCA takedown notice\"!Guess what? I find other funny things: 1) the complainer leaves no email address. 2) the name of the complainer is a famous German mathematician born in 19393) the number of the complainer is a suspicious number, flagged multiple times, given a simple googling4) the address the complainer leaves is a virtual business addressSo we are basically complained by an unknown, who shows their copyrighted works on a website that has been offline for more than a half year, who leaves no email address, whose name happens to be the same with a German mathematician, whose number has been flagged multiple times, and whose business address is virtual, and who starts the complaining letter with the familiar \"To Whom It May Concern\". The Director of Nexcess Support, along with another staff member from the Security Team, introduced as being very familiar with the DMCA requirements, thinks the DMCA takedown notice seems well formatted and is serious and valid!I hope all these are not coincidences. I hope Nexcess stuff members do would like to be helpful when issues occur, instead of debating. I hope Nexcess stuff members do check problems and facts. I hope Nexcess, as a company, does want to be supportive, instead of being slaved by their own policies. Unless my issue has been solved right away with compensation, or unless you don't care about fake DMCA notices that cause the banning of your website, you are not recommended to use Nexcess. I swear all the above facts are real."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christian Riley",
          "Nb_Reviews": 7,
          "Date": "2021-02-10T19:32:13.000Z",
          "Titre": "Unimpressive performance",
          "Contenu": "I gave it 10 months on a one year plan and was continually getting \"autoscale notification\" messages.  I would check the web sites and not see anything that would indicate significant traffic at the time.  So I migrated back to the old server and changed the DNS to point there, yet even for the last 1.5 months when the DNS wasn't pointed to nexuses.net, I got some \"autoscale usage notifications.\"  Given there wasn't any traffic going there, it doesn't seem possible it was accurate.  Likewise, the notifications would often say \"We previously sent you a note to let you know that your site was experiencing additional visitors\" which wasn't accurate - nothing in the spam folder either.Finally, they did tout auto-updating of plugins, but that rarely worked except when I set it up in WP myself.One caveat, the support people were always very nice and very helpful, but the servers they were using were seemingly underpowered and the tools they were using didn't seem accurate.  Hopefully they get the issues fixed and if so, I'd give it a try in a few years.Without those issues, I would've stayed there, but those were deal breakers for me.Thanksedit:As you can see from their reply, they are definitely on top of things and always have been pleasant and friendly.  They haven't ever answered why the autoscale notifications (a) claim one has already been sent when it hasn't, and (b) why autoscale is needed in the first place when there is limited traffic.  As above, I really hope they fix the issues I saw.  I had moved some sites from LiquidWeb CloudSites and some from AWS.  The performance on CloudSites had been better than nexcess seemed over the last 11 months subjectively, admittedly.  Nexcess did making moving there easy, so it probably wouldn't be difficult to move back at a later time.  For me, the main thing was the autoscale notifications on sites that weren't getting millions of visitors a day.  :-)"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Fang",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T17:51:20.000Z",
          "Titre": "Extremely Ridiculous",
          "Contenu": "I'm Jojo's workmate and I have to talk with Nexcess over the recent DMCA takedown notice falsely and deliberately made towards us from competition. Later today I did some research and found something very interesting about the complainant's identity:1) the website, on which the complainant says their copyrighted images are listed has been offline since March 20202) the complainant leaves no email address; the letter has been submitted via web form3) the address, when searched on Google, shows VIRTUAL OFFICES AND BUSINESS ADDRESSES FOR RENT4) the phone number, when searched on Google, is flagged, and promoted as a prank phone: Frank will politely tell the person calling that you do not wish to be contacted by them. Because it's neutral in terms of location and message, you can use it in all sorts of situations, for example in official forms. You can preview Frank’s message here (a link); it’s German of course.The above, when combined, has to mean something. So we are basically attacked by an unknown, via Nexcess. Nexcess should at least have confirmed the existence of the complainant in the first place before taking action on our website. But Nexcess did not and they think it's the way to do it. Meanwhile Nexcess Support keeps telling me \"the DMCA is complete and properly formatted, and as such we are processing it\", three or four times. Nexcess Support is basically telling me they don't care about the identity of a DMCA complainer, whether it's fake or not, whether they can reach the complainer or not (anyway they won't even try to reach a complainer, at least in our case). As long as the DMCA takedown notice seems properly formatted and complete, they remove anything requested in it.I need Nexcess to tell me straight if it's too late, they are already processing it so we have to wait for 10 days this time. I need Nexcess to tell me if it's due to their negligence and if they could have done better by investigating the complainant's identity a little bit."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jojo Wu",
          "Nb_Reviews": 3,
          "Date": "2020-10-13T05:46:46.000Z",
          "Titre": "Since we've been this far, I suggest we avoid standard business terms here.",
          "Contenu": "I'm contacted by a member of the Support Leadership team at Nexcess, who lets me know the following: Per our procedures and to be aligned with DMCA compliance, we must act simply based on the correct formatting of the DMCA request itself which doesn't involve validating or investigating the complainant or submitter's identity. These are solely based on the formatting; there is no review or investigative work done on our end that we're required to validate the submitter.Strange enough that you care about only the formatting and would never go a little further to check some basics including the submitter's identity. It's the same to announce: everybody now please use Nexcess with a fake address, a fake name, and a fake email to SUCCESSFULLY attack your competitors hosted on Nexcess, as in my case; we don't question you as a submitter; we only target our clients. IS IT TRUE???And I'm thrown a page again about \"What should I do if I get a DMCA Takedown notice\" on DMCA official site, which says: ISP's / OSP's / Web Hosts do not have the right or responsibility to arbitrate the takedown process between parties or determine whether the takedown is valid or not. They most certainly can bring judgment as to whether the Takedown request or application is suitable, appropriate or meets the criteria set out on their website.Please note I'm not asking for arbitration this far. I'm questioning \"whether the Takedown request or application is suitable, appropriate or meets the criteria set out on their website\".Sure I find the following on Nexcess about their own \"Copyright Infringement Policy\".You request the following fields as necessary when a complainer is submitting a DMCA takedown notice:Your Full Legal Name*Your Contact Email Address*Your Contact Phone Number*Your Full Address:*The problem is: this complainer obviously didn't offer you an email address. If the email address is missing, how could you say it's complete and thus the DMCA is valid? Besides, if you don't even check the validity of these fields, then what's the point of wanting these fields as necessary in the first place?Let me say it again: the address they offered is virtual, the phone number is a prank phone number, the email is missing. SINCE YOU LIKE TO DIRECT ME TO THE OFFICIAL PAGE OF DMCA, please tell me if your vadality of the submitter is against \"They most certainly can bring judgment as to whether the Takedown request or application is suitable, appropriate or meets the criteria set out on their website.\"You told me \"Per our procedures and to be aligned with DMCA compliance, we must act simply based on the correct formatting of the DMCA request itself\".You must simply act on the correct formatting ONLY???Anyway, do you really think \"the takedown request or application is suitable, appropriate or meets the criteria set out on your own website\", with no email address, a prank a phone number or a virtual address? Please explain. I don't wanna be suggested to get back to the private mode with any of your staff members. I want a crisp explanation here. A straight explanation. Three answers to three simple questions: 1) According to DMCA official, is it true \"you must act on only the correct formatting and nothing else\"? 2) Do you really think this DMCA takedown notice, with no email address, a prank a phone number or a virtual address, meets with the statement on official DMCA site that \"bring judgment as to whether the Takedown request or application is suitable, appropriate or meets the criteria set out on their website?\"3）Do you agree you have mishandled this case due to your own negligence? You answer me, one by one as to the three questions, do what you should do to fix it and this case is over. Normally clients will do what you tell them to do and you don't wanna deal with a serious client like us. The time you spend on us is NOT economical. Your clients or potential clients, however, do consider how you fix things and solve issues."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jojo Wu",
          "Nb_Reviews": 3,
          "Date": "2020-10-11T04:28:36.000Z",
          "Titre": "Unhelpful and responsive to DMCA abuser",
          "Contenu": "I'm a customer of Nexcess for over 5 years. Now I'm very confused, cringed, disappointed, and irritated by the way Nexcess treats their customer.Here's the story. Yesterday, my website was forbidden, as a result of a DMCA by a said copyright owner.Let's say what we do. We sell oil painting copies of artworks in public domain, artworks by Van Gogh, Monet and so forth. All the artists on our website have been dead for at least 70 years, so their artworks are in public domain, for anyone to use without permission. It's American law and there's no copyright owners of such artworks, for the copyrights have expired. And according to Title 17 \"United States Code, as amended by this Act, does not provide copyright protection for any work that is in the public domain in the United States.\" It's common sense.The DMCA was apparently by competition, not the first time. Too bad, Nexcess failed to do some very basic homework, and arbitrarily forbade our website. So far, I've sent a dozen messages but were successfully ignored.Since anyone can submit a DMCA and DMCA abuses are not rare, see how easily your website may be attacked by your competition. We are running a major Adwords Campaign. Converting usually takes one week. See our loss.I want our service to be restored soonest possible! And Let's see the \"infringing images\" and how Nexcess was unhelpful and unsupportive, and lazy:Page: artists > pierre-puvis-de-chavannesPierre Puvis de Chavannes (14 December 1824 – 24 October 1898)Artist dead for over 70 yearsPage: artists > arshile-gorkyArshile Gorky (April 15, 1904 - July 21, 1948)Artist dead for over 70 yearsPage: artists > childe-hassamChilde Hassam (October 17, 1859 – August 27, 1935)Artist dead for over 70 yearsPage: artists > robert-henriRobert Henri (24 June 1865 - 12 July 1929)Artist dead for over 70 yearsPage: artists > ferdinand-hodlerFerdinand Hodler (14 March 1853 - 19 May 1918)Artist dead for over 70 yearsPage: artists > nicholas-roerichNicholas Roerich (October 9, 1874 – December 13, 1947)Artist dead for over 70 yearsPage: artists > john-frederick-kensettJohn Frederick Kensett (March 22, 1816 – December 14, 1872)Artist dead for over 70 yearsPage: collections > moise-kislingMoïse Kisling (January 22, 1891 – April 29, 1953)This is a collection page, rather than an artist page.All artworks listed under this page are not artworks by Moïse Kisling,but by artists who have been dead for over 70 years.Page: artists > albert-marquetAlbert Marquet (27 March 1875 – 14 June 1947)Artist dead for over 70 yearsPage: artists > gustave-moreauGustave Moreau (6 April 1826 – 18 April 1898)Artist dead for over 70 yearsPage: artists > berthe-morisotBerthe Marie Pauline Morisot (January 14, 1841 – March 2, 1895)Artist dead for over 70 yearsPage: artists > jules-pascinJulius Mordecai Pincas (March 31, 1885 – June 5, 1930)Artist dead for over 70 yearsPage: artists > walter-sickertWalter Richard Sickert (31 May 1860 – 22 January 1942)Artist dead for over 70 yearsPage: artists > egon-schieleEgon Schiele (12 June 1890 – 31 October 1918)Artist dead for over 70 yearsPage: artists > paul-signacPaul Victor Jules Signac (11 November 1863 – 15 August 1935)Artist dead for over 70 yearsPage: artists > alfred-sisleyAlfred Sisley (30 October 1839 – 29 January 1899)Artist dead for over 70 yearsPage: artists > chaim-soutineChaïm Soutine (13 January 1893 – 9 August 1943)Artist dead for over 70 yearsPage: artists > tom-thomsonThomas John Thomson (August 5, 1877 – July 8, 1917)Artist dead for over 70 yearsUpdated on 2020/10/11:Finally someone contacted me explaining the following: I apologize for the delay. While we do value you being a client, the content in question does need to be disabled as the DMCA is properly formatted and complete I'm afraid, and Liquid Web is also legally liable and required to ensure it's disabled.Please do use your legal team, instead of your customer service team! You are receiving many DMCA takedown notices and it's better to have a basic discernment. Not based on formatting!It's easy in our case to understand the term \"public domain\", and it's easy to check if these artworks truly belong to public domain. It takes you a few minutes. I mean it took you a few minutes to shut down our service right? Anyway, isn't public domain a very basic point a hosting company like you should know? It's such a difficult conception? Or you just won't do anything very foundemental to protect your clients from DMCA abuses? It's 2020 and It's ridiculous to claim they own the copyrights of all Egon Schiele works. Egon Schiele died in 1918! it's been over 100 years! And you believe in it and shut down our service? Restore our service as soon as possible. We're waiting."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kenneth Alvandi",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T20:38:06.000Z",
          "Titre": "Hire more experienced personnel to support your customers",
          "Contenu": "You need much more experienced system programmers to support your customer and wasting time.  i spent more 6 hours and several calls, listening to music, Nonsense responses. Until finally someone who new your system, could resolve a very simple issue.  Even one of your guys hanged up on me.Our time is as much valuable as your and we need fast response."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-26T18:50:16.000Z",
          "Titre": "I wrote my 1st ticket between 3 and 4…",
          "Contenu": "I wrote my 1st ticket between 3 and 4 weeks ago but got nowhere. I couldn't login to update my website all this time. ( Ticket: 11684321) Last week I started all over again, got far better support and the issue was resolved. Nevertheless I couldn't upload any fresh content for a couple of weeks, which was very disappointing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dissatisfied Former Customer",
          "Nb_Reviews": 2,
          "Date": "2022-06-15T23:51:39.000Z",
          "Titre": "Look elsewhere. Learn from my mistake.",
          "Contenu": "I recently moved nearly 100 hosting clients to Nexcess and I deeply regret it. There are some things Nexcess does quite well: The migration plugin is excellent, for example. The interface is strong. But the uptime is TERRIBLE, to the point where my 2-star review is probably too generous. This week alone I've had two days of repeated outages. These are known outages that they cannot seem to fix."
        },
        {
          "Note": 2,
          "Lieu": "LV",
          "Pseudo": "MZ",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T15:54:34.000Z",
          "Titre": "Not fit for sites with dynamic content",
          "Contenu": "We chose their plan when we launched our WooCommerce website, and we went for a plan which, as they promised, is fit for 3500 orders per hour. The website speed lagged from day one, even with little traffic (server response time >2-3 sec) for dynamic pages, and once there were like 50 visitors online, we ran out of PHP workers, and the website went down.Their support was helpful and reachable 24/7, but what good of it if their server infrastructure is not made for sites with dynamic content?They even suggested jumping to a better plan (more expensive), but it did not help either.We learned that Nexcess might be a good price/performance fit for static pages where you can use page caching but for sites with much dynamic content - don't fall for their promises, as you will just lose time trying to resolve them.We resolved the issue by switching to another host and have had no issues since then."
        },
        {
          "Note": 2,
          "Lieu": "CO",
          "Pseudo": "Jorge",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T17:33:34.000Z",
          "Titre": "The support by ticket is ver slow",
          "Contenu": "The support by ticket is ver slow, thake until 30 hours in give us a solution and not i am talking of big problems. Now always says that as is a futurehosting plan the they  will reach out to their team and some one will follow up with you as soon as possible. And that is hours. it is supposed that nexcess (liquidweb) bought this futurehosting company almost 3 years ago, so how come they should contact another team. The worst thing is that they take too long to respond and provide a solution.I just put a ticket (10:06 am East Time) for a problem that I can't make a backup of the public_html folder, I'll update as soon as it takes them to give me an answer to this simple request.Well, it's 12:32 am more than 2 hours and there is still no solution, they wrote to me saying that it is in the process of verification.The disagreement is that it is not only this time that there is a slow response, there have been many times, I have even had to resort to another type of support to solve it myself and I am not talking about complex problems, I am talking about simple problems, Said by those who have helped us on several occasions. When futurehosting was not part of Liquidweb, the support was excellent, they almost never took more than an hour to provide a solution, but with the change the service has gone from bad to worse. We have lost about 15 clients due to delays in solving simple failures. The contracted service is the full server managed with an extra charge for monitoring and support in third-party scripts; So it was contracted with futurehosting and when changing they never informed us of any change in the services"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frustrated in the Midwest",
          "Nb_Reviews": 1,
          "Date": "2021-10-15T14:10:04.000Z",
          "Titre": "Low cost but numerous issues",
          "Contenu": "Using Nexcess for hosting of our Magento web sites. We've had numerous technical issues none of which we caused or could solve. This has resulted in significant downtime. We never really get an answer of what the root cause was. The issues do get solved in time but I have fairly low confidence that we won't experience more issues in the future."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-04-11T00:59:23.000Z",
          "Titre": "Not ready for prime time",
          "Contenu": "Based upon previous experiences with Trustpilot and Liquid Web, I believe you're able to track these comments back to me.Therefore I refer you to my many open tickets, which I've had to create way too often.  And the \"Feedback\" page, where many others before me have made suggestions that shouldn't be considered \"feature requests\" but instead should have been part of this system from day one, which are still sitting on the list.  How many upvotes does it take to make some common-sense improvements?  At least I know I'm not the only one who is experiencing major frustration, and losing valuable time, using your portal."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rachel C.",
          "Nb_Reviews": 2,
          "Date": "2020-09-08T02:49:34.000Z",
          "Titre": "The platform is good, support is terrible",
          "Contenu": "The platform is good, and has more options than its counterpart LiquidWeb. However their support is TERRIBLE, on multiple occasions and with multiple agents. I really hope they merge their support team with LiquidWeb's as quickly as possible. I miss them already and I'm not even fully migrated over."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bill Schick",
          "Nb_Reviews": 2,
          "Date": "2021-02-23T15:36:40.000Z",
          "Titre": "Customer support has not been great",
          "Contenu": "Customer support has not been great, and basic functionality like removing a credit card (after you've added a new one) doesn't work. Sites might be fast, but we've had much better luck with customer support with hosting companies just as fast."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Prasad",
          "Nb_Reviews": 2,
          "Date": "2022-02-05T00:52:52.000Z",
          "Titre": "Extremely poor Customer Support",
          "Contenu": "Extremely poor Customer Support. Takes hours to get back a reply. Not a fan. I think I should switch my hosting provider now."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Beth Gorden",
          "Nb_Reviews": 3,
          "Date": "2021-05-13T18:35:50.000Z",
          "Titre": "Continual downtime",
          "Contenu": "Continual downtime, poor customer service, not reliable. Complained many times and finally had enough! I'd go somewhere else."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Long-Time Liquid Web Customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-19T23:07:05.371Z",
          "Titre": "First support experience not so great",
          "Contenu": "This was my first support interaction with Nexcess after being required to migrate over from Liquid Web Managed Wordpress. One of my sites went down so I used support chat. It took several minutes just to get someone to verify that the site was down. Then they asked me if I had done something to cause the outage. This was a clue that the person might not know what they are doing, because my previous experience with Liquid Web hosting was that support reps usually know more about the situation faster than I can type in a chat. It took approx 30 minutes for the rep to create a trouble ticket. I was treated as if I was an employee who should know how everything works. I was not given courtesy guidance or instruction on next steps. I had to ask what to do. I did not receive a courtesy apology like “sorry for the inconvenience.” Basically poor bedside manner. Once the site was back up, I asked why it had gone down and they said they did not know but a reboot of the server fixed it. Great. So why not just give me a button to reboot it myself? I am left having learned nothing and feeling less secure about my site’s uptime. Next time this happens I will start shopping for a new managed Wordpress provider. What happened to the kind Liquid Web support team I grew dependent on over the past 14 years? I hope this was a one-off!"
        },
        {
          "Note": 3,
          "Lieu": "PK",
          "Pseudo": "Ahsan Shabir",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T20:08:23.000Z",
          "Titre": "First of all it took 24 hours to get…",
          "Contenu": "First of all it took 24 hours to get the issue resolved. That was too long a time to resolve an issue on a live site. That is the only issue. I think 4 or 5 different people worked on the issue and then it got resolved. I believe support technicians need more training to resolve the issue quickly."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Emmanuel Olafusi",
          "Nb_Reviews": 4,
          "Date": "2023-09-26T07:18:22.000Z",
          "Titre": "Complaint response time",
          "Contenu": "The company can improve on quick response to customer’s concerns. I could not checkout my order and I contacted the customer service and it took at least 1 week before my concern was completely resolved. The good thing was that the last handler of my case resolved it within one hour. This means that there was capacity for the team to have resolved the issue promptly when it was initially raised. Weldone team."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "HamdaMiami",
          "Nb_Reviews": 3,
          "Date": "2023-06-20T18:46:20.000Z",
          "Titre": "Was better service before.",
          "Contenu": "For many years hosting server with them for my agency. Price was increased during the years but consumer service now send you to blogs instead having a person helping with simple tasks. Can be better."
        },
        {
          "Note": 3,
          "Lieu": "CO",
          "Pseudo": "Jorge",
          "Nb_Reviews": 3,
          "Date": "2023-05-03T15:06:15.000Z",
          "Titre": "the answers from the support team take…",
          "Contenu": "the answers from the support team take a long time, it has even been necessary to open a chata to ask for an answer to an open ticket.And in many cases the answers from support are very ambiguous, where they are not consistent with what is required, it seems that they do not read carefully the requirements of the ticket and they repsonden on the run.In Ticket #: 12273325, we asked for help because google does not validate a cname record created and they just said that there was a report of risky sites made by google and not by nexcess, which is completely of our knowledge, but the help from their part was never produced.really leaves much to be desired from nexcess-liquidweb support."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T19:13:37.000Z",
          "Titre": "The ticketing system is very slow",
          "Contenu": "The ticketing system is very slow.  Getting answers to questions while trying to migrate sites is wasting entire days waiting.  Also the responses are difficult to understand sometimes as the grammar in the responses can be difficult to parse."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "AlexHenri",
          "Nb_Reviews": 2,
          "Date": "2022-06-13T17:44:48.000Z",
          "Titre": "Mixed feelings",
          "Contenu": "UPDATE: I was able to get issue fixed, but it took time and effort from my side.. and maybe a review on Trustpilot to make things move. It would have took 12 days to get an appropriate answer and then they provided an adequate solution in a matter of hours and I am happy with it.I do believe Nexcess would make world better by providing more detailed information during pre-sale and purchase to avoid confusion and errors. I do not think it's fair to sell an option at $x and charge it again at $y if disabled/enabled, by mistake or not.I think, fundamentally, Nexcess is a good solution provider, but the Sales team seems to be more oriented to get new customers quickly than to take time to sell what is best for the customer.My feelings toward Nexcess are playing yo-yo. But I can now give 3 stars instead of 1.-----ORIGINAL: Price information on website wrong when buying. Hidden fees. Lack of training and knowledge for many techs. Basically, the Sales team is doing a great job, but don't expect help if something goes wrong.Long delays to get answers and depending with whom you will talk or chat, the answer might differ.Cannot TRUST the information they provide."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T18:17:14.000Z",
          "Titre": "Support has gone WAY downhill lately",
          "Contenu": "UPDATE from 1 to 3 star review:Support did come through and fix our issue after escallating (Dutch was great), and offered a resolve for future issues. For that I'm bumping up my rating from 1 star to 3 - very much appreciate that. The issues I still have are that they point the finger at the platform (ExpressionEngine) although they offer/sell ExpressionEngine hosting, and are supposed to be an offical \"partner\" - therefore there shouldn't be any \"special needs\" for EE over WordPress or Magento environments, and staff should be equally knowledeable on all platforms they tote to support. There are also still the issues that: most of their staff does't seem to be aware that there are special needs for EE environments, and that they have outdated/misleading documentation on their website (which they will point you to/misguide you to, via ticket or chat). So, while we're satisfied for now to have a resolve/work-around for when we do run into issues due to these \"special\" needs - it still isn't quite (or not yet) the same awesome hosting & support for EE that it used to be. For being a \"partner\" hosting company for ExpressionEngine, it should be fully/equally supported, online documentation should be current (or at least noted if outdated). At the least, support staff should all be aware of these \"special needs\" for EE and if/when documentation is outdated so they're not misguiding customers.Previous 1 star review:Used to absolutely LOVE nexcess and has been our preferred hosting and who we recommend to all of our clients. But as of lately, support is completely worthelss, and they've even broken a LIVE site of ours and left it that way for HOURS before it came to our attention. They used old code from your outdated docs that I had already explained broke the site, but they put it back and did not test and just left it that way - that is absolutely NOT OK! We should never have to worry about that. All support experiences lately have been pretty bad and therefore we are starting to look elsewhere, we can no longer recommend your product or services to our clients."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-11-04T11:38:41.000Z",
          "Titre": "Fixed what they broke, I guess.",
          "Contenu": "The support was good in that they fixed my problem, but I can't give more than 3 stars because the problem shouldn't have happened in the first place. My site was down during one of the busiest traffic times of the week because of their error and it took an hour to get the site back up. They didn't have a server failover or mirror or anything. Waiting on hold on the phone and on the chat for 8-10 minutes is a long time when your site is serving up a 500 error."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony Cartlidge",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:57:21.000Z",
          "Titre": "My experience",
          "Contenu": "My experience wasn't bad. However, I did lose a lot of traffic to my website because of the DNS issue. They say it has been resolved now. I changed my DNS extension to the Cloudflare extensions to secure my site. I now need to wait another 24 hours, which is becoming a problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sharna Gordon",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T04:33:35.000Z",
          "Titre": "They never give up until you're satisfied.",
          "Contenu": "It took a while, and a few emails back and forth, but in the end all my problems were taken care of. To be honest, part of the problem was that I was over my head to start, but the support team walked me through and asked the right questions. In the end I was satisfied."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Yonn",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T14:49:02.000Z",
          "Titre": "Great host for Magento",
          "Contenu": "Great host for Magento, but the pricing page lacks transparency.I expected to have a test environment and an elasticsearch container supplied with the plan I chose but that was not the case.I had to rent another server.The migration process was smooth."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Ahsan Shabir",
          "Nb_Reviews": 2,
          "Date": "2023-09-03T21:43:53.000Z",
          "Titre": "Great Wordpress hosting packages",
          "Contenu": "Great Wordpress hosting packages. Support is awesome. Migration to Nexcess is easy. Availability of great plugins specially for security. Only little issue is that there are unexpected downtimes at times. This could be due to any reasons like DDOS attacks or failure of infrastructure or failure of network. Apart from this Nexcess is great. Fully recommended."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jesse K",
          "Nb_Reviews": 3,
          "Date": "2023-08-28T13:36:16.000Z",
          "Titre": "Pretty darned good",
          "Contenu": "Pretty darned good. The website and email hosting parts of the service are excellent. Their admin portal works smoothly and logically.Bummer part: their domain name registration system. They require a separate login for updating nameservers - which doesn't go to account delegates. You can't just update nameservers in the Nexcess portal like you'd expect. It's lame. But this said, how many people actually update their nameservers? For those of us who do, all it requires is getting on with support via chat or phone and they'll handle it for me. Other than that they offer a LOT of value and a decent price. (I just wish they didn't charge for the WAF server - but $5/mo isn't the end of the world)"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T12:26:36.000Z",
          "Titre": "Rated 4/5",
          "Contenu": "Rated 4/5, the reason is object-cache-pro always overwrites when we migrate our sites. You need to chat for support for them to re-install back and licensed it. If we could move that feature to Nexcess dashboard, it would reduce the conflict in migration and easy for us to enable/disable.  Overall infrastructure is competitive as well as the pricing vs WPengine."
        },
        {
          "Note": 4,
          "Lieu": "PE",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T06:18:18.000Z",
          "Titre": "Great tech support when migrating website",
          "Contenu": "Nexcess did a site migration for our company, and there were a lot of unforeseen problems with emails and going over our disk quota. I feel like these problems should have been automatically taken care of by the migration team. I had to contact Nexcess' support a few times by phone and online, and when I did they were great at fixing the problems and getting me answers. I just wish it hadn't been necessary to contact them for support in the first place."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-07-03T15:40:59.000Z",
          "Titre": "The domain registration didn't go…",
          "Contenu": "The domain registration didn't go through but Support was instantly there from your side. Thank you for solving the issue so fast."
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Dan Li",
          "Nb_Reviews": 3,
          "Date": "2022-06-15T22:23:14.000Z",
          "Titre": "Moved to nexcess from one of the…",
          "Contenu": "Moved to nexcess from one of the largest hosting service.I use woocommerce and my last hosting service was so slow and expensive that I can't stand. Woo was very slow already, how slow? It always takes 30 sec to load a product edit page in back-end...and sometimes 20 sec to load a product page in incognito mode for customers, small store so I only had at most 20 visitors at the same timeWas paying 40usd a month for it now nexcess is crazy fast, everythings great, takes maybe 10 seconds to load edit page and doesn't make it slow for ppl to use the site in China(while my previous hosting service does, mostly Chinese visitors can't even load the site), a single product page takes 2 sec to load now, quite impressiveBut its really recommended that you at least have to hv 1 developer if you're a noob and you're doing e-commerce (I made my website all by myself from YouTube and hired a developer only very recently) because their customer service needs time, sometimes it might need a whole day to solve a simple problem , but I rather use the money I saved for hirin a developer because it's much faster and simpler.By the way I'm using the starter plan for USD$13 and the migration was free, quite a steal actually only for the performance, but again you really really really have to have your own developer.Although I think the support staffs are quite nice and mostly solve your problems in 1hr, esp Max, he really gets problems solved quickly, and nice"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Keith S",
          "Nb_Reviews": 3,
          "Date": "2023-06-28T23:59:18.000Z",
          "Titre": "Almost perfect!",
          "Contenu": "I have an ongoing error issue (it doesn't affect my site) that makes me weary and support can't seem to find a fix so the ticket remains open, that's the only reason I don't give Nexcess 5 stars, other than that I really think Nexcess is excellent."
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T17:48:12.000Z",
          "Titre": "Always quick to respond",
          "Contenu": "Always quick to respond! And helpful. Some downtime issues but most of the time is super!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joel Kennedy",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T10:11:59.000Z",
          "Titre": "It was very good and easy to use"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-05-07T00:04:13.000Z",
          "Titre": "Provided repeated replies and follow-up…",
          "Contenu": "Provided repeated replies and follow-up during the days involved to sort out multiple problems dealing with a new website, new hosting and domain difficulties, Job well done, especially Sathya."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lee",
          "Nb_Reviews": 3,
          "Date": "2022-11-24T08:17:29.000Z",
          "Titre": "I reached out with issues/questions and…",
          "Contenu": "I reached out with issues/questions and you responded with answers!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 2,
          "Date": "2022-04-15T20:05:03.000Z",
          "Titre": "Nexcess Review",
          "Contenu": "I have used Nexcess for several years now, ever since I inherited the website I currently run. Nexcess has always been very knowledgeable and help when I've run into issues that I really haven't a clue what to do with (as I said above I inherited the site, so I basically just maintain it for other's use and pray it runs well) - and Nexcess makes that happen."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robin Spindt",
          "Nb_Reviews": 3,
          "Date": "2022-04-19T18:33:49.564Z",
          "Titre": "I love Nexcess",
          "Contenu": "I have been a customer of Nexcess since 2015 and typically have such great service. I was having trouble with my I themes and it took three weeks to get it straight. It was a word press issue and just took the time to reach the right tech support to get help. Rest assured this is not typical of the service rendered by Nexcess."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "kmhdesign",
          "Nb_Reviews": 2,
          "Date": "2021-09-23T20:49:18.000Z",
          "Titre": "Early Review–but really happy with Support and Hosting Plan",
          "Contenu": "So far we are completely pleased with our hosting plan, more specifically, the technical support we've received. The support team has responded rapidly and each ticket that was opened was resolved within hours. (Probably sooner had we responded more rapidly ourselves).All in all, totally excited to have found a good hosting company and hope that things continue to run so smoothly."
        },
        {
          "Note": 4,
          "Lieu": "BG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-27T10:40:53.000Z",
          "Titre": "Had an issue when updating the PHP…",
          "Contenu": "Had an issue when updating the PHP version of my site and afterward when I tried to load a backup the Nexcess portal crashed. Customer support was helpful, although it took a bit more time than expected to revert to an older backup and bring back the old PHP version."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Canadian User",
          "Nb_Reviews": 1,
          "Date": "2021-09-09T00:08:16.000Z",
          "Titre": "Support is first class",
          "Contenu": "Nexcess was our developer's recommendation. It's kind of nerdy I suppose. I am not a huge fan of the user interface, which is poorly laid out. It's hard to find the functions you need. But support more than makes up for that and always leaves me feeling good about Nexcess."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T11:49:25.000Z",
          "Titre": "it is in order for the first experience with nexcess",
          "Contenu": "support is occasionally faster than expected"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Porter",
          "Nb_Reviews": 1,
          "Date": "2020-05-01T12:30:43.000Z",
          "Titre": "I love Nexcess",
          "Contenu": "I love Nexcess. Support is fantastic, and security is truly top notch. I love that account setup is still a manual thing, and that sites are vetted to make sure they're a good fit. What keeps my review from being a full 5 stars is the storage limits on the EEP 100 plan. 10 GB is not much space for web and email. Email is also a bit of a challenge to connect to unless you're an IT person. Have you considered an option for third-party email hosting to separate the email storage from the account limits? We used to use EngineHosting, which used Rackspace to handle emails. Just a thought. Still, I'd recommend and have recommended Nexcess to many people. Y'all keep up the stellar work!"
        },
        {
          "Note": 4,
          "Lieu": "CN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T10:06:14.000Z",
          "Titre": "fast reply",
          "Contenu": "fast reply. and fixed our problem in one day! well done."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-07T22:19:09.000Z",
          "Titre": "Other than support with getting Outlook…",
          "Contenu": "Other than support with getting Outlook to receive email with the new host's settings, all other support has been top-notch."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-05-16T07:06:34.000Z",
          "Titre": "Very friendly and helpful!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-14T19:26:39.000Z",
          "Titre": "Good support",
          "Contenu": "Good support, would have been nice if they explained how they generated the spf record so I could do it in the future."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "stephane",
          "Nb_Reviews": 2,
          "Date": "2020-05-08T15:40:39.000Z",
          "Titre": "Nexcess is in my opinion my favorite…",
          "Contenu": "Nexcess is in my opinion my favorite hoster.The only thing i was disapointend by was to not have reseller plan."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T20:17:06.000Z",
          "Titre": "I was so relieved that someone answered…",
          "Contenu": "I was so relieved that someone answered the phone when I called to get support to have my website runs efficiently.  The agent was patiently listening to me.  I wasn't sure how to explain what I needed, but she gently asked me for two pieces of information.  When she couldn't complete the task because it needed another department to hand that step.  She asked me to send in a ticket.  By the time the ticket got there another agent took it and emailed me to reassure me they will handle it.  When he was done, he sent me another email to confirm and explained my next step.  Thank you soooo much for mitigating my anxiety!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T21:23:16.000Z",
          "Titre": "Overall it was a great experience",
          "Contenu": "Overall it was a great experience.  The only issue is that were changes were supposed to stay dormant until approved, and then released to the live site.....and the changes went live as they were done (not sure what happened there).  They did work hard to ensure everything we wanted was changed and on very short notice!  I really appreciated their services!  As someone that couldn't make the changes myself I am super thankful."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sundial Training Resources",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:08:40.000Z",
          "Titre": "Excellent level of support",
          "Contenu": "Excellent level of support.  Fast response and good information.  Very happy with Nexcess hosting so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dynics",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:04:01.000Z",
          "Titre": "Quick and Responsive Support",
          "Contenu": "Quick and Responsive SupportMy request was handled quickly by the tech team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RayJ",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T09:22:20.000Z",
          "Titre": "My issue was understood and corrected…",
          "Contenu": "My issue was understood and corrected quickly. Staff was very professional. And polite. Well done!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Gavin.K",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T02:03:32.000Z",
          "Titre": "Great web hosting solutions and fantastic support team",
          "Contenu": "In addition to have to notch infrastructures and great solutions for hosting your website(s) at a very reasonable price, Nexcess has the best support team I have ever had to deal with in the server and web hosting industry."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J. Singer",
          "Nb_Reviews": 3,
          "Date": "2023-11-15T07:58:01.000Z",
          "Titre": "Excellent Tech Support!!!",
          "Contenu": "Happy to leave you a good review.Your super power is great customer service.  That sets you apart from many competitors.Having great tech support is a big investment for any business.  But it is the one area where companies can differentiate themselves - which drives customer loyalty.Customers are growing tired of endless shiny new features (many of which don't work).  But they never tire of great support from real people."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vicki-Nampa,ID",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T06:57:55.000Z",
          "Titre": "Easy domain purchase with Nexcess.",
          "Contenu": "Just bought a domain from Nexcess. The purchase process was quick and easy. No glitches!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Compribene srl",
          "Nb_Reviews": 4,
          "Date": "2023-11-19T21:09:21.000Z",
          "Titre": "I recommend Nexcess a reliable company",
          "Contenu": "I have been working with them for 3 years, I must say that the technical support guys always work hard to solve the problems that are reported to them. Sometimes the answers arrive a little late, but they are human and sometimes they will certainly have many tickets to handle.I recommend this company because I find commitment, competence and courtesy."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mike",
          "Nb_Reviews": 8,
          "Date": "2023-12-20T19:25:08.000Z",
          "Titre": "Quick and helpful response",
          "Contenu": "Quick, clear, and effective."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Elan multimedia",
          "Nb_Reviews": 5,
          "Date": "2023-11-10T01:35:15.000Z",
          "Titre": "Reliable and Trusted Hosting: 12 Years of Exceptional Service with Nexcess.net",
          "Contenu": "I have hosted the majority of my client's websites at Nexcess.net for 12 years.  Their customer service is par none. They have become a technical partner that I can rely on.  Highly recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Creative",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T21:20:55.000Z",
          "Titre": "A True Partner",
          "Contenu": "I am a graphic designer for print and web. I'm skilled at building websites and providing my clients with the functionality that they want/need. My expertise in how a server works or technical aspects of hosting so finding a trusted partner in that area is of utmost importance. My need is for someone who will actually fix the problems, not just tell me how I can do it myself.  Nexcess has continuously provided that service for me. The majority of the support techs do exactly what I need them to do. Been a customer for over 10 years and I don't have any plans on changing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:04:29.000Z",
          "Titre": "Very quick response and action",
          "Contenu": "Very quick response and action, solved the problem in first try. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Marcelo Pereira Tomaz",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T22:50:24.000Z",
          "Titre": "I just have to thank Nexcess.",
          "Contenu": "I just have to thank Nexcess.A wonderful hosting company that truly exists to help customers.They always carry out with excellence all necessary technical requests, which are often urgent and desperate.Once again I say that I only have Nexcess to thank.Thank you for existing.Yours sincerely,Marcelo Pereira TomazCo-founderIMOVELSEARCH (THE RIGHT SEARCH)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Esther",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T16:18:37.000Z",
          "Titre": "Always a helpful lot",
          "Contenu": "They've always been prompt, courteous, customer service technicians! They assist you with your issues and always check up to see if it all worked out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cooperative Network",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T19:00:40.000Z",
          "Titre": "The support staff was extremely helpful!"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "D Murphy",
          "Nb_Reviews": 5,
          "Date": "2023-12-14T20:48:46.000Z",
          "Titre": "Great support as usual",
          "Contenu": "Great support as usual, fast, friendly and professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T17:17:08.000Z",
          "Titre": "Restore issue",
          "Contenu": "Restore was done by Dylan and he provided more support than what I've expected as well as the other team who've handled this ticket."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "dmccabe",
          "Nb_Reviews": 4,
          "Date": "2023-12-15T04:31:02.000Z",
          "Titre": "Quick support",
          "Contenu": "Very quick tech support on the ticket."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Fred Greaves",
          "Nb_Reviews": 11,
          "Date": "2023-10-26T09:03:48.000Z",
          "Titre": "Great customer service and great value…",
          "Contenu": "Great customer service and great value for money, Nexcess staff will go the extra mile to ensure your server is running and performing to 100%.Thanks Fred4x4"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Karen Johnson",
          "Nb_Reviews": 3,
          "Date": "2023-10-11T06:10:56.000Z",
          "Titre": "Nexcess is streaks above any other…",
          "Contenu": "Nexcess is streaks above any other hosting I've tried. The pricing is slightly more than the cheaper options, but it's worth every penny.1. Auto-scaling is a life saver for me. All other hosting I've tried just take my site offline. Nexcess gives me 24 hours free auto-scaling. I never use more than 2 hours even on the busiest month, but even if the site is down for a minute you can lose so much business and it adds up.2. The support is always super helpful, friendly, professional and almost instantaneous. They go out of their way to help to implement things that other hosting won't. 3. Their management always steps in immediately to resolve any negative feedback.4. They don't have cPanel so it was a learning curve, but now I love their dashboard. And ftp credentials are easily accessible.5. Backups, restores and staging sites are so simple to manage.5. Having a built-in CDN is so convenient.6. Free Astra Pro plus other special offers included.7. And super fast!Thank you so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BAM",
          "Nb_Reviews": 2,
          "Date": "2023-10-04T23:26:28.000Z",
          "Titre": "Premium Tech Support Agent",
          "Contenu": "Premium Tech Support Agent. There are times when you meet good tech support and time when you meet bad tech support. However on a rare occasion you run into a Tech support agent who goes beyond their call of duty.  Swathi Arjun is one of those agents.  Agents like Swathi is the reason I still do business with Nexcess!"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "JurgenM",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T11:40:14.000Z",
          "Titre": "My Website was down and the Nexcess…",
          "Contenu": "My Website was down and the Nexcess team helped very professionally and quick to restore it and have it working again within a few hours."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chas thevideobeat.com",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T19:29:12.000Z",
          "Titre": "My issue didn't get resolved..",
          "Contenu": "My issue didn't get resolved... but your support professional Mike James was outstanding.  Please give him a bonus and raise.  He deserves it.  You need more people like Mike in customer facing roles."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Ricardo Martins",
          "Nb_Reviews": 4,
          "Date": "2023-10-17T00:06:18.000Z",
          "Titre": "Awesome support",
          "Contenu": "Awesome support, and reliable service.I'm their customer for 5+ years, and 9+ years when I worked with an agency that used their services.Great Magento hosting."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-22T12:47:45.000Z",
          "Titre": "Prompt assistance when needed..",
          "Contenu": "Thankfully tech support isn’t needed that often, but when it is it’s always swift and comprehensive.   Very grateful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T16:14:02.000Z",
          "Titre": "I was extremely surprised how fast they respond",
          "Contenu": "I was extremely surprised how fast they responded to my small request via email (as in 30 to 40 minutes or less).  They then took the initiative to start troubleshooting right away and sent several emails as to the status of their troubleshooting and if they needed additional info for their troubleshooting,  they would let me know right away.  That's extremely important especially if your site is down and your losing thousands per hour.  In my case, my site was initially down and then my email after they setup my site.   Monetary wise, it didn't affect me since I'm in the initial stages of setting up my business but once I get to the selling stage, I can count on there email support.  I do recall using the chat/phone support last year when deciding who I should use as my host and they answered right away and were extremely informative.   I suppose I would get faster service via chat/phone.  Either way, whether email, phone, or chat, they are extremely prompt in getting you the help you need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SwedeBro",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T15:25:12.000Z",
          "Titre": "My experience didn't start out great",
          "Contenu": "My experience didn't start out great. Whoever saw our ticket closed it without reading it. They called it spam, even though we used the same Subject in the ticket for several other tickets.We have the Word Press option with Nexcess and we cannot setup our own out of office replies. So, the person who read the initial ticket closed it without examining the ticket.This has happened before...so, we have to check to make sure Nexcess actually helped us or ignored us.But, when I called Zac was very helpful and apologetic for the situation and created out of office reply immediately...Great work by Zac and poor work by Management at Nexcess in communicating to their Help Desk that some accounts cannot create their own out of office replies...Why we can't is another issue altogether."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Serena Z.",
          "Nb_Reviews": 3,
          "Date": "2023-07-13T16:55:00.000Z",
          "Titre": "Website faster and bank account balance higher.",
          "Contenu": "This host has not only made my website SUPER FAST (it loads instantly), but the support team is quick to respond (under 30 minutes ) to tickets, and they are kind and helpful. That is important to a newbie like me that has a lot of questions. Some, I'm sure, that are a little exasperating for them. Great host. Great speed. Great price. Tons of extras (premium services and plugins) included. And great support. I highly recommend Nexcess."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle A.",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T19:50:38.000Z",
          "Titre": "Glad we made the move to Nexcess",
          "Contenu": "Glad we made the move to Nexcess!  I called and spoke with a technician within minutes. The technician answered my all of my questions and provided support to complete a successful transfer of our web sites over to Nexcess. Thank you Allen V."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Elena",
          "Nb_Reviews": 2,
          "Date": "2023-05-11T10:24:01.000Z",
          "Titre": "My issue resolved",
          "Contenu": "My issue resolved! I'm a Future Hosting customer since 2014 and continued with Nexcess. Overall I don't have problems which means Hosting is good. I'm assisted by MA Future Hosting support whenever I need something and I have the feeling that the quality of support has been improved a lot since last year."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Boutwell",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T03:45:40.000Z",
          "Titre": "The team is excellent",
          "Contenu": "The team is excellent. I’m an old customer turned new customer… and I look for to growing my business with this company, once more. I was originally with Liquid Web back in 2015. I’ve returned for second to none support and professional staff. Basically, it’s flawless and I’m appreciative!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam Frederick (WebWise)",
          "Nb_Reviews": 2,
          "Date": "2023-07-20T15:50:46.000Z",
          "Titre": "Tech Support Goes Above and Beyond",
          "Contenu": "I have always appreciated Nexcess's helpful support and usually only contact them for server-specific issues. I ran into a WordPress issue/conflict that I wasn't sure was software or server environment, so I contacted Nexcess for help.The tech Jay was amazing.  Not only did he work to reproduce the issue, but he dug into what was causing it and fixed the conflict for me!Many companies, as soon as they see it isn't a problem with their service will push you to someone else, which they easily could have done.  But instead, Jay took ownership of the problem to help me out.This is why I have been a client of LiquidWeb/Nexcess for over 20 years and will continue to grow with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark H",
          "Nb_Reviews": 2,
          "Date": "2023-08-02T14:42:56.000Z",
          "Titre": "Really fast response time and solution",
          "Contenu": "Really fast response time and the problem was resolved correctly.       The only critique I have is  I am not sure how to  classify the problem correctly on the ticket form, (There was not a category that seemed to fit my issue).    Perhaps there should be on the form an option for \"Other\""
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Lucinda Flynn",
          "Nb_Reviews": 4,
          "Date": "2023-04-17T09:10:56.000Z",
          "Titre": "Help was provided fast that solved my issue",
          "Contenu": "I made some changes to the DNS settings that I thought were right but as I am a layperson, not a developer, I asked Nexcess to check what I had done - they checked and made some adjustments, which then meant the validation worked perfectly. It saved me a lot of stress knowing I could ask for help and it came so fast!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "G Morris",
          "Nb_Reviews": 2,
          "Date": "2023-05-16T14:47:03.000Z",
          "Titre": "Longtime Customer of Nexcess",
          "Contenu": "I have been a customer with Nexcess for more than 5 years. I was originally with Future Hosting then they were taken over by Nexcess. The main reason for staying with any host is reliability and uptime. Nexcess is the most reliable hosting service I have used. Ticketed support is good - sometimes you do have to explain the situations all over again when a new support operative takes over - but this is actually standard with most services I use. Any issues I have are always resolved quickly."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Prahlad Prajapati",
          "Nb_Reviews": 6,
          "Date": "2023-03-03T17:12:39.000Z",
          "Titre": "Recently used Nexcess with no issues",
          "Contenu": "Recently used Nexcess with no issues. Managed hosting is usually more expensive, but it's definitely better. if you're looking for Super Fast speed, then that's what they specialize in. Things I like about Nexcess is managed and Free Service and support are excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beckie",
          "Nb_Reviews": 2,
          "Date": "2023-02-22T23:06:25.000Z",
          "Titre": "Super helpful php update",
          "Contenu": "I needed to update my php and called about 6 months ago about it and also about not being able to access my siteworx anymore.  The information I got then was terrible and I put off calling back because it seemed like such a hassle according to the first person I talked with.  This time, Dylan was so helpful, and explained to me that my plan only needed to be accessed through the portal and that my siteworx was discontinued!  I had no idea...  Likewise, he walked me through updating my php and followed up with written directions for when I need to do it again.  All super helpful."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Kenzel",
          "Nb_Reviews": 2,
          "Date": "2023-06-17T13:34:20.000Z",
          "Titre": "My website was hacked",
          "Contenu": "My website was hacked, and Nexccess daily malware scans first warned me, and when checked I noticed my woocommerce website had been modified probably to steal my users info. Their developer team are the best, restored my old backup, thanks to their 30 days backup policy. Then scanned the whole website once more. And let me know in every step. Thanks for the great help. Really happy working with Nexcess."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T19:15:12.000Z",
          "Titre": "Nexcess support went above and beyond…",
          "Contenu": "Nexcess support went above and beyond to help reconcile my domain registration issue. Very supportive and helpful team. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stacy",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T23:21:09.000Z",
          "Titre": "HIGHLY RECOMMEND",
          "Contenu": "All of the Nexcess employees are extremely helpful and quick to respond to every issue I have thrown at them. Rithesh Kulal helped me on my most recent issue and went a step beyond what I was even asking for. I would recommend them to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T19:20:26.000Z",
          "Titre": "Super helpful",
          "Contenu": "Every time I need assistance from Nexcess they always go above and beyond in their help and what I expect from a hosting provider. I wouldn't host my web sites anywhere else."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy Customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T01:10:58.000Z",
          "Titre": "Awesome",
          "Contenu": "\"My\" Experiences have so far been helpful and always available, haven't let me down yet! Most importantly to \"me\", tech support is fast and have always been friendly, polite, an never felt rushed or condescending. I would/wll definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carl Bunin",
          "Nb_Reviews": 1,
          "Date": "2023-03-25T18:02:42.000Z",
          "Titre": "SUPPORT for small user.",
          "Contenu": "I am a small user but happy to spend a bit more to get such one on one support on the phone with a real PERSON! Issues are also integrated with easily accessed support tickets. They have proven to me that after hosting 2 websites and numerous email accounts for 15 or so years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lance Bundy",
          "Nb_Reviews": 2,
          "Date": "2023-07-08T23:27:00.000Z",
          "Titre": "Support was timely and took great attention to detail.",
          "Contenu": "Having Max Sallam on our ticket was a very professional experience which is a good change of pace because not all the reps are.  He took very careful attention to detail of our needs and executed perfectly.  It was a great experience this time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T20:13:46.000Z",
          "Titre": "Nexcess support when it's needed!",
          "Contenu": "Nexcess has excellent support (when it's needed)!  Usually the support team is contacted at the moment it is absolutely necessary and sometimes the wait is brutal ... lol.  Not with Nexcess - the support team seems to get right back with answers, advice or instruction."
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T23:16:22.000Z",
          "Titre": "investigated it...solved it... ready to go",
          "Contenu": "I was checking about the reason made the site down, and James investigated and discovered that the issue was happening in a regular bases and for the same reason, the data usage is much higher than the usual. and he could solve the issue. it's appreciated."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Bolt and Nut Australia",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T04:52:58.000Z",
          "Titre": "Response time was exceptional.",
          "Contenu": "Our site was unstable, within a few minutes I lodged a support ticket and James replied with clear, precise answers that I could understand, and the problem was resolved. Brilliant service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T17:55:07.000Z",
          "Titre": "The fastest and most courteous service…",
          "Contenu": "The fastest and most courteous service I have had to date really thank you for everything the best company I have worked with with amazing customer service"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "WEM",
          "Nb_Reviews": 2,
          "Date": "2023-07-04T18:26:29.000Z",
          "Titre": "we are customer for 10 years and...",
          "Contenu": "we are customer for 10 years, first with Future Hosting and now with Nexcess. What to say about these guys? in 10 years they never ever let me down. Fair price, good products, unrivalled assistance"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T22:50:11.000Z",
          "Titre": "Speedy response",
          "Contenu": "Speedy response - very helpful - resolved issue quickly - friendly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregg Sutter",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T02:24:52.000Z",
          "Titre": "403 error problem solved",
          "Contenu": "I was able to give Stan very precise data on the problem I was having with 403 errors in one archive folder.  H was able to find the problem, a second .htaccess file.  He commented out some problematic code and the problem was solved.  I would never have thought to look in the folder itself for a second htaccess file."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tanner Maasen",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T04:00:33.000Z",
          "Titre": "Max is the man!",
          "Contenu": "Max is one of the most helpful support technicians I've ever spoken with. He helped me with any and all questions I had and was simply a joy to talk with. He wrote up a summary of our call and emailed it to me, which is very unique from my experience and helpful in case I ever have to go back into the same or similar, I can see what we did. Very high level of professionalism. Well done!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenny Harle",
          "Nb_Reviews": 3,
          "Date": "2023-03-24T23:14:04.000Z",
          "Titre": "Best Web Host for Customer Service & Support",
          "Contenu": "I'm an independent Web Developer and my clients are always looking for reliable and affordable hosting. I have been using and recommending Nexcess for over 10 years. I wear a lot of hats from day to day, and when I have to put on my \"server administrator\" hat I can easily get in over my head - but Nexcess support always, always has my back in a responsive, friendly and supportive way. They are absolutely the best."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T11:10:59.000Z",
          "Titre": "Very quick support",
          "Contenu": "Very quick support. Life saviour."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Buccieri",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T15:09:35.000Z",
          "Titre": "\"Exceptional Hosting Experience with Nexcess.net\"",
          "Contenu": "My recent experience with Nexcess.net was truly wonderful. Their impeccable customer support provided quick and effective solutions to my website hosting issues. The service's reliability and user-friendly interface made managing my site a breeze. Nexcess.net exceeded my expectations and has earned my trust as a top-notch hosting provider for our e-commerace business asaplinen.com"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Healthcare4all",
          "Nb_Reviews": 5,
          "Date": "2023-05-24T23:50:36.000Z",
          "Titre": "Fantastic customer service",
          "Contenu": "Fantastic customer service, rapid replies, and extremely helpful. They go out of their way to resolve any issues, and I feel like they're part of our website team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe U.",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T00:16:38.000Z",
          "Titre": "I had a great experience…",
          "Contenu": "I had a great experience working with Nexcess Support Team during my website hosting migration. They were knowledgeable, professional, and fast. I felt like in every interaction they were trying to go the extra mile to make sure I was happy and my project was completed without issues. It was an overall great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ursala Garbrecht, Resume Horse",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T19:58:44.000Z",
          "Titre": "Levels of customer service",
          "Contenu": "When I wasn't able to complete the steps to set up a staging environment due to really outdated code in my existing site, the team at Nexcess set it up for me. I appreciate the next level of customer support and it shows the value of this platform to meet my various hosting needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aj",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T02:03:04.000Z",
          "Titre": "Unmatched",
          "Contenu": "I host a site on Nexcess with an annual visitor rate of 1.5 million users and the service and quality is unmatched. I love that I can call at any time and get highly informed and caring support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T21:25:47.000Z",
          "Titre": "Special thanks to Max and his team",
          "Contenu": "Special thanks to Max and his team, for taking the time to help out with an issue that was a challenge for us.The support crew is outstanding and highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Farrell",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T04:38:38.000Z",
          "Titre": "I need Team of Max's",
          "Contenu": "Max Sallam is one of the best support techs I've ever encountered. Honest, straight to the point and very responsible. Helped us work through our issue with speed and professionalism. Wish I had a team of Max's."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leonard Sloan",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T19:38:40.000Z",
          "Titre": "Nexcess is truly a professional organization",
          "Contenu": "Nexcess is truly a professional and caring hosting company that gets the job done and helps even the uninformed like myself.You went the extra two miles to help me.Thanks."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "M Binda",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T15:50:43.000Z",
          "Titre": "Fast, spot on late night support",
          "Contenu": "I needed support late at night and got a response within a couple of minutes and a short while later the issue was handled for me. What else could I want."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Martin ACCYPN Secretariat",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T13:14:22.000Z",
          "Titre": "Quick honest service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "happy_customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T01:21:54.000Z",
          "Titre": "expert suport!",
          "Contenu": "the support tech handled my case expertly and I am very pleased with the result. wordpress is frustrating to say the least, and as a new customer I am happy to know this type of support is available,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beth",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T02:27:16.000Z",
          "Titre": "We migrated our website to another plan within Nexcess",
          "Contenu": "We migrated our website to another server with Nexcess. We've been with them for years but it was time to change our plan. We found the tech guy, Stanley, to be helpful on a Saturday morning when we ran into a glitch with our database. I was able to get my web guy on the phone with him and the issue was fixed within a half hour. They also extended my old plan for two weeks in case we had issues with the migration. And, they did not bill for the extra two weeks. That gave me comfort in case we came across more issues. There service has been top notch. Great people to work with."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Neath RFC",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T09:00:06.000Z",
          "Titre": "Very prompt and helpful technical…",
          "Contenu": "Very prompt and helpful technical support.A class company. Assisted in recovering one our sites from backups very promtly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bo",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T07:23:34.000Z",
          "Titre": "It took about one hour after contacting…",
          "Contenu": "It took about one hour after contacting support to get my problem solved which I thought was very good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doreen B.",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T17:02:30.000Z",
          "Titre": "Support Team is great!",
          "Contenu": "Very prompt professional responses from all Support Staff members. I'm so glad we switched to Nexcess as our hosting provider!"
        },
        {
          "Note": 5,
          "Lieu": "CL",
          "Pseudo": "Rodrigo Pooley",
          "Nb_Reviews": 3,
          "Date": "2023-10-11T16:18:27.000Z",
          "Titre": "A Standout Solution for Magento 2: My Experience with Nexcess",
          "Contenu": "As the owner of an online store built on Magento 2, finding the right web hosting has been crucial to the success of my business. After researching and testing various options, I can confidently say that Nexcess is the perfect choice for any online store owner using Magento 2.What sets Nexcess apart is their specialized focus on hosting e-commerce platforms. The performance of my store has been nothing short of exceptional. Pages load swiftly, and response times are snappy, significantly enhancing my customers' shopping experience.Nexcess's scalability has been a lifesaver for my growing business. As my store has gained popularity, I've been able to seamlessly upgrade my hosting plan. This flexibility gives me the confidence that Nexcess will grow alongside my business.Security is a top priority for me, and Nexcess does not disappoint in this regard. Their advanced security measures, including firewalls and constant monitoring, provide me with peace of mind knowing that my store is shielded against cyber threats.Nexcess's technical support deserves a special mention. Their team is highly competent and always ready to assist with any hosting-related issues or queries. Knowing that I have a reliable team at my disposal is invaluable.In summary, my experience with Nexcess has been extraordinary. If you're an online store owner using Magento 2, I cannot recommend Nexcess enough. Their specialized approach, outstanding performance, and exceptional customer care make it the obvious choice. Thanks to Nexcess, my store has reached new levels of success, and I'm excited for what the future holds."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Chams",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T05:48:43.000Z",
          "Titre": "Technical support 5 ⭐️",
          "Contenu": "Great service all time, issue fixes in the minute, staff well qualified and friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lori",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T20:17:09.000Z",
          "Titre": "Support was very kind and helpful!"
        },
        {
          "Note": 5,
          "Lieu": "CN",
          "Pseudo": "Gavin Hawk",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T05:14:45.000Z",
          "Titre": "Nexcess means reliable",
          "Contenu": "It's wise to choose Nexcess as they supply you with a turnkey service, you never worry about any critical issues, what you need to do just send a ticket to the powerful support team."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Calvin",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T02:08:14.000Z",
          "Titre": "Derrick from Nexus is a smart guy",
          "Contenu": "Our website went down and Derrick from Nexus took a look at it and had it up and running in a few moments… smart guy👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-25T20:42:18.000Z",
          "Titre": "New but loving Nexcess!",
          "Contenu": "I am a relatively new users on Nexcess and already, the support has been great. The performance of the websites has also been great and all at a great price point!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Culligan Quality Water of NCO",
          "Nb_Reviews": 2,
          "Date": "2023-04-27T16:47:56.000Z",
          "Titre": "Top notch, effective and trained staff",
          "Contenu": "As has been the case time and time again, the service from Nexcess is outstanding.  They answer quickly and have resolved issues professionally."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Hennie - Server Warehouse",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T13:56:43.000Z",
          "Titre": "Explained my issue once when the ticket…",
          "Contenu": "Explained my issue once when the ticket was created and next moment problem I struggled with for 3 days was sorted in 15 minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don Mwskie",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T22:05:45.000Z",
          "Titre": "Excellent service",
          "Contenu": "As usual, I received courteous and fast service. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 3,
          "Date": "2023-08-28T22:42:00.000Z",
          "Titre": "Support was helpful in restoring a…",
          "Contenu": "Support was helpful in restoring a backup point for us while troubleshooting a client website."
        },
        {
          "Note": 5,
          "Lieu": "UY",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T15:18:54.000Z",
          "Titre": "The ticket response was fast!",
          "Contenu": "The ticket response was fast!After sending some information, they understood the issue and quickly applied a new setting in order to help me solve my problem"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 3,
          "Date": "2023-04-23T18:50:52.000Z",
          "Titre": "Both times I called Tech support they…",
          "Contenu": "Both times I called Tech support they were great.  The understood what I needed help with and was able to resolve both issues very fast while I was on the phone with them.  I’m very happy with the level of customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HM",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T16:56:41.000Z",
          "Titre": "Frank was GREAT!",
          "Contenu": "Okay, you asked! I first called your help line with my email problem and was told I had no email account in Nexcess. After I described my problem he just blew me off. I have dealt with CSR's before and did not take his lack of care and ability personally. I simply re-dialed your help number. I reached Frank. He listened to my problem, email bounce-back, asked for the message I received about the bounce and went to work. A few minutes later he told me about the change he made in my email set up. About 4 hours later I received an email from Frank making sure all was well. He was a terrific person to work with! Thank you for great service."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Adeel",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T20:32:10.000Z",
          "Titre": "Great services and support",
          "Contenu": "Great services and support. I'll recommend everyone to buy hosting from Nexcess to enjoy fully managed Wordpress and Magento hosting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt S.",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T23:56:40.000Z",
          "Titre": "Fast, Efficient, and Expert Support.",
          "Contenu": "Fast, efficient, and expert support. I continue to be extremely please with my decision to migrate my WP sites to Nexcess!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T18:38:05.000Z",
          "Titre": "My questions were answered promptly and…",
          "Contenu": "My questions were answered promptly and in a manner that I was able to complete my conversion work timely."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Grace",
          "Nb_Reviews": 2,
          "Date": "2023-03-24T06:55:16.000Z",
          "Titre": "Fixed - a fast and friendly service.",
          "Contenu": "Tech support answered the phone quickly, were very polite, listened to my problem, fixed it, explained what they did and why. Can't ask for any better than that.David"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KDH",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T22:42:53.000Z",
          "Titre": "Betting My Money on NEXCESS Hostings",
          "Contenu": "Very supportive technical services in hosting multiple sites-under reliable plan options.  Every ticket submitted has brought back positive responses in servicing sites hosting needs.  Technical Supporter- MAX S., was services above the call-of-duty responses sought.  This technician was cordial, instructive, and a great salesperson for the hosting guidance of NEXCESS company's offerings."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TERRY TURZYNSKI",
          "Nb_Reviews": 3,
          "Date": "2023-03-20T20:43:37.000Z",
          "Titre": "The problem was solved with no hassel.",
          "Contenu": "Nexcess support team is really on the ball. Excellent fast support service. The problem was solved with no hassle."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy R",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T14:11:03.000Z",
          "Titre": "Fast, thoughtful and accurate customer service",
          "Contenu": "Fast replies, never have had such responsive customer support with any hosting company."
        },
        {
          "Note": 5,
          "Lieu": "SK",
          "Pseudo": "Marián Moravčík",
          "Nb_Reviews": 2,
          "Date": "2023-05-08T16:01:42.000Z",
          "Titre": "Very good experience during a site being transferred",
          "Contenu": "I have applied for transfer of hosting from an existing shared one to Spark plan of Nexcess. The process was performed exactly as described in the documentation, and the staff was very communicative, professional and helpful. This experience largely increased my confidence to Nexcess as my new hosting provider."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lon Swonger",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T13:05:13.000Z",
          "Titre": "Fast response time to my request for…",
          "Contenu": "Fast response time to my request for support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T03:00:21.000Z",
          "Titre": "My rep was so helpful and patient",
          "Contenu": "My rep was so helpful and patient. He walked me through my questions and eased my nerves. He never was frustrated and solved my problems and questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce",
          "Nb_Reviews": 2,
          "Date": "2023-05-03T21:52:11.000Z",
          "Titre": "Stan was great in helping me solve my…",
          "Contenu": "Stan was great in helping me solve my problem with the proper email setting on the server."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CannabisSeniors.org",
          "Nb_Reviews": 4,
          "Date": "2023-06-01T15:36:43.000Z",
          "Titre": "Consistently great service supported by…",
          "Contenu": "Consistently great service supported by great and caring tech staff! Nexcess is the real deal!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erick",
          "Nb_Reviews": 5,
          "Date": "2023-08-03T20:12:33.000Z",
          "Titre": "Nexcess support is the best of the…",
          "Contenu": "Nexcess support is the best of the best! They know how to resolve everything and not only that but efficiently! It was the best move I've made for my company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Taylor",
          "Nb_Reviews": 3,
          "Date": "2023-07-07T01:48:04.000Z",
          "Titre": "Even with getting disconnected",
          "Contenu": "Even with getting disconnected, I was able to get cohesive complete service from the two people that took care of me outstanding"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nexcess Customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T16:30:00.000Z",
          "Titre": "Timely and thorough!",
          "Contenu": "Mike was great. His responses were quick and very thorough. Much appreciated!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T04:41:51.000Z",
          "Titre": "Your staff fixed the issue straight…",
          "Contenu": "Your staff fixed the issue straight away and then did some discovery on how to fix the long term ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T04:04:00.000Z",
          "Titre": "Communication was easy",
          "Contenu": "Communication was easy, and the solution took very little time"
        }
      ]
    }
  ]
}