{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "ninjacators.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T00:17:56.000Z",
          "Titre": "No follow-up and no communication I am lost",
          "Contenu": "Last week I ordered one of your programs order number 140108. I did get the receipt in the email but nothing else I don't know what to do I don't know where the product is and my bank has been charged 444. I called the helpline about four or five times and no one is ever available that is to say I never talk to a human I've left messages but there's no follow-up"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jeff Sopatyk",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T20:21:37.000Z",
          "Titre": "Terrible support and video instructions ..",
          "Contenu": "Instruction videos were very poor and did not properly explain ID indicator start up. Called support phone number over several days and no return call. Called"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Ayers",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T20:27:29.000Z",
          "Titre": "Waste your money on this company. The love it!",
          "Contenu": "I have sent this company an inquiry before purchasing their product specifically Price Flow Pro at $1497.  I not only sent 1 inquiry, I sent them 3 inquiries staged 3 days apart from each other.  Their reply is they will get back to me shortly.  I think I deserve a respectful reply before throwing that amount of money towards their product but they must be focusing on people who just enjoy throwing money at them without doing research.  If you're money conscious, I advise you to stay away from these people.  If you enjoy throwing money to a company that shows not respect for you but loves your careless toss of money, their bucket is wide open for you."
        },
        {
          "Note": 1,
          "Pseudo": "Mark Ayers",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T15:10:17.000Z",
          "Titre": "Waste your money on this company. The love it!",
          "Contenu": "I have sent this company an inquiry before purchasing their product specifically Price Flow Pro at $1497. I not only sent 1 inquiry, I sent them 3 inquiries staged 3 days apart from each other. Their reply is they will get back to me shortly. I think I deserve a respectful reply before throwing that amount of money towards their product but they must be focusing on people who just enjoy throwing money at them without doing research. If you're money conscious, I advise you to stay away from these people. If you enjoy throwing money to a company that shows not respect for you but loves your careless toss of money, their bucket is wide open for you.Your last response was that you assured me that you did respond with various solutions.....well, here's where I call you out to show the audience your true colors:  Provide the documentation that you replied back to my 3 inquiries and display all your possible solutions you supposedly gave me and I will rescind my complaint.  I expect a respectful reply but when you treat a potential customer like garbage with no reply at all, I have the respect for other people to advise them not to waste their money on NC.  Your claim that you gave me various solutions is an outright lie.  Goodness, you are a prime candidate for president with your false comments.  Stay tuned folks to see what this company is made of..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "George S",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T15:35:14.000Z",
          "Titre": "Don’t not give ninjacators your money!",
          "Contenu": "Don’t not give ninjacators your money!Reply: The indicators are amateur, and the ones that seem to be good don't load.  maybe they are outdated or just simply poorly made but after several exchanges its clear why you only have a replace policy, which should have been my first red flag with this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Nguyen",
          "Nb_Reviews": 2,
          "Date": "2023-10-20T22:51:16.000Z",
          "Titre": "No customer service after sale",
          "Contenu": "No customer service after sale. maybe someone can return a phone call when left a messages.the phone listed was useless, during business hour or off hour nobody to answer the phone.  this need to improve.  very difficult to ask questions."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Irving TX",
          "Nb_Reviews": 3,
          "Date": "2023-12-04T00:02:10.000Z",
          "Titre": "Indicators did not properly installed…",
          "Contenu": "Indicators did not properly installed and nobody was able to help me."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jarnail Aulak",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T23:26:54.000Z",
          "Titre": "the software is not as user friendly  as they make out"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Keith Weber",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T21:53:06.000Z",
          "Titre": "This is the absolute worst company to…",
          "Contenu": "This is the absolute worst company to work with they don't stand by their product they don't honor their 90 day guarantee. I lost money because their robots don't work and when I tried to return them they would not give me a refund and i followed all the guidelines in the warranty. Absolutely do not do business with this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Peterson",
          "Nb_Reviews": 10,
          "Date": "2023-05-31T22:33:51.000Z",
          "Titre": "No support at all",
          "Contenu": "No support at all.  The guy who promotes the products can barely get through a sentence without six umms...uhh...(stragedies) he says.  One positive review on here.  I know people who have purchased this for trading funded accounts and Z E R O support."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Colin Jeffrey",
          "Nb_Reviews": 5,
          "Date": "2023-10-23T21:57:50.000Z",
          "Titre": "I got email after email after email. I think they call it spamming It was a product sale from this company",
          "Contenu": "I got email after email after email.I think they call it spammingIt was a product sale from this company I made a mistake and fell into their trap from the spamming emails.Here is the last email I sent to themMy good friend (Solicitor)He’s looked over your sales page, he says your up to what he suggests as miss selling & enforcement via putting time restraints via your timer controls He has told me it’s still in its wrapperIE: it’s not been opened and is by law entitled to a refund. I Colin Jeffrey has not opened the website to where the products are: so in words although DIGITAL I Colin Jeffrey had not and does not want access to them.So if not digital they would have the sales wrapper still on the product.I will place this part of the email on TrustPilot You are not being fair and it is illegal to steal money from anyone Please remember because of the time difference and your timer saying get it now or lose out. Is MISS SELLING You miss sold me somethingI made a mistake by jumping in because I felt FORCED to buy your product because you had it on sale until a curtain date So YOUR Scarcity tactics got to me yes and I was forced to buy something that I can’t use, and YOU are refusing to refund Colin Jeffrey"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Craig Goodman",
          "Nb_Reviews": 3,
          "Date": "2023-07-19T19:17:44.000Z",
          "Titre": "There indicators and Bots do not work",
          "Contenu": "There indicators and Bots do not work, the guarantee on gives you another product that does not work,Fracktel edge,SP 500, bot all loose money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Silvio Perissinotti",
          "Nb_Reviews": 2,
          "Date": "2023-06-11T17:26:28.000Z",
          "Titre": "Their trading bots are a scam",
          "Contenu": "Their trading bots are a scam, they are super hard to setup and have many bugs, if you think this is your solution for your hard trading life, forget about, I lost many hours trying to setup their bots, but it never worked. Do not waist your hard earned money with them. My advise is study and make your money trading based on your own skills. My 5.000 USD refund was never done, the contract they made you sign has many tricky details that let them get away from the refund obligation. SCAM SCAM SCAM"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ramon Umali",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T21:19:57.000Z",
          "Titre": "NEVER RESPONDED.",
          "Contenu": "left msg and phone nbr for assistance but no one ever returned call.  Unbelievable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kyle",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T22:56:58.000Z",
          "Titre": "I purchased Robot Lab and a couple…",
          "Contenu": "I purchased Robot Lab and a couple indicators around the end of 2022. Nothing works as they portray in the sales pitches and videos. As for Robot Lab I would not use this unless you are willing to loss your original purchase capitol and whatever cash you lose trading. They say they offer a money back guarantee but only if you trade with live cash for 90 days. Trading in Sim Mode does not count. So you will will need to risk losing money for 90 days before you can get your money back. Pretty shady. They only have bots that shoot for the moon with huge stops also. Sometimes it works and sometimes it doesn't. Some of us call that luck. They have been saying they would be releasing new updated and additional bots next week. The problem is they have been saying that for several week now.Updating this as of 4/12/23I see they are now offering a new guarantee. 120 days of running in simulation mode now qualifies. This is good but unfortunately this is because of the uproar that is taking place with so many asking for their money back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Brandenburg",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T19:04:31.000Z",
          "Titre": "Product does not work",
          "Contenu": "Product does not work.  Support is not providing any help.Update to Reply:  The info has been emailed twice now and also left a voice mail.  Still no reply."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "joe berg",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T19:36:06.000Z",
          "Titre": "beware OF NINJACATORS.COM scam and thieves",
          "Contenu": "beware, they are only about making money, nothing about you, they are a scam.your money is worthless, and they will not even accomodate to replace the product, you are on your own. you were warned.NINJACATORS.COM ARE RIPPOFFSin response to your emails.i have never had this type of humiliation.your product never worked, it crashed my ninja.or lets begin with, in never worked from day one, and took almost a week for someone to get back to me.and your phone number is a fraud as no one will ever pick up the phone.and we this thread of emails about you not wanting to give a deal in exchange for a product that never worked.so please tell me here for everyone to see how your customer service is.i'm being treated as if you are doing me a favor, excuse me. NOyou either have ethical values or you dont."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary Hadland",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T06:41:58.000Z",
          "Titre": "Scam, no product delivered",
          "Contenu": "I purchased the order flow indicator system for 2 computers, and never received anything for my $270. They do not reply to emails, scam site stay away.Don't waste your money, you have been warned."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roland Knapton",
          "Nb_Reviews": 3,
          "Date": "2023-11-14T17:00:34.000Z",
          "Titre": "I found it impossible dealing with…",
          "Contenu": "I found it impossible dealing with these people and trying to stop the emails."
        },
        {
          "Note": 1,
          "Lieu": "CR",
          "Pseudo": "David Mead",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T19:15:00.000Z",
          "Titre": "I have no problem and I can't get…",
          "Contenu": "I have no problem and I can't get customer service on the phone and your chat service is useless"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gregg W., Tulsa, OK, USA",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T03:46:10.000Z",
          "Titre": "Beware of the Support that You Get, or Don’t Get, After You Purchase Indicators from Ninjacators",
          "Contenu": "I did not have a good customer support experience with Ninjacators when I had problems with one of their indicators.  It all started with them taking several days to just verify that I had purchased the product and was entitled to customer support.  Which was only resolved when I sent them a copy of my purchase receipt.  Next, I spent a few more days demonstrating that I had followed all of their instructions and installed the product correctly, (i.e., removing their ninjascript indicator, reinstalled it, etc…) and still their product would not properly appear on my charts.  Then, it took a few more days for them to come up with a solution that I should just try uninstalling NinjaTrader 8 and reinstall it adding their indicator first to see if it would work.  Of course, that meant reinstalling every other indicator that I have and re-configuring all of my charts and settings, which would take me a few days to do correctly.  When I objected to doing that before exhausting every other support option, then I was offered the solution of having them look at my computer via remotely logging into it and trying to get their indicator to work.  The first available time slot for that was many more days away.  Finally, before I was able to have the remote help session, I received an email stating that they were closing the help ticket, because they “hadn’t heard back yet” from me.  Despite my many emails back and forth about the issue requesting customer support.  Somehow, they decided that helping me get their indicator to work on my computer was not going to happen, and they were through trying to support their product.  Moreover, many companies sell indicators for NinjaTrader 8, and what separates them is both the effectiveness of their products and the support that you receive when and if they do not work as described.  In this case, Ninjacators customer support failed to be effective, reliable, or helpful after purchasing their product.  As well, I was told that I can neither return or exchange it.  At this point, I just want to forget dealing with this company, and encourage you to carefully consider who you spend your hard earned money with, and what support that you may or may not get if anything goes wrong with their products."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Peterson",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T17:28:08.000Z",
          "Titre": "They sell you a bot or many bots",
          "Contenu": "They sell you a bot or many bots, but in the end the bots do not produce for you"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "DG Dye",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T00:00:11.000Z",
          "Titre": "Unprofitable EMINI Predictive Trader",
          "Contenu": "I purchased the EMINI Predictive Trader offer on February 4, 2023 for $247.They stated repeatedly in the marketing that it was a great way to earn an extra $5000/month, and my logic was that I should at least be able to get a couple of decent trades out of it during testing to make back the purchase price.All the trades taken in the marketing promo were profitable.After I received access to the product I commenced back testing, only to discover that it produced just one single profitable trade in over a month...and that trade was only for a couple of ticks, or about $10 on a micro account, and you had to be fast to grab it.I tested it on multiple time frames and tick charts with the same results: loss after loss after loss.I also viewed the four so-called \"live\" trading videos provided in the training area.  During the first two videos not a single trade is taken, just a review of past potential trades. If you are an experienced trader, you know that such discussions taken with 20-20 hindsight are utterly useless In the next two videos a couple trades are taken, but one is taken after the fact without a proper signal (it had only two boxes as opposed to the three they state in the strategy), and the other one magically appears after a pause in the video.  It's for two lots, with the first one making a small profit and the second lot wiping it out with a bigger loss, which the presenter tries to gloss over by shutting things down quickly.So even their own training videos for the indicator are not profitable.It became obvious to me that, in my opinion, I had been scammed, so I asked for a refund.  They told me their policy is to exchange the indicator for one of equal or lesser value within 30 days.Customer Service Ninja Brent also told me to \"have a nice day,\" after taking a firm stance that no refunds would be given.Bottom Line:  This indicator is the worst one I have ever purchased.  In fact, it is so bad I am thinking of fading its signals to see if that can earn back my purchase price.As for the company, they seem perfectly happy to have a very dissatisfied customer sharing his experience with the world.You might want to ask yourself if that's the kind of company you want to purchase from.Hope this helps.Update: Feb 20, 2023I traded my indicator for the Power Micro Trader.  at first it looked like a vast improvement, with a very profitable trade on my sim account the first day (I wasn't ready to use real money on a new indicator).But the next day, every signal it gave was the exact opposite of profitable.  In other words, had I been attempting to lose money I would have maximized my losses by taking these signals.As much as I had high hopes for this company, it appears that their indicators simply do not work.  In fact, it can't be coincidence that both of the indicators I tried are not only NOT profitable, but will actually maximize losses on most trades.  This suggests indicators that rely on counter trend extremes...a very dangerous strategy for traders."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rex",
          "Nb_Reviews": 6,
          "Date": "2023-03-22T14:54:30.000Z",
          "Titre": "Buyer Beware",
          "Contenu": "Buyer Beware Initial sales support is excellent. However, forget about meaningful timely support after the sale. Support after purchasing their products, even if your purchase is over $2000, comes long after you needed help. If you plan on buying their products, loading, watching the videos and start practicing and trading forget it for some of their products. You will always have something that is missing or not working 100%. It's been about 60 days since I purchased over $2K of Ninjacator products, and I'm still unsure if they are working properly.Also, pending which products purchased you sometimes use your order ID, while others you use a license, all of which is very difficult to obtain at first. You would think both would be on the purchase receipt or welcoming email, not in my case. It took 3 days and several emails to get them, and finally after the one and only one phone call I received after emailing I was going to call my Credit Card Company to ask for a refund.I'm day trader for 25 years making nearly 7 figures annually, professionally trained by retired 30+ year Floor Trader. I have spent nearly 6 figures over 3 decades on trading systems and indicators. Ninjacators rank in the bottom 20% due to weak customer service. The saddest part of this review is that I had planned to buy all of their products, but that seems highly unlikely at this point.They will eventually send you an email that usually gives common / standard IT support advise or questions. E.g. Like what version of Ninja Trader are you running. In one email \"after\" the $2000+ purchase I made, they made it clear that they usually do not provide installation support or technical phone support. So, be prepared to solve installation and technical issues through several emails or when your not trading. They generally take 24 to 48 hours to respond, but they will respond with questions that leads to questions and more questions, which could have been solved in a 3 minute phone conversation many times. However, if your response is not within 48 hours they close your support ticket saying that your problem has been fixed when it's not.  As I'm writing this review, I lowered the rating from 2 stars to 1 star.  Date of experiences has been weekly since February 2023 to present in trying to completely stan-up all the products I purchased. On a positive note, their Training Videos on how to use their products are great!  Some of the best I used.Their products have value and are useful, but are over sold / valued like 90% of most trading product vendors, so they are no different in that respect.Their products have no trading revelations, but have merits. Some products can be purchased at other vendors that have better support in my opinion. One final recommendation... Over the decades I have seen a pattern with Trading Vendors. If they do not offer a \"cash refund\" / moneyback guarantee after their trial period, there is good reason why... usually it’s because something in their products or service does not add up. Ninjacators offers 30 days to try their products and if you don't like it, they will switch you to another unsupported or poorly supported product, but no refund, and if you're lucky to get the product stood up and running your 30 days most likely will have expired, so no switching to another product. Seem to be good people with good intentions, but grossly fall short for good paying customers. However, like I noted above, if a Vendor has great products and service they usually will have money-back refund policy. This is not the case. I have found reasonable use for a few of their products, while others are almost identical to standard indicators found in many charting services."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marvin R",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T16:30:50.000Z",
          "Titre": "Signal Lab still in Beta 8 months after…",
          "Contenu": "Signal Lab still in Beta 8 months after purchase"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Kohnke",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T12:14:17.000Z",
          "Titre": "I still do not have access to the items…",
          "Contenu": "I still do not have access to the items I bought."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Kumara",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T10:50:29.000Z",
          "Titre": "problem still not solved."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Moh",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T04:03:39.000Z",
          "Titre": "Too much noise and no trial."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Gehlsen",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T16:17:00.000Z",
          "Titre": "It took 4 days to resolve something…",
          "Contenu": "It took 4 days to resolve something that could have been handled with a 5 minute phone call and is still unresolved in my mind. I am still wondering why I was charged $397.00 for a Fast track membership that I paid $1997.00 for on September 29, 2023 and will I have to go through this again in three months? or am I still a member since I was refunded the $397.00 that started this? or what is going on? This is still unresolved in my mind."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "LDT",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T03:27:56.000Z",
          "Titre": "Eternal Fractals isn't working…",
          "Contenu": "Eternal Fractals isn't working properly.  Seems that everyone is interested in selling----and less interested in support."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Edet Enoudo",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T23:43:47.000Z",
          "Titre": "Poor customer support",
          "Contenu": "I have reached out to their customer support, but got no response."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "KARTIK MEHTA",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T16:15:46.000Z",
          "Titre": "Very helpful but indicators take up too…",
          "Contenu": "Very helpful but indicators take up too much RAM memory and froze my NT8"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2023-08-08T18:15:33.000Z",
          "Titre": "SignalTraderLab",
          "Contenu": "I have been trying to use SignalTraderLab now for quite some time, back in April ,23 I believe.I understand that a new program which is underdevelopment, can have a few wrinkles, when new. My experience with STL gets worse with each new version. There are numerous problems, which make the software almost unusable. I say almost, because you can still put it on a chart, but if you change things like time, or close it, the settings will be gone. It removes accounts from NT8 Control Box, to mention a few.This is only one of Ninjacators software programs, of which there are many other more good ones. Perhaps STL was released a little prematurely, and that needs addressing. What makes me uncomfortable, is the fact that this is still being promoted and sold to the public, when these issues are known, hence the 2 stars.This is not what I expected from Ninjacators, when I joined as a Lifetime member."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T21:41:46.000Z",
          "Titre": "It took 25 minutes to get to the…",
          "Contenu": "It took 25 minutes to get to the subject matter then it turned out to be a stategy I am already familiar with."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Frank Roth",
          "Nb_Reviews": 2,
          "Date": "2023-10-15T20:02:34.000Z",
          "Titre": "Did not receive email with license and…",
          "Contenu": "Did not receive email with license and still waiting to get the email"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Himanshu",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T00:11:25.000Z",
          "Titre": "title",
          "Contenu": "bad description of course"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KurtW",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T10:00:50.000Z",
          "Titre": "your quality control needs improvement",
          "Contenu": "your quality control needs more emphasis."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T16:34:36.000Z",
          "Titre": "I am not getting much out of it."
        },
        {
          "Note": 3,
          "Lieu": "PL",
          "Pseudo": "Jean-Jacques Dreier",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T19:45:51.000Z",
          "Titre": "The response has been a little bit slow…",
          "Contenu": "The response has been a little bit slow this time. Also I did have to de-install the tool bar to hopefully make the new indicator work. But it does not work on my platform. Hope after the meeting with Michael everything will be fine."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Rogers",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T19:08:52.000Z",
          "Titre": "I like the PROMISE of what Ninjacators…",
          "Contenu": "I like the PROMISE of what Ninjacators is selling, but I am not finding it very intuitive to get up and running. The jury is still out on what I think of the various products."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Paul H",
          "Nb_Reviews": 4,
          "Date": "2023-08-10T11:55:06.000Z",
          "Titre": "Unable to change.",
          "Contenu": "I gave a 3 star rating because the issue I am having has not been resolved yet. I put a request into support for this issue and it’s been over 4 months without a resolution. I appreciate the up date I get from Abigail, I am still not able to change the setting in the indicator ( Trend Squeeze) and save it without getting an error."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 6,
          "Date": "2023-09-26T05:31:23.000Z",
          "Titre": "Couldn’t understand concepts maybe…",
          "Contenu": "Couldn’t understand concepts maybe better tomorrow. Felt totally lost. But trying. Leonard Hotkowski"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eugene",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T22:09:58.000Z",
          "Titre": "Spent too much time catering to the…",
          "Contenu": "Spent too much time catering to the people in chat than clearly going over the information.  Turn the chat off!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melvin",
          "Nb_Reviews": 2,
          "Date": "2023-09-25T21:39:03.000Z",
          "Titre": "I have bought numerous Strategies and…",
          "Contenu": "I have bought numerous Strategies and haven't found much that I can use. I have gone back to what I started with.  I like the platform."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anshuman Goswami",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:44:32.000Z",
          "Titre": "The volume spread imbalance indicator…",
          "Contenu": "The volume spread imbalance indicator does give points of imbalances but it does not provide all quality pointers that will give us positive outcomes always. Lot of false positive signals. Ofcourse this is 3rd day of my trying it. It works well with other indicators to validate the entry points in the trade. The package also gives Delta histograms and enabling the alerts of sound I am able to find trading points of entry for positive moves. Thought that was very helpful. Overall I am learning to use it but signal places are accurate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph Arbuah",
          "Nb_Reviews": 5,
          "Date": "2023-12-16T17:45:23.000Z",
          "Titre": "My personal Review of Ninjacaters.",
          "Contenu": "I think the company is dedicated to the better good of their customers.  The training materials they offer to their customers are relatively cheaper compared to others and quick to respond to their customers needs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Morrill",
          "Nb_Reviews": 2,
          "Date": "2023-11-19T15:25:06.000Z",
          "Titre": "Supply Demand Trader",
          "Contenu": "I like the indicator so far and I am still trying to figure out how to use it.  The initial video was limited in what it covered and I have to go back to see if there are additional videos that I have not seen.  I am not sure what atm strategy will work best and suggestions on that would be appreciated.  I use Renko bars to minimize the noise in the data, which seems to work better then time based bars.  There appear to be other indicators that came with the package and it is not clear what they do.  This is my first attempt at working with semi automated trading and I do not know what I do not know if that makes sense... I would like to know more about how it decides to enter a trade so I can anticipate a trade is coming and get prepared etc... I would like the trade engagement feature to be somewhere else because I have to many icons up there now and I have to make the chart to big to be able easily see and access that feature. I like the concept though..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Granger Vinall",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T03:18:13.000Z",
          "Titre": "The people are prompt and professional",
          "Contenu": "The people are prompt and professional The support and training materials are good.  A lot to take in but worth the time, education and discipline."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Patrick Saladin",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T10:36:07.000Z",
          "Titre": "The support always tries to get their…",
          "Contenu": "The support always tries to get their products to the customer and to provide the help that they could or need.The product I bought is a good support for my trading in the futures markets."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelle Price",
          "Nb_Reviews": 4,
          "Date": "2023-11-13T19:10:54.000Z",
          "Titre": "Some concerns, but solid company.",
          "Contenu": "I hate to leave this review. It's no reflection on the team -- always very nice. I must have purchased 5 to 7 indicators over the years, and I try hard to find the utility. But I end up not using them in lieu of native NT indicators or cheaper ones. That's tough when these average several hundred dollars each. I feel the indicators are oversold in the marketing emails. I recently purchased one after a long break, pulled in by the marketing. Not only was it a challenge to get two of the components working (first time that happened), but I couldn't reach anyone over email nor phone to help for over a day. Which is an eternity when you're trading, working, and a busy parent. And there are no returns, only exchanges. I ended up not using it in lieu of native indicators. Update:Thank you for your response. I appreciate it. I sent my original issue Friday morning at approximately 10 am CST, and called approximately 2 hours later. I definitely didn't expect anyone to reply over the weekend. I did get a response this morning and an exchange, which I very much appreciated. I've reverted back to native indicators, but will keep the new indicator on hand with the others for potential future use. Thank you again, and I appreciate your help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Juan Carlos",
          "Nb_Reviews": 6,
          "Date": "2023-11-17T22:21:18.000Z",
          "Titre": "I still waiting for an answer about my…",
          "Contenu": "I was confused with ninjatrader and ninjacators, 2 separate companies, ninjatrades is a brokerage and they make me cancel my tradovate account and them to open the new account took forever. about ninjacators I got everything right away, I still learning the material and so far is clear but I am going to backtested to see if my knowledge plus the indicators works if not I will use their exchange policy, I will change it for another indicator. Sorry for the missunderstanding"
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Sajid Mahmood",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T11:21:23.000Z",
          "Titre": "Great Customer Support",
          "Contenu": "it is having great customer support and hundred customized products to cater the need of each client"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 3,
          "Date": "2023-10-03T00:02:14.000Z",
          "Titre": "Review of 5 day workshop",
          "Contenu": "Very good presenters with unique, usable concepts. Everyone very helpful, especially Kyle. We had our questions & issues answered and resolved. My only gripe is that majority of successful traders, professional & non professional, do not use many indicators. So why does Ninjacator try and sell multiple indicators & strategies, at humongous annual costs (instead of a one time payment) when trading is a non stop, dynamic, split second decision making at most times, and people do not have time to figure out which indicator (which are mostly lagging) to deploy & when!"
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Torfinn Sornes",
          "Nb_Reviews": 2,
          "Date": "2023-10-20T18:03:35.000Z",
          "Titre": "Too nearly to Review as I need some…",
          "Contenu": "Too nearly to Review as I need some days to experience the results of the bots."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roberto Donaldson",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:06:38.000Z",
          "Titre": "My experience with Ninjacators has been…",
          "Contenu": "My experience with Ninjacators has been very positive. The service members respond quickly and with answers. I just have used their product for a few weeks now, so it is to tell if they can help me with my trading."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryker Gillespie",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:13:31.000Z",
          "Titre": "I purchased a lot of indicators from…",
          "Contenu": "I purchased a lot of indicators from ninjacators over the years. I'm amazed at its accuracy and effectiveness. However, I would like to see some additional modifications, to make them fit my system, but they do not offer any custom coding."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua H.",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T02:06:58.000Z",
          "Titre": "Exceptional customer service!",
          "Contenu": "Michael helped me so much and got me sorted out with the best products for me. He was always very kind and understanding of what I needed, and he assured me that they at Ninjacators want nothing more than for me to succeed. I’m so excited to got started."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T20:58:13.000Z",
          "Titre": "Michael was great",
          "Contenu": "Michael was great! He was very responsive and took immediate action to make sure I was satisfied. He was not only professional, but also, very personable. I really appreciate him!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Carr",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T22:00:03.000Z",
          "Titre": "I have been super happy with Robot Lab…",
          "Contenu": "I have been super happy with Robot Lab and am very impressed with the way they deliver the product. Not only is there a free installtion, where they actually install the Robot Lab on your machine, but there are all the live education classes, that helped me to get comfortable with everything in a matter of weeks. And I m not a technical guy ( ask my wife:-)). I have the systems running now for 3 month, and I m already up two digits in my account. What you need to understand before yo ustart, there will be a lot of losing days, and you need to be ok with that. They make money over the long run and in the 3 month I have been using them, they steadily grew my account withput me doing anything, other then making sure they are tunred on. thank you very much to Christian,  Craig, Kenny and the entire Robot Lab team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tristan Love",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T07:35:41.000Z",
          "Titre": "Great and quick response to all my…",
          "Contenu": "Great and quick response to all my questions. The indicator I purchased works great stand alone, but unfortunatally, it does not work on my custom charts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed Smith",
          "Nb_Reviews": 5,
          "Date": "2023-12-21T21:28:12.000Z",
          "Titre": "Support has been great",
          "Contenu": "Support has been great. Michael has been working with me on my kerfuffles"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adonis Hayden",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T09:01:57.000Z",
          "Titre": "The workshops are fantastic",
          "Contenu": "The workshops are fantastic. I had a issue geting the login to the zoom session, but the support answered in time for me to be able to attend the workshop live."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "rick slack",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T16:59:42.000Z",
          "Titre": "Customer support is excellent!!",
          "Contenu": "Customer support is excellent!!! Helped me fix my issue even though it had nothing to do with their service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gus Wuillermin",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T23:28:06.000Z",
          "Titre": "The honesty of Kyle and Ambassarods",
          "Contenu": "The honesty of Kyle, Richard and Dan impressed me. While showing potential and good probably of a successful trade, gave no pie in the sky certainties. The common sense approach to trading, using risk management with clearly defined rules by not diverting from the indicators design also was compelling. Great job gentlemen!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tradejv",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T17:09:17.000Z",
          "Titre": "Great tools with an amazing 2 week…",
          "Contenu": "Great tools with an amazing 2 week trial.  Really worth the time to review and likely find very helpful toolsets."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Samuel",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T05:01:24.000Z",
          "Titre": "As a long term member (1month ) you get great deals",
          "Contenu": "Customer support is great. Unfortunately there’s no live chat where one can ask questions and get an answer straight away. You’ll have to wait, but regularly the answer in 24 hours excluding weekends. I live in Germany and I still get answers to my questions within 24 hours, so Patience is NEEDED. Michael Kaminsky you’re the Guy. No matter what kind of issues I have, he always help. He’ll even make a call with you on a time that’s suitable for you based on where you live to screenshare with you and help you set the tools right if you’re not getting it done. He’ll even help you choose the right indicator and with their love it or replace it in 30 days offer you can exchange the indicator based in the same price range. Now, I’ll try my level touch Trader and Nasdaq Edge for 3 months and I’ll probably write a new rating if I finally gotten profitable in my trading journey. Thanks again Michael Kaminsky"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Corey Moore",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T22:48:28.000Z",
          "Titre": "The response from the team of support…",
          "Contenu": "The response from the team of support personnel has been beyond belief... The level of attention and concern for my comfort level in using their amazing products has been A #1....They have all been dedicated to making sure we are completely comfortable in using their fabulous products... I am a member of the ninjacator family for life!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bash",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T16:23:10.000Z",
          "Titre": "I highly recommend this site",
          "Contenu": "I highly recommend this site, they have very high quality indicator and if you have an issue, they are very responsiveAbigail, Thank you so much for the outstanding assistance. You solved my problem and I really appreciate it. Thanks again. Great Job!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T10:21:02.000Z",
          "Titre": "Quick response to answer all my…",
          "Contenu": "Quick response to answer all my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sridhar Krishnan",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T10:36:57.000Z",
          "Titre": "Trustworthy, reliable indicators that work",
          "Contenu": "This was the first time, I ordered from Ninjacators. I was skeptical about the supply and demand  trader and aggressive oscillator, I had purchased. But after one week, I must say, i back tested and also tested live , it produced 1 winning trade each day and is a good complement to my existing trading system. My rule is to stop trading after 1 winning trade of 4 S&P emini points per day, which I was able to."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MartyN",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:04:12.000Z",
          "Titre": "So far all the tools work as published.",
          "Contenu": "So far all the tools work as published.I'm great success!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judy Eckman",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T21:53:46.000Z",
          "Titre": "The fools that write these negative…",
          "Contenu": "The fools that write these negative returns are those that fail to read the instructions or descriptions about the products purchased. I have purchased more than 10 products from Ninjacators ranging from their mini-workshops up to their premier RobotLab Pro. They have always delivered as promised  and  have provided support along the way by offerring workshop or online support services. I can name many of their agents but my favorites are Kenny, Brent, and Abigail."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Moore",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T03:38:12.000Z",
          "Titre": "No high pressure",
          "Contenu": "No high pressure, product was promptly delivered and was easy to install into ninjatrader.  I will buy additional product in the future. I also like how all products that I've purchased are maintained in my account and updates are provided promptly as needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Pica",
          "Nb_Reviews": 12,
          "Date": "2023-12-11T17:19:12.000Z",
          "Titre": "Abigail",
          "Contenu": "It is Abigail that makes the experience great. She always answers my questions and quickly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Iacono",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T05:12:22.000Z",
          "Titre": "Abigail was EXTREMELY patient with my…",
          "Contenu": "Abigail was EXTREMELY patient with my requests on a day where they were incredibly short handed…Took the time to thoroughly answer my MANY questions, and I am completely confident that she will be there for me in a major way next week if necessary…!!💪👏"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlos",
          "Nb_Reviews": 4,
          "Date": "2023-11-26T05:30:10.000Z",
          "Titre": "I had an issue with setting up my chart…",
          "Contenu": "I had an issue with setting up my chart with the Renko bars. Dan responded and got me what I need to set everything up correctly that same day. He made sure i was up and running and confirmed that everything was ok. They were quick to solve my problem which is rare in todays environment so I have to say I was impressed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al Gray",
          "Nb_Reviews": 4,
          "Date": "2023-11-18T06:45:17.000Z",
          "Titre": "World Class Service",
          "Contenu": "I have read many reviews about this company and a few might be negative. I find it hard to believe considering the level of service that I have received from Dan, Michael, and Brent.  You will always receive a quick response and a quick turn-around to any issue. Even if you don't have an issue and it is just a question about their product or how to use an indicator. You will receive a response. Trading is difficult. I see traders that want a guaranteed result and you won't find that anywhere. What you will find at Ninjacators are great tools and AMAZING OVER THE TOP Customer Service. Sign up for the IOMC. Free indicators and access to great tools and deals."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 4,
          "Date": "2023-11-24T18:56:55.000Z",
          "Titre": "Always ready to help!!",
          "Contenu": "Always ready to help!  Abigail and Michael have been great helping me sort through some questions I have had and I am sure I will purchase more from Ninjacators."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dung do",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T02:08:40.000Z",
          "Titre": "Black Friday purchased \"Monster Trade\"",
          "Contenu": "Black Friday purchased \"Monster Trade\"This indicator working very effective.  Ninjacators engineers are very smart in this market.Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DW",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T17:41:39.000Z",
          "Titre": "Real Professionals",
          "Contenu": "I have a bunch of Ninjacators' products.  They have great products and great customer service.  They are real professionals."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John tombini",
          "Nb_Reviews": 8,
          "Date": "2023-12-19T01:26:39.000Z",
          "Titre": "The quick response time to my issue"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John W",
          "Nb_Reviews": 3,
          "Date": "2023-11-11T15:16:42.000Z",
          "Titre": "GREAT SERVICE",
          "Contenu": "This is my 4th five star review for Ninjacators and 2nd for Brent Hilburn.Brent again provided great service in fixing my frozen and locked up Signal Trader Lab while I was on the road and vacation. Ninjacators is very fortunate to have such a knowledgeable and dedicated support assistant in Brent Hilburn."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Nolley",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T14:59:23.000Z",
          "Titre": "Customer service is barnone.",
          "Contenu": "Customer service is barnone. Always make sure you understand and completely explain. Every product is designed to help progress your trading journey from newbie to pro in the fastest possible time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Torsak",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T19:53:36.000Z",
          "Titre": "Trusted, good and prompt service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ali Dehdashty",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T23:28:13.000Z",
          "Titre": "I recently had the pleasure of…",
          "Contenu": "I recently had the pleasure of experiencing exceptional customer service from Ninjacators. Their team went above and beyond to assist me, demonstrating a level of professionalism and friendliness that is truly commendable. Not only did they address my inquiries promptly, but their indicators also proved to be of high quality at an affordable price. I highly recommend Ninjacators for their outstanding service and budget-friendly offerings: special thanks and shoutout to Michael, who helped and gave me helpful tips."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ernest Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:24:31.000Z",
          "Titre": "Michael was timely",
          "Contenu": "Michael was timely, and generous."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larissa W",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T00:36:05.000Z",
          "Titre": "Best indicator",
          "Contenu": "Customer service is great. Z pattern program is awesome, I have been profitable since I started using Z pattern, I have never seen any indicators like ninjacators. If I stated using ninjacators when I started trading a year ago, I'll be a full time trader by now. I started using Z pattern a week ago and I have been making over 70 ticks a day. Thank you Ninjacators"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael M.",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T20:57:16.000Z",
          "Titre": "The data export tool allows for the…",
          "Contenu": "The data export tool allows for the analysis of every trend possible.  The ability to easily export indicator data seamlessly with price data is unique.  Great tool."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle Fox",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T21:13:28.000Z",
          "Titre": "I have just recently started with the…",
          "Contenu": "I have just recently started with the platform and so far I have been impressed with service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John tombini",
          "Nb_Reviews": 8,
          "Date": "2023-12-04T13:26:18.000Z",
          "Titre": "The customer service and tech help is…",
          "Contenu": "The customer service and tech help is incredible,one of the best in the market. I have never been disappointed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bailey Mason",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T19:42:12.000Z",
          "Titre": "Just installed RobotLab last week",
          "Contenu": "Just installed RobotLab last week - super smooth installation + installation video. I turned on the algo-bots in simulation with one of their pre-made portfolios. So far so good, I m up $3800 in my sim account already. I know, not every week will be like that. but it is great to see that it actually works. I will trade the bots in simulation for a month or two, and then switch them to live account. I m super exited !!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ernest proffit",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T07:40:39.000Z",
          "Titre": "communicate via video with eye contact…",
          "Contenu": "communicate via video with eye contact and a caring specificity to your audience. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lucy Arnold",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T15:59:35.000Z",
          "Titre": "Zachary was GREAT!",
          "Contenu": "Zachary was very patient & helped me correct connections!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kai Gill",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T21:04:12.000Z",
          "Titre": "Ninjacators has the best support team…",
          "Contenu": "Ninjacators has the best support team bar none. They immediately allowed me to switch one item without question because I did not feel comfortable trading it. I switched to their starter algos. They automatically trade for you, and I just need to turn them on every day. In the first two weeks the results were mixed, I had some good days and some bad days. But then last friday came around, and I made 3000 on one day. And after todays trading day, where I made another 1700 i'm convince, this is exactly what I was looking for. Thank you gays."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dajavue1083",
          "Nb_Reviews": 2,
          "Date": "2023-10-24T03:50:07.000Z",
          "Titre": "Replaced system after 30 days",
          "Contenu": "Bought the Edge system and after 30 days I realized that it wasn't for me.  I thought I could get my money back but it wasn't a 30-day money-back guarantee.  It was a 30-day love it or replace it with another one of their systems.  Well, Michael asked me some traders to find out what type of trader I was and recommended another one of their systems and so far it is great!!  They were very helpful and responsive and that really made me feel comfortable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenden Steele",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T23:12:53.000Z",
          "Titre": "I Love Ninjacators....",
          "Contenu": "I Love Ninjacators..... They are the gold standard when you are looking for an edge on the Ninjatrader platform."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John S",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T00:43:04.000Z",
          "Titre": "I had an excellent experience with…",
          "Contenu": "I had an excellent experience with their products and even better with support. Initially, I wanted to speak with someone on the phone however, I have received personalized video explanation to my answer, I was very impressed by the way Michael assisted me. I can only say, highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harvey Robertson",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T08:55:06.000Z",
          "Titre": "The products have made me a successful…",
          "Contenu": "The products have made me a successful trader and the support is great. Thank you Ninjcators!"
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Juan Vega",
          "Nb_Reviews": 2,
          "Date": "2023-10-25T20:37:27.000Z",
          "Titre": "Robot Portafolio Lab / Refund",
          "Contenu": "I purchased the Robot Portfolio Lab. Due to a medical emergency, after a few days of the purchase, I ask for a refund of the total value of the acquired product.Abigail from the support desk helped me with no issues.Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sora Aoi",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T17:17:36.000Z",
          "Titre": "Honored Refund Policy",
          "Contenu": "They are truthful about the 30-day refund policy that was offered during the Robot Lab webinar I was a part of. Had to request one due to a sudden personal issue and they provided the refund right away. I will be back again to the Robot Lab early next year."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tyrone Baird",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T22:11:57.000Z",
          "Titre": "This has been a great experience",
          "Contenu": "This has been a great experience. Kyle is such a good teacher; he can explain complex concepts in a very simple way. Also, seeing the trade setup occur in the live market, in the VIP sessions, really helped me seeing it all come together right in front of me.priceless."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ishaan Cleveland",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T23:03:36.000Z",
          "Titre": "The zorro futures trader indicator is…",
          "Contenu": "The zorro futures trader indicator is the bees NinjaTrader indicator I have ever used. lt makes it so easy for me to trade multiple markets at the same time and only take the best trades that come up. In a typical trading morning, I get 6-7 trades in the markets I trade (ES, NQ, GC, CL ) and I m done trading most days around lunch time."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Eva",
          "Nb_Reviews": 8,
          "Date": "2023-09-25T21:38:55.000Z",
          "Titre": "A real company",
          "Contenu": "A great company that offers great help in the form of indicators, robots, week works, etc. They are sincere and have exceptional support. They don't try to fool you in anything they sell because they never offer you the holy grail. Although sometimes it seems like it..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Martone",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T21:54:08.000Z",
          "Titre": "I recently installed the Supply/Demand…",
          "Contenu": "I recently installed the Supply/Demand indicator and wow is it impressive, each time it's hit a level getting an immediate pullback and profit opportunity. Going to keep practicing to expand the profits but so far showing all green and super exciting to have had this feature come my way, much Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna M",
          "Nb_Reviews": 7,
          "Date": "2023-10-30T20:18:52.000Z",
          "Titre": "Great customer service",
          "Contenu": "The Ninjacators team is always quick to respond and very helpful.  I appreciate this very much in an age where it's hard to deal with a real human to solve issues in many other companies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Crowley",
          "Nb_Reviews": 5,
          "Date": "2023-11-23T08:00:31.000Z",
          "Titre": "Thanks Ninjacators for a great deal on…",
          "Contenu": "Thanks Ninjacators for a great deal on Robotlab and the extra bonuses! Can't wait to get up and running."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Palmer's Picks",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T20:19:20.000Z",
          "Titre": "Excellent indicators, Even Better Customer Service",
          "Contenu": "This review is long overdue. My apologies to the amazing Ninjacators Team. 1. Excellent indicators - Quick load with great instructional videos.2. Amazing Customer Service - Quick response with Above and Beyond Customer Service - Thanks Brent and the rest of the team. I have interacted with Brent many times and it is always over the top service. 3. Guarantee - The best guarantee in the industry. I don't think you will find another provider to give you what Ninjacators offers. I have put them to the test. Read the rest of the reviews. There is no holy grail in trading but they want you satisfied. 4. IOMC - Test out an indicator every month. Who lets you do that????? Seriously. Thanks Ninjacators."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ephraim Hays",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T08:44:54.000Z",
          "Titre": "The best automated systems you can buy…",
          "Contenu": "The best automated systems you can buy for money, paired with flat out outstanding support and live classes. What else do you need? I know, I don't need money more. Experiencing how easy it is to make money in the futures market is a total game changer for me. I spent years trying to figure out how to constantly make money trading futures and was ready to throw in the towel and never trade again. Then I saw a webinar for Christian's Robot Lab and decided to give it one more try. Well, I have not been disappointed. This delivers more then I ever could have hoped for. Ninjacators finally put me on the path of trading success.l'll be forever grateful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sara Carter",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T10:00:10.000Z",
          "Titre": "Second to -non automated trading…",
          "Contenu": "Second to -non automated trading systems retail traders would NEVER get their hands on. I have tried it all. Compared to what Ninjacators Robot Lab does, ALL OTHER automated systems I ever bought are garbage. Folks, this stuff is so next level I can’t not begin to tell.You need to use it to be able to believe it. I was skeptical at first too, but ZERO regrets that I signed up for the Robot Lab Portfolio program.GO Algo-Bots and GO Ninjacators."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Riaan Witt",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T20:41:26.000Z",
          "Titre": "I purchased the E-mini Predictive…",
          "Contenu": "I purchased the E-mini Predictive Trader back in April and ever since I'm using it, my trading results have increased dramatically. Today I m writing this, because I had my first $5,000 trading profit day of my career. And I used the E-mini Predictive Trader. Thank  you very much for developing such an incredible indicator."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elsie Caldwell",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T13:10:46.000Z",
          "Titre": "I attended the live 5 day trading…",
          "Contenu": "I attended the live 5 day trading workshop with Kyle and also attended the morning live trading session. First I thought, it cant be that simple to find these trade setup every day, and then I saw it with my own eye for an entire trading week with the Ninjacators team in the workshop. Incredible how easy it is to make money on these setups. You taught me how to fish and I will be forever grateful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tegan Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T15:49:17.000Z",
          "Titre": "Wow, the Volume Spread Scalper",
          "Contenu": "Wow, the Volume Spread Scalper indicator is awesome! Finding the volume spreads automatically and plots the entry signals right there on the chart for you. I use it on a 3 minute CL chart and on a 1 minute NQ. The winning percentages are staggering. Must have indicators for all scalpers out there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larissa W",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T17:31:31.000Z",
          "Titre": "Ninjacators has helped me with my…",
          "Contenu": "Ninjacators has helped me with my trading significantly, I understand the market a lot clearer. Thank you ninjacators"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Niamh Alexander",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T09:52:16.000Z",
          "Titre": "Robot Lab is the best that ever…",
          "Contenu": "Robot Lab is the best that ever happened to me. Fast setup, great detailed video material and fantastic live sessions. My expectations were not only matched, but far exceeded. Best automated trading systems a small trader like me can get their hands on. Thank you very much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Grey Craft",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T10:46:30.000Z",
          "Titre": "Robot Lab is outstanding",
          "Contenu": "Robot Lab is outstanding. The concept of trading a portfolio of fully automated systems never occurred to me before. and I have been trading for over 20 years. Over the post two decades I probably spent upwards of $40K on Futures Trading tools and education, only to find out, that I only needed to purchase Robot Portfolio Lap Pro for $15K, and it does all the trading work for me. Now I let the robots so all the  trading work for me and l only trade manually if I feel like it. Just for fun. And my by me knowing, no matter what  I do manually trading, the robots make money for me. You taught an old quite a lesson. Very well done."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Markus Amstutz",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T23:22:53.000Z",
          "Titre": "Very easy proceeding to purchase the…",
          "Contenu": "Very easy proceeding to purchase the trading model."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T01:01:27.000Z",
          "Titre": "Quick respond and help me to fix the…",
          "Contenu": "Quick respond and help me to fix the issue with the instructions given and it works a+"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "andrewludel",
          "Nb_Reviews": 29,
          "Date": "2023-12-02T21:59:37.000Z",
          "Titre": "They were very patient and extremely…",
          "Contenu": "They were very patient and extremely helpful thank you so much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonael Wynn",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T07:41:35.000Z",
          "Titre": "Tach support was AAA+",
          "Contenu": "Tach support was AAA+. I had an issue with an updete and my indicator was not plotting anymore. Tach support did a quick remote session and fixed the problem right on my machine in a matter of minutes. Very good to know that you guys have my back and I really appreciate you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cathy",
          "Nb_Reviews": 6,
          "Date": "2023-08-16T21:11:09.000Z",
          "Titre": "Despite getting a REFUND, these guys had outstanding service",
          "Contenu": "The customer service from this company was amazing.  I REFUNDED on the service I paid for, per their policy, because I found it not suitable for my trading needs.  They worked with me quite a bit and were patient.  They HONORED THEIR AGREEMENT FULLY and with no hassle, after I honestly gave it a real effort and time.  The specific program did not meet what I wanted in a trading program.  Sometimes you just can't tell until you work with a program for a while, which is what happened."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 4,
          "Date": "2023-11-11T03:08:22.000Z",
          "Titre": "So happy you guys run special pricing!",
          "Contenu": "So happy you guys run special pricing!!  The process was smooth and easy --- just like the customers want it.Will keep my eye on the specials and buy again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Roberts",
          "Nb_Reviews": 7,
          "Date": "2023-11-14T17:09:00.000Z",
          "Titre": "Michael Kaminski went out of His way to…",
          "Contenu": "Michael Kaminski went out of His way to help me.  I am very appreciative of all His time.Tim"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Evan Elliott",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T11:35:29.000Z",
          "Titre": "Ninjacators is a great of trading for…",
          "Contenu": "Ninjacators is a great of trading for me because it frees up my time to spend with my family. The support is awesome!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John tombini",
          "Nb_Reviews": 8,
          "Date": "2023-11-11T00:56:35.000Z",
          "Titre": "The team and especially Michael always…",
          "Contenu": "The team and especially Michael always goes beyond what i expected. He treaded me like I have known him for years. He is top notch in my eyes. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Finn Jones",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T11:41:14.000Z",
          "Titre": "Ninjacators has great products and…",
          "Contenu": "Ninjacators has great products and great service. As a matter of fact, Ninjacators support is much better than NinjaTrader support. Thank you very much for helping me on my trading journey."
        },
        {
          "Note": 5,
          "Lieu": "GE",
          "Pseudo": "giorgi sherozia",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T09:25:32.000Z",
          "Titre": "ninjacators",
          "Contenu": "Hello. good company, good indicators, I passed an assessment account with Apex using these indicators. I recommend ninjacators to everyone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam Stephenson",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T11:21:35.000Z",
          "Titre": "Abi, Terri, Brent",
          "Contenu": "Abi, Terri, Brent…you guys are the best. Thank you so much for your support! For everyone out there: Ninjacators Support is the best. Quick, competent, responsive, and always super friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keira Stanley",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T15:26:34.000Z",
          "Titre": "After buying trading indicators for 12…",
          "Contenu": "After buying trading indicators for 12 years from other vendors, who don't know what they are doing, I found Ninjcators. They have best indicators and strategies I have ever used. Ninjacators is my go to place to purchase indicators!I would not be able to trade successfully without the indicators I have purchased from Ninjacators."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John North",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T14:37:46.000Z",
          "Titre": "Experienced Team There To Help",
          "Contenu": "Learning to trade is such a huge undertaking and it's good to have a group of people with the experience to shorten my learning curve. The conversations I've had with them have helped me understand who I am as a trader and how to get the most out of the tools they provide."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jean Borgella",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T18:02:38.000Z",
          "Titre": "great tools",
          "Contenu": "awesome tools and support"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Morris",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T19:15:31.000Z",
          "Titre": "Highly Recommend Ninjacators",
          "Contenu": "I purchased the Robot Lab from Ninjacators and they have been extremely professional and helpful in getting me up to speed on using their auto-trader system. I highly recommend them for anyone looking to make their trading easier and more profitable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Madeline Mcclure",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T20:19:16.000Z",
          "Titre": "I originally purchased the Elliott Wave…",
          "Contenu": "I originally purchased the Elliott Wave indicator. It was good and worked, but I realized that it was not for me. I sent in a ticket to support, and they swapped the Elliott Wave indicator for the Spread Scalper Indicator, no questions asked. The Spread Scalper indicator is the perfect fit for me, as it supports my fast in / out trading style and I had great success with it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John tombini",
          "Nb_Reviews": 8,
          "Date": "2023-10-11T20:44:05.000Z",
          "Titre": "the support at ninjacators never fails…",
          "Contenu": "the support at ninjacators never fails to amaze me.they always respond to my issue and never leave me hanging waiting for an answer.the best"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stuart Snell",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T16:39:58.000Z",
          "Titre": "Good customer service and the great deal with Fundrr"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Frank Roth",
          "Nb_Reviews": 2,
          "Date": "2023-10-16T01:20:18.000Z",
          "Titre": "Problem resolved",
          "Contenu": "Ninjacator addressed my concerns immediately upon hearing my complaintFor this I commend them and give them five stars for their efforts in supporting their customers and products"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 6,
          "Date": "2023-11-10T01:15:38.000Z",
          "Titre": "Very good help with the details of this…",
          "Contenu": "Very good help with the details of this project and what to look for when it becomes successful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eloise Richardson",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T20:25:24.000Z",
          "Titre": "After trading the robot lab algos with",
          "Contenu": "After trading the robot lab algos with great success in simulation, I finally went live last month. I got mixed results in the first two trading weeks and was about $3K down. Then the bots had a good streak for the rest of the month and I closed out my first live trading month with a profit of over $10K.Thank you very much for making this available to me. It will change my life."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T04:50:53.000Z",
          "Titre": "Quickly Responsive Customer Service.",
          "Contenu": "All is great, if this area of things is a fit for you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jadon Snider",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T08:05:28.000Z",
          "Titre": "I like how Ninjacators has so many…",
          "Contenu": "I like how Ninjacators has so many different products for a very affordable price. And the kicker is, the quality of their Indicators is fantastic. I  bought an Elliott Wave Indicator for NinjaTrader from a other company, and paid $3000 for it. Then  I saw a special deal from Ninjacators, offering their Elliott wave Indicators for $497. I bought it. And I'm not surprised; Ninjacators Elliott Wave Indicator is sooooooo much bettter compared to the Elliott Wave Indicator I bought for 6 times the price elsewhere. I m a Ninjacators fan for life and can only recommend Ninjacators to anybody who is using the NinjaTrader platform."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ann Bailey",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T14:08:00.000Z",
          "Titre": "I m a huge Ninjacators fan",
          "Contenu": "I m a huge Ninjacators fan. The indicators Ninjacators has are like a turbo boost for the NinjaTrader platform. Everybody that uses NinjaTrader NEEDS to check out Ninjacators."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg Suro",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T02:37:41.000Z",
          "Titre": "Great customer support!",
          "Contenu": "Quick very Helpful Reply.  Great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J C",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T17:42:32.000Z",
          "Titre": "Ease of purchase experience",
          "Contenu": "Ease of purchase experience. No sales pressure felt. Besides loving learning about the Ninjacators program/product line"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John tombini",
          "Nb_Reviews": 8,
          "Date": "2023-11-17T01:36:08.000Z",
          "Titre": "I have so impressed with response time…",
          "Contenu": "I have so impressed with response time whenever there is an issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George from Texas",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T18:59:41.000Z",
          "Titre": "Nice communication to get the software…",
          "Contenu": "Nice communication to get the software up and running, follow-up emails are nice touches too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Bolton",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T07:43:18.000Z",
          "Titre": "Ninjacators have put me on the path to…",
          "Contenu": "Ninjacators have put me on the path to trading success and dear I say....life-changing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T19:19:31.000Z",
          "Titre": "Micheal solved the problem…",
          "Contenu": "Micheal solved the problem quickly….thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nodoskey Motley",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T05:16:10.000Z",
          "Titre": "Ninjacators Offer Real Value",
          "Contenu": "There's a indicator and tools that helps plus the opportunity to get funding."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Georgia Carter",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T15:39:38.000Z",
          "Titre": "I took the 5 day trading workshop and…",
          "Contenu": "I took the 5 day trading workshop and purchased the associated NinjaTrader indicators. What a great company that not only sells you indicators but also shows you how to make money with them in live demonstrations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T Gerwin",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T21:03:13.000Z",
          "Titre": "Outstanding Customer Service",
          "Contenu": "Outstanding Customer Service. Their \"Love it or Replace it\" promise truly delivers. Prompt, accommodating, and top-notch products. Special shoutout to Abigail for her expertise and assistance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Savino",
          "Nb_Reviews": 3,
          "Date": "2023-09-25T22:36:24.000Z",
          "Titre": "Kyle showed and gave specific chart…",
          "Contenu": "Kyle showed and gave specific chart examples of the strategy being discussed. This made the strategy much easier to understand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessie Clemons",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T07:25:10.000Z",
          "Titre": "If I could give 6 stars",
          "Contenu": "If I could give 6 stars, I would! Your customer service is the best. And I'm not only talking in the trading industry, I mean THE BEST I have every experience anywhere."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carole Gray",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T14:37:23.000Z",
          "Titre": "It took me just one Ninjacatos product…",
          "Contenu": "It took me just one Ninjacatos product to see consistent result. The best part, it was only $17 for that mini course.Anyone out there, please don't waste your anywhere else. Join Ninjacators and see for yourself. They are the best."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clayton Frank",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T21:07:13.000Z",
          "Titre": "The weeklong seminar that they provided…",
          "Contenu": "The weeklong seminar that they provided was outstanding. I learned a lot of new techniques as well as coming to understand the why of some of the techniques that I already knew."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bogdan Anghel",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T00:28:11.000Z",
          "Titre": "Very prompt response",
          "Contenu": "Very prompt response, thank you!"
        }
      ]
    }
  ]
}