{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "notarize.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pete R",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T21:05:58.000Z",
          "Titre": "Rude customer service",
          "Contenu": "I tried to get a postal form notarized for mail forwarding. There were multiple steps to verify my identity, including questions and pictures of documents (without an option to upload files I had). I eventually made it through to a person, who was very unfriendly, made me take pictures again, and finally informed me that the IDs did not match, and canceled the session. He suggested to try again - which would have required going through the entire process again. What a complete waste of time!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bill Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:21:02.000Z",
          "Titre": "Where the hell are my documents",
          "Contenu": "Where the hell are my documents, and why were they never forwarded to me and our pmb?   We’re just finding this out now."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ljube Todosov",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T00:29:25.000Z",
          "Titre": "Dont use this services they ll sell your personal information from the verificationprocess!",
          "Contenu": "I want you to immediately remove all my personal data you have stored ! As well you  sold my persobal information  to 9 diffrent including ussearch.comInstatcheckmate.comPublicrecords.comIntelius.comAnywho.comZabasearch.comAddresses.comTruthfinder.comYellowpages.com. If you file here you can find your info exposed to all the hackers to easily create a profile about you!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sarah Albers",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T07:38:09.000Z",
          "Titre": "Rude and Unprofessional Notary",
          "Contenu": "This was the first time I've notorized a document online. The notary came online and was instantly rude and annoyed at me. No hello or hi. Nothing. I tried asking simple questions about what I needed to fill out and he actually became angry with me and lectured me on what a notary's job was and wasn't. He ended the call by simply hanging up on me. Literally, he just hung up after notarizing my document. It was a terrible experience. I would never recommend getting notorized online. A complete lack of professional. I literally want my money back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "pushie A",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T02:00:05.000Z",
          "Titre": "Trying to get my Form 1583 Notarized…",
          "Contenu": "Trying to get my Form 1583 Notarized required by iPostal.com and I need it done online to ship internationally yet the questions are answered correctly but it would still fail you. I have been on this for days because it locks you out for 24hours. Zero stars if possible as no one can help yet I have one company already verified but they won’t use that for my other companies."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Mustafa",
          "Nb_Reviews": 5,
          "Date": "2023-10-03T16:25:23.000Z",
          "Titre": "I am required to get my Form 1583…",
          "Contenu": "I am required to get my Form 1583 Notarized by iPostal.com and the only notary they use to get this done from Notarize, where Notarize's Proof.com has a document scanning system that does not recognise international documents in my case Indian Passport. And the worst part is that customer support has no answers and no resolution, the only thing they say is to keep trying, and we cannot help you. I tried for 4 days but yet nothing worked and I gave up."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KB",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T16:35:35.000Z",
          "Titre": "Tried numerous times to get documents…",
          "Contenu": "Tried numerous times to get documents processed, but there was always some sort of technical issue.  I'm on a T1 fiber line with more than enough bandwidth.  Twice, a notary came on camera and then quickly covered his camera and didn't reply to chat messages.  This is probably the worst online service I've run into in quite some time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Clifford Evans and Carolyn Eva",
          "Nb_Reviews": 3,
          "Date": "2023-09-08T16:28:23.000Z",
          "Titre": "I literally spent days trying to figure…",
          "Contenu": "I literally spent days trying to figure out how to use this app. Granted, my knowledge of computers is limited however that would tell me that simpler instructions were needed. Even after reaching out i was again instructed  to go to yet another site!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Josue Valdez",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T03:35:17.000Z",
          "Titre": "Need to accommodations people with hearing impaired.",
          "Contenu": "I am hard-of-hearing and cannot hear of what the person is saying. He kept asking the same question over and over again when I told him I don’t understand. He is somewhat patient but have the audacity to say ‘please listen to me’ multiple times. Which that is harder even after I cannot hear. I believe it should have captions when the person is speaking or types/write in order to accommodate people with hearing impaired."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "C Pugh",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T15:11:48.000Z",
          "Titre": "three things notorized wrong",
          "Contenu": "We had three things notorized. The notary changed our state and county at top of the acknowledgement page to their state and county. This made the notarization invalid and our county clerk would not accept it. I also verified with the NNA that this was done incorrectly. We asked for a refund and were to told no. This was their last response to us.\"I appreciate the response. We always strive to leave our customers 100% satisfied. I realize that may not have been the case for you this time around. We continually strive to improve and would appreciate any additional feedback. We look forward to better serving you next time at Proof.Take care,Antwanette"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LJ",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T19:20:29.000Z",
          "Titre": "System is terrible & takes forever",
          "Contenu": "Was extremely difficult to establish my identity.  Regardless how many times I gave \"access\" to my camera on my phone (iphone 13 pro), it wouldn't work.  I rebooted my phone, tried both Google and Safari browsers.... finally after over an hour of attempting it finally worked.  We used the remote notary as a convenience, it turns out it would have been more convenient and quicker to go to a bank or UPS store and have it done!  Will NEVER use this service again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike B",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T02:26:04.000Z",
          "Titre": "Avoid at all costs.",
          "Contenu": "Your five multiple choice questions had multiple correct answers. Resulted in a correct answer chosen but ultimately scored incorrect. Resulted in being locked out. Notary identification requirements are not standardized across states. Resulted in a moving target to have the correct identification to begin the process. We ended up with notaries from Texas when we live in Minnesota. Best to avoid this service if at all possible and find a local notary to take care of your needs. This is what we did after struggling to get through the online process."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amanda Panda",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T01:10:27.000Z",
          "Titre": "I purchased the business/residential…",
          "Contenu": "I purchased the business/residential address package and wanted to include my adult kid as well. Having them also do the 1583 doc to notarize is fine and makes sense however iPostal1 and Notarize run seamless and speak to each other. The Notarize agent had no clue each person in the household over 21 needs to fill this out per IPostal1. Agent kept advising paper didn’t need to be signed at all and yet IPostal1 said 💯 yes. This made our process and all the proof just insane to deal with. One hand doesn’t talk to the other!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert GV",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T17:55:40.000Z",
          "Titre": "DO NOT USE THIS SERVICE!!!",
          "Contenu": "DO NOT USE THIS SERVICE!!!Most city and local county office does not accept digital type notary. Notarize.com do not offer refunds. I did not see any disclosures regarding this on their website. Went to UPS Store for the notary. It was quicker and cheaper."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "B G",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T00:19:23.000Z",
          "Titre": "Nightmare!",
          "Contenu": "Notary assigned to us refused to go through transaction because wife’s drivers license only has one of her two parts of hyphenated last name even though we had marriage license in hand to show entire name. Have closed on at least a few dozen real estate & notary transactions using same name/license over past 10+ years without ever a problem. Went and closed in person at title office down the road about 2 hours later  - again no problem using same info. This notary could have cost us millions by holding up our sale. Will never use this service again."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Breezy Baldwin",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T23:24:51.000Z",
          "Titre": "Notaries give bad advice, no refund",
          "Contenu": "Needed a power of attorney notarized. It included a place for two witnesses signing. On the call, I explained to the notary why I needed the PoA. She said \"it’s asking for witnesses. I can cross those out, you don’t necessarily need witnesses, it’s up to you\". Trusting her expertise, I said ok. Turns out, I did need the two witnesses. Notarize customer service said since she \"gave me a choice\" they would not refund. I said if she hadn't said \"you don't necessarily need witnesses\" I would not have forgone them. Terrible advice and service and now I've missed an important deadline."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SMITH",
          "Nb_Reviews": 5,
          "Date": "2023-08-11T14:20:09.000Z",
          "Titre": "Incredibly difficult to use",
          "Contenu": "Incredibly difficult to use. And time consuming. Took me a half hour to get through all their silly questionnaires and the video conferencing didn't work. It works with everybody else but not with your company. I have a live notary just a mile away and it takes me a lot less time to go there and it is much more efficient. I will never use your company again. And the live notary is less expensive. I paid a premium for inferior service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles H",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T12:39:49.000Z",
          "Titre": "Software is Weak",
          "Contenu": "Software is bad. Tried to show my DL with my high quality Logitech camera and it wouldn't capture the image without blurring. So shifted to the camera on my phone and that worked but it took about 20 minutes (with live assistance) to figure out that my Logitech camera wouldn't work properly for this task."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James M.",
          "Nb_Reviews": 3,
          "Date": "2023-11-15T18:02:57.000Z",
          "Titre": "Not accepted by the US passport office",
          "Contenu": "The notarized documents from notarize.com were NOT accepted by the US passport office. We had to resubmit documents notarized by an in-person notary, and the total process took an additional 6 weeks at least."
        },
        {
          "Note": 1,
          "Lieu": "KR",
          "Pseudo": "AH P",
          "Nb_Reviews": 4,
          "Date": "2023-01-05T20:51:20.000Z",
          "Titre": "We had connection issues",
          "Contenu": "We had connection issues, the staff kept hanging up. I fixed the problem by moving closer to the router. Mexico has poor internet connection. Another person did not know what a Canadian land title document meant. I explained to her - it's a deed. She continued to argue its meaning and hung up on me! THIS IS NOT PROFESSIONAL"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cryztal Sayle",
          "Nb_Reviews": 2,
          "Date": "2023-05-25T15:22:03.000Z",
          "Titre": "Made us waste a day and never worked",
          "Contenu": "The website never let us take pictures of our id so we couldn’t move forward. The app gave a message that said transaction not supported on the notarize app. We wasted a day trying and even support couldn’t help.  We ended up having to see a live person anyway the next day."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Wenoval",
          "Nb_Reviews": 2,
          "Date": "2023-08-31T12:24:51.000Z",
          "Titre": "Very poor explained process",
          "Contenu": "Very poor explained process. Customer service is terrible, they did not know how to solve the error I had, they had no idea . After more than a month of trying to get through the process I finally figured out by myself what was wrong. The notary however was nice"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Clark",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T05:08:02.000Z",
          "Titre": "Nothing but glitches throughout the…",
          "Contenu": "Nothing but glitches throughout the process. Tried 4 different devices (Apple and Android: phones, tablets and laptops). Caused us to close late on our house. If there were negative stars that's what I would have left in the review."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tye Tyson",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T02:37:39.000Z",
          "Titre": "I had to complete the forms 6 times…",
          "Contenu": "I had to complete the forms 6 times since ID upload would not complete.  When I finalized upload and was transferred to notory agent, after initial question, their connection terminated.  This prompted me to re-log in to complete the process yet again.  After completion, the agent would not connect,; I later found out this because my signing had to be reassigned to another agent.  Had to complete process again.The concept is convenient, not having to go into title company, but the process needs work."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Daniel E Vasey",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T04:14:31.000Z",
          "Titre": "Does not work \"anywhere\" without some tweaking",
          "Contenu": "Their website says anywhere, anytime, but after going halfway through the process they told us we need a US residential address.We tried again and used a US address from 12 years ago. The verification went through and we got a helpful notary.Dear Notary.com: on the verification page you should ask for \"present or most recent US address.\""
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LaChandra Gerring",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T15:28:51.000Z",
          "Titre": "Find a cheaper notary service",
          "Contenu": "Please note, they charge $25 for notary services you can easily go get for free in your neighborhood or for a couple dollars. I had a horrible experience with them where I got a document motorized for services that were cancelled immediately for the wrong address and they wanted to charge another $25 to notarize the new document. Unless you live in a remote area, do it the old fashion way."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "sArAh Henriksen",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T10:15:01.000Z",
          "Titre": "My Power Of Attorney is not accepted in…",
          "Contenu": "My Power Of Attorney is not accepted in a title office in New York. Time and money wasted…When I asked for a refund, they told me they can’t do it..Very disappointed. Timing was  crucial in my situation. I lost at least 3 days of it"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "EBC",
          "Nb_Reviews": 7,
          "Date": "2023-07-11T04:53:24.000Z",
          "Titre": "I had the misfortune of dealing with a…",
          "Contenu": "I had the misfortune of dealing with a really unhelpful guy called Mohammed.He didn't seem to understand the document he was reading to me and wasn't capable or willing to find any solution. It seemed like he was just trying to get me off the call as fast as possible rather than offering the minimum level of help, really disappointing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brayden Hill",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T01:11:28.000Z",
          "Titre": "US passport: valid ID?",
          "Contenu": "She would not accept my US passport as valid ID; insisted I retake pictures of my Texas drivers license under the pretense, “In Texas you cannot use a passport as ID.” I am unsure of the validity of this, but the hyperlink provided for accepted forms of ID included passport. Also, was very robot and monotone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jasmine Pastones",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T00:56:48.000Z",
          "Titre": "I was unable to use document",
          "Contenu": "There was a piece of information that was filled out incorrectly - the state and county at the top left. I had written the state and county that I was going to be turning the documents into. However, apparently, it should have been the state and county the documents were notarized in. I just feel that the notary should have known that as that's not exactly commonly known information in my opinion. I wasted $55 using y'all just to get documents I couldn't use and had to re-notarize it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sasha",
          "Nb_Reviews": 2,
          "Date": "2022-06-22T16:09:46.000Z",
          "Titre": "Horrible customer service",
          "Contenu": "Horrible customer service, will never use again.  This was my first time using the service, document had lines missing the person on the video call never advised to fill them prior to notarizing.  So the document is useless to me now.  Asked to do it over or refund , and was refused.   Usually when you see notary in person they advise you, where to initial ,  and sign.  These guys don’t care just quickly stamp and move on.  Hard refusal to redo or refund was upsetting.  Will never use again."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Jack Holden",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T11:23:17.000Z",
          "Titre": "Terrible",
          "Contenu": "Terrible. Nothing works. Every single touch point failed upon using this service. Wasted 5 hrs of my day. Finally got connected and the notary disconnected the call. No follow up and they expect you to start the process again. Don’t believe the reviews. This service is terrible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Na'imah Ra",
          "Nb_Reviews": 2,
          "Date": "2023-04-13T00:07:07.000Z",
          "Titre": "Will never intentionally use their service again",
          "Contenu": "I attempted to have a document notarized 8 times. I was given conflicting information. I was hung up on by the same Notary twice and all they could do was take my complaint. I'm assuming all of the notaries are privately contracted and are not required to be professional. I was also told I couldn't be directly connected to Notary that could handle my situation and after hours of searching I found one on my own."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Miranda Hourula",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T16:11:56.000Z",
          "Titre": "This website does not accurately…Don't use this site if you actually need a New York Notary",
          "Contenu": "This website does not accurately advertise its services. I used this website because it says it's a 24/7 notary serving the people of new york. Following my services I found out I was paired with a Florida notary. I complained to customer service and asked for a refund and they refused. I told them it's absolutely ridiculous to have a website that advertises serving the people of new york and have no new york notaries."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jayd",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T22:11:43.000Z",
          "Titre": "Identity theft fraud after notarize.com",
          "Contenu": "I worked with a notary based in Florida this morning to get my identity confirmed for a PO Box. This afternoon I had several applications to loans attempted in my name (based out of Florida - go figure). Thankfully I think all were denied. Do not work with this company. I was directed to them by ipostal1.com, which will be my next company to review (and they didn't care at all and were quite rude). Seriously, if you can use a real, in-person notary then please do so you don't risk identity theft like has happened to me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mr. `\\v/'",
          "Nb_Reviews": 2,
          "Date": "2023-06-21T03:00:08.000Z",
          "Titre": "i did EVERYTHING asked talked to your…",
          "Contenu": "i did EVERYTHING asked talked to your notary paid and everything was perfect then , few hours later I get a couple of MORE emails to do it ALL again so you are either trying to scam me or someone from your end is sleeping on the job ! Adding insult to injury nobody is answering my emails or even attempting to explain why this is happening and why you're asking me to pay and do it over again !!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Linda Baxter",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T03:30:29.000Z",
          "Titre": "I was unable to use the system due to…",
          "Contenu": "I was unable to use the system due to the security questions. Some of the questions were pulled from excessively old facts I simply could not remember. No options to skip questions you don’t know.  Disappointing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rena McGill",
          "Nb_Reviews": 1,
          "Date": "2022-06-21T15:08:39.000Z",
          "Titre": "The notary who assisted was not helpful…",
          "Contenu": "The notary who assisted was not helpful at all. My experience with Notarize.com has not been positive. I am now being asked to provide additional ID's for other team members when the notary rep could have told me that would be a requirement, just to set up a virtual mailbox. A great deal of wasted time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Courtney Fults",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T17:48:18.000Z",
          "Titre": "We were supposed to have both my…",
          "Contenu": "We were supposed to have both my husband and I sign and our information validated and mine was requested twice and then the notary said that was because he had to call in on his own but that was not correct.  Then it seemed she was new and didn’t really know what was supposed to get done."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Dziekonski",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T18:40:54.000Z",
          "Titre": "Not recommended.",
          "Contenu": "Each Notary has different rules about how to do this. Took three tries to get one page notarized. The first notary inserted today's date for their license expiration date. The second notary put next year for \"today's date!\"  If you have to make sure the notary knows what year it is, there is a problem. I would not recommend this service at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barry H",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T01:32:54.000Z",
          "Titre": "I wound up spending 45 on documents I…",
          "Contenu": "I wound up spending 45 on documents I didn’t need notarized and not getting the documents I needed notarized. The process was confusing and notary notarized the 3 forms of ID instead of the document. No refund, no allowing me to do the one document for free. Wasn’t fair."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Disappointed Customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T06:39:45.000Z",
          "Titre": "Terrible Experience",
          "Contenu": "If I could give it a zero, I would.  Multiple attempts to try to get a document notarized, then Notarize wants you to change your browser, same problem occurs, and they charge you $25 for every attempt.  So I was charged $100 and still didn’t get form notarized.I do NOT recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Manuel Velez",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T01:07:04.000Z",
          "Titre": "Terrible service",
          "Contenu": "Terrible service. I was referred to use notarize from Transamerica to roll over a 401k to my IRA. I used the Transamerica link to Notarize but the notary uploaded my signed document on their retail portal. Transamerica will only accept the notarized document if uploaded to them by Notarize.com. Notarize keeps telling me they can’t do that because it was processed through their retail division. I’ve paid the notary fee as requested and Transamerica will not accept the notarized document if sent to them by me. The Notarize reps will not send me to a supervisor as I have requested multiple times."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "BRYAN ANDAYA",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T01:40:30.000Z",
          "Titre": "We had to call 4-5 times for a simple…",
          "Contenu": "We had to call 4-5 times for a simple notary due to problems with audio. Also, when I tried to seek assistance, the notary assumed it was an interpreter and refused to move forward. This took much longer than necessary."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Molly",
          "Nb_Reviews": 5,
          "Date": "2022-09-16T11:02:44.000Z",
          "Titre": "DON'T WASTE YOUR TIME!",
          "Contenu": "I connected with 3 notaries, 3 different times and each one could not notarize my document for various reasons, none of which were my fault.  One of the reasons was that the notary couldn't get the notarize.com website to send me a link to verify the ID of my 2 witnesses.  I went to so much trouble to provide 2 witnesses not related to me, only to have the notary say \"sorry I can't help you\".  I jumped through all the hoops, and still couldn't get my document notarized.  MASSIVE WASTE OF TIME!  DON'T WASTE YOUR TIME WITH THIS SITE."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tracy Martinez",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T18:36:10.000Z",
          "Titre": "Color didn’t match my skin tone",
          "Contenu": "The color didn’t match my skin tone, so I reached out to find out how to replace the makeup.  It has been over 48 hours, and I have yet to get a response.  Spending almost $100 on a bottle of foundation and concealer that I can’t use is pretty upsetting."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MG",
          "Nb_Reviews": 1,
          "Date": "2022-11-25T01:18:43.000Z",
          "Titre": "Overstepping their bounds",
          "Contenu": "The notary wanted to read a 120-page contract. His only job is to confirm that I am who I am, not decide whether the contract is good or bad or right or wrong. Notaries are here to prove that the signatory is who they say they are and that they are ok with signing the document. He wouldn't notarize for me and hung up the call."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Independent Voter",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T16:02:05.000Z",
          "Titre": "Identity theft waiting to happen",
          "Contenu": "If you use them for ipostal.com, it's identity theft waiting to happen!!!  Neither my phone or computer would allow their photo id software to work. I attempted to take the photo of my drivers license eight times, six from my iphone and twice from my computer. When I got connected to the customer service rep, she had the nerve to ask me to disable my Norton to allow the software to work!  Are you kidding me? Run like hell from this company. Why do they need your location, ability to track you, and show you ads to notarize a document? Thank God for Norton or these crooks would have had my drivers license on the dark web for sale."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hazel",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T23:40:25.000Z",
          "Titre": "The lady said I’m all set but I still…",
          "Contenu": "The lady said I’m all set but I still got a text and email to do my notary after I signed and paid the notary and I have not receive my daughter’s birth certificate"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel K",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T10:43:43.000Z",
          "Titre": "I paid to use this service to close on…",
          "Contenu": "I paid to use this service to close on a property purchase I needed to complete while traveling overseas. I arranged my itinerary to sign the paperwork right after it became available at 12:01 CST. I completed the identity verification, uploaded copies of the documents, and so far I’ve been waiting for close to 4 hours for the notary to show up. I’m about to miss my flight. They are boasting 24/7 service, which is absolute nonsense and a blunt lie. I would not trust them with getting a credit card receipt signed at Starbucks and they definitely have no business facilitating a $600,000 Real Estate transaction."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richelle Lloyd",
          "Nb_Reviews": 4,
          "Date": "2023-02-26T18:28:12.000Z",
          "Titre": "Huge waste of time.",
          "Contenu": "The questions they ask to verify you kept coming back as another person. None of the questions were correct.  Kept locking us out and we could not notorize anything.  Complete waste of time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "M B",
          "Nb_Reviews": 2,
          "Date": "2023-05-24T19:48:23.000Z",
          "Titre": "Terrible on-boarding and user…",
          "Contenu": "Terrible on-boarding and user experience.When I got into the room with the notary, she said a few things then asked if it was okay to be recording the session. (1) There was no notice before entering the room that they would video record (2) It was already recording -- before I said \"yes\".  Then, when I got uncomfortable and started asking questions and expressing my concern about this process - including the fact that I'm in my home - she abruptly ended the session.Which meant that she DELETED all of the documentation and information I provided in the LENGTHY setup / on-boarding process. I had START OVER for asking legitimate questions.  Users should be transparently explained the process.Users should not be asked for consent for something that a business has already started doing, after the fact.This company has intentionally made it hard for users. And has not adequately trained its notaries to provide \"actual\" customer support. It's trained them to end calls if any questions arise."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "next level Research",
          "Nb_Reviews": 14,
          "Date": "2023-06-21T07:50:02.000Z",
          "Titre": "I had a very bad experience with a…",
          "Contenu": "I had a very bad experience with a highly unfriendly and incompetent agent. The 2nd agent who tried to solve my problem was extrem unprofessional. The last agent (3rd) was easy going and had fixed my problem easily."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Erica Reynolds Clayton",
          "Nb_Reviews": 2,
          "Date": "2023-08-12T18:39:28.000Z",
          "Titre": "Incorrect Information",
          "Contenu": "Well, the notary was so desperate to get it signed that he told me we could add witnesses after the fact and that is not true as we can't alter the document now that he has notarized it.  I want my money back.  Thank you!"
        },
        {
          "Note": 1,
          "Lieu": "PA",
          "Pseudo": "Steve Tyler",
          "Nb_Reviews": 3,
          "Date": "2023-01-19T22:23:23.000Z",
          "Titre": "TERMS AND CONDITIONS ARE ENDLESS",
          "Contenu": "Notarize require the whole document to be uploaded not just the page where they witness your signature.  After I uploaded the document, I was redirected to a page with 5 links to contractual terms and conditions that I needed to accept.  I clicked on the first link that was a long contract of terms and conditions with about a dozen more embedded links and off to the sides were 4 more links to additional supplemental terms and conditions.  This was only the first link of some 4 or 5 links that I needed to accept.  If it was simple terms and conditions, no problem.  I'm not willing to agree and accept some 100 pages of terms and conditions for someone to notarize 1 page."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jesa H",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T22:26:28.000Z",
          "Titre": "I asked your notary prior to getting…",
          "Contenu": "I asked your notary prior to getting notarized if it was acceptable in California for me to have a digital notary she said yes, that it was acceptable and I found out later that it was not which delayed my application for my birth certificate, which further delayed my application for housing and put me at risk of losing the spot open to rent at this facility for disabled people. I’ve been on the waitlist since 2018. And to make matters worse when I ask for a refund because I explain my situation, and I am not able to use this notarized document have to go pay for another notarized document. They did not give me a refund. Never using service again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Trace",
          "Nb_Reviews": 3,
          "Date": "2023-05-12T01:59:20.000Z",
          "Titre": "End-to-end horrible",
          "Contenu": "One of the worst online processes I've ever encountered. Online features don't work well. Reps -- that you HAVE TO talk to -- hang up after 1 second of technical problems that THEIR app causes."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Jesús Rodríguez",
          "Nb_Reviews": 5,
          "Date": "2023-08-05T08:07:11.000Z",
          "Titre": "Very poor service and management.",
          "Contenu": "I would like to make a complaint about the Notarize.com service. No one was able to solve the problem to notarize my document. They have a bad online customer service and a disastrous management software for document verification. In the end I had to carry out my management with another professional and efficient provider."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sonia Swank",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T12:27:53.000Z",
          "Titre": "Document was supposed to be notarized…",
          "Contenu": "Document was supposed to be notarized for business purposes and yet the copy I have does not show the notarization and that information was also not sent to the appropriate people who needed to receive that. I have been dealing with this issue now since July 13th and have no resolve."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Luisa Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T05:45:38.000Z",
          "Titre": "Latinophobia - rude notary",
          "Contenu": "The process to get the verification was very smooth but the notary we had was very rude. Spoke really fast and was not considerate that English is my second language. I understand and speak English but the notary was very very rude about it and hung up. Best to get a mobile notary to do the job for you instead"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Kiernan",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T17:05:27.000Z",
          "Titre": "aGENT DID NOT KNOW THAT THE DOCS COULD…",
          "Contenu": "aGENT DID NOT KNOW THAT THE DOCS COULD NOT BE DIGITALLY SIGNED - SO MAKE SURE IT CAN BE DONE AND WORKS BECAUSE IT DOES NOT FOR NC CAR TITLE DOCS - ORIGINALS ONLY. WASTED $70."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Digger",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T23:15:52.000Z",
          "Titre": "Technology failure; no ability for human over-ride",
          "Contenu": "This process would have been great except that the automated system that confirms identity would not accept my, valid and current, government issued Driver's License and therefore couldn't confirm my identity.  No one could tell me why my license wasn't accepted.  As a result my closing was delayed 5-days and I incurred additional expense and work absences in order to make the closing happen. (I had to have my passport fedex'd to my location). Overall, I understand there can be technology glitches, however, a human should be able to intervene and fix the problem especially with something as financially important as a mortgage closing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T08:32:22.000Z",
          "Titre": "Terrible User Experience",
          "Contenu": "Had to use notarize for a remote settlement. It was a terrible user experience and the app constantly crashed. It was so bad the whole experience actually became quite laughable. Would never use it again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "No",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T01:20:08.000Z",
          "Titre": "Zero Stars Not An Option",
          "Contenu": "Meetings with notary kept dropping out (not due to my internet connection), forcing me to validate my identity over and over again. Additionally, the capability of the notaries was wildly different and I had to sign a document over 4 times due to incompetence. Would give zero stars but that is not an option."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ayo Are",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T13:32:16.000Z",
          "Titre": "NONEXISTENT CUSTOMER SERVICE - YOU'RE JUST A NUMBER TO THEM.",
          "Contenu": "The notary did a good job of notarizing the document, but she was in Virginia, and I needed a New York notarization after coming across the following NOTARIZE.COM website: (LINK REMOVED) I was under the impression I'd get a New York notary. It's my fault for not inquiring if she was a New York notary. Then again, she didn't ask either. There was no customer service number for me to call. I requested via customer service that they rectify it, but I continued to get nowhere with nonexistent customer service that you could tell really didn't care. I understand this happens to a lot of New Yorkers. I eventually found an alternative solution independently. You're best advised to exercise extreme caution, review your documents, and determine in which state you require notarization prior to contacting notarize.com for future assistance."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Su",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T01:35:01.000Z",
          "Titre": "2 agents did not connect successfully",
          "Contenu": "2 agents did not connect successfully. I had to go thru verification 3 separate times to do this notary call"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marie",
          "Nb_Reviews": 4,
          "Date": "2023-10-15T08:52:41.000Z",
          "Titre": "Not accepted. Refused refund",
          "Contenu": "I used them for a change of address document that was not accepted by the company due to the fact that the notary was not in a neighboring state and they refused to refund my money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terry Grimsley",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T01:06:16.000Z",
          "Titre": "Hung up on us",
          "Contenu": "The notary kept complaining on the signing taking too long. He hung up on us after 2 of 8 documents were completed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sean Jelen",
          "Nb_Reviews": 4,
          "Date": "2023-07-03T01:32:19.000Z",
          "Titre": "I have to keep getting support for…",
          "Contenu": "I have to keep getting support for notorial errors on documents or billing errors. They’ve all been satisfactorily resolved, but I’m spending my time fixing mistakes that weren’t mine."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Smj",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T21:25:11.000Z",
          "Titre": "Overcharged/Poor customer service",
          "Contenu": "I was overcharged due to what is an issue with your system and customer service refused to remedy the situation.  Very disappointed and will follow up with both TIAA and Notaruze management."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 2,
          "Date": "2023-01-14T19:40:36.000Z",
          "Titre": "Notarize doesn't have any notaries",
          "Contenu": "Between yesterday and today, I have initiated 5 different sessions with Notarize to have this document notarized. I've waited hours and hours longer than Notarize's estimated wait time. Today, I contacted Notarize, and the woman I chatted with said she sees fewer notaries available than usual, said that the average wait time is 10 minutes (even though I've waited well over 30 minutes EACH time),  and told me to try a different day or contact iPostal to see if they can help me get it notarized. I cannot keep delaying this, as I already have my mail starting to forward to this new address tomorrow. This experience has been incredibly slow and awful thus far. Can someone please help me notarize this document? I used Postscan Mail on 3 separate occasions in the past for several businesses of mine, and the notarize process was always instant. Clearly, Notarize is not a very good notary solution. Please help me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Luke",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T21:11:52.000Z",
          "Titre": "Frustrating",
          "Contenu": "Sign on process was easy, providing documentation to prove my identity went smoothly, but when attempting to get on a call with one of their notaries they were not present and was frustrating. Lack of customer support only made this worse, especially once they locked my account after booting me from the meeting."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dale Stoffer",
          "Nb_Reviews": 2,
          "Date": "2023-07-19T17:52:08.000Z",
          "Titre": "Notary didn't sign in block 14a so I…",
          "Contenu": "Notary didn't sign in block 14a so I was refunded and had to start over. I'm using another notary so they don't waste my time again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Abby James",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T15:26:30.000Z",
          "Titre": "They can't notarize out of state",
          "Contenu": "They did not tell me that someone from out of state can't notarize a document. I paid and now they refuse to refund. Shouldn't they know these things?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dan Disappointed",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T01:00:02.000Z",
          "Titre": "Worst Customer Service Ever",
          "Contenu": "I applied for a notary which I got done very easily. But the payment process was a failure.I couldn't make a payment.  Your customer service couldn't send me a link to pay.  They kept saying I have to log into my account. What account I never made an account or set a password. I didn't even know the company name or website. Because I got a link from a mail box service to use you for notary. Customer service kept telling me to log in. Where am I to log in no links provided and what's my user name. Finally I tracked the name down to a website. I used my email address but with no password set I had to forgot password to set a password to log in.I made several attempts to pay with failure. Again customer service not a clue.I figured out it was because their system wouldn't accept the data being auto filled so I erased everything manually typed it in the it worked.This service is nice. Customer service is useless"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amos Eno Gallery",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T18:06:34.000Z",
          "Titre": "I am in NY and I got a notary in FL",
          "Contenu": "I am in NY and I got a notary in FL. I asked her if it was okay that she was in FL, and she said yes, but when I submitted my document to the state agency I needed to, they said I needed a NY notary."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeffrey",
          "Nb_Reviews": 3,
          "Date": "2023-08-16T02:11:10.000Z",
          "Titre": "They only have one job to do and they failed",
          "Contenu": "They only have one job to do and they failed. We were closing on a house. My wife & I have been married 42 years and she has always had her maiden name on her drivers license but they would not notarize because of it. We have bought 5 houses over the years and never was that an issue. So we were not able to close. They failed and I would NOT use them again."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Mata David",
          "Nb_Reviews": 3,
          "Date": "2023-06-16T23:44:07.000Z",
          "Titre": "so complicated to get verfication of…",
          "Contenu": "so complicated to get verfication of ids while photo are super clear, plus the link sent to phone is not working properly"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary F",
          "Nb_Reviews": 2,
          "Date": "2023-05-25T16:58:34.000Z",
          "Titre": "The technical \"glitch\" on the evening…",
          "Contenu": "The technical \"glitch\" on the evening of my house closing and the hurried manner in which they tried to get me to resign everything left a bad impression."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "amir imanzadeh",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T01:25:43.000Z",
          "Titre": "The form was notarized wrongly which…",
          "Contenu": "The form was notarized wrongly which delayed my work and I had to pay twice although it wasn’t my fault, the agent filled the form incorrectly"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alexis Dobson",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T01:01:06.000Z",
          "Titre": "Do better",
          "Contenu": "The generic response: Congrats! On your closing was insensitive giving the loss of a loved one was the reason why we had to sell!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Ferri",
          "Nb_Reviews": 1,
          "Date": "2022-07-13T01:14:58.000Z",
          "Titre": "Do not use this notary service use a manual review instead - this website is a total scam",
          "Contenu": "Do not use this notary service, it is terrible. Do it manually. I had very important documents to notarize.  I needed to upload my ID, they could not handle that on a computer so I uploaded from my phone.After using my phone to get to the notary, their systems were unable to verify my Drivers License.  So they cancelled the notary call and told me to go through again.There is a section where they give you credit score questions about you.  I had passed this 6 times. Now all of a sudden they start asking me questions that are not about me. So I failed 2 times in a row.  Now I'm locked out for 24 hours for having to answer questions that were likely the wrong questions.Then I went to customer service and customer service did not check ANYTHING.They just told me it was all my fault and that I need to be more careful and try again in 24 hours.They took absolutely no accountability for their failures and did not check the integrity of their own systems.  Repeat: This system is a SCAM DO NOT USE IT!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julijus",
          "Nb_Reviews": 3,
          "Date": "2023-04-06T13:32:38.000Z",
          "Titre": "Very rude staff",
          "Contenu": "Very rude and unprofessional staff. Was not tring to help or find a solution. It seemed like she doesn't give a damn and she doesn't care even if it's her job. Evetualy she just hanged up."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Tangorre",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T19:09:05.000Z",
          "Titre": "Generic notarization not allowed in New York",
          "Contenu": "I needed a document notarized and specifically searched for a notary for Ulster County, New York. The company specifically stated they can support the request. After completing the A/V check and uploading identification. The notary was from Florida; this was unknown until after payment was made. New York State only allows remote online notarization:N.Y. Exec. Law § 135-C4. Types of electronic notarial acts.(a) Any notarial act authorized by section one hundred thirty-five of this article may be performed electronically as prescribed by this section if: (i) for execution of any instrument in writing, under applicable law that document may be signed with an electronic signature and the notary public is reasonably able to confirm that such instrument is the same instrument in which the principal made a statement or on which the principal executed a signature; and (ii) the electronic notary public is located within the state of New York at the time of the performance of an electronic notarial act using communication technology, regardless of the location of the document signer.The company would not refund fee; notarized document completed by this company is not accepted in New York. I do not recommend this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JLR",
          "Nb_Reviews": 2,
          "Date": "2023-05-26T02:01:33.000Z",
          "Titre": "The court won’t accept this notary!!",
          "Contenu": "The court won’t accept this notary!!! What the actual F’n flip- You lied to me.   And I asked her twice if it was as valid as any notary.   And now I’m going to miss the filing deadline!!! I’m SO p*ss*d off.   What a total waste of time and money and I’m so scr*wed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Uphappy",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T03:33:04.000Z",
          "Titre": "I gave this rating as the iPosatl1…",
          "Contenu": "I gave this rating as the iPosatl1 company has never opened the box for me at all so I see it as a Rip off"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Devante Walker",
          "Nb_Reviews": 4,
          "Date": "2023-05-24T00:57:19.000Z",
          "Titre": "Filled out form wrong. Dont use",
          "Contenu": "Filled out form wrong. couldnt use it not to mentiom the seal is not an actual stamped seal.Bank wouldnt accept it. asked about a refund and was told no even though they filled out form wrong.I have already filed a dispute with my bank."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Asad Karim",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T05:49:22.000Z",
          "Titre": "made me wait for hours and no one would…",
          "Contenu": "made me wait for hours and no one would come online to notarize. it would say wait until the next available agent and just wait and wait and wait. wasted a couple of hours of mine."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike M",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T01:38:25.000Z",
          "Titre": "Let the customer see the document they…",
          "Contenu": "Let the customer see the document they are notarizing before the notary is finished. Don’t wait until after they are don’t to show the customer the document."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bob Fagan",
          "Nb_Reviews": 2,
          "Date": "2023-08-11T13:47:56.000Z",
          "Titre": "I could not use your service the FEDS…",
          "Contenu": "I could not use your service the FEDS REQUIRE INK SIGNATURE STATE STAMP SEAL !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Katrina Shegog",
          "Nb_Reviews": 2,
          "Date": "2023-08-11T08:08:49.000Z",
          "Titre": "Notarized document wasn't valid",
          "Contenu": "Notarized document wasn't valid.  Had to pay again to have it completed.  Wasted $25."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eli Harper",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T23:37:05.000Z",
          "Titre": "Nobody accepts the online notarization",
          "Contenu": "Nobody accepts the online notarization. All I've gotten out of this is wasted time and money."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Eli Brown",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T06:20:20.000Z",
          "Titre": "Waste of time!",
          "Contenu": "Just waited in a set meeting for 15 minutes for the zoom host to never join and then say the meeting was complete"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gregory Goshgarian",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T14:25:31.000Z",
          "Titre": "The notary service was efficient",
          "Contenu": "The notary service was efficient, and quick. However the notarization stamp was illegible, rendering it void additionally the state of the notary required additional approval documentation which was not provided, rendering it additionally void. If the steps were taken to make the seal clearer for online to print format, and notaries provided all documentation per their state this would be an excellent and effective service. However I was required to obtain alternative notary service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cody Snider",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T01:00:53.000Z",
          "Titre": "Not good",
          "Contenu": "The dingdongs didn't give me a NY notary and I had to get it redone locally. $25 down the drain."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Raphael Jaramillo",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T00:55:14.000Z",
          "Titre": "Notary said it would be acceptable and…",
          "Contenu": "Notary said it would be acceptable and it wasn’t accepted. Wouldn’t issue a refund."
        },
        {
          "Note": 1,
          "Lieu": "CR",
          "Pseudo": "bri roma",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T00:23:03.000Z",
          "Titre": "imposible to complete a call",
          "Contenu": "Tried 3 different times, all of them being dropped the all , without any reason."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maria Munoz",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T00:09:37.000Z",
          "Titre": "I am still waiting for the 2 property…",
          "Contenu": "I am still waiting for the 2 property deeds we changed to the name of our Living Trust"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-17T16:56:45.000Z",
          "Titre": "Virtual notary and signing weren’t…",
          "Contenu": "Virtual notary and signing weren’t accepted, we were told it would be fine by Notarize and it was not."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "nevonb",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T02:11:00.000Z",
          "Titre": "It would work then not work to the…",
          "Contenu": "It would work then not work to the point where I had to use 2 different devices to finish after an hour."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christy Milner",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T03:16:31.000Z",
          "Titre": "Not very helpful when issues arise",
          "Contenu": "I used this service for the first time today. The transaction was quick and easy however, when I received my document, it was not readable. I reached out to ask for a cleaner copy and was told I would need to resubmit and pay again. That was the only option. They said it was u readable as I used my phone but that is an option they offer. My photo to them was readable, their finalized copy was not. Customer service was polite enough but insisted there was nothing to do except resubmit and pay again. So I'm out $$ and will have to do this again but using an in person service so I am assured of the quality of the document."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Emmanuel Oladejo",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:52:22.000Z",
          "Titre": "Customer Service is HORRENDOUS",
          "Contenu": "Proof is a great platform ran by slightly unintelligent people. As a notary be careful, their response times are OUT THE ROOF and there is no phone number you can call for help. You can pay for a subscription plan for on demand phone service, that doesn't give you \"Onboarding Service\". The onboarding team only responds via email they cannot be reached via phone. All I did was change my signature and my account was suspended until the signature was approved, which is reasonable, Proof why does it take 3 days to look at my signature and approve it, why is that simple task that can be easily resolved with a simple phone call, go to a committee WITH NO PHONE NUMBER. Whoever thought of this idea did not give it enough thought, I think we need to go back to the drawing board with this one. YOU'RE LOSING US MONEY!!!!!!!!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-08-11T18:07:50.000Z",
          "Titre": "Get it together",
          "Contenu": "The random notary didn't give us one in our state that would follow florida laws. It took more that 15 tries to get a notary we could use, which os ridiculous. The notary team set up our forums incorrectly so our witness couldn't sign making us have to wait for forms to be fixed then go through the process of finding a usable notary again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "InsertNameHere",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T23:08:33.000Z",
          "Titre": "Going through this process was stressful",
          "Contenu": "Going through this process was crazy stressful.  The notary (who I rated highly) and I ran into several glitches, not her fault, and it was obvious we didn't see the same things on our screens.  I shouldn't have been in the position to problem-solve their process, which I had to do. At other times, the terminology used was confusing/misleading.  In an urgent situation I would use this service again, guardedly.  Otherwise it won't be the resource I was hoping for."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Fertig",
          "Nb_Reviews": 4,
          "Date": "2023-09-07T00:59:22.000Z",
          "Titre": "We specifically asked for a notary from…",
          "Contenu": "We specifically asked for a notary from Florida for a title closing and we had to go thru the process 3 times b/c they have no way to assign them. The support people were non existent, and when we finally got to them they could not resolve the issue and advised us to \"keep trying\""
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Belinda",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T14:24:41.000Z",
          "Titre": "Didn't catch/warn about error",
          "Contenu": "Turns out I got one field incorrect on the mail forwarding form, and now I have to go through the entire process again. Neither the tool to fill out the form nor the notary caught it or told me it might get rejected. Now I have to pay another fee to do the process so over again. Otherwise the notary was cheerful, the meeting quick, and I thought everything was going to go through fine."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "M T",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T02:08:15.000Z",
          "Titre": "Battling the Notarize.com robot!!!  Connected with Google Chrome instead!",
          "Contenu": "When I finally got connected, after hours talking to a robot that said Notarize only worked on Safari & wasted over 6 hours of my time trying to get it to work on Safari & went to Google-Chrome & logged in & the bot sent a link to my g-mail & it started working finally...  The Notary in Texas was great five stars, BUT, notarize.com needs to fix the robot problem of it telling people that they only use Safari!!!!  I got it to work on Google Chrome!!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Not the momma",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T01:37:22.000Z",
          "Titre": "Split session",
          "Contenu": "Split session.  First went well with knowledgeable and helpful notarySecond started off with incorrect data and I had to suggest what document they needed to find to get things set up rightTook 2 hours.   Could have been communication between first notary and second or familiarity with handling a split owner home sale"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matthew Frye Castillo",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T20:12:12.000Z",
          "Titre": "Good in theory, ultimately a huge headache",
          "Contenu": "Works like a charm about half of the time, but the times it doesn't work ends up becoming a huge headache. Ultimately not worth it. Zero protection/refund if government agencies don't accept the notary. As an organization, when you purport to deliver a solution then repeatedly fail but continue to market as if you do, that's called a scam."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mini",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T23:55:53.000Z",
          "Titre": "RPP8K8KH only notarized one document",
          "Contenu": "RPP8K8KH only notarized one document. Two were uploaded. So had to do another session.3G5KSUJ notarized but failed to get the witnesses signatures. So, again had to do another session.I spent $75 when I should have spent only $35."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kim Chan",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T02:47:05.000Z",
          "Titre": "Difficult to get to an actual notary",
          "Contenu": "We needed to notarize a form with 2 signatures. It took over an hour before we got to an actual notary. The first time we loaded the form it assigned my name to the first and second signer. We couldn’t figure out why - there were no prompts saying to replace my name with the 2nd signer’s name. We exited and tried 3 more times and were never given a choice to load a document for 2 signers. Tech support was no help - it would only give instructions for 2 signers in different places with 2 different computers when we were in 1 place with 1 computer. Eventually we found the first document we loaded for 2 signers and when my name came up the 2nd time we replaced it with my co-signers name and it worked. The process was frustrating and exhausting."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pamela Bergman",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T00:59:35.000Z",
          "Titre": "Your app is NOT Firefox compatible",
          "Contenu": "Your app is NOT Firefox compatible, although you claim it is.   I had to load Google Chrome, jump through its setup hoops (many), and then complete the process.  You should figure out why your app is not working correctly with Firefox, since more people use that than Chrome.  Very annoying and stressful experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SD wilson",
          "Nb_Reviews": 2,
          "Date": "2023-05-23T23:56:59.000Z",
          "Titre": "PASSPORTS",
          "Contenu": "PASSPORTS: I don't recommend if trying to have a parent sign a DS-3053. I received refusal saying passport issuance will not accept an electronic signature. I emailed Notarize and received a response telling me that it's legal and to send them a pin to verify. The government is NOT going to type in a website and a pin....It was a simple process, I really wish it had worked. But the stress and delays it caused to rectify wasn't worth it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel Schoener",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T03:27:15.000Z",
          "Titre": "It took 3 attempts for a notarized passport",
          "Contenu": "It took 3 attempts to get my document notarized. 1) My camera was tested to be ok, but then didn't come on. Had to start the whole process again2) Got matched to an attorney who couldn't notarize a passport, even tho it was clear that a passport needed to be notarized3) It worked"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Fake Name",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T01:00:20.000Z",
          "Titre": "The notary was great and was helpful…",
          "Contenu": "The notary was great and was helpful but the website is awful. I spent 45 min adding boxes for initials and signatures only for the notary to tell me the website had an error and then I had to sit there for another 30 min for him to redo it. Furthermore I couldn't get the pdfs to load correctly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Mowery",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T19:10:50.000Z",
          "Titre": "Software Issues",
          "Contenu": "I had all kinds of difficulty understanding how to use the Notarize software. It took me several attempts and a lot of time to be able to use it. Once I figured it out, the process went well. I am not a software expert. But I am an intermediate user, and I have successfully used eSign with ease on several previous online transactions. It would be very helpful for first time users like me to have a better set of how-to-use instructions that include screenshots of each step.When I first accessed/opened Notarize is asked if I was logging on myself, or if my wife and I were logging in together. I selected together, but the software would only accept my signature. So, we had to do log on separately and each sign all the pages. This took essentially twice the amount of time to do all the signatures. It would have been a lot more efficient it we could have logged on together and both of us could sign each page."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Care about online safety",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T19:45:45.000Z",
          "Titre": "Terrible security but notary person was great",
          "Contenu": "The human notary was great but this website has poor security and seems to be set up by Twitter developers who are trying to cash in on my personal information. It does not even show the lock icon in the url line which my local credit union doesUnfortunately by the time I had to interact with this company it was too late to changeI am just hoping my information wasn’t compromised"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Newbie",
          "Nb_Reviews": 2,
          "Date": "2023-09-02T01:28:01.000Z",
          "Titre": "Have the Technical Help Number Before You Start",
          "Contenu": "Initially, the process went well; but, then it went sideways. There was a step in verifying identity where a form of identification had to be photographed. it started of talking about using a smartphone; but only gave the optional way, using your computer camera, on that page. The computer camera could not get a focused enough picture for the info to be read by the system doing the verifying and we could not get it right after multiple attempts as it’s a Facetime camera and not a read the fine print camera. Once we called and got technical help, we found out we just had to keep going through the steps to get to the smartphone method. My suggestion would be to NOT let the optional method be used on the initial screen and have more precise and informative instructions as to the process to photograph your ID."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lady Ninja",
          "Nb_Reviews": 3,
          "Date": "2023-07-01T03:18:56.000Z",
          "Titre": "It's LAME When Your Service Saves People Money, Until They Get Your Bill & They've Saved ZERO",
          "Contenu": "The service was easy enough but logically, it makes no sense to me that I was charged almost TWICE as much, had I done it somewhere in the city. Getting something notarized online means BOTH the notary & I don't have to get ready, get in our cars, waste money on gasoline, pollute the air with having to drive, put wear and tear on our vehicle: this mode of getting something notarized costs SOOO much more time, money, and energy than popping on a zoom sesh for 5-6 minutes, so why does notarize.com gotta ruin such a good thing by making it cost me twice as much money?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brittany Edwards",
          "Nb_Reviews": 3,
          "Date": "2023-05-21T03:26:04.000Z",
          "Titre": "Such a great concept but buggy…",
          "Contenu": "Such a great concept but definitely needs improvement. Instructions weren’t clear in terms of what documents and what needed to be filled out vs. left blank. And then it was just buggy. Took forever to approve microphone and video, and not sure it was on my end. System just didn’t want to respond. This has so much potential but I almost gave up and was planning to see an in person notary! So they must do better."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "maggi hall",
          "Nb_Reviews": 19,
          "Date": "2023-08-19T01:18:40.000Z",
          "Titre": "A nightmare",
          "Contenu": "The notary was sooo patient and helpful. The program was a nightmare!! And I'm a realtor. Never experienced such a nightmare. I had to begin again 3 times. For 4 signature spots it took almost an hour to get it to work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 4,
          "Date": "2023-08-13T01:36:34.000Z",
          "Titre": "The first notary didn't speak English…",
          "Contenu": "The first notary didn't speak English well enough for a notary. He tried his best repeating and emphasizing words, but I couldn't understand what he was saying.So, he cancelled the notarization.That resulted in me having to start from scratch. It's about 10-15 minutes of dancing with your phone, trying to take the pictures of your IDs for the system's liking.Also: for the 2nd time, you have to create an account on the notary site. It takes an additional time.The notarization itself (time with the notary) kind of quick. However, because I had the 1st notary who didn't speak English well enough to be a notary, it took me about 45 minutes total, instead of the promised 10-15.It's very unpleasant and boring experience, too. Taking ideal pictures making sure light is perfect, angles are perfect, etc. I challenge you to take a perfect picture of your SHINY passport that wants to close on its own 5000 times. To make sure you understand what I am talking about. THEN you have to take a picture of the page with the signature in the same manner, etc."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Beth A",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T03:09:17.000Z",
          "Titre": "Good directions are needed",
          "Contenu": "The instructions provided were scant, and those that did exist were insufficient and wrong.  The only reason I am giving 2 stars is because when I was finally able to get through to connect with the notary, HE was terrific.  The system itself is NOT intuitive, which without clear direction is a disaster."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Prisca Gloor",
          "Nb_Reviews": 4,
          "Date": "2023-05-24T01:17:59.000Z",
          "Titre": "It is a great concept",
          "Contenu": "It is a great concept, but…It would be good to do all the work and then being able to schedule an appointment It did not take the 2nd pic for the second person (just a black box) and I  had to redo the pics and questions about five time. We got to a notary and that person just disappeared. I had the option to go to technical/customer support but when I clicked on it, I could only restart the whole process. Fortunately, it did work then"
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Steve",
          "Nb_Reviews": 3,
          "Date": "2023-04-12T15:23:15.000Z",
          "Titre": "Website and app are buggy and unreliable",
          "Contenu": "First, I would like to say that when I finally got through to a person, my experience was great, my complaints are all about the lousy tech gauntlet that Notarize forces me to navigate before I can get that far. In particular, the ID check took me over an hour! On the web site, the first page of my passport seemed to load with no issue (the website used my camera to take the picture). However, before I could get a picture of the requested signature page, a pop-up obscured the page and there was no way to continue (except to click \"my camera is not working\" which was not the problem). This happened on multiple attempts using two different up-to-date browsers (Chrome and Edge). I then tried an iPhone 7 which hung trying to get the second picture. I had to boot it and restart Safari with no open tabs to finally get it to work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T03:44:13.000Z",
          "Titre": "I’m giving two stars to the notary that…",
          "Contenu": "I’m giving two stars to the notary that came to our house on 4/4/23. Title company was suppose to get signed papers overnighted but no tracking number was ever sent and we had to get another notary to get house deal closed on time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kevin Groome",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T11:33:51.000Z",
          "Titre": "Ecommerce checkout is unnecessarily difficult",
          "Contenu": "The ecommerce checkout facility is clumsy and counter-intuitive. The help team was responsive and courteous via chat (thank you, Antwonette!), but there really should have been no need for assistance on something so simple."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Wanda Lee-Floyd Wingate",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T22:13:28.000Z",
          "Titre": "Getting the correct help or assistance  is complicated",
          "Contenu": "Getting help, on this site, is very complicated. I have been trying to gain my Notary seal to upload to send with my application to the Secretary Of Commonwealth, but to no avail.I have been trying for almost two weeks and still haven't received the assistance I need. I need a site that will assist, and get the issues needed handled in a timely manner. I am NOT getting that here. A refund seems to be in order due to this issue."
        },
        {
          "Note": 2,
          "Lieu": "BE",
          "Pseudo": "Brian Grafton",
          "Nb_Reviews": 2,
          "Date": "2023-06-20T21:05:36.000Z",
          "Titre": "During my notary appointment the notary made a mistake and it cost us 5 hours!",
          "Contenu": "During my notary appointment, we were disconnected from the notary toward the end (we were almost done!) and the notary apparently did something incorrectly that locked the documents and we couldn't resume signing to complete the document package!  We had to contact our lender and get them to reissue a new package and that took 5 hours to accomplish."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Peter f Moore wapco investment",
          "Nb_Reviews": 1,
          "Date": "2022-06-21T16:36:08.000Z",
          "Titre": "Customer service was great",
          "Contenu": "Customer service was great. Notary did a good job. Interface was easy and straight forward.The problem: notarized documents were rejected by county courthouse, so I payed in vain…"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gene",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T07:10:41.000Z",
          "Titre": "Doc not accepted by US govt agency",
          "Contenu": "Notarized a doc for the US govt. the notary was rejected because the notary was from FL & was in CA. Doc rejected, money wasted. I have to now find & pay a CA notary."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bill Valls",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T01:06:22.000Z",
          "Titre": "Identity verification needs improvement",
          "Contenu": "My original 2 identity verification surveys were incorrect and I had to repeat the process 24 hrs later.  Ok the 3rd attempt the information was correct including what was clearly a question that did not have my data (useful to sort out an imposter).   Unfortunately, it also had a significant misspelling."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Doe",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T15:12:35.000Z",
          "Titre": "The process did not work on my phone",
          "Contenu": "The process did not work on my phone.  Could not connect to my camera.  I have a new 5G capable phone.  The process worked fine one I used another device.  Notary person was fine/no issues there."
        },
        {
          "Note": 2,
          "Lieu": "CO",
          "Pseudo": "Sebastian Reyes",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T01:02:04.000Z",
          "Titre": "I had to try more than 5 times because…",
          "Contenu": "I had to try more than 5 times because it took more than 1 hour to answer, really bad! I was finally able to do it and the person who helped me was super kind!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "C Swaffer",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T16:29:45.000Z",
          "Titre": "Billing for this has been a struggle…",
          "Contenu": "Billing for this has been a struggle and there is very little customer support on the issue."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Craig Iskowitz",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T20:52:29.000Z",
          "Titre": "The verification process froze the…",
          "Contenu": "The verification process froze the first time Abs I had to go through the entire thing again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Walter Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T01:19:17.000Z",
          "Titre": "Cumbersome System",
          "Contenu": "Please resolve the glitches with the status of signing parties. Please provide timely support who actually resolve issues."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "maserati girl",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T15:31:59.000Z",
          "Titre": "Waste of time & money",
          "Contenu": "It took 3 agents and 2 hours to complete! Compete waste of time and money. Definitely wasn't worth $25."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Phil & Shel",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T06:18:38.000Z",
          "Titre": "On the way for a good product but NOT there yet",
          "Contenu": "The notary was awesome and made the experience palatable.  BUT if I knew it would take sooooo much longer to sign my sellers docs with this method I definitely would not have done it.  It took me 4 times longer to use this product!   Typing in ALL the info on the form… I didn’t expect.  When I reviewed the docs ahead of time I Assumed they would be filled in when I signed…. As that was the norm the 8or 9 times I’ve bought and sold houses. Then I was a POA on this property, so I had to also type in two additional names and conditions (as attorney in fact).  Really?! How about a macro to fill that in? Or have it preprinted?  For Michigan the number of documents I had to sign were fewer than I’ve done for other states but again, it took me longer than ANY other signing I’ve done (in California, Washington and Michigan) I thought “notarized” would be efficient, but it was NOT. It took almost 4 hours from the review the doc to signing off of the call.  Had I known I would have had someone come to my home again from a local branch of the title company with preprinted forms and signed them in half or a third of the time “notarized” took. To the company: I recommend 1) sending the docs early ie day before…and advising people to read over and letting them know they’ll be filling them out.  (Fortunately I had most of the info on hand … but not all of it!). 15 min I was advised in email to review docs before getting on line is not enough time to review them.2) establish macros or click boxes for proxies or POAs.. way too time consuming to type in their names etc. 3) explain the process NOT just how to get on line, so people have the data in front of them (If it’s truly a necessity to type in the data with online notary).I think you have many elements of a good product but until you further develop it and reduce the interface time I will not use it again. Thank you for asking! I wish you good luck to further develop it. 😊"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "PEDRO RODRIGUEZ",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T14:53:55.000Z",
          "Titre": "THE LADY WONT HELP ME JUST BECAUSE MY…",
          "Contenu": "THE LADY WONT HELP ME JUST BECAUSE MY SON WAS NEXT TO ME, THE AUDIO WAS AWFULL, VERY RUDE..."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Tom Boekbinder",
          "Nb_Reviews": 4,
          "Date": "2022-06-25T21:50:05.000Z",
          "Titre": "I did not receive a receipt or copy of…",
          "Contenu": "I did not receive a receipt or copy of notarized document.  Paid and nothing in return.   Customer support seems non-existent."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Yacine Tazi",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T01:17:48.000Z",
          "Titre": "My notary public was amazing",
          "Contenu": "My notary public was amazing, she was extremely nice and professional but  it was a challenge to get confirmed before getting to her…I answered all the questions truly and to the best my knowledge and ability but it kept denying me until it denied me entry"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Albert Romanowski",
          "Nb_Reviews": 2,
          "Date": "2023-06-23T16:52:54.000Z",
          "Titre": "had to scan photo ID's for an hour…",
          "Contenu": "had to scan photo ID's for an hour before it would accept one"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jos",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T02:39:42.000Z",
          "Titre": "Classic bait-and-price-later game",
          "Contenu": "Classic bait-and-price-later game - No price was posted, disclosed, nor given, until I completed everything - then the price charged was roughly 3x-5x what I am accustomed to paying for this service, but by then I was hooked -Poor business practice, and unethical.JoePS: the service performed was adequate, but that's not the point."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Online user",
          "Nb_Reviews": 1,
          "Date": "2022-05-07T23:22:30.000Z",
          "Titre": "The experience I had with notarize.com…",
          "Contenu": "The experience I had with notarize.com was a bit frustrating. The first public notary did not respond very quickly and the video session dropped the signal. The public notary in the first attempt also did not appear very professional. I had to re-enter and verify my information three times. Ultimately, I was able to connect to a public notary and get my documents notarized. I feel the technology investment is not quite there with this service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kb",
          "Nb_Reviews": 1,
          "Date": "2022-05-22T23:37:46.000Z",
          "Titre": "My person that helped me was great",
          "Contenu": "My person that helped me was great. The only issue is that I was getting a birth certificate document notarized and the application got returned to me because they don't accent e signatures for the application. Now I have to re do everything and pay AGAIN for this. How did they not know this?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Unsatisfied User",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T15:14:21.000Z",
          "Titre": "I was upset that there was no…",
          "Contenu": "I was upset that there was no indication of the price until after the notarization had been done. I had thought it would be a covered fee by my financial institution as a complimentary service, but then was slapped with a $25 bill at the step for downloading the notarized document. I just felt like I was misled by not knowing how much it would cost, and since I had already gone through with the notarization, I just kept it and paid the fee. It was not worth doing again. Next time I will get my documents notarized for free at my local bank. Still upset about this because I felt misled."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MedEx Reviews LLC",
          "Nb_Reviews": 1,
          "Date": "2022-04-14T05:35:56.000Z",
          "Titre": "They have a fair notary service and…",
          "Contenu": "They have a fair notary service and have much to learn about customer service.   We have had several of their notaries make mistakes and it takes customer service too long to respond to problems.  Like next day.  Then the answer is to have the person go back online and do it again with another notary.  Terrible response time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "WDH",
          "Nb_Reviews": 2,
          "Date": "2022-03-07T18:00:20.000Z",
          "Titre": "Not 100% compatible with Adobe Acrobat",
          "Contenu": "The completed notarization comes in a PDF file that is not 100% compatible with Adobe Acrobat unless you go in and make a bunch of changes to your computer.  This is a problem that really needs to be fixed in order for this product to be effective.  I don't want to send the person who requested this notarization an explanation as to why it says the notary's signature is not valid if it's opened in Acrobat. Won't use again until this is fixed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christopher Manning",
          "Nb_Reviews": 1,
          "Date": "2022-03-23T02:23:45.000Z",
          "Titre": "Notaries are great, support is poor",
          "Contenu": "The notary was great and the whole process was quick. However the finalized document I had notarized and received had the signature partially covered rendering the document invalid. I contacted support immediately and was told I would get a response in 24hrs. It has been 3 days have not heard back from them."
        },
        {
          "Note": 2,
          "Lieu": "AE",
          "Pseudo": "Alfred H Miller",
          "Nb_Reviews": 1,
          "Date": "2022-02-10T14:59:05.000Z",
          "Titre": "Notary was super impatient",
          "Contenu": "Notary was super impatient with me when the technology to take the photo of my signature did not work so well. His compensation must quite low given the reasonable price of your service. I gave up after he complained about the time and selected one of the prefab signature texts. Not sure if the folks I am working with will accept the notary or not; we’ll see. If it’s accepted no issues. If I have to do again, then I’ll probably go with another firm."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2022-03-26T13:18:56.000Z",
          "Titre": "Good service but too much sharing of…",
          "Contenu": "Good service but too much sharing of private information for no valid reason.  A government ID is required for a notary of signature not almost the entire social security number tied to other identifying information that could obtained ( assumption your selling ) and used for identity theft or worse ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2022-03-08T14:12:31.000Z",
          "Titre": "It took at least 5 tries over two days…",
          "Contenu": "It took at least 5 tries over two days to get one document signed and eventually required the ticket to be forwarded on to engineering to manually fix whatever the issue was.The price was good but there are definitely some technical issues that need to be ironed out before I'd recommend this to anyone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 3,
          "Date": "2022-03-23T18:26:55.000Z",
          "Titre": "I needed a document notarized that the…",
          "Contenu": "I needed a document notarized that the agent told me needed to be done by a Texas notary.  They put me back in the cue and could not route me to a Texas notary.  They told to me to keep trying until I, by chance, was connected to a Texas notary.  Are you kidding?  Your service needs some work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kristi A Carter",
          "Nb_Reviews": 1,
          "Date": "2022-05-07T02:18:17.000Z",
          "Titre": "I gave a poor rating because Notary.com…",
          "Contenu": "I gave a poor rating because Notary.com should know if documents are legal being notarized outside of California for a California resident. We had to have our docs notarized again in California to be valid.The notary herself was a wonderful and helpful person."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julio Cesar Nunez",
          "Nb_Reviews": 1,
          "Date": "2022-03-22T21:23:46.000Z",
          "Titre": "Carefull",
          "Contenu": "So they're job is to double check and verify with you that the information given is true. Well google autofilled some lines in for me after i already filled them in. The notarizer never pointd out the fact that a both the names of the husband and wife were the same. 140$ down the drain."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matthew Cuddy",
          "Nb_Reviews": 1,
          "Date": "2021-12-13T15:12:51.000Z",
          "Titre": "The service works well BUT my lawyer wouldn't accept the docs!",
          "Contenu": "The site is easy to use, and the notary who helped me was great. BUT, my lawyer wouldn't accept the out-of-state notarization on divorce settlement documents that we have to submit to the court (in MA). So, I did it in person with a lawyer here for $3 after spending $35 at Notarize for electronic docs I couldn't use. Next time, I'll just use a local notary."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Darakshan",
          "Nb_Reviews": 1,
          "Date": "2022-01-08T16:11:08.000Z",
          "Titre": "Smooth and easy",
          "Contenu": "I Jane used this service twice. My phone was not able to scan my ID - the camera view comes up as a black window on my iPhone13 Pro Max. Maybe I was using Chrome instead of Safari. Fortunately I also had my laptop. Otherwise it was smooth and easy and well worth it - since I’m not in the US and embassies have super limited access."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "nathaniel boddy",
          "Nb_Reviews": 1,
          "Date": "2021-11-12T21:48:29.000Z",
          "Titre": "The notarization was not accepted",
          "Contenu": "The notarization was not accepted, so my form was rejected by the institution. I paid 35$ to for one notary signature that was notarizing my wife and I's signature. The document was rejected because it was not \"Docusigned\". If you are electronically signing a document, it should be docusigned. This company does not provide that, so in many situations you will be wasting your money. Experience was good otherwise."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SeanO",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T21:47:46.000Z",
          "Titre": "the notary herself was delightful BUT",
          "Contenu": "the notary herself was delightful - but attorneys deemed it not valid and required actual ink - naturally after payment and the entire process was completed.  I feel like either notarize should make you aware that some states or regions would not accept it, or the platform should be smart enough via its questions to know."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nathan Beck",
          "Nb_Reviews": 1,
          "Date": "2022-03-28T15:03:01.000Z",
          "Titre": "I felt the process awkward and…",
          "Contenu": "I felt the process awkward and disconnected. I ended up paying for two signatures even though I only needed one. My suspicion is the way it is set up on SignNow and how it is interpreted on your end. In any case I don't anticipate recommending it to my co-workers."
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "Margaret J. Carpenter",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T13:53:00.000Z",
          "Titre": "Your web page was extremely difficult…",
          "Contenu": "Your web page was extremely difficult to access!  Once I finally got in your security questions were a little difficult.  Who can remember the zip code of a house sold 16 years ago? Two days ago I finally got to a notary but she she was extremely unhelpful so I told her i’d try again with someone else. Yesterday, I went through the whole process again.  This notary had no problem and guided me through the signing process with ease!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ronald Jay Smolow",
          "Nb_Reviews": 2,
          "Date": "2021-10-23T15:05:33.000Z",
          "Titre": "i was overcharged for this notary…",
          "Contenu": "i was overcharged for this notary service. i had one document notarized. iit needed a notary stamp in 3-4 places on the form. i asked the notary, who was very nice, would there be more than one charge . she told me there would only be one fee ($20). instead the invoice was for $45. i was pissed off, but after spending 20-25 min , paid it. this was not right!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Traci Stone",
          "Nb_Reviews": 2,
          "Date": "2022-02-23T14:52:55.000Z",
          "Titre": "Spent an hour with a notary for a…",
          "Contenu": "Spent an hour with a notary for a mortgage package. When I received the documents the entire loan doc package was not signed. I contacted chat and was told there was no way to correct and no refunds. I paid $85 and did not have a valid document. I had to do it all over again"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amy B",
          "Nb_Reviews": 1,
          "Date": "2021-08-20T15:13:41.000Z",
          "Titre": "Frustrating app",
          "Contenu": "I used the app to take a photo of my documents and they uploaded horizontal instead of vertically for some reason. Once I was connected with a live notary he was unable to flip the document resulting in me having to start the whole process over. What could have taken 15 min ended up taking well over an hour of troubleshooting and using a 3rd party app to scan the documents, save them and upload them to this app. Frustrating."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Krance",
          "Nb_Reviews": 1,
          "Date": "2021-08-20T13:25:33.000Z",
          "Titre": "Check regulations before using.",
          "Contenu": "The notarize process is simple and easily executed. Unfortunately the notary was out of state. The state of Texas DMV does not accept electronic signatures and the notary from Virginia would not sign on the document but attached a separate document with the notary signature, which is also not allowed in Texas. $25 for nothing. Suggest anyone using this service be certain electronic signatures are allowed and whether notary attachments are allowed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "LAURA",
          "Nb_Reviews": 1,
          "Date": "2021-11-04T23:23:29.000Z",
          "Titre": "Needs upload ability",
          "Contenu": "Needs upload ability! Inexplicably, the process forces you to take a photograph of supporting documents rather than simply uploading a picture or PDF. I wasted $25 and a good deal of time trying to print and photograph a utility bill, which was then just later rejected because the photograph was too blurry."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kristi Pond",
          "Nb_Reviews": 1,
          "Date": "2021-06-22T14:37:09.000Z",
          "Titre": "I am hired by Escrow companies and RE…",
          "Contenu": "I am hired by Escrow companies and RE Attorneys to meet with their clients and sign documents. The notarize.com platform is not set up for my business and doesn't allow me to access the signed documents after the signing is complete. I have to ask the customer that signed the documents to email them to my client. This does not work for my business and has made it tough for me to use this platform."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Audra",
          "Nb_Reviews": 1,
          "Date": "2021-08-06T15:19:16.000Z",
          "Titre": "Easy experience, but unfortunately did not work",
          "Contenu": "The experience was easy, but unfortunately the digital notarized documents were not accepted by the attorney and I ended up having to go get them re-notarized in person.  I wish it would have worked because it was easy and convenient and the notary was super polite, but unfortunately digital notarized documents are not accepted most places."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jessica Parker",
          "Nb_Reviews": 3,
          "Date": "2021-10-20T23:52:06.000Z",
          "Titre": "Notarize pays the Notary $5 and charges you $25.",
          "Contenu": "Notarize.com charges $25 as a base transaction charge which covers one document and one notarization (seal) and $10 for any additional seal. However, they only pay the Certified Notary $5 out of the base transaction fee and $1 for any additional seal. The company makes bank and pays the notary pennies."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cathy Green",
          "Nb_Reviews": 1,
          "Date": "2021-09-27T13:21:51.000Z",
          "Titre": "Efficient but not knowledgable",
          "Contenu": "While this was quick and efficient, the Notary that helped me didn't know all the places that needed to be signed on the document I had. I asked where it needed to be signed. She just replied with the question where do you need to sign? I didn't know and wasn't sure. She was of NO help and I ended up paying for a notarization in some places and blank in another where it needed to be signed. Now I have to pay AGAIN for the same document to have my signature on there notarized. I am truly unhappy."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mehdi Moeini jaghervand",
          "Nb_Reviews": 1,
          "Date": "2021-06-18T18:15:53.000Z",
          "Titre": "The first step of notarizing happened…",
          "Contenu": "The first step of notarizing happened fast but the problem is in proving it to other parties. your support in this regard is poor and I am loosing a lot of money as they are asking me to prove it. there is actually no tools for this purpose in your website. Third party has asked the solicitor by e-mail a few days ago but no response yet."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MommaBair",
          "Nb_Reviews": 2,
          "Date": "2021-07-21T14:03:13.000Z",
          "Titre": "Modifications for elderly",
          "Contenu": "I was assisting an elderly man who could not hear the notary. He was also struggling with seeing the computer screen. When I attempted to assist him I was told that the notary would not notarize the process if I didn’t remain quiet. I understand that the notary wanted to be sure he wasn’t being forced into the process, however, when completing the process of withdrawing money from a retirement account, there should be modifications made for those who struggle with seeing and hearing."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "KB",
          "Nb_Reviews": 1,
          "Date": "2022-01-13T13:27:22.000Z",
          "Titre": "Caution: Professional service - but not widely accepted",
          "Contenu": "I was quite impressed by this service. Professional, organized and a fairly seamless process. However, when I submitted the notarized documents to L.A. County, the notarized documents were rejected and I will now have to find an alternate solution. If the party receiving the documents will accept something notarized by Notarize.com, then you're in luck. It is a handy service. However in case they don't, I highly recommend that you confirm ahead of time with whomever is requesting the documents to cover yourself and save yourself some time and money."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas Meininger",
          "Nb_Reviews": 1,
          "Date": "2021-02-02T17:22:14.000Z",
          "Titre": "The files I received were in a zip file…",
          "Contenu": "The files I received were in a zip file that didn't extract easily as others I;ve done before and even Tech support had problems, also your contact email site gave only an error code and your contact phone # consistently gave a message that it wasn't a valid #, so customer service was zilch and It still appears that the document, which I uploaded and finally was acknowledged, hasn't shown up in my account!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anthony G",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T14:37:31.000Z",
          "Titre": "Great people, terrible tech.",
          "Contenu": "The woman was great, but their platform is the worst. The first notary that came on couldn't hear me or I couldn't hear her and instead of allowing me to fix it, 45 seconds in, she just disconnected and I had to go through it all again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Beverly Sheppard",
          "Nb_Reviews": 1,
          "Date": "2021-09-18T16:14:35.000Z",
          "Titre": "Out  of State Notary not valid",
          "Contenu": "Though the agent was very efficient in stating his purpose, one thing he failed to mention us that a Texas notary is not valid in New York State. The website should also prominently display this information that certain states may not accept out of state notaries. I want my $25 back!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alex Freeman",
          "Nb_Reviews": 1,
          "Date": "2021-06-03T01:03:57.000Z",
          "Titre": "Our bank stated they needed an…",
          "Contenu": "Our bank stated they needed an electronic journal or record made by the notary for the POA that was electronically signed. I asked for you to provide this since I paid for a service you provided. However you gave me confusing instructions. I'm 80 years old, why can you not just provide these documents?"
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "Su",
          "Nb_Reviews": 2,
          "Date": "2020-12-05T03:24:11.000Z",
          "Titre": "your website support tips page is down.",
          "Contenu": "your website support tips page is down.your agent tried all sorts of ways to help, but not trained enough to solve the problem.Your website could not read my webcam that I use on regular basis w zoom.No, zoom was not on when I was on Notarize.Very clumsy desktop app. Slightly better phone app, which is not really secure for important documents.Phone app does not allow you to sin on paper and scan. I had to sign with my finger tip. Looks weird."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "yelena v usmanova",
          "Nb_Reviews": 1,
          "Date": "2020-10-30T15:10:38.000Z",
          "Titre": "I waited almost 2 hours on-line for…",
          "Contenu": "I waited almost 2 hours on-line for next available notary as well as for about 45 min for my document get done. I previously used notarized.com and they were more efficient. I found big differences in process of notarization and felt it was not as thorough. At the end, document looked finished and accepted by requesting party. I suggest to improve scheduling/waiting time and have documents prepared during on-line time with customer."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Cassandra",
          "Nb_Reviews": 1,
          "Date": "2021-01-05T14:20:59.000Z",
          "Titre": "Great if you have a PC, not for IOS",
          "Contenu": "I had a document sent to me for a new job. It said I could use IOS so I tried multiple times on my iPhone, the app kept crashing at the end of the review step. I tried on my iPad, same problem. Tried in a chrome tab but it would force use of the app, which crashed. Both IOS devices had all appropriate system updates. Finally, I had to borrow a PC and then it worked great. I had a long wait for a notary but I didn’t mind that part. He was very nice and helpful."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2020-09-19T15:18:39.000Z",
          "Titre": "Incomplete Job",
          "Contenu": "I’ll explain the low rating:  When I contacted TransAmerica, who was to receive my notarized documents from notarize.com, I was informed that page one was missing. This was a very important, time-sensitive document that I entrusted to the care of notarize.com; however, they failed to do a thorough job with delivery of the document.Additionally, the notary we dealt with was not friendly though she was professional."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ElizabethBinger",
          "Nb_Reviews": 3,
          "Date": "2021-11-05T13:18:51.000Z",
          "Titre": "Definitely NOT worth it",
          "Contenu": "What a pain this process was. It actually would have been SO much easier to simply get in our car and drive a few minutes to our bank where it would have been FREE! People were nice and professional but simply put: It’s not worth $50 to get two signatures notarized."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Vaishali Satpute",
          "Nb_Reviews": 1,
          "Date": "2021-09-05T08:42:58.000Z",
          "Titre": "The call eneded with out my signature…",
          "Contenu": "The call eneded with out my signature on the notory and there was a blue box instead of the signature at some places where I was suppose to sign. The person who did the notory could not hear me and did not bother to check if the document had my signatures before ending the call."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Thoughtworks",
          "Nb_Reviews": 1,
          "Date": "2021-10-08T13:04:42.000Z",
          "Titre": "The company says it can notarise…",
          "Contenu": "The company says it can notarise anytime but only available during the US working hours, the personal was in a hurry and not concerned about how difficult that the tools used were taking not so good quality photos, it was a mess, but somehow I got this verification done."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alena",
          "Nb_Reviews": 1,
          "Date": "2020-12-28T21:07:40.000Z",
          "Titre": "Once I finally got service it wasn't…",
          "Contenu": "Once I finally got service it wasn't bad.  The woman was very friendly, but the first person didn't know what they were doing and I ended up on hold basically for an hour.  And they were supposed to send my notarized document direct to the company who sent me to them, to use their service, and they failed to do that also."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Karl Burden EL Bey",
          "Nb_Reviews": 1,
          "Date": "2021-06-15T10:59:33.000Z",
          "Titre": "Use this to try and notarize…",
          "Contenu": "Use this to try and notarize requirements for security and exchange, but the form needing such was not done and it been difficult to get the proper treatment to correct this procedure.  We are unable to proceed in our process without the necessary form being notarize. Need help in this area"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anthony Yeung",
          "Nb_Reviews": 2,
          "Date": "2021-01-28T14:54:12.000Z",
          "Titre": "Failed to know that large notarized pdf was not delivered",
          "Contenu": "I notarized a 29 MB pdf. It got larger after the stamps. Although notarize.com sent me a notice that the notarized file has been sent to my employer, in reality, the employer server had rejected the file due to size. No one knew about the mishap for days.Moreover, when I needed to shrink the pdf to resend by myself, notarized doc was locked by the notary against modifications. Direct email of the doc using the notarize.com link also could not succeed,What a mess!!!!Should give me my money back."
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "Cindy Azoulay",
          "Nb_Reviews": 1,
          "Date": "2021-07-19T18:36:19.000Z",
          "Titre": "The system would not verify my documents",
          "Contenu": "The system would not verify my identification.  I used several phones with different levels of cameras. I spent hours trying to get it to work.  Only on the last day did Customer Support suggest I use the computer browser.  In addition I did not have documents which could confirm my address in English.  It wasnt until I was several days into this process that Customer Support explained how I could use foreign language documents.It would help if your instructions did make reference to clients who are using the service and live overseas or at least an FAQ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "M. Friedman",
          "Nb_Reviews": 2,
          "Date": "2020-12-30T23:26:41.000Z",
          "Titre": "Although it is a convenience",
          "Contenu": "Although it is a convenience, in theory, to be able to notarize documents online, the two experiences I have had, one yesterday and one today, each lasted hours (only 3 documents each time), and they were frustrating, purgatorial hours.  In future, I will make every effort to seek out a flesh and blood notary."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "A.S.",
          "Nb_Reviews": 1,
          "Date": "2019-12-12T22:36:25.000Z",
          "Titre": "Time consuming and complicated",
          "Contenu": "The only pro was that the notary lady was very nice and helpful. I still do not recommend that service. It is way more complicated and time consuming than going to a local notary. Plus it cost more. On top they should have submitted the form automatically to the recommending partner company which did not happen. I don´t know if that was the fault of notarize.com or their partner though."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DG",
          "Nb_Reviews": 1,
          "Date": "2020-10-01T17:10:08.000Z",
          "Titre": "The app itself is good and very useful - support need improvement",
          "Contenu": "The app itself is good and very useful. The support need to learn more about their product so that they can better assist customers. Documents that are notarized sometimes are very important legal docs and having this company hold it due to their technical error and inability of support to help could jeopardize a case."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Davis",
          "Nb_Reviews": 2,
          "Date": "2021-08-11T13:24:45.000Z",
          "Titre": "I thought the service was great",
          "Contenu": "I thought the service was great. It was easy to use and the notary was very thorough and helpful. My problem was that the title agency overseeing the sale of my condo did not accept the virtual signatures and so I had to go out and have it done by another local notary."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frustrated Customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-27T13:15:30.000Z",
          "Titre": "The instructions for using this service…",
          "Contenu": "The instructions for using this service need to be re-written.  They are not clear on the steps that need to be taken.  Chat is courteous, but only repeats what the instructions say and are not any more helpful.  It was a very difficult process to use this service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Prendergast",
          "Nb_Reviews": 1,
          "Date": "2021-08-04T16:03:48.000Z",
          "Titre": "Unhappy",
          "Contenu": "The interaction was slow but I did manage to get two documents notarized.  The copies received by the requesting company were UNSIGNED.  We lost almost a week trying to retrieve our own money but we did pay Notarize much more quickly and efficiently.  We are not happy."
        },
        {
          "Note": 2,
          "Lieu": "LB",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2020-06-13T15:13:13.000Z",
          "Titre": "Interface not easy to work with",
          "Contenu": "The notary was great, and very patient.  The interface was not great, and it took a long time to complete the notarization process.  I needed to sign the document with my full name, but didn’t sign using my middle name at first.  We were unable to get rid of the original signature, and wound up having to use handwritten initials in a work around.  But overall, the process was quite long, and didn’t save any time versus going to my local bank to get the document notarized."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2021-06-19T18:51:56.000Z",
          "Titre": "Overstepping Notary Role",
          "Contenu": "I hired the service to witness a signature. I did not request them to proofread my document. I advised the notary that I was given specific instructions on how to fill out the form. The notary insisted that my document was filled out wrong and refused to notarize it if I did not allow her to change one of the fields. Sure enough, my company would not accept the form with the notary's changes! I had to go to a different notary and pay another fee for a new form. The notarize (dot) com notary should have listened to me, and not overstepped the scope of her role."
        },
        {
          "Note": 2,
          "Lieu": "AT",
          "Pseudo": "Claudiu ST",
          "Nb_Reviews": 4,
          "Date": "2021-09-14T16:31:32.000Z",
          "Titre": "Poor multi-language",
          "Contenu": "I did try to join Spanish meeting many times but was not any operator online and My english its very bad. I did join english meeting but was not so good, because my language, as feedback should be more people that Speak spanish at Notarize.  Best regards."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chuck Bladerunner",
          "Nb_Reviews": 4,
          "Date": "2021-07-31T22:01:20.000Z",
          "Titre": "A notary dropped my call",
          "Contenu": "A notary dropped my call, and I had to start the whole process over. I could have gone to my bank and completed the process for free rather than pay $25 for what turned out to be a longer and less convenient process. I will definitely go to my bank the next time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeanne",
          "Nb_Reviews": 5,
          "Date": "2020-07-20T16:19:31.000Z",
          "Titre": "Rep Was Great But Process Is Bad",
          "Contenu": "Sonya the Rep was WONDERFUL but the process to get there wasn't. I have to fill out the forms 5 times and one time the notary couldn't find the form to notarize so she canceled that one.  Very cumbersome, unclear process.  Also I have to have WinZip in order to open my copy.  I don't have that!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Julie",
          "Nb_Reviews": 3,
          "Date": "2023-11-21T01:32:43.000Z",
          "Titre": "OK job",
          "Contenu": "You did a good job with the notarization process and your notary was efficient and friendly. However, the notarized document was not sent to the parties that needed it, even though I supplied their email addresses."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T17:05:19.000Z",
          "Titre": "Very convenient but I would like to see…",
          "Contenu": "Very convenient but I would like to see a way of uploading your proof documents. Taking a picture with camera is not easy"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Megan Kent",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T04:57:10.000Z",
          "Titre": "He was perfect and very efficient…",
          "Contenu": "He was perfect and very efficient however should have some warning somewhere that in some cases online out of state notaries aren't acceptable. Which was the case in my situation. I couldn't use it because the notary had to be in NY STATE where I am."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Murrell",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T13:30:00.000Z",
          "Titre": "I had no problem with entering my…",
          "Contenu": "I had no problem with entering my personal data and getting it notarized online. Thanks for making it very convenient. However, when it came to getting my wife notarized it was extremely complicated and I just gave up. It wasn’t clear that she couldn’t be notarized online and the resultant confusion led me to simply quit the process."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jon Deeth",
          "Nb_Reviews": 2,
          "Date": "2023-08-13T01:01:00.000Z",
          "Titre": "Convenient But Needs Some Work",
          "Contenu": "After completing all signing and the first notary person logged on, something happened with their wifi and the person disappeared. Customer service stated when this happens you have to re-sign all your loan docs/start the process over again to get to a notary. It’s frustrating to lose all that work because your notary has a poor wifi connection."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LJH",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T12:07:39.000Z",
          "Titre": "Taking pictures of my documents.",
          "Contenu": "The actual process of signing the document was easy and fast.  However, getting to that point was difficult.  I could not take the pictures of my verifying docs (passport and license) for some reason. The button to take the picture was not functioning.  I called for assistance and was on the phone for fifteen minutes before a person answered and they could not help.  So, I repeated the process from the beginning four or five times before it actually worked."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rebecca Mudd",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T02:31:12.000Z",
          "Titre": "It would have been a five-star…",
          "Contenu": "It would have been a five-star experience, but we had to start over when one document was not correct. While that issue was not the fault of notarize, we had terrible technical issues when we had to go back in to redo the closing. None of the correct documents saved, so we had to redo all the documents. We couldn’t get the code to verify email, and the tech issues just kept coming. It took over an hour to get back into the system. Our notary, Mark H, was excellent. He was very professional and arranged to be back with us for the do-over."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T17:06:32.000Z",
          "Titre": "Notarize was very difficult to get…signed in",
          "Contenu": "Notarize was very difficult to get logged into. We went through 52 pages of preliminary paperwork with no problem, then when it asked for copies of our Driver’s Licenses, it would copy the front, but would lock up when we tried to do the back. Then we tried getting into Notarize, and a rep came on asking if we wanted our Driver’s License notarized, we said no, we want our Closing documents notarized. She couldn’t find them. Finally a rep was able to get us on Chrome, where we finally were able to log in. Our closing was scheduled for 2:30, we finally got in about 3:45. The notary was very nice and we went through the signing quite quickly. Then on the last page, it blanked out, but we were able to reconnect within a few seconds. It was quite frustrating."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Thomas",
          "Nb_Reviews": 4,
          "Date": "2023-08-11T08:11:03.000Z",
          "Titre": "Disappointed, Image software is a thumbs down",
          "Contenu": "I have used other competing online notaries with my current Samsung A8 and they had far superior photo imaging software, yours was very very difficult to get a legible image. Your notary was very good, my low rating is based only on your poor image software. Your not just a little behind your competition but a lot. Nothing personal but would not use your service again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "jmh",
          "Nb_Reviews": 3,
          "Date": "2023-08-11T16:52:43.000Z",
          "Titre": "Great, but wasn't acceptable for my application",
          "Contenu": "I thought the experience was quick and easy and cheap. And would have been great had they been accepted by the FAA. The FAA classified the signatures as ink signatures since it did not have the digital authentication next to it. And therefore was not digitally signed. I had to reprint and get a local notary to sign and resend it. This was for an aircraft registration."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T12:18:31.000Z",
          "Titre": "Connection problems and identification questions unnecessary",
          "Contenu": "PROS:- Able to get my documents notarized while traveling abroad.- Once a connection was established, went quickly and smoothly.CONS:- I don't like the identification questions. Fortunately this time questions were ok and able to answer correctly. But I think that this requirement is unnecessary since we already need to provide a government ID.- First attempt had a connection issue so was kicked out of the system and had to start over."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carolyn Sharp",
          "Nb_Reviews": 2,
          "Date": "2023-08-11T15:36:45.000Z",
          "Titre": "Expensive notary",
          "Contenu": "This was a new experience doing a notary online. I’m dismayed at the cost. I used to be a notary republic in Calif and by law we were not allowed to charge more than $10. Why is your cost so high? Unfortunately for me, I had no choice as I needed a copy of my grandmother’s death certificate quickly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gigi",
          "Nb_Reviews": 3,
          "Date": "2023-05-10T11:20:26.000Z",
          "Titre": "Doesn’t give the state until Notary appears",
          "Contenu": "It all went smoothly and worthy 5 stars. However, I googled NEW YORK Notary-they were the first to pop up and nowhere during the process did it say otherwise, until the actual Notary appeared and said he was a Florida notary under Florida law and didn’t know whether it would be accepted in any other state. This should be specified at the beginning of the process-let us be able to choose the state we need so we can see if you cover the stage requested. Now if NYC court doesn’t accept this notarization I have to go and pay twice. Not good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T01:30:03.000Z",
          "Titre": "The online process was difficult and…",
          "Contenu": "The online process was difficult and when I finally got to a notary she couldn't make the completed form work. She told me to redo the whole process. I redid it and the next guy completed things no problem, but when I then went on to pay I was charged twice and had to call Notarize.Clumsy experience all around."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Douglas Wahto",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T05:42:57.000Z",
          "Titre": "Your software or system is ‘buggy’ at…",
          "Contenu": "Your software or system is ‘buggy’ at best. I’d give it a 1/5. I finally received my password resets (5 of them) 5 hours after the request. Long after we completed the transaction, which fortunately for me, you have great support people and I was able to  complete the online document signing and notarization. So five stars for support, 1 star for ‘Notarize’."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "WILLIAM Pearlman",
          "Nb_Reviews": 4,
          "Date": "2023-08-24T01:42:51.000Z",
          "Titre": "The customer support was superlative",
          "Contenu": "The customer support was superlative! However, the fact that we needed customer support was disappointing. We needed to notarize documents for a real estate sale. This normally is a simple stress free function. Doing it online was extremely stressful due to the incomplete instructions that were sent. I recommend that you take an individual over 70 and walk them through the process and pay attention to all their questions, and then create your instructions for your customers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kyle Miller",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T00:56:20.000Z",
          "Titre": "Loved the Convenience; Notary Should Have Paid Better Attention",
          "Contenu": "I LOVED the convenience. However, the notary notarized the wrong section of a second document, and now we'll probably have to resubmit it again...which means we'll be charged again!  Closer and better attention should have been paid to where the notary put her stamp!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cleaning & Organizing",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T04:25:11.000Z",
          "Titre": "From the point of view of a first time…",
          "Contenu": "From the point of view of a first time user, I personally think that representative should be more helpful, patient and knowledgeable. My first representative wasn't very helpful, however, my second representative was very helpful,  friendly and attentive. Therefore, my mission was accomplished successfully from the second try! Thank you very much Daniell! I really appreciate your help!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "K. P.",
          "Nb_Reviews": 2,
          "Date": "2023-06-07T02:42:43.000Z",
          "Titre": "It was professionally handled but it…",
          "Contenu": "It was professionally handled but it took much longer than we expected given that it was a cash sale and everything was pretty straightforward. Overall happy with the experience because the notary was professional and clearly had expertise in the matter. Just would have liked a quicker turnover time"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard Davis",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T22:50:06.000Z",
          "Titre": "Good product, bad support",
          "Contenu": "The software and on-demand notaries are incredible.  With that being said, it's a little pricey and the customer service is very, very bad.  I've had billing issues and any time we contact our account manager it feels like they don't care at all if we are a customer.  Note that as I say that, we spent over $25,000 on Notarize.com last year, so while we know we aren't their largest client, we aren't the smallest either, and we can't get decent support."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Art",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T03:58:43.000Z",
          "Titre": "First Notery we communicated with was…",
          "Contenu": "First Notery we communicated with was very curse and did not want to provide service.The second Notery was very pleasant and provided support and helped us through the process."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RJ Foley",
          "Nb_Reviews": 1,
          "Date": "2022-06-20T18:13:34.000Z",
          "Titre": "Use Phone App For A Smoother Experience…",
          "Contenu": "Your phone app provides a smoother experience than the desktop web app. Attempted to notarize on a Saturday past midnight before a holiday. Was patched through to a notary but the connection was severed halfway through. I tried 4 times with the desktop approach just to return to a video call. I gave up until the morning and tried the phone app instead — which worked far better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chuck L.",
          "Nb_Reviews": 2,
          "Date": "2023-07-01T06:04:41.000Z",
          "Titre": "The preparation process was difficult, good notary.",
          "Contenu": "The preparation process was confusing. My wife and I were both attending the online notarization, and we both timed out, since we started ahead of time (we were on separate laptops). This is understandable. But then we both had to re-enter our information, picture ids, retake the speed test, etc.The instructions said we'd have a chance to review docs before meeting the notary, but neither of us had an opportunity. Maybe we both missed it.We both got multiple emails with links to start the process, which is fine, but the one titled \"Verify your email address\" had a link that was confusing - it took us to our account, which was not useful for what we were currently doing, but later.I contacted support about the missing chance to review documents, and they were helpful.Also, the notary was very helpful, and gave us plenty of time as we went through the document. She dealt well with a little lag that happened during the signing process."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T17:37:53.000Z",
          "Titre": "Good",
          "Contenu": "Good, but Its is missing some information, about waiting, It says 8 minutes, but on Saturday I spent more than 2 hours waiting.On the next Monday and business day, the process was very fast and easy. thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Danny",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T01:08:27.000Z",
          "Titre": "fine but software needs work",
          "Contenu": "The system made me verify my ID Everytime I got to that point instead of once which was a pain. Also there was a glitch on the last page where it would not let me sign which made me try re logging in and it still didn’t work. The notary said that this had happened before which is problematic if someone has limited time to sign something"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Anselmi",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T02:04:06.000Z",
          "Titre": "Too many inaccurate emails.",
          "Contenu": "The service is reasonably convenient to use but email communication needs some work. If multiple people need to sign a document I get notices that the document isn't complete even after I sign it. So especially when I have multiple documents to sign the misleading emails obscure what really needs to be done."
        },
        {
          "Note": 3,
          "Lieu": "GR",
          "Pseudo": "Zsoka",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T13:42:34.000Z",
          "Titre": "It’s a great service , but you need patience",
          "Contenu": "It’s a great service ,because let me notarize a selling contract while traveling overseas. You need patience and some help to be able to use it, because it’s not user friendly. I had to try couple times to prove that I am who I I am because the security questions sometimes wasn’t straightforward.The help section have a  live chat which really saved me from giving up and I was happy when after couple of hours finally I was connected to the notary, who was extremely professional.Also was frustrating to wait 24 hours after two times  I couldn’t pass the identification process .I’m  wondering how someone who doesn’t have my knowledge about using a computer can use it?Also better to start out on their website instead of the link you get true email, because then you can’t open the verification email, which let you change the password to be able to get to the documents.Maybe the most problem was that my US  phone was out of service because of international traveling  so I couldn’t receive text identification ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CK",
          "Nb_Reviews": 1,
          "Date": "2022-06-21T19:30:11.000Z",
          "Titre": "I was not satisfied because the…",
          "Contenu": "I was not satisfied because the instructions stated that I could use a photo id and a utility bill proof of address. And instead I was asked for a second photo ID with address on it. LET ME ASK YOU, what form of photo ID other then a drivers license has an address stated on it? I have two passports (dual citizen) and none of them have addresses. One photo ID with address and a second id like passport without address should be more then sufficient...since the government also accepts that no matter where you go!"
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Morris Floyd",
          "Nb_Reviews": 3,
          "Date": "2022-08-16T22:42:30.000Z",
          "Titre": "Delivery of document much too slow",
          "Contenu": "At first I was pleased with the ease of notarizing online. Supposedly they send the notarized document directly to me bank. But when I checked back after several days they told me the process takes 5-7 days, which was not disclosed in advance. In this case the document was urgent and - had I known - I would have sent the document myself."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T01:43:29.000Z",
          "Titre": "There are innate problems with the process",
          "Contenu": "The notary was excellent and guided us through the process, however this was our first experience with an online notary, and we found it tedious and time consuming. There are too many things that can go wrong, from the internet connection to the camera and microphone functioning, and I had several starts and restarts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ken McMullen",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T17:54:47.000Z",
          "Titre": "The instructions could have been more…",
          "Contenu": "The instructions could have been more clear.I wanted to review the documents before signing them but had trouble finding them on the Notarize.com web page."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Keval Padia",
          "Nb_Reviews": 2,
          "Date": "2023-07-06T03:51:05.000Z",
          "Titre": "The wait queue time was not correct",
          "Contenu": "The wait queue time was not correct. It showed 16 minutes and after half an hour it still showed 16 minutes. I had to terminate the session and restart again.It doesn't provide possibility to scan front and back of the document."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kim Cumby",
          "Nb_Reviews": 3,
          "Date": "2023-06-20T01:32:17.000Z",
          "Titre": "Took better part of afternoon!",
          "Contenu": "The system itself is easy and great flow. Then when uploading docs after choosing for iPhone or desk top that’s where the problem is. So I went to work on desk top bc that’s where my documents are. Then there’s no option to upload them. Mush be a photo. 6 times when trying to take photo it showed accept yet when I scheduled with notary he said perfect but then they get rejected as couldnt read. Should have been an easy process but took well over an hour. It was frustrating to get an email that response could be up to 48 hours. Fortunately it only took the afternoon. I chose o line as thought would be faster. I could have driven to a notary much quicker after all. Someone should walk through the steps and try and see what issues come up and then improve the system."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pam",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T04:06:27.000Z",
          "Titre": "It works. Have patience.",
          "Contenu": "I like that the notary is available 24/7 and the actual meeting was easy. I dislike that I didn’t know services were available around the clock until I uploaded my documents and notarization was delayed because I thought normal business hours were in effect. Also I found the document upload process somewhat frustrating: sometimes the pictures would automatically capture; other times I’d click the button and nothing would happen. Several times I received errors regarding network issues on the notarize site. 3 stars because it did eventually work and accomplished the stated goal."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Z V",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T18:37:03.000Z",
          "Titre": "There is a software issue with the second document upload option",
          "Contenu": "The second option to upload the document or vehicle registration card software camera does not work and the image is not clear. So I have to upload the document nearly 10 times.The document gives the perfect image on my camera but on the software it gives a very blury image on the second document option.There is a software issue on the second document upload option.This has to be rectified immediately."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Jill Schroeder",
          "Nb_Reviews": 2,
          "Date": "2023-06-01T07:38:03.000Z",
          "Titre": "Notary was great, minimum age not so great.",
          "Contenu": "Our notary was great, fast, efficient, and friendly. However, the „no notarized documents for under18“ policy was frustrating. We still have to find a notary for our child‘s signature."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T13:54:57.000Z",
          "Titre": "Mixed review.",
          "Contenu": "Did not work well from mobile device.  Seemed to only work from desktop computer.  Several of us had to start over when the notary dropped off.  Sometimes the camera did not work to capture ID.Very clever software though and seems to have a bright future."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "A.R",
          "Nb_Reviews": 4,
          "Date": "2023-05-12T07:24:40.000Z",
          "Titre": "Check your software",
          "Contenu": "Check your software, it does not work like it should...struggled to get pics done with my cellphone. The complete pic works okay but the pic only of the signature shows extremely clear however does not want to register. Now if you were to give us a click button to take the pic when we see it being clear as you do on the other device, it would be great. One of your notaries shut down the app so I had to start all over again, took me over an hor to finally get the notary done. Did not speak with her, I saw an empty seat when the camera came on, and then she just shut it all down, turned it off. Will not struggle like that again, I will try someone else right away at the first sign of a struggle."
        },
        {
          "Note": 3,
          "Lieu": "CO",
          "Pseudo": "Andrés De la Pava",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T01:58:08.000Z",
          "Titre": "Good service, a bit difficult if you don't speak English",
          "Contenu": "It is not easy to get notaries who speak Spanish, which makes the process difficult for Hispanic people who do not speak English. Beyond that clarification, the service is very safe and fast, they do a great job."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Jacob VandeHaar",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T09:42:29.000Z",
          "Titre": "Buggy",
          "Contenu": "Buggy. Couldn't upload document, then couldn't take photo of my ID.I want an option to upload ID instead of take a photo of another screen.Safari on iPad"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Antonio Wooten",
          "Nb_Reviews": 2,
          "Date": "2023-04-13T00:59:16.000Z",
          "Titre": "I dislike the estimated wait time for a…",
          "Contenu": "I dislike the estimated wait time for a notary to arrive to the meeting.  I had to wait approximately an hour but the initial estimated wait time was 16 minutes"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Kurlak",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T00:54:58.000Z",
          "Titre": "Document annotation buggy",
          "Contenu": "The document annotation software was very buggy. I would attempt to delete a text box and it wouldn’t delete. Or I would attempt to change tools and it wouldn’t change."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Nowaczyk",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T17:17:51.000Z",
          "Titre": "It would be very helpful when something…",
          "Contenu": "It would be very helpful when something is not complete that it takes the notary to the spot that is missing the disclosure or whatever is incomplete."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Koorosh Rezai",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T02:11:43.000Z",
          "Titre": "too much involved",
          "Contenu": "too much involved.  The first person did not wait and cancelled the connection.  The second person was okay and did it by the book."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Remote Online & Mobile Notary",
          "Nb_Reviews": 3,
          "Date": "2022-12-21T01:58:15.000Z",
          "Titre": "I have used it on a NST basis and did 3…",
          "Contenu": "I have used it on a NST basis and did 3 test using 3 different people.  All had issues with it and mentioned it’s not user friendly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gary Clifton",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T20:33:04.000Z",
          "Titre": "It was ok BUT",
          "Contenu": "It was convenient but there were technical problems with 3 people signing the software had issues."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "illinois customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T18:49:18.000Z",
          "Titre": "good service but improper notarization",
          "Contenu": "My notary was pleasant, quick, and efficient. However the recipient of the document indicated it had been notarized improperly and rejected the filing. Notarize.com offered a full refund, which I accepted. Three stars due to (1) convenient service, (2) painless refund process, but (3) improper notarization."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sandy",
          "Nb_Reviews": 4,
          "Date": "2023-07-07T01:12:32.000Z",
          "Titre": "Wasn't able to complete document",
          "Contenu": "Wasn't able to complete document.  Then locked out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jorge E Rivera",
          "Nb_Reviews": 1,
          "Date": "2022-06-22T03:40:26.000Z",
          "Titre": "Notary forgot to sign document and we…",
          "Contenu": "Notary forgot to sign document and we couldn’t use it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tricia Ibayan",
          "Nb_Reviews": 2,
          "Date": "2023-04-13T14:34:11.000Z",
          "Titre": "It was relatively simple to use but the…",
          "Contenu": "It was relatively simple to use but the site was glitchy"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Leila Berg",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T17:47:57.000Z",
          "Titre": "My last notary",
          "Contenu": "My last notary, notarized it wrong"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carol Tangney",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T02:00:39.000Z",
          "Titre": "We had app difficulties."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maybe one day",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T18:17:10.000Z",
          "Titre": "Overall the service is great",
          "Contenu": "Overall the service is great, unfortunately not everyone really accept this service as a legit.I had to pay an extra $50 to had that not done electronically.I hope this will not be a problem soon, The notary was good at explaining things and help me with some questions however as I said not everyone except the service at this moment."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-06-11T16:20:43.000Z",
          "Titre": "Notarize.com is great BUT...",
          "Contenu": "Notarize.com is great but the only issue I have is that I live in NY and most of the things I need notarized need to be signed by a NY notary. It would be nice to be able to pick which state you need your notary to be licensed in. If this is not a requirement for you then notarize.com is all you need."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Hunter",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T16:30:14.000Z",
          "Titre": "Nice UX",
          "Contenu": "I found the experience overall to be very straightforward, easy to understand, and more or less frictionless.  Really awesome workflow leveraging a lot of good solutions (QR code to capture images on mobile, video chats, saving documents for sharing, etc).  That being said, I wasn't technically able to complete my task since the state I was trying to notarize my document doesn't allow e-signatures.  I think that's probably on me, but some reminder may have been useful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lindsey",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T17:11:45.000Z",
          "Titre": "Useful, but looks sketchy",
          "Contenu": "It looks questionable when someone looks like they are sitting in a corner of a room and I'm about to hand over personally identifiable data. It was convenient to have a notary on the spot, but having something in the background behind the staff member or something like a notarize logo in the screen would have made me feel much safer than this situation offered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Candace Young",
          "Nb_Reviews": 3,
          "Date": "2022-06-11T18:38:17.000Z",
          "Titre": "Quick & easy but $$$$$",
          "Contenu": "Service was quick and easy during weekday, daytime hours. I could not get a connection around 10pm EST on a week night. The representative was friendly and the process was very efficient (under 15 min). I had a bit of sticker shock, however. At $25, the cost is pretty steep (vs.we paid $5 at a local notary for the same service a few days earlier - then needed this one more sheet done), and we didn't see any info on their fees ahead of making the connection with the notary official. So, there is a premium for the convenience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sue NIX",
          "Nb_Reviews": 2,
          "Date": "2022-06-01T15:36:27.000Z",
          "Titre": "The notary was in a very dim room and I…",
          "Contenu": "The notary was in a very dim room and I could hardly see him. He told me to change my previous business address to my new address which I tried to explain that I was changing addresses. But he said to change it. He filled in boxes 12,13, and 14 for me but didn't ask any questions about them. Lastly He didn't put my ID's number information down only what ID's I used. I had to provide a screen shot to IPostal due to the fact that they couldn't read my 2nd ID to add the numbers and expiration dates."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony J. Fidaleo",
          "Nb_Reviews": 2,
          "Date": "2022-04-21T20:58:45.693Z",
          "Titre": "The instructions are not self…",
          "Contenu": "The instructions are not self explanatory.  You should get a middle aged person who has never seed or used the site or service before and have them try to complete the process from start to finish with no help.  I am very computer literate and had challenges.  Once I received the proper instructions it was easy, but I should not have had to ask.  At minimum to a you tube example and and a link."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rose Sanders",
          "Nb_Reviews": 1,
          "Date": "2022-04-21T17:55:40.729Z",
          "Titre": "The notary was helpful",
          "Contenu": "The notary was helpful.  However, my initials ended up in a weird place on the form (down where it said office use only). And my title was typed in twice (but typed over itself so you couldn't read it).  I pointed these out to the notary and they said they would not appear on my copy, that she had fixed those errors. When I received my form they had not been fixed. So my form looked a little sloppy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christina Annice Hathaway",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T17:13:02.000Z",
          "Titre": "Not done right the first time but was corrected",
          "Contenu": "It was a quick service but the first notary person did not write it correctly on the wine so I had to pay for the mistake even though it wasn’t my fault. They only refunded me half of the amount and then I had to get it redone all over again which delayed the time that my document is supposed to get here. The second person was really nice and did it correctly thankfully."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Keith P.",
          "Nb_Reviews": 5,
          "Date": "2022-04-22T20:24:12.989Z",
          "Titre": "The Notary was outstanding",
          "Contenu": "The Notary was outstanding, but the interface is a mess.  It wouldn't work using my iMac desktop nor on my Android phone.  It wouldn't work on any other browser besides Chrome which is the least secure major browser out there, had to reactive mine.  Didn't work on Firefox or Safari.Ended up having to borrow my wife's iPhone - this made for four complete attempts on other devices and/or browsers that were futile.You guys need a new IT Mgr."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph Oziminski",
          "Nb_Reviews": 1,
          "Date": "2022-04-01T18:40:49.000Z",
          "Titre": "Took six times to get it done each time…",
          "Contenu": "Took six times to get it done each time something went wrong they couldn’t hear us had to call us just disappeared on us or the paperwork was too small to read but we did finally get it done took about 45 minutes different person from a different state each time a lot of online problems but if you’re in a pinch and need to get it done at 9 o’clock at night They can make it happen"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Adam Kasper",
          "Nb_Reviews": 2,
          "Date": "2022-06-03T15:30:39.000Z",
          "Titre": "Weird situation where the Notary",
          "Contenu": "Weird situation where the Notary, in the middle of the call, had a domestic dispute and we heard fighting and arguing, before the call was abruptly ended before it's conclusion.The second person we were connected to was good but we had to enter all of our info again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DAVID E HELLER",
          "Nb_Reviews": 1,
          "Date": "2022-02-19T03:35:43.000Z",
          "Titre": "Notarize proved to be a handy tool",
          "Contenu": "Notarize proved to be a handy tool. It was a tad expensive, and the web page required scrolling that wasn't obvious at first. The notary was as careful as any I have ever used in person in verifying identity. It would have been good to know ahead of time that not only was an official id needed, but also good images of it for uploading."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PDS",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T15:53:43.000Z",
          "Titre": "There were several technical issues…",
          "Contenu": "There were several technical issues trying to use this platform—which made this not only “not easy” but also frustrating. I was also assigned to a Notary who decided to deviate from the company’s published requirements asking for additional identification verification beyond what the process typically requires and who then disconnected the call abruptly. After four hours of trying the last Notary I connected with conducted the session professionally and expeditiously."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ML Williams",
          "Nb_Reviews": 5,
          "Date": "2022-04-03T20:47:20.000Z",
          "Titre": "I went through 3 representatives online…",
          "Contenu": "I went through 3 representatives online before I came across the third who has full knowledge of the inter workings of the system and knew what to do in order to finish my document.  Everyone should be up to speed on the system on how to workout problems when they occur."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jed Bach",
          "Nb_Reviews": 6,
          "Date": "2022-02-15T16:34:51.000Z",
          "Titre": "In theory, convenient and pricey",
          "Contenu": "In theory, it's convenient and fast if you don't mind paying a premium fee.  The notary was polite.  My complaints are that it takes a bit of time to upload your photos and then, on 3 occasions, the system told me no notary was available - without saying when one would be available. I waited about 10 minutes and disconnected. Frustrating.  On the 4th try, the Notarize system told me that no notary was available and I got distracted and - in about 10 minutes - I hear a notary asking 'Hello... anyone there?\""
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Whitney C Mann",
          "Nb_Reviews": 1,
          "Date": "2021-11-15T17:31:36.000Z",
          "Titre": "Fairly Good System",
          "Contenu": "Some of the instructions are a little troublesome and not as clear as they could be. In general, the system is fairly good. I did have trouble connecting with the Notary even though my PC pasted the testing before trying to connect. I could hear and see her, but she could not hear me. I had to close and start all over again, which was a hassle and time consuming, but worked."
        },
        {
          "Note": 3,
          "Lieu": "CO",
          "Pseudo": "Luis A Salicrup",
          "Nb_Reviews": 1,
          "Date": "2021-12-15T14:32:34.000Z",
          "Titre": "Not good service, too much time and money invested.",
          "Contenu": "The first two connections were really bad. Your technical support staff were a failure. The third time the notary was nice and calm but she didn’t notarized properly my documents. Therefore we won’t a 4ths time we’re things were done well. It took my 4 attempts, too much time and money invested. I don’t think that is good service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tony Espinoza",
          "Nb_Reviews": 2,
          "Date": "2022-03-10T14:13:11.000Z",
          "Titre": "Wonderful Service with Security Concerns",
          "Contenu": "The service provided makes life so much easier, however, it seems there might be some technical issues. My wife and I both have an account but when used from the same laptop, the app confused us. Her information was in my account and my information was in her account. The biggest red flag is when a different person’s drivers license was saved onto her account. It wasn’t even hers. Even now, this email was addressed to my wife, but sent to me. Please look into the security of this app because now I’m concerned my ID could populate onto someone else’s profile."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Lori",
          "Nb_Reviews": 1,
          "Date": "2022-02-06T01:31:08.000Z",
          "Titre": "Used two different notaries and both…",
          "Contenu": "Used two different notaries and both told me different things about state and city of what I should put in the blanks versus where they were notarizing my signature.  I could not use the printed notarized name for myself.  My document was rejected by the agency requesting a notarized document."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "anon",
          "Nb_Reviews": 1,
          "Date": "2021-10-22T04:39:19.000Z",
          "Titre": "The ID verification process is…",
          "Contenu": "The ID verification process is ridiculous. It is not able to verify a clear picture of your ID when taken on the phone camera, so finally, it accepts your blurry picture taken using your laptop's camera. This is after many failed attempts. I spoke with two different notaries and one of them, a woman was very helpful and sympathetic to my frustrations; the other notary, a man, was blunt and not very helpful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "D Kangian",
          "Nb_Reviews": 2,
          "Date": "2021-10-09T13:19:19.000Z",
          "Titre": "Not as User Friendly as you would like",
          "Contenu": "It was nice that I could get my document notarized without going outside of my home, but it was not by any stretch of the imagination a user friendly system.  I am a retired computer programmer and I felt that it is not a system that is completely independent of assistance.  You had to read between the lines to figure out each step since a lot of the instructions was not laid out on the screen for you."
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "GIL LEVITZEDEK",
          "Nb_Reviews": 1,
          "Date": "2022-03-17T14:29:33.000Z",
          "Titre": "pl add to your notarize team",
          "Contenu": "pl add to your notarize team, someone that can read and understand HEBREW.It took me few times to video with notarize that could help, and it was very frustrating to speak all time with Ipostal1 and Notarize support that will try to help me and give me a solution."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sandra McDonald",
          "Nb_Reviews": 1,
          "Date": "2021-10-19T18:39:41.000Z",
          "Titre": "The young women never smiled once",
          "Contenu": "The young women never smiled once.  It seemed she was not very happy with her job.  She spoke too fast and was hard to understand.  When I asked her to slow down, she acted as if I was dumb.  She did know her job and completed it well.  The experience was easy flowing and easy to follow.  Notarize as a platform was very well written.  Thank you"
        },
        {
          "Note": 3,
          "Lieu": "TH",
          "Pseudo": "CT Thompson",
          "Nb_Reviews": 2,
          "Date": "2021-10-19T13:55:03.000Z",
          "Titre": "The site says 24/7 service",
          "Contenu": "The site says 24/7 service, but if you try to get something done after midnight eastern, no notaries are available. They don't tell you this, until you've spent time uploading and photographing everything... So you have to come back during traditional business hours and start all over. They don't save your uploads."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kiana Asherah",
          "Nb_Reviews": 2,
          "Date": "2022-03-17T15:33:35.000Z",
          "Titre": "It took a few tries for it to actually…",
          "Contenu": "It took a few tries for it to actually work. I spoke to two people as the first one had to end the session when we were just about finished. So I had to wait another 20 mins for another person. Overall I spent a over an hour getting the entire process done."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "sedric davis",
          "Nb_Reviews": 1,
          "Date": "2021-08-01T23:36:41.000Z",
          "Titre": "I thought my documents were properly…",
          "Contenu": "I thought my documents were properly notarized but after 1 week and still no word from the mail box service that requested the documents I called and had to forward them myself at which time we discovered one of the documents was completely blank. I had to resubmit brand new documents and start the process all over again so definitely not recommending your service to anyone and wish I could change the notary’s rating at this point."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Raymond",
          "Nb_Reviews": 4,
          "Date": "2022-03-25T13:41:49.000Z",
          "Titre": "To expensive",
          "Contenu": "To expensive, otherwise great service. I could of had this notarized in person in town for $5, maybe another $1 to mail it out and have to wait a few extra days for the end point to receive it. You charge $35, that's a 700% increase in price ...."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2021-07-08T13:09:52.000Z",
          "Titre": "Easy, But Not Without Issue",
          "Contenu": "The service was fast and easy, but not sure that it's going to work for everyone. The notary I was matched with was based in Texas, and the laws on online notarization in Massachusetts require both the signee and the notary to be based in MA to allow the electronic notarization, so I think that's an imperfection in the service, as you can't specifically request a notary from your state."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gidon arnold",
          "Nb_Reviews": 1,
          "Date": "2022-02-23T21:00:47.000Z",
          "Titre": "After 2 failed but 3rd time was perfect",
          "Contenu": "After 2 failed attempts due to the system dropping the first notary before we finished. Then the system told the notary that i had dropped while we were still talking.  The 3rd notary knew the programs and spotted a few mistakes that I had made  in my forms, that the first two had missed.My forms we’re both downloaded and sent automatically to the company that had requested them. Which is a good feature .I dropped 2 stars on the rating,  for the 2 failed attempts and the documents verification process that had to be done several time over, because the system dropped me after verification."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 3,
          "Date": "2021-07-03T18:52:24.000Z",
          "Titre": "Docs not submitted by Notaize",
          "Contenu": "Anytime Mailbox says that when using this service (Option 2) the notarized document and supporting documents will be sent directly to them.  This does not happen.  I had to submit the notarized form myself plus scan and upload the supporting (IDs) myself after several days of waiting for approval and being told they were still waiting.The notarization process was fine, but you only get a copy that you have to submit yourself."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Corinne Leachman",
          "Nb_Reviews": 9,
          "Date": "2021-06-17T13:57:49.000Z",
          "Titre": "This is a very convenient service",
          "Contenu": "This is a very convenient service, especially when there is a time crunch to get something notarized.It took over an hour but we were eventually able to get our signature notarized on the AZ Title to our vehicle.  I believe there could have been some instruction provided for completing the form that would have made it easier with the notary that.  In fact, we relied on the notary for instruction!Now I hope it will be accepted."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Darlene Dabney",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T14:09:41.000Z",
          "Titre": "The first notary said I had to call…",
          "Contenu": "The first notary said I had to call back to complete my form.  I chatted with customer care and they told me the form could have been completed during the session with the instructions of the notary.  Customer care was amazing and sent me another link with another notary.The second notary didn’t have the most pleasant attitude, barely said anything, didn’t instruct me of anything except I only needed to sign and that was it.  When I reviewed the document the notary had completed it but not as I wanted it completed.  There was no interaction and I felt like she had no time but for a signature. Not a good experience"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CJ",
          "Nb_Reviews": 1,
          "Date": "2021-07-24T15:01:54.000Z",
          "Titre": "The first time I tried to use Notarize…",
          "Contenu": "The first time I tried to use Notarize now there were problems with the audio. I could hear the employee, but she couldn't hear me. We tried different things and then the employee ended our connection without any warning to me. She knew I could hear her, so why didn't she tell me she would be ending our session and I should try again? It was incredibly rude and unprofessional for her to cut me off without warning.The second time I tried it with a different employee, everything went fine."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Florence Rosario",
          "Nb_Reviews": 5,
          "Date": "2022-03-10T15:53:10.000Z",
          "Titre": "Good in theory, but not so much in practice",
          "Contenu": "Once we finally managed to upload all our documents, it was ok. But the system is very limited and didn't accept the documents we had several times. Also, we had one notary go through the entire process once and then the meeting crashed and we lost the whole thing. The second time, after having to reupload all the documents again, that second notary, refused to notarize our document, even though it was exactly the same as the one before, who had accepted our proofs of ID. We finally managed to do it the 4th or 5th time, but we had to wait ages to get in a meeting, even though it kept saying \"waiting time, 8 minutes\"."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Allen",
          "Nb_Reviews": 1,
          "Date": "2022-02-18T14:24:36.000Z",
          "Titre": "No standardize process between…",
          "Contenu": "No standardize process between agents...dealt with two saying rwo different things...Exp:One said the signs Spousal Waiver Form was okay to be signed...second agent was neither very professional in his demeanor and said it needed to be blank...."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kizzy M Spencer",
          "Nb_Reviews": 1,
          "Date": "2021-11-17T12:21:01.000Z",
          "Titre": "The notary i used was very nice and i…",
          "Contenu": "The notary i used was very nice and i thought he knew what he was talking about but i just found out the form i did got rejected because of the 2 things he said and did. So now i have to redo the form and occur another charge for a notary. So i do not like the notary service"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Terry Lee",
          "Nb_Reviews": 1,
          "Date": "2021-07-17T14:47:27.000Z",
          "Titre": "The reason why I gave a three on the…",
          "Contenu": "The reason why I gave a three on the starrs is because when I was trying to explain the situation the guy thought I was arguing. I don't understand when you are speaking with a guy with va deep voice he's always arguing in their eyes on an explanation. If he had any thought of an argument why continue"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Molly Cahill",
          "Nb_Reviews": 1,
          "Date": "2021-06-03T14:52:50.000Z",
          "Titre": "the way she explained my next steps…",
          "Contenu": "the way she explained my next steps were extremely unclear. you can watch the recording to see what I mean. all she had to say was \"now you will sign in section 5\" but instead she said \"you should see a 5 or a 15 on your screen, which one do you see? it doesn't matter which.\" That makes zero sense. I thought maybe she was talking about some type of number would be \"popping up\" on my screen for security or... I have zero clue what she was referring to."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bruynzeel Enterprises Inc",
          "Nb_Reviews": 1,
          "Date": "2021-10-14T00:40:40.000Z",
          "Titre": "The notary was very nice and helpful but...",
          "Contenu": "The notary was very nice and helpful but for one problem:I mentioned to him that I didn't think my drivers license picture was done correctly. He said it was no problem and my DL wouldn't be used because I also took a picture of my passport.This turned out to be a hassle and with a few emails back and forth with the vendor I finally got my drivers license picture to them so it could complete the transaction.It created more work that didn't need to be done. (it was my fault originally for not doing the DL picture correctly....but)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "daniel p mcneil",
          "Nb_Reviews": 1,
          "Date": "2021-09-14T13:10:03.000Z",
          "Titre": "The notaries that I worked with were…Chelsea and Martin.",
          "Contenu": "The notaries that I worked with were really good (Chelsea and Martin).  The remote support rep followed up on the technical issue that I had, but did not know her stuff and suggested that I put Notarize on my mobile phone, which was not necessary to resolve the technical problem that I had."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alicia",
          "Nb_Reviews": 1,
          "Date": "2021-07-30T14:03:36.000Z",
          "Titre": "Good experience but for the…",
          "Contenu": "Good experience but for the verification section. There are sections that the eye can miss and the light colored online form would benefit from a red \"Required\" highlight if a field has not been filled in. The \"Oops, we couldn't find enough information about you,\" doesn't tell you what field you didn't complete.There also needs to be an easy on website in dashboard way to delete your account completely in the event you could not use the service nor receive help from customer service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "VC",
          "Nb_Reviews": 2,
          "Date": "2022-02-23T14:11:06.000Z",
          "Titre": "Options for more than two signers are…",
          "Contenu": "Options for more than two signers are needed. Having two signers is excellent; however, there are documents where more signatures are required. You can always upsell additional signatures/seals. Please make changes to accommodate such needs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "F Romero",
          "Nb_Reviews": 7,
          "Date": "2021-12-30T16:40:49.000Z",
          "Titre": "3 attempts to notarize a document",
          "Contenu": "3 attempts to notarize a document first the notary had a technical issuethen the secind could not use the document that the first notary had leftso i had to start from scratch the document on the third attempt which was successful a lot of time wasted"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Phoenix Elliott",
          "Nb_Reviews": 1,
          "Date": "2021-11-09T18:07:08.000Z",
          "Titre": "When I finally got it to work it was…",
          "Contenu": "When I finally got it to work it was fine and the notary was great but it took about a week and 5 or 6 different submitting of the document from the other company to notarize before it worked for me. I'm not sure on whose end the issue was but it was frustrating"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Phyllis Flood",
          "Nb_Reviews": 1,
          "Date": "2021-07-30T00:44:50.000Z",
          "Titre": "The process was bit constraining…",
          "Contenu": "The process was bit constraining because I needed technical assistance from my husband, but the notary told us he couldn't talk at all or it would invalidate the notarization.  We got it done - without having to physically going to a notary - but it was more stressful than anticipated."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gwendolyn Y McKinnon",
          "Nb_Reviews": 1,
          "Date": "2022-01-14T16:33:01.000Z",
          "Titre": "The first male rep was rude and dropped…",
          "Contenu": "The first male rep was rude and dropped the call because I was working in my business and a customer approached me asking for something; the second male rep was unprofessional, and finally a woman took care of business! Five stars for Kerrian!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William A. Huber",
          "Nb_Reviews": 1,
          "Date": "2021-11-06T19:16:59.000Z",
          "Titre": "I love Notarize.com -- when it works",
          "Contenu": "I love Notarize.com -- when it works.  Half the time my attempt is rejected either for trivial reasons (the document was submitted as two pdf files instead of one, e.g.) or for reasons that had not been explained in advance (can't notarize a document for a Canadian court). This is an awful waste of my time and, usually, the notary's time too.  Because the process of being identified is so onerous, even the prospect of rejection is very off-putting.  What is desperately needed is an automatic way of checking a submission without entirely invalidating it if there is something wrong."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T18:07:43.000Z",
          "Titre": "5 stars for notary but 2 stars for ID verification",
          "Contenu": "The notary was helpful and efficient but the automated ID verification process was pretty frustrating. After accidentally submitting a blurry photo on my first attempt, I was prompted to resubmit that photo but then the submission page crashed again...and again...and again. Switched to a different browser on my phone, same issue. Finally switched to my laptop and was able to complete the process there, thus ending ten minutes of swearing and yelling at screens. It would have been nice to be given a chance to verify ID with the notary during the video call after the second or third failed attempt, but I didn't see that option."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T16:30:05.000Z",
          "Titre": "It was a great experience"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christy",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T04:53:24.000Z",
          "Titre": "Only complaint is that the audio on the…",
          "Contenu": "Only complaint is that the audio on the call/chat was quite poor."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T01:12:09.000Z",
          "Titre": "Saves Time",
          "Contenu": "The best thing about Notarize.com is that it saves a trip to a physical location.  Documents were reviewed ahead of time and a time was scheduled to virtually sign with a notary online.  We had some issues with our browser connecting to the camera, but I used their Chat text function to seek assistance and we got it figured out.  The only gripe we had was that when we went through all the steps and were ready to connect with a notary we got a message that the next available would be 40 minutes, but 3-5 minutes later we were talking to a notary and finishing our process.  Not sure why we got that message, but it was going to make us really upset."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronald Monroe",
          "Nb_Reviews": 3,
          "Date": "2023-09-12T23:40:51.000Z",
          "Titre": "Devon saved the experience for me",
          "Contenu": "Devon saved the experience for me.  I was having some technical difficulties with the camera on my laptop.  I attempted a live chat and the individual was of very little help, giving me advice as though I should know what she was talking about.  I really wanted to say \"speak to me like I have never used a computer before.\"  I discontinued the chat because it wasn't helpful.After that was resolved, I had technical difficulties with the audio on my computer.  Devon helped me through that process and we were able to complete it.  He was absolutely superb.  I think it might be worth encouraging technical help to speak to people in simpler language, easily understood by all and not simply a tech savvy clientele."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SoRo L",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T02:25:02.000Z",
          "Titre": "We got the job done quickly",
          "Contenu": "Notary was helpful and seemed knowledgeable-it felt a bit rushed for me but I think that was because of the nature of my document.  But he did a good job of explaining different terms.  I also was confused when I was suposed to pay, because he did not say--it is at the end after you sign your document and are off the call, by the way. Overall this was a great experience and I would use it again. Good price, fast, got the document right away."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Raj Mehta",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T15:18:06.000Z",
          "Titre": "Log in functionality issues but great team members",
          "Contenu": "The log in process wouldn’t access my camera and even after your team contacted me I wound up having to download the app to get it working.  Your team was helpful, pleasant, and efficient which is why I still gave a high score.  The website functionality could have resulted in a lower score.  Kudos to your team members."
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "James Tie",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T17:22:43.000Z",
          "Titre": "Night time need more waiting",
          "Contenu": "If you are calling a meeting with notaries during the night time of ETU, prepare to wait for a long time, quite  a bit more than the the waiting period that your screen shows.Apart from above, all good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lorri Abbott",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T19:21:52.000Z",
          "Titre": "This was an extremely easy process and…",
          "Contenu": "This was an extremely easy process and I recommend it to everyone.  My only drawback is the form that is signed comes out looking like a scan and I have had a couple of agencies not accept the form as it appeared to be a scan so I had to physically go to a notary and get it done again.  If there is a way they can send the signed paperwork not looking like a scan, this would be 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Marissa Maurer",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T08:27:13.000Z",
          "Titre": "Very easy and convenient!",
          "Contenu": "The actual process of closing was excellent - very easy and convenient.  The only reason that I gave 4 stars instead of 5 is that it was a bit confusing to navigate when we tried to review the forms in advance.  We also ended up having to do the ID verification twice because it was not clear that we could not do that in advance either.  But overall good experience and saved us a lot of hassle."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T18:02:57.000Z",
          "Titre": "My time with the notary was great",
          "Contenu": "My time with the notary was great; everything explained clearly and the signing process went smoothly.  The one suggestion I have is to allow uploading of existing photos for IDs.  I have an older phone and it is difficult for me to get a clear photo of an ID, so I have an existing photo stored for this purpose.  But the system made me take new photos, and this took an extra 20 minutes before it worked."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cliff Bray",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T14:31:05.000Z",
          "Titre": "Notary was great and easy to work with",
          "Contenu": "Notary was great and easy to work with.  Only issue I had was verifying identity with camera taking picture of ID.  System would not focus and so ID would constantly take a blurry picture of ID that would not work on verification.  It became very frustrating.  Need better work there."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jen Pletting",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T16:43:18.000Z",
          "Titre": "A great option that will likely go flawlessly for most",
          "Contenu": "It was very nice to be able to do this from out-of-state/anywhere. The third notary we got was the charm and he was great!! However, we had to acquire additional information that we did not have and that required us to log back in after speaking with the first notary. When we logged back in and were set up with notary #2, he told us he was from Virginia and that a note on our title specifically said no Virginia notary allowed. Instead of just being transferred to the third notary, we had to go all the way back into the system and fill out all the information and security questions for a third time. That was kind of annoying."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 6,
          "Date": "2023-06-23T18:05:46.000Z",
          "Titre": "Application is easy to use",
          "Contenu": "Application is easy to use and I like that you can actually see and speak with a notary person. Getting photo ID to work was a bit of a challenge as I wasn't able to get my FL Real ID Drivers License to be verified as the photos on the license are blurry to begin with. I used my US Passport instead for ID verification."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Natalie",
          "Nb_Reviews": 2,
          "Date": "2023-10-11T16:11:10.000Z",
          "Titre": "Mostly good experience",
          "Contenu": "Mostly, i had a great experience. The step to take a photo of my ID was glitchy- i had to begin again several times, but besides that, it was smooth."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KimD_Homescape Closeouts",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T06:44:53.000Z",
          "Titre": "Overall good experience",
          "Contenu": "Great notary, she was very friendly and knowledgeable. Just took a long time to get through everything, because of all the statements and disclosures the notary was required to put on after each notarization."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven Gher",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T01:06:53.000Z",
          "Titre": "It was completed in one call",
          "Contenu": "It was completed in one call. The notary didn’t make it clear that he was in control of submission of each form, it confused me because I kept trying to scroll through all the forms."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T01:04:02.000Z",
          "Titre": "Joyce and Allen were *excellent*",
          "Contenu": "Joyce and Allen were *excellent*Pre-video call directions were non-existent and created a bit of panic at the beginning. That is the only thing I would change."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Schlanger",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T05:06:26.000Z",
          "Titre": "Very convenient for most users",
          "Contenu": "The system worked well for the tech savvy among us but elderly users will likely need further assistance or easier options."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sally Blaser",
          "Nb_Reviews": 4,
          "Date": "2023-08-12T00:44:29.000Z",
          "Titre": "Site was in German, but everything else was great",
          "Contenu": "Our notary was great. The only problem was that the website was in German. Luckily my husband speaks German, so we were able to upload our drivers licenses, but it would be a problem for anyone else."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "V & M Logistics",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T00:39:14.000Z",
          "Titre": "Very easy process",
          "Contenu": "Very easy process. The ID upload was the most frustrating part because pictures kept coming in as blurry to the notary although they were clear on my end."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debbie Masnyk",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T03:44:16.000Z",
          "Titre": "The software was a bit clunky...",
          "Contenu": "The software was a bit clunky and did not run as smoothly as I expected.  I had to re-enter numerous items and actually had to send a photo of my ID via email to the title company because the software did not process or accept it within the tool."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lori K. Lynch",
          "Nb_Reviews": 4,
          "Date": "2023-05-23T01:01:55.000Z",
          "Titre": "Patience and Humor made it work",
          "Contenu": "The ladies were new to the Notarize platform and struggled to make it work well. We hung in there together with them and got it done! They were super sweet and made the process enjoyable! We loved our experience with Highland Homes and all the partners that make it work!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carl Pierce",
          "Nb_Reviews": 2,
          "Date": "2023-05-22T23:41:44.000Z",
          "Titre": "Everything was super clear and smooth…",
          "Contenu": "Everything was super clear and smooth during the live video chat. Only complaint is that the notary stamp/seal was really small. Also the Tax Assessor Office in Dallas had never seen an online notary seal and were skeptical BUT they let it through thank God. My son and I needed some documents notarized to transfer him the title of a car. He was only in town on Sunday. This turned out to work great - thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melissa K Trotta",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T23:12:59.000Z",
          "Titre": "Great Convenience with This Platform",
          "Contenu": "This platform made it very easy to sign all of my closing paperwork electronically.  I appreciate the opportunity to review all of the documents in advance, and it worked well when I was on with the title company representative.  My only recommendations would be to make it clearer re. how to log in (via a specific link) and to clarify which forms can be signed in advance and which need to be signed in the presence of the Notary."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anton Komarovsky",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T01:53:27.000Z",
          "Titre": "This is a VERY convenient service",
          "Contenu": "This is a VERY convenient service. Well, my first time was not successful due to an issue on my side, so I had to re-try again. The second time though took me on a little bit another flow: it redirected me to my phone for snapping my IDs. I was a confused, because the first time I did it on my laptop. The whole experience was positive, quick and effective."
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "Michal",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T14:26:01.000Z",
          "Titre": "It went very well, however…",
          "Contenu": "It went very well, however session was canceled few times due to long time to wait for notary. So finally after 3rd or 4th time with time slot adjustment I was able to get connected with the notary. Except then that all went very well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deana H",
          "Nb_Reviews": 3,
          "Date": "2022-12-16T20:21:02.000Z",
          "Titre": "the notary at my bank does it for free",
          "Contenu": "They even print it out for me, ensures all information is correct before signing, and even sends me a digital copy.***Make your 3rd party services clear*** and what you are and are not responsible for. Wasted a year on trying to resolve the issue between the company requiring a notarized document and Notarize. Very annoying. Enjoy my $20, you'll never see another penny from me, maybe unless it's between that and dying.4 stars: only because this process made me appreciate my bank notary so much more, and I get to minimize fueling big companies."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Farrell-Haley Deborah",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T18:13:07.000Z",
          "Titre": "The people were great",
          "Contenu": "The people were great.  The connecting was terrible.  Both time my brother and I had to use it, it took an hour to solve various technical difficulties, despite the help desk.  What should’ve taken 15 minutes and 5 minutes, took 90 minutes and an hour, respectively."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Samuel Colombo",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T15:55:01.000Z",
          "Titre": "Once I got my camera and microphone…",
          "Contenu": "Once I got my camera and microphone working it was good. I got a quick call back. The agent was polite and efficient. You get your documents notarized and emailed back."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason D Quick",
          "Nb_Reviews": 1,
          "Date": "2022-06-25T15:40:14.000Z",
          "Titre": "Easy and Effective",
          "Contenu": "Easy and EffectiveThe process was fast and effective.  It was just as fast as in person notary.  The only somewhat awkward portion is that the signer has to sign their name on a piece of white paper and then scan that into the program with a camera.  However, it technically worked fine and the service worked as advertised."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff DeFazio",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T01:56:11.000Z",
          "Titre": "File downloading and usability",
          "Contenu": "Love this service!  its quite difficult downloading the executed file. Having it download as a zip makes it more difficult file to work with immediate. Advise giving the user of the option of not zipping the file."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Colleen Owens",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T19:41:50.000Z",
          "Titre": "Notarized Document",
          "Contenu": "Easy site to access. I had a hard time taking my ID picture, it was to light. Gentlemen notary was so nice and patient. Advised me to step away and find another  spot to take ID picture.  It worked!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ralph Trickey",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T21:32:22.000Z",
          "Titre": "The people were great",
          "Contenu": "The people were great, I wish there was a way to swap the first and second signers without starting over, that caused some confusion."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dean & Marsha",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T12:37:24.000Z",
          "Titre": "Wonderful concept & product",
          "Contenu": "Wonderful concept & product, just had a bit of trouble with camera and microphone initially but it was ironed out. All was well thereafter"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keith Jones",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T02:03:11.000Z",
          "Titre": "Fine Service, Set-up Could Be Easier",
          "Contenu": "The service itself worked great and the Notary was both helpful and friendly. The only problem I had was getting the camera and microphone to work. I was using a Mac and Safari. After clearing the cache and history from the browser, it went fine."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jane Avni",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T16:25:08.000Z",
          "Titre": "The notary was great and the process…",
          "Contenu": "The notary was great and the process went smoothly except for sign in.  I was late for the meeting because I didn't realize I wasn't logged in until after reading over all the documents."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Breanna",
          "Nb_Reviews": 2,
          "Date": "2023-04-18T04:13:17.000Z",
          "Titre": "Fast, Easy, Contradictory Info From Different Employees",
          "Contenu": "Both of the ladies that I spoke with were nice, but they gave me contradictory information.  The first one said I needed more identification, so I waited an entire month for my new passport to arrive.  A month later, when my passport arrived, the second lady said I never needed it.  Now I have to wait a few days to see if the first lady was wrong or the second lady.  Either way, one of the ladies really screwed me over.  Not cool.  Otherwise, it's a fast easy process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gerald L Klarsfeld",
          "Nb_Reviews": 2,
          "Date": "2022-06-22T21:22:09.000Z",
          "Titre": "I found the service mostly easy to use",
          "Contenu": "I found the service mostly easy to use.  The technology to cover all the bases needed for a complete notary process was very good.  It did take time to complete what was required but it was more efficient than seeking out my Bank's Notary person."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T02:40:56.000Z",
          "Titre": "Notary was friendly",
          "Contenu": "Notary was friendly. Made interview quick and easy.Had problem getting a Notary to speak to. Tried several times with long waits and no one to speak with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "frustrated",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T01:52:38.000Z",
          "Titre": "Don't use a smartphone! Only Lap top or desk top comp.",
          "Contenu": "Was a quick process after I got on my lap top. I had tried to use my smartphone for 45 min. and it kept freezing at a certain point. You can't use a smartphone even though it says you can. So that was very frustrating and wasted so much time. If I had known from the beginning I would have started on my laptop and been done in 20 mins. Instead of almost an hour and a half later."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrea Kiefer",
          "Nb_Reviews": 3,
          "Date": "2023-06-27T00:57:44.000Z",
          "Titre": "Highly Recommend!",
          "Contenu": "Actually everything was great except the downloading process wasn't seamless - but -that could have been me. I would give a 4.8 ! My notary was stellar!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T01:42:36.000Z",
          "Titre": "The digital verification was easy for…",
          "Contenu": "The digital verification was easy for me, but my wife had 6 failed attempts (software analysis was buggy) and it was frustrating. Once we made it to the video portion it was super easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel L Earley",
          "Nb_Reviews": 1,
          "Date": "2022-06-21T22:09:12.000Z",
          "Titre": "The whole experience was good one",
          "Contenu": "The whole experience was good one.  The only feedback that I can give is that some of the information given was confusing to work through.  It was given to me very quickly and I was trying to understand it all so quickly.  Other than that the experience was pleasant and would definitely use the Notarize now application again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "EDWARD FRIEDMAN",
          "Nb_Reviews": 3,
          "Date": "2023-06-23T01:41:31.000Z",
          "Titre": "Service was fine but filling out the…",
          "Contenu": "Service was fine but filling out the forms was confusing; My wife needed to sign a document and it took 2 tries to figure out what to do, probably due to my age."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason A Stone",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T01:03:34.000Z",
          "Titre": "I logged on with my computer checked…",
          "Contenu": "I logged on with my computer checked the video and sound, but had to use my smartphone to take pictures of my drivers license and passport. I was hoping to not have to use my smartphone. Overall I got it done other than what I noted above great processing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Noelle Ashton Bryant",
          "Nb_Reviews": 1,
          "Date": "2022-06-22T17:05:29.000Z",
          "Titre": "Service worked well.",
          "Contenu": "Service worked well.However, cost should have been disclosed prior to document signing. I paid 25.00 for a 3 page document. I would be happy to use services again if cost was a bit more affordable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Loree",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T05:13:11.000Z",
          "Titre": "Virginia was Fast",
          "Contenu": "Virginia was Fast. Friendly. Knowledge. She was confident and made me feel at ease. Thank you Virginia."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Meyerhoff",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T15:08:03.000Z",
          "Titre": "The notary was great!",
          "Contenu": "Some problems with the initial instructions.Once the notary contacted us it was smooth sailing from there.  Kaye Anderson was great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Claude",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T09:10:42.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. Efficient and fast.The only drawback is the price.Last year we paid $15.00 instead of $25.00 to have the waiver notarized."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karl Schleich",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T05:45:25.000Z",
          "Titre": "It was a little confusing prior to the…",
          "Contenu": "It was a little confusing prior to the appointment but it went very smoothly once we had the session."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keith Jones",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T14:30:18.000Z",
          "Titre": "Set up slow, service great.",
          "Contenu": "Getting set up can be a bit difficult. After that, the service works well and the Notary’s are friendly and helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Suresh Suryawanshi",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T14:28:04.000Z",
          "Titre": "Good you don't have to go anywhere.",
          "Contenu": "Well first time we disconnected for some reason from the meeting and there was no way to go back to the same person. So that was not good. But second time it went smooth. Process seemed just like seating on a desk : )."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Good Crumbs",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T15:59:36.000Z",
          "Titre": "The Experience was great",
          "Contenu": "The Experience was great. They helped us to understand the ins and outs of the documents. and the process of why. Thanks Notarize.com"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "charcia dericho",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T00:26:36.000Z",
          "Titre": "Quick, Simple and Easy!!",
          "Contenu": "Quick, simple and easy! Everything I needed to know was clearly explained beforehand and this made the process smooth and efficient for everyone."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-11T13:53:53.000Z",
          "Titre": "great notary, tricky web interface",
          "Contenu": "The notary was efficient and friendly. The website took us down a few wrong paths at first and we upload info in the wrong place"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jie Gao",
          "Nb_Reviews": 2,
          "Date": "2023-04-09T00:53:37.000Z",
          "Titre": "Fast and easy process but expensive",
          "Contenu": "Fast and easy process. But $25 is expensive. I'd expect it to be cheaper since that's the benefit of technology and automation."
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "Frederick Claps",
          "Nb_Reviews": 4,
          "Date": "2023-10-13T11:24:16.000Z",
          "Titre": "10$ would be amore reasonable fee",
          "Contenu": "10$ would be amore reasonable fee but the seervice was fast and easy and the notary on the other line pleasent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Will",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T21:56:58.000Z",
          "Titre": "Feedback",
          "Contenu": "Had difficulty with getting app to take photo of ID.  Had to try multiple times.Otherwise professional, courteous, and convenient."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andre Johnson",
          "Nb_Reviews": 3,
          "Date": "2023-06-28T01:43:29.000Z",
          "Titre": "Went well for the most part",
          "Contenu": "Everything went very well, but I was cut off during my signing, but I tried again and everything was successful."
        },
        {
          "Note": 4,
          "Lieu": "PE",
          "Pseudo": "CALOS VIDAL",
          "Nb_Reviews": 1,
          "Date": "2022-06-21T15:58:08.000Z",
          "Titre": "Good and fast service!",
          "Contenu": "Good and fast service!I put four stars becuase they mention 24/7 notaries, but I requested a notary in Spanish and it was hard to find."
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T19:15:20.000Z",
          "Titre": "Identity questions were extremely…",
          "Contenu": "Identity questions were extremely confusing"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dean Odegaard",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T01:45:12.000Z",
          "Titre": "Easy once you catch on",
          "Contenu": "A really easy way to notarize a document once I figured out the use of the camera to transmit ID."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valerie Burke",
          "Nb_Reviews": 3,
          "Date": "2023-08-26T01:13:21.000Z",
          "Titre": "Easy mostly",
          "Contenu": "The verification process took me longer than driving to a notary, but otherwise it was smooth."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 2,
          "Date": "2023-06-28T00:11:37.000Z",
          "Titre": "Notary was helpful and patient",
          "Contenu": "Notary was helpful and patient. Phone support ahead of time provided inaccurate info"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 5,
          "Date": "2023-08-11T14:44:21.000Z",
          "Titre": "Everything went well",
          "Contenu": "Everything went well, but the $25.000 fee is excessive and should be offered at a more reasonable level..."
        },
        {
          "Note": 4,
          "Lieu": "LV",
          "Pseudo": "Maksim Niagolov",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T10:56:07.000Z",
          "Titre": "The process is convenient and simple",
          "Contenu": "The process is convenient and simple. Very glad that such service exist."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jojo",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T03:55:16.000Z",
          "Titre": "Efficient",
          "Contenu": "Efficient and gets the job done. Could be more friendly, but that's not necessary."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stuart Arnhoff",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T04:22:53.000Z",
          "Titre": "The notaries were all great",
          "Contenu": "The notaries were all great, very professional and polite. It's unfortunate that we had to restart and re-input info for one of our two notarizations multiple times."
        },
        {
          "Note": 4,
          "Lieu": "CR",
          "Pseudo": "Alvaro Zuñiga",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T00:54:51.000Z",
          "Titre": "Pretty fast and good",
          "Contenu": "Pretty fast and good, the main problem was to find Spanish speakers on notarise"
        },
        {
          "Note": 4,
          "Lieu": "TZ",
          "Pseudo": "Shabbir Yusufali",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T06:33:10.000Z",
          "Titre": "The process worked although with a…",
          "Contenu": "The process worked although with a little bit of confusion and lack of clarity"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "robert a hall",
          "Nb_Reviews": 1,
          "Date": "2022-06-20T03:16:49.000Z",
          "Titre": "Well done and thank you",
          "Contenu": "Well done and thank you.  Everything went smoothly although initially I did have some issues with my pics of my documents."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Abdur Rasheed",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T09:46:54.000Z",
          "Titre": "Its use full platform",
          "Contenu": "Its use full platform . but unfortunately once time my mony got stuk for one month ,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Scott",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T21:03:37.000Z",
          "Titre": "Aside from some technical issues a…",
          "Contenu": "Aside from some technical issues a couple times, it was a very seamless experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sharon Dukes",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T18:32:30.000Z",
          "Titre": "Easy process",
          "Contenu": "The entire process took less than 10 minutes to complete.  The person who notarized my documents was knowledgeable, efficient, professional and patience with the process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Judith Anderson",
          "Nb_Reviews": 3,
          "Date": "2023-08-16T02:29:10.000Z",
          "Titre": "Once I was able to access the links",
          "Contenu": "Once I was able to access the links, things went more smoothly.  The notary was great and I loved the process.  It was just hard to access the script."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "J Tom",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T15:24:17.000Z",
          "Titre": "It was quick and easy",
          "Contenu": "It was quick and easy. It was good to have an experience notary so we could make changes in the document."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "better tea",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T12:46:21.000Z",
          "Titre": "It kept spinning when the first person…",
          "Contenu": "It kept spinning when the first person accepted and had to restart."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lenny La Sac Topgunny",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T07:48:00.000Z",
          "Titre": "The process was a bit confusing",
          "Contenu": "The process was a bit confusing, prior to logging on for the actual notarizing process.I'm technology deficient so until I actually started the document review, getting ID and other required documents \"uploaded\" was initially confusing.  Once I stumbled through the verification process the time spent with the actual notary was very productive, painless and actually quite convenient."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "paula",
          "Nb_Reviews": 3,
          "Date": "2023-09-01T15:04:12.000Z",
          "Titre": "Confusing",
          "Contenu": "I received multiple emails w/instructions and found that preparing for the notary session was confusing."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Hope Mitchell",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T07:09:14.000Z",
          "Titre": "It was easy to use",
          "Contenu": "It was easy to use- the security questions were ridiculous."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T01:18:37.000Z",
          "Titre": "Helpful and Convenient",
          "Contenu": "Good notary and effective customer representative."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Erna Snukis",
          "Nb_Reviews": 2,
          "Date": "2023-06-02T01:18:59.000Z",
          "Titre": "This was easy once I called and found…",
          "Contenu": "This was easy once I called and found out how to use the process. Directions not clear."
        },
        {
          "Note": 4,
          "Lieu": "EG",
          "Pseudo": "Lamomba",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T13:26:03.000Z",
          "Titre": "Great",
          "Contenu": "It was easy and the agent was helpful. I had a problem checking my ID at first but now it is all good"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "John Swain",
          "Nb_Reviews": 2,
          "Date": "2023-08-11T14:41:59.000Z",
          "Titre": "Knowledge and friendliness of the Agent"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J. GREEN",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T07:13:34.000Z",
          "Titre": "The process was quick and convenient."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keith Bauer",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T15:46:56.000Z",
          "Titre": "Was surprised the service existed",
          "Contenu": "Was surprised the service existed. Was a great easy experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customerAngela Burnsed",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T19:00:56.000Z",
          "Titre": "It was great.",
          "Contenu": "It was great.. I will use this service again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DK",
          "Nb_Reviews": 2,
          "Date": "2022-06-20T15:42:04.000Z",
          "Titre": "Super fast and always available",
          "Contenu": "Super fast and always available, even weekends."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nathan Hruby",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T01:03:27.000Z",
          "Titre": "Great",
          "Contenu": "Great, useful site.  Use the phone based photo method"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Varn",
          "Nb_Reviews": 1,
          "Date": "2022-06-02T17:38:47.000Z",
          "Titre": "Works as advertised",
          "Contenu": "Works as advertised. A bit pricey for notarization services but their tech works and I received my notarized document in digital form.  Not having secure digital identity options is the real problem in this industry and Notarize is just a bridge between paper and secure, privacy-enabled identities.  They should consider that service for their product development roadmap."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2023-06-08T12:43:30.000Z",
          "Titre": "Fairly easy to navigate"
        },
        {
          "Note": 4,
          "Lieu": "PA",
          "Pseudo": "Angela Quintero",
          "Nb_Reviews": 1,
          "Date": "2022-05-13T15:24:47.000Z",
          "Titre": "At first it was quite frustrating but with happy ending",
          "Contenu": "At first it was quite frustrating because I couldn't get a notary who spoke Spanish, but then they recommended I use one in English and even though I don't speak English they treated me very well, it's quite complicated to do the process when you don't speak the same language, but the assistance is very good, everyone was willing to be patient and help me, which I appreciate a lot."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Son F",
          "Nb_Reviews": 1,
          "Date": "2022-05-12T19:21:03.000Z",
          "Titre": "She did good overall",
          "Contenu": "She did good overall,  I misunderstood the signature part, It appeared different than what she stated. She stated, I just type my name, there was no option for that.She appeared annoyed that I asked her the question again to make sure I understood. I had to choose the option with various signatures of my name.Other then that, she was professional and would have received 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Timothy F Calhoun",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T18:05:58.000Z",
          "Titre": "The notary I worked with was fantastic…",
          "Contenu": "The notary I worked with was fantastic and great to work with. The software had glitches. I sat in a cue waiting for 30 minutes and used your text message to help. The first person did not know anything and couldn't have gotten offline any faster. The second one knew what she was doing and told me there was a software problem, and I would have to start over. I invested one hour and 20 minutes or so in this, so it was neither fast nor efficient on the software side."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Albert",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T04:40:14.000Z",
          "Titre": "Good experience with a promising new service.",
          "Contenu": "The person I spoke with was courteous and professional.  I took me a bit more time than I expected but that might of been just as much my problem with my internet as with their systems.  It was my first time using a notary online and I won't hesitate to try it again.  Seems like something that will only get better with time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-04-30T17:02:07.000Z",
          "Titre": "Worked exactly as it was supposed to",
          "Contenu": "Worked exactly as it was supposed to. Only thing is that the first notary apparently didn't really know how to handle my form so she cancelled and thought I might need to use another remote notary service. But instead I just tried again and the next notary handled it fine. (It was a bit irritating to have to redo everything). But overall, it was great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Noble",
          "Nb_Reviews": 2,
          "Date": "2022-05-17T16:14:08.000Z",
          "Titre": "The Notarize process is smooth as silk",
          "Contenu": "The Notarize process is smooth as silk. The notaries we worked with were a pleasure and the software shines with nothing to install. Signup’s a snap and  the handoff between a laptop and a cell phone for capturing your proof of identity is outstanding. This is a model that all document service companies should be using."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Darren Stephens",
          "Nb_Reviews": 4,
          "Date": "2022-06-02T20:36:50.000Z",
          "Titre": "It was easy and fast to use",
          "Contenu": "It was easy and fast to use. HOWEVER, when I got my download, I tried to obtain TWO  notarized documents with the app. It was NOT CLEAR that the faint drop-down box was how I accessed both documents. I needed to contact tech support. Fortunately, tech support led me to a solution quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeffrey Garrison",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T02:24:28.000Z",
          "Titre": "Had difficulty getting pictures from…",
          "Contenu": "Had difficulty getting pictures from phonr"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jean callahan",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T05:44:27.000Z",
          "Titre": "I've used Notarize twice now",
          "Contenu": "I've used Notarize twice now, at my sister's recommendation, and it's a life saver when you need something notarized right away or after hours, or don't have transportation to an in-person notary public. And the digital document can then be shared with the recipient instantly.  It's also very easy. The hardest part for me was getting a good image of my ID."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T06:22:25.000Z",
          "Titre": "Notarize.com is great",
          "Contenu": "Notarize.com is the most convenient way to have something notarized. We’ve used them several times and are always shocked how easy it is."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T16:11:16.000Z",
          "Titre": "This service was an excellent experience",
          "Contenu": "This service was easy to use and the notary was very pleasant. Great experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Dow",
          "Nb_Reviews": 3,
          "Date": "2023-11-20T01:34:12.000Z",
          "Titre": "A 5 star convenience",
          "Contenu": "The entire experience took 5 minutes. The service is available 24/7, you upload your document, use your phone + your ID to verify your identity and you wait on hold for a minute to let the human catch up. That's it. Super professional and convenient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Saurabh A",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T17:01:58.000Z",
          "Titre": "Seamless Experience",
          "Contenu": "It was a seamless experience! From uploading the document to verifying identity to the video call with the notary - everything was smooth and quick. Saved me a trip to the local notary."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T02:38:10.000Z",
          "Titre": "I have used the service three times in…",
          "Contenu": "I have used the service three times in the last month and am impressed!  The site is easy to use and clear and a notary came on within seconds each time to finalize the signing.  Very pleased and will always use them when I need a notary!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Catherine New York",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T01:10:23.000Z",
          "Titre": "Efficient and quality service",
          "Contenu": "I regularly get notarizations from Notarize.com for my translation clients and always get a prompt, efficient and usually friendly service. Some notary public are faster and nicer than others. All give the expected service.I just have a technical problem sometimes when taking a picture of the back of my driver license on my cellphone: the frame is too small and I often need to retake this picture several times. I think it is a bug that needs to be fixed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie H.",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T01:36:21.000Z",
          "Titre": "What a great service you provide!",
          "Contenu": "This was so easy to schedule! Fast and friendly service on a Saturday afternoon that was so convenient. Your employee quickly finished our documents. What a wonderful service you provide! Thank you so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "bonnie marrone",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T01:29:04.000Z",
          "Titre": "Notary on call",
          "Contenu": "We had to have form notarized for a retirement fund issue and worked with Notary and it was so easy and efficient!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T22:04:56.000Z",
          "Titre": "Remarkably easy to use",
          "Contenu": "Remarkably easy to use.  No app to download; no endless tap-tap-tapping.  The notary recognized the documents immediately.  One does have to open an account, so add another username/password combo to my database of log-in credentials.  Reasonable fee also; less than I have paid for a notary to visit my home."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T02:53:47.000Z",
          "Titre": "Satisfied returning customer",
          "Contenu": "Satisfied returning customer! This was my 2nd time using notarize and it was as quick and convenient as the last time. Thank you for offering this as a possibility, super easy and accessible from nearly anywhere."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T08:23:10.000Z",
          "Titre": "Great quick and efficient service",
          "Contenu": "Great quick and efficient service. Connecting to the notary was quick. It was like she was waiting for me! Receiving the documents was just a s quick. I would definitely we be using this again!"
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Daniel Hudson",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T20:20:11.000Z",
          "Titre": "So fast, so easy!",
          "Contenu": "I still can't believe how fast and easy this process was. I think it took me no more than 5 minutes from start to finish, the notary was very pleasant and efficient, as was the entire experience with the online platform.  I'm currently out of the country so this was a godsend. Definitely recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 5,
          "Date": "2023-12-02T05:14:51.000Z",
          "Titre": "Great",
          "Contenu": "Great.  Very professional and easy to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Johnny",
          "Nb_Reviews": 3,
          "Date": "2023-11-15T03:31:32.000Z",
          "Titre": "The Notary I spoke with was…",
          "Contenu": "The Notary I spoke with was Outstanding.  She was patient and informative.  She made what I anticipated to be a difficult experience very easy.  The whole process from uploading my document to payment and receiving my notarized document took less than 10 minutes!!  It would have taken me no less than 20 minutes to drive to a local notary for the same service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marlaf",
          "Nb_Reviews": 3,
          "Date": "2023-11-23T10:52:38.000Z",
          "Titre": "So simple to do",
          "Contenu": "So simple to do, they make it easy.  You don’t need to spend $145, it’s a ten minute job and they charge $25, anytime of day or night, anywhere in the world.  My notary was easy to understand and friendly as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Norayda",
          "Nb_Reviews": 3,
          "Date": "2023-11-14T03:04:54.000Z",
          "Titre": "Speed and Ease",
          "Contenu": "Speed and EaseI had never used an online notary service before and I was finding it difficult to connect with one that could assure me they could take care of me quickly and reliably. All the rest I found on google seemed clunky to navigate and I was frantic and pressed for time. Notarize.com (Proof.com) just worked and I was led by the hand through each step in their platform. And when I was on the video with the notary – who is far more thorough than an in-person notary by the way – he was very friendly, courteous and efficient calming my frazzled nerves. The payment process at the tail end could not have been easier and receiving access to my notarized document could not have been faster. I'm a fan. Thank you, Tyrrell C!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Marjorie Beachill",
          "Nb_Reviews": 15,
          "Date": "2023-11-16T01:42:27.000Z",
          "Titre": "Great service",
          "Contenu": "Great service! So easy to use. My notary was very pleasant, knowledgable and patient! Very reasonable price as well. Would recommend without hesitation"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Jo - Toowoomba Australia",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T05:10:18.000Z",
          "Titre": "Best online notary service I have used.",
          "Contenu": "I have used other services before. This was much more convenient and I got my document immediately! The notary was helpful and patient. Will definitely use for my future needs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T01:37:52.000Z",
          "Titre": "fast and way easier than driving around…",
          "Contenu": "fast and way easier than driving around town trying to find a notary at a brick and mortar store"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T03:41:33.000Z",
          "Titre": "The way to go",
          "Contenu": "Super quick and easy.   I used it because I needed an online notary, but I would use it again if I needed a notary at all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T15:40:55.000Z",
          "Titre": "The notary was very efficient and…",
          "Contenu": "The notary was very efficient and polite."
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Kyle Britto",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T02:12:49.000Z",
          "Titre": "I was just shocked at how convenient…",
          "Contenu": "I was just shocked at how convenient and straightforward this process was. Excellent service!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T08:30:17.000Z",
          "Titre": "Simple and took less than 5 minutes to…",
          "Contenu": "Simple and took less than 5 minutes to get my document notarized."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T03:18:39.000Z",
          "Titre": "Very polite and professional",
          "Contenu": "Very polite and professional. Could not ask for a better experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael v",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T03:13:41.000Z",
          "Titre": "I’m super happy with the service",
          "Contenu": "I’m super happy with the service.   Great process and quick results."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy Customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T16:40:13.000Z",
          "Titre": "Quick and easy!",
          "Contenu": "Intuitive interface that was quick to navigate; notary called immediately and was very courteous and professional. Highly recommend this service!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T09:50:38.000Z",
          "Titre": "Easy and super convenient!",
          "Contenu": "Very easy to use and worked well for us while traveling!!"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Kay",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T10:42:10.000Z",
          "Titre": "Reliable and Fast",
          "Contenu": "Prompt, efficient service. Fair price. Highly recommend. Immediate responsiveness and assistance. Glad to have this service “at the ready.”"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T01:33:07.000Z",
          "Titre": "Notarize is a great resource",
          "Contenu": "Notarize is a great resource that I have used on many occasions, especially when dealing with documents from overseas where ink isn't required."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sanket  Tatiya",
          "Nb_Reviews": 4,
          "Date": "2023-11-17T01:42:52.000Z",
          "Titre": "Very quick and easy to navigate.",
          "Contenu": "Very quick and easy. Customer support is very helpful for first timers. Literally done in 15 minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T01:50:06.000Z",
          "Titre": "The woman who guided me through the…",
          "Contenu": "The woman who guided me through the notary process was very patient and helpful. She was simply delightful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T03:53:54.000Z",
          "Titre": "So easy to use",
          "Contenu": "So easy to use. I got my document notarized in 5 minutes and was able to send it to my son in a different state."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jindou",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T03:59:52.000Z",
          "Titre": "10 stars. Best experience ever.",
          "Contenu": "From “I need to get something notarized” to “it got notarized” in 5 min. So amazing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T01:07:07.000Z",
          "Titre": "such convenience",
          "Contenu": "such convenience, everyone I have dealt with is beyond helpful. This is the best thing since slice bread."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fabrice Dejean",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T06:52:22.000Z",
          "Titre": "NOTARIZE rocks!",
          "Contenu": "NOTARIZE rocks! The professionalism and personability of the Public notary commissioners made me feel very comfortable. I particularly like the easiness of the entire process and the promptness of the service provided. Overall, notarizing my documents online was a suprizingly positive experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T01:15:00.000Z",
          "Titre": "It was an easy process and quick",
          "Contenu": "It was an easy process and quick. The notary was very friendly and knew what to do, 'I would defiantly recommend this service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Radley B",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T01:13:51.000Z",
          "Titre": "The service was very convenient and quick",
          "Contenu": "The service was very convenient and quick.  This type of service is a game changer.  You no longer have to schedule and make an appointment with your bank.  Everything is done online and just like that you have your documents notarized.  The young lady Courtney that assisted me was very professional and courteous."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 3,
          "Date": "2023-11-23T01:10:00.000Z",
          "Titre": "Great Service",
          "Contenu": "The process was simple, and the notary I was connected with was great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stewart",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T01:26:06.000Z",
          "Titre": "Easy and efficient",
          "Contenu": "Easy and efficient! Great value. Great time saver from going to a traditional bank."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alicia",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T15:11:10.000Z",
          "Titre": "Very easy to use",
          "Contenu": "Very easy to use! No glitches. The person was wonderful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T04:35:43.000Z",
          "Titre": "I have used this service several times",
          "Contenu": "I have used this service several times, which is always professional and fast."
        },
        {
          "Note": 5,
          "Lieu": "BG",
          "Pseudo": "Yanni",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T18:40:19.000Z",
          "Titre": "Amazing service - 24/7",
          "Contenu": "Amazing service! Fast, helpful and available 24/7. What else can you ask for?!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mark howard",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T01:05:51.000Z",
          "Titre": "Our notary was sure helpful and patient…",
          "Contenu": "Our notary was sure helpful and patient with us and got it done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T01:00:50.000Z",
          "Titre": "Ashley was very pleasant and…",
          "Contenu": "Ashley was very pleasant and professional. extremely easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sophia",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T06:41:09.000Z",
          "Titre": "great, easy",
          "Contenu": "Super quick."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T01:23:31.000Z",
          "Titre": "Pleasant QUICK and I got this done…",
          "Contenu": "Pleasant QUICK and I got this done while bedridden from surgery! Finally tech helps out!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T14:29:23.000Z",
          "Titre": "Very fast and very easy transaction"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Christine",
          "Nb_Reviews": 2,
          "Date": "2023-10-13T09:41:48.000Z",
          "Titre": "Fast, efficient and professional",
          "Contenu": "I found the site easy to use and the sign-up process was not complicated. The notary was available almost immediately and was patient and very professional throughout the process. I would highly recommend them and would use if the need arises in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T00:26:08.000Z",
          "Titre": "Simple easy process",
          "Contenu": "Simple easy process. At first, I thought it was a scam but it's legit and helped with a notary needed quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T01:07:47.000Z",
          "Titre": "That was easy",
          "Contenu": "Brother that helped me out was quick, easy to understand, and made things simple."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Kennedy",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T04:43:14.000Z",
          "Titre": "First digital experience, loved it!",
          "Contenu": "This was the first time I have used a notary service through a digital environment.  It was wonderful.  The convenience was amazing.  I am familiar will needing to drive to a title company (usually a long distance from my house) to sign documents I have already reviewed and needing to spend hours traveling, waiting, signing, and traveling.  This was very efficient and saved all the travel and wait time. Oh, it was on Saturday (when it was convenient for my wife and me)!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T04:01:25.000Z",
          "Titre": "Quick and simple!",
          "Contenu": "I think the whole session lasted less than 5 minutes!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debkny",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T01:32:30.000Z",
          "Titre": "Quick and Easy!",
          "Contenu": "Quick and Easy!You have made it a super-easy procedure to get something notarized, whereas before, I'd have to wait at my bank for hours until the notary arrived.I've recommended you to everyone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Altagracia Kubinyi",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T03:00:41.000Z",
          "Titre": "It was great and easy with the person…",
          "Contenu": "It was great and easy with the person that support us."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T03:17:17.000Z",
          "Titre": "Professionalism",
          "Contenu": "Professionalism, and courteous. The notary was sure to identify each party."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kayla",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T01:05:41.000Z",
          "Titre": "Amazing service",
          "Contenu": "Amazing service! The lady was super helpful and very sweet."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Jody Seymour",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T08:00:16.000Z",
          "Titre": "Excellent service",
          "Contenu": "The notary I worked with was both efficient and kind. The verification process was quick, the website worked perfectly and both times I used the service,  a notary came on within seconds."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Gutknecht",
          "Nb_Reviews": 2,
          "Date": "2023-10-31T18:03:07.000Z",
          "Titre": "Notarize was really easy to use",
          "Contenu": "Notarize was really easy to use.  The Notary was friendly and the process to execute the closing of my home was straightforward."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T06:09:24.000Z",
          "Titre": "Great experience",
          "Contenu": "Quick and efficient. A pleasure to work with polite and professional staff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "cuDonaldstomer",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T04:17:04.000Z",
          "Titre": "He was just very professional a…",
          "Contenu": "He was just very professional a gentleman, seems very intelligent knew exactly what to do you streamlined the entire process it was just comfortable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Jones",
          "Nb_Reviews": 4,
          "Date": "2023-10-06T01:13:51.000Z",
          "Titre": "Way easier than I thought it would be",
          "Contenu": "I was pleasantly surprised. I was prepared for there to be problems or for it to take forever or just not be very easy.It was actually quick and easy. Took less than 5 minutes. I will recommend to anyone to needs something notarized."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ed valenti",
          "Nb_Reviews": 5,
          "Date": "2023-11-22T16:11:04.000Z",
          "Titre": "Very fast response time",
          "Contenu": "Very fast response time. Very accurate"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "tracy mcmackle",
          "Nb_Reviews": 3,
          "Date": "2023-10-11T11:43:05.000Z",
          "Titre": "Excellent remote online notary services !",
          "Contenu": "After a google search I learned about online notary services and that other major firms use this site. The process was smooth and seamless and most of all quick."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T01:18:05.000Z",
          "Titre": "too easy",
          "Contenu": "love the service! so easy. Yes this is me, yes I am signing the document, boom, bang done!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristi",
          "Nb_Reviews": 2,
          "Date": "2023-11-19T10:46:37.000Z",
          "Titre": "Quick and efficient",
          "Contenu": "First time using this service. I was impressed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tutorfly",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T19:29:26.000Z",
          "Titre": "Notarize is what it adverstises to be",
          "Contenu": "Notarize is what it adverstises to be.  Fast, quick, and efficient notarizing service 24/7.  It's nice to find a service that delivers on what it promises."
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "Walsh",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T04:05:12.000Z",
          "Titre": "Fast & efficient",
          "Contenu": "The service was fast and efficient. All instructions and information was clear. I highly recommend for virtual notary signing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom McAdams",
          "Nb_Reviews": 4,
          "Date": "2023-10-20T07:52:10.000Z",
          "Titre": "Perfect for living abroad",
          "Contenu": "The service is efficient, timely, and professional. The price is very reasonable. I live abroad and this service has saved me a lot of cost and time. will use it again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phil M",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T03:06:40.000Z",
          "Titre": "Notary was thorough and professional",
          "Contenu": "Notary was thorough and professional. The whole process took less than 10 minutes. Will use again and recommend! Thanks Notarize!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Brockman",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T02:33:51.000Z",
          "Titre": "Too Smooth",
          "Contenu": "Super easy to navigate and Charles, who handled our closing was fantastic. Much better than having to fight traffic to schlep to an office in person."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy Fagan",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T23:54:37.000Z",
          "Titre": "The process was efficient and the…",
          "Contenu": "The process was efficient and the Notary was helpful and professional"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RayD",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T01:02:08.000Z",
          "Titre": "Easy way to get this done",
          "Contenu": "So, easy from the comfort of my office."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R.D.",
          "Nb_Reviews": 3,
          "Date": "2023-09-13T19:16:50.000Z",
          "Titre": "Most enjoyable document signing experience!",
          "Contenu": "This has been the most enjoyable document signing experience using the virtual signing and with the patience of our very seasoned and patient notary professional we completed all paperwork without driving from a remote location!!! Feeling very safe in signing this way and although the system is very well verified on the process end... Wanting to have a repeating to certify with  a Photo&Data that I am who I am and post an id again is a bit too much just for a posting that TP sent to me from information culled in the notarizing process.Thank you-O"
        },
        {
          "Note": 5,
          "Lieu": "CR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T02:14:32.000Z",
          "Titre": "The lady was friendly",
          "Contenu": "The lady was friendly, gave clear instructions and did not hurry through the process. This was my first experience with this service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Lukas",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T08:29:19.000Z",
          "Titre": "Professional, Fast, Knowledgeable",
          "Contenu": "No wasted time if you are properly prepared.  They are thorough in what they do, worth the fee in my opinion as this was quite convenient and available without delay."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T15:40:34.000Z",
          "Titre": "the process was simple and easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T04:55:20.000Z",
          "Titre": "Notary was very professional and polite"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dock and Jam",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T05:59:05.000Z",
          "Titre": "The notary was professional and…",
          "Contenu": "The notary was professional and friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tricia Dierks Hueffmeier",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T04:34:41.000Z",
          "Titre": "It was a very easy and efficient…",
          "Contenu": "It was a very easy and efficient process to get something notarized that quickly. Way better than having to take the time to go find someone in person."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zoe",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T02:51:37.000Z",
          "Titre": "It was fast",
          "Contenu": "It was fast, easy, and reliable!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T01:10:54.000Z",
          "Titre": "Easy to work with and never have…",
          "Contenu": "Easy to work with and never have problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LW",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T16:23:51.000Z",
          "Titre": "Efficient!",
          "Contenu": "It was a quick and easy process. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennah I",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T01:04:33.000Z",
          "Titre": "Love the process",
          "Contenu": "First had a bit of audio issue - but Second Lady was amazing and got through it in a matter of minutes! Very quick and efficient - LOVE the process"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T01:47:26.000Z",
          "Titre": "I couldn't believe how fast everything went. I clicked the button to get a notary and I swear one second went by when someone came online.",
          "Contenu": "I couldn't believe how fast earthing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shelley",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T01:03:44.000Z",
          "Titre": "So efficient!",
          "Contenu": "Everything went quickly and smoothly.  So much easier than waiting in line at the bank!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margaux",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T01:51:50.000Z",
          "Titre": "Notary in my homeInstructions were given in brief boxes…",
          "Contenu": "Instructions were given in brief boxes appearing one at a time. “Do this” - Continue. Very easy to navigate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "steve pennington",
          "Nb_Reviews": 3,
          "Date": "2023-11-16T01:10:19.000Z",
          "Titre": "It was very convenient and reasonably…",
          "Contenu": "It was very convenient and reasonably priced"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T14:41:01.000Z",
          "Titre": "Very smooth",
          "Contenu": "Very smooth, affordable, quick, and simple."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Penny Morey",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T02:00:04.000Z",
          "Titre": "Jenny was so professional",
          "Contenu": "Jenny was so professional! Very polite ! Spoke clear ( heard every work she said didn’t have to get her to repeat nothing ) !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy",
          "Nb_Reviews": 2,
          "Date": "2023-10-13T21:13:04.000Z",
          "Titre": "Professional",
          "Contenu": "Professional experience. So happy they offer 24/7 service for those last-minute items, and the fact that our company is nationwide and remote."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Shafiga Daulet",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T09:45:21.000Z",
          "Titre": "Simple notarization process",
          "Contenu": "Simple notarization process, once I uploaded the document everything was quite easy. Thank youi"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CYNTHIA",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T02:58:32.000Z",
          "Titre": "Quicj",
          "Contenu": "Quick and easy.  Very professional"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrea Hernandez",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T23:12:44.000Z",
          "Titre": "This service was very helpful and I was satisfied with service.",
          "Contenu": "This service was very helpful and I was able to receive my documents right in the mail! I would definitely recommend this to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T01:22:25.000Z",
          "Titre": "Fast",
          "Contenu": "Fast, reliable and easy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Symyne shinn",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T02:07:19.000Z",
          "Titre": "I would highly recommend",
          "Contenu": "Pretty quick and sends copy to whoever needs them too"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth Lennon",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T05:42:25.000Z",
          "Titre": "Helpful and easy to get through the…",
          "Contenu": "Helpful and easy to get through the notary process to set up a digital mailbox so they have authorization to receive my mail. Appreciate the ability to do this all virtually!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oscar",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T03:37:45.000Z",
          "Titre": "Fast and easy",
          "Contenu": "Great service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bernardo",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T00:58:53.000Z",
          "Titre": "It’s fast and I don’t need to go outside"
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Donald B",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T17:36:11.000Z",
          "Titre": "Great Service from start to finish!"
        }
      ]
    }
  ]
}