{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "notarygeek.net",
      "Review": [
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T02:45:49.000Z",
          "Titre": "Notary Geek responded to my inquiry…",
          "Contenu": "Notary Geek responded to my inquiry immediately and was able to provide assistance within the hour. The notary was really accommodating to the situation. Good bed side manner, so to speak."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ansari brian",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:20:44.000Z",
          "Titre": "Greg is fast efficient and results oriented",
          "Contenu": "Greg responded to a quick turnaround and helped us work through the logistics of getting it done quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa Garner",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T10:08:37.000Z",
          "Titre": "It is always a pleasure",
          "Contenu": "It is always a pleasure working with Greg.  He is very proficient and efficient and he is beyond thorough."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lamin Tamba",
          "Nb_Reviews": 9,
          "Date": "2023-12-21T08:20:07.000Z",
          "Titre": "Brilliant service",
          "Contenu": "Brilliant service, quick and easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Helfrich",
          "Nb_Reviews": 7,
          "Date": "2023-12-01T21:25:41.000Z",
          "Titre": "Perect",
          "Contenu": "Quick, painless, simple, knows what he's doing. Complete confidence in Greg, and he's now my go to guy for ANY notary needs."
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "Hadi Hakimi",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T03:53:26.000Z",
          "Titre": "NotaryGeek.net is Quick, Straightforward and Professional",
          "Contenu": "With the help of Greg at NotaryGeek.net, this wouldn't be simpler than this. It took me about 10-15 minutes to verify my identity and finally sign the USPS 1583 form. It took something around one month to feel stuck with notarizing the form with other known services as they have made the process completely sophisticated. I have been feeling disappointed and had no clue how I could move forward with this. Greg at Notary Geek provided me with such wonderful customer service and answered all my questions and concerns. Keep up the hard work, dudes!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T08:11:31.000Z",
          "Titre": "top notch experience",
          "Contenu": "Greg is a super straightforward person. It was really fast and easy work—I love working in such an efficient way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicole Jones",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T02:52:15.000Z",
          "Titre": "I required notarization and Notary Geek…",
          "Contenu": "I required notarization and Notary Geek managed it seamlessly through my phone. Thanks to Greg, my friend was able to retrieve her car from impound even though it was all handled from a different state online. If I ever need notary services in the future, or if anyone I know does, we'll definitely turn to Notary Geek."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Olga",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T21:12:13.000Z",
          "Titre": "Excellent Notary",
          "Contenu": "I highly recommend Notary Geek for notarial services. Absolute five stars, individual approach, notary at the strictly appointed time, a wide choice of time slots for an appointment with the notary, possibly on the same day. Low cost. The notary is very polite, understanding, and patient. My parents are about 70 years old, and they were able to complete the entire notarization process themselves on a smartphone. Excellent service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mayank V",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T23:22:30.000Z",
          "Titre": "Greg is helpful",
          "Contenu": "Greg is helpful, easy to work with. The system was very convenient. I highly recommend. I sure will use help again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Obeyesol",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T15:25:24.000Z",
          "Titre": "Greg went the extra mile to make sure…",
          "Contenu": "Greg went the extra mile to make sure everything went smoothly. The price is very fair, and he appears to be an industry expert in Remote Online Notarizations (RONs). He also teaches and trains other RONs. Greg is really an endless void of knowledge when it comes to this, and his IT experience ensures that the entire experience runs smoothly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Avis",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T05:23:03.000Z",
          "Titre": "RON Witness",
          "Contenu": "I was a witness for Greg during a RON signing. He is friendly, professional and does quality work. He is knowledgeable and thorough. He went over everything to make sure there was not any errors or omissions. I look forward to using his services and working with him again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BoBo",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T23:44:35.000Z",
          "Titre": "Loved working with Greg!",
          "Contenu": "Loved working with Greg! The whole experience was very fast and efficient. We couldn't find a notary public open, I found Notary Geek on Google, called, Greg andswered ASAP and the document was done within minutes! This was at a time where we needed the document done right away and had no way of getting it done. I definitely recommend him and will go to him again in the future."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Yvonne and Joan",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T09:23:26.000Z",
          "Titre": "A professional Notary",
          "Contenu": "I found the Notary Geek to be not only very professional but also thorough. He verified the government documentation before proceeding which shows that he takes this position serious. Most of all, he was sincere and patient as it relates to dealing with an 84 year old pensioner.I will definitely use this service again when needed and I will also recommend this Seller to my friends who may be in need of notary services.Thank you and with regards,Yvonne and Joan."
        },
        {
          "Note": 5,
          "Lieu": "PE",
          "Pseudo": "Gerald",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T02:16:58.000Z",
          "Titre": "Done in less than a hour - Satisfied",
          "Contenu": "Notary Geek gets the job done blazing fast and provides multiple channels of support for international clients"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ali Miller",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T21:55:59.000Z",
          "Titre": "Greg was amazing, great customer service, quick and patient!",
          "Contenu": "Greg was amazing, patient and helped with our international client and complex situation. He was so responsive and helpful.  We will definitely use him again, as well as recommend him. Thank you Greg!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Javier",
          "Nb_Reviews": 2,
          "Date": "2023-08-19T06:05:19.000Z",
          "Titre": "Greg save the day again",
          "Contenu": "Greg, once again great customer service, I came back for another assistance & this one was a little bit more time consuming & elaborated. But once again Greg when beyond and help me. will highly recommend him...."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Carolyn",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T10:15:43.000Z",
          "Titre": "Exceptional Online Notary",
          "Contenu": "I cannot speak highly enough about the service provided by Greg Lirette. I'm located in Australia and sent a query to confirm he would be able to assist with documents for the closing of a property sale. I did not expect that Greg would respond to my query as quickly let alone get the work finalised for me straight away working into the wee hours of the morning.He is highly knowledgeable and has a genuine drive and commitment to seeing that customers are satisfied. He goes above and beyond what I have experienced previously through an online notary scrutinising what we are being asked to sign. He has also offered to provide support and communicate with the title company if they challenge the submission of the online document. Highly recommend Notary Geek. Thanks Greg for your support."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Veena Khanna",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T01:41:07.000Z",
          "Titre": "Good job",
          "Contenu": "Good job by the notary. However time taken is considerable for setting up the whole process prior to getting in contact with notary. This should be resolved by the platform by providing live help if technically feasible."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T00:01:46.000Z",
          "Titre": "Notary was really polite",
          "Contenu": "Notary was really polite, friendly and helpful. The customer service is the best. Was struggling big time being Non US resident. Solved matter with good customer service."
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "Serafima Kokhanovskaia",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T22:01:56.000Z",
          "Titre": "Thank you, Greg!",
          "Contenu": "I worked with Greg Lirette, and it went great! Greg helped me with my documents just so fast — we scheduled our online session in less then a day and got things done! Greg is very professional, extremely fast and he is just a nice person to deal with. I wish I work with him again in the future when I need a notary help!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "J Carlton",
          "Nb_Reviews": 3,
          "Date": "2023-07-05T21:44:58.000Z",
          "Titre": "AM question post lunch answer!",
          "Contenu": "I posted a question this morning regarding a possible misinterpretation of information about credentialing in my state. By this afternoon, and with a couple quick questions answered on my end, I had a CLEAR and WELL DEFINED answer! Best and clearest help I've gotten so far!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kyle Boyd",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T09:40:30.000Z",
          "Titre": "Very professional and helpful",
          "Contenu": "We reached out to Greg to notarise two documents for myself and my partner. He responded instantly, and we had everything completed within the hour, very helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Court",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T20:12:03.000Z",
          "Titre": "Don't Look Anywhere Else for Notary Services",
          "Contenu": "Greg was able to get my document notarized in a timely manner. He's friendly, knowledgeable and I would rate his customer service with FIVE STARS. I would highly recommend Greg and his notary services!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 2,
          "Date": "2023-11-05T01:23:02.000Z",
          "Titre": "Greg was so accommodating and…",
          "Contenu": "Greg was so accommodating and immediately ready to help us with our needs. He is able to perform online notarizations and I would recommend to anyone in the area."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T15:45:38.000Z",
          "Titre": "A wonderful person and a master of…",
          "Contenu": "A wonderful person and a master of their craft. Helped me from start to finish. During the process, I encountered technical issues, and they assisted me in resolving everything."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T20:12:55.000Z",
          "Titre": "Awesome experience!",
          "Contenu": "Greg provided me with outstanding notary service. He was incredibly helpful and notarized my form swiftly. I highly recommend his services for anyone in need of a reliable notary. Thank you, Greg!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa Wilkinson",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T00:46:56.000Z",
          "Titre": "My dealings with Greg Lirette over the…",
          "Contenu": "My dealings with Greg Lirette over the years have revealed his conscientious, responsive, meticulous, thorough and knowledgeable nature. He is especially informed in the criminal justice field and has served as an invaluable source for me many a time. I'm continually impressed by his intellect and approach to public service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sergio Fontal",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T08:16:21.000Z",
          "Titre": "Very patient with my elderly parents",
          "Contenu": "Greg was very patient with my elderly parents and their technologycal handycap. He took them step by step and repeated steps to make it easy for them to go through the process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joanna",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T07:53:17.000Z",
          "Titre": "Excellent Service",
          "Contenu": "Greg was a great help to me with my online access issue. He helped me resolve it to the end. I highly recommend his services. His customer service is exemplary. He is also very knowledgeable and friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T17:43:21.000Z",
          "Titre": "Greg was very knowledgeable about the…",
          "Contenu": "Greg was very knowledgeable about the process and walked me through it in a non condescending way"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy Customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T22:03:07.000Z",
          "Titre": "Excellent Service!!!",
          "Contenu": "If you are looking for a true professional, that will complete the task at hand in a professional, accurate and timely manner, than look no further!  He is very professional, easy to interact with, super smart, and will complete your request not just on time, but early:)  I will hire again in the future!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Don C.",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T20:56:10.000Z",
          "Titre": "Quick and super easy",
          "Contenu": "Greg was friendly and professional and made the process of having our documents notarised a breeze, completed in minutes at a reasonable price.I would thoroughly recommend his services to anybody."
        },
        {
          "Note": 5,
          "Lieu": "MR",
          "Pseudo": "Babacar Ndiouck",
          "Nb_Reviews": 4,
          "Date": "2023-07-02T06:54:31.000Z",
          "Titre": "My name is Babacar Ndiouck",
          "Contenu": "My name is Babacar Ndiouck, I am from Mauritania and I live in Nouakchott. I am very satisfied with the service. My 1583 form was notarized in less than 5 minutes. Very satisfied"
        },
        {
          "Note": 5,
          "Lieu": "PY",
          "Pseudo": "Belen C.",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T01:27:21.000Z",
          "Titre": "Notarized outside US.",
          "Contenu": "If you live outside the US and are looking to notarize a document. This is the right professional, quick communication and explains the entire process. You save a lot of time."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Andres S",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T07:25:38.000Z",
          "Titre": "Greg was incredible",
          "Contenu": "Greg was incredible. Available super late, able to notarize last minute, efficiently and kindly. What more could you want ?!"
        },
        {
          "Note": 5,
          "Lieu": "VC",
          "Pseudo": "Alexandre Desmarais",
          "Nb_Reviews": 2,
          "Date": "2023-10-29T02:41:38.000Z",
          "Titre": "Notary Geek's Review",
          "Contenu": "Notary Geek's service for apostilling my document was exceptional. They swiftly guided me through the process, ensuring all requirements were met meticulously. Their expertise and efficiency were commendable, resulting in a hassle-free experience. I highly recommend Notary Geek for anyone seeking reliable and top-notch apostille services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug Hudson",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T00:25:01.000Z",
          "Titre": "Greg is super responsive",
          "Contenu": "Greg was extremely helpful and efficient and responsive.  Will totally use again."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "GoJack LTD",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T12:18:35.000Z",
          "Titre": "Greg was really helpful and very…",
          "Contenu": "Greg was really helpful and very professional. He helped me with exactly what I needed very quickly and efficiently, available 24/7."
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "customer Tzu-Wei Kao",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T03:08:04.000Z",
          "Titre": "Greg Lirette is great",
          "Contenu": "Greg Lirette is great! Very efficient and professional, definitely use his service again next time! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Javier",
          "Nb_Reviews": 2,
          "Date": "2023-07-28T20:10:29.000Z",
          "Titre": "Greg Lirette was excellent",
          "Contenu": "Greg Lirette was excellent, very patient with my elderly parents, they are technical challenge. no pressure. answer all questions in a professional & simple manner."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "A B",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T15:08:51.000Z",
          "Titre": "Greg L is an amazing and honest guy",
          "Contenu": "Greg L is an amazing and honest guy. gave me absolutely good advice. i recommend using his services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yesenia Escoto",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T15:15:06.000Z",
          "Titre": "This was my first time working with…",
          "Contenu": "This was my first time working with Greg, he is very patient, knowledgeable and professional. I look forward to working with him again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tanisha Shaefer",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T20:48:40.000Z",
          "Titre": "He has allot of knowledge as a notary…",
          "Contenu": "He has allot of knowledge as a notary and he reads all the laws rules and regulations he is awesome will shop again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rich Urban",
          "Nb_Reviews": 3,
          "Date": "2023-10-04T02:00:32.000Z",
          "Titre": "Very professional - definitely recommend",
          "Contenu": "Very professional - They have successfully completed several notarizations for us involving signers that are located outside of the US or in other states.  Very knowledgable on what is required for a proper signing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve demetro",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T04:51:02.000Z",
          "Titre": "My experience was great highly recommend",
          "Contenu": "My experience was great. Everything went smoothly perfectly to my knowledge will use again if I need to be highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Michele",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T13:27:05.000Z",
          "Titre": "Their services are very easy to use and…",
          "Contenu": "Their services are very easy to use and effective for my purpose of use (notarization of documents to work abroad) and they come with a very reasonable price."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T21:19:51.000Z",
          "Titre": "He really went above and beyond to make…",
          "Contenu": "He really went above and beyond to make sure the whole process went smoothly! Great service, would recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edwin",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T21:09:33.000Z",
          "Titre": "Greg is very detailed and super easy to…",
          "Contenu": "Greg is very detailed and super easy to work with. His services were prompt and precise. I would definitely recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mayer Berkowitz",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T22:08:12.000Z",
          "Titre": "Was very helpful and guided me step by…",
          "Contenu": "Was very helpful and guided me step by step price was very reasonable a pleasure doing business with."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Kunal",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T05:07:45.000Z",
          "Titre": "The Best and Fastest Notary Service Hands Down",
          "Contenu": "Greg was very helpful and guided me through the process. Couldn't have asked for a faster, easier and better service. He got everything done in less than 10 minutes!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Sias",
          "Nb_Reviews": 5,
          "Date": "2023-09-15T04:56:14.000Z",
          "Titre": "Greg offers excellent notary services",
          "Contenu": "Greg offers excellent notary services! Highly recommended. He is intimately familiar with a wide variety of legal documents and makes the whole process as smooth as possible!!!"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 2,
          "Date": "2023-08-26T23:13:39.000Z",
          "Titre": "Greg was great to work with",
          "Contenu": "Greg was great to work with. He handled my needs professionally and quickly. I’d definitely use his services again."
        },
        {
          "Note": 5,
          "Lieu": "BH",
          "Pseudo": "EMILIO VENUTI",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T20:25:54.000Z",
          "Titre": "It was pretty straight forward and easy…",
          "Contenu": "It was pretty straight forward and easy to complete the transaction requested. I strongly recommend his service."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T01:18:20.000Z",
          "Titre": "Exceptional service!",
          "Contenu": "It was a stress-free seamless professional experience. I highly recommend Notary Geek. I will use Notary Geek for all my future Notary needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JTB",
          "Nb_Reviews": 2,
          "Date": "2023-07-07T04:34:08.000Z",
          "Titre": "Greg is awesome",
          "Contenu": "Greg is awesome! Very smooth process. Certainly my go to professional for all my notary needs."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T00:41:51.000Z",
          "Titre": "Fantastic Notary",
          "Contenu": "Greg was very kind, helpful and easy to work and communicate with. Fantastic service!"
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Orel Ben David",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T11:51:16.000Z",
          "Titre": "professional and reliable service",
          "Contenu": "Hi,Greg Lirette gave me professional and reliable service; He is a unique and fair person :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T22:32:38.000Z",
          "Titre": "Fast response",
          "Contenu": "Fast response, easy to work with, excellent rates.  Highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arnold",
          "Nb_Reviews": 2,
          "Date": "2023-09-03T22:15:48.000Z",
          "Titre": "Notary Geek's onlHighly Efficient Online Notary Service - A Lifesaver for International Legal Mattersne notary service has…",
          "Contenu": "Notary Geek's online notary service has been a true game-changer for me as an entertainment attorney working with international clients. It has significantly improved the efficiency of my practice, enabling me to meet tight deadlines with ease and serve clients around the globe seamlessly. I wholeheartedly recommend the service to fellow legal professionals and anyone in need of reliable and efficient notarization services."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-06-30T19:19:35.000Z",
          "Titre": "He made the whole process seamless and…",
          "Contenu": "He made the whole process seamless and eventhough there were some hurdles he was very helpful"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Miss K",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T22:17:48.000Z",
          "Titre": "Fast and professional",
          "Contenu": "Greg was patient, attentive. The service was fast and efficient. Everything was very clear and professional."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Soyinka Sotimehin",
          "Nb_Reviews": 8,
          "Date": "2023-10-07T13:52:02.000Z",
          "Titre": "He made it straightforward",
          "Contenu": "He made it straightforward. I highly recommend Greg's services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Travis Ellison",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T15:51:18.000Z",
          "Titre": "Greg was very knowledgeable and helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S Davis",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T05:31:58.000Z",
          "Titre": "Great experience",
          "Contenu": "Greg was very knowledgeable. He has a very flexible schedule. He is very pleasant to speak with. He provided a quality product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lorena",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T03:33:46.000Z",
          "Titre": "Excellent service!",
          "Contenu": "Excellent service for documents we needed notarized quickly. Service provided was above and beyond what we expected, highly recommend it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Helfrich",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T16:28:54.000Z",
          "Titre": "Fast",
          "Contenu": "Fast, on time and painless."
        },
        {
          "Note": 5,
          "Lieu": "CN",
          "Pseudo": "Winchester",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T03:57:42.000Z",
          "Titre": "Nice experience",
          "Contenu": "Nice experience, and Greg is very kind, he do me a big favor"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Travis",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T16:50:48.000Z",
          "Titre": "Greg is a consummate professional and…",
          "Contenu": "Greg is a consummate professional and master of his craft. He shows a genuine personal committment to his clients and is meticulous in his attention to detail. Recommended without reservation!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T22:41:15.000Z",
          "Titre": "Greg was very straightforward and…",
          "Contenu": "Greg was very straightforward and informative. He answered all my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bobby Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T23:33:01.000Z",
          "Titre": "very understanding and professional",
          "Contenu": "he explained everything he was doing that was done to the most outstanding professional way of doing business I will gladly work with him again price is very reasonable for the service that he is doing fast and accurate"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T20:51:30.000Z",
          "Titre": "Greg Lirette was pleasant",
          "Contenu": "Greg Lirette was pleasant, timely, and kind ....Very professional!"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Ирина Жарко",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T21:33:30.000Z",
          "Titre": "professional in his field",
          "Contenu": "professional in his field, everything is clear and fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth Hill",
          "Nb_Reviews": 2,
          "Date": "2023-07-04T07:06:41.000Z",
          "Titre": "you did Amazing tonight and being so…",
          "Contenu": "you did Amazing tonight and being so patient with the whole thing.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justo",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T22:49:12.000Z",
          "Titre": "Patience",
          "Contenu": "admired the patience to guide me through the process"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "prosper justus",
          "Nb_Reviews": 2,
          "Date": "2023-08-10T17:35:34.000Z",
          "Titre": "Nice and fast delivery.",
          "Contenu": "He was kind and patient. Delivery was fast. I highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T18:18:16.000Z",
          "Titre": "Super quick and easy working with Greg",
          "Contenu": "Super quick and easy working with Greg. Great communication. Highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juanita Gonzalez",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T23:30:53.000Z",
          "Titre": "Smooth & easy!",
          "Contenu": "Smooth, easy and efficient notarization.  Thank you, Greg!"
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Ishai Avrahami",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T23:25:19.000Z",
          "Titre": "Notary Geek came to our rescue when we…",
          "Contenu": "Notary Geek came to our rescue when we were facing a daunting challenge of updating our financial documents. Finding a notary in our area proved to be an arduous task, and we were getting frustrated with the entire process. Thankfully, Notary Geek provided a seamless solution to our problem, exceeding our expectations.One of the standout features of Notary Geek was their ability to utilize pictures of our documents and complete the entire process online. This convenience saved us valuable time and effort, allowing us to focus on other pressing matters. The user-friendly online platform made it a breeze to upload and share the necessary files, ensuring a hassle-free experience.Throughout the process, we had the pleasure of working with Greg, a highly professional and meticulous notary. He went above and beyond to ensure that every detail was taken care of, leaving no room for errors. Greg's attention to detail was commendable, as he meticulously dotted all the i's and crossed all the t's. His dedication and expertise gave us peace of mind, knowing that our documents were in capable hands.One aspect that truly impressed us was Greg's commitment to customer satisfaction. He not only delivered exceptional service but also offered to redo the process if, for any reason, our documents were rejected. This level of dedication and accountability is rare to find in today's fast-paced world, and it speaks volumes about Notary Geek's commitment to their clients.We highly recommend Notary Geek for all your notary needs. Their innovative approach, combined with their exceptional customer service, sets them apart from the competition. Whether you're facing challenges finding a notary or simply seeking a convenient and efficient solution, Notary Geek is the go-to company. With their expertise, you can be confident that your documents will be handled with utmost care and professionalism.Kudos to Notary Geek and their team, especially Greg, for providing an outstanding service. They have certainly earned our trust, and we will continue to rely on them for any future notary needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terrance Jones",
          "Nb_Reviews": 2,
          "Date": "2023-10-09T23:37:37.000Z",
          "Titre": "Greg made everything easy and…",
          "Contenu": "Greg made everything easy and understandable"
        },
        {
          "Note": 5,
          "Lieu": "CR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T03:14:33.000Z",
          "Titre": "The notary was great",
          "Contenu": "The notary was great!  Gregg Lirette was quick, knowledgeable and very nice."
        },
        {
          "Note": 5,
          "Lieu": "CL",
          "Pseudo": "Oscar",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T19:34:35.000Z",
          "Titre": "All went fine in general",
          "Contenu": "All went fine in general, so I'm happy with the service"
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T06:18:57.000Z",
          "Titre": "I am writing this to express my utmost…",
          "Contenu": "I am writing this to express my utmost satisfaction and appreciation for the exceptional service provided by Greg who assisted me in notarizing Form 1583. The professionalism and efficiency demonstrated by the notary public throughout the entire process were truly commendable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn McElhiney",
          "Nb_Reviews": 2,
          "Date": "2023-08-31T22:05:46.000Z",
          "Titre": "I recently had the privilege of…",
          "Contenu": "I recently had the privilege of utilizing the services of Greg for an online notarization. From start to finish, my experience was characterized by professionalism, efficiency, and a strong commitment to ensuring the accuracy and legality of the documents involved. Greg exhibited a profound understanding of the legal intricacies surrounding notarization, which was evident in his attention to detail throughout the process. What truly stood was his responsiveness and flexibility. He was able to accommodate my busy schedule and arrange a convenient time for the notarization. Despite my numerous questions, Greg patiently addressed each one, demonstrating a strong commitment to client education and transparency. He exhibited exceptional interpersonal skills, was always courteous and respectful, fostering a comfortable environment that made the entire experience pleasant and stress-free. This level of customer-centric service sets Notary Geek apart as a standout notary professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbercharlie",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T01:39:00.000Z",
          "Titre": "Greg was very knowledgeable notary…",
          "Contenu": "Greg was very knowledgeable notary professional. Easy and polite to talk to. A true professional!"
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "KOJI",
          "Nb_Reviews": 3,
          "Date": "2023-11-13T08:36:10.000Z",
          "Titre": "I always appreciate his perfect…",
          "Contenu": "I always appreciate his perfect preparation and service. Thank you as always!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth Hill",
          "Nb_Reviews": 2,
          "Date": "2023-07-07T06:40:35.000Z",
          "Titre": "I don't know what else to tell you to…",
          "Contenu": "I don't know what else to tell you to do your job any better,  you are good at what you do."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "KOJI",
          "Nb_Reviews": 3,
          "Date": "2023-08-30T17:29:21.000Z",
          "Titre": "Everything good",
          "Contenu": "Everything about Greg, including his sincere and polite response, was wonderful."
        },
        {
          "Note": 5,
          "Lieu": "AM",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T15:29:25.000Z",
          "Titre": "Lightening fast and responsive notary!!",
          "Contenu": "That was a great experience and lightening fast!!!"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Xavier De La Cruz",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T20:46:26.000Z",
          "Titre": "Greg Lirette was incredibly…",
          "Contenu": "Greg Lirette was incredibly professional and turned around the notarization of my documentation within a few hours. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kevin B",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T18:59:18.000Z",
          "Titre": "Great help",
          "Contenu": "Quick, easy and helped every step of the way. Would highly recommend worth every penny."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenda Hines",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T17:00:05.000Z",
          "Titre": "Very helpful and customer friendly",
          "Contenu": "Very helpful and customer friendly. Loved the services"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Milhan",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T23:41:54.000Z",
          "Titre": "Fast and very efficient",
          "Contenu": "Fast and very efficient, an amazing service"
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "Mahmoud Khadrawy",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T14:33:16.000Z",
          "Titre": "Exceptional Online Notary Public Service by Gregory Lirette",
          "Contenu": "I had the pleasure of availing the online notary public services provided by Gregory Lirette, and I am truly impressed by the outstanding service he delivered. Gregory's professionalism, honesty, and attention to detail set him apart from other service providers in his field.What stood out most about Gregory was his willingness to go above and beyond to assist me. He patiently addressed all my questions and concerns, providing clear and comprehensive explanations. His guidance was invaluable in navigating the notary process, making it seamless and hassle-free.Responsibility is a key characteristic of a trustworthy service provider, and Gregory exemplified this trait impeccably. He meticulously reviewed all the documents, ensuring their accuracy and compliance with legal standards. His commitment to maintaining the highest level of professionalism was evident in every step of the notarization process.One aspect that truly impressed me was Gregory's responsiveness. He promptly answered all my messages and queries, demonstrating his dedication to exceptional customer service. It was refreshing to work with someone who prioritizes communication and promptly addresses any concerns that may arise.In conclusion, I wholeheartedly recommend Gregory Lirette for online notary public services. His honesty, consideration, accuracy, helpfulness, responsibility, and responsiveness are qualities that make him stand out as an exceptional service provider. If you are in need of online notary services, Gregory is the person to trust for a seamless, efficient, and reliable experience. I will certainly be returning to him for any future notary needs.Thank you, Gregory, for your outstanding service!Rating: ⭐️⭐️⭐️⭐️⭐️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linus",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T03:44:07.000Z",
          "Titre": "A very pleasant experience",
          "Contenu": "A very pleasant experience, professional notary, inexpensive selling price, a great choice for notarizing your documents, conveniently done by just sitting at home!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ivan Rey",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T00:24:08.000Z",
          "Titre": "Great service!",
          "Contenu": "Accurate, professional, and friendly service. Will us notary geek again."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Rudolph",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T19:44:54.000Z",
          "Titre": "We had a great experience with Notary…",
          "Contenu": "We had a great experience with Notary Geek, very professional, flexible."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T16:46:31.000Z",
          "Titre": "Quick and detailed",
          "Contenu": "Quick and detailed.  I would highly recommend Greg"
        },
        {
          "Note": 5,
          "Lieu": "SX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T17:01:04.000Z",
          "Titre": "Súper helpful and quick",
          "Contenu": "Súper helpful and quick! Couldn’t ask for better! Thanks a million!"
        },
        {
          "Note": 5,
          "Lieu": "LI",
          "Pseudo": "Michal",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T23:41:23.000Z",
          "Titre": "Very helpful",
          "Contenu": "Very helpful, quick and easy process."
        }
      ]
    }
  ]
}