{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "ntelectronic.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Young",
          "Nb_Reviews": 3,
          "Date": "2023-09-16T19:04:29.000Z",
          "Titre": "I purchased a NETGEAR Orbi mesh…",
          "Contenu": "I purchased a NETGEAR Orbi mesh wireless router for my home in 2020.  I paid >$300.  It worked great until I recently moved to a new home.  I was unable to set it up at the new address.  I called tech support and they told me I needed to purchase a new software license for it for $300.  If they had been honest with me during the initial purchase I would not be feel so cheated.  Hiding the software license information in the 10 pages of fine print of the “Terms and conditions “ is not a honest way of doing business.  I will never again trust this manufacturer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Александр Савинков",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T21:58:12.000Z",
          "Titre": "Scam store!!!",
          "Contenu": "I have bought a new PC. You don't indicated it was in used!!! I've expected get new PC, but  now, after I unwrapped it from bubble wrap (not original box unfortunately because it's absent) I've noticed dust on the video card and cooler as well. You even didn't think to clean it before send!!! Nobody told me about it was in used!!! I strongly advise all potential buyers to avoid this store and never order anything as you will be cheated!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Glenn David White",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T19:46:08.000Z",
          "Titre": "Unable to contact by Telephone or…",
          "Contenu": "Unable to contact by Telephone or Email! No customer service. Looking to return Asus Laptop, but cannot contact N T Electronics. If I hear from them I will be more than happy to change my review!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adrian Herrera",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T21:40:13.000Z",
          "Titre": "They canceled my order without giving…",
          "Contenu": "They canceled my order without giving reason saying my payment was declined even tho I had already payed up front but I was lucky to get a refund"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Schnepp",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T21:42:12.000Z",
          "Titre": "I'm hoping to be able to change this…",
          "Contenu": "This is an update to my original review. Downgrading 2 to 1. Was just informed that they are out of the product I ordered. Their site showed 2 in stock at the time. Then 1 in stock after my purchase. A shipping label with FedEx was created 2 days later. System seems to update in real-time. Also, why notify FedEx if you didn't have it. Only positive is they said they are issuing a full refund. I'd avoid this place.I'm hoping to be able to change this rating. Expected date on my package was Feb 2. It's Feb 2 and FedEx still doesn't have my package. I sent an email on Feb 1 asking about my item. I have not heard back yet. If customer service changes, I will possibly change my review."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank Carrano",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T19:20:02.000Z",
          "Titre": "Never again",
          "Contenu": "Ordered an iPad Pro as a gift, and the order was cancelled without a reason being given and without even an email informing me. I even bothered to write them after the fact to inquire, and didn't get the courtesy of a reply."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Portia",
          "Nb_Reviews": 2,
          "Date": "2020-04-08T23:46:19.000Z",
          "Titre": "My item was delivered to my front door",
          "Contenu": "My item was delivered to my front door. When I went to my front door my item wasn’t there I contact the usps they were aware I had a package I was waiting on nobody tried to knock or ring my door bell. I’m reaching out because I was told they’re writing the delivery guy up for this issue but it’s nothing they can do other then that. So I need help a new iPad or my money this isn’t fair this is my first time using you guy"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Issac Barela",
          "Nb_Reviews": 1,
          "Date": "2021-08-28T08:17:28.000Z",
          "Titre": "We only received one camara instead of…",
          "Contenu": "We only received one camara instead of the two we initially ordered.  We picked the 2 camara and DVR  set up. I am looking for the customer service phone number to go ahead and call so we can go ahead and get our other time are sent to us cuz we really mean it please call me back as soon as you can 5056923312"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Luan Nguyen",
          "Nb_Reviews": 1,
          "Date": "2020-10-16T18:04:11.000Z",
          "Titre": "Bought computer monitor listed as New but received a Used one",
          "Contenu": "Bought computer monitor listed as New. Received a used one you can tell from the repackaged box. No plastic wrap on the screen. No screws to attach the stand. Chat agent offer to find screws and $20 reimbursement. Not worth it for a monitor of this condition, so my offer to increase it to $50, but they decided to process a return instead. It's a waste of time as now I have to pack and drop it to UPS. Don't try to save a few bucks to shop here is what I recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wellington S.",
          "Nb_Reviews": 1,
          "Date": "2020-05-02T18:13:56.000Z",
          "Titre": "False Advertising",
          "Contenu": "Delivery was fast which was a plus but having paid for a new one I received a used record player which was extremely disappointing. I would not do business with this company again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deborah",
          "Nb_Reviews": 3,
          "Date": "2023-03-09T22:32:34.000Z",
          "Titre": "This is my first purchase with them",
          "Contenu": "This is my first purchase with them. They sent me the wrong product. They are working with me to right the problem but I was very disappointed because I was excited to receive my product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John S",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T00:55:40.000Z",
          "Titre": "As I mentioned in my previous review",
          "Contenu": "It is now February 21 and still no refund. My banks fraud department is handling it. They have declared it fraud. NT Electronics sent me another fake email. With a fake paypal screenshot showing a \"refund\". They said to give it 1-3 days. Surprise surprise 8 days later there is nothing there. Paypal said that screenshot is completely bogus. Do NOT buy from this place. Do NOT trust the \"favorable\" reviews. That was my first mistake. Another update. This seller keeps blaming PayPal for the problem of my refund. I did NOT use PayPal. PayPal told me there is NO record of this transaction. Also, that they only refund money used to purchase through PayPal. I was instructed to contact my card holder and report NT ELECTRONICS as fraud. My bank was already aware of my problem. I just informed them of my conversation with PayPal. They have now escalated this to a fraud investigation. I really have to question the positive reviews about this company. Hopefully I am just a single incident. NT Electronics has gone silent now and won't respond to my emails. They never answer the phone. Very suspicious company. As I mentioned in my previous review. I was told I would be given a full refund. Since they didn't have the item. That was Tuesday January 31. Ten days later I have yet to get my refund. I've had to contact my bank and open a claim. Beware they know how to take your money. But don't know how to refund it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nathan Foulds",
          "Nb_Reviews": 3,
          "Date": "2021-03-12T01:40:50.000Z",
          "Titre": "Order cancelled.",
          "Contenu": "I was informed a couple days after placing my order that they did not have enough stock to fill my order and have issued a full refund. Disappointed to say the least."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Will D",
          "Nb_Reviews": 2,
          "Date": "2021-09-12T11:40:01.000Z",
          "Titre": "Did not say that there was no settings…",
          "Contenu": "Did not say that there was no settings menu on this model. Apparently every model after this ms pac man has a settings menu to speed it up. Should have just gone to Walmart."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ernest Cleto",
          "Nb_Reviews": 1,
          "Date": "2022-01-23T19:56:15.000Z",
          "Titre": "Why the hell would I want a phone…",
          "Contenu": "Why the hell would I want a phone without a phone that I can't activate.If I could give it a zeroe star I would.All this product cause me was a headache and cuse embarrassment!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wren Jackson",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T16:25:30.000Z",
          "Titre": "Man they always refund because they…",
          "Contenu": "Man they always refund because they feel like it with no reason it’s extremely unprofessional and they don’t respond to emails"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "brian",
          "Nb_Reviews": 1,
          "Date": "2020-11-27T16:48:26.000Z",
          "Titre": "Bought an open box tablet",
          "Contenu": "Bought an open box tablet, which i shouldnt of. Missing the most important part no 128gb sd card and no quick start guide."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Wayne",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T00:41:45.000Z",
          "Titre": "Returned a product several days ago and…",
          "Contenu": "Returned a product several days ago and still the money is missing from my card."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer Ricard",
          "Nb_Reviews": 2,
          "Date": "2022-12-10T16:59:15.000Z",
          "Titre": "Order was canceled no reason no fing…",
          "Contenu": "Order was canceled no reason no fing nothing!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-05-14T07:33:55.000Z",
          "Titre": "not quite the experience I had hoped for"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tommy Krisa",
          "Nb_Reviews": 2,
          "Date": "2022-12-12T20:00:11.000Z",
          "Titre": "Delivered to 45-41 215st instead of…",
          "Contenu": "Delivered to 45-41 215st instead of 215th place"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barbara",
          "Nb_Reviews": 6,
          "Date": "2022-10-31T14:38:44.000Z",
          "Titre": "Quality and condition questionable",
          "Contenu": "Quality and condition questionable!  Beware!  Would not issue sizable refund when warranted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacque Shay",
          "Nb_Reviews": 2,
          "Date": "2020-01-29T23:22:04.000Z",
          "Titre": "I ordered an item that contained glass",
          "Contenu": "I ordered an item that contained glass.  It was shipped without protection.  They just slapped a label on the item with no outside shipping box.  The item arrived broken.  Phone number for \"contact us\" is no longer in service.  Another phone number goes to an answering machine.  I have emailed them with no response.  Very disappointed.  How do I get my money back?!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chelsea Jackson",
          "Nb_Reviews": 1,
          "Date": "2019-01-10T04:28:34.000Z",
          "Titre": "RIPOFF",
          "Contenu": "Speaker arrived and did not work. It was clearly used, it was dirty and It would not hold a charge and there was a lot of static. Speaker was sent back and I received an email stating it would be refunded but never received a refund of almost $90. I had to pay $15 out of my own pocket to send it back. They do not answer the phone. Email was sent asking the status of the refund and I did not receive a response. Save yourself the money and buy from a reputable company. Will report to the BBB."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim C",
          "Nb_Reviews": 1,
          "Date": "2016-10-04T22:45:30.000Z",
          "Titre": "Battery operated weed trimmer arrived with defective battery.",
          "Contenu": "I ordered a weed trimmer from NT that was highly rated on consumer reports. Right away I noticed that the packaging had been opened previously. The battery pack ended up being defective so I called the milanufacturer. The manufacturer is sending me a new battery as a courtesy as the weed trimmer is out of warranty (NT is not an authorized dealer of Ryobi products)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dan Coronado",
          "Nb_Reviews": 2,
          "Date": "2020-02-14T19:15:42.000Z",
          "Titre": "Thought I was buying new unused…",
          "Contenu": "Thought I was buying new unused product, instead received an open torn box with someone's instructions for Christmas lights in the headphones case. Headphones worked fine so decided to keep them. Didn't trust them to make a non hassle exchange. I won't buy from them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jarred Boraly",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T16:17:56.000Z",
          "Titre": "They always cancel orders for no…",
          "Contenu": "They always cancel orders for no apparent reason"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Connie Hertner",
          "Nb_Reviews": 1,
          "Date": "2019-06-19T17:14:05.000Z",
          "Titre": "Ordered wireless headphone system for…",
          "Contenu": "Ordered wireless headphone system for TV.  Was shipped charging station but there were NO headphones.  All phone calls go to voicemail.  Will not return calls or answer email.  Would never recommend to anyone and would never buy from again.  BUYER BEWARE"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 1,
          "Date": "2019-08-26T17:35:51.000Z",
          "Titre": "I ordered a light fixture that was…",
          "Contenu": "I ordered a light fixture that was listed as a Brand New and it came completely mangled and effective. I have emailed and asked for a refund and have not heard anything back. Extremely frustrated."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Varsha Gottipati",
          "Nb_Reviews": 1,
          "Date": "2018-07-19T02:18:21.000Z",
          "Titre": "It's been more than a month and this…",
          "Contenu": "It's been more than a month and this laptop is just a headache. Which laptop takes 15 minto show something on the screen after we switch it on?. Worst experience with any kind of laptop ever"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donald McGary",
          "Nb_Reviews": 1,
          "Date": "2018-04-11T18:19:20.000Z",
          "Titre": "I received a damaged product",
          "Contenu": "I received a damaged product. I have no outlet to reach  out to these folks besides a phone number that is never answered. Just received a box fan with parts missing and damaged parts."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kris Chon",
          "Nb_Reviews": 1,
          "Date": "2020-02-21T05:33:12.000Z",
          "Titre": "Purchased a NEW ceiling fan and you…",
          "Contenu": "Purchased a NEW ceiling fan and you guys sent me a used one. The fan looked new but all the tips of the wires had once been installed. Would not deal with this company again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "heeyoung choi",
          "Nb_Reviews": 1,
          "Date": "2017-12-08T02:41:04.000Z",
          "Titre": "Is it new product?",
          "Contenu": "Is it new product?I know your price is low, but I thought it is new. But, there is no Box and no earphone. There is only cell phone and charger.I'm considering refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Avrum Golenberg",
          "Nb_Reviews": 2,
          "Date": "2022-03-25T17:50:32.000Z",
          "Titre": "They simply disappeared"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dustin D",
          "Nb_Reviews": 1,
          "Date": "2019-03-12T07:41:38.000Z",
          "Titre": "Violated use of (DMM 173.3.2.)",
          "Contenu": "Violated use of (DMM 173.3.2.)Have had 0 contact / package came empty and late on top of all this. . . I don't play with money this is unacceptable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Tisdale-Fletcher",
          "Nb_Reviews": 1,
          "Date": "2016-12-27T17:26:28.000Z",
          "Titre": "Could have done better with shipping",
          "Contenu": "I received my item (which was a gift) mailed to me in the retail box with just a shipping label slapped on it. Very unhappy with how it got to me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rebecca Navarro",
          "Nb_Reviews": 1,
          "Date": "2017-01-18T17:20:10.000Z",
          "Titre": "Horrible",
          "Contenu": "Horrible. Earphones worked for 3 days then stopped working. Chord was sticky. There were bite marks all over the volume up and down buttons."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe Medina",
          "Nb_Reviews": 1,
          "Date": "2018-11-06T16:24:22.000Z",
          "Titre": "Used?",
          "Contenu": "Item came in a destroyed box with cords strewn about and appeared to be in used condition"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christian Foster",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T02:55:15.000Z",
          "Titre": "Defective…….."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nathan K",
          "Nb_Reviews": 1,
          "Date": "2022-05-28T05:49:41.000Z",
          "Titre": "Opened Box - At Your Own Risk",
          "Contenu": "NT Electronics the site is fine - perfectly good transaction and good shipping time. I also know buying an 'opened box' item is taking a risk, but with little to no information available on the site it's difficult to know whether you're getting a display item, a used item, or something in between. The controller I received is essentially unusable and was likely a broken item that was returned, never refurbished and simply resold. Feel free to take the risk like I did, but just know that even at a decent discount you may come out losing money."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nathan G",
          "Nb_Reviews": 2,
          "Date": "2021-09-06T01:02:56.000Z",
          "Titre": "Misleading Description",
          "Contenu": "I saw that the product was an open box in the description, but nowhere did it say it was a used or refurbished Fire. The only reason you received a 2 was because the shipping was quick. I will not be buying from you again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Unhappy Customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-04T18:51:44.000Z",
          "Titre": "Website Says New - Received Refurbished",
          "Contenu": "Fast shipping.  Dishonest marketing.  Website says Lenovo ThinkPad Duet is \"New Opened Box\".  What I received was a Refurbished product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MWC",
          "Nb_Reviews": 1,
          "Date": "2020-02-06T22:11:14.000Z",
          "Titre": "Oddly Damaged",
          "Contenu": "The laptop either had damage to begin with, or was damaged in transit.  Disappointing as it would have been a great deal. It was packed in a pretty good box with a padding bubble, which makes me think it was prior damage.   It has a crack in the face above the keyboard, and a small chunk of plastic cane out because of it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Doug Feld",
          "Nb_Reviews": 3,
          "Date": "2020-03-13T00:26:58.000Z",
          "Titre": "Defective unit delivered.",
          "Contenu": "Defective unit delivered.The box was was soiled on 4 sides (looked like oil staining). The outdoor light was previously un-boxed, removed, repacked incorrectly and then resealed. The light globe assembly was incorrectly manufactured. Unacceptable as a new assembly. looked more like a salvaged unit.Doug F."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kyle D",
          "Nb_Reviews": 1,
          "Date": "2019-06-06T18:08:41.000Z",
          "Titre": "Works but make noises...they knew never said nothing in description",
          "Contenu": "PS4 works but makes hd clicking noise....i emailed them and they said they knew about hd problem ....ps4 description didnt say nothing bout ps4 being broken I'd go somewhere else if it says good condition from this store...luckily I bought threw paypal so i got insurance"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryan Hartsell",
          "Nb_Reviews": 1,
          "Date": "2019-11-14T15:50:56.000Z",
          "Titre": "Stealing manufacturer cables",
          "Contenu": "I orderedDell S2716DGR 27\" LED G-Sync Gaming LED-Lit Monitor NOBMonitors appear to work fine.  The price was great.  I purchased \"new open box\".  What I got was open box, but with missing original documentation and cables.  The reason I am removing stars is because it is obvious someone is tampering with cables.  The monito was supposed to have on DP vable and one power cable.  What I got was 5 DP cables and 1 HDMI; all different brands and styles.  The power cables were the same, all different brands and styles of cable.  Someone is playing mix and match with the products.  Not appreciated.I ordered my own cables because I do not trust the quality of what was thrown into my boxes."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Clinic Nurse Laura",
          "Nb_Reviews": 2,
          "Date": "2019-12-26T22:33:01.000Z",
          "Titre": "REceived this in an open/broken box…",
          "Contenu": "REceived this in an open/broken box with the wrong invoice/receipt. All parts appear to be present. I will need to return due to buying the wrong voltage for his battery. Wish me luck."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Could have been better",
          "Nb_Reviews": 2,
          "Date": "2023-04-27T16:05:48.000Z",
          "Titre": "I liked the price and the speed at…",
          "Contenu": "I liked the price and the speed at which they shipped my air fryer.  Unfortunately, they shipped in the original somewhat fragile box, and it was destroyed.  There is also clear evidence that the box had been previously opened and the air fryer fondled but it doesn't look like it had been used which is the only reason I'm keeping it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KEILA Cordero",
          "Nb_Reviews": 1,
          "Date": "2021-08-16T19:35:07.000Z",
          "Titre": "I expected to receive a brand new item",
          "Contenu": "I did not realized this was an opened item.    So I was very upset when I got it with broken seal.  I sent an email and within minutes someone responded and clarified it was an opened item.  Suggestion: for online items, place the status of the item adjacent to its name.  That would had avoided confusion for me. Also, the original box should have a label saying it has been opened.  Make sure whoever service the item, places the manual in the box."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2021-07-19T21:55:32.000Z",
          "Titre": "Drop ALT High Profile",
          "Contenu": "Didn’t give me an option for the color of the keyboard or an option for the type of switches. (Pictured the black keyboard, but came in grey) Still came in great condition and functions great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda Steele",
          "Nb_Reviews": 3,
          "Date": "2023-01-13T02:17:34.000Z",
          "Titre": "It finally came in the mail today.",
          "Contenu": "It finally came in the mail today. Ordered it in October for a Christmas gift. I guess late is better than never."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alfred  A",
          "Nb_Reviews": 1,
          "Date": "2020-09-24T17:55:48.000Z",
          "Titre": "Shipment was processed faster and I…",
          "Contenu": "Shipment was processed faster and I received package on time"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Katherine Sweet",
          "Nb_Reviews": 1,
          "Date": "2020-04-27T18:23:06.000Z",
          "Titre": "Shipping was fast .but I opened it the…",
          "Contenu": "Shipping was fast .but I opened it the front cover is al scattered up and the key board as well 😏"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark P",
          "Nb_Reviews": 3,
          "Date": "2016-10-04T22:02:55.000Z",
          "Titre": "Refurbished Netgear router",
          "Contenu": "I recently purchased a refurbished netgear router.  The ad stated that since it was refurbished that tech support would be through email only.  I was OK with that.  I had problems installing the router and contacted netgear for tech support and they refused saying they offer no support on refurbished products.  I was eventually able to resolve the issue but would not have been happy if I couldn't have."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Moore",
          "Nb_Reviews": 2,
          "Date": "2019-02-26T19:03:31.000Z",
          "Titre": "Sennheiser Headphone Order",
          "Contenu": "It was a little tricky ordering from NT at first but they were very responsive and got right back to me. In the end I received my order and was very pleased although the product (Sennheiser Noise Cancelling Headphones) were shipped with no instructions. Luckily, I was able to find instructions online and downloaded."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "D. Ogle",
          "Nb_Reviews": 3,
          "Date": "2018-05-23T03:58:32.000Z",
          "Titre": "Ordered a bath sink faucet that was…",
          "Contenu": "Ordered a bath sink faucet that was posted as \"New\". Received the shipment in a timely manner. Faucet was missing a part for the drain. Couldn't install it. Had to to go to HD and purchase a replacement part.  Not happy about it.  Suggest NTE do a better job checking their products before selling."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Buyer",
          "Nb_Reviews": 1,
          "Date": "2019-05-02T00:36:30.000Z",
          "Titre": "The item listed as new but when I…",
          "Contenu": "The item listed as new but when I received it, the product is not as stated. A package missed component. The seller provide some discount after being contacted to inform about the issue. I wish they described item accurately when listed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Metcalf",
          "Nb_Reviews": 1,
          "Date": "2020-03-01T21:37:05.000Z",
          "Titre": "Satisfied with headphones",
          "Contenu": "Satisfied with headphones, but accessories were not complete.  Airplane adapter and compact carrying bag missing"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Beverly Brunstedt",
          "Nb_Reviews": 1,
          "Date": "2020-01-26T21:38:30.000Z",
          "Titre": "The light had a slightly bent medal…",
          "Contenu": "The light had a slightly bent medal piece, which the installer told me after he put the light up."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lindsor",
          "Nb_Reviews": 1,
          "Date": "2019-04-07T15:54:13.000Z",
          "Titre": "Product looks used!",
          "Contenu": "Product looks used!! Case that beats came in is all dinged up!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dipankumar  Patel",
          "Nb_Reviews": 1,
          "Date": "2020-03-12T22:32:44.000Z",
          "Titre": "Item was out of stock after we placed…",
          "Contenu": "Item was out of stock after we placed order"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A E",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T21:12:22.000Z",
          "Titre": "Nice costumer service and came quickly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Abel Koeltzow",
          "Nb_Reviews": 1,
          "Date": "2022-09-26T17:09:43.000Z",
          "Titre": "Value Buy",
          "Contenu": "Just as described (new open box). Shipping was fast once it shipped. NT had to call and confirm my order.  Shipping was delayed because I didn’t answer those calls from an unknown number. Only drawback for me was no mention on product page or site about product warranty. Return policy is clear. Mine came with 3 months left on manufacturer 1 year parts and labor warranty. Bonus I guess."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Jhon cary",
          "Nb_Reviews": 1,
          "Date": "2022-05-02T11:53:09.000Z",
          "Titre": "Hy every one its jhon nice business and…",
          "Contenu": "Hy every one its jhon nice business and also very quik and most important too safe delivery.Thanks once again and also make me sure for further schemes and packages like gift or bonus on order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rochester guy",
          "Nb_Reviews": 1,
          "Date": "2022-04-29T01:10:15.942Z",
          "Titre": "They offered my laptop as new and open…",
          "Contenu": "They offered my laptop as new and open box at different prices. I paid more for the new one but received open box and slightly used (was already registered with Lenovo one month earlier). They offered to refund me the difference and I'm keeping it since it seems fine and I don't want to go through the return process. But I would have preferred the new one as ordered. They were responsive so that's good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Clint Cooksey",
          "Nb_Reviews": 1,
          "Date": "2021-10-26T01:30:59.000Z",
          "Titre": "Kindle Fire HD 8 (10th gen)",
          "Contenu": "Tablet works great! Delivery was quicker than expected. Unfortunately the tablet will not recognize an 128 GB SD card, even though it’s the same one I used in my other daughter’s exact same tablet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard  Griffin",
          "Nb_Reviews": 1,
          "Date": "2021-03-10T23:14:24.000Z",
          "Titre": "Product is defective",
          "Contenu": "Product was defective.  Took over one week but a full refund was issued. Can not give 5 stars because of the delay, however the full refund was appreciated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2020-04-27T20:09:05.000Z",
          "Titre": "Beautiful lamp",
          "Contenu": "Beautiful lamp! I gave 4 stars only because the cord was a bit frayed and unsightly. Other than that, it’s beautiful and arrived quickly!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Fertitta",
          "Nb_Reviews": 1,
          "Date": "2020-11-28T18:03:50.000Z",
          "Titre": "The service was excellent",
          "Contenu": "The service was excellent. The product was shipped the day I ordered it and I received it a few days later.after researching a bit I found it at a better price but not that much to make a difference. Thanks for the great service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mykron",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T09:46:45.000Z",
          "Titre": "Item was open box",
          "Contenu": "Item was open box. The product page did not mention this anywhere that I seen. It appears to be unused and works great but it was clearly an open box item and this should have been mentioned."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karyn Hood",
          "Nb_Reviews": 2,
          "Date": "2020-04-17T01:52:28.000Z",
          "Titre": "Our experience was good",
          "Contenu": "Our experience was good.  We ordered a computer hard drive with keyboard and mouse.  It shipped on a Monday and was here by Thursday.  It was in good shape and it worked for what we neeuded it for."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2021-09-22T07:54:31.000Z",
          "Titre": "Best services",
          "Contenu": "Best services, received as explained . I was so happy because the shipping was so fast"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mmk Mmk",
          "Nb_Reviews": 1,
          "Date": "2022-05-06T03:41:21.000Z",
          "Titre": "Good experience",
          "Contenu": "In my experience its was a good deal easy shopping in time delivery"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sergey Svinolobov",
          "Nb_Reviews": 1,
          "Date": "2021-04-26T05:02:26.000Z",
          "Titre": "Open box was \"too open\" (you should…",
          "Contenu": "Open box was \"too open\" (you should spent more time to make it looks like a new one)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "chris daniels",
          "Nb_Reviews": 1,
          "Date": "2020-04-21T15:32:26.000Z",
          "Titre": "the reason for this rateing the shiping…",
          "Contenu": "the reason for this rateing the shiping took 6days not 3 to 5 days as told the laptop is nice it was very slow as the hdd in it is not what it was told by manufacter specs it came with commin hdd when it was to have an sshd in it the battery needs to be replaced as it was sitting dead for a wile befor i got it but other thin that i love it and would buy another on from theys guys they were very very fast about getting it out to me it came well packsged looks and works like new i would recomend this place to anyone looking for a good deal on a laptop"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Farmer",
          "Nb_Reviews": 4,
          "Date": "2019-06-05T21:35:59.000Z",
          "Titre": "The price was great and the headphones…",
          "Contenu": "The price was great and the headphones I ordered arrived in good condition and in a timely manner.  Four stars instead of five because the box has obviously been opened - the manufacturer's seal was broken.  The item had not been listed as an open box purchase but because of the price and the box having been opened being the only issue I am pleased with the purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jacque Shay",
          "Nb_Reviews": 2,
          "Date": "2020-02-06T18:03:08.000Z",
          "Titre": "This is an update to a previous review",
          "Contenu": "This is an update to a previous review.  I received an item that had cracked glass in it and was unable to reach anyone to rectify the situation which led to my low review.  Fortunately, the company has since reached out to me and apologized for the difficulty and rectified the situation in a timely fashion.  Their kindness and willingness to make it right went a long way towards changing my feelings about this company.  Therefore, I would like to change my one star rating to a 4 star rating."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony C",
          "Nb_Reviews": 1,
          "Date": "2019-08-11T23:52:45.000Z",
          "Titre": "The headphones are great and the…",
          "Contenu": "The headphones are great and the delivery was speedy. Only problem is that the padding on the headphones are already coming up on one of the cups. I don't know if NT is to blame about this? I mean, I guess I'll eventually have to replace them but it's just disappointing that is looking like that on just the second day."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marina",
          "Nb_Reviews": 7,
          "Date": "2018-05-30T06:14:50.000Z",
          "Titre": "The company had good prices compared to…",
          "Contenu": "The company had good prices compared to other sellers and once I was installing the product I found a piece that was broken. I contacted the company and without delay hassle interrogation or any other unpleasant Q&A or attitude they simply replaced the part that was broken. Customer service was clean and simple and pleasant no hassles no bother and I would definitely purchase from them in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ace Russell",
          "Nb_Reviews": 1,
          "Date": "2018-11-24T18:51:38.000Z",
          "Titre": "I love the speaker at first",
          "Contenu": "I love the speaker at first. Worked great when I first got it. Now I've had it for 2 months and it's doesn't work at all with out being plugged up. Getting a lot of static and feed back when I try to use it. I've been calling the company trying to get someone on the phone leaving messages and no response. I would like the speaker replaced but no one will call me back. Smh I'm highly upset and tickes off to the maximum. Waiting on my speaker they said they'll replace in the mail."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "C. C.",
          "Nb_Reviews": 2,
          "Date": "2017-01-27T18:58:01.317Z",
          "Titre": "Good price, product was undamaged but packaging was ratty",
          "Contenu": "I purchased replacements for my Bose Mie2 headset from NT Electronics, which was selling them for about $20 cheaper than elsewhere on the internet. The product arrived quickly, contains all parts, and works fine, but the packaging was torn and beaten up, and the headphones weren't in the clear plastic packaging where the shape indicated that they were supposed to be, so I briefly panicked when I opened the shipping package. Still happy with the purchase, though - the headphones work and appear to be clean, which is what really matters."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valarie Smith",
          "Nb_Reviews": 7,
          "Date": "2016-10-05T10:23:33.000Z",
          "Titre": "So far so good!",
          "Contenu": "Does seem to get hung up occasionally and have to move it. Is noisy, but I can live with that. Seems to pick up good though. I am impressed for the price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew Buckley",
          "Nb_Reviews": 1,
          "Date": "2020-02-13T21:26:52.000Z",
          "Titre": "Quick delivery and quality product",
          "Contenu": "Quick delivery.  Product was in great shape (open box purchase).  Only problem was wrong charging cable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MT",
          "Nb_Reviews": 1,
          "Date": "2019-07-08T15:48:22.000Z",
          "Titre": "The box for the product arrived opened…",
          "Contenu": "The box for the product arrived opened and had a sticker on it from Best Buy.  This gives me pause."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew Khamis",
          "Nb_Reviews": 1,
          "Date": "2019-06-09T08:29:10.000Z",
          "Titre": "Pretty good Xbox one s couple games lag…",
          "Contenu": "Pretty good Xbox one s couple games lag but that’s probably from the age of the console."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Oscar Flores",
          "Nb_Reviews": 1,
          "Date": "2021-09-20T18:15:30.000Z",
          "Titre": "Ship was faster very good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dwight C",
          "Nb_Reviews": 1,
          "Date": "2019-10-18T02:19:40.000Z",
          "Titre": "Easy online ordering",
          "Contenu": "Easy site to order from.  Item was shipped quick."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew Arosemena",
          "Nb_Reviews": 1,
          "Date": "2019-07-03T17:51:33.000Z",
          "Titre": "Microphone is okay but the sound is…",
          "Contenu": "Microphone is okay but the sound is great!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Boyer",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T21:08:08.000Z",
          "Titre": "Great service ad delivery time",
          "Contenu": "Great service ad delivery timeThis is a gift and has not been given yet"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Menesick",
          "Nb_Reviews": 2,
          "Date": "2023-10-13T01:27:13.000Z",
          "Titre": "This monster truck caught our eyes…",
          "Contenu": "This monster truck caught our eyes while shopping at BJ’s. My grandson is going to love this for his birthday. My wife being a consumer advocate searched on line and found this same exact one for $30 cheaper. She ordered it and received it within 4 days and 2 days before his birthday."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PETER SHEN",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:39:24.000Z",
          "Titre": "Competitive price",
          "Contenu": "Competitive price. Easy to place an order.  Delivered on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mr Christian S.",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T17:25:12.000Z",
          "Titre": "Good service, quick shipping",
          "Contenu": "Got a good deal on some nice open back headphones, shipped out same day and delivered on the weekend. Very satisfied with my purchase"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Clark",
          "Nb_Reviews": 1,
          "Date": "2021-02-21T07:31:59.000Z",
          "Titre": "So far amazing!",
          "Contenu": "So far amazing! Condition was as described, the spen is amazing! This is awesome, such a steal of a price. The only bad experience I had was with shipping (which I’m sure they can’t control after they ship out the product, this is on FedEx) my product arrived two days late, factoring the weather it was understandable. Definitely will be doing business again! Thank you. Will update if I see any errors with my purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 2,
          "Date": "2022-07-15T00:09:36.000Z",
          "Titre": "Got some brand new condition beats…",
          "Contenu": "Got some brand new condition beats studio pods for $69, I was hesitant to purchase them because I had never heard of this site and getting such good quality EarPods for so cheap sounded like a scam. But not even 5 days after ordering them the package came in and they are great quality. The only thing that was banged up was the outer box the product comes in because the description did say it had been opened before, but that didn’t bother me because the product had zero damage done to it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JP",
          "Nb_Reviews": 2,
          "Date": "2020-12-11T00:40:19.000Z",
          "Titre": "Decent price for a decent find.",
          "Contenu": "This is an overdue review. I had to wait for awhile to see how the product performs before writing a review. It was a used Lenovo ThinkPad that I purchased not too long ago. The price was decent. Customer service was up to par.  They were nice enough to enlighten me with a few tricks to keep the laptop at optimum performance and safe without having virus protection.  I have no issues with laptop so far, and has passed it on to my son to do his online school during Covid pandemic. Overall the purchase and the experience are well worth it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Milton",
          "Nb_Reviews": 2,
          "Date": "2021-01-07T21:50:15.000Z",
          "Titre": "NT Electronic services is excellent",
          "Contenu": "NT Electronic services is excellent,  Ordered Samsung tablet received just as describe shipping was excellent you can even track your item from there door to your door also very quick. I give them a much deserved 5 star"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debra Woods",
          "Nb_Reviews": 1,
          "Date": "2021-06-21T04:02:43.000Z",
          "Titre": "I received my massage seat cushion…",
          "Contenu": "I received my massage seat cushion within a few days of ordering.  Just in time for Father's Day.  My husband absolutely loves it.  I searched for this item after I visited with my sister and saw the one she had purchased (the exact same cushion but from a different company).  By the time I searched, NT Electronics was offering it for a much better price than that other company.  It is very nice quality, just what I was expecting, and the best full back and neck massage cushion I have found, especially for the price.  My husband is going to enjoy this for a long time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry Hubbard",
          "Nb_Reviews": 13,
          "Date": "2020-08-22T14:15:58.000Z",
          "Titre": "I was skeptical",
          "Contenu": "I was skeptical, owing to the many scam companies out there scamming with cheap chinese knockoffs, but I took a chance and am glad I did.Communication was quick and I got answers. My order arrived in just a few days. Free shipping. arrived in excellent shape, worked great right out of the box.I am not just satisfied, I am very happy. NT Electronics is on my A list!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judy R Overturf",
          "Nb_Reviews": 1,
          "Date": "2022-07-11T16:14:14.000Z",
          "Titre": "For some reason the shipping address…",
          "Contenu": "For some reason the shipping address showed up wrong. Paypal wanted to blame or the cache or cookies in my browser. I triple checked the address. This is a huge purchase. And Amazon liked to change my shipping address at times. So I really check . N&T Electronics emailed me about the address BEFORE shipping. Do we got it corrected before shipping. I do appreciate it. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Quinn",
          "Nb_Reviews": 1,
          "Date": "2020-10-18T17:31:15.000Z",
          "Titre": "Product is just what i expected and more........",
          "Contenu": "Product is just what I expected....arrived 3 days after purchase...best price around....thanks Ben for assistance and guidance....would highly recommend NT Eletronics to family and friends...see you guys on my next order...Andy Q"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gabriel",
          "Nb_Reviews": 3,
          "Date": "2022-06-21T01:41:25.000Z",
          "Titre": "I was a little skeptical before…",
          "Contenu": "I was a little skeptical before ordering but I went on and purchased and open box switch console. It was exactly as described (new open box) not to mention it came in two days! I will keep ordering from nt electronics  in the future! Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ralph Bair",
          "Nb_Reviews": 1,
          "Date": "2020-12-20T15:36:19.000Z",
          "Titre": "I ordered a cable modem",
          "Contenu": "I ordered a cable modem.  Order promptly processed and shipped USPS 3-day priority with shipping notification, tracking information, and delivery notification.  Product was as described, \"new in box.\"  Box may have been previously opened??  But modem activated on Comcast without issues, and the price at NT was about $15-20 cheaper than any other vendor.  So, unless the modem is later problematic, I am currently very pleased with the order and NT Electronics' service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dina  Carrington",
          "Nb_Reviews": 2,
          "Date": "2020-04-25T02:15:51.000Z",
          "Titre": "True to their word",
          "Contenu": "I ordered an HP slim desktop tower with a keyboard and mouse from them and it arrived quickly and in awesome condition. After checking the RAM and AMD drive as listed in the description I am very pleased with my purchase. I look forward to ordering more from them. Thank you for being true to your word!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 5,
          "Date": "2020-09-16T00:33:47.000Z",
          "Titre": "Great laptop and matched the…",
          "Contenu": "Great laptop and matched the description when I purchased it. The email notifications were great and I knew where the order was at all times which was great. It was good experience and I'd gladly use them again for another purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FMSkeen Copywriting",
          "Nb_Reviews": 4,
          "Date": "2021-02-12T23:25:53.000Z",
          "Titre": "I got an open box deal on an ASUS…",
          "Contenu": "I got an open box deal on an ASUS 2-in-1 laptop. So happy. The touchpad gets screwy sometimes, but that might be a driver issue, not the computer itself. I immediately sent my best friend to get her computer here too. She got a refurbished desktop and she's super happy with it. I'll update if the computer ends up being a dud, but I don't expect that. Thank you, guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria Olivo",
          "Nb_Reviews": 1,
          "Date": "2021-02-03T04:53:19.000Z",
          "Titre": "Samsung Tablet 10.1 Tab A",
          "Contenu": "I was greatly impressed with the Samsung 10.1 Tab A that I received, it was in excellent condition, just like the description implied. The price was just right and it works perfectly. No issues, I would purchase from NT Electronics again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt Siegfried",
          "Nb_Reviews": 2,
          "Date": "2021-03-11T21:37:21.000Z",
          "Titre": "I recently purchased a refurbished…",
          "Contenu": "I recently purchased a refurbished monitor form this site. The monitor arrived within a few days of ordering and was in great shape. Everything was included in the package I needed to utilize this equipment. Will definitely use this site again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KT",
          "Nb_Reviews": 2,
          "Date": "2020-11-29T17:58:24.000Z",
          "Titre": "Great Customer Service and Great products",
          "Contenu": "Quickly response and shipping. Good quality products with adorable price than other retail stores. I would like to recommend to my friends and family. I will come back and purchase from NT electrics."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chad Wenke",
          "Nb_Reviews": 1,
          "Date": "2021-05-29T23:55:40.000Z",
          "Titre": "My order shipped the same day i ordered…",
          "Contenu": "My order shipped the same day i ordered it. I received my order within in 3 days of placing my order. I was reluctant to buy an open box item, but everything looked perfect other than the tape missing on the little boxes. Very happy with my purchase and how quickly I received it.I really like the cameras and the wireless 1TB hard drive. Very nice quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry Boudreaux",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T22:15:07.000Z",
          "Titre": "Had issue with purchase they corrected…",
          "Contenu": "Had issue with purchase they corrected it with no hassle in a timely manner. Appreciate their help"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "zaldy",
          "Nb_Reviews": 3,
          "Date": "2023-09-23T15:54:25.000Z",
          "Titre": "im satisfied with the service my item…",
          "Contenu": "im satisfied with the service my item is good condition this my third order ,, im happy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adwoa",
          "Nb_Reviews": 2,
          "Date": "2021-03-05T23:55:15.000Z",
          "Titre": "Great service",
          "Contenu": "I was skeptical about purchasing from here since I had never heard of NT Electronics before, but I have faith in Google and went along with their reviews. I am glad I did. The Chromebook is clean, as much as it is open box, and it was very easy to set up my account. I am also very pleased with the screen size and the prize. Most Chromebooks I came across had screen sizes of only 11 inches for the price I was looking for, so this was a super deal. I will definitely be purchasing from NT Electronics again, should the need arise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arnold H",
          "Nb_Reviews": 2,
          "Date": "2022-04-25T19:47:16.850Z",
          "Titre": "My experience with the seller was…",
          "Contenu": "My experience with the seller was excellent. I ended up needing to cancel my order. The response was attentive, helpful and expedient. I really appreciate the turnaround time and would recommend the company to others. In future I will purchase again from N & T"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shea Gleason",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T06:32:29.000Z",
          "Titre": "the price seemed deceivingly low for…",
          "Contenu": "the price seemed deceivingly low for the product I was getting, honestly I was worried it was a scam or would’ve come in bad condition, but my product was perfect/new… arrived super quickly, and was great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jordan",
          "Nb_Reviews": 3,
          "Date": "2023-01-01T19:15:31.000Z",
          "Titre": "amazing, deserve more than 5 stars",
          "Contenu": "The company went above and beyond in their delievery to my PC. Here is my experience:- it shipped so fast. I had it on my door in 2 days. Unbelievable.- When it came i had a small issue with the PC. I really didnt know how to fix it. It was NY eve. The seller was willing and able to guide me through the issue, and it worked like a charm. The seller also honer their return and immidiately gave me the option to return it if it didnt work.- the fact that they were willing to guide me through this in a public holiday speaks volume. The customer service is very professional.- the pc arrived in great conditions. Exactly as described, not a screw missing.- all around I would recommend and buy again. Get them you wont regret it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Dickson",
          "Nb_Reviews": 4,
          "Date": "2021-12-09T19:11:23.000Z",
          "Titre": "These people are unbelieveable!",
          "Contenu": "These people are unbelieveable! Less than a week ago, I received a shipment via FedX from NT Electronics. Left on my doorstep was a gift for my son, but I noticed the box was pretty beat up and one end was open. Further inspection revealed I had the product packaging but no product! And its three weeks to Christmas!!! Today I have been given a full refund! All issues with FedX have been dealt with by NT staff. I thought I'd still be dealing with this on the 4th of July! And I am gobsmacked by NT's customer service. I'm going to buy something from these people even if I don't need it!!! You should too!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carl",
          "Nb_Reviews": 4,
          "Date": "2021-10-29T20:26:53.000Z",
          "Titre": "Great deal on a tablet",
          "Contenu": "This was my first experience with NT, as I had not heard of them before.  I had been looking for an Android tablet for my wife and was unhappy with the price of the new Tab S7 and the lower grade specs on the Tab S6 lite, so I was looking for an original Tab S6.  Most of what I found was used or \"renewed\", but NT had the bundle with the S pen and keyboard I was looking for, new.  It was open box, but that was fine, and the price was hundreds of dollars lower than the Tab S7.  I ordered it on a Thursday night, and NT shipped it out via Fedex at no charge the next day.  Their website was easy to navigate, the check out process was quick, and their communications were top notch.  The package arrived fine, and included everything that was promised, all working fine.  5 stars to NT!  I will definitely check their site when I have other electronics purchases to make."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Cooper",
          "Nb_Reviews": 6,
          "Date": "2021-03-01T05:58:33.000Z",
          "Titre": "A perfect all-around transaction!",
          "Contenu": "Not only was the laptop perfect and exactly as listed, it even arrived a day early!  Imagine that. I would not hesitate to do business with NT in the future, or recommend them to anyone I know."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Andre Arteaga",
          "Nb_Reviews": 3,
          "Date": "2021-03-09T14:49:48.000Z",
          "Titre": "Not only was the laptop perfect and…",
          "Contenu": "Not only was the laptop perfect and exactly as listed, it even arrived a day early! Imagine that. I would not hesitate to do business with NT in the future, or recommend them to anyone I know."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wade V",
          "Nb_Reviews": 1,
          "Date": "2020-04-12T23:48:02.000Z",
          "Titre": "My first purchase was a great deal",
          "Contenu": "My first purchase was a great deal. Bought one for my daughter and was in excellent condition. Just as advertised. Already looking for another from NT electronics."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Bush",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T01:27:47.000Z",
          "Titre": "Lovely computer, lovely experience.",
          "Contenu": "You guys delivered the computer on time and in great shape and also covered the shipping costs. Go NT Electronics."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gail Turner",
          "Nb_Reviews": 1,
          "Date": "2020-08-10T13:08:25.000Z",
          "Titre": "Very positive experience.",
          "Contenu": "The price at NT was the best that I could find (by far) and the service was incredible. They shipped very fast, quickly answered inquires and the order arrived at the predicted date.  The only issue is that the packaging had been oppened and was very dog eared.  On the other hand the tablet was perfect.  In the end great service, great price and great product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2020-10-08T13:57:56.000Z",
          "Titre": "First time purchase - won't be last!",
          "Contenu": "Nice choice of refurb'd laptops. Found exactly what I was looking for. VERY easy purchase process. Great communication from NT Electronics. Super-fast from order completion to shipping tracking number. Quality shipper (FedEx).Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "E Davis",
          "Nb_Reviews": 2,
          "Date": "2021-10-23T01:43:31.000Z",
          "Titre": "I needed a Chromebook for my 8 yr old",
          "Contenu": "I needed a Chromebook for my 8 yr old. I wanted something with a high rating and certain features but didn't want to spend a lot of money. When I saw NT Electronics during my search I was skeptical. It said \"New Open Box\". It had everything I wanted at a price I loved. I read a lot of the reviews. A couple of them made me hesitant to order. Then I said a prayer and ordered. I'm glad I did because it arrived in 4 days and everything was as described. If  the box had been opened I couldn't tell. It works great! My child was so excited and so was I! I will definitely keep this in my Favorites for quick access and I will definitely recommend them! Thanks NT Electronics!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ebony S Williams",
          "Nb_Reviews": 1,
          "Date": "2020-05-06T21:43:07.000Z",
          "Titre": "Appearance is good",
          "Contenu": "Despite the COVID-19 epidemic the package arrived on time.  Subscription to Antivirus software was expired so I purchased a new one. But all appears to be working well on day one of usage."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Bullion",
          "Nb_Reviews": 1,
          "Date": "2020-04-09T15:38:08.000Z",
          "Titre": "Perfect transaction",
          "Contenu": "NT Electronics beat Home Depot's price on the ceiling fan I was looking for by $15 and shipped it very quickly.  Highly recommended company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Nibarger",
          "Nb_Reviews": 2,
          "Date": "2021-12-11T20:59:49.000Z",
          "Titre": "This is my second order for the same…",
          "Contenu": "This is my second order for the same laptop. I’ve also recommended it o 3 other people that I know have purchased it. Great price, fast response. Highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Moises decoster",
          "Nb_Reviews": 2,
          "Date": "2022-07-14T17:57:50.000Z",
          "Titre": "Experience I'm 26 and my name is Moises",
          "Contenu": "Experience I'm 26 and my name is Moises and teen girl stop asked for where brook and I don't talking about and he and she and my family."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vivian - South eastern PA",
          "Nb_Reviews": 1,
          "Date": "2022-11-20T02:27:56.000Z",
          "Titre": "Computer Works Great",
          "Contenu": "Computer was received in good condition, as advertised, on time.  Set up was easy, everything is working well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexi J",
          "Nb_Reviews": 1,
          "Date": "2021-04-24T18:11:36.000Z",
          "Titre": "I ordered Galaxy s6 tablet",
          "Contenu": "I ordered the Galaxy s6 tablet, which looks and functions like new, and received it in 3 days! It came with all components as promised!!! I strongly recommend!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jen W",
          "Nb_Reviews": 1,
          "Date": "2021-09-07T15:35:39.000Z",
          "Titre": "Quick Process and delivery (less than 2…",
          "Contenu": "Quick Process and delivery (less than 2 business days)! Item was as described (new, undamaged, in original box)!  Pleasantly Surprised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Natalie From New Hampshire",
          "Nb_Reviews": 2,
          "Date": "2023-03-27T22:53:10.000Z",
          "Titre": "Package came earlier than expected",
          "Contenu": "Package came earlier than expected. Was surprised came in original box and not an outer cardboard pkg."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "VALUED CLIENT",
          "Nb_Reviews": 9,
          "Date": "2023-10-26T22:10:04.000Z",
          "Titre": "Great price",
          "Contenu": "Great price, very fast delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gevorg Arutyunyants",
          "Nb_Reviews": 2,
          "Date": "2020-04-24T01:50:02.000Z",
          "Titre": "Fast shipping OEM Product The Best Price",
          "Contenu": "Fast shipping . OEM product received as described. The best price on online market . Definitely 5 stars and will buy again from them (you)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gevorg Arutyunyants",
          "Nb_Reviews": 2,
          "Date": "2020-04-24T01:47:42.000Z",
          "Titre": "Fast shipping OEM Best Price on Market",
          "Contenu": "Fast shipping . OEM product received as described. The best price on online market . Definitely 5 stars and will buy again from them (you)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew D.",
          "Nb_Reviews": 1,
          "Date": "2021-03-07T02:27:02.000Z",
          "Titre": "Perfect",
          "Contenu": "Item was exactly as described! An amazing price for an opened box item that is in new and perfect condition. I am extremely happy, and I will shop here again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CPT Elton Hammonds",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T02:08:40.000Z",
          "Titre": "It's amazing how fast it arrived in…",
          "Contenu": "It's amazing how fast it arrived in perfect condition! Thank you soooooooooo much!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lextraveler",
          "Nb_Reviews": 2,
          "Date": "2022-05-13T01:52:53.000Z",
          "Titre": "Happy first-time customer",
          "Contenu": "Lowest price I could find on the web, and no sales tax.  Very fast delivery in secure packaging.  Hope to do business with this company again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle Kramer",
          "Nb_Reviews": 1,
          "Date": "2020-10-11T14:19:42.000Z",
          "Titre": "When my laptop arrived with a problem, they were on it.",
          "Contenu": "When my laptop arrived with a problem, NT Electronics was proactive and responsive in making sure that everything was taken care of."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan",
          "Nb_Reviews": 2,
          "Date": "2022-03-07T23:48:40.000Z",
          "Titre": "Excellent seller",
          "Contenu": "From the start, communication was excellent. Quick shipping.Item arrived in perfect condition. I hesitated due to them being labeled \"not dependable\", Sorry, but my experience was outstanding. Thank you for good pricing and excellent service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Pham",
          "Nb_Reviews": 1,
          "Date": "2020-12-02T14:40:55.000Z",
          "Titre": "Im satisfied!",
          "Contenu": "Im satisfied!! Product is well packed and great customer service. Pleasure to do business with you guys.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Smith",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T22:05:04.000Z",
          "Titre": "Brand new air fryer at a great price",
          "Contenu": "Brand new air fryer at a great price, quick delivery too, no complaints here!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daisy Alvarez",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T14:13:09.000Z",
          "Titre": "Hello, Proud Owner of my laptop",
          "Contenu": "Hello, I haven’t received my package yet it I assume that I will get it by today I am excited to see my present for Mother’s DayThe shipping is a little slow but that’s not bad as long as it comes I will be happy Thank you ☺️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SlamminS85",
          "Nb_Reviews": 4,
          "Date": "2020-03-27T21:57:06.000Z",
          "Titre": "Easy to work with and they shipped…",
          "Contenu": "Easy to work with and they shipped fast. A little disappointed they dropped the price by 30% the day after mine shipped, but they worked with me and we reached an agreement on total price!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CRAIG ANDERSON",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T00:16:58.000Z",
          "Titre": "Product was delivered as advertised no…",
          "Contenu": "Product was delivered as advertised no substitutions completely as described fast delivery delivery updates and a decent price. Very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Burke",
          "Nb_Reviews": 1,
          "Date": "2021-04-09T00:58:37.000Z",
          "Titre": "Package arrived on time and in new…",
          "Contenu": "Package arrived on time and in new condition. Will buy from them again for sure, cheaper than amazon too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Joseph Blum Jr.",
          "Nb_Reviews": 2,
          "Date": "2023-02-20T01:02:52.000Z",
          "Titre": "Top Notch",
          "Contenu": "They were quick & efficient.  Shipped the computer right away at a price that was $200 lower than everyone else!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Max Eugene",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T01:01:12.000Z",
          "Titre": "Very very great experience with…",
          "Contenu": "Very very great experience with ntelectronics and lm really satisfying Thank you thank you again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fra Elam",
          "Nb_Reviews": 1,
          "Date": "2020-11-27T02:28:30.000Z",
          "Titre": "product was well and above expected…",
          "Contenu": "product was well and above expected great condition....FedEx two days...fast shipping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Clarke",
          "Nb_Reviews": 5,
          "Date": "2020-04-17T16:08:21.000Z",
          "Titre": "Good communication and prices",
          "Contenu": "Good communication and prices. Responds to you in a timely manner if you have any issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NORMAN and ANN KNOBELOCH",
          "Nb_Reviews": 2,
          "Date": "2023-02-10T19:36:55.000Z",
          "Titre": "Fast delivery",
          "Contenu": "Fast delivery! Great item and great price. Emailed with updates on order and when it would be delivered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SAMEERE ALI",
          "Nb_Reviews": 1,
          "Date": "2022-02-04T00:03:34.000Z",
          "Titre": "On time and fast delivery.Quality product",
          "Contenu": "On time and fast delivery. Product as advertised. Good, strong quality on arrival."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Pattie",
          "Nb_Reviews": 1,
          "Date": "2022-04-28T20:33:54.028Z",
          "Titre": "My order was delivered in a timely matter.",
          "Contenu": "My order was delivered in a timely matter. Plus no sales tax and free shipping. This is better than Amazon Prime."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Verified Purchaser",
          "Nb_Reviews": 1,
          "Date": "2022-05-02T21:38:06.000Z",
          "Titre": "Product was received as was stated in…",
          "Contenu": "Product was received as was stated in purchase agreement.  NT also shipped the product well packaged  and very fast. I would purchase from them again. Very happy with my product and service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Seaquest",
          "Nb_Reviews": 2,
          "Date": "2022-08-22T03:17:25.000Z",
          "Titre": "Amazing experience",
          "Contenu": "Super fast, accurate shipping (I literally got the tracking number within the hour of ordering) at the best price I could find!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Suzanne Seale",
          "Nb_Reviews": 2,
          "Date": "2022-01-15T17:02:32.000Z",
          "Titre": "I ordered and changed my mind in a few…",
          "Contenu": "I ordered and changed my mind in a few hours. They said it was already sent. They were able to stop the order and refund my money. This means to me speed and flexibility. I would recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandy Kuchta",
          "Nb_Reviews": 1,
          "Date": "2022-03-17T13:16:36.000Z",
          "Titre": "Outstanding",
          "Contenu": "Outstanding quick very helpful I’m retired the cost was right for me Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Nibarger",
          "Nb_Reviews": 2,
          "Date": "2021-08-21T20:19:37.000Z",
          "Titre": "Price was perfect and the shipping was…",
          "Contenu": "Price was perfect and the shipping was awesome. Our order arrived 2 days before the original delivery date."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe L",
          "Nb_Reviews": 3,
          "Date": "2023-01-06T21:15:52.000Z",
          "Titre": "Patience -It remains to be seen well the Lenovo…",
          "Contenu": "It remains to be seen well the Lenovo functions but the process up to delivery was very satisfactory."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed T",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T19:36:31.000Z",
          "Titre": "Quality product & fast shipping",
          "Contenu": "Brand new product at unbeatable price combined with fast delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Tabas",
          "Nb_Reviews": 1,
          "Date": "2020-11-11T00:00:27.000Z",
          "Titre": "Honest and straightforward",
          "Contenu": "Honest and straightforward, they followed through with everything they said they would do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronald Say",
          "Nb_Reviews": 2,
          "Date": "2021-11-25T21:16:19.000Z",
          "Titre": "Flawless transaction in every way",
          "Contenu": "Flawless transaction in every way. Would purchase from here again..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "IS Lease Admin",
          "Nb_Reviews": 1,
          "Date": "2020-09-29T13:35:01.000Z",
          "Titre": "Shipping was super fast",
          "Contenu": "Shipping was super fast, I literally go the order within a couple of days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Hendricks",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T12:28:09.000Z",
          "Titre": "Great Company!",
          "Contenu": "Wow! Great Product, great correspondence! Happy with my purchase!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason L",
          "Nb_Reviews": 3,
          "Date": "2021-07-29T19:14:24.000Z",
          "Titre": "Bought this for my daughter",
          "Contenu": "Bought this for my daughter, starting school soon.  She loves it   shipped fast and was too top shape when it arrived."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna Karyus",
          "Nb_Reviews": 2,
          "Date": "2022-10-17T02:25:05.000Z",
          "Titre": "Very pleased with product",
          "Contenu": "Very pleased with product. Arrived sooner than I had expected!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "judy f",
          "Nb_Reviews": 2,
          "Date": "2023-07-17T17:03:58.000Z",
          "Titre": "Excellent service",
          "Contenu": "Was as described. Quick delivery. Well packaged."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ash",
          "Nb_Reviews": 1,
          "Date": "2020-04-11T23:43:30.000Z",
          "Titre": "Thanks",
          "Contenu": "Thanks! The glass star pendant light came in perfect shape and super super fast shipping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tepmongkol Shewakarn",
          "Nb_Reviews": 1,
          "Date": "2021-10-21T20:42:38.000Z",
          "Titre": "Every thing perfect.",
          "Contenu": "Every thing perfect...Good communicated..Good PRODUCT..Good delevery..Good price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JALAL Fathi Sola",
          "Nb_Reviews": 1,
          "Date": "2020-12-02T15:39:20.000Z",
          "Titre": "Their customer service is great",
          "Contenu": "Their customer service is great. I made a mistake, sent an email to them and in less than a minute they solved it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol",
          "Nb_Reviews": 1,
          "Date": "2022-04-26T05:33:52.503Z",
          "Titre": "Very nice people sent fed ex got it…",
          "Contenu": "Very nice people sent fed ex got it next business day. Came wrapped extremely well and safe. Very pleased. Bought x box series x. Thank you so dang much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nelson",
          "Nb_Reviews": 1,
          "Date": "2022-01-26T19:28:06.000Z",
          "Titre": "Great Buy and Great Customer Service",
          "Contenu": "The transaction was seamless and the device is as advertised. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica Borgmeyer",
          "Nb_Reviews": 2,
          "Date": "2021-05-01T01:52:43.000Z",
          "Titre": "Thank you",
          "Contenu": "As advertised and got  her sooner than expected. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "bill buscher",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T15:33:54.000Z",
          "Titre": "phone",
          "Contenu": "This Item was shipped out the same day it was ordered and I received it in three days. I would highlly reccomend this company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WILLIAM MERROW",
          "Nb_Reviews": 17,
          "Date": "2022-09-25T06:58:17.000Z",
          "Titre": "Super condition Desktop Hp Pavilion…",
          "Contenu": "Super condition Desktop Hp Pavilion 27-D0014 27\" Touch AiO in new condition with all standard software - eligible for Windows 11 which installed easily/automatically."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Omy",
          "Nb_Reviews": 1,
          "Date": "2021-04-25T18:19:45.000Z",
          "Titre": "Super fast shipping and the product…",
          "Contenu": "Super fast shipping and the product came in perfect condition!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Avery B",
          "Nb_Reviews": 1,
          "Date": "2021-03-09T16:30:43.000Z",
          "Titre": "The product came in ONE day",
          "Contenu": "The product came in ONE day! Perfect condition! I’m so happy with my purchase"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenda Hale",
          "Nb_Reviews": 1,
          "Date": "2022-05-21T14:53:06.000Z",
          "Titre": "Great company",
          "Contenu": "Great price, very responsive service, and fast shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SCOTT DAVIDSON",
          "Nb_Reviews": 3,
          "Date": "2021-06-04T23:01:03.000Z",
          "Titre": "Quick shipping",
          "Contenu": "Quick shipping. Product as described.Great communication. Very pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Steele",
          "Nb_Reviews": 3,
          "Date": "2022-12-29T23:22:05.000Z",
          "Titre": "Order came when promised",
          "Contenu": "Order came when promised. Box was not damaged."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D Alicea",
          "Nb_Reviews": 1,
          "Date": "2022-10-02T22:09:23.000Z",
          "Titre": "30 in built in trim kit",
          "Contenu": "Correct  product, fast delivery.  What more could I ask for?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Stempel",
          "Nb_Reviews": 2,
          "Date": "2021-10-09T15:26:50.000Z",
          "Titre": "Rapid delivery",
          "Contenu": "Rapid delivery, great price (for open box laptop) and responsive to customer queries."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Vallario",
          "Nb_Reviews": 1,
          "Date": "2021-11-03T14:34:23.000Z",
          "Titre": "Got the PS5 and got it on time",
          "Contenu": "Got the PS5 and got it on time. Nice to have no taxes included on purchase. I recommend this site!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tina Frazier",
          "Nb_Reviews": 2,
          "Date": "2020-05-09T01:56:03.000Z",
          "Titre": "Excellent product fast shipping",
          "Contenu": "Excellent product fast shipping. Would buy again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynn",
          "Nb_Reviews": 6,
          "Date": "2021-11-15T19:07:28.000Z",
          "Titre": "great laptop",
          "Contenu": "great laptop, fast delivery and awesome price. thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Amspaugh",
          "Nb_Reviews": 2,
          "Date": "2022-08-13T19:41:02.000Z",
          "Titre": "Pretty good price and right on time",
          "Contenu": "Pretty good price and right on time. This power cable is expensive. I'm glad I found it here! You saved me a lot of money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Misteravich",
          "Nb_Reviews": 2,
          "Date": "2022-06-09T20:06:36.000Z",
          "Titre": "Timely delivery",
          "Contenu": "Timely delivery.  Priced right.  Easy to order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lance Cohen",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T06:19:29.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping, and competitive pricing, can't go wrong with NT Electronics"
        }
      ]
    }
  ]
}