{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "oddblox.net",
      "Review": [
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dee Schaedler",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T16:31:55.000Z",
          "Titre": "Pretty excellent",
          "Contenu": "Excellent pricing and painless configuration. My setup was delayed, but support was quick to resolve the issue.Certain interfaces seem designed more for form than function, and the Knowledgebase needs a lot of expansion / updating. Overall a solid experience and host which I will recommend in the future."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "AtomicGaming",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T02:26:55.000Z",
          "Titre": "Exceptional hosting experience",
          "Contenu": "Exceptional hosting experience! As the developer overseeing a server on this platform, I am thoroughly impressed with the astonishingly fast load times. The service provided is nothing short of amazing, and I wholeheartedly recommend using them. A solid 5-star choice for anyone seeking top-notch hosting!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Yokami",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T00:40:27.000Z",
          "Titre": "Stable",
          "Contenu": "Stable, fast, better than sparked host in terms of perfs at least.I don't know about customer support since i haven't had any problems yet"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KastorianVT",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T02:17:29.000Z",
          "Titre": "Truly the best!",
          "Contenu": "Currently hosting a modded Minecraft server with over 400+ mods. Zero lag, efficient and easy use, and affordable options. Exceeded my expectations. Thank you Oddblox!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leviticus Stowers",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T03:12:42.000Z",
          "Titre": "Fantastic customer service!",
          "Contenu": "Best cheap, mod-friendly server host around! I'm new to server hosting, and modpack-making, and the staff were *super* helpful! Some of the best customer support I've seen on a server-host! Livechat wait was always less than a minute, too. They helped me get my hodge-podge poorly made kitchen-sink modpack working!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T06:55:17.000Z",
          "Titre": "The website layout and appearance is…",
          "Contenu": "The website layout and appearance is very clean. I had several questions, and the site's live chat feature was incredibly helpful. Andrew B was incredibly helpful and was able to guide me through the installation process well, and helped install a custom modpack onto my Minecraft server. Overall the experience was nice and the prices are quite affordable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SaintGerard",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T15:44:24.000Z",
          "Titre": "I am new to hosting servers",
          "Contenu": "I am new to hosting servers, I moved to a different state so my Brother and I can't really play things any more especially Minecraft. So we decided to go with a hosting service. This was my first time being a \"hoster\", the process was very simple and I had asked if they could add the server files for a Mod Pack we wanted to play and they were more than happy to add them in during the server setup process. All of this took about 10 minutes in total. I am very happy so far with the results!I wanted to post an update as this just happened last night. My brother and I decided to change modpacks and we used the Mod Manager feature for our server. There was an issue with the server files that the mod manager had and it was missing some mods, which caused a mismatch error. I started a chat and was connected with Andrew, he personally helped take a look and trouble shoot the issues we were having. Eventually getting the dev team involved to update the server files and ultimately solving the issue. All in all the issue was resolved in about an hour maybe 2 (I find this very reasonable especially since this was later at night) and my brother and I were able to start playing same day. You guys are doing a great job! Keep it up!!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jason Eiserman",
          "Nb_Reviews": 6,
          "Date": "2023-03-21T01:11:57.000Z",
          "Titre": "Great deal, friendly owners, win-win",
          "Contenu": "Best price hosting you'll find for both the quality of the server you're getting, and the quality of support! Owners are super friendly and will even help out with support. You want a human experience and get power for your budget, look no further. I'm very impressed, and the standard of other hosts is way behind by comparison!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean Ireland",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T05:01:30.000Z",
          "Titre": "No worries here.",
          "Contenu": "I was worried about getting a minecraft server after checking reviews and finding big companies lying and providing little to no support.   Oddblox not only has prompt friendly support they went out of there way to satisfy and assist me.  Server hasn't shown any lag or problems running minecraft ATM8 on 8 gigs for far less than other providers."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Gavin Song",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T04:09:07.000Z",
          "Titre": "Cheap AND good",
          "Contenu": "Cheap, powerful, yet reliable. That is rare.I will use oddblox for as long as I'll be able to mod minecraft."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Holloway",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T05:12:26.000Z",
          "Titre": "A hosting company that doesnt limit CPU",
          "Contenu": "I have had many hosting companies since 2018, but this is the first time I had one that doesn't limit the CPU threads (most limit to 2 or charge extra). Support is great. You get what you are paying for 100%"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cody Lince",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T15:49:16.000Z",
          "Titre": "Best I've Seen",
          "Contenu": "Best server hosting site. Had a bad experience with a different provider before coming here, and it's night and day. There are people that can answer questions you have  before purchasing, the file manager is intuitive for adding mods, and I haven't had any issues with server uptime thus far."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Leokratis",
          "Nb_Reviews": 1,
          "Date": "2022-10-30T21:25:18.000Z",
          "Titre": "A 10/10 hosting service",
          "Contenu": "By far the best hosting service out there. I have been looking for a good hosting service for years now and I have found the best one out there. Compared to other hosting services Oddblox has better support, pricing and reliability. The support team replies in minutes, sometimes even seconds, I have never seen downtime and the latency is very low. The UI is simple and easy to understand and it has a lot of very useful features. Truly the best VFM (value for money) hosting service out there.In short Oddblox is heap, reliable and has a blazing fast support team that will go far and beyond to assist you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Noah Dieng",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T10:20:56.000Z",
          "Titre": "Heavily modded Minecraft server without lag, finally!",
          "Contenu": "I had been using Bisect Hosting to host my modded Minecraft servers for the longest time, since a lot of modpacks have discount codes for that service and I figured it'd be worth a shot to save money--every single server I ran, no matter the modpack, lagged the moment you had 2 or more people online. I bought more RAM for each one and it made no difference; and even as I stripped away the heavier mods it would still often chug. After getting fed up with it on my third time using Bisect, I looked around for other options and saw someone recommend Oddblox on Reddit. Gave them a shot after looking into the alternatives, and I absolutely wish I went to Oddblox sooner. Their prices are just as good, if not cheaper, than Bisect, and I'm able to run a server with 200+ mods and 3-4 of my friends all at the same time with pretty minimal lag. Had a hiccup or two at the very beginning as I was getting used to their control panel, but their support is good and the server itself is fantastic. Highly recommend--until I switched to Oddblox, I thought all modded servers just HAD to lag. Not the case at all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karma",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T09:02:02.000Z",
          "Titre": "Great for the price",
          "Contenu": "Great service little lag here and there on the weekends but great overall"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Papa Bless",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T01:09:07.000Z",
          "Titre": "Phenomenal Support Service",
          "Contenu": "The technical support person was very knowledgeable and patient in helping me perform my first time setup. After figuring out how it all worked, the server was pretty seamless in being used."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Az",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T21:39:10.000Z",
          "Titre": "Very positive initial impression!",
          "Contenu": "Excellent value, setup was quick and relatively easy, and I was able to get things up and running quickly so that we can play and enjoy the game. Hopefully this experience continues, but my initial impression is very positive. Thank you much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eros",
          "Nb_Reviews": 1,
          "Date": "2022-03-27T04:38:00.000Z",
          "Titre": "Outstanding Performance!",
          "Contenu": "Outstanding and fast customer service, servers give me no lag at all even at a lower end plan. Would recommend for any Minecraft needs. Works amazingly for hosting larger modded servers."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "JoselitoPapito",
          "Nb_Reviews": 1,
          "Date": "2022-08-07T23:48:14.000Z",
          "Titre": "I'm usng this web for a Minecraft…",
          "Contenu": "I'm usng this web for a Minecraft Hosting, and I have to think they are amazing (hosting specs and also support team). They offer a high quality server for a low price, and also the support team helped me fixing my server, they are better than any other MC hosting. 10/10"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Brady",
          "Nb_Reviews": 5,
          "Date": "2023-02-09T14:56:28.000Z",
          "Titre": "Probably the most affordable and reliable minecraft hosting provider",
          "Contenu": "I can't remember how I found out about Oddblox but I'm glad I did.I really recommend their services.I have been using their servers for about a year and I had no problems with it. Sometimes the servers might have an issue but it was quickly fixed after contacting support.Their prices are fair and you get some amazing specs for what you pay. I have mostly used the 4GB of ram service in either France or the UK and it always runned smoothly, even on 1.19 with a bunch of plugins.There's also a free server that you can get with 2GB of ram and it's great for testing stuff out or making a server with friends.I don't really have any cons. Their prices have changed significantly in the last year but with inflation it's expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe K",
          "Nb_Reviews": 1,
          "Date": "2022-08-01T04:20:10.000Z",
          "Titre": "very helpful quick assistance",
          "Contenu": "There have been many problems I have ran into which comes from me not knowing how to set up something or a file corrupting and I am responded to and assisted within a couple of hours at most on the discord in a ticket. The staff are friendly and helpful and I appreciate how much they've taken care of me and assisted with having my server running."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T17:52:15.000Z",
          "Titre": "Powerful server combined with excellent…",
          "Contenu": "Powerful server combined with excellent customer service. I made the decision to add over 250 mods to a server and spent several days stubbornly trying to figure it out myself as I wasn't sure what I was doing. Oddblox Customer Service was prompt, knowledgeable, and saved me so much time and headaches once I finally asked XD It's so great to have a custom and customizable server without having to be a skilled programmer. What I was trying to do required more juice than the standard package, but the rep didn't try to oversell me and recommended the smallest thing that would do what I needed it to. Would definitely recommend and I'm surprised this service isn't more renowned."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nati Y",
          "Nb_Reviews": 1,
          "Date": "2022-01-24T16:07:10.000Z",
          "Titre": "This is a great hosting company and I'd…",
          "Contenu": "This is a great hosting company and I'd recommend it to anyone and everyone.The server startup is easy, and adding in plugins is fairly easy too. You just look up the plugin name in the plugin tab and you can find it easily."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Buderman",
          "Nb_Reviews": 1,
          "Date": "2022-01-17T03:47:42.000Z",
          "Titre": "As a family run and owned business well…",
          "Contenu": "As a family run and owned business well I well I would have to rate it 5 stars because one, I love both Andrew and Nelly and two, long live the skaia craft family. Sincerely Morgan aka buderman. ❤"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "strange love",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T07:20:06.000Z",
          "Titre": "An affordable hosting server with even greater customer service!",
          "Contenu": "I was having a longterm issue with trying to run a custom modpack server with using the Shockbyte Hosting service while also experiencing very poor customer service by their help desk. I had found Oddblox on reddit and decided to look into it. Not only did it have incredibly cheap prices for great quality servers, they also had straightforward guidance on how to install preloaded modpacks from all the most relevant loaders. One of, if not, THE most  amazing qualities about Oddblox is their attention to quality customer service. I had joined their discord in regards to some instructions and questions and instantly, I was greeted by the creator himself as well another member of their support team and they handled all of my concerns with extreme care as well as constant attention. Thank you Andrew and Sang!"
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Lax Kungen",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T07:52:36.000Z",
          "Titre": "Great staff, great server and just a good hosting company.",
          "Contenu": "I've been running a building project on their hosting platform for almost a year now, and if I'm being honest I'm struggling to find a downside choosing this hosting company. Friendly staff came and helped me immediately as I ran into a problem, server performed great and overall a great hosting company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert G.",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T23:52:40.000Z",
          "Titre": "Fantastic!",
          "Contenu": "2 Months in and have had ZERO issues with the server or set-up. Pricing is incredibly great value for what they offer."
        },
        {
          "Note": 5,
          "Lieu": "IS",
          "Pseudo": "Gummi",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T00:20:45.000Z",
          "Titre": "great customer service and workes…",
          "Contenu": "great customer service and workes perfect"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Block",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T05:02:10.000Z",
          "Titre": "good costumer service and really easy…",
          "Contenu": "good costumer service and really easy to use for modding"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Crusher",
          "Nb_Reviews": 5,
          "Date": "2022-01-17T22:31:33.000Z",
          "Titre": "Great minecraft host!",
          "Contenu": "Great minecraft host!Good hardware, great prices, and super friendly support team!I've never had any issues with this company, anytime I needed help, they were there"
        },
        {
          "Note": 5,
          "Lieu": "PE",
          "Pseudo": "ERIK",
          "Nb_Reviews": 2,
          "Date": "2022-05-22T00:52:53.000Z",
          "Titre": "Competitive prices for a solid service.",
          "Contenu": "They have competitive prices for a service just as good if not somewhat better than other well known minecraft server sites. Support staff is quick to answer, and effective. Definitely recommended."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Sven",
          "Nb_Reviews": 3,
          "Date": "2023-06-04T01:01:28.000Z",
          "Titre": "10/10 Support",
          "Contenu": "10/10 Support, Helped me with webhosting and trying to get my files back from a backup a month ago, They responded in minutes! Thank youKind regards"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "George Graff",
          "Nb_Reviews": 4,
          "Date": "2023-05-24T20:00:53.000Z",
          "Titre": "Great support",
          "Contenu": "Great supportI was struggling to install a pack and opened a ticket on their discord server and recieved a fast response and help <3"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mercury",
          "Nb_Reviews": 2,
          "Date": "2022-01-16T22:27:27.000Z",
          "Titre": "totally amazing",
          "Contenu": "totally amazing, the servers are fast and theres almost no downtime and support was so sweetif i would pick the best company I would choose oddblox"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Callum Knott",
          "Nb_Reviews": 1,
          "Date": "2022-03-04T22:47:43.000Z",
          "Titre": "This host is great",
          "Contenu": "This host is great! I got this for my mc server, support is great, I didn’t like the panel tho, but they offered to switch the panel I had and they did so and it’s so much better now! Great and I 100% recommend it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Colin Kalish",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T22:58:53.000Z",
          "Titre": "They are lightning fast with their…",
          "Contenu": "They are lightning fast with their responses. Very accessible"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tex Lempo",
          "Nb_Reviews": 1,
          "Date": "2022-01-16T20:37:56.000Z",
          "Titre": "Wonderful service",
          "Contenu": "Wonderful service, Cheap and affordable hosting, Reliable and easy to use! I would rate 10 stars if i could"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Logan",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T22:53:08.000Z",
          "Titre": "Great so far",
          "Contenu": "Great pricing, great hosting. Stress tested with a bunch of tnt minecarts and I didn’t feel any hit to the performance on the 2 gig plan"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oscar Z",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T03:28:10.000Z",
          "Titre": "Fast Support response",
          "Contenu": "Fast Support response. Good minecraft server hosting, very well priced."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "V.V.",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T00:19:02.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Customer service responded fairly super quickly and was competent to solve relevant issues with servers."
        },
        {
          "Note": 5,
          "Lieu": "IS",
          "Pseudo": "Noah Vorenkamp",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T23:50:23.000Z",
          "Titre": "Odbllx",
          "Contenu": "Fast, Is what it says, and provides good quality, supporting mods and everything.  I ran RLCraft on it with my friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R E",
          "Nb_Reviews": 1,
          "Date": "2022-10-15T23:09:06.000Z",
          "Titre": "Great customer service",
          "Contenu": "Customer service is fast and helpful. Thought this was sketch at first but it wasn’t. got everything that was promised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don Barlone",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T00:34:36.000Z",
          "Titre": "Really affordable high quality servers",
          "Contenu": "Really affordable high quality servers.  Probably the best out there."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jxsh",
          "Nb_Reviews": 1,
          "Date": "2022-01-16T20:15:52.000Z",
          "Titre": "Excellento Service",
          "Contenu": "Excellento Service! Been here since day 1 and its amazing."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Mart",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T01:01:57.000Z",
          "Titre": "zero problems",
          "Contenu": "i had zero problems and no complains at all"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zachery Oss NoobTubeGamingLLC",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T05:54:02.000Z",
          "Titre": "fast booting servers",
          "Contenu": "fast booting servers. things run really well."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Harrison Clark",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T07:52:13.000Z",
          "Titre": "No problems, great server!",
          "Contenu": "Great guys, great service, never had any problems!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Jordy B",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T18:11:06.000Z",
          "Titre": "Well running servers",
          "Contenu": "Amazing servers and great pricing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben Rollins",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T05:39:16.000Z",
          "Titre": "quick responses from the odd block staff"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Yoon Hong",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T23:22:46.000Z",
          "Titre": "Good server quality and customer support"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Federico",
          "Nb_Reviews": 2,
          "Date": "2022-09-25T19:26:50.000Z",
          "Titre": "it's not a scam",
          "Contenu": "it's not a scam, low prices and fast support"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kunde",
          "Nb_Reviews": 5,
          "Date": "2023-01-22T09:03:20.000Z",
          "Titre": "Nice fit in budget",
          "Contenu": "Nice fit in budget. Great host overall."
        },
        {
          "Note": 5,
          "Lieu": "RS",
          "Pseudo": "Dušan Jovanović",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T23:11:34.000Z",
          "Titre": "great service",
          "Contenu": "great service, cheap, excellent quality :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emani",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T17:35:52.000Z",
          "Titre": "Customer support was very helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ghost Ninja",
          "Nb_Reviews": 2,
          "Date": "2022-01-16T20:03:55.000Z",
          "Titre": "Great people",
          "Contenu": "Very helpful and kind"
        }
      ]
    }
  ]
}