{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "onkron.us",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jay unangst",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T22:13:44.000Z",
          "Titre": "parts missing im 73 treated me like  7…",
          "Contenu": "parts missing im 73 treated me like  7 year old"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Plymouth Halyard",
          "Nb_Reviews": 2,
          "Date": "2022-05-20T23:50:56.000Z",
          "Titre": "Sold an out of stock product and never…",
          "Contenu": "Sold an out of stock product and never communicated that the product wouldn't ship and then cancelled the order without offering a suitable replacement product.   Left me feeling that I'm wasn't valued as a customer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Irfan Khan",
          "Nb_Reviews": 2,
          "Date": "2021-01-14T20:20:15.000Z",
          "Titre": "The f product has not been delivered and money was charged.",
          "Contenu": "I brought the product because the company committed that they will deliver the product.  in the last week of December 2020. We paid 100% money in advance.The product has not ben delivered. We have not received the products. I run and online fitness center and this product was important for my business. Here has been no call from the company to provide me the status . Seems FRAUD to me .  I plan to go on social media for next week to ask for help and make everyone  aware. I am not sure how many of us are in the same situation.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph Pavlick JJ",
          "Nb_Reviews": 2,
          "Date": "2023-06-01T20:49:38.000Z",
          "Titre": "Where are you product",
          "Contenu": "Never received the product"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MDY",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T02:44:44.000Z",
          "Titre": "The mount did not support the weight of…",
          "Contenu": "The mount did not support the weight of a 91lb TV. The TV angled back because weight was not supported"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JAE",
          "Nb_Reviews": 1,
          "Date": "2022-05-27T03:20:05.000Z",
          "Titre": "The tablet stand was a piece of crap",
          "Contenu": "The tablet stand was a piece of crap. It fell as soon as I put the phone, tablet and other phone on it. Luckily my items didn’t break!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jack Whitehead",
          "Nb_Reviews": 1,
          "Date": "2020-11-08T19:23:48.000Z",
          "Titre": "where is my item",
          "Contenu": "I have not received my item after two weeks.  ? no notice of out of stock or otherwise."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Diana Zarkeshfard",
          "Nb_Reviews": 1,
          "Date": "2021-07-20T20:15:09.000Z",
          "Titre": "you keep cancelling our orders"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Benjamin Phillips",
          "Nb_Reviews": 1,
          "Date": "2022-01-27T19:47:35.000Z",
          "Titre": "Been a month",
          "Contenu": "Been a month. Still waiting for my package"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Dave Lewis",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T11:25:32.000Z",
          "Titre": "Confusing weight descriptions on TV stand",
          "Contenu": "The website had issues with my auto-fill address details. My UPS delivery was significantly delayed, involving numerous rescheduled dates and times, yet without any successful delivery. Support was unresponsive until after the package had finally arrived. Upon arrival, the packaging appeared as though it had been previously returned. Despite the TV stand being labeled for a 60kg weight capacity, their support team clarified that it's actually rated for a maximum of 45kg for a TV."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Curtis Chambers",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T02:50:40.000Z",
          "Titre": "I ordered two tablet stands I have only…",
          "Contenu": "I ordered two tablet stands I have only received one. There is no customer service phone number to help resolve this problem. I made the wrong choice in selecting your products. Never again. Thanks for nothing your company is nothing more than a piece of garbage."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lynda Navarre",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T19:38:56.000Z",
          "Titre": "BOX DESTROYED...AGAIN",
          "Contenu": "The first order for the rolling TV/monitor stand showed up with the box completely destroyed, and interior packaging hanging out.  We went ahead and shipped the item back and then waited for a NEW order to replace it.  That new order also showed up with the box in terrible shape.  We will be opening the box and attempting to put it together - we NEED it, but I'm thinking you guys need to seriously review your packaging for shipping considerations."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "randal",
          "Nb_Reviews": 3,
          "Date": "2020-10-23T03:34:13.000Z",
          "Titre": "Thank you for the opportunity to…",
          "Contenu": "Thank you for the opportunity to provide feedback. Whilst your product appeared to be amazing on the instagram video, once received it was not what was respresented. Product quaility was not stable and did not seem secure to hold amd move the televison securely. I also find it offensive that it cost me 75.00 to return the item that is valued at 159.00. Your company should stand by the product represented on Instagram as a quality product and if a consumers perception is otherwise...the company should accept the return with charing the consumer to pay for shipping to return an inferior product. I will contues to shop off line at best buy. I pay for what i see amd not what i hope to get.  Thank you,"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Allen Trent",
          "Nb_Reviews": 1,
          "Date": "2022-03-23T01:03:34.000Z",
          "Titre": "$250 surprise shipping fee. Not fair.",
          "Contenu": "The problem that I have is in reference to shipping. I made two orders from this company. The first order was a a little over $400. The second order was also over $400, roughly the same quantity, in fact I may have even ordered less mounts the second time. However, for the second order there was a extra $250 shipping cost. Please help me understand this. I even used the wholesale account/business account for the second purchase and I'm totally confused about the extra $250 shipping cost. I feel like I have been scammed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roger Zoebisch",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T19:07:41.000Z",
          "Titre": "perfect finished product",
          "Contenu": "perfect finished product, but the assembly of the pole to the base with the 3 blind screws is impossible even with a good helper. you should consider a two piece screw on connection, otherwise this stand should come with 2 Zoloft and an Advisory Warning."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "D.B.",
          "Nb_Reviews": 3,
          "Date": "2023-07-18T23:38:41.000Z",
          "Titre": "Slow to process my order",
          "Contenu": "It took three days for someone to call me back so I could place my order.  Once I spoke to your representative, the order shipped promptly.  There just needs to be improvements in the order process!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bill Yuss",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T14:33:19.000Z",
          "Titre": "Box came all broken up and ripped up…",
          "Contenu": "Box came all broken up and ripped up also looks like it was returned before some items have been assembled by a previous owner. And parry’s came broken as well as the remote control not working. I hope this can be resolved without returning the complete unit"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Moore",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T22:27:56.000Z",
          "Titre": "I would have liked to see the…",
          "Contenu": "I would have liked to see the connection method to the stand. I would have preferred a quick disconnect and the ability to use the same brackets to attach to a wall mount with a pull style quick disconnect.3 stars as I could not see the connection method and I do not like the tray connections, but overall I like the product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Erik Kientz",
          "Nb_Reviews": 2,
          "Date": "2023-04-10T18:32:41.000Z",
          "Titre": "The order I placed did not mention in…",
          "Contenu": "The order I placed did not mention in any way that it would be two pieces.  So when I recieved notice of two tracking numbers and the first number was printed and not shipped I was unsure if I was getting one or two pieces.  When the item arrived off of the second tracking number and it was not what I had ordered I was unsure what was going on.  I checked but there was no documantation that the double screen stand would come as a single stand with the dual screen adaptor. It just lists the complete unit as in a single item. The first tracking number had still not been used and so I decided to wait a week and see if it would show up.  It finally did show up and was two pieces but there was no documentation that it would be."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bo",
          "Nb_Reviews": 2,
          "Date": "2021-09-02T23:24:00.000Z",
          "Titre": "The little safety latches that go on…",
          "Contenu": "The little safety latches that go on the bottom of each support bracket to secure the TV in place won't attach because the vertical bars are in the way.   The screws that were provided  to secure the TV were either too short or too long....had to stack 4 washers just to make it work."
        },
        {
          "Note": 3,
          "Lieu": "GE",
          "Pseudo": "George Krichashvili",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T11:05:47.000Z",
          "Titre": "You may receive old version of the product when ordering from website",
          "Contenu": "I received the product from the onkron.us. I ordered Onkron G80 monitor arm. I was a bit disappointed, I received a product and it was/is indeed in working order, however the packaging wasn't the same as it was advertised or presented in most reviews found on the web. Packaging is old, with old \"Onkron\" logo, which isn't found anywhere nowadays, and arm itself had some differences. The plastic pads, for cable management, require bearings , another point to being advertised with plastic holders which doesn't require bearings, this old model however does. (It's exactly same as Gembird MA-DA1-01, even bearing points for plastic pads is the same ).Top plastic pad doesn't have \"Onkron\" logo, which made me suspicious while unpacking the product, however presented product matches everything which is shown on the old box it was provided in.It is indeed Onkron product, however very old version of it.Package came with required bearings for mounting on the table, metal however has some traces of being either used, or more likely, being old, spending ,maybe , years in the storage. Package didn't include protective pads and instruction itself. I downloaded it from website. Product is working, however be warned that shipment may be old version of ordered product which was collecting dust in the storage for years, and in my case that was grain of salt. Otherwise product does it's job well.Connecting points on product may be little too tight and may require lubricant, however so far it's great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jerry",
          "Nb_Reviews": 1,
          "Date": "2022-01-12T19:43:16.000Z",
          "Titre": "The product is well built but assembly…",
          "Contenu": "The product is well built but assembly was problematic with several screws not properly fitting in the pre tapped holes.  Final assembly was not quite level requiring additional machining of a couple of parts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Manuel Carralero",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T02:36:58.000Z",
          "Titre": "the installation instructions were not…very clear.",
          "Contenu": "the installation instructions were not very clear and the bolts and spacers did not work on my brand new Samsung 55\" TV."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "D.B.",
          "Nb_Reviews": 3,
          "Date": "2021-12-22T22:19:34.000Z",
          "Titre": "The products are Awesome",
          "Contenu": "The products are Awesome!  The problem is in the distribution.  It can take 5-10 days before the order is shipped.  If the company can get this together, then I would give them 5 stars."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carlos",
          "Nb_Reviews": 1,
          "Date": "2021-10-31T21:33:37.000Z",
          "Titre": "I had missing parts on delivery",
          "Contenu": "I had missing parts on delivery. Big reason I went with this product was to avoid this issue Amazon vendors."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 5,
          "Date": "2021-10-14T13:50:20.000Z",
          "Titre": "Great product, miserable shipping",
          "Contenu": "Miserable shipping.  The box arrived 2-days late and in tatters.  Fortunately, the contents were undamaged."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Irfan Khan",
          "Nb_Reviews": 2,
          "Date": "2021-02-22T19:15:42.000Z",
          "Titre": "Late Delivery and broken product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jimmy Chambliss",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T01:11:22.000Z",
          "Titre": "Good quality",
          "Contenu": "Quality, easy assembly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John A",
          "Nb_Reviews": 4,
          "Date": "2023-04-03T18:20:13.000Z",
          "Titre": "Worth the money",
          "Contenu": "I found the unit I received to be excellent, but not perfect. Please note that when installing the optional tilting mount there is no longer a stop to prevent the TV from sliding off the track. I plan to add a self tapping screw to the rail I also noticed at the maximum height stability is compromised. I lowered mine In the plus column I highly recommend upgrading the wheels as they are much nicer than the included ones.  The stand in white looks great in my home All in all, I am extremely pleased with my purchase and highly recommend this product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2021-08-22T21:50:26.000Z",
          "Titre": "Good but not good enough",
          "Contenu": "Strong material, can take good weight no other tv stands can do ,easy to assemble. But the shelfs are not strong enough to hold good quality AVR. Also 200 lbs includes the total of what the tv stand and the two shelf’s can take. unfortunately I could not use it because it does not take 46” wide TV carrying frame ( not mentioned in the specifications on line !!)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Billie Pearson",
          "Nb_Reviews": 2,
          "Date": "2020-11-22T17:22:22.000Z",
          "Titre": "I selected expedited shipping and there…",
          "Contenu": "I selected expedited shipping and there has been a tracking number since last Wed and the packages were not even picked up.  I didn't get any information they had shipped until today and they will not arrive until Wednesday.  That's over a week.  Disappointed. The owner called me specifically to explain the delay and so I am revising my review bc I appreciated his call and follow up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brad C",
          "Nb_Reviews": 1,
          "Date": "2020-11-03T19:50:03.000Z",
          "Titre": "Misleading information... but solid product",
          "Contenu": "Okay... I am updating my review of this stand to reflect the end result.  I originally posted a negative review because of \"misleading information\"... the order page said item would arrive in 5-7 days, and it didn't ( I called on the 5th day to find status because the shipping link showed it hadn't shipped yet).  It turns out the policy is actually 5-7 Business Days, which is pretty standard in the industry to list shipping as business days.  The product actually did end up arriving on the 7th business day.  Now that that we have the product, it is important to note it is extremely well built and will serve our needs perfectly.  Their customer was really on the ball trying to make sure we were satisfied, so kudos."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tina Morris",
          "Nb_Reviews": 1,
          "Date": "2021-07-15T15:01:23.000Z",
          "Titre": "Like the stand design",
          "Contenu": "Like the stand design and function for our school.  We did have a screw missing when assembling and ran out to Lowe's to get a substitute in the moment to complete the project on time, but ONKRON customer service reached out to right the situation."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KRR",
          "Nb_Reviews": 1,
          "Date": "2021-06-02T16:28:07.000Z",
          "Titre": "Quality Cart, Some Shipping Trouble",
          "Contenu": "TV cart was easy to assemble, instructions were fairly simple to follow, and appears to be very sturdy.  However, my order didn't ship until I contacted the company for a second time to complain.  They were generous in offering a 15% discount for the trouble."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Douglas Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T21:11:24.000Z",
          "Titre": "Buy it!I'm going to assume Onkron is the…",
          "Contenu": "I'm going to assume Onkron is the distributor, not the mfgr but if they are the mfgr this applies to them. This stand is a beast. It's heavy-duty and nice looking. It's easy to build though the directions, the print is small for these old eyes, typical for today's instructions no matter that you buy. As others have said, my only issue with it is if you want to adjust the height you have to take the TV down and unscrew the alen bolts then put it all back together. That's a design flaw IMO, it could/should be better but when you finally find the right height, you're done. Aside from that complaint would I recommend this stand, yes!POST ONKRON REPLY - Yes I saw the lifts and that'd solve a lot but they're just too expensive. Let's talk about the levelers that come extra... the handles aren't in the correct positions for tightening. IOW, one handle wouldn't tighten except on the INSIDE of the frame making it useless. I solved the problem (I hope) by removing the washer. I could've/should've added washers until the handle tightened on the outside. I have 75\" TVs coming Saturday, we'll see how it goes... So far I'm comfortable with rating this a 4-star."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Westgate Chapel Toledo",
          "Nb_Reviews": 4,
          "Date": "2022-10-19T15:19:07.000Z",
          "Titre": "Great Product!",
          "Contenu": "Everything worked for me as stated on the website. The only flaw where I would improve is that there should be a knob bolt to tighten or loosen when lifting the tv mount higher. Right now you need an allen wrench to do so."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Don Barrick",
          "Nb_Reviews": 1,
          "Date": "2022-03-28T20:43:25.000Z",
          "Titre": "Great finished product",
          "Contenu": "Great finished product.  The only problems were tolerances on bolts and holes.  I had to drill out two of the pre-drilled holes so that the bolts would fit.  Once assembled, it is a very sturdy and aesthetically pleasing tv stand."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Dunnwald",
          "Nb_Reviews": 1,
          "Date": "2021-09-08T14:02:18.000Z",
          "Titre": "Great product",
          "Contenu": "Great product.  Instructions were a little challenging and the packaging was heavily damaged when it arrived but overall I am very happy with it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Warren",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T01:51:49.000Z",
          "Titre": "Good products, but...",
          "Contenu": "Good products, I've bought two different models.However, Customer Support needs improvement. Quite unhelpful in my experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ricardo Hernandez",
          "Nb_Reviews": 1,
          "Date": "2020-12-20T05:13:44.000Z",
          "Titre": "Great product!",
          "Contenu": "Arrived quickly. Fairly easy to put together. Instructions a bit unclear but I got it figured out. Sturdy stand and works great for my workout room. I’d recommend it to friends."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yevette Brown",
          "Nb_Reviews": 7,
          "Date": "2020-11-24T01:46:22.000Z",
          "Titre": "Fast delivery and prompt replies from…",
          "Contenu": "Fast delivery and prompt replies from customer service.  I purchased a quality product that I’m very happy with"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patrick Riordan",
          "Nb_Reviews": 1,
          "Date": "2021-11-04T16:34:52.000Z",
          "Titre": "I like everything but the ability to…",
          "Contenu": "I like everything but the ability to raise and lower the TV without dissasembly.  One wheel it came with does roll freely, it is a little jenky.   Otherwise it is a very stable platform."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Onkron Customer FL",
          "Nb_Reviews": 1,
          "Date": "2021-04-06T01:21:16.000Z",
          "Titre": "Solid, practical, mobile and good looking",
          "Contenu": "A very well built solid stand. We have had it a couple of weeks now. Looks great in the living room. We have a 65\" inch skinny OLED on the 40-70\" stand. We placed it on a square plastic floor mat on top of tile. We turn it often and it rolls fine on the standard wheels - which even rolled over the tile just fine. The height adjustment is very difficult with the pop out nobs not aligning quite right. We had Geek Squad mount our TV and they had trouble changing the height even without the TV. Once mounted it was not advisable - were were unable to do it. They tried snaking the cords through the built-in cable system with no luck. After they left I tried to just put through the coax cable and couldn't even get that to go through. I used clear zip ties and Velcro wraps to \"hide\" the cords behind the stand. I also used Nano tape to apply a multi side power strip to the base. The video camera mount has two screws that are super soft and were stripped when trying to remove them to mount the plate. Fortunately Geek Squad was able to wrench it off for us. Once attached, it does not reach over our 65\" TV, but we mounted our router up there and it peeks over the top. Overall we really love the Mobile TV Stand with the two shelves. No buyers remorse so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gwen North",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T19:26:39.000Z",
          "Titre": "We are really happy with the product",
          "Contenu": "We are really happy with the product. It is working out well. The only little thing was, that some of the pieces did not go together easily. Screws would not go on, and parts were a bit bent. Other than that, it is great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mcf",
          "Nb_Reviews": 1,
          "Date": "2020-12-19T05:21:04.000Z",
          "Titre": "Almost perfect",
          "Contenu": "Almost perfect, suggest instead a soundbar attachment shelf rather than a webcam shelf and it would been perfect"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael DeLuca",
          "Nb_Reviews": 2,
          "Date": "2020-11-22T18:58:59.000Z",
          "Titre": "Poor assembly instructions.",
          "Contenu": "Nice product but the assembly instruction booklet is very poor."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Gengler",
          "Nb_Reviews": 1,
          "Date": "2021-01-11T22:57:25.000Z",
          "Titre": "The item is of good quality and was…",
          "Contenu": "The item is of good quality and was delivered in a timely manner"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Komartin",
          "Nb_Reviews": 1,
          "Date": "2022-03-12T16:58:05.000Z",
          "Titre": "Works great",
          "Contenu": "Works great.  If in doubt, go with slightly bigger device than your TV"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lawrence Y.",
          "Nb_Reviews": 1,
          "Date": "2020-12-14T22:15:33.000Z",
          "Titre": "Instructions for assembly somewhat…",
          "Contenu": "Instructions for assembly somewhat ambiguous."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather Segale",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T05:21:47.000Z",
          "Titre": "Well built",
          "Contenu": "Well built, easy to put together, solid stand for a very heavy 80\" touchscreen."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roozbeh Ayazi",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T21:13:49.000Z",
          "Titre": "It is easy to assemble and I am really…",
          "Contenu": "It is easy to assemble and I am really pleased for this product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "STEVE SILVER",
          "Nb_Reviews": 7,
          "Date": "2023-11-24T20:28:18.000Z",
          "Titre": "Website is very easy to navigate and…",
          "Contenu": "Website is very easy to navigate and checkout is super easy! Sale prices are much appreciated!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gordon Hinkle, President CESI",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T21:19:02.000Z",
          "Titre": "great job - just what we needed!",
          "Contenu": "great job!  Exactly what we needed!  Delivered earlier than anticipated!  Look forward to doing work together in the future!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Montgomery",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T23:06:28.000Z",
          "Titre": "I really like your product",
          "Contenu": "I really like your product, but the instructions gave some either/or options and didn't say why one should be chosen over the other.  Also, I have a major brand of tv (LG) but the spacers to connect bracket to the TV were either too short or too long.  I had to use extra spacers to make it fit properly."
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "souhaib rahouani",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T21:26:37.000Z",
          "Titre": "watch now",
          "Contenu": "If you're looking for a reliable IPTV provider, I highly recommend [resm-tv.com]. 5 stars!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "STEVE SILVER",
          "Nb_Reviews": 7,
          "Date": "2023-08-17T23:20:42.000Z",
          "Titre": "Super easy website  to navigate",
          "Contenu": "Super easy website  to navigate! Great products, fast shipping! We have stoped purchasing from other cart manufactures!  Im an actual customer, not paid a dime for my thoughts!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel OMalley",
          "Nb_Reviews": 1,
          "Date": "2021-10-18T17:38:52.000Z",
          "Titre": "Mobile TV Stan",
          "Contenu": "Received the TV stand in well packaged undamaged box containing all necessary  parts.  Easy to assemble once I got my magnifying  glass out to see the tiny  detail of small parts orientation in the assembly directions.  Must have been done by young eyes or only on a monitor.  TV stand is working well.  I would like to see some accessory tray mounts for holding power supplies for cable management. The access points were too far apart to accommodate the power cable lead from the power supply to the Sony power input location."
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "Matthew Ramdeen",
          "Nb_Reviews": 2,
          "Date": "2023-07-19T14:46:00.000Z",
          "Titre": "Quality unit!",
          "Contenu": "Shipping was quick, item arrived in tact. Item exactly as pictured and setup was easy with the video. This is a quality unit with minimal flex and slop. Only wish Onkron swapped out the Philips head screws with allen key screws so that I wouldn't need to go looking for another tool."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2022-02-28T19:29:29.000Z",
          "Titre": "Purchased the ONKRON Gaming Monitor…",
          "Contenu": "Purchased the ONKRON Gaming Monitor Desk Mount 13-34 Inch with RGB Smart Lighting GM25 White × 1. Excellent Mount, I have a 34\" widescreen panel, the perfect fit. The RGB lighting looks great, especially if you're trying to compliment an RGB lit keyboard and mouse or even a PC. Highly recommend this mount. Strong and sturdy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Price",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T17:53:31.000Z",
          "Titre": "Very grateful that we found the Onkron…",
          "Contenu": "Very grateful that we found the Onkron TV stand. We needed a solution to implement in our warehouse that would enable our staff to participate in the company calls and a solution we could roll around for presentations. This product was easy to put together, feels sturdy, and worked very well. We are extremely pleased with the product & reasonable shipping times."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenson K",
          "Nb_Reviews": 1,
          "Date": "2022-06-20T23:51:46.000Z",
          "Titre": "I purchased the mobile TV stand TS2771",
          "Contenu": "I purchased the mobile TV stand TS2771. Very smooth ordering experience. Product arrived without any damage. I had ordered swivel caster wheels too, thinking that stand wouldn't come with it. But the stand does come with wheels.  I raised a return request for that extra wheels through online chat and it was very straight forward and fast. Assembling took less than 30min. Great product and customer service."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "matthew fryer",
          "Nb_Reviews": 5,
          "Date": "2021-11-02T19:08:21.000Z",
          "Titre": "TS1551 very pleased",
          "Contenu": "Ordered the TS1551, very good quality, easy to assemble,  very pleased with purchase.Needed something to allow me to move a 65inch tv at home, ideally I wanted this stand with a TV cabinet at the bottom, but nobody seems to make anything like this. Using it at home means I need it at its lowest setting, only down side is the cable routing holes are not visible at the top, minor point.Think you need to speak with UPS, they left it outside rang the bell and went, van had gone by the time I got to the door."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angel Ibarra",
          "Nb_Reviews": 2,
          "Date": "2022-03-18T14:54:36.000Z",
          "Titre": "Second Purchase of same model stand",
          "Contenu": "We purchased the ONKRON Mobile TV Stand TV Cart for 40” – 70 inch Screens up to 100 lbs, TS15-51 Black for our church ministry. It was our second purchase for the same model. The quality, the features it offers are no comparison to other brands that are more expensive and do not offer the stability you need in a stand like this. i would definitely purchase again and also recommend this mobile stand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynnette Consego",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T23:29:00.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Customer Service was very helpful when our order got sent back.  Response time to my inquiry as to why it had been returned and what I needed to do get another one sent, was quick (even though my email was sent over the weekend). Your staff answered all my questions and got a replacement order back out to us immediately. We had the TV stand within 4 days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joey B.",
          "Nb_Reviews": 3,
          "Date": "2023-06-06T15:12:52.000Z",
          "Titre": "Mobile Stand for 86\" TV.",
          "Contenu": "The mobile TV stand we purchased was exactly as advertised and a great product.  It arrived quickly and wasn't hard to assemble.  Will definitely purchase again in the future.  The stand is much sturdier than I expected with an 86\" TV on it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sallie",
          "Nb_Reviews": 1,
          "Date": "2021-11-05T19:41:14.000Z",
          "Titre": "I needed a stand exactly like the one…",
          "Contenu": "I needed a stand exactly like the one Onkron was offering.  Oh My Gosh is it ever perfect.  Good strong quality - AND - I was able to put it together myself.  Granted the written instructions were for someone used to assembling furniture,  I guess, but the accompanying pictures were very clear & easy to understand.The stand I purchased was for a 77\" TV - and this stand is perfect for it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Paonessa",
          "Nb_Reviews": 8,
          "Date": "2022-07-19T01:58:27.000Z",
          "Titre": "Great product",
          "Contenu": "Great product!  But please take it from an experienced DIY assembler of many things…….use actual photographs along with line drawings in your instructions……everyone will thank you! 😀"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan at Kawa Orthodontics",
          "Nb_Reviews": 1,
          "Date": "2022-01-17T16:09:13.000Z",
          "Titre": "Great product and great customer service",
          "Contenu": "I have 25 of these around our Orthodontic Practice holding up 24' monitors and I can tell you they work great for our needs. We had some construction done and lost one of the back plates. I reached out to customer service and they replaced the mount for me free of charge. I highly recommend doing business with this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Associated Construction Eng. I",
          "Nb_Reviews": 1,
          "Date": "2021-04-28T16:51:16.000Z",
          "Titre": "Great customer service",
          "Contenu": "Most of the time you have to jump through hoops to return an item, We didn't need the heavy duty casters and it only took one email to have the return label sent to me and only a matter of days to see the credit on the credit card.Onkron is great to work with and if we need any more conference room furniture or equipment we will definitely use them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Satisfied Customer",
          "Nb_Reviews": 2,
          "Date": "2020-10-30T23:45:52.000Z",
          "Titre": "I purchased 2 mobile stands",
          "Contenu": "I purchased 2 mobile stands. One was perfect and the other was drilled wrong. Onkron reviewed the pictures I sent and immediately sent the correct piece. They are professional, helpful and are easy to work with. Would definitely recommend their high quality products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B Campy",
          "Nb_Reviews": 1,
          "Date": "2020-12-12T21:56:07.000Z",
          "Titre": "NP47 wall mount kit",
          "Contenu": "The product is very nice, well made. I did have a problem with one of the mounting rails, the weld was manufactured incorrectly. After contacting them they were very helpful in getting it resolved. The only negative I have is in their communication, after contacting them on the bad rail I didn’t get any notification that it was being sent, I was left in the dark for a week. I do have to say the original product order had great communication."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TL",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T22:00:04.000Z",
          "Titre": "Very good product.",
          "Contenu": "Very good product.Well built, sturdy, easily adjustable and presentable.Buying another one for our meetings. 75\" TV looks impressive on it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JC Joe",
          "Nb_Reviews": 1,
          "Date": "2021-07-08T04:33:57.000Z",
          "Titre": "Great customer service and support!",
          "Contenu": "Onkron's website is great but I had a couple of questions I wanted to ask before I placed my order.  I was able to communicate quickly with a human and get clear answers to my questions, which gave me confidence that I was ordering the correct model and parts for my situation.  Very easy and smooth process!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "js",
          "Nb_Reviews": 1,
          "Date": "2022-11-25T22:55:10.000Z",
          "Titre": "Good product",
          "Contenu": "Good product, better than advertised.Works well. Assembly instructions could have been easier with written instructions when it came to all the hardware supplied, and not needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cass",
          "Nb_Reviews": 2,
          "Date": "2021-12-12T14:23:48.000Z",
          "Titre": "I ordered a white rolling tv cart",
          "Contenu": "I ordered a white rolling tv cart. It simple to order, good quality, simple to put together, well worth it. Only thing is that I ordered it in white and received a black stand. Customer service was excellent and responded quickly to resolve. They offered refund or replacement. I put it together and really liked it and decided to keep the black stand. Shipping was quick and on time as expected. I Love it and have recommended this product to others. I will be returning for future purchases. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "s.e.",
          "Nb_Reviews": 1,
          "Date": "2022-08-12T17:29:21.000Z",
          "Titre": "Easy, no hassle, fast turn-around replacement part",
          "Contenu": "1. Came with a part broken during transit. The instructions came with an obsolete email address but once I found a correct one online it was an easy, no hassle, fast turn-around for the replacement part. 2.The first shelf I installed was defective but I didn't know it until after I had man-handled it into place. The rest of the shelves were easy. I would buy from them again and if something was hard to make fit I would call cust. service right away now that I know their products are good and their service is good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Guy D",
          "Nb_Reviews": 3,
          "Date": "2022-02-12T22:49:14.000Z",
          "Titre": "This is my second monitor mounting…",
          "Contenu": "This is my second monitor mounting device.  The first was a single monitor,but I recently started a new job that required a second monitor.  Just like the first, the instructions were impeccable and easy to follow.  I had the two monitors up in 10 minutes.Thank you,Guy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Strohecker",
          "Nb_Reviews": 1,
          "Date": "2022-03-11T16:19:46.000Z",
          "Titre": "I was pleased with my experience…",
          "Contenu": "I was pleased with my experience because, you had the item that I needed.I got personalized assistance in ordering and shipping.The price was reasonable.In spite of current difficulties with shipping the product arrived  within the stated time frame."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlene Blevins",
          "Nb_Reviews": 1,
          "Date": "2020-12-27T22:47:58.000Z",
          "Titre": "Bought this product for my daughter…",
          "Contenu": "Bought this product for my daughter whose 14 for Christmas. She has a small room and needed to have mobility in case she wants to rearrange or clean easier. I love the stands durability but wish the shelves were a durable metal as well. Other than that, it is a awesome shelf."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mollie Hammonds",
          "Nb_Reviews": 2,
          "Date": "2021-11-15T02:49:54.000Z",
          "Titre": "Received my television stand promptly",
          "Contenu": "Received my television stand promptly. One of the towers was defective. I called Onkron twice regarding the issue. Following the second call I received 2 new towers that were overnighted to me. Great service and response to my issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AJS",
          "Nb_Reviews": 2,
          "Date": "2021-12-20T01:53:38.000Z",
          "Titre": "Perfect TV stand for my garage workout…",
          "Contenu": "Perfect TV stand for my garage workout area that I can pull around to my outdoor bar when enjoying the outdoor patio.  I mounted a goal zero battery on it and can move it anywhere I want without cords!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Derrick Heard Heard Technology",
          "Nb_Reviews": 1,
          "Date": "2021-03-30T22:25:52.000Z",
          "Titre": "It has a steel frame, I love it",
          "Contenu": "I bought a tv stand from Onkron and I couldn’t be more happier, it literally free up lots of space in my house... if you want the option to move your tv around your house I suggest getting a tv stand from onkron with the steel frame"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ian McCallum",
          "Nb_Reviews": 5,
          "Date": "2022-03-02T21:08:55.000Z",
          "Titre": "All good TV stands - solidly made",
          "Contenu": "All good, have now bought several Onkron TV stands (for work) over time - 3 different models sizes and all have been well made and feel safe for the TVs that are on them, including 75\" ones."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry  Thompson",
          "Nb_Reviews": 1,
          "Date": "2020-12-03T22:59:35.000Z",
          "Titre": "Ok I just received the cart it has been…",
          "Contenu": "Ok I just received the cart it has been setting in the our warehouse for two weeks. I started putting it together, some of the directions could be a little more clearer and larger and someone  needs to clean up with a file after  the aluminum parts our  stamped out, I cute a finger open on the bottom of it. A few of the holes wore a little misthreaded. All in all We Like the cart we do not have the the new TV at this time as soon as it comes in and we mount it. I will send another review. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy",
          "Nb_Reviews": 5,
          "Date": "2022-04-09T20:19:20.000Z",
          "Titre": "Unbelievable product",
          "Contenu": "Unbelievable product!  Description didn’t do it justice. Super easy to assemble, sturdy yet really light and easy to move around outside. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DWH",
          "Nb_Reviews": 5,
          "Date": "2021-11-29T21:43:14.000Z",
          "Titre": "Outstanding experience.",
          "Contenu": "The AV stands are of excellent quality. The AV carts/stands met the needs of the conference room requirements and exceeded the architectural requirements of the building. Which is a tall order.Customer service: The ONKRON personnel exceeded all my expectations. My expectations are extremely high. We needed these cart/stands immediately for a company presentation to high level stake holders.The closest inventory was 900 miles away. ONKRON and their fulfillment center proactively drove this process with the carrier to get it to site in time for setup.   Everyone is currently experiencing supply chain delivery issues. ONKRON ownership worked  solutions so outside the box in order to meet commitments.  Great effort! Great product! Great job!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed from New orleans",
          "Nb_Reviews": 1,
          "Date": "2020-11-15T12:39:14.000Z",
          "Titre": "Ordered the wrong size stand for a very…",
          "Contenu": "Ordered the wrong size stand for a very large TV. Didn't realize it until after it had shipped to my house. Folks from Onkron where great, stopped the shipment and helped me re order the correct stand. Excellent customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diana Casas",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T19:10:21.000Z",
          "Titre": "Best purchase ever.",
          "Contenu": "Product is well made, very sturdy,can handle weight capacity of television, like how I could easily move it around myself."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darek Barczynski",
          "Nb_Reviews": 1,
          "Date": "2020-10-30T18:55:15.000Z",
          "Titre": "Very good TV carts",
          "Contenu": "I've purchased 3 different types of TV carts (for different size TV's in our office)They are all very good products, easy to assemble, easy to maneuver.I strongly recommend those products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 5,
          "Date": "2021-01-02T17:33:09.000Z",
          "Titre": "Really nice BUT.....",
          "Contenu": "Maybe a bit on the \"not very clear\" on the assembly instruction paper, but I used the youtube video to help clarify some of the installation.  But it looks nice, rolls easily and seems well built."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "STEVE SILVER",
          "Nb_Reviews": 7,
          "Date": "2020-12-24T21:18:04.000Z",
          "Titre": "I sent you an e-mail",
          "Contenu": "We have been buying from Onkron for over a year! Their website is easy to use and their Customer Service is extremely responsive! I strongly recommend Onkron's  line of TV Monitor stands!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Omar Valenzuela",
          "Nb_Reviews": 1,
          "Date": "2022-04-29T21:54:57.000Z",
          "Titre": "Fantabulous and customer-centric support!",
          "Contenu": "I called and received exceptional customer service and support. They were so kind and helped answer all my questions and eased my worries and concerns. I love my TV stand, and I plan to order more in the future. Love them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leon",
          "Nb_Reviews": 2,
          "Date": "2022-02-22T18:52:08.000Z",
          "Titre": "EXCELLENT AFTER-SALE CUSTOMER SERVICE",
          "Contenu": "I had problems with an order, but Tiffany's after-sale customer service was really excellent and came up with an acceptable solution. Now I'm just waiting for everything to progress as she said."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Rose",
          "Nb_Reviews": 1,
          "Date": "2022-02-23T21:07:20.000Z",
          "Titre": "Great service and promt response to…",
          "Contenu": "Great service and promt response to delivery issue.  One (1) of the three (3) packages in the shipment got lost. I called customer service and within two (2) days new shipment was on it's way.Thanks!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Casey Jones",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T03:17:56.000Z",
          "Titre": "The rolling tv stand is solid and moves…",
          "Contenu": "The rolling tv stand is solid and moves easily. We've had complements on the nice look.Customer service went above and beyond.  Caught that I'd ordered the wrong shelf for my stand and email then sent the right one in a few days.Amazing. Casey"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 8,
          "Date": "2021-12-28T02:02:54.000Z",
          "Titre": "Bought a TV stand to put our bedroom TV…",
          "Contenu": "Bought a TV stand to put our bedroom TV at the foot of our bed. When received there was a couple of minor defects, they completely replaced the entire part. No stalling.  Thanks for a awesome experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce Heseltine",
          "Nb_Reviews": 1,
          "Date": "2021-05-08T12:11:56.000Z",
          "Titre": "Exactly what we wanted",
          "Contenu": "Exactly what we wanted.  Using the tv stand on our covered patio.  The set screws on the uprights interfere with routing cables through the uprights.  Other than that, good product, loved the assembly video. Nice job!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Burley",
          "Nb_Reviews": 2,
          "Date": "2021-02-26T11:08:43.000Z",
          "Titre": "On a roll",
          "Contenu": "Clearly the best thing for any TV. Sturdy, attractive, practical and a real problem solver, all at a reasonable price. No TVs falling off a wall or table. Easy to move from room to room. American made. One of the best things I've purchased in a long time. Don't think about it, just buy it..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roy Carter",
          "Nb_Reviews": 1,
          "Date": "2020-10-30T03:08:29.000Z",
          "Titre": "The product is great and solid.",
          "Contenu": "The product is great and solid. Worth the price and I would buy another if this one ever goes down. Only issue was the shipping. I was given a delivery date that changed 3 times before I received the product. This is no reflection on the product or the company. Just the shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff HM",
          "Nb_Reviews": 3,
          "Date": "2021-10-04T03:40:32.000Z",
          "Titre": "I bought and assembled and use almost every day the TS15-51TV cart",
          "Contenu": "I ordered the TS15-51 Black ONKRON Mobile TV Stand TV Cart for 40” – 70\".   Onkron claims it will handle screens up to 100 lbs.  I believe them. It's a fabulous tv cart, very strong and stable.  Moving my 55\" screen from room to room is easy.  Setup was a little difficult - check online resources and/or call Onkron.  Overall a 5+"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bethany Besore",
          "Nb_Reviews": 1,
          "Date": "2021-06-21T02:25:29.000Z",
          "Titre": "This is our second purchase",
          "Contenu": "This is our second purchase. Well made, excellent balance and sturdy. Easy to assemble. The locking wheels REALLY lock nice and tight. Great product-USA made. Win-win."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Neagle",
          "Nb_Reviews": 1,
          "Date": "2020-12-24T12:21:43.000Z",
          "Titre": "Very timely responses to emails",
          "Contenu": "Very timely responses to emails. Support staff very knowledgeable on product portfolio.  Very happy with the item I purchased,  would definitely recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg Custer",
          "Nb_Reviews": 1,
          "Date": "2021-11-29T14:38:24.000Z",
          "Titre": "This is an amazing quality product",
          "Contenu": "This is an amazing quality product, however the instructions for putting it together were a disaster. Even after watching multiple videos on YouTube I still had trouble putting it together."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2022-07-28T13:44:34.000Z",
          "Titre": "A True TV Stand",
          "Contenu": "I was impressed how quickly the TV stand came and with the A+ build quality. It's a strong and stable stand. The only issue is that I wish that I'd picked a different stand due to some of the accessories that it has that this one doesn't have. Other than that, \"it's perfect\"."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerald Flinchbaugh",
          "Nb_Reviews": 2,
          "Date": "2022-03-07T00:06:20.000Z",
          "Titre": "I had a great customer experience with…",
          "Contenu": "I had a great customer experience with ONKRON! There is absolutely no doubt in my mind where I will go for similar products in the future. I am very impressed with the TV Stand, accessories, delivery, and customer service, and competitive pricing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ray Duke",
          "Nb_Reviews": 1,
          "Date": "2021-05-02T22:22:00.000Z",
          "Titre": "I had ordered one earlier and liked it…",
          "Contenu": "I had ordered one earlier and liked it so well that I ordered another one. Very pleased with the promptness of the purchasing process and the shipment as well. This is a great product and I will recommend it to everyone I can."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Uch",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T21:20:55.000Z",
          "Titre": "After completing my research",
          "Contenu": "After completing my research, I found out Onkron as follows:1. Price is the lowest 2. Material is strong ( Alloy steel )3. Experience is excellent ( Customer service, shipping and delivery )4. However the assembly instructions could and should be improved"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 1,
          "Date": "2020-12-23T16:36:32.000Z",
          "Titre": "Versatile",
          "Contenu": "Versatile, substantial, easy to assemble, came with plenty of spare parts (nuts, bolts, screws, etc.) Would purchase again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Dominguez",
          "Nb_Reviews": 2,
          "Date": "2020-10-30T03:23:54.000Z",
          "Titre": "Great design and well made product",
          "Contenu": "Great design and well made product. Easy to assemble. Adjustable height is easily available. I would recommend buying one and the price reasonably good 👍 R M D"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Drew",
          "Nb_Reviews": 1,
          "Date": "2022-03-03T10:19:11.000Z",
          "Titre": "Faultless from start to finish",
          "Contenu": "The service was faultless from start to finish. I even requested a VAT invoice after the product had arrived and this was supplied within 24hrs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Loyal customer",
          "Nb_Reviews": 2,
          "Date": "2022-10-16T16:37:44.000Z",
          "Titre": "Very sturdy, worth the money.",
          "Contenu": "This is a very sturdy tv stand.We needed something to move our tv from outside to inside when we where not using it, & this works perfect.I would highly recommend!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol Caffee",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T22:09:26.000Z",
          "Titre": "Great customer service",
          "Contenu": "I was able to chat with a specialist to ensure my tv would fi to and all specs needed were answered.  It is very sturdy.    It was shipped very quickly and easy to put together with a helper to hold things as I bolted them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy Camper",
          "Nb_Reviews": 1,
          "Date": "2020-10-23T13:38:54.000Z",
          "Titre": "We needed a particular model that was…",
          "Contenu": "We needed a particular model that was out of stock and the Onkron team was amazing to let me know when it would be back in stock so we could purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Walton",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T22:45:18.000Z",
          "Titre": "Easily found what I needed,loved the…",
          "Contenu": "Easily found what I needed,loved the price and quick shipping. Definitely be back to order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shari B.",
          "Nb_Reviews": 1,
          "Date": "2020-10-23T16:22:17.000Z",
          "Titre": "Extremely durable",
          "Contenu": "Extremely durable, well-packed and clearly labeled.  Only thing I would change is to make the “zoomed-in” details of the instructions larger."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Moore",
          "Nb_Reviews": 1,
          "Date": "2020-10-23T12:18:29.000Z",
          "Titre": "Very happy with this product",
          "Contenu": "W were in need of some portable stands that would hold a 75 inch screen and its sound bar. While the stands may not look at heavy duty as you would think, they have performed well and I am very pleased with our purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rao",
          "Nb_Reviews": 4,
          "Date": "2023-06-11T16:24:34.000Z",
          "Titre": "Customer Service has been exceptional",
          "Contenu": "Customer Service has been exceptional. Both Julia and Tim have been very responsive to my issues. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Niko Deleon",
          "Nb_Reviews": 2,
          "Date": "2022-07-12T15:43:49.000Z",
          "Titre": "I really enjoy this product",
          "Contenu": "I really enjoy this product, unfortunately the base was a bit bent upon delivery and one of the front caps was broken off at the base. Even with that I give it five stars. Definitely buy the upgraded wheels though. They are very well made :)! I am glad I got the wheels."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Henry McKie",
          "Nb_Reviews": 1,
          "Date": "2020-10-23T01:55:41.000Z",
          "Titre": "Awesome customer service",
          "Contenu": "Awesome customer service.  I was missing a piece...I took a picture of the instructions, sent it to the info email, and within 36 hours, I had the missing part in my hands.  Brilliant."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-09-29T17:40:23.000Z",
          "Titre": "Got exactly what I expected lightning…",
          "Contenu": "Got exactly what I expected lightning fast, had to adjust the tension on the mounting arm a little bit in order to counteract some sag but works perfectly now"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Bizanovich",
          "Nb_Reviews": 1,
          "Date": "2021-10-05T19:16:05.000Z",
          "Titre": "I'd never used your products before but…",
          "Contenu": "I'd never used your products before but will again. The mount/stand is very well built and sturdy. The add-on casters made rolling on a wood deck and brick sidewalk easy. Your instructions were very easy to follow too. Great product!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "TANS",
          "Nb_Reviews": 3,
          "Date": "2022-03-03T12:58:36.000Z",
          "Titre": "Would use again",
          "Contenu": "Great communication from start to finish of transaction. Great product - exactly as described and just what we needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom in Michigan",
          "Nb_Reviews": 2,
          "Date": "2021-09-22T21:43:36.000Z",
          "Titre": "Solid stand",
          "Contenu": "Solid stand. Easy to assemble. I needed something for an 86\" TV, but they are hard to find. Even though this one was rated up to 83\", it fit easily. Just needed to make sure of the A&B hole distances and of course the weight rating. It rolls smoothy and the locking wheels are nice. It does everything I need it to do. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Beattie",
          "Nb_Reviews": 1,
          "Date": "2022-07-25T22:25:53.000Z",
          "Titre": "Tv stand service",
          "Contenu": "Stan was extremely outstanding in helping Me with my T.V. stand.  He went the mile and beyond to see I had everything I needed.  Recommend Onkron ?  110% Yes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg Jenkins",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T22:07:15.000Z",
          "Titre": "Lots of options",
          "Contenu": "I like the options you have. They are not overly expensive. Shipping is pretty quick. Faster than advertised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Little",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T23:06:38.000Z",
          "Titre": "Excellent product...instructions were…",
          "Contenu": "Excellent product...instructions were good...loads of compliments..expensive but well worth it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darin Lindgren",
          "Nb_Reviews": 1,
          "Date": "2022-04-19T14:11:56.740Z",
          "Titre": "Product arrived in a timely fashion and…",
          "Contenu": "Product arrived in a timely fashion and was easy to assemble. Worked perfectly for our application."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "paige du",
          "Nb_Reviews": 3,
          "Date": "2023-06-29T14:02:50.000Z",
          "Titre": "you will be very pleased with their TV stand & service!",
          "Contenu": "we bought a TV stand from ONKRON for our new 75 inches TV, I must say you pay what you get! after amazon a cheaper version stand failed us, we have to consider something more expensive, as it was less than £100, it almost smashed the 2grand tv, the screw was bending when we put the tv on, everything tipped forward, good job my hands didn't leave the tv. after that episode, we found ONKRON, the price is not the best, but it worths every penny, the quality is super, although unavoidably there is a crack on the plastic part during transport, Kate was so helpful, we had sent over the photo the issue part, it was sorted after consulting the specialist, the metal frame is so sturdy, even we move around, it is not wobbly at all, super strong, so by our Experience , you already paid that much for the bigger TV, invest a bit more straight to get something more expensive,  not like us, thats a lesson we learned."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard  Flores",
          "Nb_Reviews": 1,
          "Date": "2021-07-30T04:33:39.000Z",
          "Titre": "Excellent product",
          "Contenu": "Excellent product, I purchased tripod TV Stand. Simple installation of stand with TV and they provide additional cable management material that was very useful. Very satisfied with my purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Thomas",
          "Nb_Reviews": 2,
          "Date": "2021-10-06T17:14:38.000Z",
          "Titre": "This stand is beautiful and built to…",
          "Contenu": "This stand is beautiful and built to last. Super easy to assemble, looks awesome in my family room"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Bryan",
          "Nb_Reviews": 1,
          "Date": "2021-05-15T19:39:57.000Z",
          "Titre": "We are very satisfied and happy with…",
          "Contenu": "We are very satisfied and happy with the TV cart, worked perfectly for the limited space we had to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet Griffith",
          "Nb_Reviews": 1,
          "Date": "2021-09-06T01:02:40.000Z",
          "Titre": "TV Stand",
          "Contenu": "My TV stand came very quickly and I put it together myself.  Directions were easy to follow.  I'm very please with this product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronald Holladay",
          "Nb_Reviews": 1,
          "Date": "2021-06-30T14:52:30.000Z",
          "Titre": "Excellent quality",
          "Contenu": "Very quick ordering, ease of assembly, and ease of use made this product ideal for our purposes!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T19:02:39.000Z",
          "Titre": "Great product",
          "Contenu": "Great product!  It came with a 5% discount and free shipping!  It took me only 10 min to assemble the cart.  The material is sturdy and it looks great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynn",
          "Nb_Reviews": 2,
          "Date": "2021-04-20T14:45:51.000Z",
          "Titre": "Watch the videos to make assembly easy",
          "Contenu": "Watched the videos and assembled it without any problems. Ordered the optional casters, which are great. Also bought the tilt option. It is used for a 75 inch TV and is very stable. Great purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rich B.",
          "Nb_Reviews": 2,
          "Date": "2020-11-09T18:24:25.000Z",
          "Titre": "Products are Fantastic and this is the most customer-centric Company Ever!!!",
          "Contenu": "TV stand is a fantastic product, with easy to follow directions. It is very sturdy and well made. Great company. Would not hesitate to do business with them again.PS. Onkron knocked my doors off with the best example of customer-centric service I have ever seen. When I purchased the above described TV stand, I also purchased a nifty little battery-powered LED light, the D-4. After some use I discovered that the battery life was not sufficient to my intended use for the light, a full day desk lamp, though it was a very useful light for many other purposes. I mentioned this to Onkron in passing. Within a day, I received an email from them apologizing that the light did not meet my needs and they wrote that they were sending me out a different LED lamp, the DA5, that might suit my needs better. Without Charge!! It arrived on Friday and I have test-driven it for a few days now and it is a fantastic product. It uses a supplied AC Adaptor and has 3 separate dimmable color temperatures including a fantastic daylight setting. In addition, it has a separate 2-way LED on the column for additional ambient light which also can serve as a nightlight. It is almost infinitely adjustable and works perfectly. You just don't see this kind of attention to the customers in other companies. Whatever my needs for cool products in the future, I will be checking with Onkron first to see if they have a suitable product before going anywhere. By the way, if they had just pointed out this product to me, I would have gladly purchased it and still thought this was a great company. I also want to confirm that this is my own true and independent review and that there was no agreement to provide a positive review in return for the new lamp. They actually put the order in before they even sent me the reply email."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Gugel",
          "Nb_Reviews": 1,
          "Date": "2022-11-25T21:02:02.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "My 1st shipment never arrived, and Onkron sent a replacement shipment quickly and no charge."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "STEVE SILVER",
          "Nb_Reviews": 7,
          "Date": "2022-03-24T22:14:00.000Z",
          "Titre": "We have had great service from this…",
          "Contenu": "We have had great service from this vendor. The new \"heavy duty\" cart wheels are definitely worth the extra cost."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Straszheim",
          "Nb_Reviews": 2,
          "Date": "2022-07-14T23:54:40.000Z",
          "Titre": "The product was delivered on time and…",
          "Contenu": "The product was delivered on time and met our expectations.  Assembly was straightforward and resulted in a robust portable monitor stand"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "john collins",
          "Nb_Reviews": 2,
          "Date": "2021-04-14T18:36:33.000Z",
          "Titre": "This product is of a good quality and…",
          "Contenu": "This product is of a good quality and assembly was easy and durable for our application and have no issues whatsoever and would recommend this product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Hurt",
          "Nb_Reviews": 1,
          "Date": "2022-01-08T20:27:13.000Z",
          "Titre": "Onkron TS1551 Mobile TV stand",
          "Contenu": "The television stand/cart is robust, well engineered and of excellent quality. Although I had some issues with the assembly Onkron customer service was exemplary. I would recommend Onkron’s products for anyone who desires a professional quality mobile television stand."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Clifford Stone",
          "Nb_Reviews": 70,
          "Date": "2022-02-22T11:43:52.000Z",
          "Titre": "Very quick and efficient customer…",
          "Contenu": "Very quick and efficient customer service. Very high quality products. Worth the extra expense!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbie Strickland",
          "Nb_Reviews": 2,
          "Date": "2020-10-30T15:47:36.000Z",
          "Titre": "Love it",
          "Contenu": "Love it! I put the shelf on backwards, and use it for presentations, with my laptop facing backwards.  It is heavy, but still mobile."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Saunders",
          "Nb_Reviews": 2,
          "Date": "2021-05-02T00:01:15.000Z",
          "Titre": "Onkron monitor/TV stand",
          "Contenu": "The Onkron unit I purchased is well built, stabile, easy to maneuver and easy to assemble."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth Harkins",
          "Nb_Reviews": 2,
          "Date": "2021-06-18T16:08:44.000Z",
          "Titre": "The product was as described",
          "Contenu": "The product was as described, in brand new condition, and delivered on time. I was able to do what it promised it could."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Church Tech MK",
          "Nb_Reviews": 2,
          "Date": "2022-01-10T02:06:59.000Z",
          "Titre": "One of the uprights had one hole that…",
          "Contenu": "One of the uprights had one hole that wasn't properly tapped. Customer service responded immediately and sent out two replacements."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara",
          "Nb_Reviews": 1,
          "Date": "2020-10-30T00:01:14.000Z",
          "Titre": "Very happy w /",
          "Contenu": "Very happy w /product.. my brother messed up put together phone call allowed me to fix everything thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Larson",
          "Nb_Reviews": 1,
          "Date": "2021-05-05T21:40:47.000Z",
          "Titre": "Good description of TV wall mount",
          "Contenu": "Product was well described on webpage and arrived within the delivery date."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J Gregory Milmoe",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T04:24:27.000Z",
          "Titre": "The TV stand arrived when promised",
          "Contenu": "The TV stand arrived when promised,  was (reasonably) easy to assemble - the directions required very careful focus - and the assembled stand works wonderfully."
        }
      ]
    }
  ]
}