{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "onlinenotarycenter.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Miller",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T06:46:49.000Z",
          "Titre": "I only needed the page where our signatures are signed, and I find it unreasonable to pay for a page I don't need or accept.",
          "Contenu": "Session ID: a50cf32d-9a9b-11ee-addc-3ca82a232fcaDear Online Notary Center,I recently received my bill for $150 and noticed a charge of $50 for a seal on a blank page. I want to clarify that during the session, I was not informed about this additional cost. I only needed the page where our signatures are signed, and I find it unreasonable to pay for a page I don't need or accept.I kindly request that you review my email and rectify the situation by adjusting the bill accordingly. It is important for the notary to clearly explain any extra charges before proceeding with the service.Thank you for your attention to this matter. I look forward to your prompt response and resolution."
        },
        {
          "Note": 1,
          "Lieu": "PA",
          "Pseudo": "Kenneth Z.",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T21:49:57.000Z",
          "Titre": "Cannot open the zip file on FOUR different computers!",
          "Contenu": "I completed the process and was emailed the signed and notarized form; however, the form was emailed to me in the form of a \"zip\" file, which I cannot open on four different computers.  When I attempted to call the company at 3:45 pm est on a Thursday, I get a recording that the company is currently closed.  I am very frustrated, as I urgently need to provide someone with this form."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T21:54:08.000Z",
          "Titre": "I need a picture to be added to the…",
          "Contenu": "I need a picture to be added to the document AT THE TIME THE notary was signing it, and it could not be done with the notary I was working with."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T07:31:40.000Z",
          "Titre": "My form wasn’t filled out completely",
          "Contenu": "My form wasn’t filled out completely. Didn’t know until after I payed for it but the last section needed completion as well and didn’t know it wasn’t"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T17:17:14.000Z",
          "Titre": "Do your research",
          "Contenu": "Notary (the expert) didn't inform me that my documents needed original signatures. So, I'm sure I agreed to not ask for a refund. Don't use."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Willystyle1979",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T19:09:18.000Z",
          "Titre": "The service was incomplete and I got…",
          "Contenu": "The service was incomplete and I got charged twice"
        },
        {
          "Note": 1,
          "Lieu": "DO",
          "Pseudo": "Jodi",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T23:35:29.000Z",
          "Titre": "I had to notarize my document twice…",
          "Contenu": "I had to notarize my document twice because the first person who did it didn’t fill out the form properly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ashley customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T18:30:31.000Z",
          "Titre": "I was unable to use the form for the…",
          "Contenu": "I was unable to use the form for the notary so I basically wasted my money and time"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T11:23:24.000Z",
          "Titre": "The courts do not accept e-signatures",
          "Contenu": "The courts do not accept e-signatures. I was told that they do. $25x4=$100 for 5 minutes."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "bart",
          "Nb_Reviews": 1,
          "Date": "2022-10-07T21:52:15.000Z",
          "Titre": "The notary did not complete my form…",
          "Contenu": "The notary did not complete my form correctly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T02:47:15.000Z",
          "Titre": "I was charged for 2 signs and seals…",
          "Contenu": "I was charged for 2 signs and seals when in fact it was only 1"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lesley Roth",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T15:08:58.000Z",
          "Titre": "overcharged",
          "Contenu": "My wife signed a 2 page document. I signed the same 2 page document. we were charged for 4 documents, with 2 signatures per document."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Business Owner",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T21:13:42.000Z",
          "Titre": "Glitchy and Incorrectly Priced",
          "Contenu": "The system was very glitchy and wouldn't take the documents I was trying to upload. When it finally did, and I connected with a Notary, I explained that the system was malfunctioning and I only needed one of the documents signed. He said he understood, and to work around the system, he would complete all of them \"just in case\". After signing, he disconnected and charged me 3x the published amount. After wasting 45 mins to get one signature, I just gave up and paid so I could download the doc."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Renae Irek",
          "Nb_Reviews": 2,
          "Date": "2023-07-17T19:48:02.000Z",
          "Titre": "Extra FEES not disclosed",
          "Contenu": "My signature needed to include my first name and middle name and it took the notary a few times to help me get my signature corrected. Even though I was a single signer on the document, I was charged for three signers, which nearly doubled my fee.  If I could have, I would not have bothered to pay for the session, but I was time constrained. So instead of $25 it was $45. If it happens to you, just start over and save yourself the extra fee. The notary never told me there would be extra fees when fixing my problem. It lined her pockets, though so why disclose."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Wesley",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T19:51:26.000Z",
          "Titre": "I didn’t get a copy of the notarized…",
          "Contenu": "I didn’t get a copy of the notarized document to send to my attorney.  Notary ID 8cc7cad-11ed-sec-3 -//////-///——ca82a23fca ::::/-//////-/// Passcode FpxKo.      Please resend downloadable document."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T03:24:59.000Z",
          "Titre": "We needed this document signed by a…",
          "Contenu": "We needed this document signed by a Florida notary. The person just crossed out Florida and wrote in Nevada.This won’t cut and we just wasted $25. They should have explained they were going to cross out all over the document."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anita Goldsmith",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T16:44:30.000Z",
          "Titre": "It was apparently a technical issue",
          "Contenu": "It was apparently a technical issue - My web cam did not work utilizing their site - so I had to use my own PC to continue the process after a hr of trying to get the web cam to work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nathan",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T00:22:05.000Z",
          "Titre": "I had two documents notarized and the…",
          "Contenu": "I had two documents notarized and the date was misapplied on the second document (year of notary expiry was incorrect). I contacted customer service and no response. Pretty awful for $35"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Craig K",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T22:30:27.000Z",
          "Titre": "Fast service but we were charged more than expected",
          "Contenu": "The notary service was fast and efficient.  My complaint is that the website said it would cost $25 per form.  We had two forms with a single signature required on each form.  I uploaded both forms and my wife and I each had to sign one of them.  But then we were charged $35 per form even though there was only one signature per form."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Leo Schacht",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T15:31:27.000Z",
          "Titre": "Technology problems will destroy the experience.",
          "Contenu": "The technology worked poorly. When entering the room for the session it just sat there, almost 20 minutes were wasted waiting to get in. I exited and reentered and everyone else was already in the session killing time. I had a lot of trouble with the camera and microphone, had to reload the session to get them working. Finally, the signature box should tell you clearly to provide the name as specified in the document you are signing so it can generate useful signature instead of having to draw them.The two hosts I had were both extremely knowledgeable and courteous, the rating would have been lower were it not for their professionalism."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lee Babcock",
          "Nb_Reviews": 2,
          "Date": "2023-06-08T22:42:40.000Z",
          "Titre": "I had to upload images of my ID twice",
          "Contenu": "I had to upload images of my ID twice.  Appeared to be stuck in a verification loop."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mitchell",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T22:34:13.000Z",
          "Titre": "Not as expected",
          "Contenu": "It was super easy but too expensive and I wasn’t aware of the cost til after going through entire process if I would have known it was going to Cost 35$ I would went different route"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T22:18:48.000Z",
          "Titre": "Did NOT like the additional $10 fee for…",
          "Contenu": "Did NOT like the additional $10 fee for an additional seal even though I already paid the $10 for an additional signer."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Ariana",
          "Nb_Reviews": 3,
          "Date": "2023-05-17T18:17:39.000Z",
          "Titre": "The price isn’t listed anywhere before…",
          "Contenu": "The price isn’t listed anywhere before you actually use the service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 2,
          "Date": "2022-10-04T21:59:24.000Z",
          "Titre": "There needs to be an option to add the…",
          "Contenu": "There needs to be an option to add the \"State\" so the correct notary is selected."
        },
        {
          "Note": 4,
          "Lieu": "LU",
          "Pseudo": "Luk100",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T23:05:04.000Z",
          "Titre": "A bit more pricey than competition...",
          "Contenu": "A bit more pricey than competition...but otherwise excellent service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T20:22:29.000Z",
          "Titre": "Quick and easy process",
          "Contenu": "Quick and easy process.  The only reason I am not giving the 5th star is due to a little uncertainty that I have/had with the notary being out of state for the type of document being notarized."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ShellyAnn",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T17:34:25.000Z",
          "Titre": "Tech Issues with Macbooks",
          "Contenu": "I was unable to get the camera/mic working on my Macbook Pro with this site and therefore had to use my husband's laptop. Other than that technical issue, the service was great. The notary was friendly and thoroughly explained everything."
        },
        {
          "Note": 4,
          "Lieu": "KY",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T19:54:16.000Z",
          "Titre": "Pretty simple",
          "Contenu": "Pretty simple, although the system was a little glitchy with getting it to recognize my mic, which I'm not sure if it was an issue on my side or theirs. But the agent was great, provides solutions, was very professional and got everything done pretty quickly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melissa Jones",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T16:55:42.000Z",
          "Titre": "Good Transaction Overall",
          "Contenu": "My President waited online for 20 minutes but no one was available to notarize the document.  It may have been due to the late hour that she tried to execute the document.  In the morning she was able to access a notary with no problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T22:54:00.000Z",
          "Titre": "Very little support from staff",
          "Contenu": "Very little support from staff. This notary was great, she was proactive in overcomming hurdles, but the one that was part of the failed session this morning was clueless."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keiandra",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T14:47:05.000Z",
          "Titre": "I was only able to connect from my…",
          "Contenu": "I was only able to connect from my cellphone. The server was not compatible with my Mac book service provider."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T23:54:52.000Z",
          "Titre": "Great Notary, Poor Technology",
          "Contenu": "The Notary, Norma, was excellent, patient, and helpful in getting us through the numerous technical difficulties the website had during the process. 5 stars for the Notary, 3 stars for the technology."
        },
        {
          "Note": 4,
          "Lieu": "CL",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T13:23:18.000Z",
          "Titre": "Easy",
          "Contenu": "Easy!  the only detraction was the wait for the bill and not being clear how it would proceed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T04:18:11.000Z",
          "Titre": "Long wait time",
          "Contenu": "Long wait time, otherwise went very well 👍🏼"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marguerite",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T16:07:01.000Z",
          "Titre": "The payment procedure was inadequately…",
          "Contenu": "The payment procedure was inadequately explained."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "odalys",
          "Nb_Reviews": 2,
          "Date": "2022-09-27T22:30:30.000Z",
          "Titre": "Very efficient"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendy",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:59:26.000Z",
          "Titre": "Easy process",
          "Contenu": "Professional, courteous, friendly, easy process and they walk you through it. First time ever using an online notary and would definitely do it again. Very easy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:50:45.000Z",
          "Titre": "Easy easy easy!",
          "Contenu": "Easy easy easy!I needed to sign with another signer who was not in the same location as me.  The experience was so easy -- both for me and the additional signer.  The notary joined the call within 5 minutes of initiating the request.  Very fast.  The notary was prepared and made the signing very simple.  Would definitely use again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Asia Love",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T23:59:47.000Z",
          "Titre": "The wonderful Mr. Scharff",
          "Contenu": "Mr. Scharff took time to ensure I had all the necessary documents and read through the documents to ensure completeness. He was friendly and made me feel comfortable. Thank you Online Notary for having Mr. Scharff on your team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda W",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:04:29.000Z",
          "Titre": "Awesome service",
          "Contenu": "Quick, inexpensive- notary was more than helpful with our technical difficulties. She made it easy to understand. Would use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SarahB",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T22:51:43.000Z",
          "Titre": "This is the best thing ever",
          "Contenu": "This is the best thing ever. Notary was available quickly, the app actually worked to upload my ID, and my document was automatically replaced and stored with the signed and notarized version. Absolutely awesome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:55:37.000Z",
          "Titre": "Easy, fast and helpful",
          "Contenu": "The notary was very helpful and polite."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T19:49:48.000Z",
          "Titre": "Very easy to use and convenient as I…",
          "Contenu": "Very easy to use and convenient as I didn’t have to leave the house. They were professional and kind and made the process very smooth. Will use again!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:04:06.000Z",
          "Titre": "Quick easy way to complete documents"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T20:46:34.000Z",
          "Titre": "Highly Recommend this service",
          "Contenu": "The notary was friendly and knowledgeable, and the service was very easy to use.  I had to switch browsers for the video chat, but that was most likely because of my system configurations.  Process was quick and easy, and cost effective.  I do (and have) highly recommend this service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vanessa Williams",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T01:32:43.000Z",
          "Titre": "The process was easy and so fast",
          "Contenu": "The process was easy and so fast. I will definitely use this service again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danny C",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T00:39:43.000Z",
          "Titre": "What a simple and fast process!",
          "Contenu": "What a simple and fast process. Saved me a drive and a wait at my local notary. Wonderful solution at the last minute too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:29:19.000Z",
          "Titre": "Fast & Easy together with…",
          "Contenu": "Fast & Easy together with professionalism during the whole period. Thanks)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T03:55:58.000Z",
          "Titre": "Very convenient",
          "Contenu": "The convenience of being able to do it at home with my 91 year old father, and the assistance and patience the notary had in helping us through the process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T05:47:23.000Z",
          "Titre": "It was convenient and fast",
          "Contenu": "It was convenient and fast.  I had a great notary that was nice and she seem very experienced in notarizing document's. I definitely will recommend and for every document I need notarized, this will be my first option."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Salvador Padron",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:02:45.000Z",
          "Titre": "Thank You Elizabeth Flitch",
          "Contenu": "Amazing, thank you Elizabeth for your service! 10/10"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T02:14:23.000Z",
          "Titre": "Our Notary Public was very entertaining…",
          "Contenu": "Our Notary Public was very entertaining and warm! He made us very comfortable in spite of me and my daughter Kyla being new to this method of business! I must say, Online Notary Center is an essential tool to use to get legal documents notarized at any time neccessary! This actually was urgent!Thanks so much!Ivy Shinn"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:58:48.000Z",
          "Titre": "Very easy to use",
          "Contenu": "Very easy to use, notary seemed concerned to make sure everything was filled out correctly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David OBrien",
          "Nb_Reviews": 4,
          "Date": "2023-10-11T22:42:22.000Z",
          "Titre": "Very happy I found this service online",
          "Contenu": "Very happy I found this service online. Hate going down to the local UPS or mail store for overpriced notary. This service exceeded my expectations and highly recommend to anyone with Notary needs. All you need is computer with webcam and you are good to go. Also, after you have your documents, they are in digital format for easy sharing with others. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christina G.",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T01:43:15.000Z",
          "Titre": "AWESOME!!! GREAT SERVICE FOR SURE!",
          "Contenu": "This was a very quick, easy and efficient process! Wonderful experience!  I would recommend this service to anyone! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa G",
          "Nb_Reviews": 2,
          "Date": "2023-10-09T19:17:04.000Z",
          "Titre": "SO EASY to use!!",
          "Contenu": "SO EASY to use!!! I tried a different company first, and they wanted me to verify my identity using addresses I might have lived at over 30 years ago! Online Notary Center made it simple and easy to verify my identity and I was connected with a notary within minutes! All my docs signed, downloaded and emailed to me as well. I HIGHLY recommend this company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T18:38:57.000Z",
          "Titre": "Process was quick and very convenient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DMC",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:56:43.000Z",
          "Titre": "Excellent!",
          "Contenu": "Simple, fast, affordable!  Great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Williams",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T21:44:16.000Z",
          "Titre": "Extremely easy to use and the Notary…",
          "Contenu": "Extremely easy to use and the Notary was very nice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela Bink",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T07:32:10.000Z",
          "Titre": "Yes love this made my experience so…",
          "Contenu": "Yes love this made my experience so easy and didn't even have to leave the house!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T22:47:04.000Z",
          "Titre": "So easy and my notary was super…",
          "Contenu": "So easy and my notary was super friendly! I had tried another service and while their site was sleek, nothing worked and I eventually had to give up. This site was easy, it took a matter of minutes, and my notary William was an absolute hoot. I will definitely use this service again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim & Russ",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T02:43:18.000Z",
          "Titre": "Quick and Convenient!",
          "Contenu": "I never knew this service existed online. I'm thrilled to have found it. It was so quick and convenient. I chose Online Notary Center for it's security and high-profile, reputable client-base. We will most likely use it again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tina Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T22:18:54.000Z",
          "Titre": "FANTASTIC CUSTOMER SUPPPORT!!!",
          "Contenu": "I can't say enough about Robert and Joanie and everyone else at Online Notary Center!  On a few occasions, I have run into a few technical issues (all on my end!!) and each and every time, they have jumped right in to investigate and figure out what is going on and tell me how I can correct it.  Everyone is so incredibly friendly and helpful.....I've got nothing but great things to say!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lex Customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T01:54:52.000Z",
          "Titre": "Awesome Notary service",
          "Contenu": "I talked to a really nice woman she was super helpful and very patient with me. This is my first time using a service like this and it was so easy and very fast. I fully enjoyed and appreciate my experience it was wonderful and a great price!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T22:41:02.000Z",
          "Titre": "This service is THE BEST!!",
          "Contenu": "This service is THE BEST!!!  I had no idea this was even an option until I urgently needed something today.  It was fast and inexpensive.  I cannot recommend this enought!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J Davis",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T20:06:14.000Z",
          "Titre": "Joni was prompt & pleasant",
          "Contenu": "Joni was prompt on replies, quick to follow through, attempted multiple solutions and when it ended up being a server-end issue made point to call me back to let me know I could immediately continue. She is very pleasant to work with. The service worked fantastically outside of problems with their payment vendor which resolved within a few hours while Joni was communicative and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T21:19:59.000Z",
          "Titre": "Super efficient and easy to set up",
          "Contenu": "Super efficient and easy to set up. All done in 5 minutes, start to finish!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy Bookie",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T15:44:16.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service! Thank you so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vivien T.",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T04:58:07.000Z",
          "Titre": "The notary Everlyn Peters was great",
          "Contenu": "The notary Everlyn Peters was great! She was very patient with a multiple signer document who had varying levels of tech abilities. Would use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Fakaosita",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T18:33:25.000Z",
          "Titre": "man that was so easy",
          "Contenu": "man that was so easy! Especially for a situation where both signers don't want to be around each other. This is the most convenient way to get a notary. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JP",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T18:43:01.000Z",
          "Titre": "Excellent experience",
          "Contenu": "Efficient, convenient and overall pleasant. Took only about 3 mins to connect to a live notary, the overall session took about 5 mins. All from the comfort of my home."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy Wendler",
          "Nb_Reviews": 4,
          "Date": "2023-10-12T19:46:46.000Z",
          "Titre": "This was so convenient",
          "Contenu": "This was so convenient!  My online Notary was pleasant and guided me through the process since it was my first time to notarize documents online.  I will definitely be using this service again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christy",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T14:21:02.000Z",
          "Titre": "Quick and easy and worth it!",
          "Contenu": "That was SOOOO MUCH easier and better than trying to find somewhere to go, to get a notary completed.  Took a couple of minutes.  I will never leave the house for a notary again!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T21:12:30.000Z",
          "Titre": "Excellent Service",
          "Contenu": "Scheduling the appointment online was easy and intuitive.The appointment took place promptly at the scheduled time.We had a slight problem with the payment process but Joni Maron quickly and efficiently resolved the issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MD, Southern Cali",
          "Nb_Reviews": 3,
          "Date": "2023-08-10T20:08:42.000Z",
          "Titre": "Outstanding service.",
          "Contenu": "Norma is intelligent, skilled, and, most importantly kind. She guided us through the processes and expertly answered all of our questions. This was an excellent service that I will be using again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Jenkins",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T19:29:56.000Z",
          "Titre": "Kathrine Cruz was very nice an…",
          "Contenu": "Kathrine Cruz was very nice an informative assisting me with my documents. Completing the task with a nice big smile on her face she was great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexis S. Smith",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T19:23:53.000Z",
          "Titre": "Fast",
          "Contenu": "Fast, efficient and how easy it was to create an account and proceed.  The price for convenience is also a major plus."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T21:36:28.000Z",
          "Titre": "Norma is a rare breed of A…",
          "Contenu": "Norma is a rare breed of A professional, great communicator and all round good person.Keep her in your company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa N Contreras",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T04:18:36.000Z",
          "Titre": "William R Scharff Jr",
          "Contenu": "William R Scharff Jr. was awesome! He was super helpful, personable, and made the process very easy and enjoyable. Thank you!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T19:16:40.000Z",
          "Titre": "painless",
          "Contenu": "painless. i tried notarize.com first and their software repeatedly failed to validate my ID and gave me no feedback about why. it was so frustrating, and your site was SO EASY. thank you."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Simon W.",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T23:12:52.000Z",
          "Titre": "Super easy and fast",
          "Contenu": "Super easy, fast and professional!I was on vacation in Germany, but needed to notarize a document for the US. Took only a few minutes and everything was good to go in minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stan M",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T01:08:31.000Z",
          "Titre": "This is an awesome service",
          "Contenu": "This is an awesome service. I only wish this would accept Wacom tablet input for a more professional signature."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T00:40:43.000Z",
          "Titre": "Connected extremely fast",
          "Contenu": "Connected extremely fast! I'm in the middle of nowhere and had to get a document to some business partners asap. What a fantastic service! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wake Forest Community Youth Orchestra",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T21:25:08.000Z",
          "Titre": "The notary was patient as the second…",
          "Contenu": "The notary was patient as the second signer had trouble logging on. I will definitely use their service again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathan A",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T17:42:55.000Z",
          "Titre": "I was very pleased with the expert…",
          "Contenu": "I was very pleased with the expert instructions and assistance throughout the whole process. Life is made simple.Thanks for providing a great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T20:43:28.000Z",
          "Titre": "Easy",
          "Contenu": "Easy - didn't have to leave my office, don't have to be bounded by open and close times, answered questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T23:58:10.000Z",
          "Titre": "Easy Peasy",
          "Contenu": "Easy Peasy. The ID confirmation text did not work though."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Colorado Customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T18:01:08.000Z",
          "Titre": "Online experience was amazing",
          "Contenu": "It was great but I could not process my payment online and needed to call someone. Even with calling - someone live picked up and it was efficient and fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T21:29:06.000Z",
          "Titre": "Super quick and easy process",
          "Contenu": "Super quick and easy process! Online technology worked better than Notarize.com! Notary was speedy, kind and professional!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Albie Vazquez",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T19:43:17.000Z",
          "Titre": "Ms. Kaherine Cortez - The Best!",
          "Contenu": "Ms. Katherine Cortez was amazing she made this process extremely easy and simple. I look forward to working with her again. Albie"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T01:45:55.000Z",
          "Titre": "Simple & painless process.",
          "Contenu": "Simple & painless process.Norma explained each step & made sure I didn't have any questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T01:10:49.000Z",
          "Titre": "This process was quick and easy",
          "Contenu": "This process was quick and easy. The notary person was friendly, personable and made the experience even better!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Sachin Dave",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T18:29:04.000Z",
          "Titre": "Excellent precise services!",
          "Contenu": "It is great to do quickly affidevit with the right contents i have submitted. Overall process was very well organized."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aiga Jekabsone",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T00:28:54.000Z",
          "Titre": "Great",
          "Contenu": "Great, very seamless process"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T20:45:51.000Z",
          "Titre": "Wow! Who knew you could notorize online?",
          "Contenu": "Wow! So quick, easy, and is SO much better than having to drive somewhere and wait for a notary. This is phenomenal!"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T17:24:14.000Z",
          "Titre": "The person who notarised my documents…Norma from Nevada",
          "Contenu": "Norma, who notarised my documents was very nice and helpful. It was a good experience and efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shadwrick Vick",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T18:10:43.000Z",
          "Titre": "Meisha was great",
          "Contenu": "Meisha was great. Kind, and more human than typical online notaries."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christina",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T21:20:42.000Z",
          "Titre": "Highly Recommended - Easy, Quick, Helpful, Cost-Effective",
          "Contenu": "This is a such a seamless and easy service, and my notary has been pleasant and so helpful in each instance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T16:44:45.000Z",
          "Titre": "Very quick",
          "Contenu": "Very quick, there was a problem with the document I was sent but it was corrected right away!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer Carmen",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T19:20:40.000Z",
          "Titre": "Quick and easy",
          "Contenu": "Quick and easy. System said a long wait but honestly it was only a couple of minutes. Notary was friendly and professional and answered all my questions"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam Waters",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T02:40:18.000Z",
          "Titre": "Easy",
          "Contenu": "Easy, friendly and professional. We will recommend to friends and family"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glenn",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T20:22:26.000Z",
          "Titre": "Very straightforward and easy to use…",
          "Contenu": "Very straightforward and easy to use service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T01:00:03.000Z",
          "Titre": "Quick and Easy!",
          "Contenu": "This was a quick and easy process. Our notary was clear, helpful, and explained the process well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T21:14:14.000Z",
          "Titre": "Fast and easy",
          "Contenu": "Fast and easy.  I’ve used this service once before and they do a great job.  Super convenient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MEDINA/CANDIDO",
          "Nb_Reviews": 2,
          "Date": "2023-10-24T19:13:35.000Z",
          "Titre": "Very convenient",
          "Contenu": "Very convenient. Do not need to be out there looking a place and driving."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eileen Ragan",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T21:11:51.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use.  Quick & Friendly.  Priced just right!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kaitlin J",
          "Nb_Reviews": 5,
          "Date": "2023-09-20T17:21:51.000Z",
          "Titre": "Fast and Efficient!",
          "Contenu": "Was very quick and the representative I spoke to was very friendly and knowledgable. Love this service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gail Kenney",
          "Nb_Reviews": 3,
          "Date": "2023-08-25T01:43:28.000Z",
          "Titre": "Katherine was very professional",
          "Contenu": "Katherine was very professional, handled things quickly, and did her job well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer Kevin",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T09:02:00.000Z",
          "Titre": "The best part about the entire... the friendliness and the ease",
          "Contenu": "The best part about the entire experience was the ease and speed. In today's world of work we are all just so busy. I was at work and got things done. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JD",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T01:34:36.000Z",
          "Titre": "This was so easy and convenient",
          "Contenu": "This was so easy and convenient! Took all of the headache out of the usual notary process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 3,
          "Date": "2023-08-21T19:15:58.000Z",
          "Titre": "The service was fast and reasonably…",
          "Contenu": "The service was fast and reasonably priced. The notary was present and efficient. The service was a winner!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Satisfied Customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T15:00:52.000Z",
          "Titre": "So easy and convenient!",
          "Contenu": "So easy and convenient!  The experience was efficient and quick.  In short--I loved it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Smith",
          "Nb_Reviews": 2,
          "Date": "2023-10-24T19:55:55.000Z",
          "Titre": "Katherine was a joy to chat with and…",
          "Contenu": "Katherine was a joy to chat with and conducted businesses flawlessly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T19:55:31.000Z",
          "Titre": "A+++ service",
          "Contenu": "A very efficient and enjoyable experience. 100% recommend this to anyone in need of a notary service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T04:10:38.000Z",
          "Titre": "Easy-peasy",
          "Contenu": "Easy-peasy! And this was my first try."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Johnny Britt",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T02:33:02.000Z",
          "Titre": "Quick and professional,",
          "Contenu": "The nice lady that helped me get my document notarized was very helpful and attentive, I will be a returning customer to get all of my documents notarized here!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T17:42:43.000Z",
          "Titre": "Extremely easy instructions",
          "Contenu": "Extremely easy instructions, easy to use, had form notarized within 15 mins."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dee",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T17:21:33.000Z",
          "Titre": "Quick & Convenient",
          "Contenu": "Quick, convenient notary service with effective pricing. A WIN all around."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marik  Berghs",
          "Nb_Reviews": 3,
          "Date": "2023-09-29T05:16:46.000Z",
          "Titre": "Quick and painless",
          "Contenu": "Quick and painless. I did the video call from my kitchen table. Would highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bernard Brozek",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T21:41:15.000Z",
          "Titre": "Great experience",
          "Contenu": "Very easy and done with such professionalism!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T21:11:53.000Z",
          "Titre": "The notary I worked with made it a…",
          "Contenu": "The notary I worked with made it a seamless experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T21:51:11.000Z",
          "Titre": "Norma was Awesome",
          "Contenu": "Norma was professional, courteous, and quick! Great experience!"
        },
        {
          "Note": 5,
          "Lieu": "AW",
          "Pseudo": "Wendell",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T02:17:55.000Z",
          "Titre": "My experience was surprisingly pleasant…",
          "Contenu": "My experience was surprisingly pleasant based on the fact that the notarising went efficient and prompt yet very legal."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica Randolph",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T20:21:30.000Z",
          "Titre": "Quick and effort-free service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alcatraz",
          "Nb_Reviews": 7,
          "Date": "2023-11-14T17:26:29.000Z",
          "Titre": "5 Stars",
          "Contenu": "5 Stars. Notary was a pleasure :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T03:31:20.000Z",
          "Titre": "Very very easy!",
          "Contenu": "Very very easy!  Norma was awesome!"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T17:19:57.000Z",
          "Titre": "Straightforward and better then the…",
          "Contenu": "Straightforward and better then the other sites"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexus",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T08:12:47.000Z",
          "Titre": "Quick and Cheap",
          "Contenu": "Quick and Cheap. Can't believe I used to go to the bank and wait in a long line just to save $25. Will use this service from now on!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pamela",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T01:29:57.000Z",
          "Titre": "My opinion",
          "Contenu": "Norma was real nice and the process was smooth."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T17:59:34.000Z",
          "Titre": "She was great and fast as well in…",
          "Contenu": "She was great and fast as well in getting this taken care of."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T17:20:05.000Z",
          "Titre": "It was simple and convenient"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "peter",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T01:22:03.000Z",
          "Titre": "Very easy and straightforward"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T21:13:22.000Z",
          "Titre": "Quick and easy service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron H",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T23:00:06.000Z",
          "Titre": "Easy to use and very streamlined!",
          "Contenu": "Very easy to use and notary was very professional and made the experience easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T21:35:17.000Z",
          "Titre": "Super fast online notary",
          "Contenu": "Super fast online notary. Friendly and knowledgable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christina Gray",
          "Nb_Reviews": 7,
          "Date": "2023-10-16T20:28:11.000Z",
          "Titre": "Norma Jean was professional",
          "Contenu": "Norma Jean was professional, quick and professional. Will definitely use again!!"
        }
      ]
    }
  ]
}