{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "onsip.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alberto Wong",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T18:03:49.000Z",
          "Titre": "My issue is still happening without…",
          "Contenu": "My issue is still happening without much guidance and support. Seems the tech's are not able to trace the call logs to where the issue is because of the limitation of the logs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Trig Bundgaard",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T16:57:25.000Z",
          "Titre": "onSIP failed us",
          "Contenu": "How Google Voice for Workspace works perfectly right out of the box and onSIP was a nightmare integration with dropped calls and poor quality I will never understand. You all kept blaming our network and yet Google Voice can seamlessly use the same network and deliver all the quality and features we were looking for in your PBX."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Syen Hussaini",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T03:18:20.000Z",
          "Titre": "If you are considering Onsip make sure…",
          "Contenu": "If you are considering Onsip make sure you have an IT team to support it. You can’t be a small business without IT support. This is highly complicated and needs professional help. Also, you cannot get out of contract, three years no way out."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2022-04-20T23:50:40.511Z",
          "Titre": "Horrific sales and quality of phone service",
          "Contenu": "I entered my number and email to speak with a sales person, who later called me back. This was one of the most absurd and insulting 'sales' calls I have ever experienced. The incoming call quality was terrible, the person didn't identify what they were supposedly selling, the person simply shouted over me none stop while I attempted to ask simple questions such as why are you calling. There is very clearly something seriously wrong with this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "They Got Me",
          "Nb_Reviews": 2,
          "Date": "2021-08-17T20:36:23.000Z",
          "Titre": "when i signed up i was told this was a…",
          "Contenu": "when i signed up i was told this was a fully managed phone service that we could email in change requests and they would be taken care of. After we signed up and was talking with the onboarding engineer they said support will do absolutely no work, only answer questions. This might not be bad but the UI is so crappy/clunky/unintuitive/archaic with no import/export or automation options it is almost unusable. very disappointing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SJ Reiner",
          "Nb_Reviews": 1,
          "Date": "2021-06-08T19:41:32.000Z",
          "Titre": "Zero stars",
          "Contenu": "4 different types of devices, 3 different states, 2 types of internet connection, and we still haven't had 1 day of fully functional calls through OnSIP. It has near-constant difficulty connecting, drops calls, and the audio quality is awful. Call history is also often missing. The only thing OnSIP has going for them is their customer service / tech support team. We are actively looking for alternatives."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "David Lim",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T10:17:52.000Z",
          "Titre": "I need unlimited local calls for sim…",
          "Contenu": "I need unlimited local calls for sim trunking due to our business.but you guys aren't given me enough explanations and also said to me that you don't support Canadian band."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard H",
          "Nb_Reviews": 1,
          "Date": "2022-06-20T03:27:09.000Z",
          "Titre": "Dismissive of tech support issues",
          "Contenu": "Dismissive of tech support issues - poor communicationPitched a seamless transition from previous location and 3 months later still no fixed serviceCountless drops of queued calls and poor audio quality"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gwen Armour",
          "Nb_Reviews": 1,
          "Date": "2022-02-25T20:07:16.000Z",
          "Titre": "This service is terrible",
          "Contenu": "This service is terrible!  Too many dropped calls, calls that can't be answered and callers that you can't hear.  I have reported numerous bugs with no response and no improvement. So glad we finally went with someone else!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason Bell",
          "Nb_Reviews": 2,
          "Date": "2022-04-06T00:27:41.000Z",
          "Titre": "Insanely bad customer service when you…",
          "Contenu": "Insanely bad customer service when you finally get them on the phone after three hours they hang up on you or from a Third World country they don’t understand"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hal Cohen",
          "Nb_Reviews": 2,
          "Date": "2022-04-05T15:47:55.000Z",
          "Titre": "Read and Respond to My 4/1 Review",
          "Contenu": "Read the review I sent about an OnSip support incident on 4/1.  Stop asking me to review OnSip until you handle to points I made in that review and let me know that you have done so."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "lgolias",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T16:27:18.000Z",
          "Titre": "The cell phone rings when the office…",
          "Contenu": "The cell phone rings when the office phone rings during business hour while I already set NOT TO DISTUR on the cell phone.   Cannot take the noise and malfaction.  Already uninstalled the app"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonathan Asker",
          "Nb_Reviews": 3,
          "Date": "2022-12-22T22:14:05.000Z",
          "Titre": "Nothing was fixed",
          "Contenu": "Nothing was fixed - frustrating. Calling customer service again...main business line down all day - not good"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bobby Whitley",
          "Nb_Reviews": 4,
          "Date": "2022-05-31T23:44:01.000Z",
          "Titre": "Low commissions and a $500 amount…",
          "Contenu": "Low commissions and a $500 amount before they are paid.   Better reseller options out there.  The VOIP service is dependable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vijay Reddy",
          "Nb_Reviews": 1,
          "Date": "2021-09-24T13:59:51.000Z",
          "Titre": "MY EXPERIENCE IS THIS IS FRAUDLENT…",
          "Contenu": "MY EXPERIENCE IS THIS IS FRAUDLENT COMPANY. THEY PROMISED TO DELIVER PHONES BY CERTAIN DATE AND AFTER I SIGNED THE CONTRACT THEY DID NOT EVEN MAIL THE PHONES YETWHEN I CONTACTED, THE AGENT DYLAN CORTINA WAS SO RUDE AND ASKED ME TO GO SOMEWHERE IF I CANT WAITWHEN I SENT EMAIL TO CANCEL MY ORDER, HIS REPLY WAS GOOD LUCK WITH YOUR SEARCH AND YOUR ORDER WILL BE CANCELLEDBUT THEY STARTED CHARGING MY CREDIT CARD AND WHEN I CONTACTED DYLAN, HIS RESPONSE WAS I DID NOT FOLLOW CERTAIN STEPS WHILE CANCELLING (WHICH WERE NEVER INFORMED TO ME) AND WHEN I TRIED TO GO TO ADMIN PROTAL TO REMOVE MY CREDIT CARD, THERE IS NO OPTION TO REMOVE CREDIT CARD AND THEY ASK ME TO SEND EMAIL TO CUSTOMER SERVICE TO REQUEST TO STOP BILLING, WHICH I DID IN THE VERY FIRST PLACETHIS IS INTENTIONALLY DEFRAUDING CUSTOMERS AND I SINCERELY WARN YOU ALL TO BE WELL AWARE OF THIS COMPANIES PRACTICESI SENT STRONG EMAIL REQUESTING THEM TO REMOVE THE CHARGES AND REFUND ME AND I AM  AWAITING THEIR RESPONSEAfter posting this review, I received  email from ONSIP confirming that my account is closed and all charges will be refundedI sincerely requested them asking them implement clean practices to make customers feel valued and not cheated"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shellie BB",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T19:30:17.000Z",
          "Titre": "They never sent me the information that…",
          "Contenu": "They never sent me the information that I requested on how to use their phones, so sad."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thadeous",
          "Nb_Reviews": 1,
          "Date": "2022-03-07T21:59:36.000Z",
          "Titre": "Pathetic service",
          "Contenu": "Pathetic service,, whoever reads it a strong suggestion not to go with it.THanks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "taxmerlin",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T00:44:03.000Z",
          "Titre": "Terrible",
          "Contenu": "Terrible i want a refund an I’ve been locked out of my account !!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "cARMEN jIMENEZ",
          "Nb_Reviews": 2,
          "Date": "2022-04-15T19:49:16.000Z",
          "Titre": "Calls are consantly dropped",
          "Contenu": "Calls are consantly dropped. We have so many issues think we may switch services."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Associated Telephone Technicians Inc.",
          "Nb_Reviews": 2,
          "Date": "2021-06-09T06:03:43.000Z",
          "Titre": "I can only call support all other calls…",
          "Contenu": "I can only call support all other calls fail.  So I can not try the service and that is why I rate this a 1 star."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Muhsina Muhsina",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T05:18:40.000Z",
          "Titre": "How to receive my payment"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "itsupport",
          "Nb_Reviews": 1,
          "Date": "2022-07-18T22:03:15.000Z",
          "Titre": "Expensive and a real pain to migrate…",
          "Contenu": "Expensive and a real pain to migrate to!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Agan",
          "Nb_Reviews": 2,
          "Date": "2021-06-06T19:21:03.000Z",
          "Titre": "Poor service and response after…",
          "Contenu": "Poor service and response after purchase. Little to no personal assistance. Great quality of sound experience when working. Actually screwed up my business and home phone systems when requesting assistance and directing me to their webpage versus a live person to work through the issue. Cannot recommend unless you are an independent IT expert authorized representative to sell this phone system."
        },
        {
          "Note": 1,
          "Lieu": "CO",
          "Pseudo": "Alejandra Nunez",
          "Nb_Reviews": 2,
          "Date": "2021-01-13T20:51:57.000Z",
          "Titre": "I have reported on several occasions…",
          "Contenu": "I have reported on several occasions different issues that are not resolved. Can not access reports from the Admin Portal, not Even the total call basic report. The phone does not ring if I don't refresh my browser every 3 minutes Calls have a lot of interferenceThe App version that can be installed on the computer does not hang up calls after ending the call, you need to constantly log off and back in for the app to work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dennis C Small Business Owner",
          "Nb_Reviews": 1,
          "Date": "2021-02-26T16:38:06.000Z",
          "Titre": "Android App is HORRIBLE",
          "Contenu": "Android App is HORRIBLE! We used OnSip for 2+ years in our small business.  As of 2/2021, their Android app has not kept pace ... it only answers calls 50% of the time and is about 90% less functional than their VoIP competitors, like DiapPad and 8x8. Moreover, OnSip doesn't appear to care since it has not EVER improved the functionality of their offering!  We can't run an unstable mobile VoIP phone app, so it's GOODBYE OnSip and HELLO DialPad!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JD Matthews",
          "Nb_Reviews": 2,
          "Date": "2020-11-16T23:13:06.000Z",
          "Titre": "It works...most of the time",
          "Contenu": "It works...most of the time. But when using the apps, or trying to call inter-office, it struggles to work 75% of the time. If you’re looking for a basic, inexpensive phone system this will work. If you want a VoiP system with fancy web and app features, look elsewhere b/c OnSIP ain’t it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Agan",
          "Nb_Reviews": 2,
          "Date": "2021-02-26T20:17:04.000Z",
          "Titre": "Nothing but issues and no personal…",
          "Contenu": "Nothing but issues and no personal attention when we have requested help. Just a pdf of instructions how to do things that we have attempted, but to no avail. Please have a OnSIP representative contact me sooner rather than later to address our issues. Thank you in advance."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Molly Stentz",
          "Nb_Reviews": 1,
          "Date": "2019-03-04T21:22:22.000Z",
          "Titre": "Our service was interrupted suddenly",
          "Contenu": "Our service was interrupted suddenly, disrupting our operations -  after they made a billing error. When I inquired about the outage and pointed out that they had our credit card on file and had recently billed us, customer service was unhelpful. Not a good way to run a crucial telecommunications service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony Michael",
          "Nb_Reviews": 1,
          "Date": "2021-04-15T18:55:51.000Z",
          "Titre": "Not a very good company",
          "Contenu": "Not a very good company - used to be .. but now its to corporate that's its not for us.. Sent an email to corp execs and it was ignored.** Update ** received a reply from ONSIP and it was the same lack of customer appreciation reply."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "They Got Me",
          "Nb_Reviews": 2,
          "Date": "2021-03-27T19:13:18.000Z",
          "Titre": "sales will tell you anything to get you…",
          "Contenu": "sales will tell you anything to get you signed up. Insist on seeing proof and documentation of any features and/or services they claim to have."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dennis C. Stepanovich",
          "Nb_Reviews": 1,
          "Date": "2019-11-05T15:26:30.000Z",
          "Titre": "The system is a real pain",
          "Contenu": "The system is a real pain.  It is complicated to do most functions, e.g. Park; transfer gives only four rings to get to another phone; set a temporary message and to eliminate it causes me to have to get out the paper instructions as I do not use it often enough to remember the procedure; if I hit hold and go to my front desk ( to set an appointment for a patient in my  chiropractic office) I have to go back to the phone on which I hit hold and worst of all have to remember to go back to that particular phone and hit the resume button BEFORE I pick up the receiver because if I pick up the receiver prior to hitting resume the phone call is cut off. And, on top of all this the quality of voice on the telephones is terrible...….very hollow sound like the caller to whom I am listening is 500 miles away.  I have use the volume control but the lousy sound has nothing to do with the volume.  Going to ONSIP system was an absolute terrible mistake."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DAVID WHIDDON",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T22:27:54.000Z",
          "Titre": "unhelpful",
          "Contenu": "unhelpful on weekends"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "BluePhoneBuster",
          "Nb_Reviews": 1,
          "Date": "2020-09-05T04:16:42.000Z",
          "Titre": "thumbs down",
          "Contenu": "thumbs down total scam will never trust any sip's again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joanne",
          "Nb_Reviews": 1,
          "Date": "2019-10-03T16:37:34.000Z",
          "Titre": "We have been onboard since June..",
          "Contenu": "We have been onboard since June... we had 2 major issues from the start that took some time to fix:One - my husband was not able to call one of our lines from his T-Mobile phone - my understanding is that it was a T-Mobile issue that was eventually resolved with the help of the technicians.Second - we had issues with the BLF sticking and not allowing us to properly assess & transfer incoming calls - this was a major issue for us working between 2 offices - fortunately we dealt with this during our slow time so it was not crippling as it would be during tax season... I BELIEVE it is now resolved (over 3 months later).I can understand technical problems with a transition and I tried my best to be patient as the tech's worked thru both of these issues - but I am VERY disappointed with the communication process during this entire onboarding process... if we called in - everyone we spoke to was accommodating and helpful but once this left the front line - there was literally NO communication - my sales REP completely dropped us - the technicians did not reach out to troubleshoot and I feel like the entire BLF problem was not being addressed until I screamed loud enough -  we finally a tech that was actively working on it and communicating - AUG timeframe... once he 'thought' it was fixed - he stopped communicating even though we were still reporting issues... We only 'THINK\" it is fixed because we have not noticed it being an issue - no one has checked in to confirm that - except out IT providers who have had a similar experience with the communications - pretty bad considering they are the ones that referred us to you."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2021-02-05T23:55:23.000Z",
          "Titre": "It drops at least 1 phone call of mine…",
          "Contenu": "It drops at least 1 phone call of mine everyday."
        },
        {
          "Note": 1,
          "Lieu": "CO",
          "Pseudo": "Alejandra Nunez",
          "Nb_Reviews": 2,
          "Date": "2021-05-07T19:02:53.000Z",
          "Titre": "Very poor support provided."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Katie Steinerman",
          "Nb_Reviews": 1,
          "Date": "2020-05-18T12:36:52.000Z",
          "Titre": "Nobody has answered my email"
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "James Bond",
          "Nb_Reviews": 1,
          "Date": "2019-03-18T19:17:01.000Z",
          "Titre": "can't set up and connect"
        },
        {
          "Note": 1,
          "Lieu": "SA",
          "Pseudo": "Tahir",
          "Nb_Reviews": 1,
          "Date": "2019-10-01T09:04:40.000Z",
          "Titre": "I couldn t use it even"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kteasdale",
          "Nb_Reviews": 3,
          "Date": "2021-05-04T19:38:22.000Z",
          "Titre": "very limited"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nick Wright",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:01:05.000Z",
          "Titre": "You lost a customer due to not being…",
          "Contenu": "You lost a customer due to not being able to offer E911 on a SIP trunk.  Another provider had it working correctly in 20 minutes."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bret MacMillan",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T18:49:22.000Z",
          "Titre": "Poor support, advertised features not actually available",
          "Contenu": "Lot's of promises of features made that have yet to be delivered. Several that we found out were never available in the first place that were promised in the initial sales pitch as well. Poor service as well that has taken a couple months to even get to a usable state for our company. Still many dropped calls and connection issues but all support ever says is that it is not them and that it must be on our end instead of helping find a solution."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "LA",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T14:49:18.000Z",
          "Titre": "Excelent customer service even though not the right system for us",
          "Contenu": "Voicemails were frequently lost. Many complaints from customers. The system overall was probably more than we needed, and certainly more than we could maintain. The people however, were phenomenal! EXCELLENT customer care!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "eric.arrocha",
          "Nb_Reviews": 1,
          "Date": "2022-07-26T02:25:40.000Z",
          "Titre": "We were still unable to connect to the…",
          "Contenu": "We were still unable to connect to the Admin Portal.  Nothing was suggested on their firewall or if they were blocking our outside IP address or a port.We need to logon to the Admin Portal to pay our bill.  Maybe come up with a different portal or better explain firewall descriptions."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Woods",
          "Nb_Reviews": 1,
          "Date": "2021-06-20T23:07:13.000Z",
          "Titre": "First gentleman told me to \"reboot my…",
          "Contenu": "First gentleman told me to \"reboot my network\". Second gentleman was more helpful but stated their was really no way to escalate my ticket to an engineer as \"we really don't have an engineering department\".You need a way for clients with enterprise networks to have a path for escalation to engineering level support personnel. In addition, it would really be helpful if you would write a KB article providing great detail about your particular implementation of SIP. Step by step. What the phone does as it boots up, what server it connects to, on what port, what is the return traffic, etc. etc. etc."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eric Diaz",
          "Nb_Reviews": 2,
          "Date": "2022-06-11T23:18:56.000Z",
          "Titre": "We had to switch to another service.",
          "Contenu": "We had to switch to another service.Set up was difficult.The app didn't work well.I was offered phones that I didn't accept and once I signed up, they wouldn't honor the offer when I changed my mind.Everyone was very nice, just not a good fit for us."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eric Buckner",
          "Nb_Reviews": 1,
          "Date": "2021-12-05T20:08:01.000Z",
          "Titre": "Call quality is atrocious...",
          "Contenu": "Call quality is atrocious.... Hate using it. Only reason not one star is that service/support is freat"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tom Mullen",
          "Nb_Reviews": 1,
          "Date": "2022-01-22T21:31:22.000Z",
          "Titre": "We keep getting cut off from each other."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kate",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T17:11:35.000Z",
          "Titre": "The system is too complicated"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Valerie De La Rosa",
          "Nb_Reviews": 2,
          "Date": "2020-01-06T20:27:41.000Z",
          "Titre": "Unbeknownst to me",
          "Contenu": "Unbeknownst to me, I ended up with 2 accounts during a trial (still no idea how), and then decided we were not moving forward with phone service, so I cancelled my account. Somehow, even though I cancelled my account, I got charged. I had to call and cancel the account.Then, about a month later, I got a notification that OnSip was trying to charge me again - for the second account.Customer service was nice but this sort of customer experience for a trail was a bit much."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eric Diaz",
          "Nb_Reviews": 2,
          "Date": "2020-12-22T03:00:36.000Z",
          "Titre": "App is horrible",
          "Contenu": "App is horrible. Customer Service is great. Interface is below average. When I signed up, I didn't take advantage of a free phone offer. Right after I signed up, it \"could no longer be honored\".I'm looking for another solution."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrew Hall",
          "Nb_Reviews": 1,
          "Date": "2020-09-25T22:46:20.000Z",
          "Titre": "Not going so well",
          "Contenu": "We consistently have communication difficulty.Call Cuttoffs.Calls not connecting.We have verified excellent internet connectivity at all sites.Seriously considering looking into another option for our communication needs.Andrew"
        },
        {
          "Note": 2,
          "Lieu": "CO",
          "Pseudo": "Ana",
          "Nb_Reviews": 1,
          "Date": "2021-05-14T01:17:29.000Z",
          "Titre": "Companies don't do it!!",
          "Contenu": "The company where I work from had to change phone's providers. we experienced so many issues with Onsip, calls getting dropped all the time. The calls got frozen too often. It was a nightmare."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Todd",
          "Nb_Reviews": 1,
          "Date": "2019-07-02T17:23:20.000Z",
          "Titre": "Not very useful \"out of the box\"",
          "Contenu": "Does not run at startup on new Windows 10 system (did for a while)No mobile app!Poor notification on desktop - I miss all incoming callsClearly better setup needed but shouldn't be necessary."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Keith Wilson",
          "Nb_Reviews": 1,
          "Date": "2020-01-07T21:12:56.000Z",
          "Titre": "Didn't give me my $300 credit which i…",
          "Contenu": "Didn't give me my $300 credit which i was promised for buying phones through your company. That's very poor service. I give 2 stars since the rest of the customer service is good."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gracie Martin",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T22:32:43.000Z",
          "Titre": "Problem still exists."
        },
        {
          "Note": 2,
          "Lieu": "PK",
          "Pseudo": "Shamsullah",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T04:53:24.000Z",
          "Titre": "Nice",
          "Contenu": "NiceHhfgjMk"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "OnSip User",
          "Nb_Reviews": 1,
          "Date": "2019-09-18T15:26:04.000Z",
          "Titre": "Good service and reliable but lacking needed business phone system features",
          "Contenu": "Good support service and reliable, but system lacks features that are required for any business phone system.  Shared line appearances, barge capabilities, true \"follow me\" call handling with simultaneous ring, call screening, etc are all not possible.  The pricing model also is not good for most businesses.  You will need several user accounts for each user if you actually want to have decent call handling capabilities (knowing if a call is sales or support related, if you want to have an intercom setup etc).  Hopefully OnSip will develop more features common for business phone systems and modify their pricing model.  For example, a user alias counts as a new user... defeating the whole purpose of using aliases.  If you have three appearances for a user, that is already almost $60 per month.  Other systems have more capabilities at much lower cost."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Justin Shapiro",
          "Nb_Reviews": 1,
          "Date": "2021-03-22T19:26:04.000Z",
          "Titre": "Too many calls being dropped",
          "Contenu": "Too many calls being dropped, which is the number one issue for a phone service provider unfortunately. Intuitive and easy to use though."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jacalyn McGeehan",
          "Nb_Reviews": 1,
          "Date": "2020-05-15T19:11:01.000Z",
          "Titre": "Working remotely and the Windows app…",
          "Contenu": "Working remotely and the Windows app will not let me call or receive calls from others in our network (ie from other office extensions)."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2019-08-06T15:26:51.000Z",
          "Titre": "Difficult to use and customize",
          "Contenu": "Difficult to use and customize, mobile app and in browser software are not functional"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 1,
          "Date": "2018-10-31T20:25:44.000Z",
          "Titre": "Problems never get fixed",
          "Contenu": "Problems never get fixed. Look for my future web postings. Such a shame."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jenn Schultz",
          "Nb_Reviews": 1,
          "Date": "2020-07-16T12:47:35.000Z",
          "Titre": "App keeps closing out",
          "Contenu": "App keeps closing out. Logged out and back in and have more crashes."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2019-07-30T17:18:08.000Z",
          "Titre": "MY CALLS DROP CONSTANTLY!",
          "Contenu": "MY CALLS DROP CONSTANTLY!ESPECIALLY IN EUROPE."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SnoCo GOP Admin",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T06:23:29.000Z",
          "Titre": "Good voice quality & good features",
          "Contenu": "Good voice functionality and call routing features. Having to dial a '1' ahead of every outside number is a new inconvenience. Incomplete functionality for Grandstream phones hampered the migration to OnSIP. We are still shopping for a similar vendor that offers integrated SMS text messaging with our business phone numbers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gene",
          "Nb_Reviews": 2,
          "Date": "2022-06-11T21:03:35.000Z",
          "Titre": "Your support people are great",
          "Contenu": "Your support people are great; very courteous and helpful. However, their knowledge of how OnSip integrates with customer networks seems limited. I say this because after 30 years in IT, I'm not certain how my network integrates with OnSip. Our OnSip phone issues continue. My efforts to work with your support people to resolve those issues will continue too."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "yorkplace",
          "Nb_Reviews": 1,
          "Date": "2021-08-18T21:24:17.000Z",
          "Titre": "Billing issues",
          "Contenu": "Was quoted one thing and charged totally different. They are making the steps to fix the problem but I feel this should have been done correctly in the first place. Also invoices should not start to be billed until the phones are actually in place and running correctly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2021-09-23T20:13:03.000Z",
          "Titre": "Tony Forliano was amazing as always as…",
          "Contenu": "Tony Forliano was amazing as always as my direct sales person.  The processing by the OnSip employee was not great.  I had to send the information 4 times and continued to receive requests for it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cathie",
          "Nb_Reviews": 2,
          "Date": "2022-07-01T21:16:40.000Z",
          "Titre": "VERY  FRUSTRATED WHEN THE MOBLIE APP…",
          "Contenu": "VERY  FRUSTRATED WHEN THE MOBLIE APP DOESTN'T WORK AND RECEIVE A VOICEMAIL INSTEAD OF MY PHONE RINGING"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jsmallwood",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T14:47:33.000Z",
          "Titre": "Very happy with the level of Customer…",
          "Contenu": "Very happy with the level of Customer Service but the Technical Issue remains.  Hoping a fourth call will be able to facilitate the resolution."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bill Nye",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T21:18:00.000Z",
          "Titre": "For Voice service OnSip works really…",
          "Contenu": "For Voice service OnSip works really well.  Their Tech & Support staff are great.  Where they are a bit short is with txt.  So much of the world is going to txt.  And OnSip is a bit pricey too.  As these things go, nice people."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rabie Alsharairi",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T23:30:21.000Z",
          "Titre": "you need to add call recording"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Julie Kuhn",
          "Nb_Reviews": 3,
          "Date": "2022-09-15T19:07:09.000Z",
          "Titre": "it took awhile to get the app set up to…",
          "Contenu": "it took awhile to get the app set up to play the voice recording"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carmen Gunn",
          "Nb_Reviews": 2,
          "Date": "2020-12-14T14:44:48.000Z",
          "Titre": "We have our extensions forward to our…",
          "Contenu": "Goos service most of the time. However, We have our extensions forwarded to our OnSIP numbers to our cell phones for when we are away or working from home. The biggest problem is the length of time to get to the cell phone. There have been many times it would ring once or a half ring and I couldn't answer. Yet I get a voicemail."
        },
        {
          "Note": 3,
          "Lieu": "AW",
          "Pseudo": "Mary  Ahlers",
          "Nb_Reviews": 4,
          "Date": "2020-07-12T10:12:46.000Z",
          "Titre": "Overall",
          "Contenu": "Overall, the mission of product is very good. There are just a few things that could use improvement. Login and time away buttons could be better positioned that across the screen from each other. Nice to see all calls in and out are now listing in your screen que. The phone App was horrible for me. Did not work, stuck in the on or off position constantly. Finally had to talk it completely off my phone. Hope this helps!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JD Matthews",
          "Nb_Reviews": 2,
          "Date": "2020-08-03T12:38:19.000Z",
          "Titre": "It's not a bad system...",
          "Contenu": "It's not a bad system, but it's not a great system either.  The online portal is a little clunky.  But tech support is awesome.  Finally, the app is kind of worthless, as it never seems to work more than once in a row.But you get what you pay for.  Most of the time, we have no issues and it works well.  Just don't plan on using the app or some of the extended features as they seem to \"still be in production\"."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Max",
          "Nb_Reviews": 2,
          "Date": "2020-04-13T19:15:56.000Z",
          "Titre": "Many issues with the mobile app.",
          "Contenu": "The ringtone is terrible, the calls ring an inconsistent amount of times, the call when answered in the preview window on a cell phone does not seem to actually answer the call, it just opens the app where you have to accept the call a second time, the app for mobile is very sparse, the caller ID shows you the caller's email as opposed to their name which is just silly. That said, the app is working and making calls so I guess it works on that front."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sue T",
          "Nb_Reviews": 2,
          "Date": "2018-12-25T15:49:24.000Z",
          "Titre": "To use this software",
          "Contenu": "To use this software, you will need to have the reliable WIFI, so that the call does not have too much static.  Also the call that supposedly to end, sometimes still seems to be connected.  I was told that it will get disconnected at some point, however, if I'm to pay for each minute, this can be annoyed without knowing if the call is truly disconnected or not."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Administrator",
          "Nb_Reviews": 1,
          "Date": "2018-10-31T00:38:21.000Z",
          "Titre": "Almost everything works almost all of…",
          "Contenu": "Almost everything works almost all of the time, but the edges are rough. Sometimes phones stop working - not all of them, just some. It's impossible to call one particular pizza place, although a cell gets through to them - any cell service. There's very little customization. Everything is either easy or impossible."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ppeavler",
          "Nb_Reviews": 1,
          "Date": "2020-02-17T22:20:06.000Z",
          "Titre": "The phone app is really tricky",
          "Contenu": "The phone app is really tricky. You can put it on Do not disturb and still get calls coming through. It also doesn't pick up well and oftentimes people have to call back. I also wish that you could attach the pay as you go to a bank account, rather than to a credit card."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "W. Conner",
          "Nb_Reviews": 1,
          "Date": "2019-06-17T12:32:36.000Z",
          "Titre": "OnSIP is a Solid, but Overpriced Service",
          "Contenu": "OnSIP is a solid, but overpriced service for the average residential or small business customer. Monthly service prices are high enough that they should include significant free minutes if not unlimited minutes. Monthly prices seem to assume significant OnSIP-provided administration costs, even in cases were OnSIP provides no user-requested administrative services for a very extended period of time. The average customer is likely to find more than adequate functionality with similar availability (and possibly faster call completion times) at a 80% discount simply by shopping around."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason Gardner",
          "Nb_Reviews": 1,
          "Date": "2020-04-06T13:49:40.000Z",
          "Titre": "Conference calling does not work in…",
          "Contenu": "Conference calling does not work in your app... that is a thing for my users....very disappointing.  I know it works in the Mozilla Browser... but my team has been using the app for a few months.... changing behavior will be tough."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cathie",
          "Nb_Reviews": 2,
          "Date": "2019-07-25T18:24:36.000Z",
          "Titre": "I find the phones very difficult to…",
          "Contenu": "I find the phones very difficult to use. I do like the feature that I can use my cell phone when working remotely, I was the wrong tone could be changed.  The voice mail system doesn't leave time and date stamps"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GM",
          "Nb_Reviews": 1,
          "Date": "2020-12-31T20:16:24.000Z",
          "Titre": "App lags a lot",
          "Contenu": "App lags a lot. Hard to listen to voicemails because it shows an error every time I want to listen to one. Takes about 10 seconds to go to the onsip screen when answering a call from Lock Screen."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rick Smith",
          "Nb_Reviews": 1,
          "Date": "2020-05-26T21:04:17.000Z",
          "Titre": "When connected to onsip",
          "Contenu": "When connected to onsip, when you dial a number, it's very slow with tone responses so you don't know if the number is being received and you can't tex?"
        },
        {
          "Note": 3,
          "Lieu": "CL",
          "Pseudo": "Danny Sanchez",
          "Nb_Reviews": 1,
          "Date": "2021-01-11T12:51:58.000Z",
          "Titre": "We have presented some failures in the…",
          "Contenu": "We have presented some failures in the contracted service, sometimes we cannot make calls to certain numbers, or we do not receive calls at all."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Integrator",
          "Nb_Reviews": 2,
          "Date": "2020-10-19T16:53:00.000Z",
          "Titre": "conferencing needs to improve",
          "Contenu": "We expect better conferencing capabilities and a much better phone app with more customization and battery saving dark mode for mobile platforms."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JH",
          "Nb_Reviews": 1,
          "Date": "2021-11-19T20:11:45.000Z",
          "Titre": "Service is good, app is trash.",
          "Contenu": "Service is good, but the app is trash."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2018-10-24T09:29:36.000Z",
          "Titre": "The outage affected my review",
          "Contenu": "I drop two stars due to the two day outage the first week after i signed up. Other than that the service has been good."
        },
        {
          "Note": 3,
          "Lieu": "CO",
          "Pseudo": "Luis Porras",
          "Nb_Reviews": 1,
          "Date": "2020-02-11T20:14:56.000Z",
          "Titre": "failures in calls to Ecuador",
          "Contenu": "Most of the time I call Ecuador, the call comes in but nothing is heard ... He is speechless."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tarzan",
          "Nb_Reviews": 4,
          "Date": "2020-09-12T23:42:09.000Z",
          "Titre": "Excellent phone support",
          "Contenu": "Excellent phone support.  Dashboard needs improvement and needs to be much more intuitive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Integrator",
          "Nb_Reviews": 2,
          "Date": "2020-07-10T19:13:14.000Z",
          "Titre": "Apps need user experience update.",
          "Contenu": "Incomplete solution. Needs better integration with Google Gsuite and Microsoft 365"
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Kosu Gute",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T19:00:33.000Z",
          "Titre": "All Hard Work"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "kate",
          "Nb_Reviews": 1,
          "Date": "2020-08-17T12:54:24.000Z",
          "Titre": "sometimes my phone and app don't…",
          "Contenu": "sometimes my phone and app don't receive the same calls"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian Erle",
          "Nb_Reviews": 4,
          "Date": "2019-09-02T11:02:53.000Z",
          "Titre": "Great value and support but short on unified communications features",
          "Contenu": "Good value for the money spent.  Support is excellent when it is available but I find not having weekend phone support sometimes limiting.  When Onsip support is available it is top notch.  It is also provided by people speaking English as a first language.  Their web site integration with sayso is a nice feature allowing a nice phone transition to a person but I fear that the lack of a true texting experience is a gap which causes you to engage other service providers to provide that feature.  Call quality is excellent but we experience call scenarios where calls are connected but the calling party does not hear the caller right away which leads to a rough beginnings to calls.  Music on hold as well as custom messages has not worked with web or application based phones only with a hard phone.  This leaves clients/customers/patients listening to dead air often resulting in them believing the call has been disconnected and they hang up.  It is being remedied but this is a basic feature for any business system and another big gap in features especially if you want to run your office without physical phones.  OnSIP is our first foray into VoIP and we have enjoyed a good value for the money.  However the lack of integrated SMS/MMS texting, fax service (this is not encouraged), a good inter-office chat feature (they have one, but only using the desktop app) and the lack of other features like file sharing or screen sharing is leading us to investigate other providers that offer these integrations.  We have too many agreements and providers to bring unified communications to our office and customers.  I wish OnSIP had this stuff because their support and configuration is great.  However we have a business to run."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Real Estate broker  MA",
          "Nb_Reviews": 2,
          "Date": "2020-12-25T04:59:41.000Z",
          "Titre": "Good product & hard to cancel",
          "Contenu": "Good VoIP systemHard to cancel service"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kteasdale",
          "Nb_Reviews": 3,
          "Date": "2021-01-12T17:51:23.000Z",
          "Titre": "does not meet our needs"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "nasir kambo",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T22:21:46.000Z",
          "Titre": "Their instructions were helpful"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elise D.",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T15:48:47.000Z",
          "Titre": "Customer service great, mobile app needs some work",
          "Contenu": "Customer service is prompt to reply and helpful, but having issues with the mobile app is not ideal (the reason why I had to contact customer service). For one, the app wasn't ringing when a call was coming through - customer service helped me fix that. For two, the mobile app sometimes drops calls - also not ideal, and as of yet, not fixed. Onsip via the online app and a desktop phone seems to be working well, but the mobile app needs some help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Colleen Nelson",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T00:57:15.000Z",
          "Titre": "We've had ONSIP for over a decade and…",
          "Contenu": "We've had ONSIP for over a decade and love the service, choices and the support you receive. Recently we had our bank card compromised and were waiting for it to show up. Onsip worked with us to ensure we kept our service while waiting on the new card. They were very kind and understanding.  Highly recommend their service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Catharina.Chapman",
          "Nb_Reviews": 1,
          "Date": "2021-11-09T22:36:07.000Z",
          "Titre": "Good sound quality",
          "Contenu": "Hi there, I am so glad to be using OnSIP. The sound quality is wonderful. The only reason I gave it a 4 instead of a 5 is because I tried to set it up to where my voicemails could be transcribed into my email account, and thought I did it correctly, but the voicemails are not showing up in my inbox. I followed the directions, so am not sure what is keeping this from happening. Perhaps my company doesn't allow this. Any guidance you can give me would be much appreciated. Thank you~"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason Burch",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T17:48:39.000Z",
          "Titre": "Basically using the voicemail to email…",
          "Contenu": "Basically using the voicemail to email which works great. Our tech company set things up. I did use the voicemail system to set up the greeting. I would give the voicemail system 1 star. I was surprised at how badly it functioned. Otherwise very happy with the system."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Richard G",
          "Nb_Reviews": 3,
          "Date": "2023-01-10T20:00:12.000Z",
          "Titre": "Some Expected Features Missing",
          "Contenu": "I found it surprising that all members of a group couldn't access voicemails or call history for all calls received by the group.Also, the workaround of sending files to our support center is clumsy, because they are not in a more common mp3 format that the support platform opens directly, we have to download and open the file."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Glennys Abreu",
          "Nb_Reviews": 1,
          "Date": "2022-05-21T20:27:16.000Z",
          "Titre": "Reached out several times",
          "Contenu": "Reached out several times. Some instructions were helpful. The first time the agent asked me to reboot the phone and call back instead of holding and waiting to see if that worked. Restarting did not work. My experience is usually a good one; not so much this time around.Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matt Sansbury",
          "Nb_Reviews": 1,
          "Date": "2022-09-11T01:53:09.000Z",
          "Titre": "Quality of services over many years was…",
          "Contenu": "Quality of services over many years was great. Very high uptime. Customer service was good. More expensive than competitors for small accounts below five users."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T16:21:55.000Z",
          "Titre": "Support was able to provide some…",
          "Contenu": "Support was able to provide some direction but most of it pointed to internal network issues.  It turns out this issue was at the ISP."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason Habetz",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T15:48:44.000Z",
          "Titre": "Eden was very helpful setting everthing…",
          "Contenu": "Eden was very helpful setting everthing up.  Dave has been great and responding very quickly to tech issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J Lewis",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T17:32:11.000Z",
          "Titre": "Phone call was great",
          "Contenu": "Phone call was great, clear, no interruptions.I tried the video conferencing feature, but was not successful."
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "Omar Fayoumi",
          "Nb_Reviews": 1,
          "Date": "2021-09-06T20:06:53.000Z",
          "Titre": "OnSip is a great free service to test…",
          "Contenu": "OnSip is a great free service to test your understanding of your VoIP phone hardware"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "lgcsfront",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T22:16:09.000Z",
          "Titre": "Voicemail set up",
          "Contenu": "When OnSIP was set up I wasn’t able to retrieve my voicemail. I called n and they were able to help me. Everything is working well now. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Len Cardinal",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T16:30:05.000Z",
          "Titre": "Clean interface",
          "Contenu": "Clean interface. Good customer support.Would like to see native Teams integration."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gene",
          "Nb_Reviews": 2,
          "Date": "2021-08-16T15:05:08.000Z",
          "Titre": "OnSip phone system is fantastic",
          "Contenu": "OnSip phone system is fantastic. Installation is fairly straightforward. However, to the non-technical person those instructions that are simple to OnSip support are difficultto understand."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nichole",
          "Nb_Reviews": 2,
          "Date": "2021-01-26T14:49:07.000Z",
          "Titre": "2 companies",
          "Contenu": "The company I work for uses OnSip and they put me in control of it. I love that we can assign new phone numbers to our employees to prevent having to use their personal phones for work. I use 1 system for 2 different companies that I run and it is great! Rarely are there issues and when there are the support staff is very quick and helpful with a resolution."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sai",
          "Nb_Reviews": 2,
          "Date": "2020-06-25T17:45:23.000Z",
          "Titre": "Kudos to customer service team",
          "Contenu": "I strongly believe in connecting time to customer service and I called call customer service preparing to wait for next 30 min but the connection was less than a min. The lady who assisted me solved my 5 months efforts in setting up my account. Million Thanks to the lady and OnSIP call center team and looking forward to explore more."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wellnest OnSIP",
          "Nb_Reviews": 1,
          "Date": "2020-12-14T15:28:38.000Z",
          "Titre": "Thank you for your service.",
          "Contenu": "Thank you for your service.To me the weak part is the apps.The cellphone app I think the first version we used in 2018 was better than future updates, I was able to get the message for an incoming call the volume's call always low but okay.The desktop app works much better but, why you remove the option to add the whole directory list at once? that's very bad to me, it makes things  a little bit complicated having to add one by one. I would appreciate if you can revert that change.Thank youEliana Juarez"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 2,
          "Date": "2019-12-20T20:29:49.000Z",
          "Titre": "Great service,uptime and features",
          "Contenu": "Good reliable service for the price.  Doesn't have some of the high-end phone system features, but this system has been incredibly reliable and has scaled with us over the past six years.  There is probably only one additional feature that we would have liked to have had in all that time, otherwise OnSIP has more than covered our needs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2019-08-07T21:44:12.000Z",
          "Titre": "It's alright",
          "Contenu": "It's alright.   Sometimes doesnt connect.   The number pad dissapears when using it.   Clicking on a number to open drop down menu doesn't always work. Call quality is decent though.Edit:  OnSip reached out to me and directly addressed my concerns.   Great follow up and great customer service.  Upgrading this to 4 stars!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg Ransone",
          "Nb_Reviews": 1,
          "Date": "2019-07-08T16:49:16.000Z",
          "Titre": "I am reserving a star just to be sure…",
          "Contenu": "I am reserving a star just to be sure but things so far are going pretty well...  The staff has been very responsive during our evaluation process handling both simple and complex onboarding issues and not just telling me to look at a link.  Although the links provided have been informative and for the most parts have provided excellent reference and resolved the issue at the time.  We've made the decision to move forward with ONSIP and look forward to update with the 5th star in the not to distant future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carolina",
          "Nb_Reviews": 1,
          "Date": "2019-06-04T23:29:31.000Z",
          "Titre": "OnSIP has provided the best value…",
          "Contenu": "OnSIP has provided the best value compared to any other VoIP service provider we have evaluated over the past ten years. A couple of improvements we would like to see from OnSIP is support for SIP calls over TCP and TLS for better compatibility with platforms like WebEx. We would also like a much more eye-friendly user interface for the softphones, and the ability to log the softphone app into multiple OnSIP accounts at the same time, easily selecting one of those when placing calls. The closer the experience gets to the full power of a top-end Polycom, Cisco, or Yealink phone the better."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ralph Pennington",
          "Nb_Reviews": 1,
          "Date": "2020-10-27T10:58:41.000Z",
          "Titre": "Support is outstanding",
          "Contenu": "Support is outstanding - no waiting and you can get back to the original person you working with documentation needs some work on common issues hence 4 stars - things could be easier to ferret out it seems to meService itself is great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Highpoint Fitness",
          "Nb_Reviews": 1,
          "Date": "2021-01-29T20:52:34.000Z",
          "Titre": "Process of registration was great",
          "Contenu": "Process of registration was great - but the resource pages are not user friendly. Support staff is mostly very helpful, but some seem to be in a hurry to hang up. The menu for setting up is not as intuitive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Erle",
          "Nb_Reviews": 4,
          "Date": "2019-12-11T03:09:23.000Z",
          "Titre": "OnSIP offers top shelf support",
          "Contenu": "OnSIP offers top shelf support.  You are able to reach them quickly during the week and have your issues addressed by knowledgeable English-As-A-First-Language people.4 stars because they are Not available on weekends.  To support business they need to cover the weekend too.They offer some nice web site integration like their sayso buttons.   Their pricing I think is a little lower than their competitors but they are missing key integrations like texting and faxing as well as lackluster contacts support for both desktop and mobile apps.Call quality is excellent and the system is easy to configure and administer.  I like the OnSIP organization I just wish they offered integrated texting and faxing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-10-04T17:48:51.000Z",
          "Titre": "Changing where phone rings for new hire-"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Hethcoat",
          "Nb_Reviews": 1,
          "Date": "2021-03-22T17:40:15.000Z",
          "Titre": "Mixed - the tech support was awesome, the product needs work",
          "Contenu": "The tech support was awesome.  I think the product needs work.  The fact that you can't log in and out of the queue reliably from the app is not good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kylie-Jo",
          "Nb_Reviews": 1,
          "Date": "2019-07-22T20:03:05.000Z",
          "Titre": "OnSip Review",
          "Contenu": "I like using OnSip! Feedback I have is the ringtone when calling out is very, very shrill. I also have noticed there is a small delay when a client picks up the phone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Danny D",
          "Nb_Reviews": 1,
          "Date": "2019-09-20T21:55:31.000Z",
          "Titre": "The apps and resources system is…",
          "Contenu": "The apps and resources system is confusing, and calls get dropped for no reason, but the fact that they donate to charity when you review them is pretty cool."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leah",
          "Nb_Reviews": 2,
          "Date": "2019-02-25T14:39:55.000Z",
          "Titre": "Great customer service, great price",
          "Contenu": "Great customer service. And their actual service works very well also. It is not as feature-rich as RingCentral, but it's a lot more cost effective."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julie",
          "Nb_Reviews": 1,
          "Date": "2019-07-09T19:26:28.000Z",
          "Titre": "Onsip works great",
          "Contenu": "Onsip works great, but it helps if you're fairly tech-savvy.  If you're not, you'll have some trouble understanding the help desk people."
        },
        {
          "Note": 4,
          "Lieu": "AW",
          "Pseudo": "Mary  Ahlers",
          "Nb_Reviews": 4,
          "Date": "2020-10-27T09:51:43.000Z",
          "Titre": "95% of the time",
          "Contenu": "95% of the time, no snags. Excellent platform. Sometimes we have to realize is being dependent on cellular or wifi also has its impact"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-04-09T20:54:16.000Z",
          "Titre": "Great experience so far",
          "Contenu": "Great experience so far. Lacks flexibility in a few ways but overall a very dynamic and intuitive design. Would recommend over competitors."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Darbs",
          "Nb_Reviews": 1,
          "Date": "2019-07-24T19:08:33.000Z",
          "Titre": "This app has some great features and…",
          "Contenu": "This app has some great features and benefits that add value to the remote worker needing their office phone on hand wherever they go!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "lisa dubin",
          "Nb_Reviews": 1,
          "Date": "2021-11-12T19:20:52.000Z",
          "Titre": "The onsip worked well"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gazelle Admin",
          "Nb_Reviews": 1,
          "Date": "2019-03-23T17:09:19.000Z",
          "Titre": "The service had been great but we had a…",
          "Contenu": "The service had been great but we had a major outage and it took over an hour for them to recognize it after I reported it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Buse",
          "Nb_Reviews": 3,
          "Date": "2019-05-07T20:21:02.000Z",
          "Titre": "Great phone system service, unique pricing",
          "Contenu": "Great phone system service with unique pricing flexibility. OnSIP has served us and our customers reliably for over ten years. For organizations with more phones than users, which talk most internally, OnSIP is better than any other service. OnSIP makes multi-line Polycom phones extremely easy to provision and maintain. They also make creation of virtual PBX systems very easy. Non-technical users who can handle email and photocopiers can usually take pick up OnSIP administration functions after only minimal training. The system is so flexible that it can be used to create virtual key systems for those used to having their inbound phone lines appear on all of their phones. OnSIP-provided phone app software ought to support multiple accounts at the same time to function more like high-end VoIP desk phones, or OnSIP should consider a operator/reception app for users who would otherwise have a high-end VoIP phone with a light-panel sidecar. Conferencing capabilities on the OnSIP platform could use improvement. We would like to see conferencing capabilities comparable to TurboBridge.com, Dialpad, or Zoom."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carmen Gunn",
          "Nb_Reviews": 2,
          "Date": "2020-06-10T14:15:08.000Z",
          "Titre": "Call quality - great, However",
          "Contenu": "Call quality always seems to be great, However, sometimes the ghost phone numbers are only about 85% reliable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2019-07-23T19:54:18.000Z",
          "Titre": "works very well",
          "Contenu": "works very well.  sometimes just a few issues with connection and resetting with  blue tooth air pods, etc"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff Ferm",
          "Nb_Reviews": 1,
          "Date": "2021-03-05T20:58:03.000Z",
          "Titre": "Poor technical responses to issues that…",
          "Contenu": "Poor technical responses to issues that come up....such as constantly dropped internal calls, etc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony R.",
          "Nb_Reviews": 1,
          "Date": "2020-03-11T14:43:05.000Z",
          "Titre": "Decent control, solid support",
          "Contenu": "The configuration is complex, but the control panel is decent, and the support is quick and helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MHS",
          "Nb_Reviews": 2,
          "Date": "2019-06-21T19:14:28.000Z",
          "Titre": "First time user with VOIP",
          "Contenu": "Setup is not complete but product has a lot of promising features. Looking forward to Go live date."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2020-05-08T19:36:45.000Z",
          "Titre": "The service has been good",
          "Contenu": "The service has been good. I am not very pleased with the app. It lags and needs some work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joanne Green",
          "Nb_Reviews": 1,
          "Date": "2020-07-21T20:22:04.000Z",
          "Titre": "Support staff member was patient and…",
          "Contenu": "Support staff member was patient and fully explained the telephone system and  helped me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Admin",
          "Nb_Reviews": 2,
          "Date": "2019-12-09T20:45:29.000Z",
          "Titre": "Customer support is always available…",
          "Contenu": "Customer support is always available without waiting."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sai",
          "Nb_Reviews": 2,
          "Date": "2020-09-28T16:08:18.000Z",
          "Titre": "Great app except with little noise…",
          "Contenu": "Great app except with little noise during calls."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan Tyler",
          "Nb_Reviews": 1,
          "Date": "2019-09-30T15:20:02.000Z",
          "Titre": "Good Support",
          "Contenu": "Good support, just needs some tweaks to the UI."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "IT Department",
          "Nb_Reviews": 1,
          "Date": "2019-02-17T15:33:43.000Z",
          "Titre": "The support team has always been…",
          "Contenu": "The support team has always been responsive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kelley Raunec",
          "Nb_Reviews": 1,
          "Date": "2020-07-01T20:05:48.000Z",
          "Titre": "Good service",
          "Contenu": "Good service.  Loses connection to wifi."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessica Anderson",
          "Nb_Reviews": 1,
          "Date": "2019-07-30T16:19:09.000Z",
          "Titre": "Response time was quick and efficient."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill Leininger",
          "Nb_Reviews": 3,
          "Date": "2021-05-26T02:45:55.000Z",
          "Titre": "Bill Leininget",
          "Contenu": "Good service!  Fair Prices!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 1,
          "Date": "2019-07-17T20:11:38.000Z",
          "Titre": "Good program!",
          "Contenu": "Good program!Easy to use"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carissa",
          "Nb_Reviews": 2,
          "Date": "2019-10-11T16:35:56.000Z",
          "Titre": "Not too user friendly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2019-07-24T21:26:45.000Z",
          "Titre": "Review",
          "Contenu": "Good quality"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Mehri Madarshahi",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T02:44:05.000Z",
          "Titre": "A prelude for diplomatic ties!?  access was precious since I managed…",
          "Contenu": "The access was precious since I managed to use this facility contacting my contact in the US from China where I was traveling. A good omen for China -US dialogue before it actually took place! Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R Scott",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T23:19:57.000Z",
          "Titre": "A Good and Valuable Experience",
          "Contenu": "I have had a fantastic experience with OnSIP's hosted PBX services. The full suite of functionality, the QOS, the unparalleled support all make doing business with OnSIP more than a transaction. It is a good and valuable experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather Reed",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T16:12:44.000Z",
          "Titre": "The customer service is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leah Trevillyan",
          "Nb_Reviews": 4,
          "Date": "2023-10-09T14:21:04.000Z",
          "Titre": "Excellent Customer Service as Always",
          "Contenu": "Excellent Customer Service as AlwaysDave was super helpful with my question, answered quickly and walked me through so that I can know how to do it myself. Onsip's awesome, responsive, stateside-based customer care is a huge factor that keeps us using their services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Billing Manager",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T17:35:30.000Z",
          "Titre": "Chat CSR was friendly",
          "Contenu": "Chat CSR was friendly, knowledge and solved my issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jkelly",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T00:00:44.000Z",
          "Titre": "Had issues with phones working",
          "Contenu": "Had issues with phones working. Immediately helpful, fixed in under 5 minutes.The more important factor in give the Five Star rating is that they make their customers feel important to them as they worked quickly to resolve our problem.We have been with them for over 10 years, seldom need to call, but always pleased with the results."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Max Harris",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T19:14:17.000Z",
          "Titre": "Overall a great company",
          "Contenu": "Overall a great company so far, easy implementation with our system and help along the way from their team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendy",
          "Nb_Reviews": 3,
          "Date": "2023-11-13T15:53:09.000Z",
          "Titre": "Responsive",
          "Contenu": "Responsive, efficient and easy to work with"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan Guzman",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T19:22:49.000Z",
          "Titre": "Great Service from Eden and OnSIP",
          "Contenu": "Eden Harvest was awesome! Very friendly, knowledgeable, professional, and patient. He made my company's transition to a new phone system very easy. He walked us through every solution/OnSIP app we were curious about, answered every question, and made everything seem so simple. OnSIP works great, and has been an awesome solution to our phone issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Grace Kang",
          "Nb_Reviews": 9,
          "Date": "2023-06-18T14:08:20.000Z",
          "Titre": "great robust, flexible and stable hosted voip system",
          "Contenu": "We have been using the Basic PLAN which is built for customers with a lower call volume\" since 7 years ago. Onip hosted voip system is a great, and right system to meet our needs, the system never had a down time, it is very stable, robust system."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael M.",
          "Nb_Reviews": 2,
          "Date": "2023-02-12T18:42:32.000Z",
          "Titre": "Great Customer Support",
          "Contenu": "OnSIP's customer support is second to none.  That's especially  helpful here, because this is my first experience VOIP, so I have more need for support needs than I otherwise would.  (Now if only they had more detailed documentation, I would have less need for support (hint, hint).  Still, great company with great support.)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Alexander",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T16:32:33.000Z",
          "Titre": "Eden Harvest and ONSIP are top notch",
          "Contenu": "Eden Harvest with ONSIP is top notch. I give this 5 star rating simply due to working with them for the last 2 years. I migrated 5 offices, 4 companies, and roughly 800 numbers over to onisp and it went without a glitch. Love reaching out to a local support line, very knowledgeable staff, and quick response time with every problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allison Holt",
          "Nb_Reviews": 4,
          "Date": "2023-09-18T15:59:09.000Z",
          "Titre": "I have always had a great experience…",
          "Contenu": "I have always had a great experience with OnSip. They are helpful and knowledgeable and work the way business does. I recommend them to anyone looking for a versatile and robust VOIP system."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T08:21:06.000Z",
          "Titre": "This team rocks",
          "Contenu": "This team rocks, from answering basic sales questions to tech support. We've used OnSIP for 17 years and recently I needed help and was truly impressed. Also, our tech team researched and approved the quality of the platform. 100% happy customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hamilton Palmer",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T23:19:03.000Z",
          "Titre": "I generally do not give 5 stars",
          "Contenu": "I generally do not give 5 stars as something can go downhill from that last star.  The 5 stars are for the person who I initially spoke with and the technical engineer he brought in to answer technical questions I had.  Thank you and this is 2 weeks later and all working well.Just fyi, I contacted maybe 6 or 8 other providers who were all interested in selling me stuff but could not answer my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pearland CRC",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T21:34:39.000Z",
          "Titre": "Overall Great Experience",
          "Contenu": "Everyone we have spoken to has been extremely helpful and I appreciate that they follow up and don't just leave us trying to figure everything out with no way to contact anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marianna, NC",
          "Nb_Reviews": 2,
          "Date": "2022-08-22T18:28:53.000Z",
          "Titre": "Why should you work with OnSip?",
          "Contenu": "OnSip has been a great company to work with, regarding our company phone needs. We don't worry about it day-to-day, it just always works. Whenever assistance is needed, its great knowing you are going to be speaking with a human, who is ready to jump on your requests. Their team goes above and beyond, for simple requests. Very thankful to have them on our side!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Whitney Jackson",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T15:22:31.000Z",
          "Titre": "Great customer support",
          "Contenu": "The customer service rep was fabulous and called me multiple times as we trouble-shot to resolve my tech issue. He was patience, nice and personable with a low-key sense of humor that helped keep me from stressing out since I need onsip when telecommuting. Very happy with the service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Kretch",
          "Nb_Reviews": 1,
          "Date": "2022-05-04T00:27:31.000Z",
          "Titre": "Excellent service",
          "Contenu": "From the time I found out that my small business needed a new phone system to the time that we were up and running with OnSIP I could not have asked for a better transition. I came into some hardware problems which were solved by my rep who put in several hours of troubleshooting is to leave me very satisfied. She went above and beyond. I have already recommended them to several of my colleagues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronreese Redd",
          "Nb_Reviews": 1,
          "Date": "2021-12-13T15:56:27.000Z",
          "Titre": "We had an issue with a user who was…",
          "Contenu": "We had an issue with a user who was unable to call externally and could only dial extensions. We worked with 3 different people, but Kimberly Rider Whaley stood out. She was extremely helpful and consistently following up regarding the status of the issue. Thank you Kimberly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Barlett",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T18:44:43.000Z",
          "Titre": "On sip experience",
          "Contenu": "On Sip provided a consistent good phone experience. Especially useful was the phone number we could call to retrieve messages when we were not there. Very helpful when we had multiple phones(5)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "scott_kirsch",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T15:31:40.000Z",
          "Titre": "I have already left a review",
          "Contenu": "I have already left a review.  My experience with OnSIP was excellent.  Your customer was delighted to hear her phones ringing for the first time since she got them in November of 2021.  I believe my representative was Dave.  He was very knowledgeable and helpful and worked with me and his customer to get the phones online, provisioned, and updated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenda Crawford",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T13:21:45.000Z",
          "Titre": "Outstanding Customer Service",
          "Contenu": "David was amazing and very patient with me. He went above and beyond to help me fix the issues we were having with another product in order to get my issue resolved. I am very grateful to have had him guide me through and do step by step."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom McNew",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T18:42:40.000Z",
          "Titre": "First class Customer Service",
          "Contenu": "First class Customer ServiceA very unusual circumstance in this day and age!!  All of my questions were answered quickly, professionally, and the upmost patience and respect. We will be using your service again in the very near future!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marissa L",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T21:10:23.000Z",
          "Titre": "Kimberly and Paul",
          "Contenu": "Kimberly and Paul were nothing short but sooo genuine and smart and patient . Kimberly took her time to listen to me and to explain things in a way that made sense and answered all my questions to the best of her ability . She also went over and beyond and emailed me information to help me in case I needed support if I ran into any issues once we got off the phone. She let me do a bunch of test calls to make sure my phone worked. She listened and she answered my questions and made this whole process be what it was, which is easy and understandable. Thank you Kimberly and thank you Paul for your help today setting up the lap top to accept calls."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd Martin",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T15:12:28.000Z",
          "Titre": "My last experience went very smoothly",
          "Contenu": "My last experience went very smoothly, thanks to Eden Harvest for helping me threw the process of Porting the phones. I'm not at all a Tech person, service has been great! Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tanya Barnes",
          "Nb_Reviews": 1,
          "Date": "2022-09-20T18:07:21.000Z",
          "Titre": "We were receiving internet spam calls",
          "Contenu": "We were receiving internet spam calls.  The problem escalated to over 200 calls and 50 voicemails left to ONE extension.  The problem was taken care of swiftly which made everyone in the office very happy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shayna Lee",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T21:04:46.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "This company has great customer service! Chuck Dunne has been helping us set up new phones for our whole office and is extremely responsive and helpful! Overall 5 stars for service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Kolf",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T21:29:20.000Z",
          "Titre": "You have one contact person",
          "Contenu": "You have one contact person. Mine was Mike Steiner. He took care of concerns and actually answered my phone calls.  Our business runs on the phone and porting it over is scary.  Having one point of contact made it so much easier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kayren Ohnhaus",
          "Nb_Reviews": 1,
          "Date": "2021-11-01T22:33:41.000Z",
          "Titre": "The system is flexible and easy to use",
          "Contenu": "The system is flexible and easy to use.  We really appreciate the quality of the service and are getting so many great features for way less money than our old phone service. We really enjoy being able to transfer a call from the desk phone or computer to a cell phone and take a call with us.  It is great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kat",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T21:07:22.000Z",
          "Titre": "It was an enjoyable experience",
          "Contenu": "It was an enjoyable experience. The support staff that talked/assisted me where very helpful. They were patient with my slow understanding of how the phones work. Paul and Kimberly were a delight to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott B",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T01:50:04.000Z",
          "Titre": "OnSip and Eden Harvest provide a great VOIP solution",
          "Contenu": "The company that I work for was recently in a position to switch VOIP providers. After doing some research, we decided to go with OnSip primarily due to its reporting capabilities and ease of use. We ported our numbers this past week, and are very pleased with the service we've received. OnSip reps have always been helpful and patient with our questions, and have proven themselves to be very knowledgeable about their business. In particular, Eden Harvest was essential in facilitating our transition from our former provider to OnSip. He answered all of our questions comprehensively and quickly, and was great to work with. He really is an asset to OnSip, and I'd would recommend anyone interested in adopting a VOIP system work with him. We are very happy with OnSip and it has solved many, many of our issues. I would absolutely recommend OnSip and Eden Harvest."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T00:28:33.000Z",
          "Titre": "10 Stars!!! 🎉🎆🤩",
          "Contenu": "10 Stars!!! 5 for JR and 5 for Vicki. 😁 Really the whole OnSip team is always helpful, informative, professional, and friendly. We couldn't get better service or support elsewhere."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dawn",
          "Nb_Reviews": 3,
          "Date": "2023-05-10T14:47:01.000Z",
          "Titre": "It was late in the day and I needed…",
          "Contenu": "It was late in the day and I needed help resetting somevoicemail and password information and someone picked up and answered my questions in a few minutes and then emailed everything also. Great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "llarocca",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T15:48:32.000Z",
          "Titre": "The knowledge and going above and…",
          "Contenu": "The knowledge and going above and beyond to help. Even though they didn't have the same make and model of a phone as I did. they did their best. Which is always appreciated. Not to say there isn't room for improvement. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Isae",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T15:59:08.000Z",
          "Titre": "Kim was awesome",
          "Contenu": "Kim was awesome! She was patient and clearly knowledgeable. I had zero experience with OnSip and she was able to effectively walk me through the steps to solve the issue I was having."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dmacnamara",
          "Nb_Reviews": 1,
          "Date": "2022-06-13T16:07:01.000Z",
          "Titre": "As always, wonderful!",
          "Contenu": "As always, the team at OnSip, whomever I work with, is incredibly helpful, patient, kind, and goes out of their way to make it an easy and pleasant experience for me, a person who is very easily frustrated and intimidated with all things technological! I am extremely grateful for your help and especially, your lovely personalities! Thank you, all!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcia",
          "Nb_Reviews": 2,
          "Date": "2022-05-02T14:09:19.000Z",
          "Titre": "Always amazing customer support",
          "Contenu": "Always amazing customer support. My favorite thing about onsip. Customer service won't quit until your problems are solved. It's amazing. Thank you so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Grace Kang",
          "Nb_Reviews": 9,
          "Date": "2023-03-05T04:16:26.000Z",
          "Titre": "Great job onsip has been doing since we…",
          "Contenu": "Great job onsip has been doing since we started use onsip system, and that’s why we stay with onsip  for 7 years even though the recent new interface of admin portal are not very friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Giganti",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T21:54:39.000Z",
          "Titre": "Eden, Vicki and Mike -- OnSip's Three Musketeers",
          "Contenu": "The people, the competency and the quick, effective solution.  I'm new to onsip, but I've been really impressed by their professionalism and aptitude."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Adams",
          "Nb_Reviews": 1,
          "Date": "2022-08-21T23:07:14.000Z",
          "Titre": "Simple and effective, great support",
          "Contenu": "We've worked with OnSIP for 3 years. Set it and forgot it. We needed to reconfigure the whole system, with OnSIP support staff it took less than 30 minutes to implement."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allison Holt",
          "Nb_Reviews": 4,
          "Date": "2022-06-06T15:50:59.000Z",
          "Titre": "OnSip is a great VOIP service",
          "Contenu": "OnSip is a great VOIP service. We are very happy that we can manage every scenario for callers and employees without breaking the bank, and the customer service is fantastic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nareg Keledjian",
          "Nb_Reviews": 1,
          "Date": "2022-07-11T18:04:43.000Z",
          "Titre": "Excellent!",
          "Contenu": "Paul Jacobsen was very helpful with troubleshooting setting up Polycomm phones with one of our customers. He was excellent! We appreciate him very much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Fricklas",
          "Nb_Reviews": 3,
          "Date": "2022-02-12T21:50:31.000Z",
          "Titre": "OnSIP is always there when I have a…",
          "Contenu": "OnSIP is always there when I have a technical issue - and for as long as I need.  Customer success is outstanding.  And I’ve never had a reliability issue - when I need help it is only about configuring something new"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stewart McMillan",
          "Nb_Reviews": 1,
          "Date": "2022-02-20T21:01:11.000Z",
          "Titre": "Best support of any tech company!!",
          "Contenu": "Every  call to support has been a pleasure. I love the instant chat feature.   Do not need support often as the system is rock solid but when I do it's excellent"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dr Jeff Gold",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T23:59:01.000Z",
          "Titre": "Amazing customer service and support",
          "Contenu": "Vicki was completely cordial and supportive towards the office needs, especially when it involved my practice's emergency forwarding to my cell for my patients. She figured out the problem and solved it within 2 days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kris Ortiz",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T23:06:52.000Z",
          "Titre": "Love OnSIP Support!",
          "Contenu": "OnSIP support was wonderful as usual! Quick to respond and quick to provide a resolution. OnSIP really does have some of the best customer service i've ever seen."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Talley",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T01:39:16.000Z",
          "Titre": "Friendly Professional Effective",
          "Contenu": "The person I spoke with was friendly and professional.  She knew exactly how to solve my issues and have clear consider instructions.  They worked the very first time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ali Rashid",
          "Nb_Reviews": 2,
          "Date": "2023-07-22T23:28:51.000Z",
          "Titre": "Best Customer Service and knowledgable…",
          "Contenu": "Best Customer Service and knowledgable staff with patience walked me through every step of the way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2022-07-18T15:46:07.000Z",
          "Titre": "Fast & Efficient Assistance",
          "Contenu": "It was great to know that a real human was immediately accessible and our long term/annoying tech issue was resolved quickly and efficiently. Thanks, Onsip/Larry!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas at Midtown Title",
          "Nb_Reviews": 4,
          "Date": "2023-09-18T21:12:12.000Z",
          "Titre": "Support Tech was super helpful on…",
          "Contenu": "Support Tech was super helpful on getting a new employee's phone up and working."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Megan Harpin",
          "Nb_Reviews": 1,
          "Date": "2022-02-12T17:43:01.000Z",
          "Titre": "Best customer service and hands on onboarding!",
          "Contenu": "As a small business owner in a customer service business (a day spa and hair salon), serving over 100 guests per day, we were anxious about switching over our phones, the lifeline to our business. Eden Harvest and his team were so thoughtful and supportive every step of the way. He successfully programmed our system and trained us on how to use the phones, Eden even coordinated with our IT professionals and remained in contact during the actual day of install and when we finally went live! My team and I love OnSIP and our new phones - we have already used the remote features during the last snow storm and are loving the ease of use, transferring calls, changing hold messages etc. Eden’s attention to detail and committed support was critical and the reason we had such a positive and successful switch of our telecommunications system. We couldn’t be more grateful and we 100% recommend Eden Harvest and OnSIP to any small business looking for cutting edge telecommunications solutions! Megan HThe Spa at Litchfield Hills"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandy",
          "Nb_Reviews": 3,
          "Date": "2023-09-25T17:57:17.000Z",
          "Titre": "One and Done",
          "Contenu": "One phone call and explanations were made and account fixed.  Very professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cgeorge",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T22:58:55.000Z",
          "Titre": "very quick to respond and was able to…",
          "Contenu": "very quick to respond and was able to fix our problem rather quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dustin Holzberger",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T17:17:55.000Z",
          "Titre": "Always a pleasure dealing with Onsip's…",
          "Contenu": "Always a pleasure dealing with Onsip's support folks.  Great Job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "execasst",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T03:15:33.000Z",
          "Titre": "Customer support is so wonderful",
          "Contenu": "Customer support is so wonderful. They are alway so patient and helpful. Paul is the best!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Seth Goldberg",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T17:41:48.000Z",
          "Titre": "Chuck is fantastic",
          "Contenu": "Chuck is fantasticHe has helped us tremendously through the set up and implementation of our new service with OnSip."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Len",
          "Nb_Reviews": 1,
          "Date": "2022-06-28T04:54:03.000Z",
          "Titre": "Your support and service have always…",
          "Contenu": "Your support and service have always been outstanding! If we hadn’t been forced to buy a minimum of 5 accounts we would still be with you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T15:08:22.000Z",
          "Titre": "Conversion",
          "Contenu": "Dave really helped me with a conversion we were doing where we needed to make some big changes in our phone workings.  We couldn't have done it without him."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 1,
          "Date": "2022-06-30T17:13:31.000Z",
          "Titre": "Easy to use",
          "Contenu": "I have used OnSIP for over 10 years and have to say this is the easiest most robust VOIP service out there. I used their system with 5 employees or 50 with the same ease."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Jones",
          "Nb_Reviews": 1,
          "Date": "2022-07-31T16:18:38.000Z",
          "Titre": "Always get awesome customer support…",
          "Contenu": "Always get awesome customer support with OnSIP!! Thanks for having our back!-Great River Outreach, nfp"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pcoleman",
          "Nb_Reviews": 2,
          "Date": "2023-07-24T17:09:22.000Z",
          "Titre": "great job",
          "Contenu": "The tech who helped me was courteous and patient and most helpful assisting with a tech issue"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jen Madden",
          "Nb_Reviews": 1,
          "Date": "2022-06-06T18:09:46.000Z",
          "Titre": "Great customer service",
          "Contenu": "Although the issue wasn't fully resolved (router issues), JR did everything he was able to and also offered alternate solutions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Guillermo Ahumada",
          "Nb_Reviews": 1,
          "Date": "2022-06-23T19:47:35.000Z",
          "Titre": "Great service",
          "Contenu": "Great service.  We have saved thousands of dollars by switching to OnSip.  We now use their product at 6 locations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 4,
          "Date": "2022-05-15T00:32:52.000Z",
          "Titre": "After many years of service I only…",
          "Contenu": "After many years of service I only remember 1 day of issues and that is fantastic I wish i could say the same for my cable company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "electrosonics",
          "Nb_Reviews": 2,
          "Date": "2021-10-27T15:27:32.000Z",
          "Titre": "Superfast response to my billing issue!",
          "Contenu": "I reached out to billing on a billing issue at the end of September and received a full credit for the issue the very next day. Now that's great customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Johnson",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T13:11:39.000Z",
          "Titre": "Excellent Service as always",
          "Contenu": "Excellent Service as always! Spoke with 3 different reps over the phone and each one offered great direction and advice!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victoria",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T11:50:45.000Z",
          "Titre": "GREAT customer support person",
          "Contenu": "I love the customer suppose person that helped me she was kind, patient and helpful. I am not a fan of the site and how nonuser friendly it is."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russell",
          "Nb_Reviews": 3,
          "Date": "2022-07-05T21:13:49.000Z",
          "Titre": "Painless Migration",
          "Contenu": "Clear communication and timelines, zero hitches porting numbers over.  Made it easy to convert from onprem PBX to cloud hosted VoIP service.  Planning on implementing at other locations using OnSIP due to this experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Greenberg",
          "Nb_Reviews": 4,
          "Date": "2023-01-18T14:16:47.000Z",
          "Titre": "Support is always spot-on",
          "Contenu": "Support is always spot-on.  Knowledgeable and professional. Available when we need them and they usually solve problem during the call."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshleen",
          "Nb_Reviews": 1,
          "Date": "2022-06-27T16:00:21.000Z",
          "Titre": "Customer Service",
          "Contenu": "Needed some assistance with voicemail, was able to get it corrected right away. The representative was kind, patient and knowledgeable. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lori Walker",
          "Nb_Reviews": 1,
          "Date": "2022-02-14T21:22:42.000Z",
          "Titre": "Onsip customer service is the best!",
          "Contenu": "Onsip customer service is the best!! I am always so pleased with the assistance I receive.  They are so patient and helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 5,
          "Date": "2023-03-14T21:06:41.000Z",
          "Titre": "good service",
          "Contenu": "I received an answer  quickly and the next day a follow up making sure the problem was solved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "aphifer",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T01:41:13.000Z",
          "Titre": "OnSIP Excellent Customer Service w/Lighting Speed!!",
          "Contenu": "I had a request for copies of invoices/receipts and Dave Lewert's response time was incredible.  What great customer service!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Literacy Together",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T21:52:04.000Z",
          "Titre": "On our way",
          "Contenu": "OnSip helped me through setting up a new extension and to keep another just for use through the app."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "cbatilo",
          "Nb_Reviews": 1,
          "Date": "2021-12-20T21:04:30.000Z",
          "Titre": "Awesome System! Excellent Service!",
          "Contenu": "Awesome System! Excellent Service! Thank you very much OnSIP team!Mike Steiner is a pro!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janemarie Clark",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T21:31:10.000Z",
          "Titre": "David and Eden are both top notch",
          "Contenu": "David and Eden are both top notch! So helpful, knowledgeable, and kind. Our issues are resolved and it took no time at all!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christie Quarles",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T17:51:58.000Z",
          "Titre": "Dave Lewert was awesome",
          "Contenu": "Dave Lewert was awesome. Professional and easy to work with. Five stars for Dave!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dawn",
          "Nb_Reviews": 3,
          "Date": "2022-12-09T23:36:51.000Z",
          "Titre": "Great customer service",
          "Contenu": "Was able to direct me to the answers I was looking for and walked me through anything I did not understand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "diana",
          "Nb_Reviews": 1,
          "Date": "2022-06-02T22:33:22.000Z",
          "Titre": "JR worked very very hard",
          "Contenu": "JR worked very very hard, and the issues were frustrating for me, but he was patient and we got it done"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2022-05-02T21:08:33.000Z",
          "Titre": "Great to work with!",
          "Contenu": "Although I was porting all our numbers out, these guys remained as helpful as ever.  I appreciate their professionalism and quick response!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Daugherty",
          "Nb_Reviews": 1,
          "Date": "2022-07-29T21:58:06.000Z",
          "Titre": "I just want to thank whom ever fixed…",
          "Contenu": "I just want to thank whom ever fixed the issue with calling Toll Free numbers from a Toll Free number."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "firststep",
          "Nb_Reviews": 1,
          "Date": "2022-10-16T20:54:41.000Z",
          "Titre": "Thank you",
          "Contenu": "I worked with Rochelle; she was professional and helpful.  She worked with me to accomplish what I was hoping to do."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Chief of Technical Army",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T16:28:49.000Z",
          "Titre": "It is important for people to know that technology works and use of technology is to improve every day quality of life , use of technology is not to defraud or swindle people, absolutely not."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Tam",
          "Nb_Reviews": 1,
          "Date": "2022-03-28T15:34:57.000Z",
          "Titre": "Support was welcoming and knew exactly…",
          "Contenu": "Support was welcoming and knew exactly what the solution to my issue was as soon as I described it to them on two different cases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DAS",
          "Nb_Reviews": 1,
          "Date": "2022-02-28T16:34:39.000Z",
          "Titre": "The rep that helped me add a new phone…",
          "Contenu": "The rep that helped me add a new phone to our system was very patient and explained the steps in detail."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 2,
          "Date": "2023-02-08T15:50:48.000Z",
          "Titre": "First rate support",
          "Contenu": "First rate support!  They always answer quickly and stay with you until the problem is solved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Hicks",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T21:06:47.000Z",
          "Titre": "Great Support!  Quick answers.",
          "Contenu": "Quick detailed response that provided exactly what I needed to fix my issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leah Trevillyan",
          "Nb_Reviews": 4,
          "Date": "2023-03-21T15:08:38.000Z",
          "Titre": "ABOVE and BEYOND Customer Service",
          "Contenu": "Although the interface can sometimes be confusing, the customer service is STELLAR, way ABOVE and BEYOND what I'd expect, and definitely makes me want to continue using their services. They work perfectly for medium - small businesses and the support provided allows anyone, IT department or not, to figure things out and make professional attendant menus, figure out voicemail configurations, adding users, you name it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa Gradel",
          "Nb_Reviews": 1,
          "Date": "2022-09-07T20:46:33.000Z",
          "Titre": "My first experience with OnSIP and I…",
          "Contenu": "My first experience with OnSIP and I have received he best customer service in a long time!  All representatives have been extremely helpful and always willing to assist with support and services!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wissam Zalzali",
          "Nb_Reviews": 1,
          "Date": "2021-12-10T20:04:41.000Z",
          "Titre": "BEST SERVICE",
          "Contenu": "BEST SERVICE, AWESOME PRICES,10 STARSBeen with Onsip for 8 years now and must say I am glad I connected with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 6,
          "Date": "2023-05-22T13:46:40.000Z",
          "Titre": "Onsip delivers the best in customer…",
          "Contenu": "Onsip delivers the best in customer support of any service provider I work with; hands down!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sal Barabuscio",
          "Nb_Reviews": 3,
          "Date": "2022-10-25T21:34:52.000Z",
          "Titre": "You guys are the best",
          "Contenu": "You guys are the best! If you don't have the answer you find it and get my issues resolved. J.R. and the rest of your staff take the time to be sure you understand just what they did.  Just wish you had weekend phone support. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 2,
          "Date": "2022-08-15T14:32:21.000Z",
          "Titre": "Quick and accurate answers",
          "Contenu": "Quick and accurate answers.  We were up and running again within 10 minutes of my call."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marshall",
          "Nb_Reviews": 3,
          "Date": "2022-12-14T20:46:20.000Z",
          "Titre": "We saved a lot of money using on SAP…",
          "Contenu": "We saved a lot of money using on SAP and the quality is excellent completely satisfied"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jen Lonon",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T15:12:41.000Z",
          "Titre": "Fantastic!",
          "Contenu": "Everyone is always so helpful whenever I call needing assistance. No complaints here!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "natasha etzel",
          "Nb_Reviews": 1,
          "Date": "2022-10-08T19:55:22.000Z",
          "Titre": "I loved working with the team that…",
          "Contenu": "I loved working with the team that helped us. They were patient and very attentive to our company's needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kenneth",
          "Nb_Reviews": 3,
          "Date": "2023-04-07T22:50:15.000Z",
          "Titre": "With your help",
          "Contenu": "With your help, my son was able to figure out the problem was that I had blocked incoming voice mails. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ebony",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T15:32:29.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. Rep helped understand the issue. Thank you so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "josephine",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T16:15:00.000Z",
          "Titre": "Always there to help",
          "Contenu": "I always get quick comprehensive response-onsip always stays on phone with me and explains everything with kindness and patience-the system itself is little user difficult for me but they always help."
        }
      ]
    }
  ]
}