{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "orangehost.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "MA",
          "Pseudo": "Dipsie",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T06:44:43.000Z",
          "Titre": "No support",
          "Contenu": "I can never get their support, the ticketing doesn't work and it's always saying:No support departments have been found. Please try again later."
        },
        {
          "Note": 1,
          "Lieu": "EC",
          "Pseudo": "ECUAGSM-FORUM",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T16:29:49.000Z",
          "Titre": "Very bad because they block the…",
          "Contenu": "Very bad because they block the accounts. At least they closed my account and to date they refunded my money since they should be serious about not deleting the accounts."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Robert Johnson",
          "Nb_Reviews": 3,
          "Date": "2023-05-24T12:04:34.000Z",
          "Titre": "Lack of tutorial especially when…",
          "Contenu": "Lack of tutorial especially when getting to or on the 2nd page of a web site. Can create the home page ok, but moving to about page portfolio pages and contact page is a night mare, enquired on line but instructions given did not make sense as was pointed towards something that did not existYour system needs a step by step tutorial ASAP"
        },
        {
          "Note": 1,
          "Lieu": "LK",
          "Pseudo": "dcwebsiteg",
          "Nb_Reviews": 6,
          "Date": "2023-04-30T05:57:19.000Z",
          "Titre": "Worst ever shared hosting user experience.",
          "Contenu": "I had to deal with their shared hosting service to install a script of my client. It was the worst experience I've had with cpanel shared hosting service. Can not even create a database properly, always, errors likeError: (XID ynepu4) The server is too busy to handle your request. Please wait a few minutes and try again.A fatal error or timeout occurred.MySQL server is currently offline.The server is too busy to handle your request and etc.Good luck with the hosting if server gets busy while creating a database."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shaikh Alee",
          "Nb_Reviews": 4,
          "Date": "2023-05-22T20:42:56.000Z",
          "Titre": "Scam company and worst experience",
          "Contenu": "Scam company and worst experience. I paid them for one year hosting service and within a month they suspended my account by saying there is a notice from DMCA. They are just trying to upsell me and get more money. I asked them to activate my account or refund my money and the declined. Fraudulent company."
        },
        {
          "Note": 1,
          "Lieu": "BA",
          "Pseudo": "Marko Ristivojevic",
          "Nb_Reviews": 3,
          "Date": "2023-11-26T21:57:53.000Z",
          "Titre": "my money was taken and never returned",
          "Contenu": "my money was taken and never returned. I also didn't get any host service."
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "Karim Wahdan",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T19:19:51.000Z",
          "Titre": "worst hosting service ever",
          "Contenu": "worst hosting service ever, very very slow, very very bad, full of bugs, aweful and disgusting customer support, more over your data will be lost"
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Jeremy Green",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T15:10:27.000Z",
          "Titre": "I was trying to deploy a node myself…",
          "Contenu": "I was trying to deploy a node myself prototype. I could not get the database to connect. I also tried php. Still no luck. I was informed that it worked for other user of your hosting. I have cancelled my subscription and looking for another host."
        },
        {
          "Note": 1,
          "Lieu": "AF",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T13:19:10.000Z",
          "Titre": "SSL IS DOWN ALL THE TIME.",
          "Contenu": "SSL IS DOWN ALL THE TIME.I have to contact support to reactivate it.Last time I contacted support was three days ago and still no response."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Robert Johnson",
          "Nb_Reviews": 3,
          "Date": "2023-06-29T09:21:22.000Z",
          "Titre": "Lack of info in English on site",
          "Contenu": "Lack of info in English on site, navigation to 2nd plus pages ids a disaster, a basic how to use would solve most of your problems as would someone who reads and understands a question on your chat box"
        },
        {
          "Note": 1,
          "Lieu": "MD",
          "Pseudo": "Sergiu S.",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T20:44:15.000Z",
          "Titre": "My account was suspended because I've…",
          "Contenu": "My account was suspended because I've prolonged an domain.The customer service guy have asked for ID and photo of Card, the main problem is that I've used VCC and I do not want to provide any personal info for few dollars.The Customer Service said that this verification is determined by their User Agreement so I think he doesn't know that In Terms of conditions/User Agreement there was nothing about this, so this action is not required.The reason for undertaking these measures was that I've tried too many times to pay for the order (yes, i've tried about 5 times with different cards because each time I've got Transaction Decline and only after page refresh it go through).Well, don't recommend, really! use the services which are a little bit expensive but have a normal Customer Service, have security channels for personal data transmission and handle, and which does not blocking your account after you pay about $75 and did not answering anymore to you.after the orangehost answered that there was about 40 cards, just check the earlier answers. :D funny kind of service... worthless.Syed Hamad Khalid (OrangeHost)Jul 11, 2023, 2:58 PM GMT+4Hello Sergiu,Your IP location, card details are completely different, also you have tried 15 to 20 cards for payments.Syed Hamad Khalid (OrangeHost)Jul 11, 2023, 3:40 PM GMT+4Hello Sergiu,We would like to remind you that our terms of service strictly prohibit fraudulent orders. It has come to our attention that there have been multiple failed payments associated with 30 credit cards."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Robert Johnson",
          "Nb_Reviews": 3,
          "Date": "2023-05-24T12:06:24.000Z",
          "Titre": "Not all banks in the world allow there…",
          "Contenu": "Not all banks in the world allow there clients to pay on line using your system. I had to resort to using Paypal, I am in Australia"
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Bianca Bunge",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T17:32:05.000Z",
          "Titre": "When I ask for help I don't get the…",
          "Contenu": "When I ask for help I don't get the proper help I need. I just get told to go here or here. No step by step instructions. I have had a website in my life and would appreciate better service."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Juan Davila",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T12:56:19.000Z",
          "Titre": "Domain greathistoryseries.com has not…",
          "Contenu": "Domain greathistoryseries.com has not been transferred to orange host. I was told, in writing, it would be done in March 30"
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Info PryForex",
          "Nb_Reviews": 6,
          "Date": "2023-05-07T23:25:47.000Z",
          "Titre": "weak support",
          "Contenu": "Price cheaper, but service weak, the supporters are too lazy and not helpful"
        },
        {
          "Note": 1,
          "Lieu": "CO",
          "Pseudo": "JEFRY VILLA",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T19:57:57.000Z",
          "Titre": "Very bad with the support",
          "Contenu": "Very bad with the support, i don't want to renew"
        },
        {
          "Note": 1,
          "Lieu": "IQ",
          "Pseudo": "IQ Team",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T23:25:14.000Z",
          "Titre": "declined my hosting",
          "Contenu": "you declined my hosting never use it again"
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Muhammad Ali",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T18:52:03.000Z",
          "Titre": "hosting is slow"
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Hasnain Raza",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T09:17:01.000Z",
          "Titre": "Not satisfied with customer services."
        },
        {
          "Note": 1,
          "Lieu": "MU",
          "Pseudo": "Baijnathsing Pokhunram",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T13:44:57.000Z",
          "Titre": "Not recommend"
        },
        {
          "Note": 2,
          "Lieu": "TR",
          "Pseudo": "İbrahim İlhan",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T10:54:09.000Z",
          "Titre": "I had problem with hosting and web…",
          "Contenu": "I had problem with hosting and web building, customer service wasn’t helping my problem."
        },
        {
          "Note": 2,
          "Lieu": "KW",
          "Pseudo": "Shams",
          "Nb_Reviews": 2,
          "Date": "2023-05-01T21:38:08.000Z",
          "Titre": "Slow, fewer tools, compatibility issue",
          "Contenu": "Slow, live chat staff are good but in my case, it did not help much. fewer tools, and a weird cpanel, no refund. I have other two hosting and I bought the smallest plan at Orange just to check. I am not satisfied."
        },
        {
          "Note": 2,
          "Lieu": "PK",
          "Pseudo": "abdullah umar gul",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T15:20:39.000Z",
          "Titre": "We are facing issues while Installing…",
          "Contenu": "We are facing issues while Installing WordPress on our domain. Unable to install it and its still not live"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "RANJIT JAGAYAT",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T22:25:15.000Z",
          "Titre": "THEY DID NOT OFFER ANY DISCOUNTED RATED…",
          "Contenu": "THEY DID NOT OFFER ANY DISCOUNTED RATED ON SAY 10 YEARS PURCHASE LIKE MOST COMPANIES DO."
        },
        {
          "Note": 2,
          "Lieu": "HK",
          "Pseudo": "Daxon Tam",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T15:02:56.000Z",
          "Titre": "Difficult to use",
          "Contenu": "I find it quite difficult to use ORANGE HOST, I have to log on to the site everytime I check my emails.  How come I cannot have Orange Host to have on my laptop desktop.?"
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "Boo",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T05:44:29.000Z",
          "Titre": "Cheap Webhosting service with a catch",
          "Contenu": "I have worked with many of these hosting companies in many years.  I just encountered this OrangeHost very recently and I will give you my 5 cent worth review on them.First of all, it is cheap.  Price isn't everything when you are looking to host a website, but for many non-essential bloggers and casual web user probably that is the main issue with many of these types of providers.Fine, with that being said, the cheap comes with shortcomings.  Yup shortcomings.  If you are looking for business use hosting, OrangeHost is not definitely one of choices you would want to get.The major problem is their server and line speed is what you get for your money level SLOOOOOW.If you have only a page or two WordPress blog, probably it is ok, but not for business use for sure.There are tons of other low-priced webhosting services around, there are many faster than OrangeHost.  You should look elsewhere for better suitable hosts.Also, being an economical provider they have tons of IP that has been in the black lists.  That will be a headache for business user as your emails will not reach or your customers and clients will receive messages that the destination is marked as spammers.  That will be a huge problem.  Just as any other provider, they will not do anything about your IP address past history.  You are your own to deal with many of the spam blacklist entities individually.  Oh, on top of that is that you will not get new IP in exchange nor refund with them.  So good luck.For the final comment, they only refund month-to-month payment type.  So if you took up one-year sign-up to get more discount you are stuck with them for entire duration.  (By the way, most other providers will refunds you for longer sign-up account not on month-to-month)"
        },
        {
          "Note": 2,
          "Lieu": "PE",
          "Pseudo": "Jesus Mayta",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T14:44:57.000Z",
          "Titre": "Dont permit me",
          "Contenu": "Dont permit me, create User, I have to called to support to create anyone"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kelvin  Mbugua",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T15:18:14.000Z",
          "Titre": "Too bored",
          "Contenu": "It's hard to use"
        },
        {
          "Note": 2,
          "Lieu": "BR",
          "Pseudo": "Luiz Ernesto",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T23:18:59.000Z",
          "Titre": "Not for me",
          "Contenu": "Not for me at the time."
        },
        {
          "Note": 3,
          "Lieu": "EG",
          "Pseudo": "Mohamed Nabil EL-Bagouri",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T00:03:54.000Z",
          "Titre": "It is as other host and your host is…",
          "Contenu": "It is as other host and your host is not up to date as verpex and there’s no Postgres database too"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dennis C Allen",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T06:46:53.000Z",
          "Titre": "Great host as far as setup, but…",
          "Contenu": "Great host as far as setup, ease of use and all.  However, although my account was protected.  I received about 50, and that is no exaggeration, calls from spam companies wanting to build my site.  That is truly my only complaint about them.  Even through emails they stated I was protected."
        },
        {
          "Note": 3,
          "Lieu": "PK",
          "Pseudo": "Mr. Dawood",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T14:29:24.000Z",
          "Titre": "Pretty good",
          "Contenu": "I still use orangehost and it's pretty good, the only problem is that after some time the hosting is getting slow and I didn't even used 10% of hosting storage and bandwidth. When I access my site some times the hosting is very slow but after accessing my site few more times, It improves."
        },
        {
          "Note": 3,
          "Lieu": "PK",
          "Pseudo": "Saad Bin Aziz",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T23:20:40.000Z",
          "Titre": "I paid the payment for domain and host…",
          "Contenu": "I paid the payment for domain and host purchasing twice by mistake and your concerned person said he has refunded me one payment but still after one week can't receive refunds."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Schwarzenegger Belonio",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T02:50:17.000Z",
          "Titre": "Terminal is disabled",
          "Contenu": "Well, terminal is disabled for security reason. And I need terminal so I can Install my npm and composer extensions."
        },
        {
          "Note": 3,
          "Lieu": "PK",
          "Pseudo": "Mohammad Mudassar",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T18:56:11.000Z",
          "Titre": "Everything is okay in that price except…",
          "Contenu": "Everything is okay in that price except speed of website"
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "rolando gutierrez",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T10:41:15.000Z",
          "Titre": "How do I use '_dmarc' for emails so…",
          "Contenu": "How do I use '_dmarc' for emails so that they won't be dumped to spam folders?"
        },
        {
          "Note": 3,
          "Lieu": "ID",
          "Pseudo": "Burhanuddin Cahya Atmaja",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T13:08:55.000Z",
          "Titre": "server is most slow"
        },
        {
          "Note": 3,
          "Lieu": "GH",
          "Pseudo": "Samuel Lartey",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T17:40:34.000Z",
          "Titre": "Great work",
          "Contenu": "Smart and great in terms of service"
        },
        {
          "Note": 3,
          "Lieu": "NG",
          "Pseudo": "Exprotech",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T17:33:40.000Z",
          "Titre": "Live support takes time to respond"
        },
        {
          "Note": 3,
          "Lieu": "PA",
          "Pseudo": "Edilberto Gonzalez",
          "Nb_Reviews": 15,
          "Date": "2023-09-22T20:21:43.000Z",
          "Titre": "speed solutions"
        },
        {
          "Note": 3,
          "Lieu": "ZW",
          "Pseudo": "David Mafigu",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T20:27:56.000Z",
          "Titre": "The platform is good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Birghinton Corp.",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T05:01:51.000Z",
          "Titre": "Good for the price but soo slow :)"
        },
        {
          "Note": 3,
          "Lieu": "ZW",
          "Pseudo": "tamie diseno",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T08:04:43.000Z",
          "Titre": "sometimes site goes down"
        },
        {
          "Note": 3,
          "Lieu": "PK",
          "Pseudo": "Muhammad Owais Memon",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T21:30:23.000Z",
          "Titre": "not vip php v  e"
        },
        {
          "Note": 4,
          "Lieu": "HU",
          "Pseudo": "Attila Kozmari",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T12:48:36.000Z",
          "Titre": "I just use the webhost for practicing",
          "Contenu": "I just use the webhost for practicing, which is perfect, thanks. What i somehow think worth a star minus is the support, which is some kinda shortly straightforward, and could not get more help than practicly no or yes. Otherwise im satisfied :)"
        },
        {
          "Note": 4,
          "Lieu": "CR",
          "Pseudo": "Jostrike Sandi",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T02:18:07.000Z",
          "Titre": "Everything is working fine for the price.",
          "Contenu": "Almost everything is working fine.Although some options didnt did anything when I clicked on them (i.e the Upgrade/downgrade button)UI can be more user friendly but its alrightI've already migrated all of my hostings to OH mostly because of the price."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "فراز احمد",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T11:23:19.000Z",
          "Titre": "All is well",
          "Contenu": "All is well; support and hosting services are among the best."
        },
        {
          "Note": 4,
          "Lieu": "AR",
          "Pseudo": "Feluk",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T02:01:50.000Z",
          "Titre": "Good Services. Onboarding tricky.",
          "Contenu": "The onboarding was not intuitive at all. The main site can't be changed and it's a core configuration. There aren't any FAQs or manuals but they use cPanel and there is a lot of external info. The service works great!I like the cPanel addon for Apps. It easy to install, backup, and manage WordPress."
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "ReelGists",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T10:11:29.000Z",
          "Titre": "Their hosting service is second to…",
          "Contenu": "Their hosting service is second to none. Service support are awesome, direct to issue and prompt reply. We're glad we found OH."
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "- João Morais",
          "Nb_Reviews": 6,
          "Date": "2023-12-12T18:28:48.000Z",
          "Titre": "Straightforward subscribe, fast support",
          "Contenu": "A straightforward process to subscribe, and fast support responde when needed,"
        },
        {
          "Note": 4,
          "Lieu": "PA",
          "Pseudo": "Edilberto Gonzalez",
          "Nb_Reviews": 15,
          "Date": "2023-12-19T18:39:06.000Z",
          "Titre": "speed solutions"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Other",
          "Nb_Reviews": 3,
          "Date": "2023-10-12T13:22:27.000Z",
          "Titre": "Support is a bit substandard and they…",
          "Contenu": "Support is a bit substandard and they tend to mark issues \"resolved\" when they aren't.  They aren't always clear on providing instructions how to do certain things (for example, when you have multiple websites/domains, which folder to put the respective website files in).  I've had to figure a lot of things out on my own because of their vague responses.  However, the functioning of the server, email, etc., is great once you get everything set up.  And of course the price is excellent."
        },
        {
          "Note": 4,
          "Lieu": "PA",
          "Pseudo": "Edilberto Gonzalez",
          "Nb_Reviews": 15,
          "Date": "2023-12-15T21:57:06.000Z",
          "Titre": "speed solutions"
        },
        {
          "Note": 4,
          "Lieu": "ZM",
          "Pseudo": "Thaddeus Lubinga",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T18:47:49.000Z",
          "Titre": "Great hosting",
          "Contenu": "Great hosting, website speed is awesome. Great support as well, every issue I had was solved. I only request the support be a bit more polite and understand that they are not talking to tech survey people, but individuals who may not know. So it be great if they respond in a “chilled” way and help you understand the issue better."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Scott Bilau",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T02:49:17.000Z",
          "Titre": "I love the customer service",
          "Contenu": "I love the customer service. very prompt and helpful. that's for sure! i also appreciate the help given in assisting me moving my domain from bluehost.com to orangehost.com. technical advise and promptness to the facebook message was highly exceptional.One suggestion is you can make more detailed videos of how to use wordpress with orangehost cPanel to build and laung websites, and also how to edit web pages built with wordpress and orangehost cPanel.Thanks and again and keep up the awesome work!"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Robert Grundler",
          "Nb_Reviews": 8,
          "Date": "2023-11-23T06:37:09.000Z",
          "Titre": "Price okay",
          "Contenu": "Price okay, about service no comment up to now, as I did not set up my website up to now"
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Salman Khokhar",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T17:07:36.000Z",
          "Titre": "Best support system",
          "Contenu": "Best support system, if you encounter any issue they reply within a minute, everything is best, you can also deply node js, ruby, perl and python apps, also 1 click WordPress install, free SSL and email ... just one problem the I/O speed is very low that is 1MB/s, should be at least 5MB/s or higher, besides this my experience is very wonderful"
        },
        {
          "Note": 4,
          "Lieu": "BD",
          "Pseudo": "Kiyas Ahmed",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:04:15.000Z",
          "Titre": "Very nice Service but they have to…",
          "Contenu": "Very nice Service but they have to improve in there Domain.becasue they don’t have any DNS option."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Khan",
          "Nb_Reviews": 2,
          "Date": "2023-05-15T17:11:57.000Z",
          "Titre": "Best hosting but Data storage capacity…",
          "Contenu": "Best hosting but Data storage capacity less as per package. Please have a look at that matter. Also make it possible for clients they can buy extra storage only. Not compete packages for increasing the data storage capacity"
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Tosin Oyewole",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T15:16:30.000Z",
          "Titre": "The timely response from customer…",
          "Contenu": "The timely response from customer service is great and I have had no issues since using their hosting program! I am enjoying the process"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Giangi",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T12:18:17.000Z",
          "Titre": "Lots of times offline",
          "Contenu": "I changed my review, let s see if it gets better after new fixes."
        },
        {
          "Note": 4,
          "Lieu": "MW",
          "Pseudo": "John Kalinga",
          "Nb_Reviews": 2,
          "Date": "2023-08-25T10:54:50.000Z",
          "Titre": "Orange Host |  Room for Improvement",
          "Contenu": "OrangeHost is good, but there is still room for improvement. In the areas ofWP Installation.Assignment of domains to CP folders Domain availability check."
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "Paul Rogers",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T17:07:35.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service! I would not have chosen the Micro Package if I had done more research and instead would have chosen a higher package. Overall though a good experience. Would recommend and certainly good value for money!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "E. Goceda.",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T08:39:25.000Z",
          "Titre": "Outstanding values so far on site…",
          "Contenu": "Outstanding values so far on site hosting and domain names. I haven't been aboard long enough to evaluate further. Favorable first impressions."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Hugo Nieto",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T00:08:52.000Z",
          "Titre": "The instructions during the purchase…",
          "Contenu": "The instructions during the purchase process are not great, but the service is."
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Sam Onyeji",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T18:45:41.000Z",
          "Titre": "I'm a first timer user and my…",
          "Contenu": "I'm a first timer user and my experience is still in its early stage. I could have given you 5-star because it has been great so far but let me give it more time. Thank you OrangeHost."
        },
        {
          "Note": 4,
          "Lieu": "EC",
          "Pseudo": "German Duenas",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T02:22:38.000Z",
          "Titre": "Easiness",
          "Contenu": "Easy to work with. Navigation a little cumbersome until you start getting to know where things located within the dashboard"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randy",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T16:02:24.000Z",
          "Titre": "Check your data amounts",
          "Contenu": "I was given 76mb of data and database and had to request the correct amount."
        },
        {
          "Note": 4,
          "Lieu": "PA",
          "Pseudo": "Edilberto Gonzalez",
          "Nb_Reviews": 15,
          "Date": "2023-12-08T02:37:51.000Z",
          "Titre": "Speed solutions"
        },
        {
          "Note": 4,
          "Lieu": "DZ",
          "Pseudo": "dbo algerie",
          "Nb_Reviews": 3,
          "Date": "2023-07-17T00:24:05.000Z",
          "Titre": "Good hosting the fatest website…",
          "Contenu": "Good hosting the fatest website migration i ever had by the resposible of site migrations , generally this is the best hostings especially for meddle east and north african countries . The support sometimes great ,sometimes need to use formal language with clients!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fei Hong",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T13:17:54.000Z",
          "Titre": "New to Orange Host",
          "Contenu": "I just started using it, the services are good so far, but the customer service live chat is not always available."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Muhammad Abuzar",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T20:30:54.000Z",
          "Titre": "its cheap and amazing my website work…",
          "Contenu": "its cheap and amazing my website work very smoothly but one thing I am rating 4 stars on is after 1 year the plan is a little bit costly..."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Bilal Ahmed",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T17:20:53.000Z",
          "Titre": "Great Experience",
          "Contenu": "It is first time, i am using orangehost, and i am happy to say that, MY experience is great then others which Used in past"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jason Hodgins",
          "Nb_Reviews": 2,
          "Date": "2023-05-08T21:05:59.000Z",
          "Titre": "So far equivalent to any hosting I've…",
          "Contenu": "So far equivalent to any hosting I've had...slightly better without the exorbitant cost.  Easy peasy."
        },
        {
          "Note": 4,
          "Lieu": "RS",
          "Pseudo": "George",
          "Nb_Reviews": 3,
          "Date": "2023-11-15T17:00:33.000Z",
          "Titre": "The support is great and very fast",
          "Contenu": "The support is great and very fast, but the servers could be faster"
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Guns Hsing",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T16:59:12.000Z",
          "Titre": "good",
          "Contenu": "good, easy to set up website, Domain configuration is simple; but for webmail, if you have old email server, be carful to MX recorder; the mail stored on webmail server can't be easy collect; and the website contact inquiry form message, seems can't be forward to email server."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Zeigham Sultan",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T20:44:48.000Z",
          "Titre": "Good service",
          "Contenu": "Quick reply and supprtt"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason Davenport",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T04:19:04.000Z",
          "Titre": "Easy to use",
          "Contenu": "Quick set up with cpanel"
        },
        {
          "Note": 4,
          "Lieu": "EG",
          "Pseudo": "Ahmed Ahmed",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T06:24:23.000Z",
          "Titre": "I have good experience with orangehost",
          "Contenu": "I have good experience with orangehost, it is ease for working"
        },
        {
          "Note": 4,
          "Lieu": "MA",
          "Pseudo": "sain ahab",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T10:02:05.000Z",
          "Titre": "Good price for options",
          "Contenu": "affordable service with good options, i would give it 5 starts if add-ons domains and sub domains were a separate thing not counted as 1"
        },
        {
          "Note": 4,
          "Lieu": "RW",
          "Pseudo": "Bertin",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T16:30:55.000Z",
          "Titre": "good",
          "Contenu": "All is going well now, but later i started there was lag or some interuption but now it is good"
        },
        {
          "Note": 4,
          "Lieu": "GT",
          "Pseudo": "Daniel Sagastume",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T02:55:53.000Z",
          "Titre": "I found WordPress and web builders Hard…",
          "Contenu": "I found WordPress and web builders Hard to handle, of course is not imposible, finally I had to redirect the DNS to wix, paying twice the price I was expecting, becouse for me it was the easy way with short time invested."
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "ADELAKUN SAMUEL AWOLUMATE",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T23:44:57.000Z",
          "Titre": "Exactly the host company I have been…",
          "Contenu": "Exactly the host company I have been looking for. Prompt in solving problems."
        },
        {
          "Note": 4,
          "Lieu": "ZM",
          "Pseudo": "Patrick Chanda",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T07:35:57.000Z",
          "Titre": "So far a good experience",
          "Contenu": "So far a good experience. Quick domain registration, setup and propagation. Friendly cPanel layout and free SSL certificates that ACTUALLY work."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jason Hodgins",
          "Nb_Reviews": 2,
          "Date": "2023-06-10T06:23:43.000Z",
          "Titre": "Inexpensive, good value for service levels.",
          "Contenu": "*comparable service at ridiculously low price for the type of account.*easy to use"
        },
        {
          "Note": 4,
          "Lieu": "DO",
          "Pseudo": "Marie Chery",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T07:02:37.000Z",
          "Titre": "so I'm enjoying building my website and…",
          "Contenu": "so I'm enjoying building my website and the customer service is very good I had an issue they resolve it in a matter of second"
        },
        {
          "Note": 4,
          "Lieu": "DZ",
          "Pseudo": "Amine",
          "Nb_Reviews": 3,
          "Date": "2023-06-01T14:38:09.000Z",
          "Titre": "Promising company",
          "Contenu": "Until now, I had a very nice experience. I like the support when they respond quickly."
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "El Profe Miguel",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T14:37:50.000Z",
          "Titre": "Fast support."
        },
        {
          "Note": 4,
          "Lieu": "KE",
          "Pseudo": "Geoffrey",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T20:58:48.000Z",
          "Titre": "Very helpful when stuck or you have a…",
          "Contenu": "Very helpful when stuck or you have a problem. Hosting is up all the time"
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "sher ghafoor",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T08:36:38.000Z",
          "Titre": "All good fast and friendly ,faster…",
          "Contenu": "All good fast and friendly ,faster customer support service."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Muhammad Qamar",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T05:32:39.000Z",
          "Titre": "it's great and working well"
        },
        {
          "Note": 4,
          "Lieu": "SO",
          "Pseudo": "Nour bashir Hassan",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T05:45:38.000Z",
          "Titre": "Really",
          "Contenu": "Really, very happy your services including Support team."
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Akin Adekola",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T02:22:32.000Z",
          "Titre": "Speed is great, support is wonderful.",
          "Contenu": "Speed is great support is wonderful"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Thaddeo Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T05:56:28.000Z",
          "Titre": "Good site for a beginner exploring in…",
          "Contenu": "Good site for a beginner exploring in website creation."
        },
        {
          "Note": 4,
          "Lieu": "JM",
          "Pseudo": "horace williams",
          "Nb_Reviews": 2,
          "Date": "2023-05-15T17:51:55.000Z",
          "Titre": "The persons on the chat are readily…",
          "Contenu": "The persons on the chat are readily accesible to answer all questions"
        },
        {
          "Note": 4,
          "Lieu": "IQ",
          "Pseudo": "Muhammad AlSharifi",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T17:16:47.000Z",
          "Titre": "Suitable Price With Good Quality of…",
          "Contenu": "Suitable Price With Good Quality of Services."
        },
        {
          "Note": 4,
          "Lieu": "ZM",
          "Pseudo": "Crystal Springs",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T16:19:19.000Z",
          "Titre": "Efficient",
          "Contenu": "Very efficient and cost benefit"
        },
        {
          "Note": 4,
          "Lieu": "BD",
          "Pseudo": "Sharmin Akter",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T05:41:15.000Z",
          "Titre": "Very good service provider for domain…",
          "Contenu": "Very good service provider for domain and hosting"
        },
        {
          "Note": 4,
          "Lieu": "JM",
          "Pseudo": "horace williams",
          "Nb_Reviews": 2,
          "Date": "2023-05-07T04:33:34.000Z",
          "Titre": "Chat team",
          "Contenu": "Your chat team was awesome Hamad and Company. Thumbs up"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Rochelle Paradero",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T07:22:48.000Z",
          "Titre": "Fast customer service."
        },
        {
          "Note": 4,
          "Lieu": "MW",
          "Pseudo": "John Kalinga",
          "Nb_Reviews": 2,
          "Date": "2023-08-17T16:58:12.000Z",
          "Titre": "improvement.",
          "Contenu": "There is room for improvement."
        },
        {
          "Note": 4,
          "Lieu": "EG",
          "Pseudo": "Trend IT Solutions",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T16:31:23.000Z",
          "Titre": "Stable and cheap",
          "Contenu": "V. Good hosting services"
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Syeda Farwa",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T13:10:11.000Z",
          "Titre": "its easy and affordable"
        },
        {
          "Note": 4,
          "Lieu": "PA",
          "Pseudo": "Edilberto Gonzalez",
          "Nb_Reviews": 15,
          "Date": "2023-09-09T19:36:25.000Z",
          "Titre": "speed solutions"
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Hilal Khan",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T01:10:08.000Z",
          "Titre": "Good service"
        },
        {
          "Note": 4,
          "Lieu": "IQ",
          "Pseudo": "Muhammad AlSharifi",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T02:19:39.000Z",
          "Titre": "Flexible & Reliable"
        },
        {
          "Note": 4,
          "Lieu": "ZW",
          "Pseudo": "TAFADZWA MADUURO",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T11:24:21.000Z",
          "Titre": "the support was good when i needed help"
        },
        {
          "Note": 4,
          "Lieu": "UG",
          "Pseudo": "Bwire Isaac",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T17:31:40.000Z",
          "Titre": "Great  customer care"
        },
        {
          "Note": 4,
          "Lieu": "DZ",
          "Pseudo": "Benaissi Redouane",
          "Nb_Reviews": 2,
          "Date": "2023-07-04T14:44:31.000Z",
          "Titre": "Cheap and good",
          "Contenu": "Cheap and good to start your business"
        },
        {
          "Note": 4,
          "Lieu": "BD",
          "Pseudo": "Md. Masud Hossen",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T07:40:16.000Z",
          "Titre": "Good Experience",
          "Contenu": "Good ExperiencePositive Experience"
        },
        {
          "Note": 4,
          "Lieu": "TN",
          "Pseudo": "Maher Kaddoussi",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T19:51:05.000Z",
          "Titre": "It is helpful",
          "Contenu": "It is helpful 🙂"
        },
        {
          "Note": 4,
          "Lieu": "BF",
          "Pseudo": "Miguel",
          "Nb_Reviews": 2,
          "Date": "2023-08-10T16:17:16.000Z",
          "Titre": "great experiences and fast assist"
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Kingsley  Ocheikwu",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T08:24:30.000Z",
          "Titre": "It was an amazing experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George Reid",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T18:59:24.000Z",
          "Titre": "Very quick setup",
          "Contenu": "Very quick setup - works well."
        },
        {
          "Note": 4,
          "Lieu": "GH",
          "Pseudo": "Samuel Lartey",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T19:52:14.000Z",
          "Titre": "I love the speed of my site"
        },
        {
          "Note": 4,
          "Lieu": "CL",
          "Pseudo": "Claudio Vargas",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T23:07:14.000Z",
          "Titre": "Ver fast and simple",
          "Contenu": "Ver cheap and fastly"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "John Clifford Servera",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T06:23:48.000Z",
          "Titre": "24/7 and the virtual environment"
        },
        {
          "Note": 4,
          "Lieu": "ZW",
          "Pseudo": "Mbongeni Hadebe",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T11:52:15.000Z",
          "Titre": "shap",
          "Contenu": "great work done"
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Ansaf Ali Khan",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T23:40:45.000Z",
          "Titre": "Greate work."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Ghulam",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T09:12:10.000Z",
          "Titre": "LOVE YOU ORANGE HOST",
          "Contenu": "I dont think so in this era , any pne can be like Orange Hosting peovider most reliable trusted secure , i am 1000% satisfied from service i have never face anh issure from services . GOD bless you thabk you for good service"
        },
        {
          "Note": 5,
          "Lieu": "IS",
          "Pseudo": "Taxi BBS",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:22:43.000Z",
          "Titre": "Orange Host offers  fair and flexible prices and great service …",
          "Contenu": "Orange host offers  fair and flexible prices and great costumer service and as much email addresses as you want . I totally recommend this service to anyone who want´s to make webpages or email addresses ! Great self help videos and tutorials also ."
        },
        {
          "Note": 5,
          "Lieu": "DO",
          "Pseudo": "Andreivi Jerez de Aza",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:05:34.000Z",
          "Titre": "Very good value, and good service",
          "Contenu": "Is a good value service if you want to start on internet bussines. I am new in this, si I cant compare with other services, but I think Is good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andy K",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T00:33:05.000Z",
          "Titre": "Michael the fighting warrior",
          "Contenu": "Michael Coffey, the owner of Zehlm websites fought for me to get my website up and running. He is very knowledgeable with websites and one of the most important things I really appreciated about him was that when their was a question about something  he was always quick to respond and willing to help, go out of his way to explain or fix whatever the situation may have been"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Alizaib Hassan",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T00:46:34.000Z",
          "Titre": "I wanted to share my positive…",
          "Contenu": "I wanted to share my positive experience with Orange Host – a stellar choice for web hosting. The security features, including robust malware scanning and daily backups, ensure my website stays protected. Orange Host's emphasis on speed with NVME SSD RAID10 configured storage has noticeably improved my site's performance. Quick loading times have enhanced user experience and positively impacted my SEO."
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "Mohamed Moudkiri",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T21:12:19.000Z",
          "Titre": "Great job",
          "Contenu": "Hi guysI'm really a beginner in WordPress and the  truth I wasn't expecting all this support. 24/7  this orange host were really helpful to guide me through all the set up and their assistance were really fast. I wish them the best of luck for their great job.And once again Thank you"
        },
        {
          "Note": 5,
          "Lieu": "LB",
          "Pseudo": "Ali Hamad",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:32:01.000Z",
          "Titre": "I am hosting two websites right now and…",
          "Contenu": "I am hosting two websites right now and it has been good , service customer is excellent and the plans are affordable"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Mehmood ul Hassan",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T01:24:30.000Z",
          "Titre": "This hosting provider is simply the best.",
          "Contenu": "The site went live lightning fast, the payout process was seamless, and their customer service is top-notch. So glad I went with them!"
        },
        {
          "Note": 5,
          "Lieu": "YE",
          "Pseudo": "SALEEM AHMED ALAADHAB ALAADHAB",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T17:52:46.000Z",
          "Titre": "The most beautiful hosting",
          "Contenu": "What I liked most about this hosting is the good treatment with customers, the quick response, and the provision of the necessary services"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T22:28:34.000Z",
          "Titre": "Right now our experience has only been…",
          "Contenu": "Right now our experience has only been positive with OrangeHost. we're a small podcast and we don't need 100s of gigabytes of space for your small show. OrangeHost was the best option for us, a very low start up cost."
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "Ahmed Ahmed",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T08:50:24.000Z",
          "Titre": "Good and easy hosting",
          "Contenu": "I have a good experience with us orangehost, it is easy used"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Ben Ryan Bolus",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T06:27:12.000Z",
          "Titre": "Customer Support is Superb",
          "Contenu": "Customer Support is Superb, They are very quick in response time. I guess I will stick to their service and they have affordable plans to choose from."
        },
        {
          "Note": 5,
          "Lieu": "XK",
          "Pseudo": "Eron Begn",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T01:34:40.000Z",
          "Titre": "For the price it is really worth it and…",
          "Contenu": "For the price it is really worth it and the costumer support is quick AF!!!Don't set high expectation for the tools if you are a dev and need more customization talking for the starter package."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Noel Aungst",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T23:48:13.000Z",
          "Titre": "Easy peasy",
          "Contenu": "I didn't well understand how to transition my site from Godaddy to Orange but, via email, I got good, direct information & in less than a day it was done. No mistakes."
        },
        {
          "Note": 5,
          "Lieu": "LK",
          "Pseudo": "Abdul Raheem Thameem",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T16:09:17.000Z",
          "Titre": "Great service!",
          "Contenu": "Great service!I love their customer support.Thank you"
        },
        {
          "Note": 5,
          "Lieu": "NP",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T07:20:35.000Z",
          "Titre": "happy with this hosting",
          "Contenu": "Using hosting 3-4 months- very happy.Support fast, hosting not any problem, I has even upgraded!"
        },
        {
          "Note": 5,
          "Lieu": "LB",
          "Pseudo": "Akram Najjar",
          "Nb_Reviews": 6,
          "Date": "2023-12-01T14:27:49.000Z",
          "Titre": "Efficient and Effective Support",
          "Contenu": "The most important of the support of OrangeHost is that I was always given a correct response, and very quickly. The agents knew their material well. Always courteous.Suggestion: cPane (the hosting software that OrangeHost uses)l is powerful and effective. But its documentation is too technical, vast and detailed. It makes it difficult to learn how a \"process\" can be executed. I suggested that the existing good bank of videos OrangeHost has prepared be extended to cover processes that non-technical users like myself can benefit from. For example, the use of folders and redirection, the use of SSL, setting up email accounts on various clients (eg OUTLOOK), etc. That would be helpful.Thanks"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Muhammad  Imran",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T19:40:28.000Z",
          "Titre": "The only thing which is like the most…",
          "Contenu": "The only thing which is like the most about orange host is its support services.But I have an issue with the webhosting renewal as we couldn't deactivate it.. But overall the services are good enough even for an ecommerce store."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Jovine",
          "Nb_Reviews": 15,
          "Date": "2023-11-23T07:18:43.000Z",
          "Titre": "I am very impressed with the…",
          "Contenu": "I am very impressed with the responsiveness and care the support group provided during my first few days with Orange Host. I was a customer with BlueHost for over 20 years and the service and attention to detail I received has been world class!Syed and Zahid, you two are rock stars!Thank you"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Zanezwi Nkosenhle Mkhize",
          "Nb_Reviews": 4,
          "Date": "2023-12-10T19:53:20.000Z",
          "Titre": "I had very friendly experience with…",
          "Contenu": "I had very friendly experience with OrangeHost. It was even easier to install wordpress on my website."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Barry Pitelen",
          "Nb_Reviews": 3,
          "Date": "2023-11-24T04:43:17.000Z",
          "Titre": "Great Company with excellent support.",
          "Contenu": "Affordable compared to most other hosting companies and the support is just excellent.Full control with your site, with an account dashboard and an easy to navigate Control Panel.....Syed and Zahid are to be complimented on their great response time, attitude and efficiency.What a refeshing difference they place on their customers, compared to the 'couldn't care less attitude' of Bluehost, from which they migrated my site/s seemlessly. With no downtime and not a single email lost. Highly recommended!....."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Ryan Lingo",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T07:12:34.000Z",
          "Titre": "I am very satisfied with the product…",
          "Contenu": "I am very satisfied with the product you offered."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Thomas W.",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T17:55:52.000Z",
          "Titre": "Fast",
          "Contenu": "Fast, reliable, hassle free."
        },
        {
          "Note": 5,
          "Lieu": "KH",
          "Pseudo": "Donald Stone",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T04:43:02.000Z",
          "Titre": "Awesome Webhosting service",
          "Contenu": "I needed a small website for my personal DJ business. Orangehost had a really cheap deal for their services and I tried it. This has been one of the best web hosting companies I've ever used. I would recommend Oranghost over any bigger host like GoDaddy."
        },
        {
          "Note": 5,
          "Lieu": "LB",
          "Pseudo": "Akram Najjar",
          "Nb_Reviews": 6,
          "Date": "2023-11-17T13:09:17.000Z",
          "Titre": "Transferring hosting and 5 domains to OrangeHost",
          "Contenu": "I transferred hosting and 5 domains to OrangeHost from another supplier because of the wide features the good price and hoping for better support.Dealing with support has been wonderful. At no time did I have to wait more than 4-5 minutes for their response. They led me through the setup of the hosting, website uploads (folder structure) and email, step by step. It did take a bit of time because of my lack of exposure to cPanel.It is to be noted that cPanel is not an OrangeHost product but an industry standard . . .  but they led me through it successfully. I am happy with the response time of my websites, better than I was used to with my previous host.Special thanks to Syed and Zahid."
        },
        {
          "Note": 5,
          "Lieu": "UG",
          "Pseudo": "benie",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T12:52:56.000Z",
          "Titre": "have an interractive cpanel",
          "Contenu": "it has enabled use data base of MySQL and it all installation of content management systems"
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Luis Augusto Guerra H.",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T23:40:37.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to useInstall, config, run Excellent"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Charles Boakye Yiadom",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T18:11:57.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service! I got 3 websites transferred for free within minutes!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T14:20:16.000Z",
          "Titre": "Highly recommended!",
          "Contenu": "Just very good service for a change!Very refreshing to find a hosting company that actually responds so quickly and with such a huge data base of video tutorials."
        },
        {
          "Note": 5,
          "Lieu": "LK",
          "Pseudo": "A D Dhamithru De Alwis",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T09:43:34.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service, quick response and the price are very attractive, especially startup price is very attractive and price from 2nd yers is also attractive, I just started my 1st website with Orage hosting, and I bout the Domain and Hostin both from Orange. I'm very satisfied. Thanks, orange team !!!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Lee Hartopp",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T19:26:35.000Z",
          "Titre": "Attention To Detail",
          "Contenu": "Very helpful in walking me through uploading quite a large real estate site. Happy to recommend"
        },
        {
          "Note": 5,
          "Lieu": "ZM",
          "Pseudo": "Obert Mukuka",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T17:16:23.000Z",
          "Titre": "Orangehost is becoming my favorite",
          "Contenu": "Orangehost is becoming my favorite,  I never thought there can be such well and organized men ready to resolve any challenge a newbie blogger like me would face. .There servers are reliabl. Friendly control panel. Good 24/7 C. Support. Thanks for their budget friendly plans."
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "Medafinfo.com",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T11:24:59.000Z",
          "Titre": "Hello .realy very good hosting it is…",
          "Contenu": "Hello .realy very good hosting it is the best Best support Thanks orangehost"
        },
        {
          "Note": 5,
          "Lieu": "IQ",
          "Pseudo": "Abdulkareem Darweesh",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T16:39:49.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service، Fast response and problem solving، With the cheapest cost, wow.  I liked"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Bruce Tupholme",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T16:29:29.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service, highly recommended, will be using for the future!"
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "John Doe",
          "Nb_Reviews": 3,
          "Date": "2023-11-26T15:35:57.000Z",
          "Titre": "very good",
          "Contenu": "very good hosting, really cheap and good support. I switched because it didnt match my needs, but it's still one of the better providers I have tried."
        },
        {
          "Note": 5,
          "Lieu": "MU",
          "Pseudo": "flore jeanmarie",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T18:28:23.000Z",
          "Titre": "Very good hosting placeWhat make me give five stars to…",
          "Contenu": "What make me give five stars to Orangehost is because the price of the subscription is low,I have received a very good customer service to set up my account and purchase my domain and hosting plan,easy to navigate....."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "mictri",
          "Nb_Reviews": 6,
          "Date": "2023-10-13T22:06:19.000Z",
          "Titre": "Moved my active website to OrangeHost…",
          "Contenu": "Moved my active website to OrangeHost from another hosting provider that was getting too expensive for me(150+ p/y).I was a little concerned about migrating my site over but I need not have worried. OrangeHost took care of it for me no issue whatsoever. They had it done within an hour!For the price and quality of support I just can't fault these guys. 100% recommended!"
        },
        {
          "Note": 5,
          "Lieu": "TN",
          "Pseudo": "abdelkarim bchir",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T22:04:03.000Z",
          "Titre": "everything is fine",
          "Contenu": "everything is fine for a budget frienly website . the support is useful too ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean Francisco",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T17:43:37.000Z",
          "Titre": "These guys are just top-notch…",
          "Contenu": "These guys are just top-notch professionals from the super easy ordering process to their lightning-fast support. I happily recommend Orange Host to everyone who is looking for fast and affordable web hosting! I'm leaving a 5 Star review because on a scale of 1 to 10 they are a solid 10. A+ Guys, thanks!"
        },
        {
          "Note": 5,
          "Lieu": "KE",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T16:55:34.000Z",
          "Titre": "Reliable and fast web hosting service",
          "Contenu": "Amazing hosting solution. Reliable and fast. We had some hiccups setting up WordPress from the host. we emailed and they helped out without delays. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "ZM",
          "Pseudo": "Mutale Kombe",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T10:02:57.000Z",
          "Titre": "The hosting fee is very affordable and service is good",
          "Contenu": "The hosting fee is very affordable, the most important thing for me is customer service and up time. Your customer service is very fast and respond in good time. They help me set up my account easily. So far the service is good… no complaints"
        },
        {
          "Note": 5,
          "Lieu": "QA",
          "Pseudo": "Asath Mohamed",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T22:03:07.000Z",
          "Titre": "Amazing",
          "Contenu": "In summary, OrangeHost has been a reliable domain registrar for me. Its user-friendly interface, extensive domain options, and responsive customer support make it a go-to choice. However, pricing for additional services might be a consideration for some users."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "FROILAN IMPERIAL BELTRAN",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T20:33:35.000Z",
          "Titre": "I couldn't have made a better decision when moving from another accommodation I was in.",
          "Contenu": "They have excellent hosting plans at very affordable prices, as well as excellent quality service."
        },
        {
          "Note": 5,
          "Lieu": "TZ",
          "Pseudo": "Mussa Omary",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T12:26:33.000Z",
          "Titre": "Everything is great",
          "Contenu": "Everything is great. Affordable price."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Noor Muhammad",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T18:49:34.000Z",
          "Titre": "Great Customer Support",
          "Contenu": "I have had a great experience with Orange Host because customer support is one of the key elements in hosting, and they did a great job instantly replay and solve the problem and guide you... thank you orange host.."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Saad Ali",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T07:33:31.000Z",
          "Titre": "Orangehost is easy to use",
          "Contenu": "Orangehost is easy to use , fast , cheap at price and just awesome"
        },
        {
          "Note": 5,
          "Lieu": "ZM",
          "Pseudo": "Felix Miyoba",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T12:54:28.000Z",
          "Titre": "The c panel is great it's never down"
        },
        {
          "Note": 5,
          "Lieu": "RW",
          "Pseudo": "Stevy Daic Ndjala Totolo",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T21:22:13.000Z",
          "Titre": "Excellent",
          "Contenu": "Well, OrangeHost has a fantastic team!They were quick in responding to my issues, and they addressed them diligently.Great service!"
        },
        {
          "Note": 5,
          "Lieu": "MZ",
          "Pseudo": "Emmanuel Mushi",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T09:17:03.000Z",
          "Titre": "What made the experience great is the…",
          "Contenu": "What made the experience great is the fast reply to my requests and the guidance of how to solve them."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Sheldon Harding",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T14:17:02.000Z",
          "Titre": "Very experienced team they solved all…",
          "Contenu": "Very experienced team they solved all my problems. Hosting is very fast with litespeed and unlimited bandwidth, all my sites hitting 100 on Gtmetrix and Google page insights....."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Burhan Arif",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T10:32:50.000Z",
          "Titre": "For the price it is really worth it and…",
          "Contenu": "For the price it is really worth it and the costumer support is quick."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Hamada",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T06:01:06.000Z",
          "Titre": "Orange host is wonderful",
          "Contenu": "Orange host is wonderful, simple to use interface, cost effective service with a very good support team, to help and guide you all the way, i am enjoying their service. thank you orange host."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T05:38:52.000Z",
          "Titre": "My website suddenly down and my domain…",
          "Contenu": "My website suddenly down and my domain goes  inside the sales list. But customer support is very great they resolve my issue in 20 minutes."
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "Smart Futures Scalper",
          "Nb_Reviews": 5,
          "Date": "2023-11-13T00:36:22.000Z",
          "Titre": "Cheap deal from orangehost",
          "Contenu": "It was a smooth experience lunching my website on orange host. The deal was so great that i cannot resist."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "awoleye abraham",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T16:07:53.000Z",
          "Titre": "Awesome experience",
          "Contenu": "It was awesome using orange host. It didn't waste time to populate my website on their server"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-10-08T20:15:45.000Z",
          "Titre": "Quick response is great value to you, I loved it so much",
          "Contenu": "I have seen many domain hosts. You may have many things in common with those I have seen. but, I have never seen any host better than your in client support and customer satisfaction. The quick response is great value to you, I loved it so much."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "maaz nazeer",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T20:41:27.000Z",
          "Titre": "Highly recommend for everyone"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Hassan Asim",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T21:17:07.000Z",
          "Titre": "Great Experience with OrangeHost Just…",
          "Contenu": "Great Experience with OrangeHost Just need Live Chat option. Email Support is also too good but live chat will be must on this site."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "G k",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T15:17:50.000Z",
          "Titre": "A very good hosting service site is…",
          "Contenu": "A very good hosting service site is never down and at a very affordable rate highly recommended"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David DJ Saighman",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:17:13.000Z",
          "Titre": "Very prompt customer service",
          "Contenu": "Very prompt customer service, knowledgeable staff, easy to use platform"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "ZAIN MUMTAZ",
          "Nb_Reviews": 2,
          "Date": "2023-11-12T16:40:57.000Z",
          "Titre": "Best Hosting Ever",
          "Contenu": "OrangeHost has proven to be an invaluable partner in my online journey. Their commitment to reliability, speed, customer support, user-friendly interface, security, and scalability make them a top choice for anyone in need of a hosting solution. I wholeheartedly recommend OrangeHost to fellow website owners looking for a hosting provider that goes above and beyond."
        },
        {
          "Note": 5,
          "Lieu": "KE",
          "Pseudo": "ElsamaPascal ndegwa",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T10:45:43.000Z",
          "Titre": "Orange delivers.Its smooth,the…",
          "Contenu": "Orange delivers.Its smooth,the onboarding process is 👍 great with no hicups.Loving it so far and it is worth it. Try it out yourself and see."
        },
        {
          "Note": 5,
          "Lieu": "ET",
          "Pseudo": "Saed Abdi",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T18:47:48.000Z",
          "Titre": "The best webhosting in the wold orangehost",
          "Contenu": "OrangeHost delivers top-notch hosting services! Fast, reliable, and backed by exceptional customer support. A five-star experience!"
        },
        {
          "Note": 5,
          "Lieu": "CR",
          "Pseudo": "Javier Madrigal",
          "Nb_Reviews": 3,
          "Date": "2023-10-18T08:55:40.000Z",
          "Titre": "Great partner to deal with!",
          "Contenu": "Great partner to deal with!. Thank you Orange Host great entry offers make business easier!. Keep your offers running..."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Abbas",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T10:27:17.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experienceI loved it. Its insanely cheap to get started and still has quality services."
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "Waleed",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T23:07:03.000Z",
          "Titre": "Best hosting ever",
          "Contenu": "Good service with very low cost"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Gaby Oladunjoye - CEO, GO Ltd",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T22:04:55.000Z",
          "Titre": "Orange Host is Top Notch!",
          "Contenu": "The purchase process was seamless and the hosting service is excellent. Kudos to Orange Host and please you can do more!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carroll Baker Jr.",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T21:39:09.000Z",
          "Titre": "Great service and technical help.",
          "Contenu": "Great service and technical help.Easy to use service"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "ANTOINE R.",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T10:04:24.000Z",
          "Titre": "Easy and straightforward onboarding…",
          "Contenu": "Easy and straightforward onboarding process, competitive price and good customer service. I am moving all my hosted websites to their platform from Godaddy."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Makhs Tsikos",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T17:16:58.000Z",
          "Titre": "Hosting more that 5 websites there",
          "Contenu": "Hosting more that 5 websites there. Never had a single issue and support is always there to help."
        },
        {
          "Note": 5,
          "Lieu": "NA",
          "Pseudo": "Fridrich Dickson Kamwanga Liko",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T10:27:59.000Z",
          "Titre": "What made orangehost great is the…",
          "Contenu": "What made orangehost great is the thought of campusing web hosting packages which are of atmost best quality, simple to use and mostly stress free and somehow making it affordable to us"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 5,
          "Date": "2023-10-05T01:49:58.000Z",
          "Titre": "Reinstated account easily",
          "Contenu": "Accidentally caused some spam while loading a demo site,  which triggered an automatic suspension. They listened to my explanation and reinstated me without a problem."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Riza",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T11:40:47.000Z",
          "Titre": "great hosting platform",
          "Contenu": "its nice that orangehost is quick on answering my questions and concerns"
        },
        {
          "Note": 5,
          "Lieu": "LK",
          "Pseudo": "lakshika",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T17:17:11.000Z",
          "Titre": "love you orange host",
          "Contenu": "I have been an avid user of various hosting services throughout my online journey, and I can confidently say that Orange Host stands out as the best hosting provider I have ever come across. The combination of outstanding performance and budget-friendly pricing has made my hosting experience with Orange Host truly exceptional.Performance is undoubtedly the key strength of Orange Host. The speed and reliability of their servers have exceeded my expectations. My website now loads faster than ever, ensuring a seamless and enjoyable experience for my visitors. The uptime has been consistently high, minimizing any potential disruptions to my online presence. The robust infrastructure and cutting-edge technology employed by Orange Host truly set them apart in the competitive hosting industry.One of the aspects that sets Orange Host apart is their commitment to providing top-notch customer support. The support team is not only knowledgeable but also highly responsive. Any queries or concerns I've had were promptly addressed, demonstrating their dedication to customer satisfaction.Affordability is another standout feature of Orange Host. The pricing plans are not only competitive but also transparent, with no hidden fees or surprises. This makes it an ideal choice for individuals and businesses looking for high-quality hosting without breaking the bank. The value for money offered by Orange Host is truly remarkable.The user-friendly interface of Orange Host's control panel adds to the overall positive experience. It simplifies the management of my hosting resources, making it easy for even those with limited technical expertise to navigate and optimize their hosting settings.In conclusion, Orange Host has exceeded my expectations in every aspect of hosting. From unparalleled performance to budget-friendly pricing and exceptional customer support, Orange Host has proven itself to be a reliable and trustworthy partner for my online ventures. I wholeheartedly recommend Orange Host to anyone seeking a hosting provider that delivers on its promises and goes above and beyond to meet user expectations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Demond Burks",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T02:39:06.000Z",
          "Titre": "My web administrator took care of most…",
          "Contenu": "My web administrator took care of most of this and walked me through what/where I needed to be involved. Very easy process"
        },
        {
          "Note": 5,
          "Lieu": "DO",
          "Pseudo": "Norberto Aquino",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T00:02:02.000Z",
          "Titre": "By now i like it",
          "Contenu": "By now i like it, specially for the customer service and the chat. Well done!!!!"
        },
        {
          "Note": 5,
          "Lieu": "NA",
          "Pseudo": "Wilhelm Ndakolute",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T14:22:45.000Z",
          "Titre": "This site is honest about their plan",
          "Contenu": "This site is honest about their plan, no extra charges and deliver what’s promised. They have a Satisfying customer service support."
        },
        {
          "Note": 5,
          "Lieu": "GH",
          "Pseudo": "Desmond Walsh",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T08:57:49.000Z",
          "Titre": "Best so far",
          "Contenu": "OrangeHost has been one of the best hosting providers I have ever used and experienced."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Irvin Rolf Parcon",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T23:18:42.000Z",
          "Titre": "I had a Great Deal with this hosting…",
          "Contenu": "I had a Great Deal with this hosting company and the hosting is fast. Good thing it has cpanel as well. I am very happy with the service!"
        },
        {
          "Note": 5,
          "Lieu": "SV",
          "Pseudo": "Felipe Olivares",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T04:10:42.000Z",
          "Titre": "So far it is good",
          "Contenu": "So far it is good, no complaints and I asked for assistance And I got it satisfactorly"
        },
        {
          "Note": 5,
          "Lieu": "MZ",
          "Pseudo": "Santos Felismina cuambe",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T18:38:17.000Z",
          "Titre": "very good",
          "Contenu": "very good, I enjoyed using this server. I recommend it to everyone"
        },
        {
          "Note": 5,
          "Lieu": "AL",
          "Pseudo": "Albi Zaimi",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T21:57:07.000Z",
          "Titre": "Good company fast service and chipper"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "rehan khan",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T10:50:08.000Z",
          "Titre": "Best service you have but i noticed one…",
          "Contenu": "Best service you have but i noticed one thing that your plans are expensive"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Kamran Ahmad",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T12:06:05.000Z",
          "Titre": "Recommending positively..",
          "Contenu": "Price wise compare to many other hosting providers is very reasonable, trusted and secure. I'm happily recommending to friends and others."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "mudashiru ola",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T10:24:25.000Z",
          "Titre": "Is affordable for less privilege people…",
          "Contenu": "Is affordable for less privilege people and customer support responded quickly above all your services are unique"
        },
        {
          "Note": 5,
          "Lieu": "VE",
          "Pseudo": "Client",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T19:13:39.000Z",
          "Titre": "Good service..",
          "Contenu": "Good service... so far. Hope everything continues that way."
        },
        {
          "Note": 5,
          "Lieu": "RS",
          "Pseudo": "Dejan",
          "Nb_Reviews": 2,
          "Date": "2023-11-19T01:07:10.000Z",
          "Titre": "Very quality and cheap hosting…",
          "Contenu": "Very quality and cheap hosting provider. I recommend to everyone."
        },
        {
          "Note": 5,
          "Lieu": "MK",
          "Pseudo": "Darko Mickoski",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T00:12:05.000Z",
          "Titre": "Great customer support",
          "Contenu": "Great customer support, friendly stuff. Services are easy to use!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Karma Rowe",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T01:13:01.000Z",
          "Titre": "Great price",
          "Contenu": "Great price, Easy to install. fast response with help."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Victor Eweh",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T18:11:32.000Z",
          "Titre": "OrangeHost’s services are AWESOME",
          "Contenu": "OrangeHost’s services are quick, affordable and reliable. I enjoy using their services."
        },
        {
          "Note": 5,
          "Lieu": "LK",
          "Pseudo": "Traffic NEO",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T11:22:47.000Z",
          "Titre": "Great service & Support",
          "Contenu": "Great service & Support! Thank you guys."
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "Jaafar Ben Bouker",
          "Nb_Reviews": 4,
          "Date": "2023-11-26T00:48:53.000Z",
          "Titre": "The support was nice and helpful",
          "Contenu": "The support was nice and helpful. and the service is pretty cheap and good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Upendra  Baniya",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T17:05:03.000Z",
          "Titre": "Orange host is very good and reasonable…",
          "Contenu": "Orange host is very good and reasonable prices"
        },
        {
          "Note": 5,
          "Lieu": "CR",
          "Pseudo": "Emilia Orozco Diaz",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T03:18:09.000Z",
          "Titre": "My experience have been very well."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T22:07:55.000Z",
          "Titre": "One of the best and the fastest hosting…",
          "Contenu": "One of the best and the fastest hosting I have ever used, I can recommend it to anyone"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Aliyan Anwar",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T11:49:40.000Z",
          "Titre": "Great user interface and cpanel hosting"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Allan Dean",
          "Nb_Reviews": 3,
          "Date": "2023-12-09T23:35:39.000Z",
          "Titre": "Good price",
          "Contenu": "Good price, fast service"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "David Umezuruike",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:17:28.000Z",
          "Titre": "They are good"
        },
        {
          "Note": 5,
          "Lieu": "BT",
          "Pseudo": "Sonam Choenjur",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T18:53:21.000Z",
          "Titre": "The support service is excellent with…",
          "Contenu": "The support service is excellent with anytime support for all the technical issues. The price is very reasonable."
        }
      ]
    }
  ]
}