{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "pandadoc.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Mattia Franco",
          "Nb_Reviews": 20,
          "Date": "2023-08-23T08:44:06.000Z",
          "Titre": "Pick any other e-signature software out there",
          "Contenu": "The software is constantly bugging, replacing boxes and words on its own, the \"undo\" function destroyes part of the text randomly.The customer service is a joke, absolute no intention in helping nor acknowledging the errors even after weeks and multiple emails/tickets opened.Such a regret to chose pandadoc, if you are still in time, stay away."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:42:01.000Z",
          "Titre": "too slow",
          "Contenu": "too slow. it's loading all the all."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Roberto Capodieci",
          "Nb_Reviews": 12,
          "Date": "2023-08-14T20:57:19.000Z",
          "Titre": "they trap users in. Cannot delete account.",
          "Contenu": "You google for a free template for a contract, see PandaDoc offering free templates, to open the template they force you to create an account, to then ask you money to actually use the template... and, cherry on the cake, nowhere to be found a button to delete the newly created user account! I imagine with how much pride they show their investors how many users they have... They should tell them that they are all \"trapped\" users. So unethical, mostly in 2023."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Owen",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T00:49:42.000Z",
          "Titre": "I was on trail and I needed somthing…",
          "Contenu": "I was on trail and I needed somthing that I could use to send and receive Credit Card Authorization froms in. I thought they would be like Docu Sign but I got a nasty email from Admin about reading the terms. They do not allow and card number or anything like that. I thought this was a secure place to send Docs? I guess if you want to send a simple Doc for buying a car that does not have any credit card of Social Security number then this might fit you well. Very basic with a high cost in my books."
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Badar Al Tamami",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T18:29:44.000Z",
          "Titre": "Deceptive Billing Practices at Pandadoc",
          "Contenu": "I recently enrolled in a trial membership with Pandadoc, hoping to explore their services. However, my experience quickly turned sour.Firstly, I was required to share my card details for the trial, which felt invasive and unnecessary. Upon deciding to cancel my subscription, I was surprised to find that they continued to charge me for months after cancellation, with no clear communication about the charges.This kind of deceptive billing is unacceptable and leaves a bitter taste in my mouth. I strongly advise potential customers to exercise caution when considering Pandadoc's services, as their subscription practices leave much to be desired."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Erick Gutierrez",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T15:46:23.000Z",
          "Titre": "There is no support",
          "Contenu": "We were using a monthly plan, where we have CRM integration to automatically generate contracts using a template, and that uses Zapier. We were offered a plan upgrade, and after that it stopped working. When I complained to the support, they said it was Zapier's problem, I opened a call with them and they told me that this is a problem already known and not solved by PandaDoc. The account manager has stopped responding to emails and does not answer calls. One of the worst media I've ever seen."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Diego Ortiz",
          "Nb_Reviews": 2,
          "Date": "2022-09-16T16:55:22.000Z",
          "Titre": "A digital company whose website... doesn't work?!",
          "Contenu": "How on EARTH can you be a company that does ONE THING: documents, and your website NOT WORK?HOW! Imagine you go to the shopping mall, and constantly that shopping mall is closed, or leaking, or flooded, or lights are out.Tell me, who on earth would ever visit that place again?Guys, honestly and seriously, as a business owner to another, FIX YOUR DAMN SITE. This is YOUR storefront! You are a digital-first business, act like it!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nick Strada",
          "Nb_Reviews": 1,
          "Date": "2022-08-20T02:04:24.000Z",
          "Titre": "Buggy software. Awful customer service.",
          "Contenu": "Really buggy software, difficult UI, and shabby customer service. My subscription autorenewed on an annual plan billed quarterly. I tried to cancel the day after, as we had moved to Hellosign, and they wouldn't let us out of the contract. Run away."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Pickawoowoo Publishing Group",
          "Nb_Reviews": 1,
          "Date": "2022-05-27T05:58:12.000Z",
          "Titre": "Our experience with this company has…",
          "Contenu": "Our experience with this company has been less than professional to say the least. For example - they originally had QuoteRoller and wanted people to transfer to Pandadoc. We used QuoteRoller for 8 years (loyal customers and can show receipts to prove it) and then out of the blue we were told we HAD to transfer to Pandadoc. We tried Pandadoc - what a mess. Client services were poor, no response, no assistance, and just to add salt to the wound - THEY WOULD NOT REFUND THE BALANCE OF OUR SUBSCRIPTION FROM QUOTE ROLLER. No response to any emails. So bad, so sad. Avoid this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kerri Wright",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T01:38:17.000Z",
          "Titre": "Charges even after I cancelled.",
          "Contenu": "I was unable to use this service after enrolling and asked to cancel. I went back and forth with the company and they agreed to cancel the subscription. Then 3 months later charged my card and after going back and forth, 6 months later they charged my card again. I spoke with several representatives and none could reverse the charges or cancel the upcoming charges. So I essentially paid for a service I could not use. Very disappointed!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carlos Herrera",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T18:01:53.000Z",
          "Titre": "Awful Customer Service & Predatory Schemes",
          "Contenu": "Awful customer service. I canceled my trial, but kept getting notifications that they were trying to charge me afterwards, so I contacted customer service, and while they assured me I wouldn't get charged because it was canceled now, days later, I'm still getting attempts to charge it! When I contact customer service, the agent immediately leaves the live chat. THEY'RE AVOIDING ME!I'm leaving my card frozen and contacting a lawyer if this keeps up in 30 days. This feels so predatory!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Suzanne",
          "Nb_Reviews": 3,
          "Date": "2023-01-10T22:31:11.000Z",
          "Titre": "CRAP!!!",
          "Contenu": "CRAP!!!! Was working on a doc for over two hours when it suddenly frozen saying: \"oops, unexpected snag\". Two hours of work out of the window with no opportunity to recover. Waste of time, effort. Rubbish product!!!!@!!@!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brittany Aanestad",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T20:19:38.000Z",
          "Titre": "WORST CUSTOMER SERVICE",
          "Contenu": "I have had a terrible experience with PandaDoc thus far! The demo call with Nikita was probably one of the worst sales pitches I have ever heard. He could care less about telling me about PandaDoc. Alternatively, I signed up for a very basic account - paid annually, which equated to $19/month. Upon paying, PandaDoc moved my membership to $59/month! I have reached out multiple times over the last 19 days with no answers of how they are handling my company credit card and having the billing sorted! I have not only customer support on the email chain, but Nikita and Joshua who was the first person I ever spoke with. ABSOLUTE CRICKETS! Crap service. The only reason why I still have an account now is due to already building our template in the system and sending our contacts to customers virtually."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Brenda Campbell",
          "Nb_Reviews": 1,
          "Date": "2021-08-05T09:29:30.000Z",
          "Titre": "What a disappointment",
          "Contenu": "What a disappointment.  After reviewing other options, we selected Pandadocs as a reasonably priced alternative for documents.  Right from the outset we had difficulties with access and log ins.  Somehow two accounts were opened and we were billed twice. For most of the period before we cancelled, we had almost no access due to log in problems.  Support was slow and only via email.  When asked to speak directly with someone to discuss the billing problem and access issues, I was told it was not possible. There was no remorse or intent to assist or explain.  The product itself was just ok; the template gallery was lacking. It is a shame that we wasted time on what could be a great product with good service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Luis Buitron",
          "Nb_Reviews": 1,
          "Date": "2022-10-01T17:52:54.000Z",
          "Titre": "AWFUL customer support. Expect months for your issue to be resolved",
          "Contenu": "Expect months for your technical support questions to be addressed if you’re lucky. I would send a ticket for help, they would respond with links for tutorials, then I ask for real human help, a different associate would respond asking you to explain your issue again, then no response for weeks, then you submit your request and a new associate will ask you to explain what the problem is. It’s a really annoying service. They don’t care about you literally"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "T J",
          "Nb_Reviews": 4,
          "Date": "2020-12-03T20:05:11.000Z",
          "Titre": "Worst Customer Service - Lack of support",
          "Contenu": "Been using Panda Doc for years. Recently software stopped working and had error messages. Reported it twice. Nothing done about it. The support agents were asking me to diagnose it for them! Its a cloud based service so what do they expect me to do?!Sent them screenshots and they dont have a clue. They just did not bother. No one contacted us after and even checked if the issue is resolved. Another one of those companies who just to take money but do not want to provide the support when its needed. Lazy support agents with no initiative or any understanding of customer service. They just “leave it” for us to chase them and to beg for support. Cancelling subscription! Good riddance!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Stephen Kennedy",
          "Nb_Reviews": 1,
          "Date": "2021-02-22T13:40:08.000Z",
          "Titre": "Don't trust Pandadoc",
          "Contenu": "I canceled my subscription on November 14, 2020 in writing. I was charged again on February 14, 2021. It is now February 22 2021 and after having several chats online about it, including one with a manager, Ryan Geronimo on February 18, I have received no follow-up and no refund. Don't waste your time with this poorly run company that avoids you after they take your money without your permission."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "D Russell",
          "Nb_Reviews": 16,
          "Date": "2021-10-06T07:39:08.000Z",
          "Titre": "Warning to small to medium-size companies",
          "Contenu": "The product is excellent but not suitable for small to medium-sized businesses; it's way overkill for the needs of such companies.Regarding the free trial, be so careful (a) they do not send a reminder that you're coming to the end of your free trial like other companies.They make lots, and I mean lots of attempts to take money from your accountI'm a start-up, so my client base is small and payments low and infrequent but this company made 10 attempts in 4 days until they got money, and even though it was taken after I cancelled, they still won't refund my money, so it off to a small claims court.  Please do not use these guys unless you are a large company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Randy Marsh",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T02:48:22.000Z",
          "Titre": "Free trial is a scam",
          "Contenu": "Free trial is a scam. They claim to support unlimited esignatures but they don't allow you to download documents without using a paid tier. Pure bait & Switch."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Dylan Philpott",
          "Nb_Reviews": 3,
          "Date": "2023-01-26T23:23:22.000Z",
          "Titre": "Avoid this company-SCAM",
          "Contenu": "Avoid this company. Charged me for 12 months without my knowledge. Got onto their customer service and they stated that due to their billing policy they could not issue a refund even though I had not used their service or signed in to their website. Would have charged me indefinitely if I didn’t spot it.In response to their review and as explained to PandaDoc via correspondence, I cancelled my website along with my domain as it was hacked - this refused me access to my Company email. PandaDoc took 12 months of fees without cancelling. I was subscribed to 3 other services with my business email and they all cancelled after 2 months of me not using their service. PandaDoc would have charged me indefinitely, customer service was useless and they refused refunds. Scam. DO NOT USE."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J F",
          "Nb_Reviews": 1,
          "Date": "2021-11-26T23:15:30.000Z",
          "Titre": "WOW!!! NEVER AGAIN",
          "Contenu": "WOW!!!! Terrible customer service. We signed up for the Essentials package and they have been double charging us for 7 months. Somewhere during that time they changed our plan without our consent and now we're being billed 2x as much and then continued to charged us twice a month.  I've been trying to get this resolved for months and the agents do not seem to understand English well. Needless to say they are not giving us the refund it should be....which now is in the hundreds of dollars and it's been a huge waste of time. Their service is not worth it. I'm now having to get this resolved through the bank and looking for an alternative to PandaDocs...never never again...OMG"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Linda Drassen",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T12:40:20.000Z",
          "Titre": "I used to LOVE PandaDoc",
          "Contenu": "I used to LOVE PandaDoc - it was so easy to use; you could jump on and easily accomplish tasks without even using the tutorial.  Then they \"updated\" the product and now it is a pain.  They removed the ability to duplicate proposals, so I have to rebuild; their templates are difficult to modify and optional line items are no longer easy to delineate, and I keep losing what I do build because the 'save' feature does not work the way it used to.  Customer Service is absolutely no help - while they answer quickly, I find that the actual 'help' part is short of useful (no suggestions or hints).  I am better off just using a Microsoft Word document - so I will be ending my 7-year relationship with PandaDoc."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Joshua",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T23:02:26.000Z",
          "Titre": "expire same day and this…",
          "Contenu": "Document needs to expire on the same day and this is not possible and we have been asking for it for a long time, also we need reminders to be daily not just 3 days or a week. Please assist."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Katherine",
          "Nb_Reviews": 1,
          "Date": "2021-11-15T15:50:19.000Z",
          "Titre": "Bait and switch",
          "Contenu": "Their product does not work the way I needed it too, but this was not advertised and I assumed that it worked much like DocuSign. I requested a refund several times as we only used the site for a week. No one is responding. I've waited months and sent multiple emails."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "PoolGB Group",
          "Nb_Reviews": 2,
          "Date": "2023-02-24T05:24:38.000Z",
          "Titre": "Do not try them at all",
          "Contenu": "Do not try them at all - Big Scam - they will take money from your bank account for a year and refuse refund even if you are not using them"
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Callum Reckless",
          "Nb_Reviews": 6,
          "Date": "2023-05-31T14:06:36.000Z",
          "Titre": "We had been enjoying PandaDoc until…",
          "Contenu": "We had been enjoying PandaDoc until their price increases came in... They slapped a 550% price increase on us, per user, with a 14 day notice period. Not cool PandaDoc, not cool at all!!"
        },
        {
          "Note": 1,
          "Lieu": "PE",
          "Pseudo": "Daniela",
          "Nb_Reviews": 4,
          "Date": "2022-06-03T18:10:24.000Z",
          "Titre": "I generally never leave bad reviews but…",
          "Contenu": "I generally never leave bad reviews but I feel its only necessary to warn people. PandaDoc is not the solution for small or medium sized businesses who need flexible pricing options to grow with their business. They locked me into annual pricing, initially I didn't mind because the software worked well. BUT...when I needed to add another user for a few months it required a lot of back and forth to simply add a new user. When I went to remove the user who was no longer in that role, they told me I had to pay for 9 more months even though I was no longer using the seat. Like others who have left reviews, I am now spending time on multiple email back and forth escalating to various team members because no one at PandaDoc actually has to ability to make things right on their own. I would have never started with PandaDoc if I knew that upgrading and downgrading and adding and removing users was going to result in locked in pricing and terrible customer service that takes time away from my business."
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Power Staffing AB",
          "Nb_Reviews": 1,
          "Date": "2022-11-24T09:14:57.000Z",
          "Titre": "My client doesn´t get the contracts i…",
          "Contenu": "My client doesn´t get the contracts i send him. Even though the email address is correct. This makes me look stupid and unprofessional."
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Tom E",
          "Nb_Reviews": 2,
          "Date": "2023-01-25T19:51:05.000Z",
          "Titre": "Dysfunctional and misleading app",
          "Contenu": "I imported about 20 documents, assigned signature fields and shared to all recipients for signatures. I got feedback as people signed documents and when documents were completed with all signatures. However, when downloading the completed documents there are no signature certificates. Customer support now tells me that even if it states signed and completed, and even if all recipents have confirmed that they did in fact open, sign and finish the document, no signature certificates are in fact available and we need to do it all over again. In fear that the result will be the same, I will opt for a different application for document signatures."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ralphus Maximus",
          "Nb_Reviews": 6,
          "Date": "2021-01-07T12:31:32.000Z",
          "Titre": "Very disappointed with Panda",
          "Contenu": "Very disappointed with Panda. A legacy business customer who's been using (and promoting) Panda since the beginning. We required assistance by asking for our service essentially cloned for another area of our business. We were swiftly told that our 'legacy' pricing was unavailable moving forward and if we wanted the same features moving forward (that I've had for 8 years) Wed be expected to pay (in the rep's words.. a little more)  - which we understood.. However! our agreement costs under £200 a year & would now be expected to pay £3000 a year for the same features we had prior...Whilst times and services change.. am& we are only a tiny valueless customer. to them (which was made crystal clear!).. We believe PandaDoc has turned its back on the very businesses and people who supported them and grew their successes .. especially when plenty of already established alternatives were out there to begin with..As for the platform. It's ok, nothing others don't offer nor is it any more customer-friendly... though we now know its pricing is not only monsterously high for new customers joining - but that they have no care for existing customers... i will be exploring significantly cheaper alternatives as they look very much the same. only take 5 seconds of google!! Cheers for supporting the people who made your business a success PandaDoc & on behalf of all your old customers.. we hope your success is long-lived..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jared Plotka",
          "Nb_Reviews": 1,
          "Date": "2022-01-28T14:00:55.000Z",
          "Titre": "This is an honest review ( stay away)",
          "Contenu": "This is an honest review, please read this before signing up. I was asked by someone who refers clients for commission to set up an account with pandadoc. I signed up for the yearly membership and it was going pretty well until about a couple days ago. I added someone from my team and the software charged me double without even asking me at all. I took them off immediately and asked pandadoc customer service for a refund. I spoke with them initially over the phone and they said no problem. KEEP IN MIND THEY CHARGED ME DOUBLE. Now, instead of issuing me a refund they have sent me in circles To a million different departments and requested I do many things to get this refund. No one can give me the refund and they are continuing to waist my time. To be honest It’s not worth my time to handle this and it’s probably not worth other peoples time, and they think they can just get away with stealing your money and charging you 100’s extra without asking. I figured rather than continuing to follow up with them I will write a review so others can stay away from this software. I will be searching for another company to use as well as there are many others out there.Thanks,Jared"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Muratori",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T07:09:56.000Z",
          "Titre": "One of the most basic feature missing",
          "Contenu": "One of the most basic feature missing: you can’t duplicate in bulk the catalog items, so it isn’t useful and inefficient."
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Area Group",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T22:13:59.000Z",
          "Titre": "Hi I need the money deposited back",
          "Contenu": "Hi I need the money deposited back. The purchase was canceled immediately as it was a mistake."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Mattia Franco",
          "Nb_Reviews": 20,
          "Date": "2023-08-11T08:14:03.000Z",
          "Titre": "Terrible customer service and bugs all over",
          "Contenu": "Terrible customer service. Bugged software, text changing on its own.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Neal Mcleod",
          "Nb_Reviews": 2,
          "Date": "2022-08-17T18:03:17.000Z",
          "Titre": "This software is so buggy",
          "Contenu": "This software is so buggy. Im not sure how this company is still around. The idea is great but poorly executed. I hate them. They cost me so much in time. Oh yea and way overpriced for what they offer."
        },
        {
          "Note": 1,
          "Lieu": "LV",
          "Pseudo": "Innokenty Isers",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T18:23:43.000Z",
          "Titre": "Pandadoc sales team is awful.",
          "Contenu": "Got in touch with their sales team. We had a chat with Kurt Eskicioglu, he was rude and unhelpful. One of the worst chat with the sales team of all time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Justin Brown",
          "Nb_Reviews": 1,
          "Date": "2022-09-09T22:08:42.000Z",
          "Titre": "Software is buggy and customer support…",
          "Contenu": "Software is buggy and customer support is unhelpful. Seems like a scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Claudine",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T15:21:22.000Z",
          "Titre": "I FEEL LIKE I WAS PUSHED INTO THE…",
          "Contenu": "I FEEL LIKE I WAS PUSHED INTO THE ACCOUNTING UPGRADE.   I HAVEN'T HAD TIME TO USE IT. I'VE JUST BEEN PAYING FOR IT."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Olly",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T20:51:12.000Z",
          "Titre": "Definitely bumpy experience with…",
          "Contenu": "Definitely bumpy experience with getting a surprise api charge after panda was involved in implementation of our product."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Shaun",
          "Nb_Reviews": 10,
          "Date": "2019-05-08T14:05:30.000Z",
          "Titre": "Poor service",
          "Contenu": "Poor service, pay for support but they can't resolve anything and take ages to reply.Little integration and functionality.Have to sign everything even when it's not required.Paid over $600 and constant issues. Told that they won't issue a refund if we were unhappy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Nicholson",
          "Nb_Reviews": 4,
          "Date": "2022-11-07T15:52:25.000Z",
          "Titre": "Poor support",
          "Contenu": "Poor support. Misled me regarding onboarding."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Merry",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T23:35:38.000Z",
          "Titre": "false advertising"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2022-10-13T23:56:10.000Z",
          "Titre": "Continual annoyance with asking for…",
          "Contenu": "Continual annoyance with asking for reviews and feedback"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Miguel C.",
          "Nb_Reviews": 6,
          "Date": "2018-07-07T02:34:04.000Z",
          "Titre": "No response on support or help",
          "Contenu": "No response on support or help, worked with partner firms and couldn't get assistance. Moved to DocuSign."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Scott Van Heurck",
          "Nb_Reviews": 1,
          "Date": "2021-05-06T12:44:44.000Z",
          "Titre": "Dont trust these guys",
          "Contenu": "Dont trust these guys - total rip off"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Natalia",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T21:58:34.000Z",
          "Titre": "Expensive for Small Business Users",
          "Contenu": "For my type of usage, this is very expensive. The program works well I just wished they had a tiered payment plan set-up for smaller business owners."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "Marc",
          "Nb_Reviews": 35,
          "Date": "2023-01-18T00:37:32.000Z",
          "Titre": "Rip Off and Expensive Upsell for Basic Features",
          "Contenu": "I am a current PandaDoc customer. I will shortly change to another provider and I would recommend you save the time, hassle and dreadfulness you experience as their paying customer and go for a better service right away. They portal and the UX is well done. Everything works well. But if you need anything basic, the upsell starts. For example: I am paying already $29 per month. I would like a report of my documents and download it as CSV or XLS. This only available as a paid add-on and you have to be on a more expensive plan. Getting a report in Excel or CSV format is industry standard and should always be included. This is only one example where they try to rip you off and upsell you on more expensive tiers. I will finish my campaign there and then cancel."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Chris Bone",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T19:24:52.000Z",
          "Titre": "Beware of 'free' trial",
          "Contenu": "They offer a 'free' trial, so I spent time completing a form to send. When it came to share it, I was asked to upgrade as they wouldn't let you share the file (for signing) under the 'free' trial.I also scheduled a demo, but no one turned up. I waited 20 mins then gave up.The chat with online help cuts out (x3, until I gave up on that also). Staff talk about 'looping in' and 'creating tickets' without really much help or guidance."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Angela Hackworth",
          "Nb_Reviews": 3,
          "Date": "2022-12-12T18:11:21.000Z",
          "Titre": "The Orange Chicken must Arrowhead Mall-Panda Express.",
          "Contenu": "The Orange Chicken must have been sitting for quite a while.  You could hardly put your plastic fork into the chicken to pick it up!  It didn’t taste fresh and was hard n crunchy when attempting to eat!!!!    I was told that chicken egg rolls would be ready in 5 minutes, while it actually took 15 minutes!   Every other time I tried Panda, the food was fresh!  It’s different to visit and the food is lukewarm n crunchy!   Don’t know if employees are rushing and not checking to see if adequate supplies of food are readily available!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Wilson",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T06:23:40.000Z",
          "Titre": "There is no auto calculation feature",
          "Contenu": "There is no auto calculate that I have found. Like a basic spreadsheet does. If I input (15) Series 4000 windows @ $403 each. The total calculating automatically, along with subtotal, tax rate and ect. This would make me rate it at its highest rating."
        },
        {
          "Note": 2,
          "Lieu": "ID",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2021-12-01T03:29:44.000Z",
          "Titre": "Everything costs extra",
          "Contenu": "Everything costs extra. \"Approval Feature\" included BUT.. only in the yearly plan. \"Automations\" included BUT.. not triggering a signature, only in Enterprise. \"Affliate\" yes, BUT.. only for yearly subscribers. They try to squeeze everything out of their customers. I am really looking forward to cancel PandaDoc when there's an alternative."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mark H",
          "Nb_Reviews": 2,
          "Date": "2021-11-12T12:42:18.000Z",
          "Titre": "Good product, bad service",
          "Contenu": "Pandadoc is a good product overall, but the technical support/customer service leaves a lot to be desired. I had a great system going, with integration to Pipedrive and Xero, but then one day the Xero integration suddenly stopped, and I was told I'd have to upgrade to their new editor, whereby I could use Zapier instead. I reluctantly agreed after being promised I would not lose any functionality. After the upgrade I lost 2 features that I use a lot and now they tell me they'll add these as \"enhancement requests\" (not bugs). And they won't give me any refunds for the inconvenience. Be warned. If you sign up, don't expect to have issues fixed very quickly. They do not treat their loyal customers well."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Hayley",
          "Nb_Reviews": 2,
          "Date": "2022-04-07T22:36:52.000Z",
          "Titre": "Poor SLA, poor outage coordination, denial of responsiblity",
          "Contenu": "PandaDoc is a decent product when it works. When it does not work, don't expect to get a timely response, and don't expect their team to proactively coordinate to solve your issue. They will push you to submit a bug ticket for every incidence of an issue, even when there is a clear, repeated pattern that there is a larger problem or outage. Their team will not go out of their way to help, they don't take any visible responsibility for coordinating a response, and they don't provide clarity in to when you can expect resolution. If you press them for support or solutions, they make excuses about the challenges around finding and fixing unidentified bugs, and you might even provoke an unprofessional response if you are persistent in getting answers. Frankly, I wouldn't really recommend them."
        },
        {
          "Note": 2,
          "Lieu": "UA",
          "Pseudo": "Alex Z",
          "Nb_Reviews": 3,
          "Date": "2021-03-18T09:37:28.000Z",
          "Titre": "Not so good as wanted",
          "Contenu": "Not long ago just suspended our business account without any explanations and we just lost signed contacts for last 3 years... just amazing... I do not recommend using"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ralph",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T18:10:32.000Z",
          "Titre": "Lacks Features",
          "Contenu": "Lacks features. I've requested several over the past years. Still nothing"
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Andrew Smith",
          "Nb_Reviews": 1,
          "Date": "2018-05-10T20:08:09.000Z",
          "Titre": "It's an expense product that for the…",
          "Contenu": "It's an expense product that for the price should have more features.It also runs slowlyA number of our clients haven't been able to access."
        },
        {
          "Note": 2,
          "Lieu": "AE",
          "Pseudo": "Stellaswap",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T05:07:18.000Z",
          "Titre": "Too expensive"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ALS.LLC",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:38:40.000Z",
          "Titre": "Normally i dont fill these out but",
          "Contenu": "Normally i dont fill these out but I do like you guys.. the parts of PD i dislike is the speed and glitches that i deal with daily. its ok I get through it but more speed would make things easier, I also wish you had nightmode to make things easier on my eyes....Im also not thrilled with the stance you guys take on certain world views but i wont get into that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T18:42:36.000Z",
          "Titre": "Aspects I would Improve Upon",
          "Contenu": "1. Email notifications for documents say document is completed, when actually the signers is still working on it (makes it really easy for documents to get lost)2. Dashboard documents are not sorted by date of completed.3. Dashboard does not have a search function that I am aware of"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T21:21:13.000Z",
          "Titre": "Editing problems",
          "Contenu": "some of the editing features are cumbersomeThe Pricing tables also need a subtotal without tax or discountsI recently had issues with suggested comments feature and was not able to get it resolved. we discontinued allowing recipients to suggest edits"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RH & ASSOCIATES",
          "Nb_Reviews": 2,
          "Date": "2023-03-03T17:37:02.000Z",
          "Titre": "system goes down to much",
          "Contenu": "system goes down to much. Not user friendly.need more options like ( title of signer )"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T23:24:00.000Z",
          "Titre": "Intermediately fails to load files",
          "Contenu": "Intermediately fails to load files. May take several attempts to load. Great program otherwise."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Olivia",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T17:15:40.000Z",
          "Titre": "Pandadoc",
          "Contenu": "Lots of glitches with the website"
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T12:09:15.000Z",
          "Titre": "I like the many possibilities",
          "Contenu": "I like the many possibilities concerning document-management. Sometimes it is hard to find certain functionality, so the user-interfaace could perhaps be made better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christie Summervill",
          "Nb_Reviews": 2,
          "Date": "2022-10-25T20:51:25.000Z",
          "Titre": "Way too expensive for the value",
          "Contenu": "Way too expensive for the value. Just raised prices by 30%!"
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Stefaan Potums",
          "Nb_Reviews": 1,
          "Date": "2018-05-04T07:00:28.000Z",
          "Titre": "I love working with Pandadoc, but...",
          "Contenu": "I love working with Pandadoc, however some remarks- picture lay-out editing could be improved (limited options to resize for example)- the connection is not always good, and tends to block from time to time (especially when i'm in the pricing tables)- some more modern design examples would be great. there's only one that kind of gives me a more \"modern\" touchbut for the rest : a great tool and timesaver for me!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T19:52:46.000Z",
          "Titre": "Quotes look professional, but slow to produce",
          "Contenu": "Editing is slow and clunky"
        },
        {
          "Note": 4,
          "Lieu": "SK",
          "Pseudo": "Monika",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T15:48:26.000Z",
          "Titre": "Overall",
          "Contenu": "Workflow, easy way to get signatures, new features for editing docs (Collaborate), pricing tables.What could be improved - it is not possible to insert a page into a doc. Overall managing graphics is cumbersome."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T09:24:36.000Z",
          "Titre": "I enjoy the services I am receiving",
          "Contenu": "I enjoy the services I am receiving. The only feedback I have is, PandaDoc markets itself toward the small business owner. I would suggest offering more features without every one being an upgrade / costing more money. Smaller businesses work on a tighter budget, this should be a focus point when providing packages / rates."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Jewett",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T00:42:34.000Z",
          "Titre": "Very good product that saves time and money",
          "Contenu": "The product is very user friendly.  There could be some improvements around document handling.  Specifically in Templates and Publishing.  I did not appreciate that after creating a relationship with the original sales rep, that I was handed off to another group.  This separates the business-to-business relationships that bind and tie the two companies.  In addition, promises made cannot be kept and become one sided."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Andrew Richard",
          "Nb_Reviews": 4,
          "Date": "2019-11-05T16:23:54.000Z",
          "Titre": "Incredible integration with Pipedrive!",
          "Contenu": "Incredible integration with Pipedrive! We love it, pulling product pricing and quantities, etc from pipedrive we can build up standardized proposals in minutes worth millions. This means more time in front of our clients and less time in front of our computers. It's really good to have insight when clients are view proposals or forwarding them on to other people in their org. Time saver!"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Sacha",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T05:19:19.000Z",
          "Titre": "The Customer Success Process...",
          "Contenu": "Last Friday I had a conversation with Your success manager Sonia Serra, it was a great experience. She listened carefully to my remarks and proposed a clear and workable path forward. I am very confident we will be able to increase our usage and better use of the systems updated capabilities. Job well done."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelle M.",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T18:57:17.000Z",
          "Titre": "Love Panda, BUT \"SIGNATURE FONT\" default changed or allow us to set it when adding box",
          "Contenu": "Love Panda, would be a 5* if the signature font could be cursive as default or allow us to set it the font when we add a \"signature\" block to a document.  That is the only issue keeping us from using Panda as our full-time provider.  Documents have a standard and Comic font does not qualify as a signature on our docs."
        },
        {
          "Note": 4,
          "Lieu": "CZ",
          "Pseudo": "Josef",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T08:36:37.000Z",
          "Titre": "Intuitive tool",
          "Contenu": "Intuitive tool, reasonable pricing. It meets our needs. To provide 5* rating I would need more functions to be available through API and improved handling of objects within the layout."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Kristen",
          "Nb_Reviews": 2,
          "Date": "2022-10-26T02:43:00.000Z",
          "Titre": "The software is amazing but customer service not so much",
          "Contenu": "The software is amazing, so easy and great design. But the customer service is sub par. I didn’t get that discount even though I reached  out several times while thr promotion was on. No one got back to me and it’s hard to find any reliable contact info."
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "James Dawson",
          "Nb_Reviews": 24,
          "Date": "2020-12-24T19:24:31.000Z",
          "Titre": "Probably the best of legal templating…",
          "Contenu": "Probably the best of legal templating that I have tried.  They are a little lacking in templates and its impossible as of the date of this writing to copy/paste with formatting from the PFDs.  Still it worked very well and pricing is reasonable.  They also have a good free trial period."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2022-10-06T19:53:55.000Z",
          "Titre": "Pandadoc is awesome",
          "Contenu": "Pandadoc is awesome! Just lacks a few Doc features that I'm used to from MS Word, and some calculation features/logic but otherwise pretty awesome stuff!"
        },
        {
          "Note": 4,
          "Lieu": "CY",
          "Pseudo": "Marilena Ntoufa",
          "Nb_Reviews": 3,
          "Date": "2023-02-20T11:55:24.000Z",
          "Titre": "PandaDoc is great and user friendly",
          "Contenu": "PandaDoc is great and user friendly application.It can be confusing when uploading bulk signees, which is why I have not used this yet. It is too confusing to me :/"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Rev. Dr. D",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T04:59:30.000Z",
          "Titre": "PandaDoc is versatile and easy to use",
          "Contenu": "PandaDoc is versatile and easy to use.  My clients like it and it has helped me speed up the process of getting clients to sign off on agreements and contracts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deb",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T17:41:43.000Z",
          "Titre": "Easy to use",
          "Contenu": "This is an easy tool, that allows you to keep all contracts managed.  Easy to create and use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T17:10:51.000Z",
          "Titre": "Generally a very effective way to get…",
          "Contenu": "Generally a very effective way to get documents out for signing.  My only problem was with the initial navigation  to a template that could be edited.  Help articles not effective."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Jennifer Grace",
          "Nb_Reviews": 4,
          "Date": "2020-03-02T04:46:13.000Z",
          "Titre": "Great product for use in my marketing…",
          "Contenu": "Great product for use in my marketing job. The customer service is one area that could be improved upon, otherwise my review would be for 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T05:56:52.000Z",
          "Titre": "PLEASE add a “Disable Auto Snap” button",
          "Contenu": "All good, but adding fields to documents can be really frustrating, especially with the auto-snapping feature. Please allow us to turn off auto-snapping :)"
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "O W",
          "Nb_Reviews": 1,
          "Date": "2022-10-17T20:46:28.000Z",
          "Titre": "Great overall",
          "Contenu": "I really like the app. Great UX and intuitive to use. I just don't like that I can't send a single link to multiple people. I like to send the documents via links, and if I'm sending to more than one person, it's very clunky. I wish there was a single link that everyone could access."
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Johan",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T07:24:21.000Z",
          "Titre": "Pandadoc a very good tool w room for improvement",
          "Contenu": "The web based application for managing document and signatures is the best I've seen and used.However the mobile app (android) is truly dreadful, extreme performance problems and Base functions are missing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adriana",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T15:36:16.000Z",
          "Titre": "User friendly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kelly-Jo",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T21:56:44.000Z",
          "Titre": "I like the ease of sending documents…",
          "Contenu": "I like the ease of sending documents for signatures instead of sending them with students and hoping they make it home and back to me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T20:53:54.000Z",
          "Titre": "I like PandaDoc",
          "Contenu": "I like everything about PandaDoc except I’m asked to log in far too often"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Paula",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T17:28:30.000Z",
          "Titre": "PandaDoc is great",
          "Contenu": "PandaDoc is great. The only reason 4 stars is that I find it difficult setting up templates."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Focus",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T20:11:45.000Z",
          "Titre": "Easy & efficient experience",
          "Contenu": "I appreciate the ease and efficiency that the Panda Docs form affords our business."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MAISHA",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T19:47:17.000Z",
          "Titre": "rep was able to assist me with updating…",
          "Contenu": "rep was able to assist me with updating my method of payment"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "holly",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T22:32:32.000Z",
          "Titre": "i love the documents",
          "Contenu": "i love the documents, but on occasion the platform has system problems and wont load properly."
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T21:31:16.000Z",
          "Titre": "The service has been good",
          "Contenu": "The service has been good. However, I will like to see more features to make docs with design."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Rao",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T01:49:22.000Z",
          "Titre": "Easy to use app",
          "Contenu": "Easy to use app. Fantastic for light users."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T23:16:47.000Z",
          "Titre": "It is easy and intuitive to use",
          "Contenu": "It is easy and intuitive to use. It is easy to modify. It helps me keep track oy 100's of quotes. Thank you !"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "tim",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T08:54:53.000Z",
          "Titre": "clear information",
          "Contenu": "clear information. offering a meeting to explain open end questions"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T13:32:14.000Z",
          "Titre": "transportation specialist",
          "Contenu": "Soft ware woorks great . only thing is I would like auto correct function."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T15:17:49.000Z",
          "Titre": "Good tool",
          "Contenu": "Good tool.  Some subtle change could make things more navigable."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "EH",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T20:45:32.000Z",
          "Titre": "It´s good, but I find anoying to have this login…",
          "Contenu": "I find anoying to have this login prompt so much"
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Tony Fang",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T08:02:12.000Z",
          "Titre": "Very Good",
          "Contenu": "Very Good, but still can be improved on some part."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sariah",
          "Nb_Reviews": 1,
          "Date": "2018-04-19T20:40:23.000Z",
          "Titre": "My favorite part about PandaDoc is…",
          "Contenu": "My favorite part about PandaDoc is their customer service. There is always a response within the next business day and someone who works tirelessly to fix my issue. I feel like they really try to figure out the problem by actually attempting to recreate it themselves. They are also always coming out with changes and improvements. I've been using their product for several years now and plan on continuing."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Dante",
          "Nb_Reviews": 1,
          "Date": "2022-10-07T11:43:26.000Z",
          "Titre": "Very good",
          "Contenu": "Very good. I like the interface a lot"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Kevin Pritchard",
          "Nb_Reviews": 1,
          "Date": "2018-04-19T14:39:44.000Z",
          "Titre": "Excellent document management and nice…",
          "Contenu": "Excellent document management and nice integration with Hub Spot.  Some wrinkles in terms of formatting fonts etc and document templates but we would not be with out the integration with HUB SPOT"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Damon Segal",
          "Nb_Reviews": 1,
          "Date": "2018-05-04T21:59:10.000Z",
          "Titre": "It's a great system for creating…",
          "Contenu": "It's a great system for creating proposals although I wish I could pull price totals onto a summary table!  Otherwise I love it!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terri",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T15:36:15.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use.  Suits our needs very well."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Kurt Graver",
          "Nb_Reviews": 2,
          "Date": "2018-05-03T17:59:44.000Z",
          "Titre": "Helped me win lots of business and…",
          "Contenu": "Helped me win lots of business and track clients interaction with my proposals."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Derek",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T12:23:23.000Z",
          "Titre": "Fast easy to use."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Katherine",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T18:08:56.000Z",
          "Titre": "Simplicity",
          "Contenu": "Simplicity, efficient"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T04:33:02.000Z",
          "Titre": "Great alternative to Docusign",
          "Contenu": "Pandadocs is easy to use and very efficient and getting a lot of paperwork signed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Crystal",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T18:37:41.000Z",
          "Titre": "User Friendly",
          "Contenu": "The program is very user friendly for both the company and the customer. Any issues that we have faced were handled professionally and in a timely manner with customer service.  We have had a great experience with PandaDoc and would defiantly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ceasar",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T23:59:04.000Z",
          "Titre": "PandaDoc provides excellent services…",
          "Contenu": "PandaDoc provides excellent services that outshine their competitors. They are very professional and available when you need their assistance. I highly recommend them and guaranteed that their services will make you proud!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Bec",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T07:12:17.000Z",
          "Titre": "PandaDoc is great",
          "Contenu": "PandaDoc is great, really simple to use and the fact that you can send documents via email or via a link ticks a lot of our boxes. I do wish there were some more enhancements such as being able to automate settings for roles for documents (as you can do in templates)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Iris",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T18:24:26.000Z",
          "Titre": "fast way to have documents done.",
          "Contenu": "Company just introduced the software to me, but in reality I have been watching YouTube videos on how to use PandaDoc and features. I love it!! When I have my Clients using it, they are happy and confident with the program, It is easy and fast way to get documents done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KH",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T23:16:15.000Z",
          "Titre": "Easy and convenient!",
          "Contenu": "Such a convenient and accessible way to get things signed! It's super easy to use as well."
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Muli",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T03:56:53.000Z",
          "Titre": "For me personally",
          "Contenu": "For me personally, this is very helpful in making approvals from my Board of Directors and other departments, (faster, easier, and stored in soft copy),For other functions, it has not been studied and it would be better if there is a kind of flyer for brief information to know how to read easily."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reprise",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T19:05:54.000Z",
          "Titre": "Very easy to implement via APIs",
          "Contenu": "Very easy to implement via APIs.  We were looking for an esignature solution that was quick to get up and running, and this definitely worked out well for us."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brain Buzz Marketing",
          "Nb_Reviews": 6,
          "Date": "2023-12-06T19:55:43.000Z",
          "Titre": "PandaDoc is an absolute game-changer",
          "Contenu": "I've been using PandaDoc for a while now, and I must say, it's an absolute game-changer in the realm of document automation and management. The platform is incredibly user-friendly, making it easy for even the most technologically challenged individuals to navigate and use effectively.One of the standout features of PandaDoc is its intuitive interface. The dashboard is clean, organized, and easy to understand. Creating, sending, and tracking documents has never been easier. The drag-and-drop functionality is a lifesaver, allowing you to customize your documents with ease.PandaDoc's template library is another feature that deserves applause. It offers a wide range of pre-designed templates for various business needs, from proposals and quotes to contracts and invoices. This feature significantly reduces the time spent on creating documents from scratch.The e-signature feature is another highlight. It simplifies the process of getting documents signed, making it possible to close deals faster. The fact that it's legally binding and secure adds an extra layer of confidence.PandaDoc's integration capabilities are also impressive. It seamlessly integrates with many CRM systems, including Salesforce and HubSpot, which streamlines the workflow and enhances productivity.The analytics feature is a boon for those who want to track their document's performance. It provides real-time insights into who has opened the document, how much time they spent on it, and whether they have signed it or not. This feature is incredibly useful for following up and closing deals.The customer support provided by PandaDoc is top-notch. They are responsive, helpful, and go the extra mile to ensure that any issues are resolved promptly.In conclusion, PandaDoc is a comprehensive, easy-to-use, and efficient tool for managing and automating documents. It's packed with features that cater to every business need. Whether you're a small business owner or part of a large corporation, PandaDoc can significantly enhance your productivity and streamline your workflow. I highly recommend it to anyone looking for a reliable and efficient document management solution."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Bella",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T21:57:13.000Z",
          "Titre": "Best of class eSignatue solution",
          "Contenu": "In searching for an eSignature solution, we evaluated three different companies. PandaDoc was one of them and won our vote based on ease of use, clear and very efficient vision of process and flow, as well as almost best of class app design and pricing. I would add that their customer support was brilliant and solved all our issues rapidly, responses to questions were within hours or even minutes sometimes, we were impressed and won over with excellent excellent support. We signed up without reservations and have been very happy ever since!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Quik",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T17:39:00.000Z",
          "Titre": "Love PandaDoc",
          "Contenu": "Being able to e-sign has been a game changer for us. Easy to use and our customers love how easy the process has been."
        },
        {
          "Note": 5,
          "Lieu": "HN",
          "Pseudo": "Alejandra",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T00:35:52.000Z",
          "Titre": "Effortless Document Creation and Tracking",
          "Contenu": "It is a very helpful tool for document creation and tracking. It is practical and easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Grace Schroeder",
          "Nb_Reviews": 3,
          "Date": "2023-08-21T19:38:21.000Z",
          "Titre": "Using Slingr, our low-code platform, we create end-to-end autoamted PandaDoc workflows!",
          "Contenu": "We use PandaDoc for all of our eDocument needs. Their great API enables us to create end-to-end automation using Slingr.io, our low-code platform.Finally, including PandaDoc's functionality in seamless, automated workflows is easy and affordable! Great product and great API!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dee Cheatham",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T08:30:58.000Z",
          "Titre": "Nick James",
          "Contenu": "On 19 July, 2023 I was distracted, distressed and running out of hope after being on the phone and online for hours. I found Nick Jones.Through his professionalism and knowledge and attention to my unique situation, he found round trip tickets for me in the unusual time frame I had to work with.Nick’s compassion and awesome attitude made all the difference to me. If you continue to hire employees like Nick, I will consider your company always for all my future travel arrangements.My experience with Nick James not only met all my unique travel requirements, but my financial ones as well.I couldn’t thank him enough for his compassion and service.Sincerely,Deadra Walker-Cheatham"
        },
        {
          "Note": 5,
          "Lieu": "LR",
          "Pseudo": "Tamba",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T10:06:17.000Z",
          "Titre": "The process is very speedy and quick to…",
          "Contenu": "The process is very speedy and quick to work with"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Deanna",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T15:48:44.000Z",
          "Titre": "Pandadoc has always been my favourite",
          "Contenu": "Pandadoc has always been my favourite! When I saw the change in their layout it made me pause until I started in again. Now it’s even easier.  Happy adminning!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LOCV",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T17:36:10.000Z",
          "Titre": "LOVE the texting feature!",
          "Contenu": "I think Panda Doc is very easy to use and I LOVE the text link feature!  The only thing I would say is that they should standardize the signature a bit more.  Make it look a bit more professional. The placement boxes are way too large and I find that we are getting denials from some HIPPAA providers stating the signature is not accepted but specifically stating other brands are."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "E Joseph Gonzalez",
          "Nb_Reviews": 2,
          "Date": "2023-03-19T01:31:00.000Z",
          "Titre": "BEFORE I EVEN TRY YOU, PLEASE DEAL WITH WHAT I'VE READ",
          "Contenu": "Per posted complaints:1. Do your/my/our docs still get easily lost due to signers still working on docs when it is announced as complete?2. Do customers experience ‘oops unexpected snag’ prompts while working?3. Are CSV / XLS formats available as benefits when you allow yourself to be upsold into more expensive tiers only or can I enjoy the same while staying at tier one?4. ‘Looping-in’ and ‘creating tickets’ lingo: Should I expect as frustrating a run-around as one customer described I should?5. Does your system  ‘go down’ a lot still?6. Per the complaints of previously quoted customer, do you now offer ‘title of signer’ options?7. Per the same customer, are your product/service/website more user-friendly since their posted complaint?Please post your reply here and thank you.8. Well?"
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "FF",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T20:00:38.000Z",
          "Titre": "I started using in 2020",
          "Contenu": "I started using in 2020. Database was well developed with the User in the mind. It is relatively easy to use and allows us to maneuver and make changes as needed which suits our company needs. The email and certificate security features are also quite good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T19:41:33.000Z",
          "Titre": "Streamlined Signatures",
          "Contenu": "Since I started working as a Gifted Support Teacher, in multiple buildings, I've had to track people down in order to get important paperwork signed and completed. There are dates aligned with this paperwork, so a timely signing process is vital. PandaDoc has streamlined this process and made it so simple to gather signatures and complete the GIEP process. I can't imagine doing things the old-fashioned \"pen-and-paper\" way ever again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kraig",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T15:04:32.000Z",
          "Titre": "PandaDoc-Convenient, Secure and Easy to Use",
          "Contenu": "We have been using PandaDoc for about 2 years.  We appreciate the ease of use and the time savings by using templates of our client agreements while allowing us to customize them as needed.  Additionally, we are able to add documents on the fly when needed.  We found their customer service to be help and responsive when setting up our documents and learning how to use the software initially."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aurora",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T01:32:05.000Z",
          "Titre": "Its a great interaction with students…",
          "Contenu": "Its a great interaction with students on a daily basis. It is very easy to understand and to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robin",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T15:11:30.000Z",
          "Titre": "PandaDoc has helped so much with…",
          "Contenu": "PandaDoc has helped so much with getting back signed documents that i have been chasing for 3 years. Families I send docs to have a much easier time signing and returning them than with any other method I have tried. I love that reminders are sent, too!"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Graham Russon",
          "Nb_Reviews": 2,
          "Date": "2023-02-16T10:45:22.000Z",
          "Titre": "Quick, Efficient and professional",
          "Contenu": "Agent was courteous, fast and knowledgeable. Got straight to the problem and resolved. The follow up was incredible, very impressed with the the service.  It's doesn't matter that things go wrong, it matters how quickly they get attended to. Well Done Panda Doc"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Geoff",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T21:44:36.000Z",
          "Titre": "A well-rounded tool",
          "Contenu": "This is a well-rounded tool that helps me put my best foot forward with my clients. I love it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T21:07:07.000Z",
          "Titre": "The tool is intuitive and easy",
          "Contenu": "The tool is intuitive and easy. There are always a few hitches or usability things that can be improved but nothing that has held our implementation back.  Rachael Buckingham has been amazing working through and educating us."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robyn",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T23:36:25.000Z",
          "Titre": "Easy to use.",
          "Contenu": "Easy to use.It is so easy to set up, upload documents and track their progress. I love that it stores contacts so it is easy to populate their information again."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kelly",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T15:37:36.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use.  I like that you can send clients reminders to complete the form."
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Petra",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T22:08:38.000Z",
          "Titre": "PandaDoc is a great app for sharing your docs",
          "Contenu": "I like PandaDoc as you can share your documents even with your business partners abroad with just a single click and you can sign your contacts using an el. signature. PandaDoc is a great collaboration tool!"
        },
        {
          "Note": 5,
          "Lieu": "LU",
          "Pseudo": "Abel Lovasz",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T22:38:33.000Z",
          "Titre": "Amazing service",
          "Contenu": "I didn't manage a document edit on the design side. Two minutes later I was on live chat with a costumer rep. Another two minutes later I was sent a screen captured video explanation that solved my issue instantly. I was impressed..."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Arzadon Fitness",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T20:47:26.000Z",
          "Titre": "Amazing software!!",
          "Contenu": "Amazing software which integrates seamlessly with Hubspot. We made the switch from Adobe and this has proved to be miles and bounds better!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Air Voel",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T21:05:13.000Z",
          "Titre": "Pleasant experience and easy to use",
          "Contenu": "Pleasant experience and easy to use. The form feature is a step up above the competition since you receive more for less and only completed forms count towards your limit."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 7,
          "Date": "2023-03-02T13:56:27.000Z",
          "Titre": "Simple, effective way to deal with paperwork!",
          "Contenu": "I run a small business and have found PandaDoc to be an essential part of the day-to-day running. A quick, easy and very effective way for me to send and receive client paperwork, contracts and estimates. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd Walter",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T00:39:48.000Z",
          "Titre": "Awesome Customer Service",
          "Contenu": "Great customer service! Veronika Yaroshevskaya did a fantastic job assisting me in walking me through a couple of things I needed help with. I would highly recommend PandaDocs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Jaskiewicz",
          "Nb_Reviews": 2,
          "Date": "2023-01-12T01:58:29.000Z",
          "Titre": "Had an issue sending my first document…",
          "Contenu": "Had an issue sending my first document to sign.  Reached out through the chat option and the live staff person was patient, listened and was able to resolve the issue quickly and professionally."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Marian Rusu",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T15:12:01.000Z",
          "Titre": "Overall experience",
          "Contenu": "Overall experience - excellentWorking with PandaDoc is making our contracting process way easier and saves us a lot of work.And if we have any issues, the support from them is very fast and understanding. I recommend PandaDoc to everyone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ELLE",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T17:35:11.000Z",
          "Titre": "Very intuitive and easy to use!",
          "Contenu": "Very intuitive and easy to use. This program has saved me so much time. I love being able to see a snapshot of the status of my agreements. Easy integration with my CRM and project management software."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "permplate.com",
          "Nb_Reviews": 2,
          "Date": "2023-01-26T22:53:06.000Z",
          "Titre": "The product is amazing for my needs!",
          "Contenu": "The product is amazing for my simple needs. I have been using the electronic signature feature for about a year now and have never had an issue. I am very grateful for PandaDoc and their offering of this feature."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eli Pinhas",
          "Nb_Reviews": 2,
          "Date": "2023-03-07T23:24:04.000Z",
          "Titre": "Trying for the first time.....",
          "Contenu": "I am truly impressed with the features of their service.  And it's free!  Of course, with a paid subscription you get other features, so, whatever works best for you.  Customer service is excellent.  Had an issue and they stayed on it until it was resolved.  Very happy with the service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ana Lukower",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T23:28:26.000Z",
          "Titre": "Pandadoc is the most amazing platform…",
          "Contenu": "Pandadoc is the most amazing platform for me to work with the moms of the childrenIt's easy to use and for the moms that I help is just a click and send they are able to do it even when they do not speak English"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Western CPA Professional Corpo",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T22:02:35.000Z",
          "Titre": "PandaDoc is a high tech affordable…",
          "Contenu": "PandaDoc is a high tech affordable esignature solution that fits best with small business needs. Very user friendly with all the required features ."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kyei Baffour",
          "Nb_Reviews": 2,
          "Date": "2023-03-27T00:50:00.000Z",
          "Titre": "Great Support",
          "Contenu": "Great Support I contacted them and it was Sunday so I thought no one was going to reply to me and I needed access to my account urgently but someone got back to me and solved my problem less than 30 minutes. They have great support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deme",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T06:40:18.000Z",
          "Titre": "Unlimited signatures in their free…",
          "Contenu": "Unlimited signatures in their free version got me to join. Templates got me to upgrade when my needs as a small business increased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T02:53:50.000Z",
          "Titre": "Filling a Business Need",
          "Contenu": "My CRM does not create electronic agreement letters for my business and Panda.com has filled that need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracey",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T21:36:55.000Z",
          "Titre": "Pandadoc is easy to use.",
          "Contenu": "Pandadoc is very easy to use.  We have many customers that are not tech savvy and have no problems e-signing our documents."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "iBooks",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T23:32:34.000Z",
          "Titre": "Great with templates and payment collection",
          "Contenu": "Templates are easy create. Smooth process from creating the documents to signing by self and customer including collection of payment. Love every bit of it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Vance",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T12:06:33.000Z",
          "Titre": "The issue ended up being a fault on our…",
          "Contenu": "The issue ended up being a fault on our end, but Albina took the time to research the issue and provide valuable feedback that led to our solution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T00:39:47.000Z",
          "Titre": "So easy to use and complete quickly.",
          "Contenu": "So easy to use and complete quickly.If you are looking for something to make contracts with this is it. I use it and have accepted contracts from it as well. Never any issues."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Amit",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T19:24:34.000Z",
          "Titre": "Pandadoc is one of the easiest and best…",
          "Contenu": "Pandadoc is one of the easiest and best made signature service to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T16:04:33.000Z",
          "Titre": "Very useful",
          "Contenu": "Very useful, flexible, and intuitive tool, and quite reasonably priced."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T00:46:05.000Z",
          "Titre": "Game changing for proposals",
          "Contenu": "Love Panda Docs. Easy to use. Looks great. Integrates with CRM easily without need for high level of technical knowledge. Do not know how we did without it!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Alicia",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T08:59:47.000Z",
          "Titre": "Very useful and quick",
          "Contenu": "It is very easy to use, very quick and practical and takes almost no time to learn how to navigate it."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "IPM Group",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T05:05:58.000Z",
          "Titre": "Efficient Document Signatures Made Easy with PandaDoc",
          "Contenu": "PandaDoc has simplified and revolutionized our document signing process. It has completely changed the way we obtain signatures from internal stakeholders, clients, and vendors. The platform is user-friendly and intuitive, allowing us to create, send, and track documents for signatures with ease. It has saved us valuable time and resources by eliminating the need for printing, scanning, and mailing documents. With PandaDoc, we can now handle document signatures digitally, making the entire process efficient, convenient, and hassle-free. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T20:05:59.000Z",
          "Titre": "LOVE being able to convert docs and…",
          "Contenu": "LOVE being able to convert docs and make them accessible for my clients to sign. Thanks!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amos",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T18:41:20.000Z",
          "Titre": "Love the service",
          "Contenu": "Love the service!  Easy and quick to use!  Have tried a couple other signature apps and prefer PandaDoc to the others by far!"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Natalie",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T07:59:33.000Z",
          "Titre": "Very intuitive product",
          "Contenu": "Very intuitive product. Help function extremely effective. Service on all levels was, and remains, fantastic!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Natasha Cole",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T19:57:19.000Z",
          "Titre": "Excellent platform",
          "Contenu": "It's a really simple but effective platform. From a Sales perspective, the UX is great and the client finds it easy too."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Rohit",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T08:56:30.000Z",
          "Titre": "Great product for SMBs to do manage Contracts online",
          "Contenu": "I have earlier used Enterprise products in CLM space with integrated Digital/eSignatures but PandaDoc makes it easier to adopt where everything is at one place through seamless integrations. It has great features embedded like Contract Templates to be used in Sales, Recruitment, Procurement and Tax compliances and we can also create a low code app which helps in building information channels through our different partners."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Deb",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T09:27:28.000Z",
          "Titre": "Very useful tool",
          "Contenu": "Very useful tool. It helps to speed up cases when I can send a document for signing to a customer and get it back the same day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lawrence",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T18:30:31.000Z",
          "Titre": "I really like this program",
          "Contenu": "I really like this program. The only thing that needs work is the customer service aspect. It takes too long to get back when you have a question that the AI can not help with."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "K.S.",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T19:50:03.000Z",
          "Titre": "Ease of use",
          "Contenu": "Ease of use and the fact that PandaDoc continually works to improve the website.Ability to create templates."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Seema",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T19:05:17.000Z",
          "Titre": "Program is easy to use and user…",
          "Contenu": "Program is easy to use and user friendly.  Could make the delete document button more visible."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Jason Denham",
          "Nb_Reviews": 4,
          "Date": "2023-09-01T17:56:37.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, for on the go, and been kept updated with clients documents"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-02-07T20:54:43.000Z",
          "Titre": "Exceptional service",
          "Contenu": "I asked for a custom export from our their team. They helped me within like 15 minutes, exactly what I asked for. Super impressed!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T22:49:34.000Z",
          "Titre": "Ease of Use",
          "Contenu": "It is so easy to log in, upload a document, get the signatures I need and then download and attach it else."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T18:14:21.000Z",
          "Titre": "Great customer service responsiveness!",
          "Contenu": "Any question or concern I have receives a very timely and complete response!  Sometimes that response is immediate which I really appreciate!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pablo Marvel",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T20:38:09.000Z",
          "Titre": "Their support chat was very prompt and…",
          "Contenu": "Their support chat was very prompt and efficient in helping me identify and solve my question."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ozzy Garner",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T14:25:44.000Z",
          "Titre": "Automation=Scalability",
          "Contenu": "I appreciate the ability to create a template out of our documents. Helps scale things much quicker."
        },
        {
          "Note": 5,
          "Lieu": "CL",
          "Pseudo": "Patiotic Records",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T20:54:30.000Z",
          "Titre": "Great platform and easy to use",
          "Contenu": "The easiest way to have all legal documents in order in one place. Great platform and so easy to use."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Liburn",
          "Nb_Reviews": 2,
          "Date": "2023-10-20T21:44:14.000Z",
          "Titre": "A great tool for proposals and sales…",
          "Contenu": "A great tool for proposals and sales management"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Leif",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T20:39:12.000Z",
          "Titre": "Speed and functionality work well",
          "Contenu": "Speed and functionality work well. The user interface is really quite good too!Good job team PandaDoc!"
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "Tuan Thieu",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T04:36:51.000Z",
          "Titre": "Quick response and supportive follow up",
          "Contenu": "Pandadoc team response quickly and follow up the issue in a very supportive way!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T21:25:39.000Z",
          "Titre": "PandaDoc is amazing!",
          "Contenu": "PandaDoc has made our process seamless and efficient. I highly recommend using it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Colleen",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T03:45:45.000Z",
          "Titre": "pandadoc is easy to use",
          "Contenu": "pandadoc is easy to use, affordable and does everything I need, including being HIPAA compliant."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Pratik Balochiya",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T12:12:46.000Z",
          "Titre": "PandaDoc Rest API",
          "Contenu": "In one of my project, I am using panda doc rest API for document eSign, I stucked in one of API then after I have contacted \"Alisiia Mokhunova\", She guided me and I have completed my stuff on time, Thanks Alisiia for this great help, Well knowledged technical team, Appreciate, Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andi",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T00:19:21.000Z",
          "Titre": "I love Pandadoc",
          "Contenu": "I love Pandadoc! It is easy for me to send out the docs I need signed. The product does everything I need. It is easy for those that I need to collect signatures from."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Human",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T01:48:42.000Z",
          "Titre": "ease of application",
          "Contenu": "allows me to send docs that requires a signature with an secured option"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T21:15:00.000Z",
          "Titre": "Quick and easy to use",
          "Contenu": "The solution is easy and quick to get started and completed. Helps get me through my work day efficiently"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jolie",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T15:43:50.000Z",
          "Titre": "PandaDoc is easy to use",
          "Contenu": "PandaDoc is easy to use, and the tools are very intuitive and user friendly.  Highly Recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T22:56:28.000Z",
          "Titre": "You have a great tool",
          "Contenu": "You have a great tool. But when things go wrong as they occasionally do, you also have great support. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T18:15:46.000Z",
          "Titre": "Better and easier to use than DocuSign.",
          "Contenu": "Better and easier to use than DocuSign.Cheaper too by a country mile."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Fred P. Salanga",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T15:03:09.000Z",
          "Titre": "Accurate response.",
          "Contenu": "Aside from the speedy response. The concern was addressed accurately. Great job!!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-10-16T08:08:15.000Z",
          "Titre": "It helps me streamline my commercial…",
          "Contenu": "It helps me streamline my commercial processes"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "panna",
          "Nb_Reviews": 2,
          "Date": "2023-09-20T23:06:16.000Z",
          "Titre": "Easy and convenient to use",
          "Contenu": "Easy and convenient to use. Very useful for our company.Free to use."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Eduardo",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T20:28:30.000Z",
          "Titre": "Easy to use in any thing",
          "Contenu": "Easy to use in any thing, from uploading to signing."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Alex Ringelmann",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T00:16:24.000Z",
          "Titre": "Excellent customer support",
          "Contenu": "Excellent customer support. I had an issue where my dashboard was not loading properly. PandaDoc's support team was extremely competent and managed to fix the issue. Excellent communication."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stacy",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T18:54:12.000Z",
          "Titre": "Great product",
          "Contenu": "Great product!  Makes getting documents signed more convenient for customers"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Graham Russon",
          "Nb_Reviews": 2,
          "Date": "2023-02-08T10:07:11.000Z",
          "Titre": "Good product knowledge",
          "Contenu": "Good product knowledge, helpful, stayed with problem until solved"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Andrei",
          "Nb_Reviews": 4,
          "Date": "2023-09-25T21:23:26.000Z",
          "Titre": "Perfect for small businesses",
          "Contenu": "PandaDoc is the perfect document signing platform for my start-up business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T14:32:24.000Z",
          "Titre": "Their support is really great!",
          "Contenu": "Their support is really great.  They take their time and answer questions with solutions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 2,
          "Date": "2023-01-19T23:38:09.000Z",
          "Titre": "Solid program",
          "Contenu": "Solid program. No glitches. Basic works as well as Docusign or Dotloop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robin",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T14:51:55.000Z",
          "Titre": "Ease of Use",
          "Contenu": "My organization loves Pandadoc!  This has been a great addition to our record keeping and keeping our documents organized and secure."
        },
        {
          "Note": 5,
          "Lieu": "GE",
          "Pseudo": "Merab Tsverikmazashvili",
          "Nb_Reviews": 4,
          "Date": "2023-03-31T19:31:53.000Z",
          "Titre": "Thank you for your prompt response to…",
          "Contenu": "Thank you for your prompt response to cancel your subscription!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Geneva",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T23:06:04.000Z",
          "Titre": "The system is user-friendly and is very…",
          "Contenu": "The system is user-friendly and is very convenient"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lori",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T18:25:55.000Z",
          "Titre": "Easy to set up a document",
          "Contenu": "Easy to set up a document, and easy for customers to use and sign. I also like the price. It feels big good when I have a panda doc 😊"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Husam",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T19:17:59.000Z",
          "Titre": "The Best in The Business",
          "Contenu": "The best website for document signings I have ever used."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sam Mills",
          "Nb_Reviews": 2,
          "Date": "2023-04-17T18:23:02.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, edit and send documents to be signed by other parties"
        },
        {
          "Note": 5,
          "Lieu": "BB",
          "Pseudo": "Nichola",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T16:46:32.000Z",
          "Titre": "Great for Contracts",
          "Contenu": "Panda Docs has assisted our company with the distribution of  contracts for various clients and creates a measure of transparency."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Royale",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T23:25:04.000Z",
          "Titre": "the service is excellent and helping a…",
          "Contenu": "the service is excellent and helping a lot to grow our business."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Krissy",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T13:33:11.000Z",
          "Titre": "User friendly",
          "Contenu": "User friendlyEasy to edit"
        }
      ]
    }
  ]
}