{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "patriotmobile.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Todd Erlinger",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:11:13.000Z",
          "Titre": "Several issues with Patriot Mobile",
          "Contenu": "1) Your Website is not very \"User Friendly\".2) You don't have Alaska coverage (even though you'all claim coverage the same as the Leading Cellular companies), so I have to  get/buy another Cellular Plan when I work in Alaska from April till August.3) Your costs to me (My Cellular Plan), is pretty close to the Leading Cellular companies.  Even though I hate their Political  Correctness/Policies/Donations,....you all spend my money (my Payments/Bill) on Conseravtive Political Donations/Causes.  I would rather that you just cost me less, and not spend our money on ANY Political causes, etc, etc!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 5,
          "Date": "2023-12-20T17:17:58.000Z",
          "Titre": "They refuse to put my phone under my real name",
          "Contenu": "I am now on my second marriage. Yet when they assigned my phone, they put me not under my name I share with my now husband, not even my given name at birth.  They instead insist on giving my phone the name from my first husband. I not only divorced him, I also divorced his name. PLEASE put my contract under my real name now please."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles Borner",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:47:10.000Z",
          "Titre": "Your customer service SUCKS!",
          "Contenu": "Trying to get a live person on the phone?Good luck.Trying to discuss a billing discrepancy.But you people won't call us back.But you'll send endless e-mails with repetitive requests for \"more authentication\" instead of JUST GETTING ON THE PHONE\".  Even AFTER we supplied the data you demanded."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lori",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:00:28.000Z",
          "Titre": "Customer service is extremely hard to get a hold of",
          "Contenu": "Our experience has been everything frustrating. Waiting on hold for customer service for a couple of hours try to do a call back it goes immediately to voicemail if you email him it takes days to get an answer. Setting up our second phone took literally two weeks to get done and accomplished. I chose to go with this company because of things they support but they do not have enough customer service to take care of the people. As far as their phone service goes I'm not saving any money by going to this. Data and hotspot I'll use exactly the same amount it's not two separate amounts and they have no plans of fixing that. I would like to change my plan to a less expensive plan but have not figured a way to do that on the website and I'm tired of trying to get a hold of customer service. We have a new phone to hook up under one of the phone numbers I keep being told that I can put in a SIM card that was sent but it doesn't work it does not have the phone number connected to it like I'm told and I give up on trying to contact customer service anymore. So as soon as I figure out what other phone company to try just kind of stuck here. Very sad"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Baran",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:22:41.000Z",
          "Titre": "The service in my area is poor to fair but…",
          "Contenu": "The service in my area is fair but terrible when traveling. T-Mobile coverage is poor  I plan to switch away from Patriot soon."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris & Elaine Chason",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T01:47:54.000Z",
          "Titre": "TOTAL BANDITS! Do NOT do any biz!",
          "Contenu": "Phone DIED two days after I turned it on! Ten days after I reported this I FINALLY heard from someone at PM, they told me to take the phone to a \"Local Repair\" shop! I live in the wilderness! Nearest town is 25 miles away and has NO REPAIR facilities - AT ALL! Next town is 80 miles away and the next one is 130 miles! I sent the busted phone back at MY EXPENSE and STILL have not gotten any sort of refund! I will NEVER do any biz with this company again and WILL tell everyone I know about them! They are being reported to the AGs Consumer Protection Div. And to the BBB! ROTTEN TOO THE CORE! And all they had to do - at the start - too keep my biz, was to send a Replacement Phone! All I got was ROBBED!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:02:14.000Z",
          "Titre": "I recently purchased a NEW phone from…",
          "Contenu": "I recently purchased a NEW phone from Patriot Mobile.The phone was/is defective.The Bluetooth is intermittent, I can't text from contacts, the volume varies,  etc.I contacted Patriot within a few days, and was told \"Not our problem.  Contact Samsung \"I contacted Samsung and was told that the problems were the fault of others, not Samsung. In other words, \"Not our problem.\"The questions now become, why would I ever purchase an other phone from Patriot Mobile, and why would I purchase a Samsung.The answer to both questions is, I will not.I prefer to do business with companies that stand behind their products.Patriot Mobile, and Samsung, do not."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe De Angelo",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:25:48.000Z",
          "Titre": "Why must I give my review a title ? Too much unnecessary impositions .",
          "Contenu": "Hi. My name is Joe De Angelo. There was more done by Patriot Mobile (or not done but should have been done ) incorrectly and inefficiently and irresponsibly then was done to the contrary. Bye, merry Christmas, Joe"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "lopez",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T17:09:19.000Z",
          "Titre": "deceived customer",
          "Contenu": "Not sure what you're talking about. I get terrible service every month, I pay for a full month, and for the last two weeks or each month I've been dealing with service so slow it won't load a page. And I keep paying for this.  I'm looking for a new service. Not a happy customer. I did not call you for any reason so someone explain to me what's going on, is there fraud going on here."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rick Davis",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:59:29.000Z",
          "Titre": "It doesn’t matter what we  say you…",
          "Contenu": "It doesn’t matter what we  say you still treat us like punks.  Not patriots, I’m so tired of my service fading every month and then get on the phone and stress out  cause it’s all my fault. So when I have a half a day. I’m changing to a new carrier.  It’s to stressful being with patriot mobile.  Waiting on hold for endless time.   Yeah I’m switching.  Take care"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T19:07:15.000Z",
          "Titre": "I need to get a new flip phone",
          "Contenu": "I need to get a new flip phone. Mine is broken. I couldn’t understand the foreigner that I got first. The second guy spent the whole time trying to sell me a Smart phone. I’m thinking of finding a different company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cindy",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:00:29.000Z",
          "Titre": "Worst product but the best cause",
          "Contenu": "Too expensive, coverage not great, cellular data doesn’t work, voice mail doesn’t work. The cause makes it worth the pain."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dale Swanson",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T15:46:36.000Z",
          "Titre": "No customer service on Sundays !!!",
          "Contenu": "No customer service on Sundays !!! Issue with my data which I asked about before I transferred my service to Patriot Mobile! Everything I asked about upstream before I transferred my service did not go as it should have! Patriot Mobile is just full of excuses! What is worse is that their own customer service agents are aware of the problems and the IT geniuses/executives above them are the ones making the mistakes and not addressing them! Total BS !!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nancy Simmons",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T18:26:25.000Z",
          "Titre": "I am not happy with the way you turn my…",
          "Contenu": "I am not happy with the way you turn my phone on without my permission, & charge me a month fee! I am expecting your company to reimburse it back to my account. I never gave my authorization to turn my phone on. I paid for your service & received the Sims card, but never did I have it insert it into my phone. It’s right here still in it packages the way I received it. Call the company y’all said that I authorized y’all to turn it on. That did not happen! I left AT&T for the exact reason! Authorizing without my permission! I have been trying to get AT&T to give my number to me to use it when I was going to authorize you to turn on my phone. But y’all turn on a Account that has a new number to it. So that’s why I say that I DID NOT Authorize it! Now y’all are saying when I do authorize you to turn it on I will have to pay for a new Sims card $10.99 + taxes + shipping. That will never happen! Your company is as bad as AT&T !! It’s not about the money it’s about the principal !!!! I am so glad that I seen how you run your business before I got in to deep! I hope I am the only one that this has happened to, but sadly I know that is impossible! Good luck screwing your customers, because it will come back to bite you in the ass! You should charge your name to your company it gives Patriots a bad name!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carla Garman",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T17:36:03.000Z",
          "Titre": "Promised a refund I never got and been ignoredo",
          "Contenu": "Your company continuously deducted monthly payments for several (about 5 or 6) months even though I never got a Sim card nor ever used your services. I moved from Lansing, MI to Defiance, OH. I've been dealing with your company for several months AFTER I was to I would get a $400 and some refund. So far I've received only $137 of this refund. Should I change my cell provider? I don't like the way your company has treated me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rich Young",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T17:50:47.000Z",
          "Titre": "You don't want my business",
          "Contenu": "What went wrong this time? What is that? I have only this one problem. I was canceled and denied access to my Verizon account, on 2-12. I called Patriot mobile, for some reason they couldn't process my debit card with there payment system. So someone was supposed to call me to make the transaction verbally. I will be nice and just say that never happened."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terry Elmore",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T14:22:31.000Z",
          "Titre": "Since day one I have had no mobile hotspot",
          "Contenu": "Since day one I have had no access to mobile hotspot on my phone. Several communications with support over the past months but no solution. Time to find another company. I don’t like being charged for a service that you don’t provide."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "E. B.",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T23:52:28.000Z",
          "Titre": "I want to be able to pay up my bills in…",
          "Contenu": "I want to be able to pay up my bills in advance, but your system won't let us, I must pay by the month. This is a deal breaker."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Doni Juarez",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T14:25:53.000Z",
          "Titre": "They get you one the data, you will pay the highest if you use data",
          "Contenu": "When I went over the limit on data, the internet slowed down to the point where it could not be used at all.I went up to a higher level, where I felt I would not go over the limit. I always made sure the person helping me knew that I was using hotspot, yet, after bumping up my service, I was no longer able to use hotspot. Hotspot is covered on every plan except that one. I had to go to a higher plan. I am now paying for more service than I need and I can not afford it.With my previous provider, even when it slowed down, it never slowed down to the point where I could not even access the internet on my phone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "EUNICE BAKER",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T14:43:42.000Z",
          "Titre": "not your fault that my phone got turned…",
          "Contenu": "not your fault that my phone got turned off for a few days.  i was out of town and did not see my warning for a while.  that is the only incident that i have incurred."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donald Hess",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T17:04:19.000Z",
          "Titre": "They keep raising the price",
          "Contenu": "They keep raising the price.  TOO EXPENSIVE!  NOT IMPRESSED!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeff Batchelor",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T23:51:56.000Z",
          "Titre": "Customer Service is horrible!",
          "Contenu": "Customer Service is horrible!!   I’ve been on hold for 45 mins so far!!   “All of our representatives are busy”.    Every min!!  Last time I thought it was related to a storm!!   My time is valuable too!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ronald Fox",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T18:57:12.000Z",
          "Titre": "You only get what you pay for.",
          "Contenu": "Everyone needs to realize that ALL of these low cost cell phone carriers piggyback off the big major carriers, in other words, they sell a very small portion of their bandwidth to the low price carriers who then sell it to you at a lower price.  Think of it this way. The big carriers can offer you 90 percent of the bandwidth pie.  The other 10 percent sliver is divided up between all the low price carriers.  Its no wonder why after a few days or a week your service is throttled because you have used up all the bandwidth they have to offer.  Did anyone notice that all of the replies to the negative service reviews read exactly the same.  Its because there is nothing Patriot Mobile can do to solve the problem.  They only have a tiny part of the bandwidth pie to offer you and when it is gone, it is gone.  If all you need to do is send a few texts now and then or make a few phone calls to loved ones every month, it will probably work for you.  But if you do any heavy surfing of the web, your data will be used up very quickly because they only have a tiny portion to offer you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Howard Vlieger",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:33:26.000Z",
          "Titre": "NO one from the company knows how to…",
          "Contenu": "NO one from the company knows how to communicate with customers"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Duane Thomsen",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T23:52:14.000Z",
          "Titre": "I am done",
          "Contenu": "I am done. Phone broke. I just wanted to buy a new phone. Customer service would not help me. Went to pure talk!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Louis P.",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T23:30:37.000Z",
          "Titre": "No Customer Support",
          "Contenu": "The website will not allow me to log on. When I try to reset the password, the website does not recognize my e-mail address. Funny, it doesn't seem to have \"forgotten\" my credit card number... Anyway, sat on hold for over 30 minutes waiting for customer service, only to be told that she couldn't hear me and hung up. Test calls to other numbers confirm that the problem was not on my end. So now I don't know what to do. I can't log on to the website, I can't call, and there are no brick-and-mortar stores to visit. If I ever get a hold of anyone, my first question will be to confirm that my phones are unlocked."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Lee",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T04:52:21.000Z",
          "Titre": "canceling because non-responsive company",
          "Contenu": "Patriot Mobile changed their website and we no longer can log in to pay our bill.  It says to submit an email address and a way will be sent to reregister, but we never receive an email from them.  We called Patriot Mobile and were on hold for maybe an hour then they hung up, we have filled out their online form and emailed their address, and have received no reply.  Their terrible customer service let us to order a new sim card from another company and we are canceling Patriot Mobile."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Janet Lennox",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T20:00:52.000Z",
          "Titre": "Great concept, bad provider",
          "Contenu": "I love the concept of Patriot Mobile, but  unfortunately Patriot Mobile is a poor provider. I signed up on Aug. 31, 23.  Two different SIMS to 2 different towers\\providers failed because of mistakes made at Patriot Mobile.  Limited tech support hours.  Poor coverage.  While on another call to tech support, the call dropped.  Did anyone call me back, ever. Nope!  Tried the contact form to reach tech support.  Three days later, I received a response telling me to call tech support. Supposedly they have a 100% coverage guarantee, but the answer I got was to restart my phone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David and Allison Miller",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T23:56:05.000Z",
          "Titre": "Try another provider",
          "Contenu": "I was aaked for more details. I called mid-November and was on hold for over an hour until I ran out of service and was disconnected. In the meantime, I went out of the country. On November 23th they ran my card. Not sure for what. The phone hadn't worked for a month I believe. On November 26th they sent an email saying that a charge was denied on an old card number. Once back in the country. I called again on my no service phone and I was given their Hot Line status connection I waited probably over an hour and I hung up. On the 4th. I was resolved to deal with this PROBLEM I called their number again and was on for 1 1/2 hrs and finally just hung up. On December 6, I emailed them to close my account: 13 emails later, I still had not resolved anything and as best I can tell did not get my account closed. The last email, I asked what was owed on the account. They quit responding.  I thought they went home for the day. But they never have responded! All they said was my card was declined and yet I use this card everyday. What's amazing is it has NEVER crossed anyone's mind to call me on the disconnected phone?Go elsewhere! I have now called several days this week and before. I have now a total of 4+ hours waiting on hold for a Customer Service Representative to straighten out my account. Today, I was on hold for 1 1/2 hours and no rep! They continue to take money on my card and send notes about how my account is past due. No service, but plenty of Customer No Service. The number of spam calls and collection calls I get is now in the thousands. Not sure why they would give me a number that so recently used. I am a Christian man, giving a Chritian company a try. After 4 months I decided to keep Verizon. Don't waste your time or money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "vernon jeremica",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:47:39.000Z",
          "Titre": "On hold forever",
          "Contenu": "Too long of a wait to talk to an operator. I had to hang up"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Simply Frustrated",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T04:22:01.000Z",
          "Titre": "You’re so good at apologizing for the…",
          "Contenu": "You’re so good at apologizing for the inconvenience but not improving your service. Don’t bother with the “sorry for the inconvenience spiel.” My husband was told he should have called prior to looking at your coverage map as the map is old. No service now… this won’t send until I get into the network coverage somewhere.  Never trust a Christian company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Bown",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T21:25:09.000Z",
          "Titre": "The sim card they sent doesn't work. Many Problems.",
          "Contenu": "The sim card they sent dosen't work and I can't make a call to them, and they won't answer my Emails. Stuck now without a phone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christina Murphy",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T23:05:12.000Z",
          "Titre": "Do not recommend",
          "Contenu": "Do not recommend. The switch from T-mobile to Patriot mobile was horrendous. The rep at Patriot mobile failed to advise the steps of activating and switching, leaving me completely without a phone in use. Couldn’t find a pay phone anywhere to contact them. Finally was able to get service turned on and make the switch to only have LTE service not 4g or 5g s as promised meaning the service was glitchy, slow and dropped a lot of calls. After watching a few movies, couldn’t load anything on my phone or look into anything as there was no longer internet available. Patriot mobile claims the data was used up already when I was advised it was unlimited in the sales call to switch. This has been a mess and I recommend you save yourself the massive stress of switching and don’t do it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Albert Alessi",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T16:37:36.000Z",
          "Titre": "Previously excellent ...5star !",
          "Contenu": "Previously excellent ...5star !BUT, this past Saturday was huge step down towards my old cell service carrier and makes me concerned about my decision to switch to Patriot.  Long story , but it involves setting up my 86 year old mother with Patriot waited on hold for 90+ minutes and still did not make the transfer.  Unacceptable barriers to access a rep !And now, 2 days later finally got a rep to request a refund on the iphone and it was declined by her supervisor John Sanchez ?? ! Terrible customer service and when offered the opportunity to make it right, they choose the wrong path.  I thought they were better but just another disappointment"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jack Montague",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T17:24:48.000Z",
          "Titre": "customer service sucks…",
          "Contenu": "You could start by telling your lazy assed employes to respond.  I've been having problems for months and nobody ever, ever ever gets back to me. Do I have to put signs on my front lawn and vehicles saying \"Patriot mobile service sucks \" to get a replay>  Go on aninternet tirade to get them off their asses? Write to the CEO about the incompent assh** in customer service?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Reinders",
          "Nb_Reviews": 2,
          "Date": "2023-08-22T23:06:41.000Z",
          "Titre": "Your responses to problems is a form…",
          "Contenu": "Your responses to problems is a form response and not addressed individually. Personal attention will get you loyalty, but your just a big corporation an probably have a bot doing your responses. I was looking to switch over but after seeing your customer service I will stay with the thief I know rather than the one I don't. Please take this constructively."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T02:23:27.000Z",
          "Titre": "NO service in Europe!",
          "Contenu": "I purchased the coverage for my trip to Europe.  We had NO data service the entire three weeks we were there!  When we had T-mobile, there were ZERO issues - at no extra charge.  It was seamless.We had to pay over $130 for (the cheapest) internet service while on the cruise.-----While in Europe, we tried calling Patriot Mobile \"Customer Service\" MULTIPLE times to rectify the problem.  No solutions or any follow up on their part.  Very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Downes",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T01:00:45.000Z",
          "Titre": "I subscribed to Patriot Mobile just…",
          "Contenu": "I subscribed to Patriot Mobile just over two weeks ago. And was told at the time, if I went over the allotted volume \"just call and we can increase your plan\" -- NOT SO -- when I called because I could not access podcast (War Room) Patriot Mobile indicated that we can't change your plan until November 3rd. Oh and by the way I will not have access to websites like War Room until November 3rd. These folks masquerade themselves has christians and Patriots -- not sure what that term means to them. I know what it means to me, they are ponies, trying to represent themselves as something they are not."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Bush",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T14:56:45.000Z",
          "Titre": "No signal in my house",
          "Contenu": "I can make calls if I'm in my back yard where I get 1 bar of signal, but the phone isn't even on the network inside my house.  Really appreciate the concept of your business but it's just unworkable for me.  I have to sign up to another carrier to use my phone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kathy",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T18:57:02.000Z",
          "Titre": "I have asked more than a few times for…",
          "Contenu": "I have asked more than a few times for my billing to be on or after the 3rd of each month.  It posted in my account on Oct. 30th! You assured me it would be not post until the 2nd or 3rd of each month, and I was overdrawn in my account. Why is it rocket science? You can charge me the difference in the few days difference. I live on a fixed income and I am very tight at the end of each month. So this is what is wrong. It is frustrating to have to take all this time to get it right. You seem like a very un-together company, but I like that you patriots and that you gave me that discount. It is affordable, but we have to make this work differently so I don't have to worry about it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deborah Poland",
          "Nb_Reviews": 3,
          "Date": "2023-09-05T20:48:06.000Z",
          "Titre": "I wanted to switch",
          "Contenu": "I was really hoping I could switch to Patriot Mobile.  But, today is 11 days without phone service.  Your customer service is rarely open and you sit on hold forever.  I am having to call from a work computer - so it is difficult for me to wait on hold for 30 minutes.  This will be my last few days of trying to switch to you before I go back to Verizon."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ca_buddy2",
          "Nb_Reviews": 6,
          "Date": "2023-09-01T15:47:53.000Z",
          "Titre": "It took talking to a supervisor to fix…",
          "Contenu": "It took talking to a supervisor to fix the problem.  I got loud and clear the agent \"couldn't\" help me.  She kept saying she didn't have the authority.  But according to the supervisor, she did have the authority to fix my problem.  All the upset could have been avoided had the agent \"heard\" me instead of telling me I \"chose\" to change in the middle of a cycle ... I didn't.  The person I signed up with had to fix my network problem by putting me on a different network.  This was a really bad experience for me.  But I'm thankful for the supervisor who listened and fixed the problem.  Don't hesitate asking to speak to a supervisor."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Martin Collins",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T14:40:39.000Z",
          "Titre": "Don't go woke my a$$",
          "Contenu": "I find it funny that Patriot Mobile claim that you shouldn't give your money to woke telephone companies yet their entire infrastructure relies on Sprint/Tmobile. Oh the irony!PATRIOT MOBILE:==============Which third party partners are you pairing up with?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Anderson",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T18:57:32.000Z",
          "Titre": "****Very Misleading over inflated AT&T company****",
          "Contenu": "Poor customer service. Inflated AT&T pricing. Was interested in switching, but after confirming that they use AT&T, no dice. Basically AT&T with a name stamped on top. Customer service lady was impatient and rude.Read the reviews folks. The canned responses don't even use the correct American spelling or grammar.Some Patriots..........."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T11:00:34.000Z",
          "Titre": "Unable to get Activated",
          "Contenu": "I called Patriot Mobile to assist in switching carriers and that person was helpful, I watched the video and did everything in order. However, I cannot call out or receive calls and submitted 2 requests for Technical Support at 1500 on 5/24. I informed them to text me b/c my phone does not work properly, and I have not heard back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bonnie Scott AZ",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T22:23:12.000Z",
          "Titre": "I've had Patriot Mobile (via Charlie…",
          "Contenu": "I've had Patriot Mobile (via Charlie Kirk suggestion) While I AM a patriot ad support their goals, their lack of Support and support follow through is without exception Null and void. I have had Patriot Mobile since Jan 5th of 2023. I have made numerous calls and promises of calls back which have never been made. Still do not have a receiving ability for voiced mails. I was finally promised a call back yesterday to hear from  a Supervisor ( typically, she said; within 24 hours.) It never came go figure... I'm going to go to T-Mobile. and pay more, but don't mind as long as the support is there.  Very, very disappointing. Bonnie Scott"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris Ray",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T22:26:24.000Z",
          "Titre": "Horrible process Still not resolved",
          "Contenu": "Horrible process! I was with Verizon and wanting to switch. I was turned over to someone that did not have a clue. My service was dropped and my family had no way to talk with anyone. Still have no service. Switching back to Verizon but Patriot mobile will not release our line back to Verizon. I take it they are trying to punish. Sales gave out incorrect codes to switch back. Totally unprofessional. I am in Real Estate and have lost a lot of money due to not being able to receive calls on my phone after 3 days. I also have spent over 10 hours trying to get service back. Please, beware of this company."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "T ood",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T23:17:21.000Z",
          "Titre": "I signed up to patriot mobile only to…",
          "Contenu": "I signed up to patriot mobile only to find at sign on that they just assigned you a number, not one I chose, and certainly not easy to remember.  I talked with the tech, he tried several ways and still it would let him choose a different number.  How very commie of them right. I paid for service,  i did not receive,  i got a phone, guess ill be going somewhere else trying to find good service because right off the bat it sint here."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Francis Fay",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T15:40:40.000Z",
          "Titre": "The agent answered my questions",
          "Contenu": "The agent answered my questions, but the problem was the previous Agent I spoke to a week ago gave me wrong information which messed up my bank account and cost me 30 dollars in overdraft fees.  I wasn't expecting a withdrawal from my account until August.  Frankly, it was very disappointing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SG",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T07:43:13.000Z",
          "Titre": "We wanted to like them",
          "Contenu": "We wanted to like them. They failed to fully port our account from T-Mobile and we were charged $900 for 1 month/3 days of service by both companies simultaneously. We had to up our internet after 5 days of service too. We ended up staying with T-Mobile because our account never closed. Patriot mobile refused to give us a refund or even return multiple attempts to reach them. I would say that’s NOT what Jesus would do!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patriot Lamemo",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T18:32:18.000Z",
          "Titre": "They aren’t special",
          "Contenu": "They aren’t special, they just use the AT&T network just like most other resellers.  The reason for my low score is because they LIE about your monthly cost.  If you go with them, expect to pay $10+ per month over the “plan price”.  Soooooo many hidden fees/charges!!!  Screw them, go with Cricket mobile (which I switched to).  Same network, same speeds, and same data plan, and I pay exactly what I signed up for!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Highsmith",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T01:39:39.000Z",
          "Titre": "At 69 had several different cell…",
          "Contenu": "At 69 had several different cell providers OVER the years.PATRIOT MOBILE IS THE WORST COMPANY I HAVEN EVER HAD!THEY PUT ME THROUGH 30 DAYS OF MISERY, PUT YOU ON HOLD FOR HOURS. HAVE SPENT ALMOST A THOUSAND DOLLARS ON 5 PHONES. 3 EXTRAS(UNUSED) THEY WONT TAKE BACK.WILL GET ANOTHER PROVIDER TODAY.I HAVE CALLed THEIR ADVERTIZERS Better business bureau. Will put it out on social media also. Try anyone but them. They claim to be a veteran owned company and Christian too."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A Robert",
          "Nb_Reviews": 2,
          "Date": "2023-02-24T05:22:58.000Z",
          "Titre": "We switched to a new service but…",
          "Contenu": "We switched to a new service but Patriot Mobile still has not allowed our new phone numbers to be ported over which is an FCC violation. They finally gave us the ID# our new carrier required but it was wrong. We urge everyone not to use this horrible company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dean",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T19:15:57.000Z",
          "Titre": "No service cannot make calls",
          "Contenu": "We had no service in Alaska.  Now we are home in Michigan and cannot make any phone calls or send text messages.  We have no land line so this needs to be fixed as soon as possible.  We got sick on our trip and can’t call to make a doctor’s appointment.  WE CANNOT CALL PATRIOT MOBILE TO GET OUR SERVICE RESTORED.  WE CANNOT MAKE ANY PHONE CALLS OR SEND ANY TEXT MESSAGES.  YOU HAVE TO COMMUNICATE BY EMAIL."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T06:25:08.000Z",
          "Titre": "Worst customer service ever",
          "Contenu": "Horrific customer service, calls that constantly get dropped (which their representatives falsely claim only occurs in “rural areas”) and costs that are NOT competitive with AT&T, T-Mobile or Verizon. Patriot Mobile is hoping that you are an uninformed consumer who has failed to do any research. Don’t fall for it. By any measure Patriot Mobile is undeserving of your business or loyalty. Spend your hard earned money elsewhere!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Disappointed",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T23:32:54.000Z",
          "Titre": "Service is terrible",
          "Contenu": "Service is terrible. Dropped calls with almost every call. Customer service wait times are long and the service will not stay connected long enough to talk to an agent.  While the phone is sitting still and not being touched the service cycles from three bars to No Service constantly. Paid over $100 dollars for service and connection, waisted money. Dont ,ake the same mistake."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "tex",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T20:11:25.000Z",
          "Titre": "Had issues paying my bill with customer…",
          "Contenu": "Had issues paying my bill with customer support tried 4 different cards and they kept having errors on their end. called my bank nothing wrong even showed up they tried to debit the account. Guy got frustrated with me and hung up. I will be moving carriers very soon. terrible service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 3,
          "Date": "2023-07-27T00:12:29.000Z",
          "Titre": "not happy",
          "Contenu": "like others on here, called c/s and got nowhere, I still have no service to call out or inbound calls. Can't receive texts nor send them. Got a different sim card, where you need to purchase a pin......un NO! Thought it would be an affordable way to go away from a similar problem, but it's worse."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terry",
          "Nb_Reviews": 3,
          "Date": "2022-06-17T13:59:19.000Z",
          "Titre": "Tried Patriot Mobile for one day",
          "Contenu": "Tried Patriot Mobile for one day. Patriot Mobile took 3 monthly payments from my checking account. They refused to stop. Had to report card as stolen in order to make it stop. Still get a message every month that payment to them was unsuccessful.Now Patriot Mobile is threatening to hit my credit because I will not allow them to keep stealing monthly payments. Again I was threatened this month (6/12/22) with a credit report if I do not pay."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "S.M.J. Alt, JD",
          "Nb_Reviews": 2,
          "Date": "2022-05-31T13:08:31.000Z",
          "Titre": "Patriot Mobile is a RIPOFF",
          "Contenu": "Patriot Mobile SUCKS! BEWARE -- this service is NOT compatible with all phones - namely Jitterbug!  I asked prior to making the purchase and they confirmed it was OK. When I got the SIM card I was told Patriot doesn't work with Jitterbug AFTER I discontinued my service with Lively! Being a patriot does NOT include getting ripped off by half-assed vendors trying to make a buck on the MAGA fad. I had their stuff for less than one day and they refused to refund the money. BEWARE!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Targa Snevets",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T21:42:54.000Z",
          "Titre": "Terrible Customer Service, False Promises.",
          "Contenu": "I just got a sim card from Patriot Mobile. I cannot use the online activation portal because it requires an account number that was not provided to me. I'm on hold forever for the 3rd time after requesting a callback where they let the phone ring once and hung up. They didn't bother to try a second time. I was promised 2 sim cards in case the number they could not provide in advance was not satisfactory for my geographical area to run a business with, and I only received one. If I'm having this much trouble on day one I guess I'm done."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Russ",
          "Nb_Reviews": 2,
          "Date": "2021-05-25T02:25:59.000Z",
          "Titre": "Worst experience imaginable",
          "Contenu": "Worst experience imaginable. I would not recommend this carrier to anyone. What should have been a simple activation of two phones turned into a bloody nightmare. Three separate shipments of SIM cards and we end up with two phone lines and no service. The ineptitude of their staff leaves us speechless. The tech people repeated the same mistakes on two occasions and ported the wrong number to our device. One of the SIM cards shipped had no data on it at all. Avoid Patriot Mobile at all cost.We’re holding our noses and going back  to AT&T."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Palmer Davis",
          "Nb_Reviews": 6,
          "Date": "2022-06-01T01:02:56.000Z",
          "Titre": "Red Coat Mobile",
          "Contenu": "I ordered service not realizing my phone wasn't unlocked and wouldn't work. You can purchase service online, but you can't create an account (or turn it off) until you register the phone. I couldn't do that because my phone was locked. They wouldn't provide any support via email. Finally after waiting an hour on the phone I was told my plan had been canceled and refunded. This was not the case. They started charging me. Email customer support was incredibly rude and unhelpful. Even after the BBB got involved it took two rounds to get them to close my account."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vanessa Becker",
          "Nb_Reviews": 2,
          "Date": "2023-07-23T19:39:42.000Z",
          "Titre": "I just switched to Patriot mobile",
          "Contenu": "I just switched to Patriot mobile. The service is awful! I recived a SIM that doesnt work and when I  asked for help, I didnt recieved a response. I have been left with no coverage for days and a company that only wants to reach out by phone. Um , hello I cant make calls. I bet they will respond to this comment faster. I need help and may just return to my old provider and request a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg Welch",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T23:58:11.000Z",
          "Titre": "I would not recommend this service/company",
          "Contenu": "I would not recommend this company/service. Had a rough time porting our numbers to begin with. Was charged fees that were not explained up front. The service in my area, Rockwall Texas is terrible. It keeps pushing me to different carriers and I have no service at my house most of the time. Traveled to Cabo San Lucas and trying to connect down there never happened. Customer service is simply overwhelmed. Wish I could say better things, was really hoping to support this firm!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DA",
          "Nb_Reviews": 1,
          "Date": "2021-10-03T22:48:59.000Z",
          "Titre": "Good Employees, Trashy Service",
          "Contenu": "If you want polite customer service this service is for you. However I don’t think they know half of what they are doing, seems like they read out of a troubleshooting manual, you only get 1-2 bars in busy metropolitan areas, you will get dropped calls depending on who you choose for service. We made a mistake and regret going with Patriot Mobile."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Keleb Gadol",
          "Nb_Reviews": 14,
          "Date": "2023-04-13T04:22:03.000Z",
          "Titre": "Too expensive.",
          "Contenu": "They want $36 a month for 3gb of data. I have been a Red Pocket customer since 2018, and paid $199 a yr (approximately $16 a month), with good AT&T service on Android phone, unlimited calls/texts.  I also have a Red Pocket Verizon plan on an iPhone for $99 a year (less than $10 a month) with 1gb data and unlimited calls/texts. Why would I want to pay MORE than 2x the amount?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A Robert",
          "Nb_Reviews": 2,
          "Date": "2023-02-13T03:30:00.000Z",
          "Titre": "Horrible company.",
          "Contenu": "Service is awful! Bad signals in Colorado and rural areas. Data plan sucks too and if you want unlimited it's crazy expensive. We're switching after 8 months of frustration."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marsha Sutterby",
          "Nb_Reviews": 1,
          "Date": "2021-09-16T21:38:59.000Z",
          "Titre": "THEY ARE GREEDY FRAUDS",
          "Contenu": "So, we are losing phone service because they sold us 3G phones on a 2 year installment and it isn't up until Dec 2021. My husband just asked them if we still had to pay the balance since it's not our fault the device's won't be good anymore ($30) and they said \"well, just think of it like a car\". In other words, yes; instead of eating $30 to keep steady paying customers, they would rather stick it to us. We WILL be ending our relationship with Patriot Mobile. So much for THEIR version of 'Christianity'. I defended them multiple times but my husband was right, they are FRAUDS!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tanner Crook",
          "Nb_Reviews": 2,
          "Date": "2021-12-06T18:28:30.000Z",
          "Titre": "Predatory Sales and Bad Service.",
          "Contenu": "I signed up via phone representative. They did not inform me I was in a 2 year contract. No mention of this in any way. Company is predatory. I like what they stand for but who could trust them after my experience. My roommate has mint mobile, uses same t-mobile towers as my patriot. His signal and internet strength was at minimum 50% stronger all over town and at the home."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicole Faith",
          "Nb_Reviews": 1,
          "Date": "2021-12-19T13:46:45.000Z",
          "Titre": "We wanted to stop supporting liberal…",
          "Contenu": "We wanted to stop supporting liberal companies but the hours and hours my husband was on the phone with Patriot Mobile was not worth it. They still couldn't figure out why they couldn't get our phones working. We had switched over and then found out they use t-mobile towers.  What's the point?! This was the worst experience with a phone company we've ever had. Until they get their crap together, don't even try here. Which is sad. We were excited to start supporting this business."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeanne",
          "Nb_Reviews": 2,
          "Date": "2023-04-27T02:53:15.000Z",
          "Titre": "I loved the idea of Patriot Mobile and…",
          "Contenu": "I loved the idea of Patriot Mobile and I wanted to support a Christian Conservative Company. I spent a total of 9 hours with no phone and a lot of frustration. I finally gave up and went back to T mobile what an absolute waste of time !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bruce",
          "Nb_Reviews": 1,
          "Date": "2022-05-29T04:42:10.000Z",
          "Titre": "Wish I had read reviews first!",
          "Contenu": "I wish I had read reviews of this company before trying to switch over. My experience has been an absolute nightmare and isn't over yet! They are holding my number hostage; I have no service due to LAYERS of incompetence, but I can't port my number to another carrier, either. Stay tuned!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank Foster",
          "Nb_Reviews": 1,
          "Date": "2022-01-13T18:23:22.000Z",
          "Titre": "Customer service is absolute garbage",
          "Contenu": "Customer service is absolute garbage. Forget about sending simple password requests if you forget your password, nothing happens. Their website is only directed towards attracting new customers and nothing is there to help existing customers. There is zero help from these people. I would not recommend to any friends and I am cancelling my service effective immediately. I will actively speak against them. Just because you also support the first amendment, doesn't mean I will give my money to a company who doesn't support me. You want to upgrade your phone or your phone is broken? You are prompted to add a new line... What? This company will only stay afloat on the backs of unknowing conservatives. Patriot Mobile: All Talk, No Action."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "VL",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T12:51:36.000Z",
          "Titre": "No service…",
          "Contenu": "We went camping and we had terrible service, we were not out in nowhere land so our phones should have gotten better service. Even driving by a tower we had no service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "david perry",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T15:37:47.000Z",
          "Titre": "Patriot Mobile claimed to have full…",
          "Contenu": "Patriot Mobile claimed to have full coverage for my area central Virginia. The Fact is at my home address I had ZERO coverage, very false advertising. and getting any customer service has been extremely difficult. I'm still trying to  return my 2 phones and get a refund on my purchase. I would NOT recomend doing business here."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank Della Rosa",
          "Nb_Reviews": 2,
          "Date": "2022-11-26T20:53:49.000Z",
          "Titre": "I recommended to my wife that she…",
          "Contenu": "I recommended to my wife that she should switch from Verizon to Patriot mobile. We have experienced only problems. Incompetent customer service who did not bother to confirm that Patriot had service in our area. The company uses towers from multiple carriers. They sent us a T mobile sim. T mobile does not have service in our area. We have invested 2 days trying to port back to Verizon. Still not resolved. I would never recommend this service based on our experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Craig W Cohen",
          "Nb_Reviews": 1,
          "Date": "2021-08-26T17:51:48.000Z",
          "Titre": "I was excited to use Patriot Mobile",
          "Contenu": "I was excited to use Patriot Mobile, as most of the other providers are weak leftys, but I gotta be honest. It’s not good. It’s the worst mobile carrier I’ve had, and they use all the lefty service towers anyway. They just subcontracted out their towers and give it another name. They’re not fooling anyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kathy Baars",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T17:43:07.000Z",
          "Titre": "Miserable fail",
          "Contenu": "Anyone thinking of using Patriot Mobil DO NOT USE. Worse customer service : , 2+ hour hold times, no call backs if you request that rather than wait on hold, mis information from different representatives, not available (even tech support) on Sunday. . I had to buy a burner phone at $119.44 since we had no phone service for five days. On the 6th day after ordering a land phone and paying to hook up I talked to Keith a manager, he said he understood &  did finally get my phone working but since hubby not home he has to wait. after I asked that I have a month free and he they pay for burner phone he said he’d give me one month credit but sorry can’t pay for a burner phone. We were with them for two years! Going to T -Mobil ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Darren",
          "Nb_Reviews": 3,
          "Date": "2022-08-11T16:02:22.000Z",
          "Titre": "Patriot Mobile is a COMLETE SCAM",
          "Contenu": "I attempted to port from another carrier and they have no idea how to complete a port.  I was on hold for 20 minutes and hung up because i was at work.  I called again this morning and requested a call back in the automated system.  A person called me but advised he is a sales rep and would transfer me to the correct department, then hung up on me.  This company is a complete scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T21:46:23.000Z",
          "Titre": "What a waste of time",
          "Contenu": "I thought I was doing the right thing by switching to Patriot Mobile because they support Conservative values but boy this was a nightmare of an experience. I ordered service and they sent a sim card with instructions on how easy it is to activate online. I tried activating online and not only did it not work but it caused both my laptop and iPad to crash. I kept getting a port in error and I thought calling them the next morning would get it resolved but it ended up being 100x worse calling in. I waited forever on hold and finally spoke with someone who asked for a port pin from ATT. I tried explaining countless times that I already have a PIN and she kept telling me to dial *port. Never the less I felt like she wasn't listening to me and I tried explaining what I wanted and it never worked. I want a refund and an apology because this is the worst experience I have ever had with a company and I still don't have active service with patriot mobile but they have my $80 hostage! I highly recommend you don't attempt to use Patriot Mobile unless you enjoy Anxiety and Frustration in your life!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephen Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:19:11.000Z",
          "Titre": "Terrible tech service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JackieT",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T13:26:17.000Z",
          "Titre": "Just bad customer service. worse than ATT",
          "Contenu": "I have been with Patriot Mobile since February 2023, it is currently July 2023, and I have lost full signal multiple times. I again today have service that if I get a connection it drops (Call Failed) in the middle of my calls.  If someone calls me it will allow me to try to answer, but sends all calls to voice mail. I use my phone for work, and this is NOT working.  I have terrible service, and you can NEVER get anyone on the phone for customer service at Patriot Mobile.  When I lost service in June, it took them 2 days to reply to an e-mail that I had no service, and their response is \"reboot\" your phone. Of course I have already rebooted my phone before I tried calling anyone, or e-mailing anyone.This is not what I hoped for. I wanted to participate in a patriotic company but clearly they are not ready for prime time."
        },
        {
          "Note": 1,
          "Lieu": "EC",
          "Pseudo": "Marcus Jennings",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T01:58:43.000Z",
          "Titre": "Downhill after signup.",
          "Contenu": "Signup was quite easy, but things went downhill from there.They seem to be using T-Mobile's network.  They have limited customer service hours and it seems like they might not have full access to the necessary data.At any rate, they unsuccessfully ported my number.  Ended up without service for four days before I regained my previous service at T-Mobile.Their customer service (when reachable) was courteous.  They did indeed wish me a \"blessed day\".  Unfortunately, instead of that, I struggled to not curse my decision to try Patriot Mobile.  They seem to be newish so perhaps it's just a matter of not being well structured yet.Also, I always wonder how much of a contribution is made to a cause when a business says \"a portion\" of my purchase supports something.  Nowhere could I find what portion or how much was given to which group.  Unfortunately, too many \"conservative\" causes end up being scams.  Transparency would help everyone."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "PHIL GUNDAKER",
          "Nb_Reviews": 2,
          "Date": "2022-08-25T21:15:32.000Z",
          "Titre": "Patriot mobile is a scam",
          "Contenu": "Patriot mobile is a scam. They are not a patriot company. They are AT&T who give the unselect committee phone records. They are traitors. They will send you to collections. How is this a Christian company. We need trump phone. A real American man. A man of values and family values. Someone that doesn’t marry and divorce. This company sells your information. We need a real company.  We need a real actual American like red Cruz. This company isn’t even from this country. They are from Canada. How fake is this. They lie just like the typical Demonrats. They do not care about sue proud Americans.This is a scam. This is sprint and other networks. You are paying for a liberal company that is signed up by these scammers and re sold. Just find a legit company. These scammers are selling you sprint at a higher price. Avoid these liberals!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ron hartwell",
          "Nb_Reviews": 1,
          "Date": "2022-07-14T02:04:33.000Z",
          "Titre": "I am extremely disappointed",
          "Contenu": "I am extremely disappointed. I really wanted to switch. I tried twice to switch my phone number over. I spent at least 5 hours on hold. Maybe more it was Almost impossible to reach then with less than 35 to 60 minutes on hold.  Customer service was just awful.  I am sorely disappointed with the entire situation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kasey Floyd",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T19:37:56.000Z",
          "Titre": "Their customer service on technology…",
          "Contenu": "Their customer service on technology issues is terrible. Can't get ahold of anyone.  Can't get anyone to answer email in any kind of timely manner.I would not recommend this company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sejanus",
          "Nb_Reviews": 6,
          "Date": "2023-04-13T19:41:23.000Z",
          "Titre": "terrible customer support",
          "Contenu": "terrible customer support. nada. Ignore me when activating phone. no response. what could be worse - my phone will not work and no one at Patriot can be bothered to help"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2021-06-04T00:11:50.000Z",
          "Titre": "Lied to me from the very beginning",
          "Contenu": "Lied to me from the very beginning.  I ordered a phone, and that phone was \"Out of Stock\", so they sent me an inferior phone.  Later, they sent me a free \"Smart Phone\",  but one year later jacked up my monthly price.    Patriot Mobile is like any other RINO, talk about supporting conservative values while ripping you off.  I like the coverage, but not being lied to.  Customer service is a nightmare.  Don't bother with this POS company that just sold out to T-mobile."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Weber",
          "Nb_Reviews": 1,
          "Date": "2021-10-20T18:36:31.000Z",
          "Titre": "I recently purchased a Samsung Galaxy…",
          "Contenu": "I recently purchased a Samsung Galaxy A32 5G outright and had trouble bringing my old number over from Straighttalk. First week I've been notified that I've  already used 75% of my allotted unlimited data, the phone automatically disconnected calls after 120 minutes into a call. I'm definitely not a satisfied customer and I will be making the switch back to Straighttalk where unlimited means unlimited! TMobile has to be the worst carrier for anyone to use."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Russell",
          "Nb_Reviews": 2,
          "Date": "2022-10-01T04:52:34.000Z",
          "Titre": "I have purchased four different phones…",
          "Contenu": "I have purchased four different phones from Amazon and eBay to a which were said to be compatible with T-Mobile in AT&t. Patriot Mobile cannot get them to work. I have had nothing but headaches with this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deborah",
          "Nb_Reviews": 1,
          "Date": "2022-10-01T21:33:00.000Z",
          "Titre": "Very Unsatisfied New Customer",
          "Contenu": "I am giving a 1-star review because I wouldn't be able to leave a review with a 0-star review. After putting in SIMS card and then being informed that I do not have a network connection and can only make Emergency Calls and having to use my laptop to reach out to a Patriot Mobile Customer Representative I received an email reply that informed me I will hear from someone in 48 hours. I CAN'T RECEIVE PHONE CALLS OR TEXT MESSAGES!!!!!!!!!!!!!!!!!!!!!!!!  WHY ARE YOUR POSTED CUSTOMER SERVICE HOURS ON SATURDAY UNTIL 6PM; HOWEVER YOU WON'T ATTEMPT TO HELP CUSTOMERS FOR AN ADDITIONAL 48 HOURS!!!!!!!!!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christine",
          "Nb_Reviews": 2,
          "Date": "2022-03-28T14:10:12.000Z",
          "Titre": "Poor customer service",
          "Contenu": "We have been with Patriot Mobile for years and have had no problems until we were forced to switch out the sim cards to T-Mobile.  That would have been fine even with T-Mobile not being as good in Omaha as Sprint, but the lies told to us on billing is unacceptable.  We were told we would have the first two months half off and we would receive 15% disc. for multiple lines and 15% disc. for veterans.  That is not true.  They put both 15% discounts on your account but you only get one.  The representative finally admitted that.  She kept saying you have both discounts and will receive the highest discount.  Basically, you do not get both discounts.  Therefore, we are going to have to pay more for crappy service.  Looking for different cell phone company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ampcoman",
          "Nb_Reviews": 1,
          "Date": "2022-02-10T20:24:56.000Z",
          "Titre": "Read reviews before you get involved",
          "Contenu": "I too wanted to be involved with a company that does not support the liberal movement. After doing compatibility research, on my own and through their own website, then contacting their tech team two different times to see if Patriot would work for me, I signed up for basic service. Immediately my phone turned out to be incompatible, unlike what they told me. I wasted two days of my life trying to get them on the phone and waiting for promised return calls that never happened. I ended up going to AT&T to port my number over to them. How dare these people use the name of Christianity and the Constitution to drag people into their circle. All I wanted is what they promised. What I got was very different. The nicest thing I can say about Patriot is that you can easily understand the people answering the phone - Americans."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shiloh",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T23:25:56.000Z",
          "Titre": "Theft of money...",
          "Contenu": "I was charged for a service in March of 2022 which was unable to be completed.  After multiple attempts to get my money refunded and now after three months, still no refund for the service, even though I had email confirmation that the money would be refunded.  In my opinion, this is theft."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tommy Lebowitz",
          "Nb_Reviews": 1,
          "Date": "2022-05-02T17:24:41.000Z",
          "Titre": "I had to go without service for a while…",
          "Contenu": "I had to go without service for a while because of the SIM switch, like many others probably did, and when I changed over to AT&T, I couldn't keep my phone number, possibly because Patriot Mobile had stolen it.  Now, they are sending me e-mails trying to get more money from me and threatening to send me to collections, stay clear of unknown companies that claim to be \"Conservative\" and \"Christian.\"  People and places like this give truly Christian companies and people a bad name."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "S.l.",
          "Nb_Reviews": 4,
          "Date": "2021-08-18T13:57:28.000Z",
          "Titre": "Horrible service",
          "Contenu": "Horrible service, providing a refund for the time I wasn't able to use my phone but not making it right for all the extra time, money and problems that was caused by their lack of service.  Do not recommend at all.  We are a patriotic family and do our best to support small companies but this company has terrible customer service and does not go an extra step to make things right after they caused a lot of problem."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marni",
          "Nb_Reviews": 11,
          "Date": "2022-03-17T15:14:24.000Z",
          "Titre": "Warning",
          "Contenu": "Warning! Patriot Mobile is not who they claim to be. my phone is overheating. called patriot mobile. They said to return my phone call the protective services. I was under that.  Called them.  they tell me to call patriot mobile to return it.  Back and forth and no resolution. My phone is heating up and they don't care."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Saliba",
          "Nb_Reviews": 1,
          "Date": "2022-01-05T01:11:44.000Z",
          "Titre": "I gave up great unlimited service for a",
          "Contenu": "I gave up great unlimited service for a company I  truly could back. Except they don't have your back. Sure they're nice and friendly but they say there plans are \"unlimited\" is a lie. I switched from a horrible company to one that supported everything I believe in and they took me to the bank. And they're not truly independent as is. They tie all there plans into T mobile and AT&T sim plans. Maybe one day there will be a company that represents my qualities and freedoms and is free themselves! Ohhhh and if you want to upgrade your unlimited plan, you have to pay more!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kate Penk",
          "Nb_Reviews": 1,
          "Date": "2021-05-13T17:12:53.000Z",
          "Titre": "Dealing with this incompetent company…",
          "Contenu": "Dealing with this incompetent company was an absolute nightmare. Signing up went smoothly and I looked forward to their service, particularly because I am a conservative Christian and was so happy to support the business.I inserted the SIM card and followed the instructions for activation. Nothing. I could neither call out or receive calls. I emailed them repeatedly and never heard back. one very frustrating day.The next day I borrowed my daughter's phone and called them. The woman I spoke with couldn't help me and transferred me to technology. After 5 minutes a giggling absolute idiot answered. I couldn't understand one word she said. I kept asking her to repeat what she was saying. She hung up on me.I called back, and this time I was told that the phone I have, iPhone s, was due to be dropped soon anyway. No one mentioned this when I signed up. Thanks.I hung up and went to Consumer Cellular."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Maureen Villella",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T14:29:59.000Z",
          "Titre": "After I installed patriot mobile",
          "Contenu": "After I installed patriot mobile, the calls kept dropping like crazy I called and the man said he fixed it, but callsy are still dropping, not quite as much, but they are dropping in ithe middle of conversations and people are getting annoyed. I am not on the phone with conversations as much as I am podcasts and looking at emails, so it didn’t bother me as much as them, and I just haven’t had time to call again. But I am going to call and if it doesn’t get fixed, I’m going to have to switch carriers again. I really wanted to keep patriot mobile, so I’m hoping they can help me. I got it because I watch Dan Bongino and he recommended it.   Maureen Villella 561-704-4095. P.S.  It happened several times while I was talking to my daughter last night and she said I should insist on a rebate of a couple of months!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bruce Penner",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T17:01:02.000Z",
          "Titre": "Phone service at my home has become…",
          "Contenu": "Phone service at my home has become marginal.  International roaming/usage is a joke (kind of worked in Cozumel, had to change sim cards and change back to use it in Egypt and Jordan, and was a total fail in Panama).  Website works like it was designed by high schoolers (have to enter a new credit card when just wanting to update the expire date and security code, and then can tell which is the newly added one because you can't select to see details--only the last 4 digits of the cards are displayed AND THEY ARE THE SAME!!  Sounds like it's time to try PureTalk."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Patricia Holcomb",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T10:38:58.000Z",
          "Titre": "I use my phone for work",
          "Contenu": "I use my phone for work. For the entire year of 2023 I have received only one voicemail. I get complaints from my customers. I get complaints and have been in danger of Missy medical appointments because I never got the doctors messages. I’m not sure what’s wrong with your phone service but I shouldn’t be dealing with this."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dr. David DanleyPhD",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T17:54:30.000Z",
          "Titre": "Not as it was Promoted",
          "Contenu": "Our original setup with Patriot was a nightmare. It was as if the proverbial “right hand didn’t know what the left hand” was doing. It took a whole two weeks before we got service. And then, afterward, we were forced to change Patriot’s vendor from T-Mobile to Verizon to get decent service. Finally, we don’t like to be forced into Automatic withdrawal. Because, although we ALWAYS pay, but as seniors, it is highly problematic to have funds in our account at the Exact moment Patriot takes it out. If we had to do it over we would have gone with many other providers like Pure Talk, etc., even though now Hannity and others are No longer doing recommendations."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Roberts",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T13:14:26.000Z",
          "Titre": "not that you care",
          "Contenu": "That one time i hit my limit and you suppressed my plea to pay a fine or something to get me home. No last two days of my unschedule trip was with voice only. but i understand being limited in funds and a lower form of life i must keep to the curb for others more important. oh, do not misunderstand me DEI infitration is pure evil."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Curtis Badon",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:59:36.000Z",
          "Titre": "The data does not work well",
          "Contenu": "The data does not work well, there are often pauses and buffering. And the cost of the service is as much or more than Verizon. Also unlimited data is not available which I would prefer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steven Lord",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:45:11.000Z",
          "Titre": "Poor Customer in getting card number changed for billing",
          "Contenu": "You made it impossible for me to change my debit card number to pay my bill.  You wouldn’t take a credit card number over the phone and would not send out a paper bill.  I had to have my tech knowledgeable son call and be talked through how to get my billing issue resolved.  This is the worst response to customer needs I have experienced with any company ever."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eric Anthony",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T22:04:04.000Z",
          "Titre": "Not satisfied with my flip phone",
          "Contenu": "Not satisfied with my flip phone: the old one was better, easier to use and understand. No real instructions came with the phone. Now I rarely use the phone, never text --- mostly I just carry it around for making an emergency call. Really disappointed in the \"customer support\" for this phone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "matt haugan",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T17:06:23.000Z",
          "Titre": "Changed pricing without notifying me",
          "Contenu": "Ive had four lines for several years. Recently I noticed the multi line discount was removed from two of the lines (for how long im not sure) as well as line 4 price was increased to 70 a month when it used to be less. The customer rep told me its because we changed the sim card awhile back due to low bars at patriot mobiles recommendation and we were NOT told the price would change after changing the sim card.  I called to get these things fixed and he said he could not change the price on line 4 back to what it used to be, but did re apply the multi line discount to all of the lines. Im disappointed with about line 4 costing so much."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marla Rankin",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T03:56:54.000Z",
          "Titre": "I changed from Verizon to save money",
          "Contenu": "I changed from Verizon to save money.  That has not happened plus the service is much worse!  We had less gb's on the Verizon plan but NEVER ran out!  Now we run out quickly.  Call reception is bad a lot of the time too.  I was told when speaking with the rep that signed us up that the price would be $60. less than what we are being charged.  I've called several times to get it resolved but experienced long wait times, been cut off after waiting a long time, then when I finally speak to someone they don't know why the service is bad and won't honor the price we were quoted."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "W. K.",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T18:57:46.000Z",
          "Titre": "Wireless data horribly SLOW….unacceptable",
          "Contenu": "Get some modern data speeds. My experience has been worse than when cells first came out.. AT&T is selling you their garbage servers from the stone age.Unacceptable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michele Schurle",
          "Nb_Reviews": 4,
          "Date": "2023-12-16T23:08:28.000Z",
          "Titre": "The reception on our phones are…",
          "Contenu": "The reception on our phones are terrible. Even though it shows we have full bars or almost full bars, we have no internet connections at times. It's crazy."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christine Hutchins",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:37:57.000Z",
          "Titre": "We get from 0 bars to 1 bar of…",
          "Contenu": "We get from 0 bars to 1 bar of reception. Not quite enough to use voice or data. If we drive to a nearby city, the service is better and useable. We have tried AT&T, Verizon, and T-Mobile carriers with Patriot Mobile. T-Mobile has been the best. We live in an area with small mountains and hills. Cell phones communicate via line of sight to cell towers. We rarely have line of sight where we travel."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sylvia Cordova",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T07:07:33.000Z",
          "Titre": "I gave you as many stars as you have…",
          "Contenu": "I gave you as many stars as you have givin me bars of phone connection service! Poor service = poor ratings!Call me if you can get through."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Martin Grosvenor",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T19:00:03.000Z",
          "Titre": "I have no to little cell service sense…",
          "Contenu": "I have no to little cell service sense you switched to AT&T. I had to install a land line, do to the lack of cell service. Never had cell issues before at home. I like the work Patriot Mobile does and the people that work there. Sorry to give a bad rating.Martin Grosvenor"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T05:23:39.000Z",
          "Titre": "Love what they stand for but...",
          "Contenu": "Love what they stand for. Joined at an NRA convention because their price would have taken my Verizon bill down by $75 but it took less than 3 months to see fees creep up and the level of service go down. They have very limited tech support hours. I always have to wait for a call back. I have to constantly look at my bill because it fluctuates so much or I have to remind them that they missed a discount. Their people are great but I had my power go out during a few storms.  I could not receive calls or dial out. I could not use my text messaging. The internet worked but so even when I put in a ticket online, they could not call me back to respond. It made me feel unsafe. They have limited phone options. I would love to see a viable satellite phone option. I'm torn because I feel like I have to compromise what I pay for to be with a company who shares my beliefs. Why should there ever be a trade-off? This is America, we should be able to produce an excellent product supported by 1st class tech support at a competitive price without compromising technology and features."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Opy Taylor",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T18:33:49.000Z",
          "Titre": "I’m not switching back but the service…",
          "Contenu": "I’m not switching back but the service runs a little slow for me! I’m willing to put up with it for now because it’s not china, I’m hoping it improves but it’s not that bad ! It is cheaper by a bit!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dear Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:41:08.000Z",
          "Titre": "Patriot Mobile misrepresentation",
          "Contenu": "Patriot Mobile misrepresentation.  Said I'd be paying app. $17 p/m for service.  I'm now paying close to $30.  Bait & Switch."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Wimmer",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T17:08:46.000Z",
          "Titre": "They don't seem to have a carrier that…",
          "Contenu": "They don't seem to have a carrier that provides decent cell service to my house. I switched from another company that cost 1/3 less and had the same service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Squibb",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T15:50:26.000Z",
          "Titre": "You do not allow anything under a 5G…",
          "Contenu": "You do not allow anything under a 5G phone to be used with your service, there are many 4G phones that I would like to use Including my 4G iphone but you won't allow it, And don't send me a link for new iphones because I'm on disability pay and cannot afford them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T04:45:02.000Z",
          "Titre": "The service is not good and keeps…",
          "Contenu": "The service is not good and keeps getting more expensive"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Darrell Galloway",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T14:27:12.000Z",
          "Titre": "I've been with ATT",
          "Contenu": "I've been with ATT, Verizon and Xfinity. Never had data usage like what it shows with Patriot. I've rechecked my phone for what apps are using data and keep them closed when not using them to be sure they aren't. No cost savings like I was told, website isn't user friendly, and I would not recommend to my friends."
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "Mario Chau",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:25:46.000Z",
          "Titre": "I am abroad and the network does not…",
          "Contenu": "I am abroad and the network does not work, I have to rely in Wi-FI. For that any device can access.😡😕"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Debra Howard",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T15:55:54.000Z",
          "Titre": "First",
          "Contenu": "First, I use a flip phone, and all you sell are cheap ars ones. Second, WHY AM I ON att NETWORK? That is what it says on my phone. I thought I was on Patriot Mobile. So, are all my calls being spied on?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rosie Levitt",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T03:38:01.000Z",
          "Titre": "Cell Service is terrible",
          "Contenu": "Cell Service is terrible, Im ready to switch."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Beth Massey",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T20:19:07.000Z",
          "Titre": "I just got off the phone with one of…",
          "Contenu": "I just got off the phone with one of your customer service members and the lady I spoke to was so rude. Your company's customer service area definitely needs a refresher course in customer service, that is if you guys want to stay in business. I tried to explain to her that I am senior citizen and I am hundred percent disabled and due to my disabilities it is hard for me to do things on my cellphone. So therefore, she is the reason that I am probably not going to go with ya'lls company at this time. I did let her know that I would think about whether I would be interested in going with you all as my cellphone services, because right now I am with Metro and not once have they ever been rude to me. I just thought you guys needed to know about my experience with Patriot mobile. Also I have been a conservative patriot almost my entire life and as I stated above I am a senior citizen."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joseph Hunter",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T06:40:20.000Z",
          "Titre": "Their timing of calling me back has…",
          "Contenu": "Their timing of calling me back has been bad. My phone is a complete fail"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gregory",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T22:31:43.000Z",
          "Titre": "PartiotMobile Support not so good",
          "Contenu": "I got onboard with PartiotMobile just a week ago and after day and a half my iPhone locked on me saying I needed a PUK passcode. PatriotMobile Support had no clue what to do about a PUK code. (Without a PUK code, your phone and text does not work.) It was the next day at 3:30 in the afternoon where out of nowhere I got my PUK codes. BTW, Support is closed on Sunday. Tomorrow will be one week with PatriotMobile, I will keep you posted."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Metzler",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T23:13:36.000Z",
          "Titre": "Phone echoes unless wifi is off."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kendall Fudge",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T02:00:38.000Z",
          "Titre": "I really wanted to like this company",
          "Contenu": "I really wanted to like this company, but it wasn't to be. I purposely switched to Patriot from Verizon before taking a trip to Canada and Alaska because I needed the wireless hotspot feature while traveling. I also paid extra to have service in Canada, even though we were only there a couple of days. Only when I called (from my wife's Verizon phone) customer service from AK did they tell me they don't provide service there. The next big strike was when I started having trouble with my voice mail. When I called for help, I was told they don't support Visual Voice Mail for Android phones, even though they initially walked me through setting it up, and it had been working for months. Now they're saying they never supported it. I just placed an order to change providers to Pure Talk, who say they provide Visual Voice Mail and VM to text at no additional cost. Instead of using the T-Mobile network, they use AT&T's, and they're about $20 a month less than Patriot Mobile. If that one is no better than Patriot, I'll be going back to Verizon."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "john giannasca",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T14:52:19.000Z",
          "Titre": "Limited business hours, terrible for international calling.",
          "Contenu": "When I first switched to Patriot about two or three years ago, saved lots and customer service was fast easy and friendly. Their 9-5 hours are tough if you are a business and travel a lot. Forget about international calling. I do business in Canada and for some reason access keeps getting switched off. Each and every time I call tech they assure me its fixed. Love the concept, and employees are friendly once you get through but not reliable if you’re running a business."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Johnny Benavidez",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:10:20.000Z",
          "Titre": "Every incoming call gets dropped"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steve Medellin",
          "Nb_Reviews": 7,
          "Date": "2023-10-02T04:08:22.000Z",
          "Titre": "Bad Reception, Bad Customer Service",
          "Contenu": "The payments go in, as scheduled, every month, and the problem is basically a hardware issue, or a signalling issue, but the Biggest Problem is trying to get Service after peak hours, like at !0:30 pm. The phone states \"offline\" and if I am online, I get outside of my apartment, and lose the signal, my music stops, or I am not getting emails and text messages. When I come back home, it sounds like the 4th of July with all the messages, emails, and texts coming through, so I can read them. I am constantly trying to get a Reset to my phone, and I'm paying each month for service, but only have it half of the time. Calling Customer Service is a nightmare, as they're always too busy to answer my call. I cannot recommend Patriot Mobile to anyone with these conditions. I don't hate anyone that bad. Fix the Signals, and Fix the Customer Service Departments and you will have one satisfied customr here, and I can recommend Patriot Mobile to everyone I see!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike osullivan",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T07:50:49.000Z",
          "Titre": "The Phone service is good Except They…",
          "Contenu": "The Phone service is good Except They keep shutting off my phone before they even bill me. never have I ever seen a company do this."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KEVIN B",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T14:16:48.000Z",
          "Titre": "They could not match",
          "Contenu": "1st thing... Been a ATT customer for 20 plus yrs and Have 6 lines ...unlmt talk/ text / data... on phone programs and under 300 a month ....2nd thing...Called patriot and was told that they could not match anything close to that.  That's a shame...I was hoping to help America valves....Update::: patriot responded to this review but never contacted me for more information...no surprise in these days and times..Use to be a time when companies strive for excellence...They just can't add a phone to bill like a all in one deal ... where other carriers have a next phone plan. But patriot mobile is better than the other 3 carriers..your money is helping America 🤔"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 2,
          "Date": "2023-08-03T05:31:34.000Z",
          "Titre": "We are so disappointed in the way our",
          "Contenu": "We are so disappointed in the way our Samsung phones were handled. We choose to return them when no one would help us enroll them. We literally went to sux  vendors and a tech savvy neighbor to get help getting the phones up and running. We still have not received a refund."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sam Moskovic",
          "Nb_Reviews": 1,
          "Date": "2022-02-21T20:18:39.000Z",
          "Titre": "Nothing but problems from the start",
          "Contenu": "Nothing but problems from the start.  Finally canceled service after 2 months.  Had to file a complaint with the FCC because Patriot Mobile will not officially close my account.  AUTOPAY is still enabled and my credit card is still listed on the online account.  Back with T-Mobile and very happy!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T03:06:15.000Z",
          "Titre": "hmmm. disappointing.",
          "Contenu": "I've seen this same type of review too many times for this company. It really saddens me, because I love the idea of supporting a Christian conservative business. The actual experience, however, is not good. I'm not gonna dog the techs or anything. They were all nice enough but it's obvious to me that these guys still have a lot of work to do to get this thing going in the right direction. I had to back out before I ever even got any service due to SIM card and incompatibility issues (3X). I hope they can get these things worked out. They did refund the original 35 bucks that I paid so no harm, no foul but I really do want them to succeed. It just didn't feel right to me. Too many issues. Patriot Mobile, Please get the kinks worked out!! God bless."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Walden",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T15:28:34.000Z",
          "Titre": "It's over-priced."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "A Customer for Over Eight Year",
          "Nb_Reviews": 2,
          "Date": "2023-08-01T16:55:05.000Z",
          "Titre": "Switching Carrier Lines For Smart Watches Problematic",
          "Contenu": "Switching our carrier lines from our previous  provider went pretty well for the smart phone lines and very poorly for the smart watch separate lines. Unfortunately I talked to at least five different customer support & technical support people to finally get the watch lines working. There was no communications about what was happening in the process steps leading to the final activation. I had to ask for a phone call back and the frequency that I wanted to receive the calls, The technical support person that helped me in the final stages was the most helpful and most communicative."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nannette Kendall",
          "Nb_Reviews": 4,
          "Date": "2023-07-31T17:15:29.000Z",
          "Titre": "It takes WAY TOO LONG to receive a…",
          "Contenu": "It takes WAY TOO LONG to receive a response to email questions!!!  I emailed and the first response took at least 5 to be received.  A conversation of 2 or 3 questions should not take 2+ weeks!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andy Mueske",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T17:52:47.000Z",
          "Titre": "Very expensive for blah service",
          "Contenu": "Very expensive for blah service. I can not watch live shows at all and Facetime is out as well. I would go with someone else. And for supporting patriot causes? I show you Fox."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sam Fox",
          "Nb_Reviews": 3,
          "Date": "2022-01-13T02:31:18.000Z",
          "Titre": "Something peculiar is happening with…",
          "Contenu": "Something peculiar is happening with customer service.  When I had trouble receiving my SIM due to Fedex screwing up, I sent 4 emails in a week to Patriot Mobile (support@patriotmobile).  After not receiving 1 response I called them.  Not only did I not get an apology, but was told to go pick up the SIM card from Fedex myself.  After being with Patriot for 2 months, I cancelled my service today by calling customer service.  For Xmas, I received a new iPhone that was already with another carrier.  When I called Patriot to cancel and gave my reason, I was asked if I no longer needed the number.  After saying I didn't,  the line was disconnected mid-conversation.  No goodbye or telling me the line was about to be disconnected.  So, 2 cust svc reps have been kind of rude.  I wonder if the employees are not treated well?  Or, what I believe, some reps may lean left and hate the company & customers."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Larry Blais",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T03:10:18.000Z",
          "Titre": "Poor Network connectivity",
          "Contenu": "The people in customer service are friendly enough but unfortunately as much as I agree with the causes they support I can't have a phone service that doesn't have signal anywhere and that's not an exaggeration I'm a truck driver and only get signal in two major metropolitan areas in Georgia and the same in Alabama. That's not saying I only go to those areas I cover the entire region. I have no issues with the company or the people however if you want a service provider with network coverage then this probably ain't for you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "LTB",
          "Nb_Reviews": 2,
          "Date": "2023-07-31T16:33:01.000Z",
          "Titre": "Still can't use my phone in my home on wifi...",
          "Contenu": "I can't use my phone near my home.  I called a number  of times in May and June.  The rep. said that they'll do this and that if the problem continues.  I still can't use my phone in or near my house, I have great wifi coverage and the phone still won't allow me to receive or make phone calls.I VERY disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dana Robinson",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T17:42:44.000Z",
          "Titre": "Patriot Mobile is AT&T",
          "Contenu": "The coverage is spotty. Many of my Apps do not work now.  I've been dooped."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T20:09:22.000Z",
          "Titre": "Service is not the best"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Greg Goodrich",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T15:18:27.000Z",
          "Titre": "Slow support service…",
          "Contenu": "Your support is very slow and usually takes multiple attempts to resolve issues."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Heidi Ferring",
          "Nb_Reviews": 1,
          "Date": "2022-04-22T00:44:28.650Z",
          "Titre": "I AM DONE!!",
          "Contenu": "I AM DONE!!! The first month with them I would have given them a 5 star hands down. As the months passed, it has steadily gotten worse and worse. My texts always have to be downloaded to read. My texts fail to send. Phone consistently acts weird. I'm not going to bore you with all the weird things my phone, my husband's phone, and my kids phones (who live across town) experience consistently. Just got home from traveling across the nation. Not able to call, text, use internet for over half the time. I'm so sick of this crap, I'm done!!! I don't care what the price is, when you can't use your phone, it's not worth it to me. I will be connected to Verizon or AT&T by tomorrow, I can guarantee you that! I came to patriot mobile with a paid off phone and an unlocked phone I bought from Samsung online. Like I said, it went from great, to horrible and all in between, in a matter of months. I'm done! There's a reason Verizon and AT&T are so big... they actually work!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dancing Peppers",
          "Nb_Reviews": 1,
          "Date": "2022-03-17T16:18:10.000Z",
          "Titre": "Avoid",
          "Contenu": "Avoid. Not ready for prime time. So wanted to give business to a conservative company...but these guys don't have it together at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dean",
          "Nb_Reviews": 5,
          "Date": "2022-06-06T19:44:52.000Z",
          "Titre": "The company is solid-BUT",
          "Contenu": "The company is solid. They have the same service as AT&T. The price was half of AT&T prices. All that was great. Easy to sign up and get a SIM card mailed. 5 star up to this point. NOW the issues start. The AT&T and other big companies give you a transfer # needed to switch over. It's good for 3 days. It takes 3 days to get the SIM card from Patriot. If it's a weekend transfer then note that they are closed on Sunday. Now you try to transfer the service and if you need ANY help then you are on your own. No one answers the phone. I emailed for 3 hours and only got confirmation that my request was received. I don't have 3+ hours for this. They need more help or a designated person for your acct that you only deal with them. They also could create an activation hotline. This is a major turnoff. Being ignored is frustrating. Now its 3 1/2 hrs trying."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jake",
          "Nb_Reviews": 2,
          "Date": "2022-05-29T19:47:03.000Z",
          "Titre": "Patriot Mobile: Not Ready for Prime-Time",
          "Contenu": "left Verizon to support a conservative company, only to find that I am left with no support options on a Sunday or Memorial Day. Occasional inability to send messages was an annoyance until this (2022) Memorial Day weekend (one of my busiest as a small business owner in a spring/summer tourist location) during which I have been unable to send or receive text messages (beginning early Friday evening) which are a staple of my appointment booking and rental confirmation procedures. As of today (Sunday), I have lost approximately $1200 in total revenue that normally funds my small farm operation for the first part of summer. I used the contact form on the website, thinking that at the very least it was monitored occasionally to address outages; sadly this was not the case.Back to Verizon, SIM on the way and transfer information provided. Sounds as though when I am able to call customer service, I want to have my new SIM in-hand and ready to go.I tried but, Patriot Mobile is not ready for prime-time or any type of business support."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James C. Missouri",
          "Nb_Reviews": 3,
          "Date": "2022-06-28T20:47:59.000Z",
          "Titre": "Throttling",
          "Contenu": "I was tired of laying $110 a month for ATT so aim on Patriot Mobile. I signed up for 10GB plan which is $50. After a week, I got a message saying I’d used 75% of my data. I had 5GB with ATT and never once got this message. My activity is same. Yes. I listen to podcast a lot when I’m out. But this is ridiculous. Called and got no help. Lady said, “Well you’ll get throttled”. The ATT guy, when I signed up said “You’ll never use 5GB”. He was right. With ATT. I’m SO upset."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Denise Harding-Driscoll",
          "Nb_Reviews": 2,
          "Date": "2021-04-16T00:13:12.000Z",
          "Titre": "STAY AWAY 3 months and have had nothing…",
          "Contenu": "STAY AWAY 3 months and have had nothing but trouble. Very limited service hours and they can never fix have to put in a ticket taking 24-48 hours. STAY AWAY"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Catherine Bird",
          "Nb_Reviews": 1,
          "Date": "2022-06-09T00:00:34.000Z",
          "Titre": "NOT A FAN, sorry",
          "Contenu": "Had AT&T since April 2022, but their reception was terrible, along w/their customer service. So, last week (May 17th) I switched to Patriot Mobile for their cheaper price. Paid $75 for the service + activation + taxes, and filled out necessary online paperwork to port my number over from AT&T. ATT sent me a text asking 'if it was me making the porting request,' and I replied 'yes.' Discovered early Friday, the porting did not go through, so called Patriot Mobile, and they set up a conference call w/them, me, & AT&T customer service. The only way AT&T would port my number was if Patriot Mobile canceled my order and resubmitted the porting request. After that mess was dealt with, I was eventually able to insert my new SIM card, but it only worked for about half a day. At 12:30 a.m. Saturday, my phone told me \"No SIM Card Found,\" and it's been that way ever since, despite notifying Patriot Mobile through email of the problem on Saturday, and asking them to send a new SIM card. Patriot Mobile \"customer service\" did NOTHING, until I told them, Monday afternoon (May 23rd) that I was shopping for another service provider. They told me they wanted me to buy a second cell phone, buy service for it, then CALL THEM to 'fix the issue,' with my original phone. They don't have people reading their customer service emails. They use bots for that. I just purchased service with yet another cellular service provider, and am hoping that, within another week, this nightmare will finally be over. These people only care about the $$$ you give them, not whether you have service or not.Direct to Patriot Mobile: I am NOT new to cellular phones, and my cell phone works great; it was only YOUR SERVICE that sucked (since you shut off my SIM card). There is NOTHING you can do to 'make up' for your refusal to act when I asked you to send a new SIM card; that's on you. I am happy with my new service provider, Consumer Cellular."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T01:03:06.000Z",
          "Titre": "Coverage not as promised",
          "Contenu": "The coverage that was promise  I have not seen that to be true."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lizzy Dee",
          "Nb_Reviews": 1,
          "Date": "2021-05-24T02:21:55.000Z",
          "Titre": "As a patriotic conservative American I…",
          "Contenu": "As a patriotic conservative American I really wanted this to work for us. I was paying $150 a month to AT&T and Patriot Mobile was charging me 108 for the same shirts. But from the day we started this process I had nothing but trouble withour phones. At first they gave us T-Mobile cards but we were not getting good service with them at all. So they sent me AT&T Sim cards. But when we put them in my phone would not work at all! And when we tried to put the T-Mobile Sim card back in my phone still would not come on although my husband’s did. I will say every time we called I spoke to an actual person who understood me and I could understand them. And they all tried to help! Customer service is not a problem. But for some reason they could just not get my phone to work. The T-Mobile Sim card turned the phone on but I was unable to send texts or pictures to several members of my family. We tried the process three times! But my husband uses his phone for work and I am disabled and need to have a usable phone. So after 2 1/2 months we went back to AT&T which cost me a lot of money! Very disappointing! I will say it took more than four days to get all three phones on my plan to work. Patriot Mobile cannot seem to break the contact with our phone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "D Francis",
          "Nb_Reviews": 2,
          "Date": "2023-07-31T14:45:53.000Z",
          "Titre": "Access to the internet",
          "Contenu": "Your coverage and speed to access the internet for my phone is awful. Although I support a cause to use  Patriot mobile instead of Verizon, Verizon never had this issue but Verizon is woke."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Hogan",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T15:23:37.000Z",
          "Titre": "Voice mail set up",
          "Contenu": "Why is it so hard to set up a voice mail?  Why do you not provide easy access and support for voice mail?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Black",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T16:55:40.000Z",
          "Titre": "I'm not receiving a signal well",
          "Contenu": "I'm not receiving a signal well, even when I have 2 or 3 bars of strength. won't load my data."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Loc Doc",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T07:51:52.000Z",
          "Titre": "Not up to par",
          "Contenu": "Moved from Verizon and expected similar service. Didn't happen. Would prefer to be a patriot customer but the service and support isn't there. Highly disappointed"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matthew Wood",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T15:43:41.000Z",
          "Titre": "Not easy to manage your plans",
          "Contenu": "Not easy to manage your plans. Forced to call in to do it. No mobile app from what I'm aware of."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KEESHOND LOVER",
          "Nb_Reviews": 7,
          "Date": "2021-11-13T21:01:22.000Z",
          "Titre": "BEWARE. THE CUSTOMER SERVICE IS NOT GOOD.",
          "Contenu": "UPDATE: I was finally able to reach a person at Patriot Mobile who actually offered to help me. Since I was still in a holding pattern with my previous provider and Patriot Mobile and had no phone service at all on that phone, I decided to go ahead and activate with Patriot Mobile after I was offered a free month of service. It really isn't a free month, since I had already paid the other provider for the month, and I lost that month since the number was ported. In any event, I have upgraded my review to 2 stars. Hopefully, as time goes on, this will be a good provider, but only time will tell. As a conservative, I wanted to support Patriot Mobile. I signed up and paid the fee. I had a trip scheduled to watch my grandson in his final college soccer game, and I began to receive emails telling me to activate with my new SIM card. Since I was out of state, I couldn't do that. I emailed the customer support email, apprising them of the fact that I was unable to activate until I returned home. I never received a response. Then, several days later, I received an email telling me they were going to start charging me, so I'd better activate now. I could see the writing on the wall that customer service (and customers) is not a priority with this company. I emailed and told them to cancel the order. More than a week later, they ported my number, and I was left with no service because I hadn't been able to retrieve the SIM card. I called the supposed customer support number. I reached technical support who told me that customer service didn't have a good phone number, but that there was nothing she (Jennifer) could do. Their system was going to charge me and port my number, regardless of my concerns or wishes. That's just how they do things. I contacted my previous provider, apprising them of the situation (that my number was ported despite my instructions to cancel the order). Hopefully, at some point, I will have service again. I have paid each of two companies for a month of phone service, and I have no phone service. I hope my previous company can straighten it out because Patriot Mobile is obviously not going to assist. I've specifically told them to cancel (for the third time) and not to charge my credit card again. We'll see what happens. I have a feeling it's going to be a long battle. Please be very cautious with this company and know that customer service is essentially non-existent."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MDan",
          "Nb_Reviews": 15,
          "Date": "2022-02-09T19:41:06.000Z",
          "Titre": "Not off to a good start",
          "Contenu": "Not off to a good start.  I don't mind helping good cause so I looked past several other monthly subscriptions.  I contacted Patriot Mobile and signed up on Thursday the 3rd 2022 (after Net10 decided to screw up my account after over 10 years of loyalty-thats another review).I told the gentleman of the urgency, but he said I should have the sim card in a few days.   I could wait two days, but I told him the phone was needed for two step authentication and I needed it asap.  On Saturday I had not yet received anything from Fed-Ex.  I contacted Patriot and found out they had not yet sent out the card.   They waited until Saturday to begin the process.  Almost 2 days later.  Nevertheless, I finally received a tracking number from Patriot and was advised the card would arrive on Tuesday the 8th before the end of the day.  In the meantime, I received what I would call a \"nasty gram\" from Patriot that said in a nutshell \" \"Our records show that your new Patriot Mobile phone is not yet activated\"  Per our Terms and Conditions, billing will start in 7 days...\"Computer generated or not, that wasn't cool to receive.  As if I was in violation and it was all my fault.  I immediately sent a response and never heard back.  Tuesday evening came and went and no card.  It was later that evening I received another email that advised me there was a delay.  Ya Think!  They didnt know this before 4:30 at the end of the day?  Patriot never contacted me and said a word about weather. I received a second email advising the card will arrive on Thursday at the end of day.  We shall see.I contacted Patriot Mobile. She said they could not help what the weather had done.  I agree.  BUT, if they knew the weather was a factor WHY didn't they mention this during step 1?   I could have found another option for a month and come back.I think the company has started out with crummy customer service.  They should offer a free month for the headache involved. But when I mentioned cancelling all of this b/c of the headache, she was ready to that immediately.  After all, I am just a number and could be replaced, right?  I gave two stars because of what the company does. Otherwise it should be a one star.Update 02092022- My sim card arrived unexpectedly. I was told it would not arrive until 2-10-22.  I was unable to activate my phone even after following the instructions sent through email.  I called Patriot Mobile.  The refused to help me unless I gave them the last four of my credit card.  I have spoken to them two other times since this headache began and verified who I was with no credit card.  Now they refused to speak to me.  I told her I dont need to talk to anyone. I just want to activate my phone.  Does it get worse?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kathleen",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T22:59:08.000Z",
          "Titre": "Most of the time my cell phone does not…",
          "Contenu": "Most of the time my cell phone does not work in my office or in my home"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Todd Todd",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T16:35:16.000Z",
          "Titre": "signal strength",
          "Contenu": "Service has been very bad as of late. Only 1bar"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Justin Nabity",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T05:36:18.000Z",
          "Titre": "Poor reception compared to my prior…",
          "Contenu": "Poor reception compared to my prior carrier"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "BAinCO",
          "Nb_Reviews": 6,
          "Date": "2020-11-24T16:58:18.000Z",
          "Titre": "Not Recommended",
          "Contenu": "They advertise as having no hidden fees, but only when you are ready to finalize your order do they mention an activation fee.I spent hours upon hours with a useless phone because the SIM activation would not work. There is no option for online chat and no way to send an \"emergency\" email.I decided to try my luck by sending a dm to their Facebook page. I actually heard from someone fairly quickly. At first I was told that a customer care rep would email me, but the person messaging me via FB ended up relaying between me and tech support for yet another several hours. In the end I had to do a factory reset on my phone in order to get the SIM activation to work. The FB message person did check with me a day or two later to see if things were still ok. The FB interaction is the only reason I gave two stars instead of one. So far my experience on the Sprint network is noticeably worse than on Verizon (was with them for years) with pauses and delays receiving data, despite living in the middle of an actual city.Honestly, if I could go back in time with the knowledge I have now, I would swallow the extra cost and stay with Verizon. Sad. Guess I will see how things go with Patriot for now, but it's like heading into a combat zone with that one dude you don't really trust. I really hated that."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2021-01-21T02:56:09.000Z",
          "Titre": "It's great if they ever get your phone working",
          "Contenu": "I'm glad to be supporting a company that believes the same things I do. I'm trying to switch my wife's and I's phones over to them. At first they sent out the wrong SIM cards but began the porting process on my phone before that was figured out. So they had to send out new SIM cards which took 3 days meantime I did not have a phone because they had already began the porting process from my previous carrier. Fast forward 3 days to when the new SIM cards finally arrive I was able to get my phone set up after being on the phone with them  for at least an hour. Then we start the process on my wife's phone. The lady says that the port had started and wanted to hang up with me and said that she would call back when the port had completed. That was around noon and I never received a call back and now my wife's phone doesn't work either. I've called them twice today and the first person I talked to was nice and said to confirm the account info with the previous carrier and to call back when I had confirmed it so they could try porting the phone again. I got the correct info which was the same as the info I had given them before and called again. This was at about 8:20 PM and customer service ends at 8:30 PM so I was trying  to get my wife's phone working before she had to spend another night without it. I was able to get in touch with someone who I assume was about to get off work and they made sure I knew that they were not interested in getting my wife's phone working and were very annoyed I called them. I was interrupted multiple times and after I had given him the same account info as I had already given them before he said it was updated and would port the number again. I asked what the info they had was before because everything I had just told him was the same as I had already given. The representative was very irritated at my question and said he couldn't tell me.  I had had enough and knew I wasn't going to receive any more help because it was approaching 8:30 PM and all the person I was on the phone with cared about was getting off the phone with me. This has turned into a nightmare and I regret ever trying to join patriot mobile. It's been over a week that we haven't had both of our phones working and from the service I've received I don't see these issues getting resolved anytime soon."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Josh K",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T14:36:53.000Z",
          "Titre": "Customer support?",
          "Contenu": "I don’t feel like customer support is very strong.  It’s hard to get answers and often I don’t get the follow up I’m promised.  I have 5 additional lines on AT&T that I want to bring over but I can’t seem to get a straight answer on cost but I’m pretty sure it’s going to be more expensive.  Maybe that’s why.  Also, the phone service is supposed to be Verizon but I often lack service when people who have Verizon can still use their phone.  The only reason I want to bring my other lines over is that I feel it’s the right thing to do."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mobile Automotive Diagnostics",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T03:46:52.000Z",
          "Titre": "The customer service representatives…",
          "Contenu": "The customer service representatives are very courteous and professional which is great but the actual phone service is not up to par. I have several phonelines and hot spots and have issues with all of them. Voice mail only works half the time and the hot spot with 22G data don't perform well at all."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Smith",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:26:23.000Z",
          "Titre": "Good phone & sms bad data",
          "Contenu": "I like that Patriot Mobile is a conservative company. The service is not even close to what I had with AT&T phone and text are about the same but data is slow and unreliable"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lana Strouse",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:28:56.000Z",
          "Titre": "Hello",
          "Contenu": "Hello, our phones don't work in many areas.  We live in skull valley, Arizona and the phones don't work right in town?  Our other phones worked in skull valley town.    They work in Prescott, Arizona in most places.  We bought those flip phones from you because our phones wouldn't work for you.  No cell phone works at the house, no reception for anyone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "George McDonough",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T18:05:53.000Z",
          "Titre": "The Negatives & Positives.",
          "Contenu": "To Whom It May Concern,My initial signing-up was a complete headache, lasted over several days. Also, wasn't very happy to see that your organisation had gotten political by siding with Israel. The companies name is \"Patriot Mobile\" not Israel Mobile. Can you focus your energies on all things America please? Now to the good part, I've been very pleased with the service and staff. I'm also paying less for getting more and that is greatly appreciated."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rolf Arands",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T16:16:41.000Z",
          "Titre": "Room for improvement",
          "Contenu": "I like the conservative support aspect of Patriot. (1) But, my phone has AT&T emblazoned on it nonetheless, a woke company.  That means I am basically a woke AT&T customer, right? (2) Changing plans with Patriot is absurdly difficult. I have to call and do it on phone, rather than through website as all other carriers do.  Overall I'm satisfied but wish improvement in these two areas."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bonnie Simmons",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T03:43:37.000Z",
          "Titre": "Customer service is great however the…",
          "Contenu": "Customer service is great however the service did not work for me.  It went out too much for me to be satisfied especially when traveling from one town to another!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "P. A.",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T16:13:21.000Z",
          "Titre": "I LOVE that Patriot Mobile supports causes I believe in",
          "Contenu": "I LOVE that Patriot Mobile supports causes that I believe in.  The service is pretty good most of the time.  There are times my husband, who is on a local network, has better service than I do, plus his plan is 64% less expensive than mine.  I don't believe the comparison is \"apples to apples\", but really the only reason I stick with Patriot is because of the support of causes I believe are extremely important."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Trudi Haataja and Irving",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T19:02:48.000Z",
          "Titre": "Wait time is long",
          "Contenu": "Hi! Once my son reached someone, everything was expedient and went very well.  But as is most often the case when dealing with phone companies, it took a while for him to reach and talk to someone; he became very frustrated and hung up. He tried again a couple days later.  But we really do appreciate speaking with English speaking people whom we easily understand! That's a treat after some phone companies who must hire help over seas help who are difficult to understand."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Catherine Cole",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T05:18:25.000Z",
          "Titre": "Don't understand why so expensive & it…",
          "Contenu": "Don't understand why so expensive & it keeps going up. Every month the payment is higher & if u r for the ppl, why does it have to be so much. Figure out a way to bring the cost down. If u r patriots & white hats, u could charge less. Don't be puppets to ur black hat puppet masters."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lori Pileggi",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T15:24:32.000Z",
          "Titre": "I would rate 3.5.",
          "Contenu": "I would rate 3.5.We have had a number of issues with the phones we purchased.  Had to change sim cards several times on both phones.  Frequent calls dropped.   The variety of phones available is small compared to other companies.  We like that you are a conservative company that support our values.  Customer service is excellent when we call for assistance."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Glenn Johnston",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T15:52:06.000Z",
          "Titre": "I LOVE WHAT PATRIOT STANDS FOR, MORE THAN THEIR SERVICE",
          "Contenu": "My reception is unpredictable.  I am on Verizon which used to be very dependable  when I was on their program.  It seems as though I am being throttled when I should not be. Honestly I received better all around service when I was with Verizon,  but support Patriot because of their beliefs. By the way, it is kind of satisfying to see the offers Verizon is making to try to get me back. Bunches of \"free\" stuff, with may stipulations in the small print."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles Perry",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:12:25.000Z",
          "Titre": "Raised the rates without notice",
          "Contenu": "Raised the rates without notice. rate increased a dollar and change for a couple of months, when I called customer support to find out why, they didn't know and couldn't give an explanation. I would prefer to be billed but customer service said they didn't do any business by US mail."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jamie Renninger",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:30:24.000Z",
          "Titre": "want local customer service hands-on.",
          "Contenu": "personally I have had great customer service. Unfortunately two people I know have not and they are very angry and don't want anything to do with Patriot Mobile. I feel blessed to use Patriot Mobile because of who they support. But there's no one in my local area to help me with my phone if there's a problem Verizon and T-Mobile can't help me or AT&T because I don't subscribe through them. Yet Patriot Mobile dings off there towers. I can't stand that we have to use them. And I want Patriot Mobile to create their own towers. Sincerely Jamie Renninger"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephen Harris",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T15:22:35.000Z",
          "Titre": "How About Good Reception?",
          "Contenu": "Patriot Mobile uses the AT&T and T-Mobile infrastructure. If you switch to Patriot Mobile and you have an T-Mobile phone, they might put you on an AT&T network. That happened me and my daughter and our phones wouldn't work in the house. I don't think the people in sales understand the concept, so expect to spend and inordinate amount of time with their customer service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles Stevens",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:40:23.000Z",
          "Titre": "First Amendment rights being taken away!!!!",
          "Contenu": "I cant help but feel my First Amendment rights are being taken away by the fact that my 5G is being powered down after a certain amount of data usage so that an average of 8-10 days a month during my billing cycle, I can't use my phone to listen or view conservative viewpoints due to this. Which means why doesn't Patriot Mobile stand up to the bigger powers in the cell phone industry and say no your not powering down our clients data. Unlimited data means unlimited data."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Starling",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:28:43.000Z",
          "Titre": "You can't talk to a human within a…",
          "Contenu": "You can't talk to a human within a reasonable amount of time.  You don't have international calling at a reasonable price.  When in Mexico you have to be in a WiFi zone for the so-called international service to work.  IF you are in the U.S. you service is okay, but for a businessman it is inadequate.  I intend to move to another carrier."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ronald Nelson Jr",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:01:55.000Z",
          "Titre": "Bullet Points",
          "Contenu": "I enjoy the fact that PM gives to charities I believe in as a Christian American but the cost needs to go down. My monthly bill has risen a little over $10.00 from my previous months with no explanation. My phone will say 5G and there will be no coverage. Some of my texts have been very late .It is also annoying that your company is not capable of wirelessly able to install Verizon on an iPhone 14 Pro Max.PM needs an app to be able to talk to customer agents and or pay their bill.Thank you,Ronald and Valerie Nelson"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rebekah Cornelison",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T08:48:29.000Z",
          "Titre": "I am pleased with the monthly service…",
          "Contenu": "I am pleased with the monthly service price which was my initial reason switching to patriot mobile but my cell data is almost non existent without Wi-Fi. If I can’t get better cell data I’ll have to switch back."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeffery Barrett",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T04:39:08.000Z",
          "Titre": "Carrier overreach",
          "Contenu": "Purchased ATT internet service for my home and noticed they included my cell service from Patriot in there billing system or MY ATT web portal?  Non issue normally but noticed after canceling home internet after 60 days and owing ATT 6$ ( fictitious charge btw) my cell service became extremely slow and began dropping calls.  After a lengthy discussion with ATT customer service, they removed the charge and magically service was back to normal.  I have to question in my case if Patriot is my provider with an ATT sim? Seems as though this may not be the case and gives concern over privacy.  At minimum service should NOT be impacted for 3rd party providers? Fully aware that privacy is impacted no matter the provider, but I pay Patriot Mobile, not ATT for my cell service.  Patriot should look more closely at this and provide lawful protection against this corporate overreach."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dub C",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T16:50:21.000Z",
          "Titre": "EXCELLENT SERVICE but high price.",
          "Contenu": "I like the “idea” of this service. However it is probably 40% more than the other providers if you compare data available to the cost for said data. How about you stop “giving a percentage of each dollar to charities” and lower the cost of the service. I don’t mind paying a bit more to have a US Only based customer service. But the data on my plan isn’t even close to what I COULD get with another provider. This has to change or I will HAVE to switch to another provider. Good service, every time I’ve had to deal with customer service it has been excellent. But I can’t afford $180+ a month (32 gigs TOTAL data COMBINED over 5 lines) when as a Veteran I can get 5 lines , unlimited data for $125 a month with the same service company I get with Patriot Mobile. I WANT to stay but the cost has already gone up $20 (same data) since I started in 2020. I can’t continue to do this in this economy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chasey Mitchell",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T19:06:04.000Z",
          "Titre": "Your pricing is higher than most now",
          "Contenu": "Your pricing is higher than most now.  Your currently using AT&T (which I don't like to support) as the carrier. I really don't see the benefit in having the service. Sadly, I'll be shopping."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dave Brinkhaus",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:33:36.000Z",
          "Titre": "The only thing that’s changed with…",
          "Contenu": "The only thing that’s changed with patriot is the price going up shortly after I joined. Lots of dropped calls, 10gigs of data for the price of others unlimited(high speed).  Excellent customer service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joshua Pfeifer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:39:49.000Z",
          "Titre": "Unlimited plan sucks",
          "Contenu": "In my opinion the service sucks. For instance I have unlimited everything but get throttled on data every month. If I have unlimited that means no restrictions so I should not be throttled. What’s the point of paying for unlimited if it’s restricted, might as well save money and buy restricted data."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lynn",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T16:15:51.000Z",
          "Titre": "Love the basis of the company and…",
          "Contenu": "Love the basis of the company and knowing my money is being used for things I support. Staff is kind. What doesn’t work for me is the international plan. You have to call each month on the exact day to continue it, which is a hassle when you are out of the country. And my experience is it does not work, at least not in South America. Patriot did refund my money, so that is fine, but we travel a lot and I am dreading having to buy a phone each time I travel. I am hoping they get this part figured out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Scott Marler",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T03:38:34.000Z",
          "Titre": "I don't appreciate throttling.",
          "Contenu": "I don't appreciate the monthly throttling of service, even though I've supposedly got unlimited data and text."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patrick Norris",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:25:01.000Z",
          "Titre": "Waiting was annoying",
          "Contenu": "Waiting was annoying. I still need to find a phone, I think.  To your credit, last time the person suggested bulbs and batteries.  I stopped in and they found something on the wall that worked. The NUU battery had swelled, they said. I am talking again. Usually your service help is effective, so I was willing to wait. My son had to go to work, so after a loooong wait, he took his phone and left."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michelle W",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T21:51:43.000Z",
          "Titre": "I love what it stands for",
          "Contenu": "I love what it stands for and that my money is going to causes that support my values. Thank you.I think reception is not as good as the bigger phone service co we had before. Also we would love the option to lease to buy phones like the new iPhone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patric McConnell",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T14:38:58.000Z",
          "Titre": "Coverage is not up to par",
          "Contenu": "Coverage is not up to par. Advertised to be using same towers but really don’t. My wife constantly complaining about lack of service pretty much most of the time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T17:39:12.000Z",
          "Titre": "Getting a hold of someone in customer…",
          "Contenu": "Getting a hold of someone in customer service was impossible last time I tried. Your phone service itself was good. But customer service truly needs improvement"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michele",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T03:37:51.000Z",
          "Titre": "I wish you had a discounted rate",
          "Contenu": "I wish you had a discounted rate for people who only have your phone for emergencies. It's off 100% of the time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T22:44:09.000Z",
          "Titre": "Hoping the service gets better",
          "Contenu": "My husbands phone has never been able to make or receive a call, I very rarely get to do the same, Im not sure why the towers cannot send us our calls. It is not good. We stay because they said the service would get better but nothing yet"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bob Schmitz",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T15:21:01.000Z",
          "Titre": "Bill pay has to be worked on",
          "Contenu": "Bill pay has to be worked on.  I paid a $2000 bill to TBK bank with an account number attached.  It took 17 days to get there after I initially paid it.  Came out of my account on 11/27, you sent it on 12/4, got there 12/14.  Unacceptable.  Electronic transfer would be best."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T01:35:10.000Z",
          "Titre": "Im all for a conservative platform",
          "Contenu": "Im all for a conservative platform. My cell service hasnt been that great. Very frustrating when i deal with customers constantly…"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shawn Roberts",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T15:20:16.000Z",
          "Titre": "My bill went up",
          "Contenu": "My bill went up. Naturally, I'm happy about that. When I called to ask why the agent wasn't sure why, however he was friendly and professional."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roger Fernandez",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T16:36:37.000Z",
          "Titre": "Incomplete service",
          "Contenu": "Ever since we switched to Patriot Mobile, we can not receive pics and images through our texting app.  Pics have to be emailed.  We did not have this problem before."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Suppes",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T11:47:05.000Z",
          "Titre": "Want to get another phone but your…",
          "Contenu": "Want to get another phone but your choice is very limited. Have a flip phone presently and am very dissatisfied hate to go elsewhere/"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christine",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T20:08:19.000Z",
          "Titre": "I tried several times to pay forward…",
          "Contenu": "I tried several times to pay forward but website or phone call did not work.  Otherwise your service and communications are excellent.Christine Sandifur"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Austin Williams",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T15:38:14.000Z",
          "Titre": "Thottle speed is so slow that MAPS won't work!",
          "Contenu": "Service works but the data cap before the throttle mark is too low, and when you shut down it is so slow that MAP doesn't work causing a dangerous situation for my wife and me as we travel into the big city without a clue of where we are if MAPS can't function!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "NA",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:54:13.000Z",
          "Titre": "ALl of a sudden my phone is missing…",
          "Contenu": "ALl of a sudden my phone is missing calls and text messages. I really need it to stop and work like it did for the fist yearthat I had it. PLEASE HELP!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SamPhan Radcliffe",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:47:10.000Z",
          "Titre": "I like the fact they represent my…",
          "Contenu": "I like the fact they represent my Vhridtian values but the plans are expensive for the amount of data."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Lamb",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T15:51:09.000Z",
          "Titre": "The issue I was experiencing was going…on for many months unnecessarily.",
          "Contenu": "The issue I was experiencing was going on for months and despite several attempts and inquiries by both email and phone to customer service, nothing was ever resolved until now. A resolution was found this time but it took much too long and no credit to my account was made even though our service was very spotty and inconsistent until now."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Willard Vogelgesang",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:43:04.000Z",
          "Titre": "I got my 10.00 discount for December…",
          "Contenu": "I got my 10.00 discount for December 2023 according to my e-mail but didn’t get it. So I hope I get this off maybe next month I just don’t want to get on the phone and go over this again it’s my last discount."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Pederson",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:07:46.000Z",
          "Titre": "Price is high",
          "Contenu": "Price is high. We are on a limited budget. We are paying almost $100 per month."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason Rains",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T14:41:58.000Z",
          "Titre": "Give it a 2",
          "Contenu": "Give it a 2. Patroit mobile app Is horrible. Until you fix that you get 2"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JD",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:49:34.000Z",
          "Titre": "Don't like the unwanted texts and…",
          "Contenu": "Don't like the unwanted texts and emails about causes etc. Have to keep unsubscribing and 'stop'ing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Edwards",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T14:09:25.000Z",
          "Titre": "the at&t sim card worked but only had 2…",
          "Contenu": "the at&t sim card worked but only had 2 bars in Millers creeks NC. Do you have a Verizon Sim card I can try?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Darrell",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T14:39:10.000Z",
          "Titre": "The cellular part is good but",
          "Contenu": "The cellular part is good but my Hotspot and Wi-Fi doesn’t work when I leave my home."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Martha Hatcher",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:16:49.000Z",
          "Titre": "There are areas where we cannot get a…",
          "Contenu": "There are areas where we cannot get a signal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T19:52:08.000Z",
          "Titre": "4 times trying to contact Custer…",
          "Contenu": "4 times trying to contact Customer service by phone and email. No response."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jack Dreznes",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T23:19:49.000Z",
          "Titre": "International roaming was not explained…",
          "Contenu": "International roaming was not explained properly and I ran out of data before my trip ended"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Darrell Fletcher",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:10:21.000Z",
          "Titre": "Bad reception",
          "Contenu": "I like what you do for the country and the price isn’t bad but the reception is bad"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cheryl l Woodring",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T14:40:29.000Z",
          "Titre": "Great company but I don’t appreciate…",
          "Contenu": "Great company but I don’t appreciate automatically debiting my account for payment especially when I didn’t give authorization. My bill was only posted for 3 days before it happened.  I always pay my bill on time and I was specifically waiting for payday before I paid it. This automatic deduction whenever you felt like it overdrafted my account because it was unexpected."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Gilligan",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T18:21:04.000Z",
          "Titre": "Service not so Great.",
          "Contenu": "I like the idea of supporting an American Company with conservative values. I live in NY, Long Island region and I am not impressed with the service. I have the Top individual plan and I seem to exhaust all my data in a week. After that the phone is useless. I might have to go back and maybe try T-Moble. I never had an issue with the other carriers. Is it because Patriotmoble is piggybacking off there services?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Crabb",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:40:12.000Z",
          "Titre": "Ok customer service",
          "Contenu": "Ok customer serviceNot sure of plan and expenses"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Larsen",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T01:59:22.000Z",
          "Titre": "great for mobile calls but not…",
          "Contenu": "great for mobile calls but not accessing podcast"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Guest",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T14:55:46.000Z",
          "Titre": "As a Veteran I believe in Patriot…",
          "Contenu": "As a Veteran I believe in Patriot Mobiles charter of America First and sticking to our Constitutional Republics founding.  However, because we have aging parents, reliable connectivity is a must.  I feel like we got throttled at the wrong time so I had change back to my previous carrier even though I hate what they support, socially."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sandi Lopez",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T23:19:13.000Z",
          "Titre": "We went to Patriot mobile from ATT…",
          "Contenu": "We went to Patriot mobile from ATT because we didn’t want to support woke agendas. With that said, our cell service has never been great with Patriot Mobile. We have a difficult time finding coverage. On a positive note, the staff at Patriot are available and friendly when you have an issue that needs to be resolved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Audino",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T16:20:17.000Z",
          "Titre": "Many poor connections",
          "Contenu": "Many poor connections, broken calls."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael M",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T20:35:26.000Z",
          "Titre": "Service is same as att",
          "Contenu": "Service is same as att. Paying $10 more per month for that. Leaves me a little puzzled."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bobby Tee",
          "Nb_Reviews": 3,
          "Date": "2023-09-15T15:34:32.000Z",
          "Titre": "I love Patriot Cell Service but the…",
          "Contenu": "I love Patriot Cell Service but the cell phones are not in line with the company’s Mission Statement and goals.The cell phones require a non-private Google account to download applications.I would rate Patriot Mobile much higher if a phone was provided that did not require a Download Manager such as Google or Apple Store that lets Patriot Mobile Customers control their own apps.Thank you and “Semper Fi”"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "justin Turney",
          "Nb_Reviews": 2,
          "Date": "2023-07-31T15:52:07.000Z",
          "Titre": "The service is decent.",
          "Contenu": "The service is decent. The internet speeds are very low for LTE or even 5G services. They run about 50mbps where most mobile Internet is well over 150mbps. Overall I’m happy to be supporting conservative causes but the overall service seems to still be developing but adequate."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tim Barczak",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T00:37:02.000Z",
          "Titre": "I think there could be a more seamless…",
          "Contenu": "I think there could be a more seamless interface for users that may want to purchase or replace a phone. Ex: If I log on and choose to shop for a different phone as an upgrade that the application knows it's me and the prompts wtih \"Do you plan to replace and existing phone or add another line.\" and based on that answer make appropriate changes . My experience is the it wanted to look up my number to see if it is available. My thought it is not needed. I hope I explained clear enough to be helpful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kerry Pelkey",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T23:30:41.000Z",
          "Titre": "My bill is never the same",
          "Contenu": "My bill is never the same 53 one month 56 the next."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DOUGLAS CARLSON",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T20:58:56.000Z",
          "Titre": "We received an extra bill For $17.04 with no explanation.",
          "Contenu": "We received an extra bill For $17.04 - with no explanation or reason for charge. We tried to call but were unable to get a live person?Otherwise, we are happy with Patriot Mobile service and their support."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Virginia",
          "Nb_Reviews": 2,
          "Date": "2023-07-31T15:57:08.000Z",
          "Titre": "Not happy",
          "Contenu": "My rating is based on a combination of response to questions and the device Samsung S23. When I reached out concerning a technical issue, I only received an automated response, never an actual response from a representative. I had to submit two requests before the voice-mail issue was resolved. I don't like the S23 at all. It doesn't connect automatically to my home Wi-Fi even though that feature is selected. The volume buttons are awkward to use and taking a screen shot is almost impossible due all the buttons being on the same side. Not happy, May switch back to straight talk."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "N. MCKNIGHT",
          "Nb_Reviews": 2,
          "Date": "2023-07-31T22:10:44.000Z",
          "Titre": "Heading in the right direction but a ways to go to get there!",
          "Contenu": "I love the values of the company. I like the customer service response compared to other carriers. However, I cannot make a call from Canada unless I add $27/month to have international calling added. And, even with that, it does not have coverage as good as other carriers. Texting has been very intermittent even at home. Sometimes it works and other times it does not. Doesn't matter if we are on wifi or not."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Belinda Lacey",
          "Nb_Reviews": 2,
          "Date": "2023-09-17T05:32:26.000Z",
          "Titre": "The only issue I've had with Patriot…",
          "Contenu": "The only issue I've had with Patriot Mobile is when I switch my service to them from Metro PCS and my voicemail service went from English to Spanish and customer service could not help me. It took a little over a week for me to do the research myself and I finally found the information I needed to do the switch myself.I've had not other issues with Patriot Mobile."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gary Yeck",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T16:51:47.000Z",
          "Titre": "The problem I had was voice mails were…",
          "Contenu": "The problem I had was voice mails were not showing up. I spoke to several different individuals over the course of a few weeks. I even communicated with your second level support. They did not end up solving the problem.  Eventually I was sent a new SIM card for a different provider. That seems to have worked."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gregg Butkewicz",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T22:20:11.000Z",
          "Titre": "I have called several times about your…",
          "Contenu": "I have called several times about your website not allowing me to print a bill with my name and service dates for each month. I will be logged in, but when I place the cursor over the \"print bill\" button, a symbol of a red circle with a slash thru it, meaning no can do, pops up. I was told it would be resolved  but as yet it is not. My employer pays my phone bill and they are getting tired of asking me for a bill which clearly states my name, the billing period and the amount. I understand their request. Please help me out with this."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matthew Joyce",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T15:35:08.000Z",
          "Titre": "Not as good coverage as Verizon."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "larry",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T04:13:14.000Z",
          "Titre": "Your coverage area needs to be better",
          "Contenu": "Your coverage area needs to be better. Since coming to Patriot mobile I've  experienced less phone service than with Verizon.  Probably 20% more dropped calls or no service at all in areas I used to have service with Verizon. However, your customer service has been good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Peter Foster",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T18:56:50.000Z",
          "Titre": "Slightly higher cost and worse Internet service than AT&T",
          "Contenu": "I have service through AT&T and I’ve got AT&T service through Patriot Mobile for my wife. She does not get as good Internet service as I do even though we’re both supposed to be through AT&T. Additionally, Patriot Mobile cost slightly more than AT&T for the same service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Earl",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T15:55:45.000Z",
          "Titre": "Mixed results.",
          "Contenu": "I like the customer service. Still having issues with connections at times. Price is not as competitive as some other companies. It was very frustrating when I was in Mexico. The international sim card works better than the standard sim cards in the US."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Laura elias",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T15:36:12.000Z",
          "Titre": "I support your cause and values which…",
          "Contenu": "I support your cause and values which is a major reason why I switched to Patriot mobile. However, the actual cell service is not great. It’s not very reliable and a lot of my calls have been dropping and text messages are delayed in receiving."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Constitutional Chris Burleson",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T20:37:09.000Z",
          "Titre": "Never able to text since switching to Patriot.",
          "Contenu": "We are unable too text since switching from Verizon over 6 months ago.  Because we are using Verizon towers, they have found a way to disable text, but Patriot knows nothing about it, and will blame it on the fact that our phone is not new, which is a convenient excuse, but not the real reason."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Timothy Machelski",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T16:56:15.000Z",
          "Titre": "I have more issues with good service at…",
          "Contenu": "I have more issues with good service at my home than I did with AT&T.  My family would have all converted to Patriot Mobile by now but they do not want to experience the issues I have had.  They support the Patriot Mobile concept and conservative values but can't get past the service issues."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Finn Simmensen",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T02:27:12.000Z",
          "Titre": "BAD, then GOOD: ask for troubleshooting!",
          "Contenu": "BAD, THEN GOOD.BAD: Ported iPhones from AT&T and swapped SIMs Nov. 21, 2022. No activation. Repeated calls, repeated fails for > 24 hrs.GOOD: JASMIN was thoughtful enough to run the troubleshooting protocol on Nov. 22 ~ 6:10 p.m. The damn ICCIDs on file were wrong. Corrected. Activated in 5 min. The earlier reps didn't troubleshoot. Duh! So always ask about the troubleshooting protocol."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Central Texas customers",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T20:23:12.000Z",
          "Titre": "Great company, not great service in our area",
          "Contenu": "We love support this company but we don’t get great coverage where we are. Sometimes we’ll have full bars and not really get service. We have kept our account but would love for it to be better in our area."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Russ",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T17:03:32.000Z",
          "Titre": "Poor quality flip phone",
          "Contenu": "First, I am very happy with the company as a whole, and the coverage.  Initially my coverage was poor, but I was given better coverage by using Verizon towers.  My only real issue is the poor quality of flip phone in the NUUF4L.  The buttons are very hard to push correctly, and many times what appears on the screen when texting is nothing like what I typed.  The phone is very difficult to learn, since no instructions are included.  I end up having to hunt and peck to find out how to do something.  I will have to ask one of my grandchildren to show me how to use it!  Why not get rid of this phone and try a Kyocera or some better flip phone?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kamal Shouman",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:53:00.000Z",
          "Titre": "Costs are kind of high",
          "Contenu": "Costs are kind of high.  Need to work to reduce them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sam Fox",
          "Nb_Reviews": 3,
          "Date": "2021-10-31T16:34:49.000Z",
          "Titre": "Patriot Mobile not that good",
          "Contenu": "Like many  others, decided to switch to Patriot Mobile, for political reasons.  Now, having issues with FedEx delivering my SIM card for the last week.  Sent at least 4 emails to support.  After not receiving a single response, decided to call Patriot.  Talked to a nice but robotic person who not only didn't apologize for not responding to my emails, but also told me to go to FedEx and pick up my SIM.  She was not willing to actually help.  Have also learned that Patriot uses T-Mobile towers, so what's the point?  Patriot Mobile may have good intentions, but \"customer service\" dept lacks competent management."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christy",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T07:01:32.000Z",
          "Titre": "I still cannot get on your app",
          "Contenu": "I still cannot get on your app, it doesn't work Also, I finally got voicemail set up , but there is nowhere to tell me that I have a message, so sometimes I don't get them for days on end!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Holly Harris",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T17:14:23.000Z",
          "Titre": "I’m still having trouble getting my…texts and phone messages without being delayed several days",
          "Contenu": "I’m still having trouble getting my phone messages on the same day, one week delay. Text message are delayed as well. Not sure what is happening but I called twice to report and still has not been corrected"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff Novak",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T23:04:12.000Z",
          "Titre": "Customer service is fine but they",
          "Contenu": "Customer service is fine but they, apparently, throttle data / speeds.My previous carrier was better as it pertains to data.Patriot is slower and less reliable.Donating to conservative causes is better received when the service excels.I am moving towards switching back."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "FRANK POLLINA",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T14:59:40.000Z",
          "Titre": "It was advertised as using the top…",
          "Contenu": "It was advertised as using the top rated towers and the the same great service.I don't get even 4g in the Chicagoland area. cell phone wont work in the lower level of my building as the signal is at the lowest it can be."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Arlyce Perkins",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T03:00:33.000Z",
          "Titre": "I switched one phone to patriot mobile…",
          "Contenu": "I switched one phone to patriot mobile due to their name and saw they supported Christian and patriot venues!  I am considering switching the phone back due to AT&T being the cell provider?  I would never intentionally use AT&T!  What’s up!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bruce",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T07:24:11.000Z",
          "Titre": "I just signed up with this service and…",
          "Contenu": "I just signed up with this service and it has been a struggle. It took over a week to get my service working. But let it be known, when ever you start a company like this there will be bumps in the road. If we stick together we can defeat the enemy who is trying to destroy our country and lives. Freedom was battled for with the blood of men. This new aged war has to be won at a spiritual level. Exercise patients if you value the ideals that this company stands for. If not then stick with the woke clan"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patrick Jaconette",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T00:10:53.000Z",
          "Titre": "Great people, doing the best they can.",
          "Contenu": "Great people, every single one of you! I mean that.But you have bad tools! Every time anything was wrong it was \"someone else's fault\".Didn't want a 1st of the month due date so I hired you 3rd week of the month. The very next bill you adjusted to....1st of the month, NOT YOUR FAULT, AT&T did it.You use FEDEX, worst in the business and when they screwed up, NOT OUR FAULT CALL FEDEX.Service stopped, call APPLE or AT&T, but someone else. I call AT&T and it transfers me to YOU, NOT OUR FAULT AT&T's issue.Can't go 2 months without something going wrong so, I fired AT&T, APPLE, & PATRIOT as the only common denominators! You 3 sort it out! I'll let you know if my issues continue with Samsung & Verizon."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bruce L.",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T00:52:05.000Z",
          "Titre": "You need an app",
          "Contenu": "I wish you had an app instead of having to use the Internet website. You’re still expensive for your services, especially without an app, but I get that I am supporting conservative Christian values through your company."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valerie Schultheis",
          "Nb_Reviews": 2,
          "Date": "2023-08-22T06:19:53.000Z",
          "Titre": "I LOVEPatriot Mobile but there is NO…",
          "Contenu": "I LOVEPatriot Mobile but there is NO 411 to get phone#’s for businesses or residents. I would appreciate this feature coming to Patriot Mobile soon! Thank you for your kind consideration!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Whitney Wada",
          "Nb_Reviews": 4,
          "Date": "2023-07-31T15:55:50.000Z",
          "Titre": "My phone was SO slow last cycle",
          "Contenu": "My phone was SO slow last cycle.  I need to call customer service. I've never experienced that with another company."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T00:59:32.000Z",
          "Titre": "Person that setup our jet pack forgot…",
          "Contenu": "Person that setup our jet pack forgot to close the port and we have to pay an extra months fee to verizon an was unable to help with transferring contacts to new flip phone Other than that the process went well."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Liberty Mobile",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T18:40:40.000Z",
          "Titre": "The service is still scattered a bit",
          "Contenu": "The service is still scattered a bit. Places I’ve had great service with is now little to none. But, I am happy to be a part of a Conservative, Christian company."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sean Bolton",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T18:45:20.000Z",
          "Titre": "Need better coverage",
          "Contenu": "Need better coverage, if it was not for wifi I would have switched back to version. Am not sure why but pick up from towers is terrible."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Lesperance",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T14:42:25.000Z",
          "Titre": "My service is not that good you gave me…",
          "Contenu": "My service is not that good you gave me a bad service provider I didn't realize I was dealing with children"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian Hausknecht N-Five-UNB",
          "Nb_Reviews": 1,
          "Date": "2021-09-21T00:32:08.000Z",
          "Titre": "Good company, but Substantial Growing Pains and Billing Issues",
          "Contenu": "Good company, but has growing pains.  Cell service is fine and they were very helpful when the Sprint sale affected their cell service in rural Texas (switched me to the AT&T backbone).  But I have had continued problems with the billing.  Discounts are not applied correctly despite multiple calls to get the discounts corrected. This problem has reoccurred for several months.  Hope it is corrected in the next cycle.  Also have problems with the billing process itself.  They bill a single line charge for each month, with no breakdown of what makes up the monthly charge, so I cannot easily review the bill. Even though the email says to go to the website for details, the website says the bill breakdown is NOT AVAILABLE UNTIL THE FOLLOWING MONTH!  What other service does not allow you to review your monthly bill until a month after you pay that unsubstantiated amount?  None that I know of.  Finally, I was promised by a supervisor \"Harold\" to receive a call back from their billing manager \"Rodney\" about the above billing issues.  But to date I have never received a call back (I have google voice to capture any voicemails so there was no attempt to contact me).  That is disappointing.  I want to support and recommend a conservative company like this, but they have serious growing pains to address."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony Edwards",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T15:14:40.000Z",
          "Titre": "The monthly price keeps inching…",
          "Contenu": "The monthly price keeps inching upwards.The app doesn't load even after reinstalling."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Humberto Carsales",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T16:31:51.000Z",
          "Titre": "The internet speed is slow all the time.",
          "Contenu": "The internet speed is slow. I have to used a hotspot all the time because I ran out of Gs even with the hotspot on."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brenda Arnold",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T20:55:19.000Z",
          "Titre": "NOT happy with new phone or your service",
          "Contenu": "I have been a Patriot Mobile for about 7 years. Have Not had any problems UNTIL Recently. I am Very Unhappy with this service and am about to switch to a new carrier if I can't SPEAK with a LIVE Customer Service Rep TODAY!  I recently bought a Android Phone. I spoke LIVE with a cust. svc. rep.. I was considering 1 of two phones. A Samsung or a Motorola. The rep suggested the Motorola. I did not start using my new phone until this past Sunday. My Grandson set it up for me. I just today realized that I was sent the Samsung. I did NOT Purchase that one. Also I do NOT know how to use & don't have anyone to teach me. I want to send it back asap & get the new Flip Phone instead. HOWEVER. I have tried at least a dozen time today to reach customer. I dialed 611 several times but it would not connect me to a rep. I got message about not being a good number. I do not want to speak with a computer or messenger. I want to speak with a live person. TODAY! If not I will go to a new provider today!  I can't express to you how stressful & frustrating this has been to me. I used to love your cust. svc. I told everyone I knew to use your service. But you have changed. I don't feel like I can get cust. svc. any longer. Brenda Arnold"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Pettingill",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T07:01:08.000Z",
          "Titre": "Nobody is perfect",
          "Contenu": "Nobody is perfect. The most troubling aspect is the signal in rural areas with regards to specific carriers.It’d be nice to be able to use whatever tower is nearby as I’ve heard another carrier has this ability. Also it’d be nice to finance's and insure through Patriot did in the old days. A few bad patrons shouldn’t spoil a good thing for the whole group."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CT",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T03:50:23.000Z",
          "Titre": "I really like Patriot Mobile",
          "Contenu": "I really like Patriot Mobile and knowing I'm supporting great causes.  The only negative experience I've had is that sometimes I don't get my voicemails in a timely fashion.  I am assuming it is an issue with Patriot Mobile as I have never had this happen before.  The longest has been about 15 hours before I received a voicemail that was left."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles Dugan",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:45:23.000Z",
          "Titre": "The Illusion of 5G speeds...",
          "Contenu": "Great use of customer resources to maintain customer satisfaction.  But, why, why, why is there a cap and limit on data?  Why does it make any sense to promote \"5G speeds\" when those speeds become slower than dial-up as soon as the data cap is reached?  (3 weeks if I am cautious)  The internet, videos, pictures, and more are not getting smaller, and the direction should be to provide more and more data to access the internet.  I have called and asked several times for an explanation, which none has been given.  Logic dictates that since not everyone will use all their data there should be plenty to spare for everyone without any throttling.  This lack of response erodes any trust I have in your organization and will lead customers to find a better service provider.  Just let me know how I can help you do better.  Who is standing in your way?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CMC",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T21:50:36.000Z",
          "Titre": "Switching to patriot was great decision!",
          "Contenu": "Switching to patriot mobile was very easy. Because I live in the in a rural area, coverage is spotty and not as great as the big carrier I came from but overall the service just as good as the big carriers"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas D.",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:21:42.000Z",
          "Titre": "I have very reliable coverage…",
          "Contenu": "I have very reliable coverage and the consistent pricing keeps me firmly on Team Patriot. The causes you support are in line with what I believe as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lydia Marie Farmer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:24:00.000Z",
          "Titre": "Trust is very difficult to come by",
          "Contenu": "Trust is very difficult to come by, nowadays, no matter what the connection is. So even with an individual getting to the point to where he or she can trust a corporation, like Patriot Mobile---even though you're not an AT&T or a Verizon or a Sprint---you're still a corporation. You're still \"corporate\" and the trust that we individuals (many of us) used to have with our American corporations---has been all but decimated. It's really sad. So, it's gonna take me time, as an individual, to trust you, as a company. This is especially to trust you as a company that values God, family and country. Even in that realm (governmenal leadership) we have been completely disappointed. Inside of just about all of the connections we can have with other human beings is gonna take prayer and---within God's Grace---a lot of work. That's for you corporate entities as well as for us everyday individuals. It's gonna take time to rebuild trust in America."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patricia Shifflett",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T18:03:53.000Z",
          "Titre": "Patriot Mobile when I signed up",
          "Contenu": "Patriot Mobile when I signed up, gave me the worst cell tower in my area without giving me the option to choose which cell tower, out of the 3 major towers, T Mobile, ATT and Verizon. They chose TMobile for me knowing it was the minimal coverage in my area. I had to call them back, wait for a new sim card to Verizon, call to have it activated a couple of times. It wasn't as easy to sign up for as they make it out to be."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jay Horn",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T13:09:17.000Z",
          "Titre": "Thanks, Patriot Mobile",
          "Contenu": "I am very glad Patriot Mobile is a company with responsible, positive family values. It is great to have an alternative to the woke values that seem to permeate most other companies. Keep up the good work!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Connie Long",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T18:01:41.000Z",
          "Titre": "It took me several calls to get this…",
          "Contenu": "It took me several calls to get this situation. Resolved. But we finally did it and now I am satisfied was very frustrated to begin with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carroll Johns",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T19:00:47.000Z",
          "Titre": "I’m a patriotic person, so I love your service",
          "Contenu": "Normally, the service is just fine once in a while I don’t get a very good signal when I’m traveling depending on where I’m at. I really wish you guys had an international phone plan. I travel often and before Patriot Mobile I had Verizon, which has a pay as you go. International phone plan, or you can buy a certain amount of time etc. if you guys had that it would be perfect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mr. Robin Carter",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:02:15.000Z",
          "Titre": "Professional",
          "Contenu": "Professional, courteous assistance in the setup process; the ability to choose from the three major carriers and change without a fee; and finally, the Christian foundation and donations underpinning the company's entire operation. The only problem was several different employees had no idea of the \"download speeds\" of your service at the various data plan levels. I had to go through several employees in different sections of the company before someone was knowledgeable and able to answer that simple question. All front-line agents need to be trained in this basic customer question. Other than that, excellent! A blessed holiday season to you all...!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Darrin",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T18:36:58.000Z",
          "Titre": "Money Well Spent",
          "Contenu": "I just love the fact that my money isn't going to left-wing agendas. Still, the service areas could be improved, but that may be due to the tower placement by T-Mobile. AT&T does not work at all at my home, and those were the only two choices available when I first set up service with Patriot Mobile. Overall, I am satisfied."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sara Raiter",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:07:33.000Z",
          "Titre": "I like the idea of Patriot mobile",
          "Contenu": "I like the idea of Patriot mobile. I like not giving money to the problem. We do notice that the service isn’t performing as well when we’re not at home."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Douglas Noyes",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T17:04:43.000Z",
          "Titre": "Customer Service leaves something to be desired",
          "Contenu": "A few years ago my phone, which was purchased from Patriot Mobile, failed. When I called Customer Service, the agent couldn't have cared less, but was quite eager to sell me a new phone. His attitude rubbed me the wrong way, but I wanted to stick with a patriotic company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rose Carey",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T03:24:01.000Z",
          "Titre": "The phone works very well",
          "Contenu": "The phone works very well, especially when our power is out. Text messages don't download all the time, we have to go outside the house"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Hollifield",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T04:20:41.000Z",
          "Titre": "I like what patriot mobile supports",
          "Contenu": "I like what patriot mobile supports. However, if patriot mobile changed it's billing policy to let it's customers pay at their convenience instead of auto drafting, I would be able to give you 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "FCM",
          "Nb_Reviews": 7,
          "Date": "2023-12-14T14:38:04.000Z",
          "Titre": "I love the friendly Christian support I…",
          "Contenu": "I love the friendly Christian support I get from Patriot. They make me feel like family and not just another customer. My coverage is good using ATT towers. My house has little coverage. I think it is because of the Navy landing field in close proximity. Maybe someday it will get better. The price is reasonable and I like Patriot support of Constitutional American values."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Brunner",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:08:00.000Z",
          "Titre": "customer service is great",
          "Contenu": "customer service is great. It started with Suzie Whitman when I signed up. she talked me through the entire switching process. When I moved from a flip phone to a smart phone there were a few problems and again the service department worked with me untill we got it right. I recommend you to friends. I have been with patriot mobile for over 5 years and plan on staying with patriot mobile. you can thank Mark Davis from am660."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Catherman",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T17:33:10.000Z",
          "Titre": "You guys do fine on your service",
          "Contenu": "You guys do fine on your service, both customer and coverage.  I don't like that my bill seems to be creeping up much higher than I was told.  I'm on a fixed income and hopefully won't have to switch to a different carrier if the costs continue to rise."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debbie Hill",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T18:43:06.000Z",
          "Titre": "So far",
          "Contenu": "So far, the service is good. Eventhough I'm paying more than with my previous carrier, I want to support Patriotic businesses. There have been several occasions in the past few months since I've had the service that I haven't had service..Emergency Calls Only shows .A bother!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Riley",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T19:14:47.000Z",
          "Titre": "I happily support a company that…",
          "Contenu": "I happily support a company that supports my beliefs and has some moral integrity, then a dead zone here and there in my area isn't such a big deal. No company is perfect in service so I feel I traded up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kristina Mikesic",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:57:41.000Z",
          "Titre": "In general I enjoy the company",
          "Contenu": "In general I enjoy the company.  I like that my money is going to good causes and not woke.  I do wish the data was a little higher for the $.  Have to really watch if go over otherwise not good service just spins"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LA",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T22:20:54.000Z",
          "Titre": "In all respects",
          "Contenu": "In all respects, Patriot Mobile is fantastic. I would have given 5 stars if I could buy truly unlimited data, but your data slows down to unusable after 40 gb"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kim",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T15:19:31.000Z",
          "Titre": "Service is great and prices are great",
          "Contenu": "Service is great and prices are great.  Love that you support conservative causes.  I always recommend you when I have the opportunity.  Customer service is always professional but wait times have been crazy.  I was trying to give you money and upgrade my plan, but I finally gave up because couldn't get anyone on the phone.  Would be great if you could upgrade your plan via the website and not have to talk to customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AEnsl",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:11:29.000Z",
          "Titre": "Happy with Patriot…",
          "Contenu": "We have been very happy with Patriot Mobile, especially since you connected with Verizon towers.  We would still like to be able to email w/ attachments to our Text apps, not removed.Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gene",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T15:16:38.000Z",
          "Titre": "Patriot move/billing",
          "Contenu": "Moving to Patriot was done easily and help provided during the process was appreciated. My wife's phone is an enter level android and we've had some voice mail issues that Patriot has addressed. Billing has been seamless!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Bontrager",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:17:52.000Z",
          "Titre": "Great Customer Service… Wanting in Data Package",
          "Contenu": "Customer service = great.I believe in the cause but also pay top dollar for a price point for data. When I exceed it then I’m at dial up speeds = a severe challenge to my business responsibilities. I may have to leave the network out of necessity which saddens me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Charriez",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T01:09:41.000Z",
          "Titre": "Decent service for a decent price and…",
          "Contenu": "Decent service for a decent price and awesome conservation of resources. Money doesn’t go to woke companies/businesses. I wish there were more options for phones but all in all exactly what we need."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jesse Stout",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:40:12.000Z",
          "Titre": "First of all let me start off by saying…",
          "Contenu": "First of all let me start off by saying to all the good people at Patriot Mobile I love what you do and stand for first and most of all. your customer service is above and beyond. Everyone that I’ve had the pleasure of speaking with their is always polite, courteous, informative and will go out of their way to make sure things are taken care of. Keep up the good work and stand firm in your beliefs!Jesse"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T18:38:12.000Z",
          "Titre": "When making the switch I believed that…",
          "Contenu": "When making the switch I believed that Patriot has good people to work with. As I enjoy my membership, I appreciate them even more.In the near future, I would love to upgrade my phone to one that has been de-googled."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joan Jones",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:29:31.000Z",
          "Titre": "USA Enjoyable, But...",
          "Contenu": "I really enjoy having Patriot Mobile as a carrier. I have recommended you all but my last experience (around August to October, 2023) with PatMob was not enjoyable. Getting my $10 per month discount for my recommendation was a bit rigid, it began late. As a widow on a very fixed income, I was finally able to clarify $25.73 a month for for 12 months now I am paying $28.73, $3 and some change off the promised $10 discount. I enjoy having PatMob but I do not think I'll be recommending in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Bryant",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T19:16:59.000Z",
          "Titre": "The organizations and causes which you…",
          "Contenu": "The organizations and causes which you support are excellent and I appreciate your dedication to conservative ideology.  Trying to get in touch with a service representative is way too difficult.  When I moved to Patriot, I could call and reach a live person in less than a day, often less than an hour!  No so now, we are pushed to text or email which are much less efficient and effective.  Hoping you are working to return the customer service that made Patriot stand out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronald Feaster",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T22:43:17.000Z",
          "Titre": "Why I switched reliable than Verizon where my…",
          "Contenu": "Patriot Mobile More reliable than Verizon where my calls kept getting dropped. Now my wife is seriously thinking of switching to Patriot Mobile. Also I’m glad to say even my brother made the switch months ago."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SB",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:34:56.000Z",
          "Titre": "Had a few hiccups initially but it got…",
          "Contenu": "Had a few hiccups initially but it got worked out with the great techs they have.  I give it a 4 star because I wish they would have their own towers to serve us instead of piggy backing off of major service providers.  I believe their plans would be much better in a long run if they had their own.  All in all, I am satisfied with the service I'm getting.  Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Timothy C",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T16:32:11.000Z",
          "Titre": "Customer service is not standard.",
          "Contenu": "After interactions with customer service representatives at Patriot Mobile I have encountered some people who are very concerned about the customer and others who just check the block and get by with little effort. Those who put themselves in the customer’s shoes are appreciated and I would gladly give them the five star rating. It would be nice to know why sometimes the rates increase rather than just seeing the increase and trying to figure out why."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DR",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T15:33:01.000Z",
          "Titre": "Customer Service is USA based and…",
          "Contenu": "Customer Service is USA based and excellent.  I wish the unlimited was a bit more competitively priced, so I could convince others to join.  I also wish the data didn't throttle at a certain point. Other than that, it is great service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Craig Kelsch",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T03:37:18.000Z",
          "Titre": "Service has been decent",
          "Contenu": "Service has been decent. I always loose service on the main street in St George Ut. Both mine and my wife's phones lost all service last week for about 20 or 30 minutes. My monthly rate stays consistent which I really appreciate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill Malosky",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T01:56:30.000Z",
          "Titre": "When I use the phone",
          "Contenu": "When I use the phone, my calls connect. That combined with the savings, well, Works for me. Like this company's values."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sheri Wilt",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T14:01:49.000Z",
          "Titre": "Like that I'm supporting conservative…",
          "Contenu": "Like that I'm supporting conservative values, but frankly the cell service is not all it's cracked up to be. Sometimes I have great reception, and other times it is really bad!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott Shain",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T14:58:15.000Z",
          "Titre": "Your staff is very helpful",
          "Contenu": "Your staff is very helpful, friendly and knowledgeable. I like the fact that you are not a WOKE company. From what I've seen you are just the opposite."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sue Willis",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T00:12:17.000Z",
          "Titre": "Patriot’s customer service and rates…",
          "Contenu": "Patriot’s customer service and rates are great. My only complaint is very poor cell signal where I live. I live in rural Hopkins County with very poor reception."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carole Porter",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T19:20:39.000Z",
          "Titre": "My phone purchased from you goesfrom CRAZY.",
          "Contenu": "My phone purchased from you goes CRAZY.PRESS BUTTON..FOR TEXTING.IT WILL SHOW MANY NUMBERS..AZGMBIF ITS TIRED I BELIEVE HAHA..I REALLY DONT LIKE SAMSUNG UPDATES..I L8NGER ...IT NOW HAS AN ARROW TO PLAY..GOSH SAKE ITSVA LITTLE PHONE SCREEN.!!!!WHAT MORE CAN YOU PUT ON IT.!!..BUTTONS STICK.IF I PRINT OUT RIGHT LETTER WORD.( IT WILLPRINT DIFFERENT  LETTER.I WANT BETTER PHONE..SERVICE  IS GOOD MOST TIMES"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Texas gal",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T21:12:43.000Z",
          "Titre": "Not Yet Earned 5 stars",
          "Contenu": "Im pretty happy with my service. Great price and customer service but I do not like that I cannot choose my due date and that you require direct access to bank accounts for payments. You lose one star for that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Celeste Behsmann",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T15:46:49.000Z",
          "Titre": "A different kind of phone company",
          "Contenu": "I really enjoy my patriot mobile but I do have issues with no service near where I work in the Kent narrows area of Maryland. But for the most part all is well and the customer support is fantastic. Thank you! Oh and I really appreciated the news letter of all the things pm has done with their funds. Way to go."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "G&N",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:05:00.000Z",
          "Titre": "The signal isn’t strong/fast when using…",
          "Contenu": "The signal isn’t strong/fast when using internet without WiFi."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T14:35:32.000Z",
          "Titre": "Nice personnel and helpful",
          "Contenu": "Nice, informative and helpful. They use existing carriers for the SIM cards. I have T Mobile, it works okay but there are a few weak areas. I like the option to drop out without penalty if I am dissatisfied."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George Zultanky",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:57:56.000Z",
          "Titre": "Service is awesome no complaints about…",
          "Contenu": "Service is awesome no complaints about that but there is another good (I've been told) provider that is about $150 less a year.  Doesn't sound like much but I would like to save $150.  I will probably be switching.  Sorry."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Belanger",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T06:12:03.000Z",
          "Titre": "Had difficulty with reception and…",
          "Contenu": "Had difficulty with reception and downloaded  times when we traveled to Kankakee IL."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard  Eckert",
          "Nb_Reviews": 5,
          "Date": "2023-12-14T02:57:50.000Z",
          "Titre": "Reliable 99%",
          "Contenu": "Once and a while,  not often. loose AT&T tower signal but comes back, always better than no  Verizon signal at our location via prior provider."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tamara Odland",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T18:42:59.000Z",
          "Titre": "Helpful, friendly and thorough!",
          "Contenu": "Staff was kind and helpful, giving me clear information on my options and being patient as I made a decision. One error was a missed step that limited an important capability for a few days, but they resolved it immediately when I called back for help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Benjamin Gordon",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T14:47:32.000Z",
          "Titre": "Prices are reasonable",
          "Contenu": "Prices are reasonable. The people are easy to talk to and able to help when you call. The only downside is that service using the T-Mobile provider is very limited in more rural areas."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PO",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:31:40.000Z",
          "Titre": "Voice mail has not worked since we…",
          "Contenu": "Voice mail has not worked since we switched. Internet  is also much slower (or unable to connect altogether) when traveling."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Samuel Hutchins",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:48:02.000Z",
          "Titre": "Better phone selection",
          "Contenu": "The only negative I would give is, you need to have a little better selection on your phones. I usually have to buy my phone elsewhere because you don't have the one I want. Also, have a little better multi phone discount. Other than that, you are a great phone company to work with, and have great service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Becky Stone",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:18:06.000Z",
          "Titre": "I appreciate the causes you support",
          "Contenu": "I appreciate the causes you support, your values. I didn’t give you a perfect score because sometimes my coverage is spotty. But I still appreciate you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Crouch",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T23:53:08.000Z",
          "Titre": "Had very good customer service",
          "Contenu": "Had very good customer service. Was disappointed in NOT porting my old number which has lead to numerous inconveniences to me SINCE everything was tied to my old number."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Weber",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T04:02:12.000Z",
          "Titre": "I love what this company stands for!",
          "Contenu": "I love what this company stands for. I support their efforts 100%. Being a long time flip phone user, I am not enjoying my very recent switch to a smartphone. not yet, anyway. My son suggested that part of the problem I was having was that I didn't have a data plan. Bingo! Patriot Mobile is addressing this as I write this. On the darker side. My last phone was a Sonim XP3900 Plus. This phone was very difficult to learn to use as I am a big time texter. This is the wrong phone for that if you don't want to jump through a LOT of hoops. Patriot Mobile really did very little to help me with that. I ended up experimenting and figuring it all out the HARD way. Most of what I had to do was NOT in the manual. In fairness, that's really Sonim's fault, not Patriot Mobile's, except that  they are the ones who sold me the phone. I had a Love/Hate relationship with that phone from the moment I opened the box. I hope to have better luck with my new iPhone SE/3. :-]"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Vogan",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T15:59:12.000Z",
          "Titre": "Good Service all around",
          "Contenu": "Good Service all around.  Customer Service is always helpful, and the general service is overall good.  I would like some better connectivity in certain locations, but you can't win them all."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stuart Fontenot",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T13:39:13.000Z",
          "Titre": "Same service, less money",
          "Contenu": "Starting off was a little rough. It took a few different sim cards before one worked right. Ever since, though, service has been fine, no problems. The app sucks, though. I have never been able to get it to work and have completely given up on it. The regular website works fine if you need it. All in all, I get the same service that I had with AT&T for half the price, so I am happy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:15:17.000Z",
          "Titre": "I love the service",
          "Contenu": "I love the service. It meets my needs for a phone, which is mainly to talk and text only. The flip-phone that I opted for (it was \"free\") does have a few draw-backs. The physical buttons do not always work. A bit frustrating but it gets the job done eventually."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob West",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T17:21:47.000Z",
          "Titre": "True to their advertisement.",
          "Contenu": "True to their advertisement, Had to get 2nd Sim card for my phone. No  extra charge, just a different Sim card."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kings",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T15:54:01.000Z",
          "Titre": "I'm rating 4.3 stars overall",
          "Contenu": "I'm rating 4.3 stars overall for customer service, billing, plans and phones offered, network coverage and reliability. Verizon is the gold standard in my opinion for mobile phone service except if you upgrade to a more costly plan in Verizon there is no going back to the lower cost plan because it becomes unavailable almost the moment I upgraded. Patriot keeps the entry level plans available to everyone so as their needs change they can move in and out of whatever plan is most suitable for their current situation. Patriot offers a very nice referral plan ability that creates a win win situation for old and new clients. If they would streamline the referral process a bit more, and continue to invest to improve their website then I believe it's almost guaranteed Patriot would receive more 5.0 star ratings. I love that Patriot Mobile promotes life, personal responsibility, and freedom. Many companies have colluded with the federal and state governments to give them more influence over Americans than what the Constitution permits.  Patriot Mobile doesn't play that game."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marian Jones",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:13:03.000Z",
          "Titre": "I am very happy with Patriot Mobile",
          "Contenu": "I am very happy with Patriot Mobile. The service is just as good as any other mobile service I have had in the past. The only complaint I would like to address is the Wi-Fi service. I had true unlimited Wi-Fi service with my previous plan. With your service I would have to pay more money to get what I was getting before. Your service slows down after a certain amount of usage and this happened pretty quickly. If it were not for the fact that I have retired from work now and no longer need to use my Wi-Fi at work, I would not have kept this service. I am striving to be supportive of a good company. Just being honest. Thanks!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T14:14:23.000Z",
          "Titre": "Great company!",
          "Contenu": "Great customer service and love the values of the company!  Wish there were more phone options and ways to upgrade phone every couple of years at a discount."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anya Peterson",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T05:31:14.000Z",
          "Titre": "I really love the customer service",
          "Contenu": "I really love the customer service. Excellent.Everyone is really helpful. The cost is great too. My phone service is mostly good. Spotty at times though. Texting is generally good, but half of the time, if I try to send a photo, it won't go through. Overall, I'm glad I switched from evil AT&T."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brenda Windom",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T21:49:04.000Z",
          "Titre": "Customer service is great",
          "Contenu": "Customer service is great, reception is great - all over the western US.  I wish that I got my VMs and texts more quickly. 80% of the time VM's arrive the day after they were sent. Not good for my business!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa Muehlman",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T23:22:13.000Z",
          "Titre": "Very happy with this company",
          "Contenu": "Very happy with this company. Good service noProblems. Their beliefs are similar to mine. Nice to have a company that believes in the right issues"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Byron Nash",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T19:16:42.000Z",
          "Titre": "Great for US and Canada!",
          "Contenu": "The only reason I didn't give 5 stars was the lack of connection in Europe and the UK. Otherwise a first-rate provider with excellent customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brad Schnepf",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T17:31:57.000Z",
          "Titre": "Initial sign up was very easy and…",
          "Contenu": "Initial sign up was very easy and seamless.  The only complaint I have is I do not have reliable service at my home.  Most other places service is good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marcus",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T17:04:57.000Z",
          "Titre": "Like the fact that they Mobile service support…",
          "Contenu": "Like the fact that they support conservative causes. As a mobile provider they are slightly above average"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T17:21:46.000Z",
          "Titre": "Service Unavailable",
          "Contenu": "I occasionally have phone service not available messages.  Very inconvenient when I am conducting business. The process of resetting network services, reinserting sim card and repowering the phone is quite tedious.  No reasons or permanent solutions have been offered."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T14:48:30.000Z",
          "Titre": "Responsive customer service but only 4…",
          "Contenu": "Responsive customer service but only 4 stars as they couldn't restore my cell phone service which was unavailable while traveling in Canada."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Curtis Fox Sr",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T14:30:21.000Z",
          "Titre": "All great but a difficult transition…",
          "Contenu": "All great but a difficult transition from at&t. May have been more their fault."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jonathan Flint",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:25:21.000Z",
          "Titre": "Good Service and performance",
          "Contenu": "Good performance. Great Service when needed.Cost is pretty good as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Glen Gotcher & Associates",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T15:01:40.000Z",
          "Titre": "I appreciate and agree with the…",
          "Contenu": "I appreciate and agree with the principles that guide your company.  Your commitment to investing in influencing the direction of our country and fighting wokness is a worthwhile endeavor.  I am proud to support a company who upholds Christian values."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Glen Mitchell",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:37:26.000Z",
          "Titre": "Liked the ability to switch towers",
          "Contenu": "Liked the ability to switch towers. Helped a lot with reception and broadcast"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Lane",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T14:25:49.000Z",
          "Titre": "Signal weak in alot of our areas and…",
          "Contenu": "Signal weak in alot of our areas and slows down last week of the month. Other than that satisfied with the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joann Neubauer",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T19:44:36.000Z",
          "Titre": "It was very easy to do",
          "Contenu": "It was very easy to do, however your customer service needs longer hours and better quality service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Oldfolks",
          "Nb_Reviews": 6,
          "Date": "2023-12-17T15:22:40.000Z",
          "Titre": "The operating system of our flip phone…",
          "Contenu": "The operating system of our flip phone is difficult to understand, it lacks many of the features we had with our Consumer Cellular Flip-phone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron Taber",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T14:55:43.000Z",
          "Titre": "Bad experience when traveling to London",
          "Contenu": "Bad experience when traveling to London. Unable to get the data necessary for app’s making travel very difficult."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pigeonee",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T20:05:21.000Z",
          "Titre": "Patriot has been easy to work with and…",
          "Contenu": "Patriot has been easy to work with and I like their mission statement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ellen Fridley",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T15:23:31.000Z",
          "Titre": "I do not have service when I go to…",
          "Contenu": "I do not have service when I go to Yorkville, Ca I did with Verizon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bj Clifton",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:26:45.000Z",
          "Titre": "I loose my signal often."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Norma Randazzo",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:57:42.000Z",
          "Titre": "Consistent  service and reliable",
          "Contenu": "Consistent  service and reliable.  Would like higher speed"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rose",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T15:31:36.000Z",
          "Titre": "Would love unlimited data",
          "Contenu": "Would love unlimited data. Hotspot hangs but is that AT&T towers?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeffrey Polson",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:42:47.000Z",
          "Titre": "Polite and informative",
          "Contenu": "Polite and informative.  I wish you sold I phones."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wendy",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T06:50:01.000Z",
          "Titre": "Good customer service",
          "Contenu": "Good customer service, kind, patient. Good company!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T14:17:46.000Z",
          "Titre": "After the third phone call",
          "Contenu": "After the third phone call, and going through the usual turn it of, turn it on, turn it off, we'll reboot your connection to the towers? The third call actually found out that there was an outage in my area for a few days due to tower work, low and behold by the end of the day everything was back up and working. This was after over an hour on the phone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lois Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T01:15:59.000Z",
          "Titre": "I pray that we can get a senior citizen…",
          "Contenu": "I pray that we can get a senior citizen rate"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barbara Glaser",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T15:06:40.000Z",
          "Titre": "Not Just Talk",
          "Contenu": "Patriot Mobile uses the money to promote American and Godly values."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeffrey Lile",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T19:38:40.000Z",
          "Titre": "OK,  but it could have a better signal",
          "Contenu": "OK, needs better towers.  Not the best signal."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linde Barrera",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T17:38:21.000Z",
          "Titre": "My Opinion of Patriot Mobile",
          "Contenu": "I would like to see a breakdown of where my monthly bill payment goes, if possible. Patriot Mobile gives me excellent cell phone service, and I am grateful for them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles Toro",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:04:58.000Z",
          "Titre": "The people employed are very…",
          "Contenu": "The people employed are very professional, helpful, and enjoyable to conduct business with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janice Parrish",
          "Nb_Reviews": 9,
          "Date": "2023-12-14T16:06:36.000Z",
          "Titre": "At times the connection is not very…",
          "Contenu": "At times the connection is not very good or not at all."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vanessa Becker",
          "Nb_Reviews": 2,
          "Date": "2023-08-06T23:42:39.000Z",
          "Titre": "Just an update about Patriot Mobile",
          "Contenu": "Just an update about Patriot Mobile. Everything was resolved with my SIM some very friendly staff members helped me figure out the issue and I am learning more about the company as I go. By all means switching providers can be challenging and after putting all this behind us I can say Patriot is a good company"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JessJoe",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T14:10:35.000Z",
          "Titre": "Good service support and good value"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vy Rauland",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T17:06:30.000Z",
          "Titre": "Blessings!",
          "Contenu": "I completely appreciate what Patriot Mobile stands for and their fight for the school board positions. I use Patriot Mobile for my personal phone service.I travel up and down the east coast regularly and have no issues with the service or signal.Only problem that I have is that they don't offer a large enough data plan to fit my usage needs.  I still have to keep my business phone plan with the \"V\" company.I do give thanks for all  you do."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Philip Skoblikoff",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T19:25:15.000Z",
          "Titre": "While your techs were all very good amd…",
          "Contenu": "While your techs were all very good amd very appreciated, the evolution could have been addressed in much shorter time frame & benefited overall by having a local brick & mortar location to address the phone issues. I hope you find this constructive. -Thanks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen Hone",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T21:11:14.000Z",
          "Titre": "Great once we got going",
          "Contenu": "I have been very happy since switching, but it was a rough start. My first SIM cards were for T-Mobile (though I had requested Verizon) & didn't work at all but my Verizon account was cancelled. So I had no service for several days until getting my second SIM cards, and then I had to borrow another phone and sit in a hot car for about 45 minutes waiting for customer service to get me connected. Eventually it all worked and I and my husband are satisfied."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JANE ROSENBERG",
          "Nb_Reviews": 3,
          "Date": "2023-08-15T01:12:49.000Z",
          "Titre": "IN THE BEGINNING YOUR CUSTOMER SERVICE…",
          "Contenu": "IN THE BEGINNING YOUR CUSTOMER SERVICE DEPT WAS SAYING, IM SORRY WE CANT OR IM SORRY THIS OR THAT & IT WAS UNPROFESSIONAL, YOUR STAFF WAS COURTEOUS AT ALL TIMES TO ME . BUT NOW I HEAR A MORE “CAN-DO” APPROACH TO MY REQUESTS & THIS NOW MAKES ME FEEL GOOD AS TO WHO IM DOING BUSINESS WITH. KEEP UP THE GOOD WORK & TY 🙋‍♀️"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dick",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T22:18:04.000Z",
          "Titre": "Better pricing and good service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Swim",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T23:28:51.000Z",
          "Titre": "Great Experience",
          "Contenu": "This was by far the best experience I've had with any Mobile carrier.  I was able to transfer my line to Patriot Mobile is about 30 minutes total from AT&T.  Almost every time I had any customer service experience with AT&T, it was poor and always took 60 minutes or more!  The customer service rep with PM (Zach Schmidt) was pleasant, responsive, spoke clear english, and was able to completely meet my needs.  Thank you Patriot Mobile!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WilliamE",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T16:22:06.000Z",
          "Titre": "An easy, helpful and friendly staff",
          "Contenu": "I had to call 2-3 times during the initial setup and I ended up talking to live human beings. All spoke perfect English!  I was not talking to someone who I could barely understand who could have been in India or any number of other countries the way most corporations have gone. Also, there was no massive robot bouncing me from one place to another trying to keep me from talking to a human being. Lastly, it is great to know my money is going to a company who shares my values!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Solomon Zaghlul",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:25:11.000Z",
          "Titre": "I'm 100% on board and fully support…",
          "Contenu": "I'm 100% on board and fully support everything that Patriot Mobile is and stands for! I will NEVER go back to this other companies, no matter how hard they dangle their carrots! Patriots and conservative Christians love America and Patriot Mobile for their love back! BRAVO ZULU!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rob Bullock",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T15:25:31.000Z",
          "Titre": "When we went with Patriot mobile their…!",
          "Contenu": "When we went with Patriot mobile their customer service is outstanding and above. Their friendliness and knowledge made us feel they cared. The reason we went with Patriot mobile and what we appreciate is that they do not give money to organizations that go totally against our beliefs, the Christian values take center stage and that means everything to us. Thank you for not donating money to organizations such as planned parenthood. We do not subscribe to AARP either for the same reasons they sell out our Christian values morals and ethics."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Monsen",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:07:25.000Z",
          "Titre": "Quality, Economy and Values",
          "Contenu": "First of all service- I have never been without service anywhere i go.  Second- cost.  Your prices are the best deal ever.  Most of all, I know that my carrier is On My Side, supporting only conservative causes and the values and morals I hold dear.  Thank you Patriot Mobile for holding the line!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mario J",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T13:52:57.000Z",
          "Titre": "I switched and I have no regrets",
          "Contenu": "I switched from that company that rhymes with Horizon two years ago.  For one thing, I’ve saved about 25% to 35% on my charges.  I haven’t noticed much difference in coverage.  Sometimes it’s worse in one location than my prior carrier, sometimes it’s better in another.  The most important thing is knowing that I am no longer contributing to the decay of society by having a portion of my fees used to support causes that run contrary to my worldview."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "satisfied customer",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T14:58:42.000Z",
          "Titre": "Great Company to Support",
          "Contenu": "The service has worked great for the year or so that I’ve been a customer. I have the higher data package which is about the same price as other companies unlimited plans. I listen to Audacy and SiriusXM apps while traveling and haven’t hit the data limit yet."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hoggatti Productions",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T03:42:27.000Z",
          "Titre": "A phone company",
          "Contenu": "I greatly appreciate the service provided. Do not have any issues. However, I would love to see a greater phone selection i.e. secure phone, military style. I love the community outreach and the faith principles to which Patriot Mobile stands. We need more companies like Patriot Mobile standing on truth."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pam",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T06:43:44.000Z",
          "Titre": "Glad I switched to Patriot",
          "Contenu": "Whenever I call, the rep who answers is very polite and pleasant to deal with. I believe the reps are also American so no communication issues - easy to understand. So far, I have had no problems with my wireless service and I'm very glad I switched."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy Simmons",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T08:08:56.000Z",
          "Titre": "The money you spend with Patriot Mobile goes towards conservative values",
          "Contenu": "When I have self generated issues, these representatives have been polite, they listen and fix my mistakes. No extra charges. No hassles or impatience.  They respect each of their customers. Best customer service I’ve had in many years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Betty Azbill",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:47:22.000Z",
          "Titre": "I trust Patriot Mobile",
          "Contenu": "I trust Patriot Mobile, unlike other companies in the US. I also love the fact that they are contributing to causes I support. They also were very professional and polite. Nice to know there is a company still out there somewhere with these values."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy Customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T07:27:23.000Z",
          "Titre": "I see no difference in my experience…",
          "Contenu": "I see no difference in my experience with my android phone than when I had ATT. Except for the monthly payments.!!! I still phone, text, message. But I also read my books, check information on the internet, order products online, listen to sermons and music, and occasionally stream a movie if I'm using my WiFi."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Dinkins",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T21:27:59.000Z",
          "Titre": "Outstanding Company",
          "Contenu": "Outstanding customer service. Our service is somehow better even with the same carrier(doesn't make sense to me either). Good prices and ability to introduce others and get a discount on you bill. Very pleased with Patriot Mobile and their values closely match my own as far as I can tell."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Brandon Ess",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:25:34.000Z",
          "Titre": "Customer service is always good",
          "Contenu": "Customer service is always good. Prices are straight forward & honest without any price gouging. However, it would be great if they offered an unlimited data plan like all the other carriers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clara DeCorsey",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T04:12:51.000Z",
          "Titre": "The Best Service!",
          "Contenu": "After fighting with ATT for two weeks, the wonderful people at Patriot Mobile took care of everything.  I love picking up the phone and getting help from an English speaking person right away or almost right away.  I also love everything they stand for."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NCheser",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:41:37.000Z",
          "Titre": "Customer service is extremely friendly…",
          "Contenu": "Customer service is extremely friendly and helpful. Even though we live in a remote area where service can be spotty with other carriers Patriot service has not failed us. Both of my son's recommended Patriot and we're glad we switched over."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Terry",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T04:51:08.000Z",
          "Titre": "I came over from T-Mobile and at the…",
          "Contenu": "I came over from T-Mobile and at the very minimum. I have had the same or better service in that. I also have the comfort of knowing where my money goes. The wonderful organizations that you work with and don't eat too is a big draw for my family and myself. I've had not one thing to say negatively about this wonderful company. After another contractor 2 is completed with a few of my family members, I'll be bringing more over to the family."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon Kaiser",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:44:06.000Z",
          "Titre": "Switching from Tracfone to Patriot…",
          "Contenu": "Switching from Tracfone to Patriot Mobile was a breeze (on the Patriot Mobile end).  I spoke with 4 or 5 of your reps and each and every one was patient, courteous, helpful, and American!!  The only accent I ran into was a pleasant southern one.  And, the service has been excellent. And, it's a bonus to know that you all have the same beliefs that we do.  Keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kurt Denker",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T23:57:29.000Z",
          "Titre": "From the first time I called Patriot…",
          "Contenu": "From the first time I called Patriot Mobile I was hooked. The friendly professional service received was a breath of fresh air. Looking forward to working with Patriot Mobile in the years to come. I better not forget to mention the savings, a lot easier on the pocketbook. Thank you Patriot Mobile for all you do!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "StephenP",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T09:16:02.000Z",
          "Titre": "Great customer support",
          "Contenu": "Patriot Mobile didn't robo-call me. I called them for information. When my plan with sprint-destroyed-by-tmobile ended, I contacted Patriot Mobile again and they handled the transfer of my three phones. Customer support was pleasant to work with. I have recommended them to many of my friends. Oh, and they saved me money!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jean",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T04:00:02.000Z",
          "Titre": "Customer service is very good",
          "Contenu": "Customer service is very good.  The people that I talked with spoke perfect English with no noticeable accent that made it difficult for me to understand.  The next best aspect of their customer service was, that the lady that I spoke with seemed to care about the company she was a part of, and took pride in their service.  So, Patriot Mobile is doing something right with regard to their company's culture."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela B.",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:16:23.000Z",
          "Titre": "Customer service is top notch",
          "Contenu": "Customer service is top notch! I wanted to switch to a company that supported the pro-life movement, what a bonus to find a company that was not only Christian, but patriotic, conservative and more. Listening to Christian music whole on hold? Closed on Sundays because it's a family day? Yes!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon C",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:52:25.000Z",
          "Titre": "Great company!!",
          "Contenu": "I really appreciate the flexibility I have with Patriot Mobile.  Thru Patriot, my husband has Verizon, but it did not allow for good service on my phone, so I have AT&T, both thru Patriot Mobile.I really like their friendly, willing to help customer service.  And it’s a US based company 🇺🇸"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CDA, Idaho",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T18:24:20.000Z",
          "Titre": "I’m so glad I switched",
          "Contenu": "I’m so glad I switched! The cell service is the same or better than before, there have been no price surprises, we save $40 a month compared to our previous service. The customer service can at times be a bit of a wait but I just do the call back option. And once you do talk with someone, they are extremely kind and courteous and they actually want to help! Not just another cog in a machine. And supporting causes I believe in instead of big telecom takes the cake!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ace Body and Motor",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:07:32.000Z",
          "Titre": "I like the fact that Patriot Mobile is…",
          "Contenu": "I like the fact that Patriot Mobile is a Christian Conservative company that supports my values. Also the service is awesome! I like the fact that if your reception isn’t good they will switch you to another provider that will be better at no charge and you are not locked into a contract."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Exciting Experience",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T10:09:14.000Z",
          "Titre": "Alberto was a great help",
          "Contenu": "Ive been with you for several years now, loyalty is important. Alberto was a great help and made my predicament a nothing burger.. I also appreciate that I got the new phones quicker than expected. I tell everyone that I know how excited about having a cellphone company that exhibits my beliefs. My Old Pastor use to always say that \"Talans\" are still important."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SB",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:39:13.000Z",
          "Titre": "Quick transaction",
          "Contenu": "I signed up for the Pay It Forward program. It was quick and easy. The gentleman was very nice and understanding of my time. It took 45 for a call back (I’m glad a company like this is busy). I just walked out the door to leave work. The transaction was completed quickly. Thank you for supporting necessary causes and allowing us to be a part."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony Brokish",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:11:41.000Z",
          "Titre": "Totally satisfied customer",
          "Contenu": "Your customer service has been great when needed and I haven't needed it often. You support causes I care about and not causes that are contrary to my christian beliefs. Phones have been good but selection is limited. I recommend Patriot Mobile to anyone and everyone I can."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T04:50:46.000Z",
          "Titre": "I found my cellular home",
          "Contenu": "Great cellular service and the absolute best customer service in setting up my account and phone.  And did I mention the great rates.  I will not switch to another company again.  I found my home!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra Smith",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T03:45:38.000Z",
          "Titre": "My Patriot Mobile",
          "Contenu": "She. I was trying to set up a line for my brother in a nursing home in another state from where I live, Patriot Mobile was most helpful, my brother was not cooperating because it was not what he was accustomed to, but a stroke had changed the everything for him.  I had been a Patriot Mobile customer before that and was, as I am still, most satisfied with the service.  Further, I like that our monies support Veterans',  and conservative, causes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janice Norman",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:25:28.000Z",
          "Titre": "I travel from Northeast Kansas to…",
          "Contenu": "I travel from Northeast Kansas to Tyler, Tx 4-6 times per year.  I travel in all kinds of weather.  So far, I have had now problem with my maps not being with me the whole way.  I have confidence in them which is very comforting to me.Neg--I did have one incidence in Ks at night.  We were under heavy general cloud cover and my directions became muttled. I had a difficult time finding my way out of a rural neighborhood.  Has not happened since."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Econ",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:09:51.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Switching over would have been easy, but I had issues switching over with my old cell phone - 3g and 6 years old. The customer service representative was very helpful.  They sent me two sim chips depending on my local service. They walked me through the setup.  Ultimately, I had to get a new phone and the setup was a snap.  I am not a phone hog and missing 3 days was not a big issue. Service is great in suburbia Philadelphia. It would have been helpful if they would have a list of compatible phones, but I appreciated that they tried to work with my old phone until the writing was on the wall."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "N Reid",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:46:12.000Z",
          "Titre": "I'm very pleased with Patriot Mobile",
          "Contenu": "I'm very pleased with Patriot Mobile.  The transition was seamless, and the service has been very good.  I especially like that Patriot Mobile funds worthy causes that line with Christian values.Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Pratt",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T22:18:04.000Z",
          "Titre": "Happy",
          "Contenu": "Happy, have not had any dropped signals/ calls since we joined, great job and customer service getting us set they the different towers. Bye,bye Pure talk."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Holt",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T14:13:26.000Z",
          "Titre": "Patriot for the win!",
          "Contenu": "My wife and I switched to Patriot when we saw Verizon spending our money on woke practices that are harmful to our country.  The transition to Patriot was easy and the service is fantastic.  We love they support pro American policies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet Dose",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:33:36.000Z",
          "Titre": "This company is a blessing to America!",
          "Contenu": "We are saving a lot of money every month now and our service is excellent.  We love supporting an American company.  I can call them up and speak with an English speaking person and the support is great.  This company helps America in so many wonderful ways.  Thank you and God Bless You All!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:28:56.000Z",
          "Titre": "Good service and not too many emails",
          "Contenu": "I am very happy with my service since I moved to Patriot Mobile.  Your email notices make bookkeeping easy and you send \"just enough\" emails.........not overbearing like some companies.  Thank you very much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda M",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:40:20.000Z",
          "Titre": "Awesome service, love what they stand for",
          "Contenu": "Seamless payments, great service, have never had any issues, and love supporting Patriot Mobile and what they stand for! Keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary C",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:23:03.000Z",
          "Titre": "good quality, good American values - a win win",
          "Contenu": "I absolutely love that I'm supporting a company that stands for good values in a sea of companies that are promoting 'woke' agendas.  The service is as good as any other and I recommend PM's service to all my friends.  Thank you so much for your patriotism!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vickie Diangson",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:58:49.000Z",
          "Titre": "Patriot Mobile cut my bill in half",
          "Contenu": "Patriot Mobile cut my bill in half. The transition was easy and Molly was very helpful. All the customer service representatives were very polite, patient and knowledgeable. I am very pleased with the switch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sabra Keith",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T03:03:11.000Z",
          "Titre": "Always a friendly voice",
          "Contenu": "I've had to call patriot a couple of times and always a friendly Texan on the other end. Never a foreigner. I love that!! No complaints with this service at all. We love patriot mobile."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill McCall",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T21:25:59.000Z",
          "Titre": "Give Patriot Mobile a try…",
          "Contenu": "Service has been great as we needed to find the best network for service and Patriot Mobile personnel were great in assisting us.  This is a great service at a good price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah F.",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T19:44:03.000Z",
          "Titre": "The staff at Patriot Mobile are Very…",
          "Contenu": "The staff at Patriot Mobile are Very knowledgeable and helpful! They walked me through how to set up my phone with the new sim card and redo my voice mail for both my phone and my mothers. I appreciate their patience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TONI COTTURONE",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T17:05:51.000Z",
          "Titre": "Supports Conservative Values",
          "Contenu": "It's important to get excellent service and a bonus to get it at an affordable price - that's what Patriot Mobile provides. They also stand for and support the Christian values that are vital to me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Curtis Archer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:47:07.000Z",
          "Titre": "A real person on the phone",
          "Contenu": "A real person on the phone, Christian music on hold, and the sincere courteous nature of your service personnel was sooooo refreshing!  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane Ruesch",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:45:55.000Z",
          "Titre": "When we reached out to you to relate…",
          "Contenu": "When we reached out to you to relate our issues with ability to get good reception in some areas, you resolved this by sending new sim cards for our phones and they are now working beautifully!  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T19:17:42.000Z",
          "Titre": "Great coverage in SF Bay Area",
          "Contenu": "Great coverage in the San Francisco Bay Area. While there is no international roaming, that’s almost become passé in the era of far-lower-cost eSIMs and Skype."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Sullivan",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:30:14.000Z",
          "Titre": "No Brainer to Transfer",
          "Contenu": "They made it easy to transfer, no difference in coverage than my prior \"big telecom\" provider and no hidden costs, it costs per month exactly what they say it will."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Hess",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T00:41:32.000Z",
          "Titre": "Answered my question quickly and even…",
          "Contenu": "Answered my question quickly and even when our connection was cut off for some reason she tried her best to save the call."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelly O.",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T14:24:12.000Z",
          "Titre": "Thank you!",
          "Contenu": "I made the switch a few months ago and literally the only thing that has changed is my saving money and peace of mind knowing that my money is going to a good cause. I am very happy I made the move 😁"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn Olson",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T03:48:38.000Z",
          "Titre": "I was able switch flawlessly over to…",
          "Contenu": "I was able switch flawlessly over to Patriot Mobile while saving over 50%! Even more, I so appreciate supporting a company that believes and supports Christian American values! It’s almost painless to pay my bill."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joann Lowry",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:22:19.000Z",
          "Titre": "Patriot Mobile provides real people to…",
          "Contenu": "Patriot Mobile provides real people to help when you have an issue. Their pricing is great and customer service is friendly and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T06:16:13.000Z",
          "Titre": "I love everything about this company",
          "Contenu": "I love everything about this company. The service is great and customizable. The people are so friendly and actually care about the service they provide. The prices are almost unbeatable."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Sharon Manning",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T09:57:15.000Z",
          "Titre": "Excellent Experience for 10 Years",
          "Contenu": "I have used Patriot Mobile for many many years. I’ve always gotten good service. Whenever there was any sort of problem or need it was resolved promptly and satisfactorily. I very much appreciate Patriot Mobile’s dedication in supporting the Christian values and Biblical moral standards upon which our country, Constitution, and laws were founded. I routinely select companies with similar values and business practices for my healthcare needs, banking, phone service, and other services. I’m very pleased with Patriot Mobile‘s service and have no desire to switch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Black",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:22:07.000Z",
          "Titre": "My switch over to Patriot Mobile was a seamless process.",
          "Contenu": "My switch over to Patriot Mobile was very smooth and the person that helped me was very good to work with. We had to change my carrier after a while due to weak signal and all went well and service now is good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CAROL HALL",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:35:17.000Z",
          "Titre": "Good stewards of God's money",
          "Contenu": "I am thankful that I found a company that shares my values.  I am 100% pro-life! Thank you for being a good steward of the money the Lord has entrusted to you! The money I save on my phone bill is going to support pregnancy help centers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Laffler",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:14:47.000Z",
          "Titre": "I joined Patriot because of their Christian and conservative values…",
          "Contenu": "I joined Patriot because of their Christian and conservative values and donations to worthy causes related to those values.  Its great to have a phone service that is not operating on a \"woke\" mentality!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald Brinks",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:36:45.000Z",
          "Titre": "I have no complaints at all",
          "Contenu": "I have no complaints at all. And your customer service department has always been excellent. This might offend democrats but Merry Christmas."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Carder",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T14:41:28.000Z",
          "Titre": "Outstanding Company with morals a…",
          "Contenu": "While is nice to do business with a company that shares my values. I really appreciate the honest and straight forward pricing of their product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William northern CA",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:09:08.000Z",
          "Titre": "Excellent Performance !",
          "Contenu": "Patriot Mobile is a company based on Christian principles and I'm very pleased to have left the unAmerican AT&T behind. The associates I've dealt with at Patriot Mobile are accurate, kind and courteous.The performance of the cell phone technicalities are excellent!Thank You and God Bless Patriot Mobile"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "StevenJordan",
          "Nb_Reviews": 8,
          "Date": "2023-12-20T21:41:56.000Z",
          "Titre": "My service works everywhere I go",
          "Contenu": "My service works everywhere I go. The price/value is just perfect.  I've only had a couple of occasions to call customer service and was always very happy with the speed and the results.  Go get em guys!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JD",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T13:38:12.000Z",
          "Titre": "Best tech support team",
          "Contenu": "Even though the call to tech support got dropped due to a technical glitch, the problem was resolved within the next half hour. Good job guys!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KerrLynn",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:25:13.000Z",
          "Titre": "Easy to switch",
          "Contenu": "Easy to switch. Customer service is professional. Reasonably priced. No issue with range. Very happy to have switched."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T19:12:12.000Z",
          "Titre": "Wish there were more than FIVE STAR rating !",
          "Contenu": "Very comforting articulate employee's that take the time to listen and solve my concerns. My only experience was to place orders for telephones after leaving a well known competitor that I had to always go thru different departments in overseas offices.I recommend Patriot Mobile whenever I can."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T16:14:54.000Z",
          "Titre": "Patriot Mobile is a quality provider…",
          "Contenu": "Patriot Mobile is a quality provider with customer service that has no peer!  Outstanding. And, my money never goes to support evil and corrupt politicians nor evil organizations. They support decent and wonderful causes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kay Bemesderfer",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T14:40:03.000Z",
          "Titre": "Very prompt always!",
          "Contenu": "They were there first everytime i had issues. Very helpful, pleasant, and accommodating.  Always made sure my issues were resolved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Nitti",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:48:14.000Z",
          "Titre": "We have been Patriot Mobile for several…",
          "Contenu": "We have been Patriot Mobile for several years. We never have any issues with our phones, service or anything."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynn Moffett",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:04:27.000Z",
          "Titre": "I've had no breaks in coverage as…",
          "Contenu": "I've had no breaks in coverage as happened with TracPhone.Siri always hears me when I'm in the car.These are important for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter C.",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T07:32:27.000Z",
          "Titre": "Great experience all around",
          "Contenu": "Our cell service has been very good. We love that the company supports conservative Christian causes. It is pleasant to interact with their customer service, unlike our previous, big corporation cell service provider."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Kalish",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:49:11.000Z",
          "Titre": "Switching to patriot mobile from…",
          "Contenu": "Switching to patriot mobile from Verizon was very easy. The service has been reliable and being able to pick your plan is great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Window Wizards LLC",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T14:30:08.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service.  They walk you through the process for a seamless transition from your current carrier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philip Barnett",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:42:14.000Z",
          "Titre": "Happy to be with Patriot",
          "Contenu": "Affordable, good service friendly representatives. Mostly your dedication to the American people. May God continue to bless you all and the people of this country.    Merry Christmas"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joy Bitler",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T01:46:22.000Z",
          "Titre": "I am very satisfied with my service and…",
          "Contenu": "I am very satisfied with my service and the price is so good for helping me on a fixed income. I also like how you support moral and American ideas."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Travis J MBA",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:57:56.000Z",
          "Titre": "From price, to philosophy, to customer service—the best!",
          "Contenu": "From price, to philosophy, to customer service—the best! Patriot Mobile goes above and beyond. My family and I have moved over several business and professional lines; and continue to encourage friends and family to switch over from the other big-name American carriers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Young",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:50:52.000Z",
          "Titre": "Good company",
          "Contenu": "Good company , with good customer service ! They also support causes that I approve of , and don't support ones I wouldn't !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T16:26:42.000Z",
          "Titre": "Equal to verizon",
          "Contenu": "Change over to Patriot was very easy, support very helpful plus monthly bill less than half compared to Verizon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diana",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T22:59:04.000Z",
          "Titre": "Great Service",
          "Contenu": "The person I talked with was very resourceful and was able to get the service I needed without additional charges.I am SO grateful!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David L.",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T00:39:32.000Z",
          "Titre": "Five Stars Is Not Enough!",
          "Contenu": "Customer for almost a year now. Wish I would have signed up sooner. This is by FAR the best phone company I have ever dealt with, in every aspect! I LOVE these guys!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Gray",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:22:22.000Z",
          "Titre": "My phone reception is good",
          "Contenu": "My phone reception is good.  If I ever have a question I am able to call and have gotten great assistance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paula",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T15:08:52.000Z",
          "Titre": "Cell Service Is Great!",
          "Contenu": "The cell coverage has been great. Every time I need to call for assistance, I can speak with agents who understand me and I them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Agnes",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T07:21:26.000Z",
          "Titre": "Staff very helpful and respectful",
          "Contenu": "Staff very helpful and respectful. Anthony was very quick in resolving the issue. And answered questions professionally and honestly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eneida Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T05:08:20.000Z",
          "Titre": "I'm a happy customer",
          "Contenu": "I'm a happy customer.  Any time I call Patriot Movil for any reason, I'm treated with courtesy and professionalism."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Blanchard",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:29:19.000Z",
          "Titre": "My only regret...",
          "Contenu": "Patriot's customer service is unlike any I've experienced with any other company! My only regret is that I didn't make the switch to Patriot years ago."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandy Sixkiller",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T14:18:41.000Z",
          "Titre": "Love Patriot Mobile",
          "Contenu": "Love Patriot Mobile. It’s so great knowing my money is supporting causes I believe in. Service is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T14:21:32.000Z",
          "Titre": "Reliable service",
          "Contenu": "Reliable service.  Values I agree with.  Customer service is awesome and set up was easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shelley Wilks",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:10:36.000Z",
          "Titre": "I am very satisfied with the service…",
          "Contenu": "I am very satisfied with the service and when you call in you get someone who is always willing to help you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dustin Armstrong",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:00:29.000Z",
          "Titre": "When I learned about Patriot Mobile",
          "Contenu": "When I learned about Patriot Mobile, a Christian company leading the way in the parallel economy of mobile cell networks, I knew I had to support them. Since joining, my experience has been nothing short of perfect. The company actively supports and donates to conservative Christian non-profit organizations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cynthia Humphreys",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:41:36.000Z",
          "Titre": "Fantastic carefree service.",
          "Contenu": "Easy autopay, carefree coverage anywhere. Most importantly to me, is Patriot Mobil's conservative, Christian views, support,  and customer service, how it stands for and represents my mainstream American values. Thank you for being available in today's market. Keep up the excellent work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Brewer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T15:43:05.000Z",
          "Titre": "Pricing is what is most important to…",
          "Contenu": "Pricing is what is most important to me. Far cheaper than my last phone service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Ballard",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T14:50:40.000Z",
          "Titre": "Great",
          "Contenu": "They have great, affordable service. It's nice to support a company that shares my values."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beth bennett",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T04:37:36.000Z",
          "Titre": "Very good customer service",
          "Contenu": "Very good customer service.  Patriot mobile Customer service was friendly and very helpful and the order came quickly. Patriot mobile is very different than mainstream mobile companies in that they are genuinely caring and friendly towards their customers"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronald Vollmann",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T04:18:02.000Z",
          "Titre": "GREAT COMPANY !",
          "Contenu": "I have not had any problems and any questions I did have were taken care of promptly and with a HUMANinstead of some sort of a machine that could care less!Ron V ;))"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy Bolinger",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T14:17:10.000Z",
          "Titre": "HAPPY happy happy",
          "Contenu": "So far (about four months with you) we are very pleased with Patriot Mobile.  Getting to TALK with real people most of the time is JUST GREAT!  Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Peters",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T03:38:51.000Z",
          "Titre": "I was served competently and…",
          "Contenu": "I was served competently and professionally from someone who understood my idioms and shared my love for America"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julene Saim",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:26:06.000Z",
          "Titre": "They are always nice and willing to…",
          "Contenu": "They are always nice and willing to help me with anything I have questions about.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alton Chenault",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:31:43.000Z",
          "Titre": "Excellent service !!",
          "Contenu": "very reliable service and great help on the setup to find a good provider for my area."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sremeikis",
          "Nb_Reviews": 11,
          "Date": "2023-12-21T11:37:15.000Z",
          "Titre": "Always a smooth process!",
          "Contenu": "Patriot Mobile always there when you need them. Service is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Lagasse",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T14:12:54.000Z",
          "Titre": "Patriot Mobile is your solution to…supporting American Values",
          "Contenu": "Patriot Mobile is your solution to escape into the Parallel Economy.  If you're tired of financially supporting companies not aligned with American Values switch today."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "IntimateMatters LLC",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:14:49.000Z",
          "Titre": "I love Patriot Mobile’s values",
          "Contenu": "I love Patriot Mobile’s values, services, and flat rate, lower fees. Very glad I switched to PM."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neil McEvoy",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T14:44:47.000Z",
          "Titre": "Great phone service & even better customer service!",
          "Contenu": "Great phone service and even better customer service!Thanks for being there!"
        }
      ]
    }
  ]
}