{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "perixx.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Smith",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T10:33:06.000Z",
          "Titre": "I purchased the mouse and it did not…",
          "Contenu": "I purchased the mouse and it did not work. Tried to contact the company and they never responded. I have the box it was shipped in and no way to return the product and no phone number at all. Hopefully the company will read this review and contact me on how to return this item and get my money backSo far I still have the product the box and it's still doesn't work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason Leek",
          "Nb_Reviews": 2,
          "Date": "2023-07-27T04:18:30.000Z",
          "Titre": "I have no confirmation of my purchase…",
          "Contenu": "I have no confirmation of my purchase has shipped. I have not received my product, so how can I give positive feedback!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Allard",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T23:39:28.000Z",
          "Titre": "Nagged for Review, Haven't Received Order. You asked for it...",
          "Contenu": "Perixx marketing emails have nagged me twice to review my experience with them, and I don't have my order yet. The product is late vs. their initially stated delivery date. Maybe it's a good keyboard, but who can tell? However, I can tell their order fulfillment and marketing departments never seem to talk to each other."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 2,
          "Date": "2022-04-05T17:17:20.000Z",
          "Titre": "Terrible",
          "Contenu": "The wireless keyboard I received is terrible, it feels cheaply made and looses connection constantly even when it is less than 3 feet from the USB adapter. While typing quickly you will often notice that it misses keystrokes entirely, or types random letters you did not press. I use a computer and type all day for my profession and have a WPM of 75+, having a very responsive and accurate keyboard is essential, this is not it. I would give it a 0 if I could."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "elizabethbarcena",
          "Nb_Reviews": 2,
          "Date": "2022-12-18T10:33:05.000Z",
          "Titre": "Return Policy is a SHAM!",
          "Contenu": "I submitted a refund request and was responded to within 24-48 hours, via email, with a list of trouble-shooting tasks and told that if none of them solved the \"loud and glitchy keys\" to contact them for a replacement because it had been purchased more than 30 days ago. I replied the same day, advised them that I had completed the \"to do list\" but still found the keyboard to be extremely \"rough\", but more importantly, I explained that it had only been FIFTEEEN days (provided a copy of the Perixx email order confirmation), and that I'd like to process the return. Since then, I have contacted Perixx at least SEVEN times (via reply emails and new requests through their site). I am STILL waiting for a response, by someone, other than the automated reply email stating that \"someone will contact me within 24 hours\". It has now been more than a week, which definitely sends a very clear message that they are either incompetent (lacking the skill-set needed to process a return / reply to emails) or deceitful (waiting for the 30 day window to lapse). I will begin posting this review on every site possible until this issue gets resolved. Only make a purchase you are prepared to keep!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Tech Autos UK",
          "Nb_Reviews": 9,
          "Date": "2020-05-21T17:05:26.000Z",
          "Titre": "This is the worst customer services I have ever encountered.",
          "Contenu": "This is the worst customer services I have ever encountered.2 months emailing as I have two warranties to deal with and I've only had two basically auto responses.The products are the upright mice Perimice 519, its brilliant till it breaks as it fits my hand and the only one on the planet that does.But I've had 4 of them in 3 years and they only last 6 months of basic use and then something stops working.. So hacked off I started a warranty claims which was a real chore to begin with.. All I've had are two emails telling me to plug it into other pcs and they ignored everything I write. So off to facebook and after two weeks of messaging them on Messenger, still no one has answered, I know were in PDCV19 but I'm working and looking after my clients so why can't they?So as of this moment I'm into two warranties for two badly made mice and a company that refuses to answer any form of communication. Thats why Im here and I don't often spill my guts over the internet but this level of service is unjustifiable.JJ"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eazy E",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T06:15:45.000Z",
          "Titre": "Ordered item never received",
          "Contenu": "Ordered item never received, no human response from customer service. [MIDDLE FINGER EMOJI]"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tamika Jenkins",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T16:58:09.000Z",
          "Titre": "I have not received and no shipping…",
          "Contenu": "I have not received and no shipping status is available"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ANN FARMER",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T16:39:34.000Z",
          "Titre": "I HAVE NOT RECEIVED MY ORDER"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "richard mcdonough",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T17:51:44.000Z",
          "Titre": "Received the wrong product… How can I…",
          "Contenu": "Received the wrong product… How can I return it thank you"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mario Cruz",
          "Nb_Reviews": 1,
          "Date": "2022-06-27T16:26:34.000Z",
          "Titre": "have not received my order yet3"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "kerry jones",
          "Nb_Reviews": 6,
          "Date": "2022-07-25T17:32:05.000Z",
          "Titre": "Replacement keyboard worked for a week",
          "Contenu": "Replacement keyboard worked for a week, then several key quit working.  Think I need to change brands."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Omalley",
          "Nb_Reviews": 1,
          "Date": "2022-05-26T21:14:44.000Z",
          "Titre": "I have not received the product yet"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Debi Alger",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T16:56:39.000Z",
          "Titre": "As of 8/15 I have not received my…",
          "Contenu": "As of 8/15 I have not received my purchase nor a notification of shipment."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "BRIAN",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T16:23:12.000Z",
          "Titre": "Cheap plastic feet",
          "Contenu": "The keyboards left foot bent, the only option was to remove it, so now I can't rise the keyboard at all."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "John Steel",
          "Nb_Reviews": 2,
          "Date": "2022-04-14T11:44:20.000Z",
          "Titre": "The keyboard they sent me doesn't work…",
          "Contenu": "The keyboard they sent me doesn't work correctly. The 5,6,=,-, numberpad and shift keys don't work correctly. This is the case whether you plug it into a desktop PC or several laptops - the problem persists, and they will refuse to provide refund or replacement. Do not order from their vintage keyboard range if you can help it. They look nice, built to last, but don't carry the same level of function as a £10 keyboard can from your local electronics store."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Renata Larson",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T00:30:24.000Z",
          "Titre": "The letters and numbers on the keyboard…",
          "Contenu": "The letters and numbers on the keyboard are already wearing off and I've only been using the keyboard for 3 weeks. I have short fingernails so that's not the cause. Subpar keys."
        },
        {
          "Note": 3,
          "Lieu": "DK",
          "Pseudo": "Røskva Eilenberg",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T11:02:17.000Z",
          "Titre": "Questionable",
          "Contenu": "Bought a keyboard + mouse combo from them and and it works pretty well! In the beginning. Its been a bit under a year and my keyboard has started malfuntioning when i play with it for prolonged amounts of time. Sometimes even after just 10 minutes. The mouse has completely stopped working though. So the products are great but not long term. I do plan on buying from them again though, most likely same item."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephanie Green",
          "Nb_Reviews": 1,
          "Date": "2022-06-09T20:42:18.000Z",
          "Titre": "Overall I like the keyboard set up",
          "Contenu": "Overall I like the keyboard set up. However the capslock button does not always work as it should. Example, I turn capslock on, however, the letters are lower case; it isn't until I turn it off that I am able to type all upper case. This doesn't happen all the time but more an more frequently. It is my assumption that eventually there will be a permanent issue concerning this."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Yyy",
          "Nb_Reviews": 1,
          "Date": "2022-04-24T16:33:51.344Z",
          "Titre": "Be careful this is not a full-size…",
          "Contenu": "Be careful this is not a full-size keyboard and it that isn’t listed in the name"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff Eisenbrey",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T05:32:56.000Z",
          "Titre": "The key travel distance feels very deep",
          "Contenu": "The key travel distance feels very deep, and after a laptop keyboard, is quite loud. The layout and elevations are excellent. It will take some getting used to."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sophia",
          "Nb_Reviews": 2,
          "Date": "2022-05-15T17:50:32.000Z",
          "Titre": "After reading many reviews",
          "Contenu": "After reading many reviews, I got the Perixx keyboard.  It is a very conventional full size keyboard that is rather on the noisy side, very clickety-clack.  My search term was \"silent\" so this came as a bit of a shock.  It is like countless other keyboards I have bought, sometimes for double or triple the price.  All in the past have held up except that the letters eventually wear off.  The other surprise was that despite buying \"direct\" from the manufacturer, it arrived from NewEgg."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jay S",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T03:32:18.000Z",
          "Titre": "I received this order in two separate…",
          "Contenu": "I received this order in two separate parcels. There was no communication to indicate this would be the case. This raised uncertainty when the order was incomplete, nor was there any printed invoice or order in the first parcel. So I assumed it was over looked. I did, however, recieve it a few days after I had expectedit to arrive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shirley",
          "Nb_Reviews": 5,
          "Date": "2023-03-29T14:22:15.000Z",
          "Titre": "The product was very nice",
          "Contenu": "The product was very nice, but I thought the wrist rest could do with a little more padding. Love the interchangeable key caps altogether I did not need them, as I use a Mac. Instructions were so tiny I could not read them without the aid of a magnifying glass. All-in-all, the product was very good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2022-07-12T20:02:30.000Z",
          "Titre": "I really like this keyboard",
          "Contenu": "I really like this keyboard.  I have been using a Perixx keyboard for years and recently purchased a Microsoft ergonomic keyboard.  I hated the Microsoft version because the keys are located with unusual spacing and I frequently missed the delete or backspace key and was constantly hitting the all caps key.  The spacing on the Perixx is much better and fits my large hands. I also really like the added backlight feature.  I highly recommend this keyboard especially if you have large hands.   I only gave it four stars because I waited many months for the product to come available after being on backorder."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Hassey",
          "Nb_Reviews": 2,
          "Date": "2023-02-22T22:03:57.000Z",
          "Titre": "Very pleasantly surprised with Perixx's great customer support.",
          "Contenu": "Very good customer support and communication.I was a bit worried at first, because I purchased directly through the company's website, not through Amazon, but I was pleasantly surprised at Perixx's response and communication with me. I had purchased the Perixx 422, which is an awesomely quiet keyboard, but the layout of having the Up Arrow key where the (rt)Shift key should be, made it impossible to use. But the quietness was awesome. Even the scissor version of this 335RD keyboard was nowhere near as quiet as the 422, but Perixx has been great at helping me with my return. I would highly recommend Perixx keyboards and the company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jay Goetting",
          "Nb_Reviews": 6,
          "Date": "2022-05-22T02:45:36.000Z",
          "Titre": "After hearing one of the large online…",
          "Contenu": "After hearing one of the large online stores would take until July to ship my new keyboard, I went right to the source and got quick shipment.The device itself is first cabin -- I do miss the volume controls my old keyboard had, however."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-04-11T09:30:26.000Z",
          "Titre": "Amazing keyboard with one design flaw.",
          "Contenu": "Shipping was fast and excellent. Keyboard is fantastic. I rate 4 stars because of one little nit pick. The windows and alt keys on left side are in a slightly awkward spot and smaller than normal because of where the fn key is. I'm probably going to just rebind the windows key to be an alt key also since I use alt a lot and windows not so much. But it is really annoying to hit windows key when you mean alt and it's really easy to do. Other than that love the keyboard. Well made with great tactile."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric S.",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T22:58:22.000Z",
          "Titre": "I like having the touchpad rather than…",
          "Contenu": "I like having the touchpad rather than a mouse or trackball off to the side. This seems to result in less neck and shoulder pain for me.It would be nice if the touchpad was bigger, as that would make detailed work easier.Thanks,  Eric"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Weller",
          "Nb_Reviews": 4,
          "Date": "2023-03-29T20:29:16.000Z",
          "Titre": "Excellent quality",
          "Contenu": "Excellent quality and quick ship.  535 keyboard was exactly what I was expecting.  Only complaint is that tilt angle adjustment is all-or-none."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terence J. Golightly",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T03:04:32.000Z",
          "Titre": "I have yet to receive my order",
          "Contenu": "I have yet to receive my order.  So I am at this time unable to provide a product review.  Of my experience on your website.  Overall it was good, I found it a little busy with so many products appearing in my search.  But I found what I was looking for.  My current Perixx 713L is getting long in the tooth, so I ordered a new one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph Watson",
          "Nb_Reviews": 1,
          "Date": "2022-03-04T16:38:33.000Z",
          "Titre": "Photos tricky",
          "Contenu": "Speedy, as described.The only reason it was not 5 stars: photos portray trackball colors a little more vibrant"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "wardar",
          "Nb_Reviews": 2,
          "Date": "2023-08-16T21:07:56.000Z",
          "Titre": "Good value",
          "Contenu": "Layout is as expected but would like another \"less light\" on the PgDn setting."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T23:54:30.000Z",
          "Titre": "The pricing is great and lead-time is…",
          "Contenu": "The pricing is great and lead-time is awesome.  I would have given a 5* but the keyboard does not have back legs to prop up the angle more."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MN-Reviewer",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T15:34:03.000Z",
          "Titre": "Great price of a nice mechanical…",
          "Contenu": "Great price of a nice mechanical keyboard (328).  Keyboard remapping with downloadable driver didn't work with Windows 11."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angie",
          "Nb_Reviews": 2,
          "Date": "2023-01-23T18:37:45.000Z",
          "Titre": "This mouse is perfectly acceptable",
          "Contenu": "This mouse is perfectly acceptable. It doesn't work for me but that's me not the mouse. It arrived quickly and had good hand feel."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2022-02-16T05:03:25.000Z",
          "Titre": "Key lights",
          "Contenu": "The lights around the keys are a bit distracting.  Nice small keyboard.  Just what I was looking for."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Isabella Click",
          "Nb_Reviews": 1,
          "Date": "2022-02-10T16:00:03.000Z",
          "Titre": "Love it! Worth it!",
          "Contenu": "The mouse feels great, doesn’t hurt my wrist. Love the keyboard, super cute."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "na",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T00:49:56.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, somewhat vague delivery process."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Stephanie Plata",
          "Nb_Reviews": 1,
          "Date": "2022-02-06T00:54:24.000Z",
          "Titre": "Great product and costumer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Squires",
          "Nb_Reviews": 2,
          "Date": "2023-02-09T22:40:22.000Z",
          "Titre": "Can't order parts.",
          "Contenu": "Fast service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hilda Challender",
          "Nb_Reviews": 1,
          "Date": "2022-03-03T00:06:20.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, easy to install"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 4,
          "Date": "2023-06-23T03:15:17.000Z",
          "Titre": "12345678911"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "STELLA STRATTON",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T03:10:41.000Z",
          "Titre": "Perfect FIT",
          "Contenu": "Both the keyboard and mouse are just what the doctor ordered. I've never had a true ergonomic keyboard OR a verticle mouse but they are perfect. I thought the mouse would be difficult to adjust to but it just felt like I was shaking hands with someone. I like it already."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Uniontown PC",
          "Nb_Reviews": 4,
          "Date": "2023-10-27T21:35:00.000Z",
          "Titre": "Very impressive hardware",
          "Contenu": "Very impressive hardware, especially at this price point.  I ordered a wired keyboard and mouse and have been very pleased with both.  Wish this company would stock more items in their inventory, as I would like to make some more purchases, but the peripherals I want are all out of stock.  Other than that, I hope to do business with Perixx again in the future and look forward to trying out some of their other products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Home Office User",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T23:53:01.000Z",
          "Titre": "Great keyboard for a great price.",
          "Contenu": "The scissor keys are quiet (not silent) and comfortable for my small hands and my spouse's large ones. The large font is readable even in dim light. The detachable cable allows me to easily replace it if my cat chews through it, and a wired connection is more secure than a wireless signal. The compact design allows me to put the mouse closer to the keyboard, putting less strain on my arm and shoulder. The extra USB ports eliminate the need for a separate USB hub. The multimedia function keys are a nice bonus. I wish it had a white backlight. Otherwise, it's perfect for me. I hope it turns out to be durable, too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 5,
          "Date": "2023-09-20T16:24:19.000Z",
          "Titre": "The best value in thumb trackballs.",
          "Contenu": "Shipping: excellent.Product: excellent. Other thumb trackballs tend to have places where the trackball doesn't run smoothly, but I've yet to have a problem with Perixx in that regard. I got the wired trackball because its response time is faster than the wireless, making it a better choice for time sensitive input."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Finney",
          "Nb_Reviews": 4,
          "Date": "2023-09-23T06:54:12.000Z",
          "Titre": "Great Mechanical Keyboard",
          "Contenu": "I've worn out three keyboards and so was advised to get a mechanical one. Perixx was a great price and I love the feel of it. It is much better than membrane keyboards. The ergonomics are perfect too.  It is all I would expect from German engineering."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Green Candy",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T00:47:38.000Z",
          "Titre": "What a relief is this keyboard from all…",
          "Contenu": "What a relief is this keyboard from all the other \"would-be\" good brands keyboards! Perixx clearly makes things right. Must be german engineering, and yes: it is.Bright true colors and perfect key action. Thanks Perixx!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "eddacker",
          "Nb_Reviews": 8,
          "Date": "2023-03-04T14:53:56.000Z",
          "Titre": "My second purchase and I'm quite happy…",
          "Contenu": "My second purchase and I'm quite happy with both products price and quality match up with what I like. Not quite as fancy as the Logitech but one third the price and it has programmable buttons if you use Windows which Logitech doesn't. I think I might be buying a keyboard next I love their ergonomical full size keyboard."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2022-12-31T02:30:27.000Z",
          "Titre": "Good tactile feel, solidly built",
          "Contenu": "I needed a USB keyboard to send F1 to F12 signals to software, and the laptop (like many) does not allow the reprogramming of the F keys from their dedicated functions like volume or brightness up and down.  This keyboard is well made, feels solid, keys give a slight tactual feedback, no clicking or noise.  Backlighting is great.  Compact size for portable operations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eugene, Brooklyn,Ny",
          "Nb_Reviews": 6,
          "Date": "2023-07-06T22:20:35.000Z",
          "Titre": "PERIXX keyboards delivery",
          "Contenu": "Package was delivered to the front door of my apartment by UPS. Packing was good. Nothingdamaged. No e-mail about delivery at all. Those, who isresponsible for handling computers must bediscipline."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TW",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T05:43:48.000Z",
          "Titre": "Highly recommended",
          "Contenu": "Small compact size fits anywhere space is limited. Large font size with backlighting makes excellent visibility of the keys. However, I wish the backlight is designed to only illuminate the letters but not create a halo around the keys that would appear more elegant and less distracting to the eyes (similar to the backlight of Periboard 326 which I also own). I also would suggest Perixx use a warm neutral white backlight instead of the bluish backlight."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jake",
          "Nb_Reviews": 3,
          "Date": "2022-05-25T19:53:07.000Z",
          "Titre": "Good service, good product",
          "Contenu": "Perixx was remarkably prompt and helpful about addressing my pre-purchase questions. Shipping was quick. The product I bought (Periboard 613) seems very well designed--as a Mac user, I love being able to make it a Mac keyboard with just a switch rather than remapping the keys myself, and I'm impresses that they include a tool for swapping out the key caps. The only remaining question is my long-term experience with the keyboard, and I haven't had it long enough to answer that."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Nikki",
          "Nb_Reviews": 17,
          "Date": "2023-09-22T20:16:27.000Z",
          "Titre": "Periduo 406 Wired Ergo Combo is FABULOUS!",
          "Contenu": "I had an ergo keyboard from Perixx since Jan 2016, big thing, solid. Tried out a chic let ergo last week, wireless, which was awful (not made by Perixx), but it made me want to get a wired chic let ergo... was there one available... YES! Well, what can I say. GORGEOUS. come with an ergo mouse too! The one I rejected had a padded wrist rest, which got hot - absorbs body heat and throws it back at you - this one has a solid plastic wrist rest, no heat problem. The mouse is like silk, so quiet, smooth. Keyboard is very responsive, angle for wrists is so comfy, slightly clicky, but way way less than the old mechanical keyboard. For just £40... bargain! I am a very happy customer. Thank you Perixx for making this brilliant combo."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Muns",
          "Nb_Reviews": 7,
          "Date": "2023-02-12T18:41:35.000Z",
          "Titre": "Perixx products are great!",
          "Contenu": "Perixx products are a decent value for a solid material. I bond Perixx mouse pads to a layer of 3MM scuba fabric, then cover with Cordura to make holsters, protective medical bags and sling pads. They work perfectly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marc B",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T21:13:55.000Z",
          "Titre": "Was looking for a mechanical/ergo…",
          "Contenu": "Was looking for a mechanical/ergo keyboard.  I wasn't really interested in the split keyboards or the super weird ergonomic ones since I am not a good typist.  Stumbled across Perixx and purchased the new ergo mechanical keyboard.  I had one small technical issue which they were able to sort out for me (user error).  This thing is great - my neck and shoulder pain is starting to subside, and the typing experience is outstanding.  You don't really need to be a touch typist to use it and it's actually made my typing better as it forces my hands into a much more comfortable position.  This is a well-made and designed keyboard and it doesn't break the bank.  Once they release a wireless version I am making these the standard kit for my company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deepak Rajagopal",
          "Nb_Reviews": 1,
          "Date": "2023-05-14T01:05:43.000Z",
          "Titre": "Perixx shipped fast and were easy to…",
          "Contenu": "Perixx shipped fast and were easy to deal with. The website was easy to navigate. The product (wired vertical gaming mouse) has worked out great after an initial adjustment period. I am placing this review after around a year so the product has some longevity."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kaylen",
          "Nb_Reviews": 1,
          "Date": "2023-05-14T01:55:08.000Z",
          "Titre": "Bought it twice",
          "Contenu": "Second time buying this keyboard and mouse combo, getting this one to replace the old one at work. It's hard to beat the price, and having the extra scroll wheel on the keyboard is a feature I wish more keyboards had. Came pretty quick and everything was intact.My only complaint is with how plasticy the keys are, they do get kinda stuck after 2 years of consistent use at work. I would love to pay for a higher quality plastic or something to have it last a little longer, but a new board and mouse every 2 years with heavy use for only 50$ is a good deal to me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 3,
          "Date": "2023-07-13T03:27:58.000Z",
          "Titre": "Amazing company, amazing products",
          "Contenu": "In an age of bad customer of bad engineering, bad manufacturing, \"customer no service\" there is Perixx......the pack leader, who cares about the customer, before all else.  A cut above the rest."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Colocha",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T03:13:23.000Z",
          "Titre": "2nd Perixx mouse and I love it",
          "Contenu": "This is my second Perixx vertical mouse. I first got the version without Bluetooth and just the USB receiver, but I accidentally broke the receiver and couldn't find a replacement online. I was going to buy the Logitech Lift mouse because I really liked the colors but when I saw it in stores I didn't like the quiet clicking. I decided to buy the Bluetooth version of the Perixx instead and I definitely don't regret it. This is still my favorite mouse of all time and a whole lot cheaper than the logitech too. The shipping time was reasonable, I love how comfortable the mouse is and can definitely say that these are the mice that I could use forever. This brand is extremely underrated, and their products are great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EMILY SANDSTROM",
          "Nb_Reviews": 11,
          "Date": "2022-12-12T12:19:47.000Z",
          "Titre": "I type more than 120 words a minute all…",
          "Contenu": "I type more than 120 words a minute all day and half the night every day of the week.  Those scissor keys and the white backlight are gold.  The shorter keyboard is a godsend because the direction keys are at the end, not in the middle, of the keyboard, so easy to poke.I tend to wear keyboards out.  A key doesn't register as it should eventually.  Letting everyone know that if you set that keyboard aside a few months when you bring out the new one, it recovers!  This has happened several times."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leslie R",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T14:19:52.000Z",
          "Titre": "Great product, ordering was easy, shipping was fast",
          "Contenu": "Ordering was easy, shipping was fast. Product was well packaged and instructions clear. I had a small issue with connecting my mouse and quickly found the resolution on their web site. Great experience all around."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Buck",
          "Nb_Reviews": 2,
          "Date": "2022-12-31T22:42:07.000Z",
          "Titre": "At least the design is not Chinese!",
          "Contenu": "First time I've purchased from Perixx. I was happy to see a European based company, even if the production has a Chinese connection. At least the design was proven German expertise. I will definitely return to the Perixx site in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gabriela Castillo",
          "Nb_Reviews": 3,
          "Date": "2022-04-07T00:56:42.000Z",
          "Titre": "I am very satisfied with my purchase",
          "Contenu": "I am very satisfied with my purchase. I had wanted this specific mouse and was not available on Amazon. I decided to seek other options and found Perixx page. And on sale! So happy. I really recommend this mouse for its lightness and ergonomic comfortability. Thank you Perixx."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendy Domino",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T14:12:01.000Z",
          "Titre": "Quality merch and fast shipping",
          "Contenu": "Fast shipping, quality merch with honest reviews on their website"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bern",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T21:42:48.000Z",
          "Titre": "Good price for such a niche keyboard",
          "Contenu": "Good price for such a niche keyboard, shipped promptly, solid construction, very satisfied with it after two weeks of use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sky",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T21:49:32.000Z",
          "Titre": "Great mouse",
          "Contenu": "A solid, ergonomic mouse that is comfortable to use for long periods of time.Additionally, I haven't had any issues with the mouse (and no hand cramping!), everything works great. Shipping was fast; I ordered February 3rd and got the mouse on the 10th."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eugene, Brooklyn,Ny",
          "Nb_Reviews": 6,
          "Date": "2022-07-09T00:18:40.000Z",
          "Titre": "Right now I am using Perixx white…",
          "Contenu": "Right now I am using Perixx white keyboard. Digits is OK, big and dark, easy to use. Letters lines is very thing and visibility not so good, shall be more thick and moreblack. Keyboard quiet, much better than HP keyboard.Overall is good. Respectfully,   Eugene, NY"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sonya  Quintal",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T01:52:37.000Z",
          "Titre": "I lover perixx products",
          "Contenu": "I lover perixx products.  This is my first experience ordering from Perixx directly.  I would definitely recommend ordering direct.  The range of products offered is greater.  I was able to find a products in my choice of color that was out of stock on another site by ordering direct.  The shipping was fast, although the packing was not secure considering this was electronics, my order arrived undamaged."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 2,
          "Date": "2023-05-22T17:03:30.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience.  Great price, shipped regionally from Newegg.  Received it within days.Product was 312 illuminated keyboard, and I love it so far.  Nice touch, illumination works great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan A Mauck",
          "Nb_Reviews": 1,
          "Date": "2022-05-13T19:07:50.000Z",
          "Titre": "Great product!",
          "Contenu": "When the keyboard on my laptop failed, my husband suggested a Perixx portable like the one he owns. Instead of ordering from Amazon, I decided to order directly from Perixx. The keyboard arrived quickly and works well. It is lightweight and compact."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Furlow",
          "Nb_Reviews": 2,
          "Date": "2022-09-23T04:29:28.000Z",
          "Titre": "This keyboard is great!",
          "Contenu": "This keyboard is great! Typing is so smooth and everything worked perfectly right out of the box (unlike the keyboard it's replacing). My one gripe is that you have to manually turn the backlight off before turning your computer off. Still, 5 stars!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Octavio Pulmano",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T01:06:17.000Z",
          "Titre": "My experience with my Perixx keyboard... excellent performance...",
          "Contenu": "The keyboard performance is excellent. My only comment -\"It took too long for the delivery. It arrived when I was almost in the process of cancelling the order. However, I presently enjoy using my Perixx keyboard."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Varifed Purchase",
          "Nb_Reviews": 3,
          "Date": "2022-09-07T16:42:20.000Z",
          "Titre": "Well worth it",
          "Contenu": "Hands down this is the most durable keyboard I have ever used. Its a solid base, perfect height for the palm rest and a split space bar really adds to this design.It also has 2 USB ports on the side of should you lack ports or need easy aces to them.  The only thing (for me) that is lacking is the Open New Browser button. This is a perfect replacement for those (like myself) that have used the Microsoft 4000. With that said I do not expect the key print to wear off in a few weeks. Would purchase again Would also recommend to anyone that is looking for an exceptional keyboard."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lou Metzger",
          "Nb_Reviews": 7,
          "Date": "2022-09-14T22:02:05.000Z",
          "Titre": "This is exactly what I was looking for",
          "Contenu": "This is exactly what I was looking for.  Have only used for a day and the backlit keyboard with full size letters on each key is easy on the eyes.  The scissors key style is fast, has great touch and is 10 times better than my previous keyboard.  Delivery was faster than promised. The price point was low for a keyboard of this fine quality.  Would buy again.  I'm completely pleased with this purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob P.",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T21:01:43.000Z",
          "Titre": "Great trackball!",
          "Contenu": "Great, fast service!  I currently use a Logi MX Ergo Plus and wanted a wired trackball that was close to the ergonomics of the MX Ergo for home use.  This Perimice-520 fits the bill perfectly!  Trackball, wheel, and buttons all feel good.  The only thing I did was add some weight inside the base to make it feel more planted, as it felt top-heavy with just a hollow base."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry D'Esposito",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T17:47:05.000Z",
          "Titre": "Great products!",
          "Contenu": "Great products!!  One item had delivery information incorrect and support responded quickly to email for status.  That gives confidence in knowing theyre responsive should there be any issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Captain John",
          "Nb_Reviews": 2,
          "Date": "2022-10-03T20:38:19.000Z",
          "Titre": "We have a winner here",
          "Contenu": "Nice keyboard that emulates the original IBM PC keyboards well (size, keyboard layout, tactile feel). Only concern is with the printing on the keys; would like to see manufacturers offer engraved characters which would have substantial durability, unlike the keyboard which Dell shipped with one of my computers — the characters started wearing away after about six weeks. Overall, the Perixx keyboard looks like a winner."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "ROBERT KOCH",
          "Nb_Reviews": 34,
          "Date": "2020-06-02T16:39:49.000Z",
          "Titre": "The best computer mouse in Town!!!!!!",
          "Contenu": "Suffering from RSI and shoulder pains i needed to buy a new computer mouse and being left handed searched the net for weeks until i came across the Perimice 718 and read up and spoke to their H/O in Germany and i liked what i heard and the service was truly superb having spoken to Win who was so supportive.I received the mouse and all i can say the rest is history, words cannot describe the quality of the mouse and how easy it is to use and Ergonomic 100% , even after i bought it Win was so supportive and honestly could not fault it so far nor will i. I cannot recommend Perixx keyboards and mouses enough for both quality and use and depending on your needs you need not look any further than this company. WELL DONE!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EMILY SANDSTROM",
          "Nb_Reviews": 11,
          "Date": "2022-07-21T09:02:21.000Z",
          "Titre": "TREAT YOURSELF TO ONE OF THESE FOR THESE FOR THE NEXT 10 YEARS",
          "Contenu": "This is my second purchase of the ergonomic vertical mouse.  The first one lasted ten years of daily ten-hour heavy use.  It still works but the screen moves up every once in a while, and it doesn't do that with the new one.  Feels much tighter.  Glad I replaced Number One.If you are hours a day at a computer, treat yourself to one of these:  You will love yourself for it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "master",
          "Nb_Reviews": 5,
          "Date": "2023-06-21T00:39:57.000Z",
          "Titre": "Most Ergonomic Keyboard Available",
          "Contenu": "This is the most ergonomic, one piece keyboard available.  It is wireless.  I connected via Bluetooth instead of the 2.4ghz band and it works great."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Omey Iin",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T06:13:05.000Z",
          "Titre": "Great Service!",
          "Contenu": "After 4 months of using my keyboard, it suddenly stopped working. As soon I emailed and complete some trouble shooting, a replacement was sent. Very happy with their service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carter",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T20:06:26.000Z",
          "Titre": "It works great for browsing",
          "Contenu": "It works great for browsing! I mainly got it just to browse the internet on my Steam Deck & the wireless range is efficient from the couch to the TV! Functional & cheap!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sid",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T03:58:51.000Z",
          "Titre": "Great purchase",
          "Contenu": "Fast delivery, keyboards were well packaged, website was detailed and easy to use making my selection process easier. The items purchased look and feel great. I would definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angel",
          "Nb_Reviews": 1,
          "Date": "2023-02-25T21:15:49.000Z",
          "Titre": "Thank you!",
          "Contenu": "Thank you for the fast delivery and the great product! The keyboard I bought for my mother works great, and is perfect for keeping her hands and wrists comfortable while working! Love it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phillip",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T04:02:47.000Z",
          "Titre": "Great all around experience!",
          "Contenu": "Easy ordering, fast and free shipping. I love the keyboard! Also have many positive comments on it in the office. Very satisfied!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank N.",
          "Nb_Reviews": 2,
          "Date": "2022-05-18T21:29:51.000Z",
          "Titre": "Excellent product I was searching for a…",
          "Contenu": "Excellent product I was searching for a wired trackball mouse with a good design. Found Perixx and met and exceeded expectations. Thank you Perixx for a quality product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JB",
          "Nb_Reviews": 4,
          "Date": "2023-01-25T01:22:09.000Z",
          "Titre": "Great Quality Keyboard (Periboard-535)",
          "Contenu": "Great Quality Product, I bought the Periboard-535 keyboard and wow I am impressed. This has to be the best keyboard I have ever used. I type a lot and go through keyboards like crazy. This one feels like it is going to be with me longer than most just by the sheer feel of the quality.I also own a mouse they make and it has been great as well. I have had it for about a year and a half, better than I can say for some of the other brands out there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EVARISTO ROMAN",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T04:35:01.000Z",
          "Titre": "Great quality product at a great price…",
          "Contenu": "Great quality product at a great price point. Delivered as promised. Well packed with zero damage. Performs as advertised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dr. Mark Faulk",
          "Nb_Reviews": 1,
          "Date": "2022-09-09T05:23:59.000Z",
          "Titre": "A new brand for me and my new computer…",
          "Contenu": "A new brand for me and my new computer mouse is fantastic! I have large hands and the mouse fits comfortably (I have carpal tunnel). Easy set up and smooth cursor function. So happy I found this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 3,
          "Date": "2023-02-09T19:34:17.000Z",
          "Titre": "Solid trackball for the Price!",
          "Contenu": "Received my \"PERIMICE-520 - Wired Ergonomic Vertical Trackball Mouse Adjustable Angle Programmable Buttons\" quickly. I bought the Kensington Pro Fit Ergo Vertical trackball earlier, so I will compare the two. The Kensington has a nicer feel in the hand, I like the texture and the weight of the mouse. It also has two more progammable buttons than the Permice-520 (though these have been more in the way than useful) and the software for the Kensington has more options. HOWEVER, the trackball stutters whenever I move the ball slowly for fine movements, which is bad for trying to click a small button or place a curser where you want it to highlight text ect. I have cleaned the ball and the inside of the mouse, felt for rough spots, called Kensington support which had me do all those things again, to no avail. I am am not the only one with this problem, I have seen this complaint in other reviews and thought it was just a fluke... I have had no problems like this with the Perimice-520. I decided to take the ball from the Perimice and try it in the Kensington, as the ball seemed smoother. It works great now. Put the Kensington ball in the Perimice and surprisingly, it is also working fine. For about $20 less, the Perimice-520 is definitely worth it to avoid the irritation of a trackball that doesn't give you smooth fine movement out of the box. It's a solid trackball that I am still happy to use, even coming from a trackball that feels a touch nicer in the hand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kris Zobell",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T16:51:15.000Z",
          "Titre": "Very good keyboard",
          "Contenu": "Very good keyboard.  I have arthritis in my fingers and this keyboard really helps.  Fast shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Blaikie",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T01:35:53.000Z",
          "Titre": "Good product",
          "Contenu": "good product. About a week delivery. Not bad considering the size of the company. No issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T23:06:29.000Z",
          "Titre": "The price is right",
          "Contenu": "I was looking for a good built computer keyboard I could use at night in a dark room with big Print on the keys. When I came across the Perixx online I said to myself let me give it a try. It has big print and back lit keys and a nice Design. Just what I was looking for"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "STEPHEN NELSON",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T15:28:09.000Z",
          "Titre": "Just what I needed",
          "Contenu": "Just what I needed, a good standard lighted keyboard at a very reasonable price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Barker",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T22:11:12.000Z",
          "Titre": "Very Pleasant Experience.",
          "Contenu": "The Rep that I communicated with was extremely  helpful and fulfilled my request to cancel my order.  Very pleasant experience.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacob Donatelle",
          "Nb_Reviews": 2,
          "Date": "2022-11-13T07:05:04.000Z",
          "Titre": "Great keyboard",
          "Contenu": "Great keyboard - solid price!  Responsive, fits well, and I now have two of them to make sure I'm using this same style of keyboard all the time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hillary J",
          "Nb_Reviews": 1,
          "Date": "2022-03-07T16:08:03.000Z",
          "Titre": "What a relief",
          "Contenu": "What a relief, this mouse is perfect, easy to use and a game changer. I was having pain in my middle finger and the ergonomics on the standard mouse at my work was terrible. Now I bring my new mouse to work and no pain! Yay"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Traci Polk",
          "Nb_Reviews": 2,
          "Date": "2022-11-03T00:31:11.000Z",
          "Titre": "Shipping was fast",
          "Contenu": "Shipping was fast. Keyboard / Mouse combo set up was easy. I liked the equipment very much, but discovered I could not live without a 10 key option on the keyboard."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Veronica",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T03:59:33.000Z",
          "Titre": "Fast delivery",
          "Contenu": "Fast delivery.  Still getting used to the keyboard I like it so far. Bad customer service though. You have to leave a message and then wait 24 hrs to get a call back. Didn't like that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Driver Inc",
          "Nb_Reviews": 3,
          "Date": "2023-08-30T20:08:04.000Z",
          "Titre": "great product for the price",
          "Contenu": "Great product very easy to connect and set up and was very reasonably priced. I would recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2022-01-28T00:30:01.000Z",
          "Titre": "This keyboard is great",
          "Contenu": "This keyboard is great. I like how responsive the keys are. It’s very hard to find a backlit ergonomic keyboard, I am very pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phoebe Collins",
          "Nb_Reviews": 3,
          "Date": "2023-04-29T05:30:10.000Z",
          "Titre": "I love my purple 💜 lighted keyboard",
          "Contenu": "I love my purple 💜 lighted keyboard! I love the easy way of ordering and returning if things don't work out.  This is a user friendly company!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rhonda Glass",
          "Nb_Reviews": 1,
          "Date": "2022-03-17T16:13:04.000Z",
          "Titre": "I am especially happy with my new…",
          "Contenu": "I am especially happy with my new mouse! I have a large hand that tends to cramp with most mouse but this one is big enough to keep that from happening. The keyboard is just what I needed. Keys are very easy to see and the back light is just Great at night. Both were delivered in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Connor Pickerill",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T23:32:26.000Z",
          "Titre": "Great!",
          "Contenu": "Great quality product at fair prices, kept me regularly updated with delivery status"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T04:42:17.000Z",
          "Titre": "Good product and service",
          "Contenu": "Good product, good service. Absolutely no complaints. I bought one of the trackballs (Perimouse 520)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katrina Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T20:37:41.000Z",
          "Titre": "I absolutely love this keyboard",
          "Contenu": "I absolutely love this keyboard. Great price and fast delivery.  I definitely recommend this product and this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Jan",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T04:20:06.000Z",
          "Titre": "Exactly what I wanted for a laptop",
          "Contenu": "Exactly what I wanted for a laptop. Currently using a wired trackball and ergo keyboard on my work set-up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T00:30:15.000Z",
          "Titre": "Great keyboard",
          "Contenu": "I like my keyboard.  Best one I've ever owned. Only complaint was that the company asked me for a review before their product showed up at my house."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CH",
          "Nb_Reviews": 2,
          "Date": "2022-02-23T00:42:29.000Z",
          "Titre": "Great selection",
          "Contenu": "Great selection. Delivered as promised on time. Nice and smooth transaction. Good job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T04:27:35.000Z",
          "Titre": "It's a good keyboard",
          "Contenu": "It's a good keyboard but unfortunately my wife didn't like it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Kristiansen",
          "Nb_Reviews": 2,
          "Date": "2022-03-18T17:15:14.000Z",
          "Titre": "Finding what I wanted was easy and the…",
          "Contenu": "Finding what I wanted was easy and the order was placed and delivered.Timing was perfect and I will visit Perixx again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Pierce",
          "Nb_Reviews": 2,
          "Date": "2022-09-12T01:19:46.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping, they could have been a little more pro active posting processing information."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Oliphant",
          "Nb_Reviews": 2,
          "Date": "2023-04-13T22:39:03.000Z",
          "Titre": "Second one that I have purchased",
          "Contenu": "Second one that I have purchased.  Bought this one for my return to the office.  Great price buying directly.  Less that you know who, where I bought my first one from."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DAVID",
          "Nb_Reviews": 2,
          "Date": "2022-05-29T04:22:04.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. They responded promptly to my emails and replaced my defective keyboard without a problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Scott",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T23:04:57.000Z",
          "Titre": "Item arrived very quickly and packaged…",
          "Contenu": "Item arrived very quickly and packaged well. The keyboard is great, seem very high quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dirck Goss",
          "Nb_Reviews": 1,
          "Date": "2022-06-04T21:44:03.000Z",
          "Titre": "Going back to PS-2 mouse and keyboard…",
          "Contenu": "Going back to PS-2 mouse and keyboard on older Dell workstation stopped the annoying delays encountered with USB mouse and keyboard during printing, scanning, and other activities."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Troy Greer",
          "Nb_Reviews": 1,
          "Date": "2022-07-24T21:49:29.000Z",
          "Titre": "Faster delivery than advertised",
          "Contenu": "Faster delivery than advertised, product came well protected and in great shape"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Greene",
          "Nb_Reviews": 2,
          "Date": "2022-01-27T18:07:02.000Z",
          "Titre": "Came in early and works great would be…",
          "Contenu": "Came in early and works great would be recommending this site to others"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KMcCMedia",
          "Nb_Reviews": 1,
          "Date": "2022-05-12T17:45:44.000Z",
          "Titre": "Sweet little trackpad KB",
          "Contenu": "Item arrived. Works as expected. Sweet little trackpad KB for crash kit"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank J.",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T02:27:19.000Z",
          "Titre": "As advertised!",
          "Contenu": "Very pleased with this keyboard. Exactly as advertised. Prompt delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "G H",
          "Nb_Reviews": 2,
          "Date": "2023-07-25T03:58:30.000Z",
          "Titre": "The MAC/WINDOWS button comes in to play…",
          "Contenu": "The MAC/WINDOWS button comes in to play and that was the problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Suzanne Seidel",
          "Nb_Reviews": 2,
          "Date": "2022-04-08T01:58:48.000Z",
          "Titre": "Love",
          "Contenu": "My keyboard and mouse came so quickly, were exactly what I wanted, and were so easy to connect to my laptop. I'm very, very pleased. :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "j. h.",
          "Nb_Reviews": 1,
          "Date": "2022-07-03T22:59:47.000Z",
          "Titre": "keyboard",
          "Contenu": "keyboard is ergonomic and helps with my neck and shoulder issues"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Stephen Elstob",
          "Nb_Reviews": 8,
          "Date": "2023-05-14T12:15:57.000Z",
          "Titre": "This company has absolutely outstanding…",
          "Contenu": "This company has absolutely outstanding customer services nothing is a problem ever quality of the stuff is very high Absolutely Fabulous company to deal with"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Keriazakos",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T20:24:13.000Z",
          "Titre": "The items arrived quickly and were…",
          "Contenu": "The items arrived quickly and were exactly what I was looking for!  Just as described.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bonnie",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T02:37:37.000Z",
          "Titre": "Quick delivery",
          "Contenu": "Quick delivery, great keyboard & mouse"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mari",
          "Nb_Reviews": 6,
          "Date": "2023-06-25T01:43:19.000Z",
          "Titre": "5 stars!",
          "Contenu": "Product arrived working and on time. No complaints!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Sayid",
          "Nb_Reviews": 1,
          "Date": "2022-04-20T11:34:38.682Z",
          "Titre": "The keyboard came quickly",
          "Contenu": "The keyboard came quickly , it was easy to order and it works perfect. No complaints at all . I’ll use Perixx again ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley",
          "Nb_Reviews": 7,
          "Date": "2023-05-13T02:20:31.000Z",
          "Titre": "I bought a part for an old keyboard and…",
          "Contenu": "I bought a part for an old keyboard and I was pleased it was still available"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Kristiansen",
          "Nb_Reviews": 2,
          "Date": "2022-03-11T17:00:14.000Z",
          "Titre": "This was my first experience with…",
          "Contenu": "This was my first experience with Perixx.  I am pleased with the outcome"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MP",
          "Nb_Reviews": 2,
          "Date": "2023-05-11T21:29:02.000Z",
          "Titre": "The ergonomics are great!",
          "Contenu": "The ergonomics are great.  I'm really happy with it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory Alvarez",
          "Nb_Reviews": 1,
          "Date": "2022-03-24T22:49:13.000Z",
          "Titre": "Progress report told me my order was on…",
          "Contenu": "Progress report told me my order was on the way, but it was’t really.  It was on my front porch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edna Rohler",
          "Nb_Reviews": 2,
          "Date": "2023-02-05T14:09:59.000Z",
          "Titre": "My mouse arrived in good time",
          "Contenu": "My mouse arrived in good time. Ordering was easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Solomon",
          "Nb_Reviews": 2,
          "Date": "2023-06-03T06:45:17.000Z",
          "Titre": "Great customer support love my new…",
          "Contenu": "Great customer support love my new keyboard"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B. Pierson",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T06:23:04.000Z",
          "Titre": "Item was received quickly in perfect…",
          "Contenu": "Item was received quickly in perfect condition! :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J. Theodore Fink",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T16:09:39.000Z",
          "Titre": "Good products and good service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Weitenbeck",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T02:14:27.000Z",
          "Titre": "order came promptly",
          "Contenu": "order came promptly, accurately"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Genevieve Ladwig",
          "Nb_Reviews": 1,
          "Date": "2022-07-08T06:12:46.000Z",
          "Titre": "Great service",
          "Contenu": "Everything went well. Everthing from ordering and delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sherry Evans",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T21:11:22.000Z",
          "Titre": "Website was easy",
          "Contenu": "Website was easy, confirmation quick and order on time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cynthia Lott",
          "Nb_Reviews": 3,
          "Date": "2022-05-25T23:50:53.000Z",
          "Titre": "Mouse ball",
          "Contenu": "The item is beautiful and exactly what I wanted"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Warmoth",
          "Nb_Reviews": 2,
          "Date": "2022-02-04T16:46:17.000Z",
          "Titre": "Ordering was easy",
          "Contenu": "Ordering was easy. Order was filled and shipped promptly"
        }
      ]
    }
  ]
}