{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "photowhoa.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Harrie Lambrichts",
          "Nb_Reviews": 5,
          "Date": "2023-11-09T19:23:41.000Z",
          "Titre": "I am totally not happy because the…",
          "Contenu": "I am totally not happy because the presets are not working with lightroom they are not compatible... i cannot use them at all and.... i get no reaction of the helpdesk, very bad service. They promise money back in 30 days but that does not happen also... i never order again.... sorry guys ..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chuck Schang",
          "Nb_Reviews": 3,
          "Date": "2023-10-03T13:47:49.000Z",
          "Titre": "Just purchased 2-in-1 Cool Photoshop…",
          "Contenu": "Just purchased 2-in-1 Cool Photoshop Effects Bundle.  The bundle only came with instructions for the 16 Modern digital Photo effects.  The Pop-up 3D bundle did not.  Can't work with these files without instructions.10/3...The help file that came with this bundle is NOT for the pop-up bundle.  Also, you state in your reply that you have e-mailed me a copy of the help file.  Never received!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Ederle",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T20:20:12.000Z",
          "Titre": "The download link that was emailed to me does not work",
          "Contenu": "The download link that was emailed to me does not work. I have emailed the \"Support\" several times and they have not sent me a link to download my purchase on 3/10/23. Today, is 3/17/23 and I still am not able to download the files I purchased and was charged for on 3/10/23. I will have to dispute the charge on my credit card tomorrow. How hard is it to send a download link that works?"
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Silvio",
          "Nb_Reviews": 2,
          "Date": "2022-08-25T14:20:15.000Z",
          "Titre": "A very bad shopping experience",
          "Contenu": "A very bad shopping experience. I purchased a photography video course and it is not possible to view it. A real steal, now I'm waiting for the refund."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Consumer Warrior",
          "Nb_Reviews": 39,
          "Date": "2023-03-11T10:15:11.000Z",
          "Titre": "Review by Professional Photographer",
          "Contenu": "This product, like many other products from this company, does not work correctly.Some of the products can be repaired by downloading very specific unzip programs, then doing lots of work converting the files to various file types, this, however, does not work with many of the files.I spoke to support regarding this and they were not particularly helpful so agreed to cancel my membership.  Following this they offered me a discount if I rejoined, which turned out to be the opportunity to rejoin at the full price, which I found baffling and, of course, refused.This company continues to debit my card for monthly payments, despite me not having a membership and they ignore all of my support requests regarding this.I was an IT professional for many years so can confirm that it was not an error by myself regarding these products.Avoid this company, they are just trying to get you to sign up so that thry can generate a passive income for themselves without actually providing any value.Please also be advised that all reviews left on their website are first reviewed by the company, this means that they can remove any negative reviews and always has positive reviews."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T01:03:47.000Z",
          "Titre": "It didn't work!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T22:20:45.000Z",
          "Titre": "DOWNLOADs do NOT work!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 10,
          "Date": "2023-06-03T05:56:47.000Z",
          "Titre": "the order would not open"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dale Curless",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T04:19:14.000Z",
          "Titre": "Support Failure",
          "Contenu": "I ordered digital products from PhotoWhoa and experienced problems in downloading them from their website. I opened a support ticket and, after almost three days, have had no contact and no remedy. Poor service and I am out of pocket $29 for the product ordered."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Ruth Chudaska-Clemenz",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T18:41:29.000Z",
          "Titre": "PhotoWhoa in general is absolutely ok",
          "Contenu": "PhotoWhoa in general is absolutely ok. I actually bought the Digital painting course. The speaker and artist was quite good but in the first part the monotoneous hammering synthesiser \"music\" over the full length of the film was horrible. It was also covering the speech, so I could not turn to mute if I wanted to listen to the content. When I want to listen to music I want to listen to real music but not to background halloween-like, aweful sounds. If I had known before I would not have spent the money."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T01:29:55.000Z",
          "Titre": "Photowhoa quality",
          "Contenu": "Photowhoa has certainly delivered some high quality artwork that has made photo editing quite a bit easier."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "LesC",
          "Nb_Reviews": 19,
          "Date": "2023-12-07T15:29:44.000Z",
          "Titre": "PhotoWhoa always has stuff that can be…",
          "Contenu": "PhotoWhoa always has stuff that can be applied in a popular photo editing program like Photoshop. Luckily, they also have files that are compatible with Affinity Photo as well. PhotoWhoa recently made a lot of 'freebees' available, most of which can be used in Affinity Photo, e.g. for developing Xmas cards. Perhaps a bit late for this year's card, but I will definitely use them next year."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Anna Maria ZAMBITO",
          "Nb_Reviews": 5,
          "Date": "2023-11-22T05:17:28.000Z",
          "Titre": "I was able to access the free resources…",
          "Contenu": "I was able to access the free resources easily and they were sent to my inbox as soon as I went through the checkout.It also has a lot of other resources that would assist photo editing."
        },
        {
          "Note": 4,
          "Lieu": "BS",
          "Pseudo": "Cornel",
          "Nb_Reviews": 4,
          "Date": "2023-09-26T15:21:57.000Z",
          "Titre": "Photowhoa site",
          "Contenu": "I have been a member of Photowhoa for a few years. I go there for many of my learning material. However, I do have one small issue, they need to keep uptodate with their material. Having said that I still find this site informative."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Sad Muppet",
          "Nb_Reviews": 10,
          "Date": "2023-08-14T18:36:32.000Z",
          "Titre": "Good Photographic Resource",
          "Contenu": "Good site for photographers - if you sign up to their Plus membership, you get a discount and a lot of free video tutorials as well. I've bought a few items along the way and obviously, all the video tutorials.The only issue I have is that their download server isn't the greatest - sometimes I can download the content in one click, othertimes several, on the odd occassion, a support email has been needed to get it to be fixed. But at least it gets fixed. Overall though, it is a good resource."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 2,
          "Date": "2023-06-12T20:56:28.000Z",
          "Titre": "A good resource for any photographer",
          "Contenu": "PhotoWhoa has a vast assortment of info and apps for almost any level of photographer. Prices are reasonable and every now and again PhotoWho will release a free item. Downloads are available from your account immediately after purchase."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Veronica Baas",
          "Nb_Reviews": 4,
          "Date": "2023-08-15T06:52:44.000Z",
          "Titre": "This will be a great opportunity to learn so much more.",
          "Contenu": "I have only just started here and have had a quick look through what tutorials are on offer and agree that the offers are really good and they will enhance my experience with my photography. I like how they also offer video tutorials as well which will be of great benefit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dimitris",
          "Nb_Reviews": 5,
          "Date": "2023-03-31T05:51:49.000Z",
          "Titre": "Very good variety and quality.",
          "Contenu": "They have a wide variety of photo products that I have found useful and of good quality. Recently I purchased an item that included a couple corrupted files. Arguably they should be validating the integrity of the files they offer. Regardless, I contacted them and they provided corrected files. Gives me confidence they can address issues."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Jessica Smith",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T09:20:31.000Z",
          "Titre": "This website is great",
          "Contenu": "This website is great for photographers. With a Plus membership, you get discounts and access to numerous free video tutorials. They are responsive to support emails and resolve the problems. Despite this, it remains a valuable resource for photographers."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jason",
          "Nb_Reviews": 4,
          "Date": "2023-06-03T06:22:06.000Z",
          "Titre": "It's worth it to subscribe",
          "Contenu": "If you sub to this service and regularly check there's tonnes of great free stuff. Sometimes great discounts as well. Emails get a bit tedious, but when you get something really cool out it, makes it completely worth it.Honestly, I haven't tried the courses yet, but i have a bunch downloaded and waiting to go at it. I have high hopes."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T23:22:24.000Z",
          "Titre": "A bit confusing but worked well...",
          "Contenu": "It was just a bit confusing as the order didn't come via email so it took a while to find it. But the presets I got were great!"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Henriette van Gasteren",
          "Nb_Reviews": 4,
          "Date": "2023-08-02T13:00:52.000Z",
          "Titre": "Great interview",
          "Contenu": "PotoWhoa published a very good and personal interview about my work and me. They are very insightful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T20:26:27.000Z",
          "Titre": "Your products are always very helpful",
          "Contenu": "Your products are always very helpful, whether its your instructional guides, or photoshop actions and templates, you have help me learn how to make stunning composite images   thank you!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Bruno Parent",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T02:23:32.000Z",
          "Titre": "Could not download the product because…",
          "Contenu": "Could not download the product because of a Network Error…thanks for the quick help in resolving the issue !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff Couture",
          "Nb_Reviews": 2,
          "Date": "2023-04-19T01:23:32.000Z",
          "Titre": "There is a wealth of info here but…",
          "Contenu": "There is a wealth of info here but people with slow internet connection may have difficulties."
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "Erwin Salens",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T10:10:43.000Z",
          "Titre": "INSPIRATION-KNOWLEDGE",
          "Contenu": "I  AM VERY SURPRISED AND SATISFIED. I. broaden my knowledge and stay informed of new developments"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Hall",
          "Nb_Reviews": 3,
          "Date": "2023-02-09T14:39:35.000Z",
          "Titre": "I had some initial problems related to…",
          "Contenu": "I had some initial problems related to two different email accounts - they helped me resolve this - download contents fit the description and can be accessed repeatedly if necessary. Would be helpful to have a better description of individual contents within a bundle so could be more selective in what gets downloaded"
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Steffen",
          "Nb_Reviews": 3,
          "Date": "2023-04-16T18:01:03.000Z",
          "Titre": "You can find A lot of great deals for…",
          "Contenu": "You can find A lot of great deals for the masterclasses, and other useful content."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "E. MacKay",
          "Nb_Reviews": 3,
          "Date": "2022-12-12T18:26:14.000Z",
          "Titre": "I enjoy tools offered by your site.",
          "Contenu": "I enjoy the advantage of having the tools to offer making look better than I am!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roger",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T00:48:02.000Z",
          "Titre": "Wide variety of products",
          "Contenu": "Wide variety of products, from free to moderately-priced."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 10,
          "Date": "2023-07-28T16:24:37.000Z",
          "Titre": "problem downloading--problem was…",
          "Contenu": "problem downloading--problem was resolved by photo whoa in a timely matter"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pavlaki",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T17:53:15.000Z",
          "Titre": "Great useful tools for a good fair price!",
          "Contenu": "Very Nice selection of Tools for the Photographer!"
        },
        {
          "Note": 4,
          "Lieu": "PE",
          "Pseudo": "Jim",
          "Nb_Reviews": 5,
          "Date": "2022-12-01T20:04:38.000Z",
          "Titre": "I had a problem with the discount code…",
          "Contenu": "I had a problem with the discount code but you fixed it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "E. MacKay",
          "Nb_Reviews": 3,
          "Date": "2023-10-03T00:07:22.000Z",
          "Titre": "Thanks for your service."
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Mac Moses Michael",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T10:19:56.000Z",
          "Titre": "Great partners"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alan",
          "Nb_Reviews": 3,
          "Date": "2023-08-10T22:27:04.000Z",
          "Titre": "Practical offers.",
          "Contenu": "Love the practical offers."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Nomad Ironstone",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T21:33:24.000Z",
          "Titre": "Decent quality downloads",
          "Contenu": "Decent quality downloads, prompt delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "West Won",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T22:26:44.000Z",
          "Titre": "awesome website and the best for…",
          "Contenu": "awesome website and the best for inspiration.... ever feel blah? stuck? there emails and products can assist on so many levels .... where you get inspiration from them or their post inspires a completely different thought process ... THEY HELP YOU GET MOVING~! Sign up today ...."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mike Simkins",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T22:21:21.000Z",
          "Titre": "Great Website",
          "Contenu": "Great Website, some nice 'freebies', and good pricing discounts on tools, and courses. Minimal membership fee to get the discounts, very pleased with what I have purchased so far."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Arnt Morten",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T19:56:39.000Z",
          "Titre": "I love PhotoWhoa",
          "Contenu": "I love those courses, eBooks and presets that I´ve already got. They are all really helpful to me.And when I didn´t understand how to install .cube Luts in Affinity and Lightroom, PhotoWhoa support gave me the solution. I just love it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "L Nevins",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T21:24:02.000Z",
          "Titre": "Economical quality editing resources",
          "Contenu": "I really appreciate PhotoWhoa. They offer tools and additions that make my photography editing easier and help me produce higher quality images."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Manthan Gajjar",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T08:16:52.000Z",
          "Titre": "perfect for beginners",
          "Contenu": "Certainly one of the finest photo training/resource platforms available. The website offers excellent content is regularly updated, and, most importantly, the pricing is more than fair. keep up the good work team..."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Sofia Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T19:33:30.000Z",
          "Titre": "Great collection of products and resources",
          "Contenu": "They have a very amazing collection of presets and classes at very reasonable prices, many of which are even free to try.Also, they have a very large collection of photography guides and helpful content so even a beginner will have no sweat at all when attempting photo editing and improving skills, in addition to their quick communication.100% Recommended!!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Jyotirmoy Chattopadhyay",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T21:13:55.000Z",
          "Titre": "The products are great",
          "Contenu": "The products are great. Good learning process to develop self creative activities. Keep up the good work."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Linda Macpherson",
          "Nb_Reviews": 14,
          "Date": "2023-11-13T22:58:43.000Z",
          "Titre": "Great Deals And Excellent Value",
          "Contenu": "PhotoWhoa offers great courses as well as presets, plugins and overlays for Photoshop and Lightroom at reallt good discounted prices. I have been buying PhotoWhoa deals since 2012 and have almost never been disappointed. This past year I also invested in a Plus Membership, so the deals are even better!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justanopinion!",
          "Nb_Reviews": 3,
          "Date": "2023-12-02T01:18:06.000Z",
          "Titre": "Great service!",
          "Contenu": "I wrote to the company because something was not quite right with my subscription. They responded rapidly with a fix. Can't beat that for service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alfonso Garcia",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T14:18:56.000Z",
          "Titre": "christmas overlays png",
          "Contenu": "great products easy to use making work flow faster"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glenn",
          "Nb_Reviews": 5,
          "Date": "2023-12-04T06:17:47.000Z",
          "Titre": "I am a long time user of Photo Whoa…",
          "Contenu": "I am a long time user of Photo Whoa products, I go back to them any time I need a special look to one of my projects."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CK",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T09:20:47.000Z",
          "Titre": "Insane Value!!",
          "Contenu": "I just got the subscription and already have tons of products I can benefit from in just seconds of being a member!! It's an excellent value too!!"
        },
        {
          "Note": 5,
          "Lieu": "PE",
          "Pseudo": "Adriaan Velleman",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T22:43:48.000Z",
          "Titre": "Free bundle set",
          "Contenu": "Well, the Total Free Christmas Bundle is very good and very useful. I haven't seen them all yet, but it promises to be a nice set for Christmas. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John Hopkins",
          "Nb_Reviews": 6,
          "Date": "2023-12-06T22:51:41.000Z",
          "Titre": "Great website",
          "Contenu": "Great website. Freebie or purchased there are a great many quality products"
        },
        {
          "Note": 5,
          "Lieu": "BA",
          "Pseudo": "nenad vuruna",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T09:23:18.000Z",
          "Titre": "Good place for creators."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Alice",
          "Nb_Reviews": 5,
          "Date": "2023-07-23T08:52:52.000Z",
          "Titre": "Purchased their Ultimate 1000+ Sky…",
          "Contenu": "Purchased their Ultimate 1000+ Sky Overlays Bundle for a very reasonable price. These work flawlessly in Luminar Neo AI based editor. Many of the skies are simply breathtaking. Face it, mother nature doesn't always provide us with a great sky for that otherwise wonderful photo. Now you can have it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Morgan",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T16:33:12.000Z",
          "Titre": "These guys get it",
          "Contenu": "These guys get it. Let's be honest: there are boatload of software and photo education options out there for pro and aspiring photographers and creators. PhotoWhoa cut through all the noise to provide what I would consider some of the best, modestly-budgeted options that are seamlessly downloadable within minutes of purchasing. Plus, once logged in, you're able to access your history, which makes it easy to reference. your product keys should you update your hardware. All in all, a good user experience and for money you can't beat 'em."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michael",
          "Nb_Reviews": 8,
          "Date": "2023-09-20T17:01:04.000Z",
          "Titre": "Generous gift of Affinity Photo plug-ins",
          "Contenu": "PhotoWhoa offer a huge range of instruction materials, plugins, presets and tutorials for the beginner to expert photo editor. Many of these are free of charge and can be accessed without further obligation.Offers seem to be biased towards glamour, boudoire and nude and arty photgraphy. There is however instruction in Landscape, street, wedding, editing etc. Many of the offers are directed at Photshop or Lightroom but there is content to please users of other editing and DAM software."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Chris",
          "Nb_Reviews": 3,
          "Date": "2023-09-22T09:30:23.000Z",
          "Titre": "The problem I had was actually me not…",
          "Contenu": "The problem I had was actually me not understanding the system! Once I had it explained, it was quite simple.Great help & great offers. PhotoWhoa has certainly helped me become a far better editor. The quality of my images has improved considerably."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Smith",
          "Nb_Reviews": 3,
          "Date": "2023-10-20T06:23:47.000Z",
          "Titre": "Photo Whoa subscription has paid for…",
          "Contenu": "Photo Whoa subscription has paid for itself. For only 9.00 a month, I get access to items that would normally price 50.00 to 100.00 dollars for free. Items that cost hundreds more, I get at most at 50 percent off. I have been a subscriber for almost four years and as a photographer, the deals and the knowledge is worth it."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "BADER ALAWADHI",
          "Nb_Reviews": 4,
          "Date": "2023-08-31T18:06:07.000Z",
          "Titre": "PhotoWhoa Boosted my Photography & Editing Skills",
          "Contenu": "I have been a member of PhotoWhoa for the past few years, the products offered are great in terms of quality and cost. I have learned and gained so much photography and picture editing knowledge (especially ADOBE PHOTOSHOP) from these products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Colburn",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T03:32:00.000Z",
          "Titre": "I was contacted by PhotoWhoa to have my products on their site.",
          "Contenu": "I was contacts by PhotoWhoa to have some of my ebooks put onto their site. They were friendly and helpful, and responded quickly to my questions. The entire process was easy, the contract was straight forward and I had no problems during the entire process of getting my products to them and having them added to the PhotoWhoa site. If you're contacted by PhotoWhoa to have your material added to their site, don't hesitate to accept. The experience will be friendly and easy.Have Fun,Jeff"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Vito",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T18:40:15.000Z",
          "Titre": "There's a wealth of content at PhotoWhoa.com",
          "Contenu": "There's a wealth of content at PhotoWhoa.com From Apps, Templates, Brushes, Actions, and tons more, to Tutorials that run the gamut from photography, lighting, posing, weddings to learning all the apps. Super value all around."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 6,
          "Date": "2023-06-28T05:17:21.000Z",
          "Titre": "Lots of. Boxes all at reasonable prices.",
          "Contenu": "They offer a wide variety of educational materials to enhance your photography experience. Most of the guides are written at a reasonable level such that everyone should get something from them. The cost of the programs makes it easy to obtain. Not like some of the big names in photo education-sometimes I don’t need a 400-$1000 course, just a nudge in the right direction!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mitch Eiseman",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T14:41:57.000Z",
          "Titre": "Great products at reasonable prices",
          "Contenu": "This company offers many great products as well as educational information at reasonable prices. Their customer service and support is also tops!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mandy B.",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T18:41:17.000Z",
          "Titre": "CHANGE PHOTOS FROM DRAB TO FAB EASILY!",
          "Contenu": "I've purchase many products over the years and all products are easy to use and bring my photos to life. I'm a weekend photographer, but I love being able to change my photos from drab to fab. Photowhoa products work well in Pixelmator, Photoshop Elements, and other programs."
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Kenneth Kisbye",
          "Nb_Reviews": 24,
          "Date": "2023-04-26T21:30:21.000Z",
          "Titre": "I've used Photowhoa for as long as I…",
          "Contenu": "I've used Photowhoa for as long as I remember.They offen have great offerings and the goods always live up to expertationsThis time I bought the \"Composite Photoshop Course - Start to Finish\" - it's great, even I am a competent photoshop user already. Manny small tips in short form./ Kenneth Photographer, Denmark"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodney Margison Photography",
          "Nb_Reviews": 2,
          "Date": "2023-06-29T02:13:14.000Z",
          "Titre": "Plus Membership",
          "Contenu": "PhotoWhoa’s $9/month Plus membership is the best deal in photography. Their products and tutorials are top-shelf, and the Plus membership returns WAY more than its cost in valuable return. Five stars Plus!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Christopher J Rogers",
          "Nb_Reviews": 11,
          "Date": "2023-06-12T11:03:21.000Z",
          "Titre": "Since I found PhotoWhoa I've benefitted…",
          "Contenu": "Since I found PhotoWhoa I've benefitted immensely. Not only does it bring me amazing guides and helpful presets, these are things I would never have found any other way and always a bargin price.Many thanks."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Neil",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T21:13:04.000Z",
          "Titre": "Great company who offer an excellent range of course",
          "Contenu": "We have worked with Photowhoa since 2020 and have found them to be a reputable company who offer an excellent range of online photography courses, backed up by brilliant customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Tanihara",
          "Nb_Reviews": 3,
          "Date": "2023-05-31T07:27:31.000Z",
          "Titre": "I am not a professional photographer",
          "Contenu": "I am not a professional photographer, just someone who loves to take family and friends pictures.  The several products that I have purchased have added to the fun and enjoyment of my hobby.  They have may topics that can add to your knowledge and help you improve your craft."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Дан Хечо",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T19:16:56.000Z",
          "Titre": "Great cooperation with PhotoWhoa.",
          "Contenu": "I have been working with PhotoWhoa for a long time and very closely.As the author of the courses, I am very pleased with the cooperation with PhotoWhoa, always timely and accurate sales payments.Special thanks for the fact that they offer to create a new product for photographers all the time, which makes me be in good shape and develop as a teacher.I look forward to further development of our cooperation in the future.Dan Hecho"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2023-02-09T15:52:44.000Z",
          "Titre": "PhotoWhoa Has it All!",
          "Contenu": "PhotoWhoa is my go-to webiste for all of my photo editing needs. They have such an amazing selection of products - everything from tutorials to plug-ins and accessories to speed up my workflow.  Their customer service is great as well if you have any questions."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Luca Storelli",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T14:00:32.000Z",
          "Titre": "The right platform to learn",
          "Contenu": "As the author of three courses of mine about retouching distributed on the website, I can say that my experience is good. I'm satisfied with their work. They offer a wide range of different tutorials, and great arguments, really useful for all kinds of students. If you want to learn about photography and retouching, you will find everything you need. I recommend PhotoWhoa to all of you who want to learn and grow."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dwight Magee",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T20:09:35.000Z",
          "Titre": "Absolutely one of the best photo…",
          "Contenu": "Absolutely one of the best photo training / resource websites out there. The site has great content with frequent updates and best of all the pricing is better than reasonable. Joining the monthly plan for 10 bucks is well worth it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Early",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T05:04:12.000Z",
          "Titre": "I love the things I can get for free as…",
          "Contenu": "I love the things I can get for free as a Plus member.  Far more value than the $9 a month cost.  An, I also get great discounts on additional educational and practical software.  One of the most cost-effective choices I’ve made."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Fabienne Blake",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T15:33:51.000Z",
          "Titre": "Photowhoa - For me the Whoa says it all, a Surprising Website..",
          "Contenu": "The website for this company is easy to use. Visually engaging, with superb offers to help with projects. I also like that the company was very quick to respond."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Babraham Lincoln",
          "Nb_Reviews": 1,
          "Date": "2023-01-02T23:48:39.000Z",
          "Titre": "I've been looking everywhere for Affinity Photo 2presets",
          "Contenu": "I've been looking everywhere for some affinity photo 2 presets and photoWhoa offered a few small packages for free just so I could kind of see what the presets looked like. Not only was I really happy with the freebies but I definitely want to buy some more presets now!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Robert Donaldson",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T19:43:34.000Z",
          "Titre": "Photowhoa photography productsam an amateur photographer and have…",
          "Contenu": "I am an amateur photographer and have been using Photoshop products for sometime now & I’ve found them to be excellent easy to use and very useful The downloads are instant and easily accessible through one’s account. I am happy to recommend Photowhoa and their photography products"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark B",
          "Nb_Reviews": 2,
          "Date": "2023-05-29T20:14:15.000Z",
          "Titre": "Best Value in Photography Instruction",
          "Contenu": "I had just started watching The Art of Professional Photography by Charlie Borland and I must admit that I am blown away by quality of the material, the production value of the videos and the professionalism of the author.  I cannot believe that this course is as comprehensive as it is for the price.  I would jump on this offer now."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan Jeffrey",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T18:42:37.000Z",
          "Titre": "I've been using PhotoWhoa to help with my  boudoir photography business",
          "Contenu": "I've been using PhotoWhoa to help with my boudoir photography business.All of their downloads are as advertised. They have a wide variety of topics but for my unique niche they are my go to source."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Terrell",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T23:43:33.000Z",
          "Titre": "So far I have never been disappointed…",
          "Contenu": "So far I have never been disappointed in any of PhotoWhoa products, they have all stood up to all my needs with my photos. I don't think anyone could go wrong with this set of Photoshop Actions."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michael Murphy",
          "Nb_Reviews": 25,
          "Date": "2023-07-26T12:52:28.000Z",
          "Titre": "Stunning Movie Poster Templates…",
          "Contenu": "Yet another fantastic free download from PhotoWhoa, their Stunning Movie Poster Templates. I have yet to put them into use but have had a good look at them. Very happy, keep up the good work."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Brian Lucock",
          "Nb_Reviews": 5,
          "Date": "2023-03-31T21:16:55.000Z",
          "Titre": "An ideal site for assets",
          "Contenu": "This is an ideal site for assets, particularly for composites.  You can also download or have access to courses.  The Plus option for just $9 per month is a terrific bargain."
        },
        {
          "Note": 5,
          "Lieu": "GG",
          "Pseudo": "Amazilia Photography",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T16:11:29.000Z",
          "Titre": "Working with PhotoWhoa on an Editorial Interview.",
          "Contenu": "I recently worked with PhotoWhoa on an editorial interview, and was delighted with how professional the Team there handled the interview, from concept to publication.The interview gave me the opportunity to explain my work, and its main messages, while also showcasing several examples of my work.Since then, I've enjoyed the various offers available from the company.All in all, it has been a very positive and productive relationship."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodney Margison Photography",
          "Nb_Reviews": 2,
          "Date": "2023-06-07T19:57:44.000Z",
          "Titre": "Plus Is a Great Value!",
          "Contenu": "The Plus Membership is such a terrific investment. For $9 a month I get thousands of dollars in free tutorials, templates, guides, and more. And the discounts on the other products makes it a double-no-brainer!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michael Murphy",
          "Nb_Reviews": 25,
          "Date": "2023-07-15T11:55:30.000Z",
          "Titre": "I love my membership of Photowhoa and…",
          "Contenu": "I love my membership of Photowhoa and the benefits I get for such a small outlay. The downloads are great, especially the free ones and even the paid ones are very well discounted."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Peter Fortunat Truog",
          "Nb_Reviews": 2,
          "Date": "2023-05-22T20:30:17.000Z",
          "Titre": "I've been using PhotoWhoa",
          "Contenu": "I've been using PhotoWhoa to help with my photography business.All of their downloads are as advertised. They have a wide variety of topics but for my unique niche they are my go to source."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Bernie Raffe",
          "Nb_Reviews": 11,
          "Date": "2023-08-09T19:25:53.000Z",
          "Titre": "Worked Well For Me,Thanks",
          "Contenu": "PhotoWhoa published and sold my photography educational videos.A very reliable company, very efficient, and I'm more than happy with them.Thank You"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Eduardo",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T21:13:19.000Z",
          "Titre": "Hey Folks",
          "Contenu": "Hey FolksFreebies:1 They allow me to increase creativity in my work2 They also give me clicks for good ideas.3 They are simple but good.I just want to add that don't be afraid to share knowledge.Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janice E",
          "Nb_Reviews": 2,
          "Date": "2023-02-16T13:50:43.000Z",
          "Titre": "They resolved my mistake",
          "Contenu": "I had accidentally ordered under a different email address from the one I used previously. Therefore, I wasn't able to access my new purchase. PhotoWhoa worked with me to resolve the problem and get all my downloads under a single email address."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Jeroen Gordijn",
          "Nb_Reviews": 5,
          "Date": "2023-08-10T07:09:55.000Z",
          "Titre": "Speeds up editing and gives me more…",
          "Contenu": "Speeds up editing and gives me more ideas about the style as you can easily try out different actions or overlays."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Chris",
          "Nb_Reviews": 3,
          "Date": "2023-08-20T19:10:26.000Z",
          "Titre": "Photo Whoa - Amazing",
          "Contenu": "Photo Whoa has introduced me to some amazing offers and techniques. With their help, my photography has progressed so much. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Morganti",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T18:39:51.000Z",
          "Titre": "I love PhotoWhoa's products!",
          "Contenu": "With the plethora of resources available online for photography, it's difficult to know what's good and what's bad. It's been my experience that PhotoWhoa offers the best products and services. I've yet to be disappointed and I highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "DAMIEN LOVEGROVE",
          "Nb_Reviews": 2,
          "Date": "2023-07-26T12:06:18.000Z",
          "Titre": "Ongoing excellence",
          "Contenu": "Over the past 10 years, I've been providing PhotoWhoa with my best content and more recently I've presented a live event for the team. The ongoing professionalism and quality of content that PhotoWhoa deliver to its members is excellent. If you have knowledge, experience and skills to share with the photography community don't hesitate to partner up with PhotoWhoa."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Santamaria",
          "Nb_Reviews": 6,
          "Date": "2022-08-25T15:18:28.000Z",
          "Titre": "PhotoWhoa offers excellent educational services",
          "Contenu": "PhotoWhoa offers excellent quality educational and training material on photography. Most of them have helped me to learn more, new things, and brush up my knowledge. The other side is that they all have been very affordable with different types of discounts.Excellent job!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "L Nevins",
          "Nb_Reviews": 3,
          "Date": "2023-02-24T15:13:44.000Z",
          "Titre": "Fast and efficient support",
          "Contenu": "The products I have purchased have been top notch at great prices. A couple of times I have had issues with the download link for a product. In each instance, the support team resolved the issue within a day. Very appreciative of this vendor!"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Sorin Negrea",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T13:23:31.000Z",
          "Titre": "Everything I found on Photowhoa.com is…",
          "Contenu": "Everything I found on Photowhoa.com is particularly useful in my journey of improving myself as a photographer, it helped me learn how to edit photos efficiently but also with a professional quality. I am truly grateful for that!"
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "Md Al Mamun",
          "Nb_Reviews": 2,
          "Date": "2023-03-01T12:13:30.000Z",
          "Titre": "I would highly recommend PhotoWhoa.com…",
          "Contenu": "I would highly recommend PhotoWhoa.com to anyone looking to improve their photography skills or expand their knowledge of the field. With a great selection of courses and resources and a user-friendly website, PhotoWhoa.com is a must-visit for any photography enthusiast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Robert Terrell",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T08:24:19.000Z",
          "Titre": "A Smile is on my face",
          "Contenu": "In my 75, nearly 76 years of living on this planet have many remembered my birthday. I've had two birthday parties over all those years, one when I was 7 and one when I was 23 and the one when I was 23 I was sick with a stomach virus and spent most of it hugging the throne. So even a company who does not really know me notices it, well it makes an old man happy. So thank you Photowhoa!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Anthony D'Souza",
          "Nb_Reviews": 4,
          "Date": "2023-08-23T13:15:38.000Z",
          "Titre": "I am able to get photography resources…",
          "Contenu": "I am able to get photography resources at a very competitive price. Secondly, there are stored at their site, and I can download what I want, when I want it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Gray",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T21:18:25.000Z",
          "Titre": "I've bought various item from editing…",
          "Contenu": "I've bought various item from editing actions or brushes to classes and books.  Everything always has had useful information to it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronald",
          "Nb_Reviews": 1,
          "Date": "2023-01-02T01:31:21.000Z",
          "Titre": "Photowhoa is a great partner for photo editors",
          "Contenu": "PhotoWhoa definately has a photo editor in mind.  Probably the broadest amount of tools and tutorials I know of on line with prices which will compete anywhere.  Five stars plus."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gimagery",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T02:03:33.000Z",
          "Titre": "PhotoWhoa is top-tier!",
          "Contenu": "Hi all! As an established photographer, I have become a partner and creator at PhotoWhoa. Just wanted to leave a review for Trustpilot readers to say PhotoWhoa is a fantastic company who are very professional which have an excellent and huge selection of products/masterclasses available for everyone. Highly recommended from me!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lloyd Chappell",
          "Nb_Reviews": 3,
          "Date": "2023-04-06T15:14:23.000Z",
          "Titre": "I got the correct information and a…",
          "Contenu": "I got the correct information and a solution. I thought there was a real problem, there wasn't. I was shown how to use materials I didn't understand. All quickly and simply."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Jeroen Gordijn",
          "Nb_Reviews": 5,
          "Date": "2023-08-02T08:01:22.000Z",
          "Titre": "Plus membership a big plus!!!!",
          "Contenu": "Some time ago I already obtained a lightroom actions bundle which I really like. It improved the workflow and saves me a lot of time editing. Now I decides to get the Plus membership. I love it."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Doug Carman",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T13:09:33.000Z",
          "Titre": "PhotoWhoa offered free overlays",
          "Contenu": "PhotoWhoa offered free overlays. Turned out to be a great bundle. Brilliant!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T18:04:46.000Z",
          "Titre": "AWESOME customer service",
          "Contenu": "AWESOME customer service.  I accidentally purchased an e-book twice, and their customer services was super fast and friendly to work with on providing me a full refund.  I'll definitely be making purchases with them in the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Simmons",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T19:14:43.000Z",
          "Titre": "The Book Shared Important Details",
          "Contenu": "I am new to boudoir photography. This book gave me the knowledge so I can communicate with the model regarding the lingerie for the shoot. It also helps me to understand when models and other photographers are discussing lingerie and boudoir."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sid V",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T17:32:49.000Z",
          "Titre": "I've always had a satisfactory…",
          "Contenu": "I've always had a satisfactory experience with them for the last six years. Good company with great customer support."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Andries du Toit",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T14:41:32.000Z",
          "Titre": "Support on Photowhoa is great",
          "Contenu": "Support on Photowhoa is great. I had an issue accessing a course. After reporting it the communication was great and the issue was quickly resolved. Thank you very much!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Klaus Dornhofen",
          "Nb_Reviews": 2,
          "Date": "2023-07-31T08:39:36.000Z",
          "Titre": "Image-editing Software Deals",
          "Contenu": "This website provides high-quality image-editing software for a discount price. The support-team replied to all of my technical questions, really great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harry Mandel",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T05:19:30.000Z",
          "Titre": "I like the variety",
          "Contenu": "I like the variety, it is great to have so many choices"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Tina",
          "Nb_Reviews": 4,
          "Date": "2023-10-31T19:30:43.000Z",
          "Titre": "Very helpful",
          "Contenu": "I am a senior and I don't have much money. I love the idea of free stuff. I am learning so much from your website. I am also having fun learning which is easy from you. I will buying when I have money. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah Welsh",
          "Nb_Reviews": 3,
          "Date": "2023-08-02T23:29:00.000Z",
          "Titre": "I am impressed with what Photowhoa did…",
          "Contenu": "I am impressed with what Photowhoa did for me and the interview is great. I had to add a couple sentences after it was published and they made it easy and added them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheldon",
          "Nb_Reviews": 7,
          "Date": "2023-07-19T12:38:58.000Z",
          "Titre": "I love Photowhoa",
          "Contenu": "I love Photowhoa.  As a member I’m always getting free stuff.  Their free courses are terrific too!Subscribe already!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Walt Jedziniak",
          "Nb_Reviews": 3,
          "Date": "2023-04-22T17:12:24.000Z",
          "Titre": "Great products at a reasonable price!",
          "Contenu": "I have made several purchases over the years from PhotoWhoa.  I love the selection and the variety of products. They are easy to use and help me greatly in my business. I love the posing guides!  They always provide me with fresh ideas for my sessions!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keefe Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T22:24:14.000Z",
          "Titre": "PhotoWhoa always has the greatest…",
          "Contenu": "PhotoWhoa always has the greatest product. Bought some contract templates on a Friday, already use 3 before Sunday. PhotoWhoa for the win!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mitch Eiseman",
          "Nb_Reviews": 2,
          "Date": "2023-07-11T22:14:54.000Z",
          "Titre": "The photography downloads are all great…",
          "Contenu": "The photography downloads are all great and easy to incorporate with my post processing programs. God value for the dollar !"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jennie Peters",
          "Nb_Reviews": 5,
          "Date": "2023-08-11T10:31:38.000Z",
          "Titre": "Very helpful",
          "Contenu": "I recently bought the Majestic Moon overlays and thought I ticked the wrong box. A very helpful answer to my query soon sorted me out. Very impressed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Livingston",
          "Nb_Reviews": 3,
          "Date": "2023-09-05T22:42:50.000Z",
          "Titre": "This is a No-Brainer!",
          "Contenu": "I've been a member for over a year now. There are countless high-quality assets and the Master Classes to learn how to use them! Worth every penny of the low monthly fee!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Klaus Henseler",
          "Nb_Reviews": 9,
          "Date": "2023-10-24T16:50:31.000Z",
          "Titre": "Simple purchase",
          "Contenu": "Simple purchase, quick delivery, products are worth the price. Products as shown in the preview ...I´ll come back for more .."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T15:39:38.000Z",
          "Titre": "I had an issue with an order",
          "Contenu": "I had an issue with an order - the download was not working. The issue was resolved within 24 hrs. PhotoWhoa always has great support!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Phillip Marley",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T10:29:41.000Z",
          "Titre": "Fantastic site",
          "Contenu": "Have been getting so many useful items from photowhoa and the site is very easy to navigate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "VJ",
          "Nb_Reviews": 5,
          "Date": "2023-03-31T23:10:10.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent, friendly and helpful support. I bought a lot of items from here. Amrutha was very friendly and helpful and the same thing goes with others as well. I will keep using their services."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Eros",
          "Nb_Reviews": 3,
          "Date": "2023-06-20T17:14:01.000Z",
          "Titre": "Top seller!",
          "Contenu": "I have already made other purchases, including eBooks and presets, and the quality of the products is really excellent at great prices"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Andy Critchell",
          "Nb_Reviews": 40,
          "Date": "2023-04-13T17:02:39.000Z",
          "Titre": "If you are into photography then…",
          "Contenu": "If you are into photography then PhotoWhoa is a must in order to save money on addons etc. I have saved a fortune with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philip",
          "Nb_Reviews": 4,
          "Date": "2023-05-24T01:37:51.000Z",
          "Titre": "The site has lot of great ideas and the…",
          "Contenu": "The site has lot of great ideas and the knowledge to put them to work. There is always great help available. You can great work with easy to understand information."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jodi",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T22:49:42.000Z",
          "Titre": "Great and trustworthy!",
          "Contenu": "Downloaded some Affinity presets and they are great! Will definitely use PhotoWhoa in the future."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Ales",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T09:53:31.000Z",
          "Titre": "Great support",
          "Contenu": "Having a glitch with a yearly subscription, the issue has been resolved swiftly and to my full satisfaction. Thank you for your good work."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Fernando Figueiredo",
          "Nb_Reviews": 4,
          "Date": "2023-04-11T13:13:20.000Z",
          "Titre": "Masterclasses, templates, photoshop actions",
          "Contenu": "A lot of content available.You can always find great deals for the masterclasses, templates and all other useful content."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marlon",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T16:42:43.000Z",
          "Titre": "I have purchased several items from…",
          "Contenu": "I have purchased several items from PhotoWhoa and have not been disappointed in any of them. The free titles have also been great."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Klaus Henseler",
          "Nb_Reviews": 9,
          "Date": "2023-10-08T20:36:34.000Z",
          "Titre": "Quick purchase",
          "Contenu": "Quick purchase, and good products as shown. It is always a joy to do business with PhotoWhoa."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Shane Wiseman",
          "Nb_Reviews": 11,
          "Date": "2023-08-16T15:24:40.000Z",
          "Titre": "Very pleased with PhotoWhoa",
          "Contenu": "Very pleased with PhotoWhoaIf your looking for something great ,you will always find it at Photo Whoa"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Federico",
          "Nb_Reviews": 3,
          "Date": "2023-07-26T18:36:29.000Z",
          "Titre": "Best photography tutorials.",
          "Contenu": "Very good detail of product. Easy check out. Excellent website layout. Best photography tutorials."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Paul G.",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T13:02:29.000Z",
          "Titre": "This seller is going above and beyond",
          "Contenu": "This seller is going above and beyond.I had a download issue with one of my purchases (5 parts in zip files) and they fixed it within a day."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Don Schneider",
          "Nb_Reviews": 4,
          "Date": "2023-03-29T21:55:07.000Z",
          "Titre": "Always great stuff!",
          "Contenu": "Always great stuff!! Just when I think I need something in particular, they have it! PhotoWhoa Rocks!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Darrin  Creenaune",
          "Nb_Reviews": 3,
          "Date": "2023-09-02T05:47:09.000Z",
          "Titre": "PhotoWhoa has been a lifesaver for me…",
          "Contenu": "PhotoWhoa has been a lifesaver for me and the price to join is nothing compared to the quality of the product you get, I've never come across another site like this ever this is a no-brainer for me and it should be a no-brainer for you, i think I've found my new photography home."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Kjell",
          "Nb_Reviews": 3,
          "Date": "2023-07-04T12:53:22.000Z",
          "Titre": "I have followed PhotoWhoa.com",
          "Contenu": "I have followed PhotoWhoa.com in many years and i think they really great training. You have a great chans to develop yourself."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Bradley Hawkins",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T21:14:31.000Z",
          "Titre": "Very Professsional",
          "Contenu": "The team at PhotoWhoa is very professional and courteous. Top-notch website!"
        }
      ]
    }
  ]
}