{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "pixsy.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tyler Golberg",
          "Nb_Reviews": 7,
          "Date": "2023-12-01T23:37:14.000Z",
          "Titre": "Not an ethical practice",
          "Contenu": "Pixsy is supposed to go after outright theft of images, but they use threatening letters to extort money from even small bloggers with malformed attributions. It might be legal but it's not ethical."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sean Gallagher",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T16:50:44.000Z",
          "Titre": "Company won't respect artist's wishes",
          "Contenu": "It's unfortunate, but with just one job, protecting artist's image rights, Pixsy falls flat. They do not listen to anything they are told, or asked to do. Instead, Pixsy will do as they wish, ignoring any requests you may have made. Literally, when representing a client, respecting the wishes of the client is the singular function of your business."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maria Paulino",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T14:45:32.000Z",
          "Titre": "Horrible service.",
          "Contenu": "Horrible service.Cases sit there for over a year without resolution.Minimal scans even with an upgraded plan. I’ve gone 19 days without a scan. Now the scan counter/report is hidden and only reads “active”. This is terrible for the paying customer, and seems fraudulent.Many “matches” aren’t even the same people, yet I get many of them every month."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Ton Nijhof",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T16:17:06.000Z",
          "Titre": "Pixsy is part of a scam gang of thugs",
          "Contenu": "Pixsy is part of a scam gang of thugs - probably gypsies - operating from the Eastern Bloc (Poland/Romania/Slovenia), whom tries to extort money from website administrators for the use of copyright-free photos of e.g. pixbay, flickr, etc. These are photos that are published on such a web 2.0 website by the photographers themselves as a portfolio and for just that reason alone are completely free of copyrights and financial compensation. Report attempted fraud and extortion to your local police station. When enough (international) police reports are made, it will be an Interpol case and they will be arrested finally."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Adam Brown",
          "Nb_Reviews": 2,
          "Date": "2023-05-30T11:24:10.000Z",
          "Titre": "useless",
          "Contenu": "useless. Pixsy will only ever do the bare minimum and hope someone just pays out of fear.In Australia they have zero legal standing even though they claim to have a local office, paste the Australian flag with a local phone number and an international network of IP lawyers etc. But when you actually push them to take legal action, they will then tell you they have zero jurisdiction and cant do anything in Australia., doesnt stop them from claiming all over their website and taking your monthly fee for \"premium service\"takes them forever to do anything, im talking 2 years, if you dont constantly email or call them, and then they will just close the case as its to hard."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Jonny",
          "Nb_Reviews": 4,
          "Date": "2022-03-20T11:11:51.000Z",
          "Titre": "Don't deliver the service I pay for",
          "Contenu": "Don't deliver the service I pay for: paid for a service, high level of control is promised, archive searched only once in a month. There are much better reverse photo search companies out there. Case management also leaves a lot to be desired. It does not help if you start with the highest prices and cannot close the case. Ultimately, only the photographer gets a bad rap, Pixsy already has it."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nicola Selby",
          "Nb_Reviews": 4,
          "Date": "2023-06-26T21:11:37.000Z",
          "Titre": "Pixsy legal case, inflating damages",
          "Contenu": "Instructed pixsy to investigate a copyright breach. Pixsy Instructed court proceedings without my authority, that tied me into legal financial agreements without any information or my agreement. The case has settled and I have received very little of the damages awarded due to the legal company and pixsy taking monies from the settlement. Pixsy and their solicitors dramatically inflated the bill, putting both myself and the infringer under overwhelming pressure. I would not trust this company, to act in your interests."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "JM",
          "Nb_Reviews": 9,
          "Date": "2020-10-27T08:37:28.000Z",
          "Titre": "Absolutely immoral and ridiculous…",
          "Contenu": "Absolutely immoral and ridiculous company.So I received a long winded and borderline threatening email a couple of weeks ago requesting I pay almost £500 for the use of a very very basic image someone has made on canva or similar. The image was used in a small blog section on my site, it was probably seen about 20 times. Now I am been threatened in to legal action if I dont pay.Considering the current climate for small business the last thing we need is a bill like this dropping on us when we are trying to keep our heads above water, we removed the image within minutes and replied but that was not enough and the legal threats continue.It looks like we will have to pay at a time we are struggling the most, this is completely immoral and terrible of a company to hand pick small shops at a time like this."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Mon Baum",
          "Nb_Reviews": 8,
          "Date": "2021-06-01T06:09:06.000Z",
          "Titre": "Why aren't criteria listed from the start? Image needs to be registered with US Copyright Office.",
          "Contenu": "I submitted a case that, after weeks of review, was declined.What bothers me is that Pixsy sent me a list of criteria the image theft would need to meet for them to accept the case which included \"Your image is not available on a stock site\" and \"Your image is registered with the US Copyright Office\".I don't understand why these criteria aren't transparent from the start. I would not have bothered wasting my time putting together all the information and proof regarding the image theft. When you submit a case, there is even an option you can check to tell them the image is available on stock sites - Why isn't the case automatically declined right then? Why isn't this basically the first question?The next criteria was that the image needs to be registered with the US Copyright Office. I come from Europe. The site that stole my image was located in Europe. So, pixsy is only for US citizens? Why isn't this communicated from the start so peopel outside the US don't waste their time? Last but not least the list of criteria said that they basically only go after big companies, as small fish are not worth their time.All of this should be clearly communicated on their site from the start. Would save both them and photographers a lot of time."
        },
        {
          "Note": 1,
          "Lieu": "VN",
          "Pseudo": "Peter Jenkins",
          "Nb_Reviews": 1,
          "Date": "2020-10-25T14:06:34.000Z",
          "Titre": "Complete and utter clowns",
          "Contenu": "Complete and utter clowns. If you receive threatening emails from this lot just ignore.Nothing but garbage."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Davide C.",
          "Nb_Reviews": 11,
          "Date": "2022-10-26T17:51:51.000Z",
          "Titre": "Piscy is a fraudulent company that has…",
          "Contenu": "Piscy is a fraudulent company that has harassed us several times and committed  wire fraud by attempting to extort undue fees for photographs my company has never published.Please beware, if you receive an email from these scumbags, consult with your attorney or seek legal help. They represent an army of amateur photographers who are desperate to bag in some $ and they are willing to go as far as accusing companies like mine of having published some horrendous images of a pathetic self proclaimed photographer."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jillian",
          "Nb_Reviews": 5,
          "Date": "2021-03-13T23:05:27.000Z",
          "Titre": "Scam artists using extortion and harassment",
          "Contenu": "This company may pretend to look after \"copyright owner's rights\" but in fact their business model is same as \"no win no fee lawyers\". They are sending long intimidating letters in legalese in hopes of bullying website owners into paying extortionate amounts for images that are mostly licensed under Creative Commons licenses. Small business owners and private individuals get rightly stressed and scared of threats of litigation and pay up hundreds and thousands of pounds, even though in most cases the alleged infringement did not even occur. Pixsy know it, but will try it on anyway in hopes that the ignorant victim will not be well-versed in the intricacies of copyright law. Like any cyberscammer, they send multitudes of such auto-generated emails a day, in hopes that a small portion of recipients will get bullied into paying without defending themselves in court. This kind of frivolous litigation may thrive in US, but courts in UK will not look too favourably on such a waste of their time and resources. To anyone who has received their ludicrous long-winded extortion email that amounts to nothing - have no fear. This is still UK and your rights are still protected by the law. Make sure you don't fall victim to their scare tactics and seek legal council before, if at all, engaging with these scam-artists."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Meiyun Savva",
          "Nb_Reviews": 8,
          "Date": "2023-07-11T12:02:39.000Z",
          "Titre": "At Best Incompetent Bullies At Worst Scammers!",
          "Contenu": "On 7th July I received an email from Ricard J, Case Manager Pixsy Case Management Team. The email was very aggressive and in essence instructed me to click a link to pay £570 licence fee for “unauthorised usage of imagery on my website”. There was no grace period to remove the alleged image, they wanted payment and fast!At this point I was confused and very concerned. I investigated and there was an image from a competitor selling a similar retro “50s style” dining table which was I was selling. I emailed back to say that the style was not copyrighted, in fact the design was around long before the competitor was even established. There were lots of companies selling this same design. I was using my own imagery which I had created so I have not infringed any form of copyright.I said that if the claim was not dropped, I would have to instruct a solicitor. The response was cold and aggressive “You might find our email insulting, but it is an alternative to litigation. You simply cannot use copyrighted images without permission or a license. I welcome and encourage you to instruct solicitors, at your own expense, as they will advise you to resolve the matter amicably by paying a retroactive license”.At this point I just felt as though a larger company was bullying me and forcing me to just pay the £570 fee so they can get paid.I stood my ground and emailed back to basically reject the accusation and that I would leave reviews to highlight my experience and warn others. At this point the email suddenly changed, and the response was: “It appears there was an error, and this was a mismatch. You are right, the images are different. Given the above, and without prejudice should any other images have been used, I am discontinuing the case.”Pixsy are at best grossly incompetent. But I couldn’t help thinking this this is just their scare tactic to increase their revenue. If they email enough threatening letters, they are going to get people who are just bullied into paying their fees to avoid further actions. Once Pixsy admitted their mistake there was not even an apology. It was a simple “This matter is now closed.” In my opinion Pixy are a cold, aggressive, rude and horrid company who make their money from threatening letters trying to force people into paying fees. I would put them right into the category of loan shark debt collectors who are really at the bottom of the barrel. If anyone wants to deal with a reputable company who has any class, I would highly recommend avoiding Pixsy and finding a more competent service provider, not some low class bullies who would possibly sell their grandmothers to make a few quid profit. An absolute disgraceful company, probably the worst I have had the displeasure of dealing with."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Sarah Learney",
          "Nb_Reviews": 9,
          "Date": "2021-08-13T13:34:48.000Z",
          "Titre": "False Allegation",
          "Contenu": "On the 2nd August, 2021, I received an allegation from Pixsy that I had used an image, without authorisation, on my business website. They claimed that the image was the intelletual property of a named copywright agent and that I was required to pay a licensing fee for its use.Having created my business website using a highly reputable self-build platform, I had utilised their free images library. I immediately spoke with my website host, as well as forwarding them the allegations from Pixsy. They are able to confirm that the image was theirs and that Pixsy should forward any allegations to their team who specialise in copywright infringement. I informed Pixsy of this, in writing, as well as confirming the email address to whom they should forward the case.Despite this, I received a 'Second Notice' on 13.08.2021. This notice made no reference to my previous correspondence and threatened to escalate my case to their partner attorney to initiate legal proceedings. I immediately called their London office via the number on the email.I spoke with one of the 'Case Management' team who admitted that the second email had been sent in error and that they would pursue the claim via Wix. This telephone operator did not disclose her name and was reluctant to engage in conversation as soon as she identified that I was the 'defendent' in this scenario.Having investigated this online, there is a lot of evidence that this business genuinely support artists whose legitimate copywright has been infringed. However, there is also ample evidence that they actively seek to extort money from new and small businesses who may not have the forsesight or resources to identify a potential scam. I am a small business owner, fortunately with a specialism in the legal sector. As such, I will not be paying their demands for a licensing fee. Instead, I shall await any notice from my website host that the image should be removed from circulation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MEAGAN WRISTEN",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T21:18:21.000Z",
          "Titre": "Fee is too high",
          "Contenu": "Fee is too high. Will not use again."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "JAMES",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T22:54:13.000Z",
          "Titre": "The time it took to response to my…",
          "Contenu": "The time it took to response to my emails and waiting for 2 years before a resolution. The $$ amount first quoted was not accurate. The case managers kept changing. However, Barbara was very good, keeping me informed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JohnM",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T16:39:57.000Z",
          "Titre": "Be wary...",
          "Contenu": "I'm not 100% sure that Pixsy is really out for protecting photographers.  My experience with them thus far has been so-so.  While a few cases have been completed, there are many cases still open after a whole year, and it seems there's nothing they can or will do to get those cases resolved.  Worse is the cancellation fees if you choose to cancel a case that was submitted in error or if you were able to work things out with the infringing party directly.  Pixsy should allow for a handful of \"free\" cancellations per user depending on the tier they pay monthly for.Also, I feel we users of the service should have complete access to all documents, call logs, and emails that are sent to the infringing parties.  Complete transparency is the hallmark of an honest service.  I say this because it has come to my attention that the first few email attempts to a recent infringer did not even name ME or MY Business in the demand letter.   I don't like that."
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "Falk Lademann",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T23:52:38.000Z",
          "Titre": "Pixsy is not protecting my work from…",
          "Contenu": "Pixsy is not protecting my work from image theft, as it claims, as work licensed under creative commons is ignored by Pixsy. Pixsy follows up on image theft in a limited number of countries only.Latest cases show a significant downscale in license fee gathered (a third of what I sell images regularly)."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David F",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T23:51:20.000Z",
          "Titre": "Image scanning is good but...",
          "Contenu": "Image scanning is good but case processing and recovery is TERRIBLE.  I have cases that have been in \"Preparing Case\" status for more than 2 years."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mark Cleghorn",
          "Nb_Reviews": 46,
          "Date": "2022-06-24T11:30:19.000Z",
          "Titre": "Updated",
          "Contenu": "I actually really like Pixsy, the staff are friendly and always respond timely to emails and requests, they do some good scanning of items and finding people using your images.I knocked one star off as they don't cover a number of territories who infringe on your rights, also that a number of the images found often bear no resemblance to ours which takes a lot of time up.But overall its good value for money and does exactly what it should doI have had to come back and update this review due to issues with PixsySo we flagged a lot of use of images, and I mean a lot.  I took screenshots of this, I took the names and addresses of the offending items and publishers.Then repeatedly we were told \"we could not find details of the person who uploaded this\".  So on eBay, a seller has to publish the item, they are responsible for it and if they are a business who steal your images they are 100 per cent responsible.On all sellers if you click 'contact' it provides, their name, registered address, email and phone number.Its super easy to find.However, Pixsy could not find it apparently, even when it was provided.Then when we Vero did take downs, the response was \"we can no longer find the images\"  erm yeah because it took weeks to do nothing, so we removed them ourselves"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Edmund",
          "Nb_Reviews": 2,
          "Date": "2023-06-30T15:54:14.000Z",
          "Titre": "Stop being so agressive with your…",
          "Contenu": "Stop being so agressive with your primary client ..ie the photographer"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Ian Murray",
          "Nb_Reviews": 2,
          "Date": "2023-04-28T12:02:16.000Z",
          "Titre": "I feel that Pixsy drops too many cases…",
          "Contenu": "I feel that Pixsy drops too many cases without trying hard enough. I have had three such cases which I concluded myself and got paid. In each case the infringer had not been phoned by Pixsy ( despite Pixsy claiming to have tried all possible means of contact)."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Coleen Hill",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T16:40:19.000Z",
          "Titre": "More of my cases are discontinued…",
          "Contenu": "More of my cases are discontinued rather than successfully settled. Will probably cancel my paid subscription."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Moore",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T00:23:24.000Z",
          "Titre": "Very few of my cases have been brought…",
          "Contenu": "Very few of my cases have been brought to a satisfactory resolution (a pament) over the past few years. Whatever payments there were were much lower than they used to be. In most cases I was told that the infingers could not be contacted or did not respond. Eventually, I had no choice but to cancel my membership. Very sad considering that pixsy was doing quite up to three years ago."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Ramajana Zahirovic",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T11:31:48.000Z",
          "Titre": "Solving some cases very good",
          "Contenu": "Solving some cases very good. The platform could be better organized - I am missing things for faster deleting of hits, and a better overview would be nice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Room by Room Photo, llc",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T23:07:10.000Z",
          "Titre": "Insurance for your images.",
          "Contenu": "I love Pixsy. I recommend them to everyone. The only reason for 4 stars is that it takes so long for cases to get finished. I think we are 3 years into one now. Other then that, totally amazing and definitely worth it."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Rob.",
          "Nb_Reviews": 6,
          "Date": "2021-06-09T09:39:45.000Z",
          "Titre": "If you are a photographer or passionate…",
          "Contenu": "If you are a photographer or passionate about photography and post several of your photos online, Pixsy is a tool that will be very helpful. It scans the net to search if any of your pictures has been used and you can check if it was fair or unfair use and take action to have your rights correctly acknowledged. It's as simple as that. The only downside is that not always matches are 100% accurate but they are accurate enough and probably the rate will improve with time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randy A. Carlisle",
          "Nb_Reviews": 1,
          "Date": "2021-04-01T03:34:07.000Z",
          "Titre": "Over all",
          "Contenu": "Over all, not bad.. I've received from one site where they received a notice from PIXSY!!! But what I don't care for is that now U want $$$ to continue this.. I don't recall any notification that there would be a charge if I did so many.. IF there was a notification, I sure didn't see it.. But thanx!! I still have PIXSY keeping an eye out.! BEST//BLESSINGS..Randy A. Carlisle / Historical Photographer"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Jannis Hagels",
          "Nb_Reviews": 1,
          "Date": "2021-09-30T14:51:36.000Z",
          "Titre": "Important service - might get a bit more professional.",
          "Contenu": "So far I have some cases running. I can't tell for the success or the outcome yet. My cases concern for example companies that stole my pictures probably in poor quality from social media and started printing them on pillows and other amenities. There have been a few cases that ran into nowhere and were closed just like that - fine for me.I can understand the companies here, that try to find a proper solution together, feel bullied. This may not always be the perfect way of dealing with copyright infringement, but: Every company should be aware of this topic no matter how small or big it is. Many photographers like me do not earn a bunchload of money for their work but have to pay for expensive equipment, travel costs and more. Therefore I think the work of pixsy, in it's general sense, is important."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-03-06T18:29:07.000Z",
          "Titre": "Makes it easy to get paid for unauthorised use of your work",
          "Contenu": "They made it easy for me to get paid for unauthorised use of my work in 2 cases now. Their email responses were prompt when I had questions, too.I took one star off because of the following:- they make you spend a fair bit of time adding case details BEFORE they tell you oh, sorry they can't help you with Creative Commons licensed images in certain countries like Germany or Spain. Which was annoying as I'd spent time filling out the rest of the details before getting to this stage. I wish they would ask upfront so you don't waste time (also, why isn't it covered in those countries - it would be nice to get an explanation).- They pay your money within 30 days of them receiving it - it is a bit long I think, it would be better if they paid sooner. - Their cut is 50% - it would be nice if it was just a bit less... but still better than nothing so that's not a big problem, if they could sort out the first major pain point I mentioned above."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Steve Walker",
          "Nb_Reviews": 18,
          "Date": "2021-05-03T16:44:33.000Z",
          "Titre": "Useful service connected with Flickr Pro",
          "Contenu": "I started using Pixsy because the service was added to my Flickr Pro membership.  If you are concerned about who might be using your images, it can be a useful service.  It accurately identifies images that are either actually yours or very similar.  For those images that are actually yours, the website page using it is identified and you can either go and contact the site yourself, or use a Pixsy \"Take Down\" process.  I have not used the latter, but on half a dozen occasions, it found unauthorised use of my images and I was able to get credit, which is all I ask for these days.One downside is that I found there were a depressingly large number of sites using my images but since these were Russian and Chinese, I simply couldn't face the prospect of trying to get them to acknowledge this.  This is depressing, but since I don't expect to make huge amounts from my images it's no worse than that."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Rob",
          "Nb_Reviews": 2,
          "Date": "2021-07-06T11:21:16.000Z",
          "Titre": "Help from Pixsy",
          "Contenu": "As a freelance photographer Pixsy helps me to find breaches of the copyright on my photos.Pixsy is a very useful tool."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kerry Bern",
          "Nb_Reviews": 1,
          "Date": "2021-04-27T17:57:14.000Z",
          "Titre": "Pixsy does not find all uses of your…",
          "Contenu": "Pixsy does not find all uses of your images. Plus, it sends you all sightings, most of which are not pursuable."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Lgee Faure",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T19:07:33.000Z",
          "Titre": "Successful compensation from Pixsy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diego Forest",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T17:04:45.000Z",
          "Titre": "One word....WOW!",
          "Contenu": "I am tremendously impressed and happy with everything the Pixsy team has done and is still doing for me. I take my photography seriously but inevitably people will steal them and I was really lost on what to do. That's when I found Pixsy. Their services are amazing, easy to use, responsive, and don't cost anything unless they get money for claims they levy on unauthorized use of your images. They get a fair cut for doing the leg work all over the world! How the hell would I even know where to start. Pixsy does and they know how to finish."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yiming Chen",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T18:46:21.000Z",
          "Titre": "Help me successfully requested and…",
          "Contenu": "Help me successfully requested and claimed the royalty from unauthorized use of my photo, I pretty much didn’t need to do anything."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Cristian",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T20:54:43.000Z",
          "Titre": "Great service and team",
          "Contenu": "Honestly I don't understand how some people wrote such negative reviews.Pixsy is a great company on a mission to support entire communities of photographers and protect their copyrights. Thy have a great customer support and are very transparent with their service and conditions. Once lawsuits are open they might take a while before they are solved but this depends on how fast courts can handle cases. If you are a professional or amateur photographer you should check it out"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Steve Elliott",
          "Nb_Reviews": 8,
          "Date": "2023-09-27T12:00:58.000Z",
          "Titre": "Couldn’t be happier",
          "Contenu": "Couldn’t be happier, second payment received this year for unauthorised use of my images (booking.com). Simple form to fill in with the details and they take over and their team do all the work. The money then transferred into your account."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "James L",
          "Nb_Reviews": 4,
          "Date": "2023-10-06T16:49:56.000Z",
          "Titre": "Managed the whole photographic copyright case…",
          "Contenu": "Managed the photographic whole copyright infringemnt case for me, negotiated with the user and transferred the funds to my account too. Granted they take a chunk in commission but some money for your work is better than none! They have already identified a number of other copyright infringements that I would not have identified myself, and are working on pursuing those cases too. Won't hesitate to use again for all my copyright infringement claims."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Happy photographer",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T18:24:50.000Z",
          "Titre": "Absolutely amazing experience from Pixsy",
          "Contenu": "Absolutely amazing experience from Pixsy, they found my work being used and with little input from me had it resolved in fast time, I was compensated for my work and rightly so, thank you Pixsy for a great result 10/10 from me"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sara Hayden Photography",
          "Nb_Reviews": 2,
          "Date": "2023-08-09T12:25:00.000Z",
          "Titre": "Ongoing service is great",
          "Contenu": "Ongoing service is great, unfortunately the time it takes to claim your licencing fee is never a quick process however that is down to the other side not Pixsy. Currently awaiting my 3rd and highest payout so far. Worth the cost to protect your work."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Barbara R Jones",
          "Nb_Reviews": 20,
          "Date": "2021-11-14T16:08:44.000Z",
          "Titre": "Great service for Photographers who get…",
          "Contenu": "Great service for Photographers who get their work stolen, often by so called reputable companies that ought to know better. When the aforesaid download your work, remove the watermark and add their own to advertise their goods for profit then that is just plain theft ! They know exactly what they are doing. Going by comments on this site they don't like getting caught out either..."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ms Pap",
          "Nb_Reviews": 3,
          "Date": "2021-04-16T09:12:17.000Z",
          "Titre": "I don't have many photos uploaded (45)…",
          "Contenu": "I don't have many photos uploaded (45) but some have already been found on websites otherwise I wouldn't know about. Luckily, only my licensed (stock agency) shots that were published, but good to keep an eye on them (no illegal uses or infringements yet). I would recommend Pixsy as when I have my photo identified somewhere, I get an Email notification so I don't need to keep checking back on their site. Uploading shots are quick and easy, so it's no hassle and you can have that added peace of mind that your library is \"policed\" while you sleep."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Daniel Schwabe",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T15:12:20.000Z",
          "Titre": "Excellent and effective service!",
          "Contenu": "Pixsy provides great service. The search bot is pretty thorough, has a friendly interface to filter and review matches. When ao case is found, they are effective in pursuing viable cases. It has saved me an incredible amount of time, and provided an additional revenue stream. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Peet de Rouw",
          "Nb_Reviews": 8,
          "Date": "2023-09-10T16:10:26.000Z",
          "Titre": "Use Pixsy to protect your work.",
          "Contenu": "I can recommend Pixsy to every photographer because they are of great value in protecting your photos. They ensure that you receive payment for your work if it is used without your permission."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Jonni42 Jonni42",
          "Nb_Reviews": 5,
          "Date": "2021-04-13T06:21:11.000Z",
          "Titre": "Very happy long time user",
          "Contenu": "Have used pixsy for about a year as a ptoffesional photographer. And their image finding algoriths are amazing being able to find any picture you upload to their database on other websites. They also have good integration with Flickr and other photo sharing sites and apps. They also have great legal notices and such that u can send out when u want to talk to someone who stole your picture. They also helf u find contact info on the webpage of tjose thst stole your picture in the first place."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Wakem",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T19:47:55.000Z",
          "Titre": "I love Pixsy !",
          "Contenu": "I love Pixsy ! They are 100% for photographers rights. I have recovered tens of thousands of dollars in copyright infringements and have faith in the world again after being robbed from for decades. They are well organized and the staff has been fantastic in helping to get cases submitted. Highly recommend !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alec Martin",
          "Nb_Reviews": 1,
          "Date": "2021-07-23T16:53:24.000Z",
          "Titre": "Pixsy is Legit and very helpful",
          "Contenu": "Pixsy helped me resolve several cases of copyright infringement. Some people think they're a scam...they're NOT! They even escalated a case through their legal partners (because someone didn't take them seriously) and I received big bucks. Thanks Pixsy!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Addsy",
          "Nb_Reviews": 2,
          "Date": "2022-11-18T23:00:20.000Z",
          "Titre": "This is a unique company that takes…",
          "Contenu": "This is a unique company that takes over and fixes the problem when you don't know where to turn or even where to start when your images show up on the web without your permission. I've made more money through Pixsy then stock image companies alone. So highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vision Trail Media LLC",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T06:47:58.000Z",
          "Titre": "Pixsy is truly amazing",
          "Contenu": "They made seeing that my image was used in a commercial setting easy. They handled my case professionally and fairly for all involved. It was nice to see that they have compassion for others situations that warrant it. They ultimately asked me how I wanted to handle the situation, but offerered a route I found to be very fair for the other parties situation. I agree that mistakes are made and that sometimes the situation warrants compassion. It was great to work with a human that expressed this and not just a corporate machine."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Francesco Gavazzeni",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T14:20:35.000Z",
          "Titre": "Pixsy find and fight image theft, really!",
          "Contenu": "Pixsy managed to recover payment for a photo published without authorization on a Swedish online magazine and have it deleted from the site that had used it.My compliments to: Pixsy"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Mario T.",
          "Nb_Reviews": 2,
          "Date": "2022-02-03T10:11:36.000Z",
          "Titre": "Used Pixsy twice - Got paid twice",
          "Contenu": "Thanks to Pixsy, I got paid for the unauthorized use of my photos twice so far. They get the job done! Both times everything was pretty much on autopilot, once you submit a case that gets accepted.Their legal partners are very experienced, so they will let you know if a case has poor chances of being successful, and they will not accept it, so there's no time wasted on either end.I highly recommend their services."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Isolde",
          "Nb_Reviews": 1,
          "Date": "2021-05-18T11:47:46.000Z",
          "Titre": "I've used pixsy for about 2 years as a…",
          "Contenu": "I've used pixsy for about 2 years as a professional photographer, it's easy to use and their algorithm has been able to find some commercial infringement cases for which i was able to receive financial compensation. You just submit the case to pixsy and they take care of the rest. It's also possible to send out takedown requests or just ignore the use of a photo (personally i don't go after personal blogs or small indy publications). The pixsy team is friendly and easy to communicate with. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paula",
          "Nb_Reviews": 3,
          "Date": "2021-08-14T12:25:33.000Z",
          "Titre": "I love Pixsy!  They recover around £1000 a year in theft fees for me",
          "Contenu": "I love Pixsy!  I've been using them around 4 years now.  I'm a full time photographer and my work gets stolen regularly, usually from my clients websites.  Dishonest traders and web designers use my clients websites or google images to harvest photos.  Pixsy recover around £1000 a year for me. Highest single amount was $625 for a set of photos stolen by an estate agent from their competitors website. After all, why pay for photos when you just can steal mine off the estate agent down the road?!!Money is paid direct into my Paypal or company business account.  It may seem like paying Pixsy 50% is a lot, but it's a bargain for the stress free, effective service they provide.I recommend them to all my photographer friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory Mitchell Rvbridgeman",
          "Nb_Reviews": 5,
          "Date": "2021-11-30T04:42:18.000Z",
          "Titre": "Easiest Copyright Service on your side !",
          "Contenu": "There is finally a easy way to find your artwork being used with or without your permission. Pixsy offers one stop to do everything.Register, copyright, worldwide matching, legal team. Thanks,Rvbridgeman"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lei Han",
          "Nb_Reviews": 2,
          "Date": "2023-04-25T00:34:53.000Z",
          "Titre": "What really stood out to me was the…",
          "Contenu": "What really stood out to me was the level of expertise and attention to detail that Pixsy provided. Overall, I would highly recommend Pixsy to any photographers in need of legal assistance. The team is knowledgeable, professional, and truly cares about its clients."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebecca Korpita",
          "Nb_Reviews": 1,
          "Date": "2021-03-31T20:46:36.000Z",
          "Titre": "This is a wonderful service",
          "Contenu": "This is a wonderful service.  It is difficult for an artist to police the internet for intentional or unintentional use of an artist's work leaving no time to create not to mention the stress of finding out someone has stolen your image.  Thanks so much Pixsy for being a valuable tool against image theft!"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "magillagorilla",
          "Nb_Reviews": 8,
          "Date": "2022-10-06T13:58:58.000Z",
          "Titre": "I really like this company!",
          "Contenu": "I really like this company, they provide a great service and I appreciate the regular emails I get showing recent or new activity regarding my photographs. I enjoy looking through to see where my images have ended up. I will continue to use them and have only positive things to say about them!"
        },
        {
          "Note": 5,
          "Lieu": "CY",
          "Pseudo": "Michalis Michaelides",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T18:22:09.000Z",
          "Titre": "Pixsy is protecting my photos for me.",
          "Contenu": "Pixsy has traced several cases of my work being used for advertising purposes without my permission. I have already submitted a case with Pixsy to take care of these cases on my behalf"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Peet de Rouw",
          "Nb_Reviews": 8,
          "Date": "2021-03-18T19:54:09.000Z",
          "Titre": "The photographers best help",
          "Contenu": "As photographer I am very happy with Pixsy. They help me finding my unauthorized pictures online. Once you submitted a case (very easy to do) you can lean backwards and let the legal help do their work. Pixsy have arranged payments 10 times already and even now I have pending cases and some cases in progress.Are you a photographer with online pictures you should join Pixsy and see what they find online. I was amazed about the number of matches they found."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Rob Snow",
          "Nb_Reviews": 23,
          "Date": "2021-04-08T07:23:46.000Z",
          "Titre": "Catching the copyright thieves with ease!",
          "Contenu": "I have been using Pixsy now for over 4 years.As an illustrator I find my work is constantly being harvested and used illegally in several counties around the world. Many people use the images as well, as they assume Google is a free resource for the website posts and builds. Pixsy helps track all this down. It's not perfect, but it does help the process a great deal.Also, at present it is primarily set up for photographers. As an illustrator I can only use the search and find option, as the takedown option and register artwork at the Library of Congress is limited to photographers. But I would recommend the platform (if you want a shock at the level of copyright theft), and I am glad there are teams out there trying to help us creatives."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joan Carroll",
          "Nb_Reviews": 4,
          "Date": "2023-06-03T01:58:35.000Z",
          "Titre": "thanks once again to Pixsy!",
          "Contenu": "I always love how Pixsy does all the hard work for the artist. It is so much easier and more effective a method of getting reimbursement for copyright infringement than trying to do it all yourself."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "James Evans",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T03:24:23.000Z",
          "Titre": "Great service for photographers",
          "Contenu": "Pixsy have been excellent for me in finding and sending license requests to unauthorised users.  Sometimes cases can take a while and some get discontinued, but others do result in payment.  I suppose the real impact has been that Pixsy rarely find any incidences of unauthorised use of my images anymore, after about 3 years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Candice Montgomery",
          "Nb_Reviews": 1,
          "Date": "2022-10-16T01:04:10.000Z",
          "Titre": "Pixsy has been a big help",
          "Contenu": "With Pixsy's help, I've been able to get paid for the unauthorized use of my images. Even if the unauthorized use isn't a case where payment can be recovered, Pixsy helps with takedown notices. This is a great service for photographers that I happily recommend."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Steve Waterhouse",
          "Nb_Reviews": 14,
          "Date": "2023-10-17T18:24:05.000Z",
          "Titre": "Easy to use website and the team are…",
          "Contenu": "Easy to use website and the team are very helpful and Professional. Regularly updates on every case.Highly appreciate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan Blakely",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T19:26:44.000Z",
          "Titre": "Best Business Decision I've Made",
          "Contenu": "Connecting with Pixsy has been one of the best business decisions I've ever made.  It would be impossible for me to track down and resolve all of the copyright infringements of my photographs without Pixsy's help.  With Pixsy's help I found that hundreds of my copyrighted photographs had been stolen and were being used without my knowledge.  Pixsy's account managers are experienced professionals who help photographers like me enforce their copyright with a minimum of effort.  I cannot recommend Pixsy highly enough."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "petezab",
          "Nb_Reviews": 5,
          "Date": "2021-03-30T15:59:44.000Z",
          "Titre": "Excellent Service",
          "Contenu": "It's amazed me how many of my images are being used on other sites, Pixsy's websites shows you exactly where and offers you various option as to how you want to deal with the infringement.  So far, I can't fault their service."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Karsten Gieselmann",
          "Nb_Reviews": 3,
          "Date": "2022-11-07T19:24:53.000Z",
          "Titre": "With Pixsy by my side, I'd wish there would be more sites stealing my work 😊",
          "Contenu": "Pixsy serves the candidates/opportunities to claim compensation for unauthorized use on a silver platter; I just need to pick them. Plus, they take full care of all  communication and negotiation with affected parties. Without Pixsy, I'd probably not take action, even if I was aware of misuse, because effort and cost would be too high.As a hobbyist, with Pixsy by my side, I'd wish there would be more sites out there using my work in unauthorized manner and commercial context 🙂"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PFI",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T18:52:13.000Z",
          "Titre": "Great experience and ease use",
          "Contenu": "Great experience and ease use. Pixsy is great!  Using Pixsy allows me to focus on other parts of my business."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "AA",
          "Nb_Reviews": 1,
          "Date": "2021-05-26T09:32:41.000Z",
          "Titre": "I have started using Pixsy as a…",
          "Contenu": "I have started using Pixsy as a professional photographer a few months ago (included in my SmugMug plan). Great service, excellent scanning capabilities. Within seconds it found all my images that I have authorized to use on several other websites around the globe. Makes me feel a bit safer and also in control of the situation when it comes to online image theft."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike M.",
          "Nb_Reviews": 2,
          "Date": "2021-08-04T13:58:50.000Z",
          "Titre": "Outstanding!",
          "Contenu": "Outstanding!Pixsy.com is a great site for monitoring your images and finding illegal uses. It is an easy to use service and best of all they're quick to respond to questions and fast to pursue legal issues. Best of all they get you paid."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Scott Henderson",
          "Nb_Reviews": 1,
          "Date": "2021-03-17T21:09:42.000Z",
          "Titre": "Pixsy comes through for me.",
          "Contenu": "I am very glad I have started using Pixsy to monitor my online Images. In my very first case they were able to resolve it quickly and to my satisfaction. Without Pixsy I would not have been aware or able to address the infringement. Highly recommend their service and help."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Ari Rex",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T00:41:04.000Z",
          "Titre": "Excellent handling of my case which…",
          "Contenu": "Excellent handling of my case which resulted on recovering the money from the company that used my image without my consent. Thank you Pixsy team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick Koudis",
          "Nb_Reviews": 2,
          "Date": "2021-03-09T18:02:38.000Z",
          "Titre": "I am an Artist represented by Pixsy for…",
          "Contenu": "I am an Artist represented by Pixsy for years. I use Pixsy to pursue infringers of my work. They’re a legitimate and extremely effective ally. They’ve represented me on hundreds of cases worldwide and they come highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendie Williams",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T16:40:49.000Z",
          "Titre": "Pixsy is wonderful to work with my only…",
          "Contenu": "Pixsy is wonderful to work with my only issue is the website could be a little more user friendly."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Markus Hofstätter",
          "Nb_Reviews": 2,
          "Date": "2021-03-12T18:47:27.000Z",
          "Titre": "Great, nerve saving Service",
          "Contenu": "Great Team and very helpful with my cases.I tried to deal with the copyright infringements of myself before and for sure don't want to do that ever again after I worked with Pixsy. One thing is sure, you will get less money, because Pixsy has to cover their costs too. But it is much cheaper than working my own hours on every case. And the most important thing, it is much more relaxing. I 100% recommend their efforts and work"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Tux",
          "Nb_Reviews": 2,
          "Date": "2023-10-13T10:47:42.000Z",
          "Titre": "Top service",
          "Contenu": "Top service! Good software that works customer friendly. Very helpful and friendly customer service. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Niels Hapke",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T08:44:07.000Z",
          "Titre": "Pixsy helps detect copyright infringements",
          "Contenu": "Pixsy helps us detecting copyright infringements of our images and to fight for compensation or gets them down for us. We are significantly saving time as lots of the parts are automated."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Phil Sproson Photography",
          "Nb_Reviews": 35,
          "Date": "2022-12-24T13:11:43.000Z",
          "Titre": "I use Pixsy to look after my image library online",
          "Contenu": "I use Pixsy to look after my image library and rely on them to monitor for unauthorised usages of my work across the internet. To date, I have been able to recover commercial rates for image usage a number of times. I recommend that all professional photographers use Pixsy to look after their work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peggy Reynolds",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T18:50:22.000Z",
          "Titre": "Unauthorized Use of My Photo by a Business",
          "Contenu": "My photo was being used by a business without permission or payment. Pixsy resolved this issue and the business paid a fee.  I received a payment of 50%, of the fee, with the remainder going to Pixsy. They did not charge for this service. This is my first case with Pixsy and I'm satisfied with the result."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Moreno G",
          "Nb_Reviews": 1,
          "Date": "2021-04-08T15:28:09.000Z",
          "Titre": "Very good service",
          "Contenu": "My experience with Pixsy is undoubtedly positive. Pixsy proved for the second time to be an excellent point of reference and a great help in claiming my copyright in the event of a photo theft. In addition, the search engine is really a bomb and manages to find even the images that remain hidden using other search engines. I certainly recommend Pixsy to photographers who discover unauthorized uses of their photographs."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Anthony",
          "Nb_Reviews": 2,
          "Date": "2023-01-13T15:51:31.000Z",
          "Titre": "Great relationship with Pixsy",
          "Contenu": "I have been working with Pixsy for the past four years and I am quite satisfied with their efforts and results. They have an excellent user interface and which masterfully displays the impacted images, the potential cases to be pursued and the status of each case already in progress. With over $10,000 USD in damages coming back to me directly, I can say that it has been one great relationship working with Pixsy and its staff. The recent availability of the financial breakdown for each successfully closed case is most informative and welcome as I know with surgical precision what funds were received and how they were distributed!"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Hugh",
          "Nb_Reviews": 2,
          "Date": "2021-07-28T11:52:53.000Z",
          "Titre": "A very efficent tool for tracking your online images",
          "Contenu": "A great aid to tracking illegal/legal usage of your images online. A limited version of Pixsy search comes as part of a flickr pro account."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Klaus Hiltscher/Affendaddy",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T15:07:44.000Z",
          "Titre": "God save Pixsy!",
          "Contenu": "The function works ! That's great!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2022-11-05T10:28:15.000Z",
          "Titre": "As a photographer i love Pixsy",
          "Contenu": "Great website, service and money generator. For many years Pixsy succesfully win cases for me and it does not take anything from my own time. I am very happy, and also my wallet is."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joan Carroll",
          "Nb_Reviews": 4,
          "Date": "2022-10-16T20:48:40.000Z",
          "Titre": "Pixsy does great work!",
          "Contenu": "Pixsy recovers several payments for me every year, something that I could never accomplish on my own. They do all the work, how great is that!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mark Burrows",
          "Nb_Reviews": 1,
          "Date": "2021-08-31T09:45:57.000Z",
          "Titre": "Wonderful company",
          "Contenu": "Wonderful company, find lots of copyright infringements that I simply wouldn't have the time to persue myself - only wish they could chase some of the worst offending nations, but as copyright theft is pretty much state sponsored in China and Russia there's not much hope there.    Generally recover around £500-1000 per annum, which for doing basically nothing on my part is frankly a great deal."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Klaus Hiltscher/Affendaddy",
          "Nb_Reviews": 3,
          "Date": "2022-11-02T18:39:08.000Z",
          "Titre": "Perfect",
          "Contenu": "What can I say? PIXSY is perfect and successful. Okay, the software could still be improved, but all in all I'm very satisfied. As an expression of this, I am again sending a crate of red wine to the Berlin PIXSY office this year! Keep it up PIXSY - and thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelly Grace Price",
          "Nb_Reviews": 1,
          "Date": "2022-07-11T20:13:17.000Z",
          "Titre": "Copyright infringers beware!",
          "Contenu": "Pixsy allows you access to their service even if you don't pay them a monthly monitoring fee- which is unheard of.  Their monthly reports help me manage my intellectual properties:  they even found a few glaring public-facing infringements that had been around for almost a decade that other image matching services hadn't previously found.  Copyright infringers have a lot to be worried about with Pixsy in the picture."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "alan batham",
          "Nb_Reviews": 12,
          "Date": "2021-04-02T17:16:21.000Z",
          "Titre": "I regularly use Pixsy",
          "Contenu": "I regularly use Pixsy, and have often had payouts for images used without my permission. They are the market leaders as far as I know, nobody does it better"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara",
          "Nb_Reviews": 4,
          "Date": "2023-03-23T23:14:43.000Z",
          "Titre": "Love Love Love",
          "Contenu": "Great, thorough communication.  It's wonderful knowing someone has your back and can do the leg work that Pixsy does!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcia Matthews",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T04:42:37.000Z",
          "Titre": "Very helpful services!!",
          "Contenu": "I really appreciate how the folks at Pixsy stayed in touch with me and kept me updated with each case that I submitted. I will continue to use their service."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Dave Walsh",
          "Nb_Reviews": 4,
          "Date": "2023-11-08T13:43:30.000Z",
          "Titre": "Great way to track down unpermitted use…",
          "Contenu": "Great way to track down unpermitted use of images."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Stefan Lange",
          "Nb_Reviews": 3,
          "Date": "2021-11-12T12:18:19.000Z",
          "Titre": "Great asset for a photographer",
          "Contenu": "They have been so useful to me to find out what is happening to my images all over the web and the world.  It's a great service to have running in the background of my online image presence."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick Koudis",
          "Nb_Reviews": 2,
          "Date": "2022-10-13T19:13:31.000Z",
          "Titre": "Fantastic company",
          "Contenu": "Fantastic company. They're very professional and responsive. I've dealt wth them for some time now, and I have nothing but good things to say about them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christina Conte",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T05:43:55.000Z",
          "Titre": "Phenomenal customer service with Pixsy!",
          "Contenu": "Love this company! Fantastic customer service with Pixsy. I really feel I have them on my side. Extremely helpful and always exceeding my expectations."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Homer Sykes",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T17:34:58.000Z",
          "Titre": "Very good backup help from Susan in the…",
          "Contenu": "Very good backup help from Susan in the Support"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Lena Mucha",
          "Nb_Reviews": 4,
          "Date": "2021-08-08T09:31:40.000Z",
          "Titre": "Such a great and important platform…",
          "Contenu": "Such a great and important platform that helps to take action in case of copyright infringement. Wonderful support! Thank you so much!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ingelbert Lievaart II",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T10:29:20.000Z",
          "Titre": "Finding my photos",
          "Contenu": "I occasionally find my photos, via Pixsy, in unexpected places. No serious infringements but it gives me peace of mind knowing my images are protected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CK",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T21:58:46.000Z",
          "Titre": "Always a positive experience",
          "Contenu": "Pixsy has been great for finding unauthorized uses of my photographs and resolving cases with entities using them for commercial purposes. They are very professional and keep me up-to-date with the progress of each case. I highly recommend this company to other photographers."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "petach",
          "Nb_Reviews": 7,
          "Date": "2021-03-25T21:21:51.000Z",
          "Titre": "quick to react",
          "Contenu": "quick to react, information easy to understand. Great free package. for non pro members with few (but excellent and sellable) images"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Rob Durston",
          "Nb_Reviews": 1,
          "Date": "2021-03-09T19:45:27.000Z",
          "Titre": "I signed up with Pixsy about 5 years…",
          "Contenu": "I signed up with Pixsy about 5 years ago. I linked all my sites with them to catalogue my images . . . . . and then I forgot about it.Then three years ago I logged on just to see what was happening. I had 2800 infringement cases. I weeded through them and the Pixsy user interface is much easier to use than the last company I was with. I whittled it down to around 1600 and many of them were no go's but we are working on a few high profile companies right now that have infringed.I'm very happy to have Pixsy doing the majority of this work for me.Its cases I would have never found, or had the time to persue."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tony Breen",
          "Nb_Reviews": 10,
          "Date": "2021-06-21T09:38:55.000Z",
          "Titre": "Extremely helpful tool",
          "Contenu": "Extremely helpful tool. Like a guard dog for your online portfolio. Just upload the photos and forget about it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Olbinski",
          "Nb_Reviews": 2,
          "Date": "2022-12-14T00:07:15.000Z",
          "Titre": "Nothing but amazing things to say about…",
          "Contenu": "Nothing but amazing things to say about Pixsy. Had little expectations but have actually succeeded in sending out claims that have resulted in actual payments from copyright violations. Excellent work and customer service!"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Anette Mossbacher",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T18:49:17.000Z",
          "Titre": "very responsive",
          "Contenu": "I like how responsive they are and helpful. Thanks so much guys :D"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Pamela",
          "Nb_Reviews": 3,
          "Date": "2021-03-10T14:10:19.000Z",
          "Titre": "2nd review",
          "Contenu": "A longer process due to the pandemic but still kept informed by email and telephone. 2 cases  nearly completed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lei Han",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T18:11:53.000Z",
          "Titre": "great experience!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alison White Gaudion",
          "Nb_Reviews": 13,
          "Date": "2021-03-15T11:56:35.000Z",
          "Titre": "Pro Photographer - they do it all!",
          "Contenu": "I'm a pro photographer and this company has made me almost $1000 with one photo - they do it all! Great company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T20:32:22.000Z",
          "Titre": "The staff is friendly and very helpful",
          "Contenu": "The staff is friendly and very helpful. I didn’t know that my images were being used commercially. Helped me with my case and resolved it"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John Stewart",
          "Nb_Reviews": 2,
          "Date": "2021-03-09T16:48:22.000Z",
          "Titre": "Excellent for Photographers",
          "Contenu": "I have used Pixsy for several years now, and it's a great platform for photographers, helping you find unauthorised use of your images and then handling everything for you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark K",
          "Nb_Reviews": 1,
          "Date": "2023-03-25T22:02:37.000Z",
          "Titre": "Pixsy was great handling my case",
          "Contenu": "Pixsy was great handling my case and, beyond my expectations, got me a cash settlement for unlicensed use of my photos."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Peet de Rouw",
          "Nb_Reviews": 8,
          "Date": "2023-02-03T23:39:25.000Z",
          "Titre": "I love Pixsy",
          "Contenu": "Pixsy has helped me many times to make the people who illegally use my photos pay for the use."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Cliente",
          "Nb_Reviews": 3,
          "Date": "2023-01-07T11:29:45.000Z",
          "Titre": "Unexpected income",
          "Contenu": "Unexpected income, everything in the background. Fore pictures I took 20 years ago?"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Dave Walsh",
          "Nb_Reviews": 4,
          "Date": "2023-05-31T06:54:15.000Z",
          "Titre": "Looking after their members",
          "Contenu": "Great personal touch, always ready to help their members, and great results"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "r.Friederichs",
          "Nb_Reviews": 14,
          "Date": "2023-05-05T15:02:09.000Z",
          "Titre": "i Got justice",
          "Contenu": "Pixsy helpt me to get my pictures offline and get compensation for the abuse of my pictures"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alessandro Intini",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T18:08:47.000Z",
          "Titre": "The best choice to protect the…",
          "Contenu": "The best choice to protect the copyrights of our images online and offline. Very professional and transparent."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Dimitris Fatisis",
          "Nb_Reviews": 1,
          "Date": "2021-04-10T11:01:26.000Z",
          "Titre": "Pixsy has a great team",
          "Contenu": "Pixsy has a great team. They're kind and respond fast and they helped me solve my issue. This site is a must for every photographer!"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Mark V",
          "Nb_Reviews": 26,
          "Date": "2021-06-29T11:14:04.000Z",
          "Titre": "Pixsy helped me",
          "Contenu": "I'm a photographer. Pixsy helped me multiple times. Good quality of service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick in Montana",
          "Nb_Reviews": 4,
          "Date": "2023-06-30T02:16:13.000Z",
          "Titre": "Quick",
          "Contenu": "Quick, easy and efficient resolution to unauthorized image use. Wish more area and non-commercial sites covered too"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "r.Friederichs",
          "Nb_Reviews": 14,
          "Date": "2023-09-02T00:25:46.000Z",
          "Titre": "I have serveral cases fixed bij Pixsy",
          "Contenu": "I have serveral cases fixed bij Pixsy. Very happy with that. It would be grate if they expand the countries"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Olivier",
          "Nb_Reviews": 5,
          "Date": "2023-06-03T10:27:17.000Z",
          "Titre": "Very useful service for any…",
          "Contenu": "Very useful service for any photographer, very well thought out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Culinary Ginger",
          "Nb_Reviews": 2,
          "Date": "2022-12-11T02:08:17.000Z",
          "Titre": "Pixsy are great to work with",
          "Contenu": "Very quick responses to cases that are eligible or not and had great success."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Jurgen",
          "Nb_Reviews": 2,
          "Date": "2023-08-02T12:04:13.000Z",
          "Titre": "Pixsy feedback",
          "Contenu": "I find Pixsy extremely professional and efficient and they do a wonderful job doggedly tracking down illicit image users which leaves the photographers more time to be creative!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Gerhard Sluiter",
          "Nb_Reviews": 4,
          "Date": "2023-10-12T11:08:18.000Z",
          "Titre": "Easy to use and good to know your pics…",
          "Contenu": "Easy to use and good to know your pics are protected"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "iayestaran",
          "Nb_Reviews": 2,
          "Date": "2021-04-09T13:37:46.000Z",
          "Titre": "a security blanket",
          "Contenu": "I don't really have the time to police my photos, so is good to know that pixsy has your back"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jared Earle",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T18:10:01.000Z",
          "Titre": "Pixsy are awesome",
          "Contenu": "Pixsy are awesome. They’ve found loads of infringements and got me paid for them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Dressler",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T16:27:06.000Z",
          "Titre": "Quick and expert advice"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David Latham",
          "Nb_Reviews": 3,
          "Date": "2023-05-12T13:07:37.000Z",
          "Titre": "case resolved quickly",
          "Contenu": "case resolved quickly, profitably and without fuss"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Notley Hawkins",
          "Nb_Reviews": 6,
          "Date": "2021-09-17T17:33:54.000Z",
          "Titre": "I'm delighted with Pixsy's hard work…",
          "Contenu": "I'm delighted with Pixsy's hard work and service in recovering lost revenue from copyright infringers. I highly recommend their services for any professional photographer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonah",
          "Nb_Reviews": 2,
          "Date": "2023-06-20T06:10:11.000Z",
          "Titre": "The process was effortless",
          "Contenu": "The process was effortless, and out-come worth it."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Greet Druyts",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T15:13:40.000Z",
          "Titre": "Pixsy came to a positive outcome and…",
          "Contenu": "Pixsy came to a positive outcome and handled it fast."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Alexander Petrov",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T07:50:49.000Z",
          "Titre": "The quality is great and the customer…",
          "Contenu": "The quality is great and the customer service is always great!"
        },
        {
          "Note": 5,
          "Lieu": "PE",
          "Pseudo": "Alex",
          "Nb_Reviews": 3,
          "Date": "2023-06-17T09:47:50.000Z",
          "Titre": "So easy to work with. Always a pleasure.",
          "Contenu": "Super quick customer service and always looking out for their clients."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Alessandro Belgiojoso",
          "Nb_Reviews": 1,
          "Date": "2021-11-15T09:44:27.000Z",
          "Titre": "great help to protect your work or your…",
          "Contenu": "great help to protect your work or your creativity on the web!"
        }
      ]
    }
  ]
}