{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "poecurrency.com",
      "Review": [
        {
          "Note": 1,
          "Pseudo": "Lemonize",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T18:20:34.000Z",
          "Titre": "Very slow delivery times",
          "Contenu": "Very slow delivery times, almost scam you. they forget you again and make u wait 5 hours again.Go to a other site for way better service"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "GodSlayah",
          "Nb_Reviews": 3,
          "Date": "2023-09-03T00:20:49.000Z",
          "Titre": "Didnt get what i paid for",
          "Contenu": "Paid for an order only to be told the price was wrong and i did not get the amount of items i paid for, asked for emails for management/owner only to be transfer to the \"team leader\". Would not trust buying from here because you might not get what you paid for."
        },
        {
          "Note": 1,
          "Lieu": "FI",
          "Pseudo": "Janne Rantala",
          "Nb_Reviews": 2,
          "Date": "2023-04-16T11:57:19.000Z",
          "Titre": "16,5hour delivery time.",
          "Contenu": "16,5hour delivery time.. Page states clearly that they always deliver in promised time.. Well waited online 7 hours at night, messaging from live chat was alwayd \"they deliver within hour\" \"im contacting delivery department\".. Play time is precious and order was placed cause of the promise. No apologies, no compensation for waited time.Can't recommend"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Keith",
          "Nb_Reviews": 3,
          "Date": "2023-08-28T16:40:55.000Z",
          "Titre": "Cannot delivery currency on time very…",
          "Contenu": "Cannot delivery currency on time very bad service unfortunately because I liked them very much in the past.Refused to make it right over $2 thinking they could buy a review delete with a 5% coupon after lying to me taking over 5 hours and having their employee treated like trash.Asked me to contact a manager so I tried and the customer service agent Lin who is apparently gold support refused to get one and told me to wait 9 hours for a manager even though THEY requested to talk to me."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T05:15:49.000Z",
          "Titre": "Did not complete my order",
          "Contenu": "Did not complete my order. A week later and still have not recieved all items. Have been promised and promised. But seems to me that I'm just being messed around and promised things to shut me up.Have wasted a lot of time chasing this, but got no where"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T02:15:09.000Z",
          "Titre": "Awful Delivery Process",
          "Contenu": "I've given them more than 24 hours to complete the order and even when i received an email statement saying my delivery was ready i am still not getting any assistance."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T08:04:15.000Z",
          "Titre": "Slow service",
          "Contenu": "Took 3 hours to get my whole order and when I spoke to live chat the only thing they could say is \"the order is still processing\""
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T01:55:56.000Z",
          "Titre": "slow deliver"
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "adam",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T01:05:36.000Z",
          "Titre": "I got a ban the day after delivery"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T22:13:14.000Z",
          "Titre": "Got banned immediately",
          "Contenu": "Got banned immediately, do not recommend this service. Even when moving small amounts of currency."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Your name",
          "Nb_Reviews": 2,
          "Date": "2022-08-19T23:51:39.000Z",
          "Titre": "I’ve been waiting for 3 hr now and…",
          "Contenu": "I’ve been waiting for 3 hr now and still waiting, they tried to change my whole order for like 5 exalted orbs and I expected because the said it would be faster and that was an hour ago! I reached back out to get my actual order and they dodged the questions so I’m 3 hr and 20 minutes in not even knowing what I’m getting"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "The Punisher",
          "Nb_Reviews": 1,
          "Date": "2022-07-12T21:37:15.000Z",
          "Titre": "Got banned a few days after the trade",
          "Contenu": "Got banned a few days after the trade. I traded items back as advised and still got flagged. Gutted as just spent 400 points on stash tabs, Appealing the decision with GGG but my hopes are not high. DO NOT TRUST, GGG has upped their detection of this."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "customerone",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T22:34:37.000Z",
          "Titre": "PoE Account was banned after purchase!",
          "Contenu": "PoE Account was banned after purchase!Update: I was contacted by Poecurrency and offered a refund when I delete this bad review! I have a screenshot of this conversation. If this review gets deleted, the risk of being banned is hidden from other customers. This is very disappointing. They should have just offered the refund without trying to manipulate this legit review and put a customer under pressure to delete a review."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 3,
          "Date": "2022-07-02T15:01:13.000Z",
          "Titre": "Find someone who cares.",
          "Contenu": "This is one of the worse experiences I’ve ever had. They advertise delivery in 15 minutes on average. What they don tell you is if you place a larger order for 200 exalts in Poe then the delivery time could be as high as 2 hours. I waited 2 and a half hours for delivery. During the whole process I stayed on chat with their support and requested updates every 30 minutes. While their demeanor was friendly enough if you asked a question they didn’t want to answer they would copy and paste a generic answer and ignore you. My advise is find another company to buy currency from if your going to buy any real amount of currency."
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2022-02-18T17:27:13.000Z",
          "Titre": "DO NOY BUY FROM THESE SCAMMERS",
          "Contenu": "i have spend over $100 at poecurrency before and keep getting banned I've lost all my accounts and all my money. they are now asking to see my credit card front side out of the blew and no one should be asked for it. i highly recommend do not buy from them you WILL get banned and will lose your items"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sye",
          "Nb_Reviews": 2,
          "Date": "2021-10-31T05:58:25.000Z",
          "Titre": "Order was late",
          "Contenu": "Order was late.  Customer service was useless (never replied to me, tried contacting 6 times). Tried asking for refund and “Scott” closed the live chat instead.Reply: You didn’t list a delivery speed. Your online rep said 15minutes, and it was 35. You also didn’t say anything about your customer service in your reply, don’t send me emails saying I can change my review when even your response sucks."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "kirneh89",
          "Nb_Reviews": 7,
          "Date": "2021-11-07T22:55:00.000Z",
          "Titre": "STAY AWAY",
          "Contenu": "STAY AWAYWaited more than 6 hours ingame for my items and support kept telling me they would rush my order but nothing happende, when i asked for a refund i got ignored by the support, TWICE!have had orders with them before with the same problem of dumb delivery times, not worth the wait, and considering the latest one ived call them borderline scammers"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "King MVP",
          "Nb_Reviews": 2,
          "Date": "2021-10-28T09:35:11.000Z",
          "Titre": "There 100% refund on undelivered or delayed items is false advertising",
          "Contenu": "After 1 hr I contacted customer service to see how long till my order would arrive they said within 1 hr so 1 1/2 hrs later I contact costumer service asking where my order is I need to get off they said hold on someone will attend to you right now that right now took 40 min which I got no response from seller so I asked customer service to give me a refund for the 3 hr delay they replied with the guy is coming right now which that right now took another 30 min horrible customer service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T06:42:09.000Z",
          "Titre": "15 minutes was what was promised on the…",
          "Contenu": "15 minutes was what was promised on the website, it took an hour and 48 minutes for the item that I had ordered to deliver on to my account, not only was this misleading but not promised from the website. No ramification was given. 2/5 tbh."
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "Đăng Khoa Nguyễn",
          "Nb_Reviews": 1,
          "Date": "2022-03-06T02:18:02.000Z",
          "Titre": "My account was forever ban",
          "Contenu": "My account was forever ban after using this service just now .That account i play for 4 years is gone forever just like that. If anyone of you guy read this then do not use your account you love to trade just like me. My journey of poe end here."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jake Howard",
          "Nb_Reviews": 1,
          "Date": "2021-02-18T21:32:07.000Z",
          "Titre": "Steals personal information and will not refund if you refuse to give them your ID and CC card photo",
          "Contenu": "After placing an order, if you refuse to send them a picture of your ID and credit card, they'll not only not deliver your goods but they'll refuse to refund your payment.   Had to dispute with my bank to get the money back.  Horrible business.  They also sell your information and expect to be hacked if you go through their forced \"verification\" rules."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-04-27T11:17:02.000Z",
          "Titre": "I gave this company numerous chances",
          "Contenu": "I gave this company numerous chances. The first two times I went there everything was fine and I recieved my purchase within fifteen minutes. The past three times ( I’m one to give people second even third chances ) has taken 2-4 hours to receive my product and that was only after I threatened I wanted a refund. The company left me in the dark as to what was going on and just kept telling me will trade soon. After learning my lesson three times I will not be returning to this company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-17T19:44:17.000Z",
          "Titre": "delivery took over 48 hrs and was…",
          "Contenu": "delivery took over 48 hrs and was called for delivery and when i got on they said they needed more time waited another 24 hrs for delivery and didnt recieve apalogy or any sorts of compensation after being told numerous times it was going to be ready by a certain time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 2,
          "Date": "2020-11-28T20:44:26.000Z",
          "Titre": "DO NOT USE THIS SITE.",
          "Contenu": "I asked via the live chat \"do you have 1000 Fusings available for sale?\" Max tells me \"Yes.\" I tell him I will place an order then. I do the \"where's my order?\" 30 minutes later and get \"stay online and wait.\" 2 hours later, same thing. So I tell them I want my money back, you told me you had the stock and now you don't.\" 3 days later and their refusal to refund my money, they finally had the stock in hand."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-30T13:07:49.000Z",
          "Titre": "They continued to charge my credit card…",
          "Contenu": "They continued to charge my credit card until I canceled it. Dont use them they stole money from me and acted like they did nothing wrong. Services were great until I got billed a 2nd and 3rd time with no order placed. You have been warned if you want to keep your money dont use them!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeromy Kelsey",
          "Nb_Reviews": 2,
          "Date": "2021-05-13T12:21:28.000Z",
          "Titre": "SCAM DO NOT BUY!",
          "Contenu": "Company asked me for a picture of my credit card after paying through Pay Pal. When i refused they asked for a picture of my ID with name and picture visable...LOL. I refused and asked for my money back. They would no longer respond and didnt refund my money or give when what I paid for. Total Scam."
        },
        {
          "Note": 1,
          "Lieu": "AT",
          "Pseudo": "Marko Begovic",
          "Nb_Reviews": 1,
          "Date": "2020-01-18T17:41:56.000Z",
          "Titre": "Dont order on this site",
          "Contenu": "Every single time after buying im contact8ng support to ask when i will recive my currency, answer is alway\"order is prepared stay online\". Last zime i got my currency day later. And jow im waiting again for fck.... 4 hours and i know i will not get it today. Dont buy there if u need it fast. Waiting time is not normal,l. And this is 100000% my last order on this site"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-21T12:03:57.000Z",
          "Titre": "got banned from the game after the…",
          "Contenu": "got banned from the game after the tradethx for nothing, worst side to buy, don`t buy anything here again even 1 star is to much for you, it would be 0 but i need to do a least one"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2020-09-29T15:13:39.000Z",
          "Titre": "Absolute terrible website!",
          "Contenu": "Absolute terrible website!! bought Chaos i msged them 30 times they kept saying it was on the way 24 hours later i msg again and they said sorry out of stock we will refund. useless company dont buy from these guysAlso they banned me from live chat so i can't even contact them anymore lol some lin chat guy"
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "kirneh89",
          "Nb_Reviews": 7,
          "Date": "2021-11-07T22:52:20.000Z",
          "Titre": "1.5 hours for first contact and then…",
          "Contenu": "1.5 hours for first contact and then had to wait 30+ mins after first contact to get my finished order.Not really the wait i was hoping for, but they did deliver in the end.Update: Was told all their delivery guys was on national holiday but one, which caused the delay.not sure if thats true or just a excuse so ived still advice ppl to take the \"10\" min. delivery time with a grain salt..update2: rating lowered from 4* due other later orders also taking way to long for no valid reason."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Mr C",
          "Nb_Reviews": 1,
          "Date": "2020-10-11T05:38:30.000Z",
          "Titre": "First order was pretty ok - Second extremely slow",
          "Contenu": "First order was pretty good, a little slow. Second order however was over 2 hours of waiting in game, which they state otherwise will be delivered under that time frame (50 minutes).. Very long potential wait times for small orders (10 exalted orbs). Will not order from here again"
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Randy",
          "Nb_Reviews": 1,
          "Date": "2021-08-30T21:38:10.000Z",
          "Titre": "The supplier showed up 3 separate…",
          "Contenu": "The supplier showed up 3 separate occasions never delivered anything and when I finally got them to deliver something they only delivered one item out of Around 15 . I had ordered and i and i only ordered 50 of that item and they delivered a 150 of them and thinks this is OK. The service was beyond terrible could not write  Proper English so I could not understand half of what they had written down,  Out of literally hundreds of purchases I have made online with my usual company for this game I have never ever experienced anything as terrible as the service I received and being a first time customer this will also be last time."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Hungry_Tank",
          "Nb_Reviews": 1,
          "Date": "2020-06-01T13:11:20.000Z",
          "Titre": "It is legit site but bad experience.",
          "Contenu": "It is legit site, but the waiting and delivery experience was really bad.Delivery guy didn't say anything just send party invitations (which I didn't know who that was or what for), i had to portal to where he was.I just tried small purchase as a test shot. And It worked."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Evil Reaper",
          "Nb_Reviews": 1,
          "Date": "2019-10-17T19:26:09.000Z",
          "Titre": "Feeling worthles from customer service.",
          "Contenu": "Couldnt figure out how to get a coupon code and wouldnt let me purchase with out one. Asked for help and i was told thay have no codes and they couldn't give me an answer or solutions to solve the problem. So basicly jus had to leave. Talk about feeling unwanted/Poor customer service. Shame...."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bryan Fredrickson",
          "Nb_Reviews": 1,
          "Date": "2020-07-23T11:27:15.000Z",
          "Titre": "Very Slow delivery",
          "Contenu": "I waited almost an hour then I contacted support whom said I would have to wait another 30 minutes for my currency and now I have waited 2 hours and I still have not received my order    Edit: after I waited 2 hours they finally got to me after I contacted live chat twice"
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "PowerMarks",
          "Nb_Reviews": 1,
          "Date": "2020-01-25T18:00:50.000Z",
          "Titre": "says delivery in 10min its been over an hour still nothing",
          "Contenu": "says delivery in 10min been waiting for an hour now still nothing arrived, asked the 24/7 support with someone named miya how long it would take only thing she says is: im a little busy now and keeps saying it, feels like she is a roboti would defently NOT reccomend this site"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "swigger666",
          "Nb_Reviews": 1,
          "Date": "2019-10-05T02:26:57.000Z",
          "Titre": "Go elsewhere!",
          "Contenu": "Made a purchase without creating an account, my xbox charactor name and account name which was mandatory to place order, and my email \" could not be tracked \"I'm out 12 bucks , customer service with Poecurrency is about the worst I've seen anywhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "zzmastermind",
          "Nb_Reviews": 1,
          "Date": "2020-04-28T17:45:35.000Z",
          "Titre": "DO NOT TRUST THIS SITE",
          "Contenu": "DO NOT TRUST THIS SITEThey want info that they do not need and act like your a scammer.  They will act like your order is large when it isn'tJust like others have said they want pictures of stuff and info they do not need and DO NOT SEND TO THEM."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T20:17:58.000Z",
          "Titre": "Fast no issue service would highly…",
          "Contenu": "Fast no issue service would highly recommend, update next day I was banned by GGG, so revoking my 5* thought a company who deals in this would be safer.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-24T23:06:42.000Z",
          "Titre": "Waited a long time",
          "Contenu": "Waited a long time. Then received an email asking me to take exalted orbs instead. only got 6. should've gotten 7, which is just under what i paid for the original order to begin with"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Derek Young",
          "Nb_Reviews": 1,
          "Date": "2020-12-23T18:46:15.000Z",
          "Titre": "Said my payment was pending",
          "Contenu": "Said my payment was pending, but it was taken out of my account and i contacted paypal and they said it was not pending. Would not refund or give me my items, spent 2 days waiting and opened a dispute. Horrible service."
        },
        {
          "Note": 1,
          "Lieu": "CZ",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-11T00:00:51.000Z",
          "Titre": "They don't specify nothing bad…",
          "Contenu": "They don't specify nothing bad experience whit them .if you buy something in they website they give you something else and all the stats on the wepons and etc is not the same whit what you read"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Manuel Loog",
          "Nb_Reviews": 2,
          "Date": "2020-10-01T18:25:46.000Z",
          "Titre": "Careful",
          "Contenu": "Careful. Its scam and many fake reviews here.bought some stuff and chat always say \"wait please\" \"wait a second plz\"... for like 3 hours. careful buy at the serious sites pls"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason Stegmeier",
          "Nb_Reviews": 1,
          "Date": "2020-12-30T13:24:37.000Z",
          "Titre": "ABSOLUTELY IMPOSSIBLE",
          "Contenu": "I made an order after three in the past. I waited 3.5hrs and nothing after three separate occasions on the chat with 3 separate customer service reps... Now I\"m fighting for a refund..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-09T22:40:07.000Z",
          "Titre": "It took 4 hours to receive my order",
          "Contenu": "It took 4 hours to receive my order. The delivery team messaged me with a \"YHI\" as a means of contacting me about an invite to the game. Absolutely a joke."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Selene",
          "Nb_Reviews": 1,
          "Date": "2019-08-19T17:49:08.000Z",
          "Titre": "I would give ZERO if I could!!",
          "Contenu": "I would give ZERO if I could!!! They are selling stuff that they don’t actually have!! I lost almost three hours because they were “dealing with it” all the time.Spoke with support before I bought what I needed just to make sure that they have what I want and the guy Chow said that the have everything... well they didn’t.. and then I ended up talking with three different people form support and after almost three hours of waiting they told me that they will just refund me!!! WHAT IS THIS?  Don’t recommend to anyone!! This service is full of liars!!! If you don’t have something then don’t try o sell it !!!!  RIDICULOUS!! And this was my third experience with this service. Second time they also didn’t have what I paid for. Not worth the time and money and stress!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-22T20:29:02.000Z",
          "Titre": "Went with this company because my usual…",
          "Contenu": "Went with this company because my usual one was closed due to the Chinese new year. Not once did they mention it during purchase. Took almost 14 hours to get items."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Garbageservice",
          "Nb_Reviews": 2,
          "Date": "2020-07-11T20:42:03.000Z",
          "Titre": "Garbage customer service!!!",
          "Contenu": "I ordered 2 exalt and 250 chaos and it took 2 hours and me threatening to file a complaint with paypal in order to receive my items.  Do yourself a favor and shop elsewhere!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "korey lawless",
          "Nb_Reviews": 2,
          "Date": "2020-10-21T13:41:12.000Z",
          "Titre": "I ordered 20X Exalted orbs",
          "Contenu": "I ordered 20X Exalted orbs from poecurrency.com. Right away I contacted the live chat and asked how long it would take to be delivered and was told to stay online and it would be delivered shortly. After waiting one hour I contacted them again and they said the same thing. This repeated for 16 hours with them only telling me \"They will rush them\". After waiting over 16 hours the final time I contacted the live chat after multiple agents closing the chat on me I told them i was about to request a refund. they told me to wait 10 more minutes and I still received nothing.Dont trust these guys. The try to sell you stuff they do not have. something so little as 20 exalted orbs they do not have in stock so i would not risk ever spending a large amount of money here. If i could give them 0 stars i would have.BAD COMPANY - STAY AWAY"
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "kunde",
          "Nb_Reviews": 6,
          "Date": "2022-04-12T20:04:24.000Z",
          "Titre": "Good thing its a free game",
          "Contenu": "usely use someone else.. but i gave you guys a shot. now my account is locked. i had so much sh^t on that account, i trusted you"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-01T22:48:48.000Z",
          "Titre": "Terrible service gave me 10 exalted…",
          "Contenu": "Terrible service gave me 10 exalted orbs then asked for them back. I kindly did so and he never returned them, bad service would not recommend to others."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ken Myers",
          "Nb_Reviews": 1,
          "Date": "2020-12-12T14:06:17.000Z",
          "Titre": "These guys are terrible",
          "Contenu": "These guys are terrible. They jerked me around for over 6 hours and never did fully fill my order. Im calling my bank and stopping payment. BUYER BEWARE"
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Leon Vergote",
          "Nb_Reviews": 4,
          "Date": "2021-07-25T02:46:42.000Z",
          "Titre": "3 hour delivery, bad service",
          "Contenu": "3 hour delivery. Horrible chat service with repeating copy paste messages interchanging with broken english and informal messages. Do not order"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony Takenobu Simmons",
          "Nb_Reviews": 4,
          "Date": "2020-02-10T00:09:39.000Z",
          "Titre": "They claim on their website to be 5-50…",
          "Contenu": "They claim on their website to be 5-50 minute delivery. It isn't.I waited over 24 hours to get my currency and they still didn't have it ready, so I got a refund instead, which I'm still currently waiting for ($67..I know I threw a lot of money)The thing is, I used this site twice before hand and it wasn't AS bad, but it took about 6 hours or so for the delivery.Last thing, they NEVER tell you they're out of stock on anything until after you've made your purchase. Anytime I'd order orbs of scouring or alchemy orbs, I'm always told \"We're out of stock, can we give you exalts or chaos orbs in replacement?\" Which I would normally agree on, but then they're out of stock on those as well???Would highly recommend going somewhere else, this site is NOT reliable. They don't even update their site with a \"Out of Stock\" sign on their items. Very unprofessional."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tome",
          "Nb_Reviews": 1,
          "Date": "2021-01-18T22:04:33.000Z",
          "Titre": "Do not recommend",
          "Contenu": "I placed an order, the site said 15 minute deliveries.  I waited 45 before contacting support, and was told I had to wait 2 more hours."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Imafirinmalazza",
          "Nb_Reviews": 1,
          "Date": "2022-04-16T15:10:50.000Z",
          "Titre": "My account got banned after purchasing…",
          "Contenu": "My account got banned after purchasing from your site. I traded a rare item but still got flagged apparently."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tyler Reed",
          "Nb_Reviews": 1,
          "Date": "2021-08-14T00:52:03.000Z",
          "Titre": "Terrible wait times",
          "Contenu": "Wait times are waaaay to long compared to other sites on the market. save your time, money, and stress for other sites."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rusty Bros",
          "Nb_Reviews": 2,
          "Date": "2021-01-21T00:55:09.000Z",
          "Titre": "DON'T BUY FROM THEM!!!",
          "Contenu": "They make excuses to keep you waiting while they fulfill their back orders.  In real time they have ZERO stock.  They literally playing the game and waiting for RNG to drop the item you trying to buy and then sell it, but they take your money first and hold on to it.  Shady business practice.  If you have no stock you should disable your buy button.  No body got time to stay online all day just to wait and hope you will deliver.  Customer service was also useless and did nothing to fix the issue.  I gave them many chances to fix the problem but would answer with generic messages saying to \"stay online\".   Terrible first time experience will not recommend them.Update:  They will also have someone go to every review and post a generic message like this:  \"Hello, if you have any problems please contact us by 24/7 online live chat, we will try to resolve it sooner and better. Thank you.\"  If you have clearly read my review I have dealt with your online live chat where they stop answering my question and leave me waiting."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T04:14:57.000Z",
          "Titre": "Seller had to be reminded twice that…",
          "Contenu": "Seller had to be reminded twice that the service was not delivered and then did not produce everything I paid for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-17T17:06:21.000Z",
          "Titre": "Terrible customer service",
          "Contenu": "Terrible customer service. Unable to communicate, chat function doesn't work. Did not deliver what I ordered."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "xQuebecx",
          "Nb_Reviews": 1,
          "Date": "2020-09-26T13:45:27.000Z",
          "Titre": "Went here to buy some POE Currency",
          "Contenu": "Went here to buy some POE Currency, Live chat told me '' Sorry we are out off stock, we going to refund you  gonna take 10 mins'', 2 hours later still havent got the refund and the live chat say '' wait 20 more mins we are really busy '' , How can they be really busy if they are out of stock , also a refund take 2 seconds to do. I'll really dont recommand going whit them.Edit: Went back 9 hours later, they still havent refund me, but they had stock but now they are telling me :''As your order amount is a little large, we need the following pictures to verify the legitimacy of your payment：First: A screenshot of your payment page. Please log in your PayPal and find this transaction, then send us a screenshot of the transaction detail.Second: A screenshot of your hand-held payment card which you used to pay for this order. Please just show the last four digits, you can block out other digits.'' For a 12,07$ CAD Transaction this website is just a joke, i'll really dont recommand to buy there."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gamer",
          "Nb_Reviews": 2,
          "Date": "2020-07-31T09:21:25.000Z",
          "Titre": "They have a banner that says \"lowest…",
          "Contenu": "They have a banner that says \"lowest price guarantee\", I went to purchase from them, but also checked 2 other sites.  In this case, I'm looking for Harvest League-PC-Standard Exalted Orbs.  They list for .76 per.  Another site sells for .69 and a 3rd for .51.  They are actually the highest price, not the lowest.  I asked their customer service about matching price or what they do.  They do nothing apparently.  This is what they said:ElsaPlease tell me your payment email or order number? Thank you.You — Please update your infoI haven't bought yetElsadid you order~You — Please update your infoWas comparing sites, and saw thatElsaour site shows the newest priceif you need you can buy it here toothanks for your timeYou — Please update your infoSo you don't actually price match or beat their price, you just have a sign that says you're the lowest but you're not.Ok, coolSo... Buyer beware.  If they can't even be honest about their banners all over the place, I'm not giving them my CC info or trusting delivery."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-13T06:48:58.000Z",
          "Titre": "One of the worst currency sites I've…",
          "Contenu": "One of the worst currency sites I've ever used. Horrible English support, long wait times, overpriced items."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "sodlock",
          "Nb_Reviews": 1,
          "Date": "2020-03-19T02:43:45.000Z",
          "Titre": "Waited 25 minutes and got nothing",
          "Contenu": "Waited 25 minutes and got nothing. I didn't get refund because the chat assistance stop chat when I want to refund it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Justin Crudup",
          "Nb_Reviews": 2,
          "Date": "2021-07-31T02:49:18.000Z",
          "Titre": "Sells stock they dont have",
          "Contenu": "Sells stock they dont have, will make you wait hours, and move on to other customers and forget about you."
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "Oskariusz",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T20:35:03.000Z",
          "Titre": "i got ban",
          "Contenu": "i got ban, waste of money and time"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brad Hobdy",
          "Nb_Reviews": 1,
          "Date": "2020-04-16T10:35:40.000Z",
          "Titre": "STAY AWAY FROM THIS SITE!!!!",
          "Contenu": "I used Paypal and they want this info only after i asked where my stuff was... STAY AWAY!!!!!Thanks for your purchase, we have received your payment.As your order amount is a little large, we need the following picturesto verify the legitimacy of your payment：1. A screenshot of your payment page. Please log in to your PayPal andfind this transaction, then send us a screenshot of the transactiondetails.2. A screenshot of your hand-held payment card which you used to payfor this order. Please show the last 4 digits of your payment card.Why Do We Have to Verify the Payment?1. We need to verify if the payment is authorized by the owner of thecredit card/debit card/payment cards.2. Some buyers under 18 years old who pay with their parents' paymentcards without the permission.3. Unusual Purchase pattern from you. (Large Amount or High Frequencyof Purchase)4. High chargeback rate is coming from your country.If you have any additional questions, feel free to contact us via LiveChat.POECurrency Support.Days later and still nothing .. im just letting paypal handle the refund ... STAY AWAY FROM THIS SITE"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Herbert Peterson",
          "Nb_Reviews": 1,
          "Date": "2021-02-15T17:35:08.000Z",
          "Titre": "tried to buy from then they refused to…",
          "Contenu": "tried to buy from then they refused to give me what i paid for and refused to give me my money back"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "CCDLtd",
          "Nb_Reviews": 1,
          "Date": "2020-12-22T06:39:08.000Z",
          "Titre": "did not deliver what was asked of and…",
          "Contenu": "did not deliver what was asked of and tried to get my id from me also, scammer be careful"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-30T17:41:42.000Z",
          "Titre": "My account got banned literally same…",
          "Contenu": "My account got banned literally same day i bought the exalts so. good job"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mirco PT",
          "Nb_Reviews": 1,
          "Date": "2020-10-11T08:52:12.000Z",
          "Titre": "Are you serious ?",
          "Contenu": "So i decide to buy from this website cause is a little bit cheaper than the other one i was using . I paid $99.05 via paypal . Paypal confirm the payment to my email i check my debit card and the money is gone . And they still telling me that they didnt got my money .. and the money is on hold cause paypal decide to put it there .. after i google a lot about this i found that if they are a new seller paypal or they had issues with refounds and or they didnt provide documents . Paypal will hold they payment till the investigate they seller account is legit .. in that scenario thats not my problem .. i already payed if paypal hold the money i send cause they didnt fix their paypal thats not my problem and they are telling me that i need to wait till paypal give them the money that can days or months who knows ... how is this possible how a website works like this ... i bough from many  websites and never had a problem i called my bank to tell them why they are holding they payment and they told me the payment has been made and the seller should know that paypal hold the payment for them but still they need to deliver the item cause they will get it when paypal decide ... this is the worst thing ever happend to me buying somewhere and on live chat they are just transfering me to differents agents ..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wes",
          "Nb_Reviews": 2,
          "Date": "2020-03-15T17:19:45.000Z",
          "Titre": "If I could give negative stars I would",
          "Contenu": "If I could give negative stars I would. This possibly has to be the worst interaction ive had with any type of site. The site says 15 min delievery. I waited about 40 mins and then contacted customer service who stated that it was busy and may take longer due to a recent update/new season. I then waited 40 more mins. \"Ryan\" my customer service stated that I didn't know anything and I should be more patient. I asked Ryan if he knew how long this would take. He told me to wait longer. Ryan then went on a long dissertation how I didn't know anything. I then sent an email to there customer service stating how Ryan hasn't been the best customer service. I get a reply that says \" Ryan has been fired\" clearly he wasn't because he kept contacting me.  I then asked how I could get my product. They wanted me to send 2 pictures. One of my credit card. The second of my receipt from PayPal account showing I paid.  I asked why. They said they needed to verify I didn't steal this card. PayPal is the one who is verifying my payment not this site.  I then asked for a refund. He then started questioning why I needed a refund. This went on for another 30 mins. Ryan is still messaging me asking  why, and refusing to give me my refund. I now have to wait 30 days to receive my money back from PayPal.  DONT USE THIS SITE."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Leigh Waring",
          "Nb_Reviews": 2,
          "Date": "2020-07-30T14:59:43.000Z",
          "Titre": "Tricksters",
          "Contenu": "Say they can beat someone elses price to get you to review then they cant 😂"
        },
        {
          "Note": 1,
          "Lieu": "AT",
          "Pseudo": "Stefan Rothe",
          "Nb_Reviews": 2,
          "Date": "2020-10-01T22:57:10.000Z",
          "Titre": "got it exactly 1h and 58 minutes after…",
          "Contenu": "got it exactly 1h and 58 minutes after the order. fuk the 10 mins they advert -.-"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-03T09:51:48.000Z",
          "Titre": "Didnt got the order deliver until 12hs…",
          "Contenu": "I got my order delivered 12 hours after it was made…Worst service ever…"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Yannick",
          "Nb_Reviews": 2,
          "Date": "2022-04-07T07:48:41.000Z",
          "Titre": "Account locked after 1 day.",
          "Contenu": "Account locked after 1 day.even when trading with rare items."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "david knowles",
          "Nb_Reviews": 2,
          "Date": "2020-04-10T19:51:05.000Z",
          "Titre": "Scammed",
          "Contenu": "paid for currency3 hours of sporadic contactnever received items no response"
        },
        {
          "Note": 1,
          "Lieu": "LT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-21T05:28:04.000Z",
          "Titre": "I did not buy this",
          "Contenu": "I did not buy this, someone used my card to buy it, I want a refund"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Sumxoxo",
          "Nb_Reviews": 1,
          "Date": "2019-09-12T14:12:29.000Z",
          "Titre": "worst service ive ever had been waiting…",
          "Contenu": "worst service ive ever had been waiting over 7 hours now still not delivered"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-02T00:24:45.000Z",
          "Titre": "Got my account banned using…",
          "Contenu": "Got my account banned using Poecurrency.com"
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-07T05:56:42.000Z",
          "Titre": "My account got banned after bought…",
          "Contenu": "My account got banned after bought currency from this site."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T06:16:01.000Z",
          "Titre": "Got banned for Trading.",
          "Contenu": "Got banned for Trading.Would not do it again."
        },
        {
          "Note": 1,
          "Lieu": "RO",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-01T03:37:30.000Z",
          "Titre": "I dont buy anything from US",
          "Contenu": "I dont buy anything from US, pls give my money back"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Francis lavoie",
          "Nb_Reviews": 1,
          "Date": "2020-01-24T11:33:51.000Z",
          "Titre": "I never get the exalted a buy on your…",
          "Contenu": "I never get the exalted a buy on your site and i paid it"
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "christo smit",
          "Nb_Reviews": 2,
          "Date": "2022-06-08T22:37:00.000Z",
          "Titre": "got banned",
          "Contenu": "would not recommend as i got banned."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-12T16:06:58.000Z",
          "Titre": "Account was locked day after this…",
          "Contenu": "Account was locked day after this purchase."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-03T00:30:20.000Z",
          "Titre": "I was immediately banned after the trade"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-04T00:44:31.000Z",
          "Titre": "Bad transaction",
          "Contenu": "Bad transaction. Pain in my ass will not  be back"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-03-04T14:12:56.000Z",
          "Titre": "I got banned by buying currency from…",
          "Contenu": "I got banned by buying currency from them"
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T11:56:10.000Z",
          "Titre": "My acc got banned next day...."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Troy Young",
          "Nb_Reviews": 3,
          "Date": "2023-04-08T19:19:59.000Z",
          "Titre": "Slow delivery"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-02T22:26:25.000Z",
          "Titre": "Got banned from the game thanks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JASON ILNICKI",
          "Nb_Reviews": 3,
          "Date": "2022-04-27T23:02:56.714Z",
          "Titre": "NO DIRECTION NOT DISCREET",
          "Contenu": "MY ACCOUNT WAS BANNED"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-06T05:44:00.000Z",
          "Titre": "Ban for it",
          "Contenu": "Ban for it. Very upset."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Arthur Farmer",
          "Nb_Reviews": 2,
          "Date": "2022-04-14T17:12:07.000Z",
          "Titre": "Got banned",
          "Contenu": "Got banned, sadly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-02T02:58:06.000Z",
          "Titre": "Didn't get currency."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bonelore",
          "Nb_Reviews": 1,
          "Date": "2020-09-26T00:45:21.000Z",
          "Titre": "Shady Business Practices"
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-25T14:51:21.021Z",
          "Titre": "ban acc",
          "Contenu": "ban acc after."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2022-04-15T20:12:14.000Z",
          "Titre": "got banned gg"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Calvin",
          "Nb_Reviews": 1,
          "Date": "2022-03-30T22:30:55.000Z",
          "Titre": "I got banned."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Unhappy customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T06:46:46.000Z",
          "Titre": "12 hours to deliver",
          "Contenu": "12 hours to deliver, sold me a product they didnt currently have stock of. Gave me the run around for 12 hours saying it would only be a few at most. Wasted my time and no, They did not compensate me for any kind of inconvenience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T04:26:57.000Z",
          "Titre": "Requesting pictures of my credit card…",
          "Contenu": "Requesting pictures of my credit card was not only troublesome but freaking clearly arbitrary after they said they didn’t need it following me saying no. Figure out how to streamline your process that isn’t sketchy. Delivery of my order was good but everything until then made the process regrettable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T01:17:22.000Z",
          "Titre": "Poor customer service",
          "Contenu": "They have no sense of customer interaction, they want you to accept a trade within 10 seconds of then joining your group and sending the trade invitation. If you don't accept or show your ready they will immediately leave without warnings and you have to contact support to get someone to deliver your order again. They never read ps messages or anything."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T00:42:28.000Z",
          "Titre": "14 hour delivery time",
          "Contenu": "Sat around all night waiting for them to deliver wasn’t til next morning when I threatened to cancel my order since it said takes about 5-50 minutes that they finally decided to deliver to me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "jim wallace",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T21:18:01.000Z",
          "Titre": "It took 5 hours and repeated chat…",
          "Contenu": "It took 5 hours and repeated chat messages to complete, and I didn't even get what I ordered because they didn't want to do a large order of items"
        },
        {
          "Note": 2,
          "Lieu": "KR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T03:29:07.000Z",
          "Titre": "Slow delivery",
          "Contenu": "Other sites deliver within 5 minutes, but i had to wait 20+ minutes for your delivery and was late to my appointment."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T23:32:32.000Z",
          "Titre": "I got charged twice for an order and…",
          "Contenu": "I got charged twice for an order and your chat is not working."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Darrell cooper",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T04:10:42.000Z",
          "Titre": "Person I meet with was rude keep…",
          "Contenu": "Person I meet with was rude keep telling me to hurry up I had to put items in currency tab so I could pick up the items he didn’t won’t to give me time keep saying to hurry up he had things to do"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "RegretOrbsNeeded...",
          "Nb_Reviews": 1,
          "Date": "2022-06-21T13:28:28.000Z",
          "Titre": "Well..",
          "Contenu": "Well... Delivery was decently fast..However i ended up with my account being locked some days after (even tho i followed the instructions), not worth it even tho it's obviously seducing.P.S. Im aware not everyone will get caught, but yea, just know its certainly possible.Edit: Im aware my account is back online, after some email back and forth i got a second chance and they (GGG Support) unlocked my account."
        },
        {
          "Note": 2,
          "Lieu": "CZ",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-11T09:24:49.000Z",
          "Titre": "Fast but with a mistake",
          "Contenu": "The delivery was fast, as usual. The problem is, I was given more currency then I was supposed to. The seller didnt noticed and I also didnt know if Im getting a promo goodies, or if I was given less on my previous purchase and now Im being \"refunded\". The seller didnt want it back untill after a couple of hours. And now I have to deal with it and I already spent some of it so I cant give it all back. Yea, its a mess. Please, sellers, be more carefull next time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "returning customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-20T10:20:02.000Z",
          "Titre": "Took WAY too long",
          "Contenu": "Took WAY too long. Waited about 45 minutes with no update until i opened live chat and complained. Thankfully after that, the seller instantly added me in game. But my point is, if he was able to complete my order that quickly after I complained, why couldn't the order just be filled in a timely fashion (<20 mins)?"
        },
        {
          "Note": 2,
          "Lieu": "RS",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-04T21:39:44.000Z",
          "Titre": "Too much time to deliver the goods",
          "Contenu": "If You do not have a certain currency in the stash, You should not allow people to purchase it, and then wait for it for an hour. People that buy currency do not have many hours to play, that's why we buy currency for real money in the first place. Waiting for more than an hour is not a good experience."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "Cliente Héctor",
          "Nb_Reviews": 6,
          "Date": "2019-10-16T15:29:46.000Z",
          "Titre": "It is ussualy have being a Good…",
          "Contenu": "It is ussualy had been being a Good service, trusted and fast. But yersterday, 14/10/19, i had made a purcharse that doesn´t appeared in their poecurrency web, but it´s apeared on my target. I did screenshoot of the transaction from my bank acount page, and i showed it to some agent, called jon, in think, but he just could give me his apologyze, and he doesn't gived me any solution for this issue. In few words, i paid for nothing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mikel Orsborn",
          "Nb_Reviews": 5,
          "Date": "2020-09-05T22:40:54.000Z",
          "Titre": "Very disappointed",
          "Contenu": "Very disappointed. I checked with their customer service before ordering, they said they had all items. Placed order 1 minute later. Then after eventually receiving 3/4 of my order, nothing. Asked for a refund on the item that they lied about. They offered an exchange but the value was nowhere near the same. Demanded refund. 10 minutes later, they “found” the items they said were not available. Had to wait for a new contact in game. Should not be this complicated, why can’t they actually check inventory and be honest?"
        },
        {
          "Note": 2,
          "Lieu": "PL",
          "Pseudo": "Maciej Bis",
          "Nb_Reviews": 1,
          "Date": "2019-12-23T20:19:18.000Z",
          "Titre": "\"Great Care for Customers\"",
          "Contenu": "Today morning i order 1 item from web. Was waiting about 30min and no one came. I contact with support,Christi i thing and was informed that item is ready for me, i get an email that item is ready and waiting for me in game ,and i should back to game and wait. Was waiting 5-10min ,again no one came. Had to go work. When i back after work,again no one contact me in game, so i back too support. This time another person Cindy informed me that price of item i have order is CHANGE for bigger, and they can't give me item because price change!!!In morning item was avaible but on evening not cause price change.Still have email from morning that item is ready and please stay in game and wait. \"Great care for customers\"!!Now i waiting for my money back. I order few times from this web and other orders have no problems cause was finished up to 20min."
        },
        {
          "Note": 2,
          "Lieu": "SI",
          "Pseudo": "costumer",
          "Nb_Reviews": 1,
          "Date": "2022-12-26T19:15:27.000Z",
          "Titre": "it took too long to get the order"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Troy Alan Holloway",
          "Nb_Reviews": 1,
          "Date": "2020-04-10T11:45:08.000Z",
          "Titre": "Took over 12 hours to get my order",
          "Contenu": "Took over 12 hours to get my order, suppliers seem to not want to answer the customer service"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-18T16:22:59.000Z",
          "Titre": "Took over an hour to receive my exalt",
          "Contenu": "Took over an hour to receive my exalt. Most places take 5-10 minutes."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-04T21:56:10.000Z",
          "Titre": "wrong amount",
          "Contenu": "The guy gave me the wrong amount then later asked for it back"
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-08T06:18:52.000Z",
          "Titre": "I had to wait more than an hour to get…",
          "Contenu": "I had to wait more than an hour to get 16 exalt and 100 orb"
        },
        {
          "Note": 2,
          "Lieu": "CZ",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-16T18:42:01.000Z",
          "Titre": "Got banned day after i bought orb of…",
          "Contenu": "Got banned day after i bought orb of regrets"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-06-23T15:30:34.000Z",
          "Titre": "Took a very long time and lack of…",
          "Contenu": "Took a very long time and lack of communication"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "drewbie12",
          "Nb_Reviews": 3,
          "Date": "2022-02-13T05:30:41.000Z",
          "Titre": "slower than i would have liked"
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-26T19:25:32.000Z",
          "Titre": "Delivery after more than an hour"
        },
        {
          "Note": 2,
          "Lieu": "VE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-03T20:57:03.000Z",
          "Titre": "1hr 30min to order succeded"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "kevinranders",
          "Nb_Reviews": 4,
          "Date": "2023-12-18T05:00:56.000Z",
          "Titre": "Took a lot longer to receive order than…",
          "Contenu": "Took a lot longer to receive order than competitors.  Did not have low level currency readily available like competitors."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T22:29:15.000Z",
          "Titre": "Good prices",
          "Contenu": "Good prices, but intransparent for the waiting time. Especially the fact that most orders will be split and the items given in batches that can take hours to completely fullfill"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "fire77",
          "Nb_Reviews": 2,
          "Date": "2022-11-29T09:18:47.000Z",
          "Titre": "delivery was rude.",
          "Contenu": "delivery was rude.the guy did mega speed transfer.i asked how he did it.he cancelled trade widow and ask me i wanted it or not."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sir Jeff",
          "Nb_Reviews": 2,
          "Date": "2023-01-02T22:51:28.000Z",
          "Titre": "The added security steps to honest…",
          "Contenu": "The added security steps to honest customers are suspicious at the beginning.  I was apprehensive to added questions.  It \"felt\" like I was being set-up for something."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "philip Richard",
          "Nb_Reviews": 3,
          "Date": "2023-08-23T00:47:53.000Z",
          "Titre": "The service was way faster before",
          "Contenu": "The service was way faster before, now it’s getting slower and the live chat doesn’t provide me eta…"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Draya",
          "Nb_Reviews": 2,
          "Date": "2023-07-03T13:10:56.000Z",
          "Titre": "The bans are automatic and quick...",
          "Contenu": "I was kicked offline and banned within 5 minutes of completing this trade. The same thing happened a year ago to another account. I'm not sure if it's the seller's account getting banned and traced to me but I followed PoECurrency's instructions perfectly. I ordered a rather small amount of currency too so it wasn't like I was buying mirrors. Support doesn't do anything in this case other than tell you to appeal, for which there's obviously no valid excuse you can provide the game company. Save your money as you will not get it back. I'd give this a 1 out of 5, except I purchased knowing the inherent risk.Edit:Editing this due to what has happened after posting my initial review. POECurrency has gone as far as to ask for my account information so that they can submit an appeal on my behalf (like I somehow can't do that myself). The last thing I want is an appeal done in broken English. I have already appealed and it was denied - which is fair enough, I know I broke the rules. They have edited their response to this review to a completely new message claiming that this has never happened before. Several other reviewers would tend to disagree with that. Additionally, it happened to me more than a year ago the first time so there's been two bans already just with one customer. They have emailed me a few times pushing me towards their live chat and have even gone as far as to send me a text message about this review, it's very pushy!There's one line in the vendor's reply that really caused me to want to edit this instead of leaving it alone. \"We dont know whether you have break other game rules or not\". I'm sorry, but no... other than the trades done with this company the account hasn't even sent a single chat message since its creation a few months ago. The ban was under 5 minutes from them trading me 200 divines in exchange for a few rares that I even chaos/exalted in advance.Overall, I know it's hard for Poecurrency to circumvent auto bans. I did my best to avoid it by getting the account above level 90 but I guess simply being above 25 and trading rares no longer cuts it for safety. I'd be fine saying \"whatever\" but this company is going out of their way to play victim and I just find that irritating. I wish I could respond to their \"reply\" without needing to edit the base review but that's how this site works."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Anton",
          "Nb_Reviews": 2,
          "Date": "2022-11-18T07:11:11.000Z",
          "Titre": "Delivery is fast, but...",
          "Contenu": "Delivery is fast, but delivery guy rushed/pushed me to much, it's impossible to empty stash as fast as he/she wants to"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Depression Repression",
          "Nb_Reviews": 1,
          "Date": "2021-07-30T08:28:54.000Z",
          "Titre": "Customer service could use some work",
          "Contenu": "Customer service could use some work. After asking for an eta on delivery, I was asked to send a picture of the paypal transaction, and my credit card. After refusing the latter, they stopped responding to me. After opening a case on paypal, the issue was resolved, and my order was filled. The delivery however took a little over an hour..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-31T23:37:41.000Z",
          "Titre": "Great service, so-so delivery",
          "Contenu": "So, customer service was very helpful with getting delivery going right away which was great. When I recieved my delivery the person delivering it did not have the whole amount ordered. They offered some other things to make it up but did not come up to what I ordered in total. Felt kind of shorted."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Your name",
          "Nb_Reviews": 2,
          "Date": "2022-08-21T00:04:02.000Z",
          "Titre": "They took awhile but I did have a large…",
          "Contenu": "They took awhile but I did have a large order and messed up so it was kinda my fault but not much communication still is nice and will probably use again"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2021-06-28T06:33:14.000Z",
          "Titre": "Not Happy",
          "Contenu": "They fulfilled the order but only after a lot of headache involved. 1) If your going to sell digital currency by the hundreds you should know how much you have in stock. I don't blame the suppliers but the merchant for not knowing what they have. 2) If you need to verify and ask for a receipt and it get provided to you by picture why do you still ask for a form of ID?  3) You shouldn't give people such a short expectancy time if you can't fulfill it on time. That transaction and chat and going through my phone for a snapshot, sending it to the computer, altering image to withhold sensitive info from picture, and finally getting the order took over 2 and a half hours."
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "Lucas “snnpTV” Medeiros",
          "Nb_Reviews": 1,
          "Date": "2020-09-21T22:11:50.000Z",
          "Titre": "didnt receibed the order and live chat…",
          "Contenu": "didnt receibed the order and live chat dont work, disputed on paypal.edit:received afterwards, but took so long. perhaps you guuys need to be more faster on delivering, and not show on your site that you delivery in 15 minutes.thanks"
        },
        {
          "Note": 3,
          "Lieu": "HK",
          "Pseudo": "ChunLung Tsang",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T18:10:51.000Z",
          "Titre": "Long processing time but good agent",
          "Contenu": "The processing time was too long which I nearly wait for 2 hours. However, the support agent actually deserve at least four start, who is patient and polite."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T05:48:49.000Z",
          "Titre": "They could not fill my order so they…",
          "Contenu": "They could not fill my order so they just paid it in Exalt, but now I am stuck doing a ton of trading on POE's trade site. Oh well it's been interesting."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Lawrence Yum",
          "Nb_Reviews": 1,
          "Date": "2021-11-06T14:09:16.000Z",
          "Titre": "I received my items eventually",
          "Contenu": "I received my items eventually. I didn't expect it to take an hour though as their information and review state that it usually takes about 15 minutes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Justin Johnson",
          "Nb_Reviews": 1,
          "Date": "2020-04-10T21:13:25.000Z",
          "Titre": "first time went well got my items…",
          "Contenu": "first time went well got my items within 30minutes second time not so much waited all day and nothing couldn't even get a reply from them"
        },
        {
          "Note": 3,
          "Lieu": "NO",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-05T10:52:39.000Z",
          "Titre": "Everything was purely ok",
          "Contenu": "Everything was purely ok, from the payment to the delivery. Nothing spectacular about it but also nothing noteworthy bad."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-18T02:23:01.000Z",
          "Titre": "Took longer than it said it would",
          "Contenu": "Took longer than it said it would. Other than that i did get what i wanted. After a live chat or 3"
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Nathan Lewis",
          "Nb_Reviews": 1,
          "Date": "2021-07-28T07:43:19.000Z",
          "Titre": "There was a little wait but awesome customer service!",
          "Contenu": "There was a little wait, due to league start but amazing Live Chat staff that are always willing to help!"
        },
        {
          "Note": 3,
          "Lieu": "GR",
          "Pseudo": "Andreas Loukakhs",
          "Nb_Reviews": 3,
          "Date": "2021-12-15T02:42:24.000Z",
          "Titre": "i waited more than 1hour and 30 minutes…",
          "Contenu": "i waited more than 1hour and 30 minutes but all and all good trading experience"
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "SK",
          "Nb_Reviews": 3,
          "Date": "2021-08-04T16:19:55.000Z",
          "Titre": "I waited about 3 hours for my order",
          "Contenu": "I waited about 3 hours for my order, but i received my currency at the end."
        },
        {
          "Note": 3,
          "Lieu": "SE",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-07-06T00:18:22.000Z",
          "Titre": "have to give rare item 2 so dont make…",
          "Contenu": "have to give rare item 2 so dont make sens"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Goodwin",
          "Nb_Reviews": 2,
          "Date": "2021-10-25T13:00:31.000Z",
          "Titre": "Got what I ordered but took many hours…",
          "Contenu": "Got what I ordered but took many hours to complete."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-10-28T16:48:53.000Z",
          "Titre": "2 hours to recieve goods is too long to…",
          "Contenu": "2 hours to recieve goods is too long to wait."
        },
        {
          "Note": 3,
          "Lieu": "SK",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T17:30:49.000Z",
          "Titre": "Takes too long"
        },
        {
          "Note": 3,
          "Lieu": "DK",
          "Pseudo": "Dennis Jørgensen",
          "Nb_Reviews": 5,
          "Date": "2021-05-06T08:30:11.000Z",
          "Titre": "took to long to get my currency's"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-12T23:23:30.000Z",
          "Titre": "good service a lil slow"
        },
        {
          "Note": 4,
          "Lieu": "RO",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T17:09:18.000Z",
          "Titre": "Delivered the goods in reasonable time.",
          "Contenu": "Delivered the goods in reasonable time.Expected the delivery of ingame currency in about 1-2 hours but got them in 30 minutes Despite the site looking fishy, they are well organized with live customer support chats and good follow-up on orders.So things were ok on my first purchase, despite being hesitant at first."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "HmmmmSure",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T21:53:54.000Z",
          "Titre": "In spite of time taken, still good.",
          "Contenu": "Things took a while this time which is unusual, but it was still a good experience nonetheless. Got helped by someone named Valerie, who was very helpful in speeding things up.I am very happy with the service overall."
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "AnJi",
          "Nb_Reviews": 6,
          "Date": "2023-12-19T10:39:51.000Z",
          "Titre": "ordered some games for my nephew",
          "Contenu": "ordered some games for my nephew. And fortunately he will get it on the NY Eve! Like it!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dragonmanb",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:28:30.000Z",
          "Titre": "I like that fact i did not get scammed.",
          "Contenu": "I like that fact i did not get scammed. It did take a bit for me to get my currency"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T03:47:46.000Z",
          "Titre": "was a bit stressful trying to figure…",
          "Contenu": "was a bit stressful trying to figure out what to do being my first time trying this but it was successful in the end"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Hendry",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T16:25:17.000Z",
          "Titre": "Easy to deal with",
          "Contenu": "Trustworthy and easy to deal with, the reason i give 4 stars because they only trade half of my order and didn’t let me know whats happen to another half. I had to contact them through live chat to find out whats going on and had to wait again to finish the trade."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Kuma jin",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T11:44:41.000Z",
          "Titre": "good",
          "Contenu": "Needed to ask for the invite again but then it worked fine"
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "IYUJI",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T21:02:40.000Z",
          "Titre": "I got my chaos orbs as promise but the…",
          "Contenu": "I got my chaos orbs as promise but the guys who gave me the item in game was a bit rude w me, saving it was a waste of time just cause my inventory was a bit full and a couldn't get everything at once.The support guys was nice :)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas Bell",
          "Nb_Reviews": 5,
          "Date": "2023-02-01T18:11:04.000Z",
          "Titre": "The service has been great since I…",
          "Contenu": "The service has been great since I started using it, up until last week. They have changed something in operations. I used to get all my purchase in by one person. Now,all the sudden someone will show up, give you half or less of your purchase, vanish, and then later on someone else will join to finish. No warnings, no messages. Kinda feels disrespecting to consumers. Even a message saying that's how it goes now, would be sufficient for me to raise back to 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T08:38:37.000Z",
          "Titre": "The delivery guy seemed like they were…",
          "Contenu": "The delivery guy seemed like they were in a hurry and didn't reply to anything I said to him. Honestly I don't really care but someone else might. Otherwise it only took like 15 min from cart to my inventory."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Toni",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T17:18:33.000Z",
          "Titre": "Safer Trading",
          "Contenu": "I would like to have it so the player giving the Currency whispers like a normal trade item so its i bit more like a real trade"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T20:39:07.000Z",
          "Titre": "Overall it was pretty great",
          "Contenu": "Overall it was pretty great, although it did take 30min - an hour to get what I ordered. When I did get the invite they were fast and efficient and the encounter was over in mere minutes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T03:08:43.000Z",
          "Titre": "They're trustworthy and quick",
          "Contenu": "They're trustworthy and quick, but slightly more expensive and slow than alternatives. That being said, they also have wider variety and a very easy to use site. Lin was great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nihilistanimal",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T13:10:38.000Z",
          "Titre": "Took longer than promised, but everything worked out.",
          "Contenu": "Took longer than promised, but Valerie was very helpful with getting the issue resolved.  Managed to get everything I paid for.  Will definitely use this service again."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T23:24:43.000Z",
          "Titre": "Good customer service",
          "Contenu": "Good customer service, quick replies. However delivery service was a little slow. Took more than 25minutes"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Fourney",
          "Nb_Reviews": 2,
          "Date": "2023-04-14T03:57:33.000Z",
          "Titre": "Still haven’t received recent order I’m…",
          "Contenu": "Still haven’t received recent order I’m not going to work tired again so possibly on day three"
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Leonardo Maschio",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T19:24:43.000Z",
          "Titre": "I'm really happy with the delivery",
          "Contenu": "I'm really happy with the delivery. My only complaint is that it took some time for the order to be delivered after i paid. Other than that, everything was fine."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sohtaj",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T21:44:12.000Z",
          "Titre": "it was great my order was deliverd in…",
          "Contenu": "it was great my order was deliverd in less than 20mins. would highly recommend."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2022-11-17T02:22:50.000Z",
          "Titre": "Fast delivery, kind of rude.",
          "Contenu": "Fast delivery, although the person was a little rude. When I said I didn't have enough room in my bag to take full delivery of 1000 currency all at once and needed them to give it to me in batches of 200 so I could then put them in storage after each transaction. I was told to \"Make room!\". Im a noob, I had items in my bag that I didn't want to vendor and for some reason they won't go into my storage. The merchant gave it to me in batches of 200 in the end though. I just felt the \"Make room!\" Comment was unnecessary."
        },
        {
          "Note": 4,
          "Lieu": "CZ",
          "Pseudo": "Břeta Rovenský",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T12:35:54.000Z",
          "Titre": "It took longer than i expected but the…",
          "Contenu": "It took longer than i expected but the live chat was great and made the delivery faster :)"
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-04-19T11:29:15.000Z",
          "Titre": "I bit late on the deliver (due to…",
          "Contenu": "I bit late on the deliver (due to multiple users) but always available to help, would use again"
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T23:55:03.000Z",
          "Titre": "Took a bit of time delivering order",
          "Contenu": "Took a bit of time delivering order - longer than expected but didnt scam."
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T20:27:31.000Z",
          "Titre": "Overall everything was good but was…",
          "Contenu": "Overall everything was good but was scared after 5 minutes of not sending me trade"
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "JMMRB",
          "Nb_Reviews": 2,
          "Date": "2023-03-19T02:50:28.000Z",
          "Titre": "Good Service",
          "Contenu": "Good Service, but a bit unnecessary to have to give ur cards info twice."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T21:12:55.000Z",
          "Titre": "Can be quite slow sometimes",
          "Contenu": "Can be quite slow sometimes. Can be slow, but they always deliver. Would like to see a larger selection of uniques."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "shaurya dhasmana",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T21:24:15.000Z",
          "Titre": "Super easy and fast",
          "Contenu": "Super easy, effective and fast, I truly loved the experience and would make business again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nari Oshigata",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T18:25:15.000Z",
          "Titre": "Admirable",
          "Contenu": "Valerie was quick to get in touch and quick to respond. she answered my questions with an admirable answer."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-04-14T13:07:10.000Z",
          "Titre": "Great customer service valerie helped…",
          "Contenu": "Great customer service valerie helped quite a bit with the order and any questions I had about it, reliable service would recommend"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "poeaddict",
          "Nb_Reviews": 1,
          "Date": "2023-01-22T00:48:52.000Z",
          "Titre": "Would buy Again",
          "Contenu": "Very busy day and still completed in reasonable time. Great customer service and live chat. Would buy again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Arad",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T05:34:39.000Z",
          "Titre": "Timing was a little difficult",
          "Contenu": "Timing was a little difficult, but overall happy with the service."
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "minchoel koh",
          "Nb_Reviews": 2,
          "Date": "2023-03-26T13:27:28.000Z",
          "Titre": "service is very good",
          "Contenu": "I used this site today. process is some difficult but i receive item safely"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Danny",
          "Nb_Reviews": 2,
          "Date": "2023-05-31T14:49:52.000Z",
          "Titre": "Easy and quick",
          "Contenu": "Easy to use and the order was fulfilled reasonably quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Girtas",
          "Nb_Reviews": 2,
          "Date": "2023-04-30T22:44:29.000Z",
          "Titre": "Only complaint is that it took 2 hours…",
          "Contenu": "Only complaint is that it took 2 hours to receive my order."
        },
        {
          "Note": 4,
          "Lieu": "VE",
          "Pseudo": "Venizar Avila",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T15:09:49.000Z",
          "Titre": "Fast services"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-10T15:09:57.000Z",
          "Titre": "fairly fast service",
          "Contenu": "fairly fast service. issues when i yried using a visa gift card."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "noboddy",
          "Nb_Reviews": 2,
          "Date": "2023-11-05T21:00:04.000Z",
          "Titre": "Very Fast!",
          "Contenu": "Fast delivery, thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas Bell",
          "Nb_Reviews": 5,
          "Date": "2022-10-10T12:14:50.000Z",
          "Titre": "Always spot on for fulfillment",
          "Contenu": "Always spot on for order fulfillment. Been using for a few months. Only thing I've noticed is that it takes a little longer to receive, but that could be from popularity. Will keep using."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Zeefro",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T04:41:45.000Z",
          "Titre": "It was really fast and accurate",
          "Contenu": "It was really fast and accurate. The helpdesk was really helpfull and gentle."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Zac",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T18:44:19.000Z",
          "Titre": "Great Service",
          "Contenu": "Great Service, Helpful staff and fast trade!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Papa",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T14:30:20.000Z",
          "Titre": "Didn’t get banned lol",
          "Contenu": "Been working out of town for entire league so far so decided to give this a go and it went great really fast trade and no issues"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T00:22:56.000Z",
          "Titre": "Pretty solid",
          "Contenu": "Pretty solid, I think I used you guys in Metamorph as the last league I played. Wait time between finishing the order and getting the trade in game was a bit longer than I was expecting compared to the last time I used an RMT site (which I think was you guys). Regardless it was not onerously long so 4stars. The transaction on the website was as easy as one expects in 2022. Lots of payment options. UI is solid on the site and prices are reasonable."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Eldrich",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T19:58:48.000Z",
          "Titre": "Cheap and accurate but somewhat slow.",
          "Contenu": "Cheap and accurate but somewhat slow.I purchased about 4 inventories full of things, and it was much cheaper than expected. I received exactly what I ordered with no issues.However, it did take 1:40 from when the order was placed until it was completed. As I said, that's not a terrible amount of time, but it was a bit of a wait."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Xbox",
          "Nb_Reviews": 3,
          "Date": "2022-01-11T12:24:42.000Z",
          "Titre": "Great service / needs to update customer",
          "Contenu": "The customer service was very helpful, and all the items I ordered were delivered. The only thing holding back for a 5 star is communication. It would be nice to get an update that the order is getting prepared and have a time frame for completion. If the order is going to go past the time frame another update would be nice. My order took around 1hr 15min after some confusion was cleared up. I would use again."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-28T23:22:58.000Z",
          "Titre": "Did not have what I ordered",
          "Contenu": "Did not have what I ordered. So asked if I could change to other currency. Little bit annoying but I accepted it. Over all communication was good and quick. The person delivering did muck around for a bit before getting my order. Not as smooth as previous purchase. But overall I'm reasonably happy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-20T23:41:31.000Z",
          "Titre": "Easy and relatively fast",
          "Contenu": "Easy and relatively fast (10-40 minutes) depending on size of order. Would be nice if they messaged your gamer tag with an ETA. Currently they only message you when they are ready so it can be unexpected and abrupt. Just expect a delay if you are ordering large quantities."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Howard",
          "Nb_Reviews": 1,
          "Date": "2021-07-31T15:59:07.000Z",
          "Titre": "Legit & fair.",
          "Contenu": "I've heard stories about them, but my personal experience has always been positive. They always deliver what they promise & delivery for me has never been more then 1hr. I've used them a Few times for PoE stuff.I'm not pro, so I can't say if their prices are fair or not....but I've never seen a reason to complain."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Drew",
          "Nb_Reviews": 2,
          "Date": "2023-04-14T22:57:30.000Z",
          "Titre": "fast customer service but slow getting…",
          "Contenu": "fast customer service but slow getting items overall good experience"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "First Time Customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-12T18:00:47.000Z",
          "Titre": "It was a bid irritating as a first time…",
          "Contenu": "It was a bid irritating as a first time customer since I didn't knew that I would get invited by a random person but everything else was flawless. So 4/5 Stars. 5 stars would be if the person said something about the purchase so I would know who invites me or the reason."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Michael",
          "Nb_Reviews": 3,
          "Date": "2022-09-24T10:31:15.000Z",
          "Titre": "Good",
          "Contenu": "I thought i couldnt have my item because there was a payment problem. But it all went ok in the hour. Quick Delivery then."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Toxic But Not",
          "Nb_Reviews": 1,
          "Date": "2020-04-28T08:53:38.000Z",
          "Titre": "Customer service was friendly but the…",
          "Contenu": "Customer service was friendly but the website had said that delivery would be any time from 5 minutes to two hours which I was prepared for but it ended up taking closer to 5 hours in which I had to get off the game and receive my items at a later date. All in all a good experience though, I received everything I was supposed to."
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Mr.Exalts",
          "Nb_Reviews": 1,
          "Date": "2021-11-26T00:39:09.000Z",
          "Titre": "Got my items",
          "Contenu": "Got my items, but it took me over an hour which is why it gets 4* and not 5*. When it started get close to an hour i started to think that i got scammed, but in the end it all turned out okay and everything was traded to me properly! :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ett_Slag",
          "Nb_Reviews": 1,
          "Date": "2021-08-14T13:51:19.000Z",
          "Titre": "I’ve always used poe currency because…",
          "Contenu": "I’ve always used poe currency because it was fast and efficient. Since Covid it’s been a bit slower, and for big orders it can take too long. Personally it’s amazing and I’d recommend it 9/10. They don’t steal your money, you always get what you buy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-04-18T01:28:22.000Z",
          "Titre": "Live chat was very quick and helpful…",
          "Contenu": "Live chat was very quick and helpful with Jason."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yan Zabar",
          "Nb_Reviews": 1,
          "Date": "2021-08-04T02:28:58.000Z",
          "Titre": "Took 4hours longer than originally cus…",
          "Contenu": "Took 4hours longer than originally cus there was a communication error between the person I was talking to and the actual person meeting me in game, but other than that I’d definitely use them in the future(most probably am next week)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "No public name given",
          "Nb_Reviews": 1,
          "Date": "2021-10-31T00:18:40.000Z",
          "Titre": "THIS, order was smooth",
          "Contenu": "This order was smooth. A few days prior ordering currency for my son was not so smooth, it took over 2 hours for the prior order.Which to me is unacceptable and was not offered any convenience condolences or anything, even an apology.juat an excuse as to how busy you guys were, to make up for the 2 hour wait. In the mean time my son's $600 order was received by an un-named competitor in less than 3 minutes.with the I may try a few more orders in the future, hopefully things remain smooth.Side note, card/order verification process was perfect, and very timely. (Many other companies are lackluster and take a very long time in this regard.Consider this a fair/good reviewThanks guys."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-02-25T05:17:52.000Z",
          "Titre": "They deliver",
          "Contenu": "The order took s little while longer than expected and the delivery guy was a bit short but all in all they delivered as promised and I've used the service multiple times and would use again"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "fourtynine",
          "Nb_Reviews": 1,
          "Date": "2021-06-17T20:00:35.000Z",
          "Titre": "My First time ordering.",
          "Contenu": "My First time ordering.Had to go through support as i made the mistake of ordering for the wrong league. Lucifer (Yes) was a big help. Quick response time. I decided to order something different. So far, Thumbs up."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-20T11:53:11.000Z",
          "Titre": "Service took longer than I anticipated.",
          "Contenu": "The service went well,I waited ~45 minutes and then I got all that I ordered.To improve the service it would be good to get an estimate as to how long it will take to finish the transaction."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tyler",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T05:33:40.000Z",
          "Titre": "Quick and easy to talk to dex did a…",
          "Contenu": "Quick and easy to talk to dex did a great job informing me of my order time of delivery and any questions i had quickly"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Naquito",
          "Nb_Reviews": 3,
          "Date": "2021-07-17T00:31:01.000Z",
          "Titre": "There was problems with the transaction…",
          "Contenu": "There was problems with the transaction And it got delayed because the trade middle man didnt have all the currency and the account got blocked,  needed to wait for another account to receive the full trade"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bailey Criswell",
          "Nb_Reviews": 3,
          "Date": "2022-09-27T03:16:28.000Z",
          "Titre": "Decent",
          "Contenu": "Took a little longer than expected, but once we got started everything was received quick and easy"
        },
        {
          "Note": 4,
          "Lieu": "CZ",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-11-09T02:00:21.000Z",
          "Titre": "The service was great",
          "Contenu": "The service was great. I got what I paid for, no shenanigans. I even got a call from nice lady to inform me that my stuff was ready for a pickup (If you're that nice lady and remember a dude being at work, send me a message in PoE ^^).The only thing that wasn't to my liking is the delivery time, which was around 24 hours, slightly less actually. But that's me being a douche, overall a great service that I highly recommend to those of us who don't have the time to farm all day because we have a work and such. If you just want to get the top tier gear for cash then you're a weiner and don't do that! :DIf I may give a suggestion, allow the customers to choose the approximate time of delivery because it just happens that we aren't at PC and have to wait a bit more."
        },
        {
          "Note": 4,
          "Lieu": "UA",
          "Pseudo": "chester chester",
          "Nb_Reviews": 2,
          "Date": "2022-09-22T18:29:01.000Z",
          "Titre": "Weird that the ask for recipe of…",
          "Contenu": "Weird that the ask for recipe of payment after the transaction but overall everything went smooth."
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-07-16T18:19:21.000Z",
          "Titre": "not too fast",
          "Contenu": "not too fast, I got my items in about 17 minutes."
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "tehchinetic",
          "Nb_Reviews": 3,
          "Date": "2021-11-01T11:59:20.000Z",
          "Titre": "Fast delivery",
          "Contenu": "Fast delivery, did 2 Purchases first was a bit wonky because there seemed to have been a cofusion about who gets what when several ppl joined.But the second one was very fast."
        },
        {
          "Note": 4,
          "Lieu": "NA",
          "Pseudo": "Scorch",
          "Nb_Reviews": 3,
          "Date": "2021-11-05T05:35:58.000Z",
          "Titre": "Great Service & Satisfied Customer",
          "Contenu": "The service was more then pleasant and was handled fast and smoothly.Just wish I when whispered to it would have been more clear that it was concerning the transaction."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Samuel Howard",
          "Nb_Reviews": 1,
          "Date": "2020-06-20T17:23:02.000Z",
          "Titre": "They made a mistake and forgot one of…",
          "Contenu": "They made a mistake and forgot one of the items I had purchased, but after just a couple minutes talking with their support they corrected the issue, 4 stars for the amazing customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-06-21T05:44:16.000Z",
          "Titre": "Took about 40 minutes instead < 10…",
          "Contenu": "Took about 40 minutes instead < 10 minutes, but live chat agent said they were experiencing high volume and everything went smoothly, just a bit longer than I expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matt Hall",
          "Nb_Reviews": 2,
          "Date": "2020-04-10T17:47:51.000Z",
          "Titre": "Use your receipt if it doensnt show up, Service is good.",
          "Contenu": "Had initial slow-down waiting on a response. They did finally respond and told me to wait in game- it arrived within 5 minutes after that. The process took almost an hour. This was my first order and I ordered while creating an account, so the order did not show up in my account. But I have an email receipt from Pay Pal to show the customer service. Providing receipt of payment and keeping in communication, they did fulfill the order! Thanks for the fast service. Some of these services are in different countries so Pay Pal, Google Pay, or your bank may slow down the process. This company has no control over how fast the payment verification goes. But they do have control over communicating with the customer. I gave them a chance, and it worked out well. Thanks POEcurrency."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-30T16:43:01.000Z",
          "Titre": "Order executed and delivered with no…",
          "Contenu": "Order executed and delivered with no fuss. I have ordered twice now, first order was delivered right away, second one took over 20 mins, but would definitely use again."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "estheraz",
          "Nb_Reviews": 1,
          "Date": "2022-06-18T21:02:44.000Z",
          "Titre": "a little bit long but at the end it's…",
          "Contenu": "a little bit long but at the end it's ok.The man( oe woman ? ) on the chat was efficiency 5 stars for the chatmanbb"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lanny",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T02:51:52.000Z",
          "Titre": "Good but a bit slow",
          "Contenu": "Great customer service, got all items I wanted. Delivery was a bit delayed took almost 24hrs to get my order"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-12-03T02:59:17.000Z",
          "Titre": "Took a while to get my order but not…",
          "Contenu": "Took a while to get my order but not terrible."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-21T04:07:04.000Z",
          "Titre": "It took a little longer than I wanted I…",
          "Contenu": "It took a little longer than I wanted I had to ask them with there li e chat. Other than that, I will be doing business with them again."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Matias Ytterland",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T09:20:26.000Z",
          "Titre": "Delivery not instant",
          "Contenu": "Delivery not instant, but relatively quick 👍"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ben .Croft",
          "Nb_Reviews": 6,
          "Date": "2021-08-05T20:28:23.000Z",
          "Titre": "Longer Wait on Larger Order But Support Was Great",
          "Contenu": "Did have to wait a little longer on the order because of the size of it, but the support team were great and was able to get my order to me (NOT A SCAM)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "EDLL",
          "Nb_Reviews": 1,
          "Date": "2022-03-10T22:37:53.000Z",
          "Titre": "They did what they promised and more",
          "Contenu": "They did what they promised and more. Patient and professional. Live Chat worked and assisted me.Will use again and make referrals."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Duddette Caster",
          "Nb_Reviews": 1,
          "Date": "2019-10-18T15:07:28.000Z",
          "Titre": "Good",
          "Contenu": "Good, but slow. Had me worried at first but the customer support was nice enough to help me out. granted my name was a little weird for them the spell I'm sure."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Krustee_Ånus",
          "Nb_Reviews": 1,
          "Date": "2021-11-09T12:32:38.000Z",
          "Titre": "Thank you for being prompt and…",
          "Contenu": "Thank you for being prompt and professional in your communications. Processing took longer than expected, but I am pleased with the service."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Thomas",
          "Nb_Reviews": 5,
          "Date": "2023-02-25T15:50:20.000Z",
          "Titre": "good",
          "Contenu": "good, could be quicker"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-19T11:40:25.000Z",
          "Titre": "excellent service",
          "Contenu": "excellent service, took about 30m for delivery. Service member were professional and patient. Will definitely use it again in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-08-02T23:18:14.000Z",
          "Titre": "Very obscure and hard to tell what time…",
          "Contenu": "Very obscure and hard to tell what time frame there is for delivery, Only one mentioned was 15minutes average but mine was over an hour."
        },
        {
          "Note": 4,
          "Lieu": "RO",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-26T12:06:39.000Z",
          "Titre": "Service on point but a bit late.",
          "Contenu": "Service on point but a bit late.. got my order delivered after 1 hour and a half but the support was there and pretty nice guys"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Keen Bronson",
          "Nb_Reviews": 2,
          "Date": "2021-06-18T23:56:55.000Z",
          "Titre": "Id use this service again.",
          "Contenu": "Slow but i recieve my order (about 3 hours) but when i asked for help they responded quickly and sorted it. Very polite about it also."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2021-07-31T10:57:20.000Z",
          "Titre": "The customer service is nice",
          "Contenu": "The customer service is nice, and the time of reciept is usually pretty good, however my last order took quite a while to get sorted"
        },
        {
          "Note": 4,
          "Lieu": "EE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T19:53:02.000Z",
          "Titre": "Amazing delivery time",
          "Contenu": "Amazing delivery time, quality of service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sooner",
          "Nb_Reviews": 2,
          "Date": "2019-08-26T14:02:39.000Z",
          "Titre": "On my third purchase",
          "Contenu": "Made 3 purchases now. Only one was longer than a day but that was because the items were super rare. Great website and great trustworthy people!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chester",
          "Nb_Reviews": 3,
          "Date": "2021-11-21T13:10:59.000Z",
          "Titre": "Excellent service in what turned out to…",
          "Contenu": "Excellent service in what turned out to be a peak rush period. Little longer than anticipated be they kept me informed."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-20T11:55:46.000Z",
          "Titre": "The seller come to the game  and gave…",
          "Contenu": "The seller come to the game  and gave me my order very simple way the service  is good thank you have a nice day"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Carnifexau Carnifexau",
          "Nb_Reviews": 1,
          "Date": "2021-06-24T04:05:23.000Z",
          "Titre": "paid for purchase and reiceved email…",
          "Contenu": "paid for purchase and reiceved email saying to pay. got on to support and they verified and fixed it asap. good service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-13T00:12:31.000Z",
          "Titre": "Was quick",
          "Contenu": "Was quick. Little confusion on network I.D.'S but once we figured it out was quick and smooth. Will use again."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T01:00:54.000Z",
          "Titre": "Fast service great customer service"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "plotinaf",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T03:04:02.000Z",
          "Titre": "Good",
          "Contenu": "Good service i receiveid my currency"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-26T12:49:08.000Z",
          "Titre": "Took a while before they got in touch",
          "Contenu": "Took a while before they got in touch, but everything otherwise was smooth and great."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-02T09:07:32.000Z",
          "Titre": "Its very nice",
          "Contenu": "Its very nice. Prices are fair. Would have been a 5 star if i didnt have to wait so long."
        },
        {
          "Note": 4,
          "Lieu": "VN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T03:37:58.000Z",
          "Titre": "Good",
          "Contenu": "Good service but a little bit slow"
        },
        {
          "Note": 4,
          "Lieu": "EE",
          "Pseudo": "Organi Doonor",
          "Nb_Reviews": 3,
          "Date": "2021-06-19T09:31:53.000Z",
          "Titre": "bought currency twice",
          "Contenu": "bought currency twice, one of the times i had to wait for 15 mins, customer service was quick and helpful"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Thanabodin Sornsadang",
          "Nb_Reviews": 9,
          "Date": "2023-07-24T07:55:59.000Z",
          "Titre": "5/5 Good customer service",
          "Contenu": "5/5 Good customer service. 4/5 Fast Delivery."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-26T18:07:21.000Z",
          "Titre": "I got everything I asked for",
          "Contenu": "They got on added me as friend then as soon as they had my order ready they contacted me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Phat",
          "Nb_Reviews": 2,
          "Date": "2021-08-31T16:45:58.000Z",
          "Titre": "good service",
          "Contenu": "good service, delivered total orders in around 30 mins, contracted me 5 mins after order confirmed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tyler",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T09:42:17.000Z",
          "Titre": "Lucas is great!",
          "Contenu": "Lucas was very responsive and friendly. He quickly resolved my questions and offered an alternative solution that would be quicker for my current situation. Thank you again."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T18:39:05.000Z",
          "Titre": "Positive experience",
          "Contenu": "Delivered in a really good time (~30mn)! Special thanks to Jeffery at the Live Chat support for his really quick responds and for taking care about my working schedules. He have transmited my demands to the deliver directly, i really appreciate it! Currencies price way better than other popular website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zac Creeager",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:38:48.000Z",
          "Titre": "Trusted Service for those that have Little Time",
          "Contenu": "Services like these are great for individuals like myself. Work full time, but still want to progress through the games. Ive used this service many times, and they have always been quick. Mostly within the hour. Only once Ive had to wait longer than 3 hours. Keep up the awesome!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Butch Peddlin",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:38:13.000Z",
          "Titre": "Great service and great person!",
          "Contenu": "Sake is a friendly, personable and professional service provider! I enjoyed our brief chat! Wish you the best!-Joey K. from the USA"
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Nicklas Birkholm",
          "Nb_Reviews": 19,
          "Date": "2023-12-18T20:56:08.000Z",
          "Titre": "Little longer delivery than prescribed",
          "Contenu": "Little longer delivery than prescribed. But customer service was good and instant and both my orders came through np"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Ronin",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T03:04:34.000Z",
          "Titre": "Great help by Levi",
          "Contenu": "Order was taking a bit longer as usual, but I've been helped greatly by Levi to get it done asap :D"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:12:26.000Z",
          "Titre": "Great website",
          "Contenu": "Great website, fast order and delivery within 1/2 hour. Overall pretty darn great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paws",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T03:15:53.000Z",
          "Titre": "Fast delivery",
          "Contenu": "Fast delivery,  faster customer service Alyssa  thank u very much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:45:54.000Z",
          "Titre": "Quick",
          "Contenu": "Quick, chat gave updates when asked. No hassle, exactly what was expected."
        },
        {
          "Note": 5,
          "Lieu": "BG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T13:21:06.000Z",
          "Titre": "Honestly",
          "Contenu": "Honestly, really fast delivery, less than 30 minutes of wait, and prices are just the best."
        },
        {
          "Note": 5,
          "Lieu": "BG",
          "Pseudo": "blink cpl",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:20:32.000Z",
          "Titre": "Good and fast answers, better for business and relationships in long term.",
          "Contenu": "A customer service like Zoe's is the best you can find, immediate and very helpful I am recommending!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T03:31:28.000Z",
          "Titre": "no need to comment more",
          "Contenu": "i just like. the customer support knows very well when i bought to many product, wanting to know if i wanted one or more product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peyton Phillips",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T06:25:50.000Z",
          "Titre": "Sake was a great help",
          "Contenu": "Sake was a great help! Kept me in a positive spirit through the whole chat."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Wyner",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T16:43:41.000Z",
          "Titre": "Lucas was great!",
          "Contenu": "Lucas was very understandable and rushed my order because I have a meeting :D"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Arndt Grass",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T12:48:45.000Z",
          "Titre": "Reliable delivery",
          "Contenu": "Reliable delivery, Lou from support helped to get my items fast!"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Anonimous",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T12:48:09.000Z",
          "Titre": "Congratulations.",
          "Contenu": "Well, it was my first purchase. I admit I was a little scared, but everything went well. They sent me a message in the game and the transaction was made. Grade 10!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Duy Thien Vu",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T11:01:09.000Z",
          "Titre": "absolutely helpful",
          "Contenu": "absolutely helpful. will purchase more in the future"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyo",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T20:38:47.000Z",
          "Titre": "Excellent and quick",
          "Contenu": "Excellent and quick. Appreciate everything and thank you. Will be ordering from again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Henderson",
          "Nb_Reviews": 5,
          "Date": "2023-12-11T09:32:36.000Z",
          "Titre": "Delivered in a good time and the…",
          "Contenu": "Delivered in a good time and the communication was good. Also gave me a little bonus for the small wait."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Kewin",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T16:46:54.000Z",
          "Titre": "Alyssa professional person always fast…",
          "Contenu": "Alyssa professional person always fast help. The best site for poe currency"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gamer",
          "Nb_Reviews": 13,
          "Date": "2023-12-13T16:50:18.000Z",
          "Titre": "Easy to order and delivery was hassle…",
          "Contenu": "Easy to order and delivery was hassle free. Will definitely use again"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Zeus",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T14:46:29.000Z",
          "Titre": "Speed Delivery and Great Prices"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "IE38149",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T03:36:32.000Z",
          "Titre": "I was attended by Levi",
          "Contenu": "I was attended by Levi, the service was super fast and reliable, I will certainly use this service again"
        },
        {
          "Note": 5,
          "Lieu": "LV",
          "Pseudo": "FearTheENd FearTheDeath",
          "Nb_Reviews": 4,
          "Date": "2023-12-18T20:08:08.000Z",
          "Titre": "all good",
          "Contenu": "all good its save mb will take get a lil to wait but everything is good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hunter O",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T02:19:39.000Z",
          "Titre": "First time order so I didn't know…",
          "Contenu": "First time order so I didn't know exactly what to expect but Lucas stuck thru it with me and we got it figured out."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Max Lev",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T09:33:40.000Z",
          "Titre": "Amazing service",
          "Contenu": "Amazing service. Zoe was especially helpful and kind with all my queries."
        },
        {
          "Note": 5,
          "Lieu": "KZ",
          "Pseudo": "Eclipse",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T13:45:56.000Z",
          "Titre": "The product arrivthanks to POEcurrencyed very quickly thanks…",
          "Contenu": "The product arrived very quickly thanks to POEcurrency.Special thanks to Helen"
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "Abdelrahman Mohamed Desoky",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T13:40:35.000Z",
          "Titre": "Good, Fast, Friendly",
          "Contenu": "Good prices, fast service, also friendly customer support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T01:01:28.000Z",
          "Titre": "Very quick turn around",
          "Contenu": "Very quick turn around, excellent service. Would buy from again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy Hill",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T04:44:34.000Z",
          "Titre": "great and fast service",
          "Contenu": "great and fast service, never had a problem"
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "qazxs qazxs",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T18:09:50.000Z",
          "Titre": "Very excellent (Especially with Mr.Ken+Mr.Helen) !",
          "Contenu": "Very excellent and honest, and Mr.Ken+Mr.Helen is Responsive and polite in dealing,Also, do not forget the reliability and speed of response .. My experience with them more than great .."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean Shoemaker",
          "Nb_Reviews": 9,
          "Date": "2023-11-12T08:09:59.000Z",
          "Titre": "Great service...",
          "Contenu": "Great service...Especially fast when not Ordering the (kitchen sink) ...ie TOO MUCH stuff at one time.I have ordered several thousands of 10 -12+ different items it take's them a bit to get it all together.. stands to reason lol. Any ways Great prices, Quick, Friendly.  Alyssa helped me this time. Everyone there I have dealt with is friendly and helpful. happy camper here ;)"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Mario Ruiz",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T04:58:45.000Z",
          "Titre": "fast as always",
          "Contenu": "fast as always. Great customer service by william"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Felipe José Bermudes Nader",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T17:04:59.000Z",
          "Titre": "Quickness",
          "Contenu": "Quick and precise."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Stuart",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T08:49:14.000Z",
          "Titre": "Receiving the goods"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean G.",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T21:44:07.000Z",
          "Titre": "Very fast easy service at a good price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:44:37.000Z",
          "Titre": "The people that helped me went !!!",
          "Contenu": "The people that helped me went above and beyond"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:00:50.000Z",
          "Titre": "quick response"
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "Hsien Hao Chen",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:24:46.000Z",
          "Titre": "Lin SUPER GOOD",
          "Contenu": "LinSUPER GOOD!"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Daniyel",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T18:28:57.000Z",
          "Titre": "Support is instant",
          "Contenu": "Support is instant , people are very kind !"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Sayadek",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T19:22:09.000Z",
          "Titre": "Good answer",
          "Contenu": "Good answer, clear and precise"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T15:49:32.000Z",
          "Titre": "First Time Buying",
          "Contenu": "First Time Buying and had a great experience would recommend to anyone"
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "Minh Tâm Lê",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T09:32:24.000Z",
          "Titre": "Fast and efficient",
          "Contenu": "Fast and efficient. No word is needed more"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Affliction league ftw",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T03:39:55.000Z",
          "Titre": "Very good and quick service",
          "Contenu": "Very good and quick service. Reliable"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Brett",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T11:09:38.000Z",
          "Titre": "Fast and secure",
          "Contenu": "I was surprised at how quick Poecurrency were able to deliver my order. I recommend them to everyone for safe and reliable goods to help your game."
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "Porkkana",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T16:24:54.000Z",
          "Titre": "Helen is actually an excellent starting…",
          "Contenu": "Helen is actually an excellent starting support here. Helped me through quite a lot of things on my orders."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T12:42:26.000Z",
          "Titre": "Quick and easy",
          "Contenu": "Quick and easy, done in under 5 minutes."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:30:06.000Z",
          "Titre": "Very good  support and fast work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T03:18:49.000Z",
          "Titre": "Quick",
          "Contenu": "Quick, Easy and legit."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Lucas Leão",
          "Nb_Reviews": 4,
          "Date": "2023-12-11T04:15:48.000Z",
          "Titre": "Great deal!",
          "Contenu": "The items were quickly delivered in-game."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zachariah P",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T09:37:49.000Z",
          "Titre": "He waited with me till i got my order",
          "Contenu": "He waited with me till i got my order! Great job!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Criswell",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T14:36:43.000Z",
          "Titre": "Zoe good helper."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Dan Tanca",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T13:31:57.000Z",
          "Titre": "all is good   Hellen is very prompt",
          "Contenu": "They are to trust and solve all very fast"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Michał P",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T21:40:23.000Z",
          "Titre": "Quick and nice service",
          "Contenu": "Quick and nice service. Thx to Valerie on Chat for guiding me through PS5-related issues."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Daniel Vorster",
          "Nb_Reviews": 11,
          "Date": "2023-10-21T11:47:42.000Z",
          "Titre": "Scott - Fantastic",
          "Contenu": "Scott assisted me with my query, was professional, helpful, and got straight to the point. Within minutes I received my order, and would 10/10 recommend to anyone."
        },
        {
          "Note": 5,
          "Lieu": "HU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T20:27:13.000Z",
          "Titre": "Best currency site.",
          "Contenu": "Fast and reliable as always."
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Yoshi",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T12:21:15.000Z",
          "Titre": "Satisfying",
          "Contenu": "Respond time and the delivery were very fast and the transaction goes smoothly"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Sascha Büchelmaier",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T21:01:51.000Z",
          "Titre": "Always a pleasure",
          "Contenu": "Flexible Traders, Always a pleasure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jimmy Neutron",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T16:49:49.000Z",
          "Titre": "Valerie was awesome and helpful."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Wesley Van Der Meer",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T21:10:11.000Z",
          "Titre": "Easy tot talk to",
          "Contenu": "Easy tot talk to, responsive"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-05T02:59:49.000Z",
          "Titre": "Fast and Clean",
          "Contenu": "I really liked the fact that I only waited 20 minutes and got my order. Probably would've been even faster If I didn't order during busy hours."
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "Thanh Pham",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T20:03:12.000Z",
          "Titre": "fast respond"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "William Winchester",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T18:01:35.000Z",
          "Titre": "Lin!!",
          "Contenu": "Great help, unfortunatly the original order I made wasn't in stock, but lin helped me very quickly and we worked something out!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T13:03:07.000Z",
          "Titre": "Very quick and super friendly service"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Oussama Medjahed",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T10:04:08.000Z",
          "Titre": "very helpful and fast"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "RandomNewPlayer",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T07:43:41.000Z",
          "Titre": "Helped by Jason",
          "Contenu": "Helped by Jason. Great person and really accomodating. Im just confirming that my order is still incomplete."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Jorge",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T09:50:33.000Z",
          "Titre": "Fast service",
          "Contenu": "Fast service  and thx to ♡ Valerie"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Tracy",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T19:57:19.000Z",
          "Titre": "These guys never cease to amaze me!!!",
          "Contenu": "These guys never cease to amaze me! Always great service and support, Scott let alone was a champ and super helpful!"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "sapo gamer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T21:07:49.000Z",
          "Titre": "Nice trader",
          "Contenu": "Fast and reliable trader"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T12:30:50.000Z",
          "Titre": "I’m happy",
          "Contenu": "A great first experience. Easy to use and navigate website. Fast and courteous service. Will use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean Shoemaker",
          "Nb_Reviews": 9,
          "Date": "2023-10-26T12:06:20.000Z",
          "Titre": "Supper FAST 10-20 min...it took me 2x…",
          "Contenu": "Supper FAST 10-20 min...it took me 2x as long to square away the stuff i got.  Delivery guy / gal was patient. I will be back if I need any more help.Thanks !!!William was the guy in chat. Polite and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T06:16:17.000Z",
          "Titre": "Quick and easy.",
          "Contenu": "Quick and easy.. very patient for first time users. Would definitely recommend"
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "nicolai havn",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T04:19:22.000Z",
          "Titre": "Zoe the helper was 12/10!"
        },
        {
          "Note": 5,
          "Lieu": "CR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T14:10:47.000Z",
          "Titre": "Good service",
          "Contenu": "Service was good!"
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T09:49:45.000Z",
          "Titre": "Fast and nice service.",
          "Contenu": "Fast and nice service.Thanks Valerie for helping me with my order."
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "qazxs qazxs",
          "Nb_Reviews": 2,
          "Date": "2023-11-19T09:22:16.000Z",
          "Titre": "Wonderful and honest service With Mr.Helen !",
          "Contenu": "Wonderful and honest service, and Mrs. Helen's treatment is more than wonderful"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T23:07:34.000Z",
          "Titre": "Fast delivery",
          "Contenu": "Placed order. Got my currency within 5 minutes. Brilliant service"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Ilhan Frtl",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:34:16.000Z",
          "Titre": "very nice and very fast he help me so…",
          "Contenu": "very nice and very fast he help me so muck tks again"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T18:16:02.000Z",
          "Titre": "Amazing and fast experience..",
          "Contenu": "Amazing and fast experience... best thing is you get a call for the product delivery at any time you wish"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "MAGIC",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T17:35:13.000Z",
          "Titre": "Zoe helps me out everytime I mess up",
          "Contenu": "Zoe helps me out everytime I mess up, and the order gets fulfilled or cancelled every time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T18:56:01.000Z",
          "Titre": "First time buying from this website.",
          "Contenu": "It was a fast, easy, and reliable experience. I’d recommend it to anyone who needs currency"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sabin Necula",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T22:45:03.000Z",
          "Titre": "Great !",
          "Contenu": "Good time, reliable ! Recomand"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "POEPlayerSometimes",
          "Nb_Reviews": 3,
          "Date": "2023-11-23T05:01:19.000Z",
          "Titre": "Good services and timely",
          "Contenu": "Good services and timely, even on holiday week."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Muu",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T03:48:36.000Z",
          "Titre": "was good and fast with my questions"
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Kağan",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T16:53:44.000Z",
          "Titre": "Customer service",
          "Contenu": "I made a mistake and customer service was great and was able to solve the problem in 3 minutes."
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "Andrew .D",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T16:48:28.000Z",
          "Titre": "Good trade",
          "Contenu": "Good trade, item received"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Martin Weinbrand",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T21:53:23.000Z",
          "Titre": "Fast and friendly.  Poe trade",
          "Contenu": "Fast and friedlich."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T04:50:59.000Z",
          "Titre": "Good :))",
          "Contenu": "Good fast and easy"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Rubin Ace",
          "Nb_Reviews": 11,
          "Date": "2023-12-12T23:28:44.000Z",
          "Titre": "happy as always good job"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Johan Larsson",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:41:52.000Z",
          "Titre": "Mike is the GOAT"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Jairo “CarrapixO”",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:00:02.000Z",
          "Titre": "Great Atendant"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Mikuriosu",
          "Nb_Reviews": 5,
          "Date": "2023-11-23T08:32:19.000Z",
          "Titre": "Very Helpful and also Very Friendly <3…",
          "Contenu": "Very Helpful and also Very Friendly <3 Very Recommended"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ashley Rowland",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T13:12:01.000Z",
          "Titre": "Service was fast",
          "Contenu": "Service was fast, friendly and chatty seller too which is always kool, would defo use again!"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "张陶然",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T00:17:40.000Z",
          "Titre": "Super nice service",
          "Contenu": "Super nice guy, fast delivery, solve my problem faaaast"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oooo “Robin Hud” oooO",
          "Nb_Reviews": 8,
          "Date": "2023-11-07T05:17:10.000Z",
          "Titre": "Zoe is awesome",
          "Contenu": "Zoe is awesome. Always so nice and helpful. Thank you for the great service."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T18:23:07.000Z",
          "Titre": "it was great and fast thx allot"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "POEPlayerSometimes",
          "Nb_Reviews": 3,
          "Date": "2023-11-15T15:45:22.000Z",
          "Titre": "Great service and timely delivery",
          "Contenu": "Great service and timely delivery.  Thank you so much."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Mashlotte",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T19:33:33.000Z",
          "Titre": "Fast delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "tantalise",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T05:04:25.000Z",
          "Titre": "Speedy accurate delivery."
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Aleksandar Dimitrov",
          "Nb_Reviews": 3,
          "Date": "2023-12-10T23:59:49.000Z",
          "Titre": "Fast and easy great service"
        }
      ]
    }
  ]
}