{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "popl.co",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "cheryl vespoint",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T21:54:01.000Z",
          "Titre": "I never received my product and…",
          "Contenu": "I never received my product and customer service was no help. The online chat is horrible. I cannot in good conscience promote this product or the accessoris."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer Kim",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T21:06:43.000Z",
          "Titre": "Underwhelming product and experience",
          "Contenu": "Took a long time to receive, had to track down the order with customer service, and ultimately the digital card didn’t work on about 80% of the phones I tried with at the conference and I ended up giving out paper cards"
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Bo Hegner",
          "Nb_Reviews": 2,
          "Date": "2023-08-17T09:03:40.000Z",
          "Titre": "If I only could give zero",
          "Contenu": "If I only could give zero! Popl in Copenhagen is the worst burger experience ever! The burger was dry roasted, their own beer was tasteless, very small and very expensive! The chilli salsa had absolutely no taste of Chilli and on top I had to read the meny on my phone! Beieng 60+ I have no chance of reading a poor layoutet and low info meny on such a small screen. Whats wrong with a meny on paper? Further no one spoke Danish in Copenhagen?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Akaasha",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T20:48:05.000Z",
          "Titre": "I bought it last year and got…",
          "Contenu": "I bought it last year and got discouraged. It wasn't connecting my information and then they sent 2 different cards one was supposed to scan and input info. When I followed instructions it still did not work. Called today and she started acting like she couldn't hear me then hung up the phone. I called back no answer. So these are lies that they are saying good customer service because it's not. As I am leaving the review it has been 10 minutes and still no return phone call. But I guess when you spend 7.99 what can you expect? The phone number is based out of El Sobrante, CA which is only a 20-minute drive for me so it shouldn't be a situation in communication. I wouldn't recommend this to anyone who has a good business. And is just trying to use digital cards to deviate from paper. if you could leave no stars I would. Its garbage"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stoc Ish Stocish",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T23:59:51.000Z",
          "Titre": "AVOID! No Support! No English!",
          "Contenu": "Foreign company, not English speaking or even competent. If you order a custom card, Popl is not who to use! They gave me the run around from support, email, WhatsApp, Instagram chat, back to their support! All I’ve been attempting to do is provide the files their Hi-Res department gave me, back to their Print department for my custom print order. Which seems impossible after a week of attempting. AVOID them to save yourself the headaches."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Arielle Dorman",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T03:57:45.000Z",
          "Titre": "Disappointing order fulfillment",
          "Contenu": "Disappointed. Purchased this a month  ahead of a conference and they never fulfilled the order. It wasn’t until I emailed customer service asking for an update did they say the item would ship 3 days later and then it would take 2-6 business days to arrive. I had to cancel the order as it would arrive a week after the conference and 5 weeks after the initial order. Their online ordering said it would take 3-4 weeks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adam P.",
          "Nb_Reviews": 5,
          "Date": "2023-02-17T04:39:48.000Z",
          "Titre": "They don’t take returns. Product is not functional.",
          "Contenu": "Ordered a custom metal card after watching a few reviews.This product has incredibly misleading advertising. They make it seem like you just tap the card to the phone like making an Apple Wallet payment at the store.Instead you have to wave it around like a wand across the back of the phone and it works properly maybe half the time. May not seem like a big deal, but if you’ve made a good impression and want to share your information the last thing you want to do is fumble around with your business card.They offer no refunds or returns per their website itself which I had no thought to look up before ordering because I’ve never seen that from a company before. Horrible company, horrible advertising, horrible product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T22:16:30.000Z",
          "Titre": "They just don't care about their customers.",
          "Contenu": "The product is good but the customer support is horrible. I'm switching to a competitor because the support was horrible. I spent two hours on their online chat because the first person, Kath, ignored me and the second person kept ignoring me until they saw I was frustrated. Then magically they had time to reply. At that point the damage was done."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T04:00:49.000Z",
          "Titre": "They try to sell the people who download my info",
          "Contenu": "Waited over one month for the card.  The tap works approximately 1/2 the time, so I need to use the QR code which I didn’t need the $80 metal card to accomplish.  Most disturbingly, every time someone downloads my contact, they are then prompted / asked if they want to buy a Popl.  I have received over 25 emails from Popl over the past month trying to sell me ….wait for it…more Popl.  Maybe the most disappointing purchase I have made in the past decade."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Lins",
          "Nb_Reviews": 2,
          "Date": "2023-01-31T19:42:25.000Z",
          "Titre": "I’m trapped. Can’t stop their emails for love nor money!",
          "Contenu": "Honestly… I have tried to unsubscribe from this company’s emails a dozen times using the ‘unsubscribe’ option at the end of their email, which clearly does nothing, I have emailed back and forth, been told numerous times that they’ll sort it. More spam emails today! What a joke of a company. I’ll be reporting them. Do not subscribe to them, you’ll never get rid."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph Funderburk",
          "Nb_Reviews": 4,
          "Date": "2023-04-06T19:32:06.000Z",
          "Titre": "Used to love Popl now I hate it",
          "Contenu": "Used to love Popl now I hate it. I can never get anybody to help me. After a week of a pair of custom cards ordered no kind of email confirmation of my order so I decided to cancel the order. After cancelling it’s been about a month and they still haven’t refunded what was never made or shipped. But I guess that’s what happens when a couple of 20 year olds start a company. After a while they really don’t GAF they’ll just take money and send spam emails and want you to buy more and more…I’ve since contacted customer service they cancelled the order and didn’t refund it I decided to take it into my own hands. Better Business Bureau will be notified to get all of the money back that I’ve spent on two different purchases I’ve already cancelled my pro+ subscription and will be notifying the Federal Trade Commission and California’s Attorney General of Popl’s Shady business Practices. And thank God this happened before I signed up for Popl Teams."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Abraham Bada",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T02:25:30.000Z",
          "Titre": "Popl’s links have appeared to ask for…",
          "Contenu": "Popl’s links have appeared to ask for people’s card information. I am very disappointed because the people I attempt to show off Popl wont trust the technology."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Costanza",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T02:39:47.000Z",
          "Titre": "If I could put zero I would",
          "Contenu": "If I could put zero I would. This has been the worse experience I have ever dealt with while dealing with a company in the United States. First the sales person made a meeting while she was boarding a plan. So on the zoom call she basically said just buy it and you can figure it out, but would not answer my questions. I was going to get it anyway but the red flags started going up. Then the CRO Jermey said he would give me 3 free metal cards to make up for it. Great I thought, so while dealing with Operations Assistant Barbie- I stated multiple times “I don’t want the popl logo on my stuff, only my logo.” And I would pay a upgrade for it. But this was to confusing so they charged me for 3 new cards at full price, after I said I want to upgrade the free ones over 10 different email replies. Don’t buy - great product terrible service not a professional company. I got 4 emails back apologizing but never offering to fix the issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SAMIR BRADLEY",
          "Nb_Reviews": 1,
          "Date": "2022-06-09T14:03:39.000Z",
          "Titre": "Printed my custom logo incorrectly and…",
          "Contenu": "Printed my custom logo incorrectly and still have not received a replacement. Popl unused because 1/3 of my logo is missing. Impossible for me to write a good review at the current moment. Been almost a month since original order"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vin",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T00:50:07.000Z",
          "Titre": "No returns!",
          "Contenu": "First review on Trustpilot, I'm that motivated by terrible customer service. They require you to buy expensive devices, BUT DO NOT ACCEPT ANY RETURNS. Your user account and their product ordering platform are also completely separate and do not integrate."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tristan Giovanni",
          "Nb_Reviews": 2,
          "Date": "2023-03-31T21:24:50.000Z",
          "Titre": "I would definitely not use this company…",
          "Contenu": "I would definitely not use this company again. I paid a high price for this NFC card and it took forever to receive.  Then when I tried to create the digital card I get all these hidden costs to add an extra phone number and so on.  Not worth the money when other companies are in this space for the same type of service. Now their card sits in my door and now I use blinq which I just fell into and it was free for more than this company. Wish I would have found them before o wasted money on this card."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mark Ferris",
          "Nb_Reviews": 3,
          "Date": "2022-08-05T21:18:47.000Z",
          "Titre": "Almost 5 months and 3 orders and still they can't get it right!!!",
          "Contenu": "I ordered 30 popls in April and separately emailed them to ask them to expedite them if possible. It was not. 5 week later I asked where my oder was and it had not even been shipped. Apparently a processing issue. So I reordered them and after another 7 weeks they were stuck at customs. I filled out all the information customs requested but Popl did not so they got returned. I then placed another order to a different country to stop the customs problem and instead of the 40 I now ordered they sent me 8!! customer service has been terrible. They said they would give me 20% discount for the inconvenience but never recieved it. Still waiting for a refund on the orders that never arrived. Its such a shame to have a good product and then the customer service totally lets the company down."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2022-12-04T20:47:00.000Z",
          "Titre": "Don't use Popl",
          "Contenu": "Ordered from Popl and a popular competitor. Competitor Sent an email 3 days after order placed stating it had been shipped. Received and product worked great. Followed up with popl 6 days after order placed for status. 24 hours later, received message that they would email tracking info when order was shipped. 3 days later, no email so I ask again for status or a refund. They then sent a message saying the product was delivered that day and to check mail, BUT the tracking info had no address! It only included my zip code. Reached out again and no response. Use another company. I have to get my credit card company to reverse charge. Big hassle. Meanwhile I've been using the competitors product for over a week and still have nothing from Popl.Update...received refund of order finally."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 2,
          "Date": "2023-03-31T19:22:12.000Z",
          "Titre": "WOULD NOT PURCHASE AGAIN",
          "Contenu": "These are not professional and come with the badges scratched up. The second one as a replacement came scratched up as well. Definitely not worth it if your in a professional role."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Omar",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T21:39:48.000Z",
          "Titre": "Useless",
          "Contenu": "Friend got me a card for giggles. We fooled around with it but the whole idea was pretty silly and the card was super useless. Threw away the card and then they charged me $77 for their yearly subscription 2 weeks later and wouldn’t refund me. Just stick to swapping socials the normal way."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tiffany",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T13:11:21.000Z",
          "Titre": "I ordered a customized item, still don't have it!!!",
          "Contenu": "I ordered a customized item, it has been 7 weeks, still have not received it. Use a different company, they are not the only digital business card companies."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2022-07-23T05:20:31.000Z",
          "Titre": "Horrible customer service they don’t back product",
          "Contenu": "Horrible customer service. Band broke within 30 days and they will not replace unless I spend more money to go to their pro service. DO NOT BUY!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tyler Chenault",
          "Nb_Reviews": 2,
          "Date": "2022-07-08T21:11:38.000Z",
          "Titre": "I’ve made attempts to reach out and…",
          "Contenu": "I’ve made attempts to reach out and correct my business card but have not heard back from Popl. I would like a new card issued because the logo came out grainy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacob Wonder",
          "Nb_Reviews": 38,
          "Date": "2022-10-14T15:08:53.000Z",
          "Titre": "Bad company",
          "Contenu": "Terrible companyPaying to remove their branding doesn't remove annoying popups you ONLY see if you're a customer, very deceptive."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Quincy Wilder",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T16:38:50.000Z",
          "Titre": "My popl order has been in transit for 2…",
          "Contenu": "My popl order has been in transit for 2 weeks. I’m not sure about this product. The people are nice in customer service ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2022-04-26T15:37:24.300Z",
          "Titre": "Popl requires a subscription to have a…",
          "Contenu": "Popl requires a subscription to have a company name and a title."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JM",
          "Nb_Reviews": 2,
          "Date": "2022-04-01T16:25:46.000Z",
          "Titre": "Fraudulent company",
          "Contenu": "Over two weeks since you’ve charged my card popl has never arrived I’ve emailed Kath multiple times even asking for a refund which I never got and still no popl you want a review here it is your customer care and service is horrible you take money and give nothing in return if you need money go panhandle for it instead of stealing it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Spunion",
          "Nb_Reviews": 2,
          "Date": "2022-04-01T15:55:09.000Z",
          "Titre": "Was not notified if black backs being…",
          "Contenu": "Was not notified if black backs being unavailable. When no package of 1 white and 1 black band was shipped it contained only 1 white band. I am still currently waiting for the black band. When I asked to swap it for a white one, I was told no the order was processed. Still waiting on the black band. 1 star"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adc",
          "Nb_Reviews": 1,
          "Date": "2021-12-08T00:02:24.000Z",
          "Titre": "Don’t bother",
          "Contenu": "If you are using this for an E-business card don’t bother.  The sharing tech doesn’t work well and popl makes you pay monthly for anything other than names email, and phone number.  I get it to work maybe one in ten tries.  You are better off using one of the free E-cards that you can just text a link to anyone or scan the little squares."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tuan Dang",
          "Nb_Reviews": 1,
          "Date": "2021-11-06T05:08:09.000Z",
          "Titre": "I ordered my Popl on 10/20 and the…",
          "Contenu": "I ordered my Popl on 10/20 and the process was smooth, got an email and everything. Since I’ve heard nothing, not a word. I have asked for a refund and now I’m waiting for a response. No thanks.Update: Popl said they would refund my money on 10/29, I still have not seen the money refunded at all. The problem was with inventory when I couldn’t get my stuff, now I don’t know why I can’t get my money back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Helen Wiles",
          "Nb_Reviews": 1,
          "Date": "2021-08-11T21:17:21.000Z",
          "Titre": "Terrible",
          "Contenu": "Terrible. Mine doesn't work at all and when I complained to customer service they said they do not take returns! Then they gave me a PAGE LONG list of instructions to try not only on my own phone, but also every phone I want to popl to. This tech is not ready for prime time, and they shouldn't be touting it as easier than handing out a business card. What a waste!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barbara White",
          "Nb_Reviews": 2,
          "Date": "2021-07-20T12:46:26.000Z",
          "Titre": "The concept is great but the customer…",
          "Contenu": "The concept is great but the customer service is terribly slow and not helpful. They don't have a phone number and it takes several days to get a response so if you are having a conversation trying to troubleshoot something, it will take you weeks.  I've been trying to get answers since July 1st.  A five-minute phone call could have answered all of my questions. Do not recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joey Zapata",
          "Nb_Reviews": 1,
          "Date": "2021-07-03T05:59:32.000Z",
          "Titre": "Doesn’t work the way I hoped it would",
          "Contenu": "Doesn’t work the way I hoped it would. I have to text my info from the app because it’s not recognized by most people’s phones that I come into contact with daily. I do 50 to 70 clients a week and only on person could get it to work when they tapped my Popl. Don’t bother with getting the flat one for under your phone case. It’s just as thick as the other ones and not cute."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deric Moffitt",
          "Nb_Reviews": 1,
          "Date": "2021-05-29T13:19:10.000Z",
          "Titre": "My Popl did not work for any app…",
          "Contenu": "My Popl did not work for any app besides Instagram which was very upsetting. The adhesive also was not sticky, it fell off within a few hours of putting it on my phone. I reached out to customer Service for a replacement but no one has since contacted me.I had it set up correctly, when someone would try abs two my Spotify link for example it would give an error message.My order number is #329990"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kiran Fernandes",
          "Nb_Reviews": 1,
          "Date": "2021-06-01T19:48:03.000Z",
          "Titre": "Disappointed the entire concept is a…",
          "Contenu": "Disappointed the entire concept is a lure to a subscription. I wanted to be able to purchase once and get the functionality I need.Updated: Popl claims, there is no fee associated with many of the functions. That is false, to get a few fucntions, there is no fee, to get many functions or all functions, they hit you with a monthly fee. What a waste."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2021-05-27T19:04:31.000Z",
          "Titre": "I was underwhelmed with the options…",
          "Contenu": "I was underwhelmed with the options given when setting up the product. Also, the product was advertised as working with the case but I was unable to even plug in the lightning cable after putting the case on back on my iPhone. The product would not stick adequately to my iPhone 12 Pro. In fact, it fell off within an hour of its original placement."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Simone",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T05:22:13.000Z",
          "Titre": "Never Got Use",
          "Contenu": "Well I set it Up and Stuck it On a Clean Phone and Never got to Popl anyone because when I went to do it My Popl WASNT there. The sticky part did not stick . I found the Popl and I wish I could have at least popld once . Smh not fun to purchase something and it doesn’t stick .Is there a way they can send another one or do I have t buy another and risk the chance of that happening again?Please help I really wanna be in times and Popl my Small business"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amanda Barclay",
          "Nb_Reviews": 1,
          "Date": "2021-05-31T17:01:26.000Z",
          "Titre": "My popl doesn't work",
          "Contenu": "My popl doesn't work. I have tried it with 6 family members and it only transferred information onto one phone. They had their screens unlocked, and it still did not work. I am so glad I have not tried this with potential customers. That would be embarrassing. Not to mention, I paid for the subscription so now I am out 50 dollars."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Katie Leaps",
          "Nb_Reviews": 2,
          "Date": "2021-08-09T17:38:57.000Z",
          "Titre": "This was a total waste of money",
          "Contenu": "This was a total waste of money. It won’t link to my business is site and you have to pay five dollars a month to get any of the good features, some thing they failed to mention clearly on their website. Also, if you order it through popls website you aren’t able to return it at all unless it’s defected."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cinthia Suzzette",
          "Nb_Reviews": 1,
          "Date": "2021-06-07T14:19:22.000Z",
          "Titre": "Popl doesn’t work",
          "Contenu": "Popl doesn’t work. I think is damage, I tried to popl to other IPhones and Androids and doesn’t popl. It keep sending me the notification without even been active... had to take it off... I want a refund. I can just edit, not reply… So yes, I did all 3 steps and properly activated the account. It just send me the notification like is popl to me… even without having it on in the app. I tried phones IPhone 7 and up, didn’t work same with Android. Send me a number I can reach to communicate with customer services."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Britney",
          "Nb_Reviews": 1,
          "Date": "2021-05-31T14:58:02.000Z",
          "Titre": "Disappointed",
          "Contenu": "I ordered two separate products (the popl and popl flat). Though it said it was delivered, I never received the first order. However, I really wanted to give it a try so I ordered a second time. The set up was fairly easy. Subscriptions were needed to gain full access to everything(which I feel should be better advertised). But again, I really wanted to make good use of this product for my business. Was looking forward to using it for an upcoming pop up shop, but sadly after only a week, it no longer works at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pro-touch Carpet Care",
          "Nb_Reviews": 1,
          "Date": "2021-04-10T16:03:54.000Z",
          "Titre": "Very misleading…",
          "Contenu": "I find it very frustrating when something is advertised as free, but then you are forced to pay a monthly fee to do something as simple as place a business profile picture. Not only is it misleading, it literally doesn’t work as advertised on most iPhones unless the person downloads the app first."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Heather Walley",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T18:24:13.000Z",
          "Titre": "Popl is not as useful as I thought it…",
          "Contenu": "Popl is not as useful as I thought it would be.  Virtually no one has NFC on and it has yet to actually talk to someone else's device.  Pretty disappointed. I'm going to a networking event tonight so I'm hoping for a better performance,, but my expectations are low."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Alan Nightingale",
          "Nb_Reviews": 1,
          "Date": "2021-09-08T19:57:20.000Z",
          "Titre": "I hate popl",
          "Contenu": "Look up i hate popl on facbook groups  thought I'd share this page with u popl are terrible company the app is awfull links dont work customer services are shocking dont get conned into buying this rubbish its a not a product that works at all"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rachel",
          "Nb_Reviews": 1,
          "Date": "2021-05-20T21:00:07.000Z",
          "Titre": "This simply doesn't work",
          "Contenu": "This simply doesn't work. Every time it suggested to the person i was trying to pop to that they make an account. It's specifically advertised that they don't need to do thisb. Yet after following all the instructions, it just doesn't work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elizabeth Novoa",
          "Nb_Reviews": 1,
          "Date": "2021-05-13T00:56:43.000Z",
          "Titre": "Hello I rate this 1 star because I…",
          "Contenu": "Hello I rate this 1 star because I purchased 3 popls.  Not one of them worked on Samsung s20 plus or iPhone 12 .  I reached out to support no one returned a message or call .  I'm out of my money with stickers that dont stick or work"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sheldon Bray",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T15:30:44.000Z",
          "Titre": "BUYER BEWARE",
          "Contenu": "BUYER BEWARE. You should read all their terms of service. They will never stand behind their product or service. Needed this for an event paid for expedited 3-5 days delivery. Showed up in 12 days. No problem I'll just return and get my money back. NO REFUNDs what so ever. Then I'm told it is \"right on time\" by stating there is also a 1-3 day processing time (not disclosed until I missed the date I needed it). Even then it is late at 12 days. Looked at the tracking and they printed a label timely but then waited 8 days to get it to USPS. How lazy doesn't USPS stop by every door 6 days a week. With a No refund policy I guess it doesn't matter to hold to your timetable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2021-06-01T15:19:29.000Z",
          "Titre": "Not worth it",
          "Contenu": "Would not recommend. Most of the worthy features are locked behind a pay wall.  I also reached out to support and followed their instructions to process a refund over 10 days ago. No response as of today."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michelle Arango",
          "Nb_Reviews": 1,
          "Date": "2021-05-26T19:48:57.000Z",
          "Titre": "Im out $100 and they dont answer my…",
          "Contenu": "Im out $100 and they dont answer my emails . what a terrible company. Young guy create a product, gets money hungry and doesn't care for his customers just whats in there pockets."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tarrell Forest-Parramore",
          "Nb_Reviews": 1,
          "Date": "2021-05-20T19:32:56.000Z",
          "Titre": "haven't go my product",
          "Contenu": "they say it was delivered but I haven't got it yet have contact popl and they said wait 48 hours but I worried I just paid for a product I won't get"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mariana",
          "Nb_Reviews": 1,
          "Date": "2021-05-26T18:02:46.000Z",
          "Titre": "Good customer service",
          "Contenu": "I had a problem on receive my Popl but customer service was super nice, and send me one extra for free! I’m very happy with my Popl and I recommend it :)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roderick Williams Jr",
          "Nb_Reviews": 1,
          "Date": "2021-06-01T15:19:55.000Z",
          "Titre": "I never received my package",
          "Contenu": "I never received my package. I ordered it 3 weeks ago and it never came ! This was a horrible experience and i either need a refund or a item for free"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ANDREA",
          "Nb_Reviews": 3,
          "Date": "2021-05-12T18:08:40.000Z",
          "Titre": "Wasn't aware before listing that an NFC…",
          "Contenu": "Wasn't aware before purchase that an NFC capable phone was needed. Both popls can't be used with either my husband's or my phone."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Ashish Sharma",
          "Nb_Reviews": 1,
          "Date": "2021-10-15T17:02:01.000Z",
          "Titre": "its not working properly.",
          "Contenu": "its not working properly.. i feel unhappy afer purchased this.. it was just gud for popl add.. but in real its not work fast... **"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maria Ines Ferreira",
          "Nb_Reviews": 1,
          "Date": "2021-05-22T04:54:16.000Z",
          "Titre": "Hi! It doesn't work",
          "Contenu": "Hi! I already sent email and text sending that it is not working! So I didn’t hear from you yet! I’m still waiting for an answer!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Samantha Lorenzato",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T14:44:48.000Z",
          "Titre": "Product doesn’t work at all I tried…",
          "Contenu": "Product doesn’t work at all I tried every troubleshooting tip there was. Wish I had read reviews before I had purchased"
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "Mostafa Elshareef",
          "Nb_Reviews": 1,
          "Date": "2021-05-18T07:47:10.000Z",
          "Titre": "7 days no updates on my shipment and no…",
          "Contenu": "7 days no updates on my shipment and no promise date mentioned for delivery , I talk to shipping company and no answer"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ian O.",
          "Nb_Reviews": 3,
          "Date": "2021-09-08T16:25:00.000Z",
          "Titre": "I want to return!",
          "Contenu": "I want to return!! I have emailed you several times!?  Please let me know how to return and get a refund! Thanks!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Seek",
          "Nb_Reviews": 3,
          "Date": "2021-05-28T17:14:26.000Z",
          "Titre": "Spam left and right",
          "Contenu": "Spam left and right. No email unsubscribe options. Get it people, I’m not interested in YOU, just your PRODUCT."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JULIE TROXEL",
          "Nb_Reviews": 1,
          "Date": "2021-12-17T18:18:16.000Z",
          "Titre": "DON’T WASTE YOUR MONEY!!",
          "Contenu": "I recently purchased 32 Popl’s for my business. After meeting with the Popl team I realized they were not going to work for us for the purpose we needed them and we did not have the budget to spend over $300 per month for their teams platform. I emailed asking about a return/refund for the product and have heard nothing from them. I have tried emailing multiple times with no reply. You would think a business would at least have the common decency to reply even if the answer is no or they would at minimum try to work something out. I think their customer service is below par and would never recommend or use their product. I also have been unable to remove their pro product from my app/account and they have no information on their site regarding this. They don’t respond to email so I guess they just try to get your money and than ghost you. I plan to contact BBB and as many other review sites as I can. You are better off creating a contact card in your contacts and texting it to anyone who needs your information.UPDATE: they replied to this review but can’t reply to email. I have checked my junk/spam, everywhere. No reply. This is a scam and terrible customer service. Be sure that I will be spreading this info everywhere I can do no one else has to go thru this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim Russell",
          "Nb_Reviews": 1,
          "Date": "2021-06-04T14:49:13.000Z",
          "Titre": "9 TIMES OUT OF 10 THE POPLE DOESN'T…",
          "Contenu": "9 TIMES OUT OF 10 THE POPLE DOESN'T REGISTER ON THE OTHER PERSON'S PHONE. VERY FRUSTRATING."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Evelyn Rivera",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T18:42:41.000Z",
          "Titre": "Horrible",
          "Contenu": "Horrible. Not user friendly can only do certain things if you pay. Very miss leading"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank Amador",
          "Nb_Reviews": 1,
          "Date": "2021-05-18T23:03:10.000Z",
          "Titre": "Apparently the package was never…",
          "Contenu": "Apparently the package was never delivered to my home. Where is my delivery proof?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "STEPHANIE MORRIS",
          "Nb_Reviews": 2,
          "Date": "2021-05-31T15:31:37.000Z",
          "Titre": "Wasted my money",
          "Contenu": "I didn't want this any longer and I wasn't allowed to cancelMy order"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Diamond Rodriguez",
          "Nb_Reviews": 2,
          "Date": "2021-08-21T15:27:59.000Z",
          "Titre": "Don’t waste your money.",
          "Contenu": "Edited 8/21/21-Still getting emails regarding me being unable to get a refund. Tracking shows package still at the shipping location. Supposedly sent a replacement but no tracking. At this point I don’t want the Popl. It just shows what a mess this company is. Edited 8/16/2021-Popl has since refunded my account. However they don’t quite have it together, now I’ve got one representative saying they cannot cancel my order but would send a replacement. I’ve received a refund via another representative and they’ve sent a replacement already. I did attempt to get a return label/get the return address etc to return the item but they advised to keep it as their gift. Service definitely needs some work and customer service should be a bit easier to access but they did make an honest and hood will effort to fix things after I threw a fit and finally got some responses. Not ideal but a decent outcome. I purchased a Popl a couple of weeks ago. There has been no tracking updated, ZERO communication from Popl, but you can pay to speak to the scammers if you opt to throw away more money. It’s a great scam. I’ve attempted to email and text the given support numbers/email given. I’ve contacted my bank to dispute the charges on items never sent. I also am unable to deative and delete my Popl account and the ambassador’s account. I had opted to sell Popl as a side income. This company is not much more that trash. It’s a great concept  but they do not deliver on product or customer relations."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Tomas Castro Orozco",
          "Nb_Reviews": 1,
          "Date": "2021-05-29T08:59:24.000Z",
          "Titre": "Where is my package",
          "Contenu": "Where is my package? I dont have my popl. I am wating for it to arrive."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Allof Capital",
          "Nb_Reviews": 1,
          "Date": "2022-01-28T11:49:36.000Z",
          "Titre": "Not user friendly",
          "Contenu": "Not user friendly. Very difficult to set up. Regret buying it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shantel Hardesty",
          "Nb_Reviews": 1,
          "Date": "2021-05-07T16:40:54.000Z",
          "Titre": "Can’t review a product you never…",
          "Contenu": "Can’t review a product you never received. 👎🏼🙄"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Vishar",
          "Nb_Reviews": 2,
          "Date": "2021-10-11T13:24:10.000Z",
          "Titre": "There was a scratch on the item when arrived",
          "Contenu": "There was a scratch on the item when it arrived. Terrible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Danielle Shunk",
          "Nb_Reviews": 2,
          "Date": "2021-06-05T14:11:18.000Z",
          "Titre": "For whatever reason my Popl doesn’t…",
          "Contenu": "For whatever reason my Popl doesn’t work on anyone’s phone"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nwabueze \"Eze\" Okwodu",
          "Nb_Reviews": 1,
          "Date": "2021-05-24T00:24:07.000Z",
          "Titre": "I couldnt use this product",
          "Contenu": "I couldnt use this product. I set it up and it didnt work"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kaitlin",
          "Nb_Reviews": 1,
          "Date": "2021-05-05T18:58:18.000Z",
          "Titre": "Order didnt arrive",
          "Contenu": "Order didnt arrive after saying its been delivered"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Keren Padilla",
          "Nb_Reviews": 2,
          "Date": "2021-05-18T22:24:53.000Z",
          "Titre": "Waste of money",
          "Contenu": "Don’t function, waste of money!I want a return!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karla Fernandez",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T00:08:33.000Z",
          "Titre": "Doesn’t work",
          "Contenu": "I found that it doesn’t pop up on phones."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nedzad Begzadic",
          "Nb_Reviews": 1,
          "Date": "2021-05-18T02:02:42.000Z",
          "Titre": "Item says delivered but not in the mail"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Emily",
          "Nb_Reviews": 2,
          "Date": "2021-05-13T00:11:09.000Z",
          "Titre": "Doesn’t work and not worth the money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kana Nur-tegin",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T19:08:01.000Z",
          "Titre": "Taking too long",
          "Contenu": "Taking too long. Still waiting"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Katherine Schneider",
          "Nb_Reviews": 1,
          "Date": "2021-05-18T16:37:38.000Z",
          "Titre": "NEVER RECEIVED MY PACKAGE",
          "Contenu": "NEVER RECEIVED MY PACKAGE! :("
        },
        {
          "Note": 1,
          "Lieu": "PR",
          "Pseudo": "Normarie Pabón",
          "Nb_Reviews": 2,
          "Date": "2021-05-28T14:30:46.000Z",
          "Titre": "Product still hasn’t arrived"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Toni Collins",
          "Nb_Reviews": 1,
          "Date": "2021-05-13T19:42:19.000Z",
          "Titre": "I have not received my popl"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Emily Tavares",
          "Nb_Reviews": 1,
          "Date": "2021-05-28T19:11:15.000Z",
          "Titre": "I never received my device"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ronald Wilson",
          "Nb_Reviews": 1,
          "Date": "2021-05-17T23:35:09.000Z",
          "Titre": "Haven't  got here yet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amber Metzger",
          "Nb_Reviews": 1,
          "Date": "2021-07-01T17:16:24.000Z",
          "Titre": "Never came in the mail."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Winkedbymelody",
          "Nb_Reviews": 2,
          "Date": "2021-05-21T13:21:41.000Z",
          "Titre": "Doesn't even work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Lockwood",
          "Nb_Reviews": 1,
          "Date": "2021-05-16T17:25:46.000Z",
          "Titre": "This product is awful."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2021-05-24T22:35:55.000Z",
          "Titre": "Have not received it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Carter",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T18:14:35.000Z",
          "Titre": "It doesn't work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Darrin Bridgman",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T00:37:14.000Z",
          "Titre": "Did not receive all my items",
          "Contenu": "Did not receive all my items. Only received partial order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Roger Wagner",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T01:18:24.000Z",
          "Titre": "An flaw in the ordering system",
          "Contenu": "I already have a black rope band but later had an opportunity to order a white rope band.  When i ordered it using a 35% discount, Somehow, it reverted to the color black.  When I received it, I quickly responded back with an email stating the issue.  I finally got a response that I could not exchange the color.  Instead, they gave me anothrr 35% off which THATS the only reason I ordered the second band the first time.  I already had a black.  I wanted a white as well.  I really wanted the white band.  I don't want to spend MORE money on something the went wrong on the last order. What it it reverts to black AGAIN.  I'm not happy with the response that was given.  I'm an honest customer who was subject to a flaw in the ordering system."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Danielle Carr",
          "Nb_Reviews": 1,
          "Date": "2023-02-19T15:33:25.000Z",
          "Titre": "They sent me the wrong color card",
          "Contenu": "They sent me the wrong color card, they charge for almost everything besides the very basics. The cards are 4.99, but if you want the upgraded buttons added to your card…you have to pay monthly 7.99. 7.99x12= 95.88. Not worth it. I’d recommend dot.cards!They only charge $20 for a card and no subscription needed whatsoever. Can completely customize your cards. Just speaking as someone who has had both. The really cool thing about popl is that they have a QR code that can be added to your wallets app in Apple."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "HALEY SARGEANT",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T05:22:42.000Z",
          "Titre": "2 of the cards were printed…",
          "Contenu": "2 of the cards were printed incorrectly. I reached out to see if it could be fixed, but I'm still waiting."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "M P Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T16:22:40.000Z",
          "Titre": "Not Impressed",
          "Contenu": "I ordered the Gold Metal Card, one for myself and one for a gift, as well as the custom badge. I received one Gold Card , which I set up for myself. Upon receiving it I was impressed with the packaging, opening it was another story - the card had fingerprints on it and light swirl marks. It looked used. For a company that sells a product based on image and self promotion. They need to up their game on how they send out their product to it's customers.I have yet to receive any update on the second Gold Card, so much for their email updates. The custom badge, I have not received any updates on that order. I did use the Chat option and connected with one of their C/S agents - Kath, who asked if she could follow up with an email. That was a week ago and still no word.Long story short, great concept but their customer service is lacking, and their follow through is even worse. Coupled with the fact that the Gold Card is hit or miss when using it.....Waiting to see if the custom badge works better. That's if I ever receive it!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Viren M",
          "Nb_Reviews": 1,
          "Date": "2022-04-15T13:37:01.000Z",
          "Titre": "broke in 2 days - Popl separated from base sticker",
          "Contenu": "Update - Custom Popl's phyiscally broke in 2 days of use. The custom logo separated from the base sticker and fell off the phone. Good product. Ordered a few tagsfor my wife's work team and just ordered a bunch of cards for my sales team.I like them but I wish the size of the tag was much smaller. We make NFC devices with 5yr battery life, so I know they can be smaller. Let's see how the cards look, havent received them yet. Definitely wish the custom cards actually showed a delivery date so I knew before placing the order if I'll get them in time. This should be implemented especially if Popl is targeting business clients as most of them need it for trade shows or event giveaways etc."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mitchell",
          "Nb_Reviews": 3,
          "Date": "2022-06-16T23:23:07.000Z",
          "Titre": "Took way too long to get the card (5+…",
          "Contenu": "Took way too long to get the card (5+ weeks). I understand it was personalized, and those take 1-3 weeks to ship, but that is NOT explained anywhere during the ordering process. Also, that would mean it took 2+ weeks to ship a small plastic card across the country? Doesn't add up. When I got the card, it didn't work. The email support takes a day to respond to every request, and they're asking me questions every time about the process, that I've already tried - so it's been 6 weeks, and I still don't have a working product. Bad purchase."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Josh Parsley",
          "Nb_Reviews": 1,
          "Date": "2022-05-27T04:51:15.000Z",
          "Titre": "Over a month to deliver..",
          "Contenu": "I ordered a custom popl dot for the back of my phone as well as 4 custom business cards. The dot was delivered in 4-5 business days (as stated on website) and it looked great, but the business cards have yet to be delivered. IT HAS BEEN OVER A MONTH SINCE I PURCHASED MY ORDER (April 26, 2022). I contacted customer service and was told the cards would be delivered over a week ago…This has been very disappointing. I will not order from this company again nor would recommend their products or services to anyone."
        },
        {
          "Note": 2,
          "Lieu": "SE",
          "Pseudo": "Wallinjewels",
          "Nb_Reviews": 2,
          "Date": "2023-04-01T00:04:09.000Z",
          "Titre": "To slow i need the card!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Celeste Swatling",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T16:25:01.000Z",
          "Titre": "Doesn’t work every time",
          "Contenu": "Doesn’t work every time. If I gave a business card out and it only was received by 50% of the people, I would think it’s highly ineffective. Makes you look unprofessional"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "misscd.n...",
          "Nb_Reviews": 6,
          "Date": "2022-06-19T07:18:29.000Z",
          "Titre": "The app is opening up any time I touch…",
          "Contenu": "The app is opening up any time I touch my phone. Any time!!!! I can't do anything about it apparently as I checked all the possibilities."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julian Joy",
          "Nb_Reviews": 2,
          "Date": "2021-05-12T19:11:56.000Z",
          "Titre": "Not as cool as it looked",
          "Contenu": "So far, it hasn't worked as planned on anyones phone.  The only one that worked was when we used the QR code.  Every time I turn my NSF on, it picks up my Popl and continue to open the app periodically.  Can't even discover where to turn on NSF in my wife's iPhone to see if that works.  5 attempts with peoples phones and it hasn't worked via NSF once yet."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Laura S",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T14:19:12.000Z",
          "Titre": "25% isn’t passing",
          "Contenu": "I have tried to use my popl multiple times and it has only worked twice. It’s disappointing to pay so much for a service and it work less than 1/4 of the time. I will keep trying to use it, as I love the idea of it, but have not had much luck getting it to work (which also makes me look unprofessional as I do use it for business purposes)."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tobi Overgaard",
          "Nb_Reviews": 1,
          "Date": "2021-05-13T01:11:36.000Z",
          "Titre": "I’m new to Popl....got my package",
          "Contenu": "I’m new to Popl....got my package, bracelet, 2nphone popl’s. When i opened the package it had a postcard with instructions on it. I was disappointed to see that I did not receive all of my popl’s. It wasn’t until later that I saw the sticky post a card where 1 of them had been attached....now thrown away! And it was the pretty one. 😢.....soooooo I think someone needs to use some tape or make sure they don’t fall off.....I had no idea it was stuck to it, nor did I see it in the envelope. Totally bummed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryan DuPree",
          "Nb_Reviews": 1,
          "Date": "2021-03-15T02:16:23.000Z",
          "Titre": "Not worth the trouble...",
          "Contenu": "I ordered several Popl's for my business so clients could scan the popl and automatically pull up various ways to pay and also see my service menus and social media.  The idea is nice but no one uses it and those that are interested in using it never seem to have their NFC connections on and then have to fiddle with their phone to allow the connection and it's just time consuming and they lose interest in it.  Great concept but I'd pass on Popl.  Not to mention their marketing ads are cringe-level, psycho-stalker level."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Latasha Kendrick-Palmer",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T22:56:49.000Z",
          "Titre": "Could be so great- but disappointed",
          "Contenu": "We purchased this technology after seeing an add on social media. It was easy to set up and to link our small business information. When we arrived at our venue we were excited that we would be one of few vendors who could off a quick and touch free mechanism of sharing. That’s where the excitement stops. Of the over 60 people we attempted to offer our information to only 2 we’re able to use it with success. We tried everywhere in the wristband- the top, bottom, tapping with a phone cover, without a cover, even on the phone screen itself… hardly anything worked. Finally we gave up and went back to using our paper business cards- for which potential customers stuffed in their pockets and purses costing business and time. Great idea- not so great operationally."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ian McMillan",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T15:28:51.000Z",
          "Titre": "Constant Notifications",
          "Contenu": "Every time I unlock my phone popl keep notifiing me and there is no option to turn it off.I also tried sharing my info with a few people and it did not work, not sure why."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kelly B.",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T19:03:54.000Z",
          "Titre": "Wish it worked like on the ads",
          "Contenu": "I have to tap and hold the phone just right for it to pick up my info if it even picks up at all. People have to scan the QR and it takes away the efficiency of the popl"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeremy Kean",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T17:14:58.000Z",
          "Titre": "The popl that’s stuck to the back of my…",
          "Contenu": "The popl that’s stuck to the back of my phone is temperamental and doesn’t always work. It is embarrassing to have them try, fail and go back to the camera to scan QR"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Arianna Merced",
          "Nb_Reviews": 2,
          "Date": "2021-11-09T18:19:38.000Z",
          "Titre": "venmo wasn’t working",
          "Contenu": "I tried using the Popl at my first event and it just wasn’t working well with venmo. I had to manually provide my customers with my username for venmo."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bettina Okzana Kilpatrick",
          "Nb_Reviews": 1,
          "Date": "2021-11-29T16:28:35.000Z",
          "Titre": "I got this thinking it would be great…",
          "Contenu": "I got this thinking it would be great for my business. I was excited to get it and use it. First of all, it doesn't work through phone cases. I used it for the first time at a pop-up shop and it didn't work unless my customers took their phone case off. It's pointless because most people have cases on their phones. I noticed in all the videos none of the phones used in the demonstration had cases on them.. The time I spent trying to get it to work I could have handed them a business card and moved on to my next customer. I didn't even bother asking for a refund, just took it as a loss. I wouldn't recommend getting this unless you want to waste precious seconds trying to get someone's phone to read your popl. I think they need to work out the kinks and let customers know the limitations of their product. I threw mine away and just printed my information on my packaging. I still gain followers and have built a successful following without it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amanda Ivy",
          "Nb_Reviews": 1,
          "Date": "2021-05-13T13:24:40.000Z",
          "Titre": "I love the idea",
          "Contenu": "I love the idea, but only about half the folks I try to use it with get it to pop up. And yes, we're looking at instructions and troubleshooting"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephanie Caldwell",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T14:34:26.000Z",
          "Titre": "I have to fumble around with it just…",
          "Contenu": "I have to fumble around with it just for someone to get my information. It would be quick to just tell them"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "karin nieuwoudt",
          "Nb_Reviews": 1,
          "Date": "2022-01-10T20:34:39.000Z",
          "Titre": "Does not always work",
          "Contenu": "Does not always work - connection issues and more... dissapointed - i bout 3 of these!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Edwin",
          "Nb_Reviews": 1,
          "Date": "2021-05-26T18:33:33.000Z",
          "Titre": "It doesn’t work",
          "Contenu": "It doesn’t work. I set it up and everything and when I have a phone tap it doesn’t work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Wassem Albacha",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T16:33:40.000Z",
          "Titre": "Popl",
          "Contenu": "My wallet app is activated every time I tried to use popl my wallet app is active"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Simon Mark Greer",
          "Nb_Reviews": 1,
          "Date": "2021-08-01T13:36:36.000Z",
          "Titre": "BS have to PAY to even have a damn…",
          "Contenu": "BS have to PAY to even have a damn profile picture. The OTHER SHOE DROPS !!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris J Galluzzo",
          "Nb_Reviews": 2,
          "Date": "2021-11-11T14:41:21.000Z",
          "Titre": "Very poor customer service or none to…",
          "Contenu": "Very poor customer service or none to speak of!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SILKIA JANELLE CAPO",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T18:28:45.000Z",
          "Titre": "Can get to make it work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tammy Uchôa",
          "Nb_Reviews": 1,
          "Date": "2021-05-28T16:59:56.000Z",
          "Titre": "Is kind confused!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lony Maya",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T20:43:52.000Z",
          "Titre": "Ok but logo came right off.",
          "Contenu": "Over all I like the concept of the logo Popl dot, however the logo came right off, which isn’t something I had expected."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Briana McPherson, CPA",
          "Nb_Reviews": 1,
          "Date": "2022-04-07T00:27:50.000Z",
          "Titre": "Could be Quicker",
          "Contenu": "Honestly, I had high hopes for my custom card because I didn't have to buy multiple in order to get my custom business name. However, the most frustrating thing was the amount of time it took to actually get my card. It stayed in \"in transit\" for 5 days and I contacted support who told me \"it should be shipping soon\". I ordered physical cards from another company to hold me over and that got here before the custom Popl did."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Harry L",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T01:55:46.000Z",
          "Titre": "Has its cons, but unique to promote",
          "Contenu": "The cons for this device, it does not work with older Apple and Android phones. Additionally, if a phone does not NFC on, it does not work. It may problematic tell others to turn on this feature and how to do it. When it works or  when someone scans the QR code, it is great. Also, it is a great talking piece."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "R Williams",
          "Nb_Reviews": 1,
          "Date": "2022-04-19T23:43:36.951Z",
          "Titre": "It has not been made clear how the…",
          "Contenu": "It has not been made clear how the payment process works."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Perkigi",
          "Nb_Reviews": 2,
          "Date": "2022-04-26T18:55:36.460Z",
          "Titre": "Difficult for people without iphone"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Family Adventure Goals",
          "Nb_Reviews": 1,
          "Date": "2022-04-19T21:56:31.000Z",
          "Titre": "Honest review!",
          "Contenu": "Updated review:The free version of the product seems super handy. As someone that runs a blog with over 1.2 million followers, most people I encounter know of our blog but it’s nice to have the Popl for a seamless link.I’m kinda sad it does not automatically come with the “pro” option where you can customize the look of it but I understand businesses need to get additional revenue somewhere.I willl update my review as I get to use the product"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jessica Day",
          "Nb_Reviews": 1,
          "Date": "2022-03-31T15:43:12.000Z",
          "Titre": "We purchased a custom card from Popl…",
          "Contenu": "We purchased a custom card from Popl and 2 other competitors, all within the same hour, so we could test the products and choose which company to go to for our entire team. Your product came an entire week after your two competitors had their items in our hands. The general useage, packaging and card was not as good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Simone Massage",
          "Nb_Reviews": 1,
          "Date": "2021-07-15T21:21:57.000Z",
          "Titre": "I like the concept, but it rarely works!",
          "Contenu": "I like the concept, but most phones I have tried do not work. Also, some people are wary that I am trying to steal info from their phone lol. biggest issue is it not working for iPhones...while I use Android, many people have iPhones and i cannot transfer my info to them. Buying these four Popls seem like a waste at this point. I still need to order more cards anyway. Hopefully the technology will improve so everyone can use it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karri Denise",
          "Nb_Reviews": 1,
          "Date": "2021-05-23T18:00:20.000Z",
          "Titre": "You have to pay for everything",
          "Contenu": "It's a good idea overall, but the restrictions for a nonpaid account are way too great for it to actually be worth buying the popl itself. If I would have known that I would have had to pay a monthly fee on top of purchasing the device itself just to add a basic link to my profile or add two different Instagram accounts, I would have gone with a different company."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alissa Winkler",
          "Nb_Reviews": 1,
          "Date": "2021-05-24T23:46:36.000Z",
          "Titre": "Pretty disappointed in my custom logo",
          "Contenu": "Pretty disappointed in my custom logo. It came out off-center and a weird color. The logo I uploaded was a charcoal gray and it came out a greenish much lighter gray. Not so excited to show this off, but I guess it will still do the job."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Saxxon Rybski",
          "Nb_Reviews": 2,
          "Date": "2021-05-28T21:46:29.000Z",
          "Titre": "I only gave you 3 out of 5 stars…",
          "Contenu": "I only gave you 3 out of 5 stars because Prior or the purchase there wasn't very clear that there is a monthly cost for business. I found you on a IG ad and really liked what you offer (I still do). My only recommendation is to make it more clear when purchasing that there is a monthly charge for business. The reason I bought it was for my business to replace my physical business cards. I was just caught off guard when I was activating my Popl and saw that there is a charge for business. Overall I'm happy with your product; really love your product and I believe you will do very well as a company. Thank you for your time!Saxxon Rybski"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Ursini",
          "Nb_Reviews": 1,
          "Date": "2021-11-01T18:32:23.000Z",
          "Titre": "I love Popl and it has come in so handy…",
          "Contenu": "I love Popl and it has come in so handy but one of my Popl's isnt working and getting it replaced has become reallllllly challenging. Otherwise, the app, the devices, the card, the Nomad case is AWESOME!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elaine Smith",
          "Nb_Reviews": 1,
          "Date": "2021-05-17T19:44:41.000Z",
          "Titre": "The popl I purchase will not stick to…",
          "Contenu": "The popl I purchase will not stick to my phone. The first night it fell off. However, I do like that app. I can still send my information, but the diamond popl did not give what I was hoping for."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2021-05-26T11:50:16.000Z",
          "Titre": "Doesn't work for me",
          "Contenu": "Well first, to have a business profile and use some of the business features, you have to pay a monthly subscription. That was disappointing and unexpected, but I may have missed reading that somewhere. Second, everytime I used the biometric print or pattern to open my phone (Note 10+), I'd get a pop up from Popl app requesting to be the default action which makes no sense. I was unable to disable this so I switched it to my Note9 and I am unable to share data, or Popl, any one using that device. I didn't try to do that on the 10+ to be fair, very well didn't work on that phone either, but I was working through other kinks and didn't get around to trying a \"pop\".just didn't work for me, the interface is good looking though."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "John Ryan",
          "Nb_Reviews": 1,
          "Date": "2021-09-28T03:25:58.000Z",
          "Titre": "Ordeed POPL 22.08.2021 and today its…",
          "Contenu": "Ordeed POPL 22.08.2021 and today its 14/09/21 and still have not received a shipping #. I definitely do not recommend this company. UpdateThey did put it right and I received items."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Grayson Knight",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T21:17:15.000Z",
          "Titre": "The app and stuff works great but my…",
          "Contenu": "The app and stuff works great but my band that I bought is terrible. It doesn't work when I put it up to any phone and the QR is wearing off."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lee Goodman",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T16:45:25.000Z",
          "Titre": "Popl is a cool",
          "Contenu": "Popl is a cool way and save money without having to handout business cards all the time. It can be spotty  sometimes but when it’s not it’s great"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ducky Frost",
          "Nb_Reviews": 1,
          "Date": "2021-05-28T20:57:35.000Z",
          "Titre": "The shipping was fast and the product…",
          "Contenu": "The shipping was fast and the product was still in good shape but the packaging got messed up and was a little skeptical at first but otherwise amazing product works great"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melisa Soriano",
          "Nb_Reviews": 1,
          "Date": "2021-05-17T16:58:06.000Z",
          "Titre": "I love the quick access to social media…",
          "Contenu": "I love the quick access to social media but I wanted the website link access and you have to pay for the subscription. :-("
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dawn Knight",
          "Nb_Reviews": 1,
          "Date": "2021-05-20T23:32:50.000Z",
          "Titre": "Not as expected",
          "Contenu": "Works well, looks good, but most features require a monthly subscription.  Not what I understood to be feature wise."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Clifton Montgomery",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T17:44:16.000Z",
          "Titre": "It’s great when it works but doesn’t…",
          "Contenu": "It’s great when it works but doesn’t work for every phone. I don’t know if it’s a connectivity issue or what."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "sasha reedus",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T16:03:52.000Z",
          "Titre": "Felt like it took a while and when it…",
          "Contenu": "Felt like it took a while and when it said it was delivered want in my mailbox until 2 days later"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Scott McGrew",
          "Nb_Reviews": 1,
          "Date": "2021-05-17T19:50:13.000Z",
          "Titre": "Ordered the custom Popl, image not centered.",
          "Contenu": "Ordered the custom Popl. Image wasn’t centered. Fast shipping, love the product."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "priscilla franzin",
          "Nb_Reviews": 1,
          "Date": "2021-05-28T13:20:01.000Z",
          "Titre": "waiting",
          "Contenu": "My order has not arrived yet. I hope it arrives taken to try it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amneris Correa",
          "Nb_Reviews": 1,
          "Date": "2021-06-04T05:20:52.000Z",
          "Titre": "Not compatible with most phones"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Powers",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T16:06:41.000Z",
          "Titre": "So far, so good…",
          "Contenu": "I bought the metal card. The card is nice, and has held up well (though so far, it’s only been a month). It was fairly easy to link to a digital card. I may choose to get additional equipment for the different cards at a later date. As a part time graphic designer/art teacher, I have to say - packaging was very well thought out, and nicely executed. One small thing working against Popl (probably all of these digital card companies) is that so far, few people  locally (SE Michigan) seem familiar with it. I’m still fairly new to it myself (been to two networking events so far) - a series of videos on how to scan the card, best orientation of the phones, things to watch out for, etc would be helpful… many people (so far) seem leery about the tech. And if we try it, they end up just giving up after a few quick tries, and asking for the traditional cards.Again, this is not so much a problem with the company, but just that learning to use it is so new to everyone… There’s a little bit of a learning curve.  Back to the good - I’m currently using Popl Pro. The extra features work well. I do a few things that are vastly different from each other (art consulting, graphic design vs several of the performing arts), so being able to create multiple cards for each facet is a nice feature (for me). The digital “cards” themselves were easy to set up, and the design makes it fairly intuitive. The customization (colors, pictures, the QR code personalization) is nice, it’s a good design. I like being able to link extra apps - like Square, Venmo, etc (in case someone would like to pay / tip digitally). And the extra links are a great idea - Not just social media links, but features like embedding video or linking with Calendly makes this a plus over traditional cards. That, and the easy editing features. I can rebrand or change my number in a few minutes, and I don’t need to toss/recycle hundreds of cards or pay another few hundred dollars to reprint over a small change. Over all, so far, so good!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew \"Druski\" Scott",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T15:48:42.000Z",
          "Titre": "Popl is top-tier",
          "Contenu": "Opposed to the two other digital cards I've tried, Popl has multiple more options within it's platform for me to quickly network efficiently. I'm a Real Estate Broker and it's very important that I pass my info along as fast as possible to as many people as possible. The bracelet and card have saved me hundreds of dollars on business cards but more importantly, tons of time. Now that I'm a Brand Ambassador, I'm getting paid to help others do the same.If you have any questions, link with me:poplme .co/hash/snPgAGaT/1/s-Druski"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "idowu ojo",
          "Nb_Reviews": 2,
          "Date": "2023-07-15T00:41:18.000Z",
          "Titre": "Popl is a joy to use when meeting new…",
          "Contenu": "Popl is a joy to use when meeting new people. I’m always looking for the look of awe when I exchange information with potential clients, friends and strangers. The timely reminders help but could definitely be more detailed and arrive at an earlier date. Overall, it’s a good novelty"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cody Doss",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T16:55:15.000Z",
          "Titre": "My experience with Popl has been pretty…",
          "Contenu": "My experience with Popl has been pretty great. The ease of use and portability has made Popl a great business asset. It should come with full step by step instructions on what the person receiving your information has to do. The first couple uses weren’t super intuitive and I feel like I lost a couple people because of it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessica Hayden",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T16:53:06.000Z",
          "Titre": "Experience Using Popl",
          "Contenu": "When I started using Popl it was good for connecting customers to a clients store and social media platforms. I enjoy the inventive ways of tech devices for visual use. However, I would like to see popl update a customers social media page without us doing it."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ken   Jackson",
          "Nb_Reviews": 3,
          "Date": "2023-07-21T16:12:49.000Z",
          "Titre": "Popl makes sharing easy",
          "Contenu": "Popl makes sharing easy. I still use paper based business cards with customers of a certain generation but younger clients 'get it' with Popl."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vyn Gordon",
          "Nb_Reviews": 4,
          "Date": "2023-07-21T15:15:02.000Z",
          "Titre": "From the card to the QR code",
          "Contenu": "From the card to the QR code, this has been a fantastic experience so far…I love it. I think the monthly subscription is too high in price but that is my opinion. Besides that, I really like it!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keenya Gohston",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T20:38:09.000Z",
          "Titre": "I love popl but I have to figure out…",
          "Contenu": "I love popl but I have to figure out why my bracelet stopped working after I received my card. It hs been a very successful tool and it saves on paper cards."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dorian",
          "Nb_Reviews": 2,
          "Date": "2023-04-06T03:08:09.000Z",
          "Titre": "Customer service saves the day",
          "Contenu": "I wasn’t satisfied with the products I received. I contacted Popl, explained my dissatisfaction and they agreed to send me different products to replace the ones I was displeased with. The replacements arrived within a few days and my family and I are very pleased with them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph Catanoso",
          "Nb_Reviews": 2,
          "Date": "2022-04-08T11:59:27.000Z",
          "Titre": "Awesome marketing Tool!",
          "Contenu": "I have purchased several popl devices.   Awesome quality and the software is great.   When I share my info with people the reaction is classic!   Very easy to set up and very intuitive.  I will definitely be purchasing more."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Quincy K",
          "Nb_Reviews": 2,
          "Date": "2022-04-07T11:20:20.000Z",
          "Titre": "A great way share information",
          "Contenu": "My experience been good, this has help me share my information to a lot of contactless. People thought it was very nice seeing the breakdown of my popl page and was amaze."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Stephanie Robinson",
          "Nb_Reviews": 1,
          "Date": "2022-04-08T21:44:15.000Z",
          "Titre": "I was very excited t get my Popl…",
          "Contenu": "I was very excited t get my Popl initially. I had ordered a black flat one to be able to place directly on my phone.  It popped my phone to initiate the app.  However, it wouldn't pop the 2 Samsung phones I tried it on after setting up. Quite a deflate to the experience. I contacted Bry Campion, who was extremely helpful and quick to respond to my issue.  She indicated that if I was unable to get it to work after trying to find an Iphone to pop it with, I could get a replacement sent to me.  I waited a few days to see who I could find with an Iphone, but wasn't able to locate one. I reached out again to Bry about the replacement, she didn't seem as eager about sending out a replacement at this point, but did send one.  I did still have to pay for the shipping of the second Popl, (so it's not like this was a completely free situation for me). I received a new Popl, (flat white), and have had no issues with it.  I did place the new one on the phone case after removing the old one from the actual phone, (not sure if that made any difference in the ability to work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amari Harris",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T20:04:28.000Z",
          "Titre": "Popl is so helpful!",
          "Contenu": "Popl is so helpful!! I have a easy way to keep people interested in my business and connect to my other social medias."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patrick Comer",
          "Nb_Reviews": 2,
          "Date": "2022-05-31T22:22:30.000Z",
          "Titre": "For whatever reason has a hard time on…",
          "Contenu": "For whatever reason has a hard time on iPhone usually end up scanning the bar code. Android no problems"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jessica colgan",
          "Nb_Reviews": 2,
          "Date": "2022-04-12T15:00:57.000Z",
          "Titre": "Love to concept and ease of use with…",
          "Contenu": "Love to concept and ease of use with the Popl items.  Sometimes it is hard to get different phones to work or find the right setting to turn on to pop the data over."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kaitlyn Screws",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T18:36:05.000Z",
          "Titre": "Sometimes the keychain doesn’t work",
          "Contenu": "Sometimes the keychain doesn’t work. I wish I could popl from my phone just hovering over it. The app doesn’t do that anymore, if it does, I can’t find it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Perkigi",
          "Nb_Reviews": 2,
          "Date": "2022-05-11T12:11:15.000Z",
          "Titre": "I like how the product let you look…",
          "Contenu": "I like how the product let you look cool and modern.  It also help me to be more efficient with client follow ups."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chad Jude McLaren",
          "Nb_Reviews": 2,
          "Date": "2022-04-08T14:46:18.000Z",
          "Titre": "Awesome product!",
          "Contenu": "This is a great way to share your credentials with anyone very quickly! Awesome product!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Octavio Hernandez",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T20:24:54.000Z",
          "Titre": "It took a little bit longer than…",
          "Contenu": "It took a little bit longer than expected, but all good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris S",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T20:35:34.000Z",
          "Titre": "I love this product!",
          "Contenu": "I love this product! The interface is professional looking and easy to use. Everyone I show it to is interested in howto get one. The Popl did work much better on the outside of my phone case. At first I was afraid it might fall off, but it has held on strong for 6 months. The business / personal modes are nice, but I still haven’t been able to separate the two. That would make it 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer at Beauty on the Run",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T17:02:44.000Z",
          "Titre": "When it works it's GREAT",
          "Contenu": "When it works it's GREAT! I do have the paid membership, it's worth the money to have ALL your contact and payment info in one spot!! with that said there have been quite a few times that my popl was not coming up when someone tried scanning it but it often pops up on my phone randomly! I have a Samsung note pro placed on the bottom where I was advise to put it!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennyfer Keohane",
          "Nb_Reviews": 5,
          "Date": "2022-04-05T20:01:00.000Z",
          "Titre": "Great product when it works",
          "Contenu": "Great product when it works. Customer service could be better but it’s not the worst. I had a problem after the most recent upgrade of the app and it took over a month to get customer service to fix it. Other than that it is a great option for my customers to scan my Popl and submit payments through my information utilizing my PayPal."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alicia",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T19:36:59.000Z",
          "Titre": "Popl is great",
          "Contenu": "Popl is great! User friendly and better than business cards."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Erica Adam",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T23:53:17.000Z",
          "Titre": "I love the concept but struggle…",
          "Contenu": "I love the concept but struggle with execution. When I need it to work it doesn't always work with the other phone. New iPhones. Yes. Samsung or old iPhones- not so much. Those times I use the app and have people scan my qr code. I'm going to keep using it because I love the concept and hope usability gets better"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sarah Eickstaedt",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T18:11:27.000Z",
          "Titre": "My pools continue to struggle to pop so…",
          "Contenu": "My pools continue to struggle to pop so I don’t use that feature, but it’s an amazing digital business card. I’ll send it to clients and potential clients so they have all of my contact info, socials, booking link…when they save this and forward it, it makes a great impression with referrals!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T17:36:53.000Z",
          "Titre": "Popl is the Future",
          "Contenu": "I recently started using my Popl Wristband and I love the innovation it allows me to bring in sharing my business contact information with sales reps nationwide. My only feedback would be allowing the wristbands to be compatible with older ios and android devices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jaden Davis",
          "Nb_Reviews": 2,
          "Date": "2022-04-06T01:39:19.000Z",
          "Titre": "Great Product, A Little Too Easy to Take Off",
          "Contenu": "Absolutely loved the product, bought the popl bracelet and used it religiously. Unfortunately for me, I’m a golfer; and at some point while playing it flew off and I didn’t feel it. Great product but I think it could be a tiny bit more secure!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Burlington Bob",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T16:45:07.000Z",
          "Titre": "popl",
          "Contenu": "There are free and more expensive options for digital business cards, but popl is an inexpensive, convenient and reliable way to share your contact information with No monthly fees or commitments. Great product and proud ambassador for popl,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vanessa Perlina Lander",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T17:40:48.000Z",
          "Titre": "Popl has been very useful",
          "Contenu": "Popl has been great. You have to learn to use it with different phones but it is so convenient. You no longer have to carry business cards with you and pass items from hand to hand eliminating cross contamination issues this day in age."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Justin S",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T18:15:30.000Z",
          "Titre": "Love the concept",
          "Contenu": "Love the concept.  Was easy to set up and design what I wanted to share.  Finding that when touching against another phone, it takes a couple times before it provides the pop up.  I bought the under the case POPL so thinking it was my case, I put it on the outside and it still takes a couple tries.  This is convenient though to have instead of carrying business cards to hand out in this day and age."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronda Rigg",
          "Nb_Reviews": 1,
          "Date": "2021-05-24T19:46:26.000Z",
          "Titre": "So Easy!",
          "Contenu": "I love not having to keep business cards on hand. It’s so easy, that even those who aren’t very tech savvy can use my page with ease. I bought a keychain that my husband keeps on him for when people inquire about my massage business. My only complaint is I haven’t been able to get my Venmo link to work. Hoping the problem will resolve on it’s own over time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sarah Lewis",
          "Nb_Reviews": 1,
          "Date": "2021-05-21T06:53:04.000Z",
          "Titre": "I love how cute it is and really easy…",
          "Contenu": "I love how cute it is and really easy to set up in the app. The adhesive sucked so I had to pull out the super glue. I am definitely considering getting another for my keychain! Other than the adhesive issue which was annoying I love it and can't wait to get tapping!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rachel Cohen",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T16:49:28.000Z",
          "Titre": "We've been using Popl for a few months…",
          "Contenu": "We've been using Popl for a few months now. It came quickly, is easy to use, and easy to refer! We've been trying to \"go green\" with the business, and this is one step we've taken!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessica Zarisky",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T18:43:48.000Z",
          "Titre": "Great for small buisnesses!",
          "Contenu": "I really like these! Its easy to use, my only complaint is that i cant ever remember where to scan on android vs apple phones - but its user friendly other wise!! Definitely a really good asset to have"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ava",
          "Nb_Reviews": 1,
          "Date": "2021-06-04T21:01:31.000Z",
          "Titre": "I like the product",
          "Contenu": "I like the product. A pre made print out with all the info would be helpful for my customers to see. The app has to be open to work on newer phones. QVC code is how most people have to do it. Like I said a printable sign for my table at the shows would be helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BUFFY",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T17:28:10.000Z",
          "Titre": "I love the freedom of not having to…",
          "Contenu": "I love the freedom of not having to purchase business cards. But there are some instances where some phones or devices don't recognize the popl. Other than that, it's great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Savannah",
          "Nb_Reviews": 3,
          "Date": "2022-03-08T17:15:02.000Z",
          "Titre": "Wonderful Business!",
          "Contenu": "I feel that the concept and the affordability are amazing! The one thing I have to nit-pick about, however, is the Popl bands.Sometimes, these bands don’t connect to any phone whatsoever. They don’t bring up the URL half the time, and sometimes I have to apply pressure to the band in order for it to connect at all. I feel that they need a bit of tweaking for them to work properly.Now, the cards and the flat sticker versions on the other hand are amazing! They’re super easy to use and connect all the time! All I need to do is tap them once, and they connect right away!All in all, these products and this company are headed in a VERY strong direction! They’re super affordable, easy to use, and they don’t waste paper. I highly recommend them for every business owner, independent artist, and for social media promoters all around!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tina Smith",
          "Nb_Reviews": 2,
          "Date": "2021-06-05T00:50:10.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good. I had a little trouble getting it to work at first. I have a metal ring on the back of my phone so once I moved the Popl to the bottom of my phone away from it, it worked."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CYNTHIA",
          "Nb_Reviews": 1,
          "Date": "2021-06-04T21:22:05.000Z",
          "Titre": "I'm Popling it!",
          "Contenu": "Still learning how to use it. When I use it people say, \"ooh, that's cool.'  I feel my Christmas is going to be easy this year. Telling everybody about it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laura Smith",
          "Nb_Reviews": 1,
          "Date": "2021-05-20T14:46:22.000Z",
          "Titre": "I really like the concept",
          "Contenu": "I really like the concept. I’ve already used it a few times. But my popl sticky fell off my phone case  within one day. If that hadn’t happened it would be five stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amanda Outain",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T17:55:08.000Z",
          "Titre": "The sticker for the phone doesn’t stay…",
          "Contenu": "The sticker for the phone doesn’t stay on the phone to long and won’t attach back on. Having a hard time with popl linking to an android from an apple phone"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Brandon Brillinger",
          "Nb_Reviews": 1,
          "Date": "2021-09-01T10:25:15.000Z",
          "Titre": "Took a little longer than I expected…",
          "Contenu": "Took a little longer than I expected for delivery but I understand that mail is still an issue in certain countries. Otherwise, I love the product!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amanda Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T18:29:49.000Z",
          "Titre": "Access all in one spot",
          "Contenu": "I love having access to all my links in one place. Makes it easier to spread the word about my small business."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "austindave",
          "Nb_Reviews": 3,
          "Date": "2022-04-05T16:38:08.000Z",
          "Titre": "easy and fun",
          "Contenu": "Makes providing information to customers easy and fun.  Save on business cards, and saving money and time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Teresa Henke",
          "Nb_Reviews": 2,
          "Date": "2021-06-15T00:15:47.000Z",
          "Titre": "Works about 80% of the timw",
          "Contenu": "Some cases are too thick for Popl to work- BUT when it does- it’s amazing! I’m absolutely in love with this new technology!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer Majors",
          "Nb_Reviews": 3,
          "Date": "2021-05-12T13:56:05.000Z",
          "Titre": "Excited about using Popl",
          "Contenu": "We are excited to start using Popl to grow our store's following.  The Popl is going to make that so much easier for us!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrea Olsen",
          "Nb_Reviews": 1,
          "Date": "2021-05-21T12:34:16.000Z",
          "Titre": "I love my popl",
          "Contenu": "I love my popl!  I dont have to carry business cards, just my phone which I have with me all the time anyways! Brilliant!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "kayla irvine",
          "Nb_Reviews": 1,
          "Date": "2021-05-17T21:18:45.000Z",
          "Titre": "Not what I was expecting",
          "Contenu": "Interesting that it comes on a piece of paper and not anything else. Would have expected more packaging for what I paid"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rodney Beasley",
          "Nb_Reviews": 1,
          "Date": "2021-05-17T17:37:41.000Z",
          "Titre": "Seems good so far but a little…",
          "Contenu": "Seems good so far but a little disappointed in the difference between iPhone and Android capabilities"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Isaac Palacios",
          "Nb_Reviews": 2,
          "Date": "2021-05-12T18:08:45.000Z",
          "Titre": "The idea is really good",
          "Contenu": "The idea is really good, sometimes it works sometime does not. but overall it's good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amanda Jensen",
          "Nb_Reviews": 1,
          "Date": "2021-05-23T17:32:32.000Z",
          "Titre": "I love the popl profile",
          "Contenu": "I love the popl profile. I just haven't had a lot of success using the device yet"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 1,
          "Date": "2021-06-07T22:29:39.000Z",
          "Titre": "Great concept, room for improvement",
          "Contenu": "I think this is such a great concept, especially for small businesses. I personally purchased my Popls for in-person markets to alleviate waste from business cards. Unfortunately, people usually prefer to scan my PoplXL rather than tap. One of the frustrating things, right out of the package was my phone is not NFC compatible which prevented me from activating my phone-back Popl. If the card that it comes on had a QR code, I would have been able to activate the small Popl no problem. I was instructed to find a friends phone to activate it from, which is far from convenient. I will definitely continue to use and recommend this product to my fellow business owners, but I'm looking forward to some improvements. Pros: Super convenient once it's set up. Great concept and easy to add links to the account. Personalization is available to match your branding. Responsive customer service. Cons: not compatible on all phones, which really doesn't happen often but QR codes are helpful {but also free...} The offering of a second \"business or personal\" side to the app is awesome but charging the Pro fee is a little frustrating especially since neither side is truly \"free\". Additional features aren't worth the fee to me. Color and pattern choices are ok, but nothing really matched my style so I chose black. I'd probably get the personalized logo next time. Once again, I think this is a really cool idea. I definitely see room for improvement but I'm happy overall."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Will Worsham",
          "Nb_Reviews": 1,
          "Date": "2021-05-31T22:27:04.000Z",
          "Titre": "Slow delivery. Asked for a review before shipping.",
          "Contenu": "I did finally receive my order. Cool little gadget."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Katrina Van Zandt",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T16:40:44.000Z",
          "Titre": "Love it!",
          "Contenu": "Easy to use and great product!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aliansy Hernandez",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T16:53:21.000Z",
          "Titre": "I love it is amazing"
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "אוראל דהן",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T21:25:49.000Z",
          "Titre": "well i really like your products and…",
          "Contenu": "well i really like your products and that they come in very different things like the badge the band"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amber Bee",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T18:58:27.000Z",
          "Titre": "Popl is great!",
          "Contenu": "Popl is easy to use and a great networking tool. It was simple to upload my photo and logo onto the card"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "JC Bentley",
          "Nb_Reviews": 3,
          "Date": "2023-07-21T10:40:06.000Z",
          "Titre": "Now That I Have Popl, I’m Never Going Back to Paper Business Cards",
          "Contenu": "Popl’s digital business cards and solutions make exchanging contact information easier!! I don’t have to fumble with business cards. I have the widget on my iPhone Lock Screen which routes to my Popl QR code. I tap the widget, my new connection(s) uses their camera to scan my QR code and done! Contacts connected! I’m never going back to paper business cards again! I’ve made many new connections and they also like the technology!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Annastasia Rose Beal",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T17:16:51.000Z",
          "Titre": "I’ve used Popl for about 2 years now &…",
          "Contenu": "I’ve used Popl for about 2 years now & I quickly became & AVID supporter of Popl cards! As the Executive Director of a thriving 501(c)(3) nonprofit organization, I pass out a TON of business cards. & let’s me honest, there’s 2 types of reactions when someone hands you a business card: 1. They immediately keep it somewhere & plan to promptly reach out2. They toss it on a pocket, in their briefcase, or in a desk drawer & forget about it foreverPopl not only had saved me a few hundred bucks in the 2 years since I made the switch, but it’s allowed me to provide a TON more information to folks vs. a 3.5 by 2 inch piece of paper.Plus, the sleep designs increase my level of professionalism. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kahlia Meeks",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T15:15:47.000Z",
          "Titre": "Now That I Have Popl, I’m Never Going Back to Paper Business Cards",
          "Contenu": "Popl’s digital business cards and solutions make exchanging contact information easier!! I don’t have to fumble with business cards. I have the widget on my iPhone Lock Screen which routes to my Popl QR code. I tap the widget, my new connection(s) uses their camera to scan my QR code and done! Contacts connected! I’m never going back to paper business cards again! I’ve made many new connections and they also like the technology!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fallon King",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T21:25:01.000Z",
          "Titre": "Popl is Perfect for B2B Networking Events",
          "Contenu": "I bought Popl to help me promote my business at B2C events, but it really shines for B2B situations. When attending trade expos or meet-and-greets, it's so much more convenient to carry around one card vs a stack of paper cards. The biggest bonuses: the other person can quickly jot their info back to me, and I am saved in their contacts instead of having my physical card ending up in the wastebasket. Thank you so much, Popl!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melinda Espinal",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T17:19:45.000Z",
          "Titre": "Popl the business card of today…",
          "Contenu": "Popl is the new business card of today and the future. Easy, Convenient, Quick, DIGITAL. Linking your contacts, social media accounts, connections, websites and more. This innovation is by far one of the most brilliant and effective tool I’ve seen digitally in over a decade. Bravo Popl👏"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Desmond Patterson",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T01:28:40.000Z",
          "Titre": "The Perfect Popl",
          "Contenu": "Popl not only is a fantastic tool, it even elevates the perception of New generation Professionalism.  People are at AW!! When they see me scanning my bracelet. \"Where u get that from,\" they say. I still haven't mastered all the ammentities like airdrop etc...only problem I have is mine will pop off if I'm not careful, Men we have to much hand shaking and dappin' each other up sometimes make my band pop off. Popl is the hottest thing going and please continue to grow in ways that will help us Grow in business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Talk  TV",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T22:27:53.000Z",
          "Titre": "What a great concept",
          "Contenu": "What a great concept.  I was instantly impressed by it when I met people at a music festival using it.  I do radio coverage at music festivals, conferences, and other events. This is way better than handing out cards people don't even look at and throw away.  Easiest quickest way to share contact info that is automatically there for the person you give it to."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D. Rock",
          "Nb_Reviews": 2,
          "Date": "2023-07-14T06:14:27.000Z",
          "Titre": "The wristband is clutch!",
          "Contenu": "This is the best thing I’ve ever invested in as far as networking goes. Popl is the only digital business card witb a wristband option. I’m an event photographer and I meet a lot of people, so this helps me keep track of almost everyone I meet and allows for me to have their info for any type of marketing purposes later too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cody Burk",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T21:11:31.000Z",
          "Titre": "Efficient way to share important contact info with lots of options",
          "Contenu": "I love using Popl to quickly and conveniently share contact info. As an insurance broker, this is huge as I need to pass my info to a lot of different people. I was at a mingle with many small business owners and my Popl bracelet was not only a great ice breaker and conversation starter but allowed me to exchange contact info with a lot of potential clients."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amber Baird",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T18:15:34.000Z",
          "Titre": "I’m LOVING my experience with Popl",
          "Contenu": "I’m LOVING my experience with Popl! Every new business prospect or networking opportunity that I encounter is highly impressed with the products. If I ever forget my rope band, it’s great that I am able to use my QR widget on my phone too!I truly appreciate how easy it is to customize my digital card, as well as how much information I can include. Regular business cards don’t have the same capabilities and I am thankful Popl does!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ty Markiewicz FLXERS",
          "Nb_Reviews": 11,
          "Date": "2023-07-21T16:49:49.000Z",
          "Titre": "I’ve been falling Popl  ever since I…",
          "Contenu": "I’ve been falling Popl  ever since I came out and I’m blessed to be an ambassador with them. They do so much for you and to be able to work with them is absolutely amazing they give you benefits sometimes we get rewarded and their products are top-notch. Pool really has the best digital business cards, and the best features for them in the market"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Kévin",
          "Nb_Reviews": 2,
          "Date": "2023-07-21T19:04:37.000Z",
          "Titre": "Happy Popl User",
          "Contenu": "I’m a user registered on Popl for more than a year, that’s an incredible way of getting free of common business cards. No needs of a specific card wallet, shareable easily, nice UI, try it you’ll love it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WalkLove",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T15:55:15.000Z",
          "Titre": "I LOVE Popl!!!",
          "Contenu": "I LOVE Popl! I’m a professor tattoo artist so with the ever rising popularity of tattoos, everyone I meet is a potential client. Popl makes it quick, easy and super cool to get all of my contact info into the phones of these potential clients. First they are amazed by the method then they are wowed by my work! Thank you Popl for making a fun, highly effective way for me to market myself!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emerald L",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T17:24:40.000Z",
          "Titre": "Love using Popl for networking",
          "Contenu": "Love using Popl for networking! It helps me streamline connections and be safe in not carrying potentially germ laden cards:) One small deduction point is the digital cards don’t necessarily work if it’s not an iPhone with mag safe. Looking forward to new iterations!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LBEsthetics",
          "Nb_Reviews": 2,
          "Date": "2023-07-21T18:49:06.000Z",
          "Titre": "As a small business owner",
          "Contenu": "As a small business owner in the beauty space, popl is worth so much more than anything even remotely comparable. First of all, nys threw a curveball at all of us this year by narrowing our scope of practice, but my popl landing page was easy to change on the fly and my paper cards i do carry all have only my name and popl QR which meant when i needed to update everything i could do it seemlessly without having to retract or reorder. Infact, i will be moving spaces come October, and im not worried bc everything will update easily via popl. Cant say enough good things. Oh, and if you have multiple businesses? Thats fine, you can decide which popl profile to share with who! It literally couldnt be any easier or make more sense."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Channa Collins",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T19:12:55.000Z",
          "Titre": "Popl Me @ChannaCollinsRealtor",
          "Contenu": "Popl Me! I have used my Popl, for the last year, networking and for capturing clients information. As a Green Realtor  I haven't ordered business cards in 7 years. I added a couple Zaps and my New Contacts are added to my contacts and my CRM. Added bonus it is usually is a conversation point. The magsafe popl is too heavy I love my lanyard and of course the lock screen widget is awesome!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Gibson",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T17:55:13.000Z",
          "Titre": "No paper cards",
          "Contenu": "The best part is not having to keep up with paper business cards anymore. Also the person receiving the digital business card isn’t required to have an app downloaded?! GAME CHANGER!! Fantastic product and fantastic service!! Thank you so much!!"
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "Antoinette Daniels",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T16:35:51.000Z",
          "Titre": "My first and only digital card",
          "Contenu": "My first and only digital card. Not only does this sleek card gives you that untouchable professional look, it adds so much value to your business when you're networking. The customer service has been excellent and the add on gadgets are really cool"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chelsea Yeatts",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T16:02:55.000Z",
          "Titre": "Your business cannot afford to NOT have Popl!",
          "Contenu": "Keeping physcial business cards has always been a pain point for me.  I love Popl because that eliminates the need for it, saving me money in my business.  Also, people tend to lose these cards and don't reach back out, but with them being able to add me right in their phone it keeps my business available at the touch of a button.  It shows I am legit business with links to all the major platforms they would look at to review my business as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly Martin",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T20:34:02.000Z",
          "Titre": "Nothing but praise!!",
          "Contenu": "Nothing but praise!!!  This is definitely the way to go!  Connecting is so much easier with Popl!  I have had so many amazing experiences sharing with Popl and clients are so impressed!  I have a photography business and shoot lots of huge events….instead of wasting business cards I’m making connections!  THANK YOU POPL!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Genesis J Lopez",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T15:45:58.000Z",
          "Titre": "Networking has not ever been so seamless and eye-catching.",
          "Contenu": "Not only is it innovative and convenient, it is also a conversation starter that opens up more opportunity to talk to potential prospects. There are a few products on the market similar to Popl’s, but realistically there’s nothing like like its brand. The user interface is super simple to navigate with so many options and upgrades that are worth the purchase. My wristband is what I primarily use. I don’t leave the house without it on my wrist. Not only does it look fashionable, it speaks volumes when people are wowed and amazed at how you touched their phone with your wrist band and now your information is in their phone. This company is awesome. Thank you Popl. ❤️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tamera",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T08:28:29.000Z",
          "Titre": "Love how easy to use this is !",
          "Contenu": "Love how easy to use this is, it's been great for networking for both my primary and secondary businesses as its easy to toggle between virtual cards. I use the virtual wallet to show my QR code most of the time but also carry the plastic card with me when I don't have my phone ready."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrice P",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T17:52:49.000Z",
          "Titre": "Cheaper alternative to Dot!!",
          "Contenu": "Regardless if you’re an entrepreneur, student, employee, enterprise or what not.. Popl gives you the best opportunity to share all your information in a very simple way & I love that. The app is also super convenient to set up as well! I love all of the networking features that come with Popl and it just makes my life easier! :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paige Burdette",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T03:11:54.000Z",
          "Titre": "I'm SO IMPRESSED",
          "Contenu": "I'm the Founder of perriskin.com. I am SO IMPRESSED with Popl. They have AMAZING customer service! It's 8pm CST and they called me to help me setup my new account. Not to mention, I bought a QR code card and it was incredibly affordable (less than $15) WITH a warranty. I was able to download my personalized QR code as a PDF to give to my graphic designer to put on my Perri Skin brochures... all this without a monthly fee (I opted out of putting my logo in the center of the card). I had to update my information on my laptop, but it was easy peasy to do so. I'd recommend Popl to anyone! Great customer serviceEasy to useAffordable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lillyana Castile",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T19:28:06.000Z",
          "Titre": "The solution to your marketing issues",
          "Contenu": "Popl is a godsend in terms of all that they offer. They have a user friendly app that lets you change your shared info at any time (So easy my grandmother can do it without assistance), a wonderful customer support system, customizable options to give your cards a more personal feel, they're competitively priced, and have saved me and earned me so much money it's unreal. I'm not paying for disposable cards that people are going to lose or toss out anymore, or realizing I'm out of cards when conversing with a possible client. Instead, my info can be scanned onto and saved on their phone. I recommend this product to anyone with a business, shop, or a cause they'd like to bring attention to. The investment is tiny, but the possible return is massive"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sephronia Bravo",
          "Nb_Reviews": 4,
          "Date": "2023-07-13T16:35:18.000Z",
          "Titre": "It's an investment that keeps giving",
          "Contenu": "I've used popl for more than 4 years now. It's never let me down because sometimes jumping in a cab in New York City happened so quickly. You interact with people all day long and who knew a swipe or phone could make everything so much simpler!? I would suggest for you to get popl because it is a great networking tool. It saves you time money and is effective and efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Friedlander",
          "Nb_Reviews": 2,
          "Date": "2023-07-13T16:32:44.000Z",
          "Titre": "Since I started using Popl I no longer need to print business cards",
          "Contenu": "Since I started using Popl, I no longer need to print business cards and have the freedom to link my social media accounts and LinkedIn Profile. With Popl I can quickly capture potential leads which is a real asset. What a great business tool!"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Gerardo Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T21:55:48.000Z",
          "Titre": "Popl has made me feel that my company…",
          "Contenu": "Popl has made me feel that my company is up to date, the automation feels great like you are being introduced by someone literally, and adds a warm touch to the process. I feel like I haven't gotten a grasp of everything we can do with it and we are already getting benefits. Way to go!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bre'Aunna Parnell",
          "Nb_Reviews": 1,
          "Date": "2022-04-09T00:52:44.000Z",
          "Titre": "Popl Is A Game Changer!!",
          "Contenu": "I've Had My Popl Pop Back On My Phone For Several Months. Net-Working With Supportive Strangers, Entrepreneurs And Business Owners Has Never Been Easier! Throw Away Your Business Cards & Make The Network Switch Over To Popl. So Many Dope Gagdets To Choose From And You Can Customize Them!Hands Down An Amazing Company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle Jensen",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T10:49:04.000Z",
          "Titre": "BEST NETWORKING TOOL OUT THERE!!",
          "Contenu": "I was looking for a way to go out an network/recruit to fill the open positions within my center that would save me time and appeal to the younger generations that are coming into the work field. I came across Popl that instantly caught my eye. The app was user friendly, the “cards” were simple and easy to add your information too and overall, looks extremely professional. After using the free trial of Popl Pro, I had to buy the yearly subscription. I had so much success not only filling my centers 3 locations from bare minimum to fully staffed within 3 months, I was able to help fill the surrounding locations as well. Now, EVERYTIME we hire a new leader, I gift them with a Popl so they can have the same success I have had time and time again making sure we have the right people staffed at all times!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Autumn Wright",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T18:14:19.000Z",
          "Titre": "Professional",
          "Contenu": "I was really excited to finally receive my buisness cards. So many people have never seen a card like this before and they are so fascinated by it that they ask me a ton of questions. I love the customization of my cards so that my clients can get a real feel for who I am and they can easily access all of my links without having to type it all out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tammy P",
          "Nb_Reviews": 3,
          "Date": "2023-07-13T16:27:42.000Z",
          "Titre": "Game Changer",
          "Contenu": "Using Popl has been a game changer for me, I previously had to carry multiple cards for the different roles I hold in my industry.  Having one code on my phone that people can scan and immediately add me to Contacts is AMAZING!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heidy Miranda",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T15:16:46.000Z",
          "Titre": "Amazing Business/Personal Card",
          "Contenu": "Popl is an amazing digital card that has been really helping my real estate business. It looks great, is so easy to use and love that you can easily customize them. It even has a lead generatiom form that you can have automatically pop up (if not it will pop up after)! It's like they thought of everything. I highly recommend them to everyone. Everyone should have one even if you don't have a business. It's so easy to share your contact and awesome that they can save your picture and info right away so they don't forget. So efficient, saves so much time and works so well! So glad I discovered them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melinda Espinal",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T04:57:08.000Z",
          "Titre": "The conscience and easiness of the app",
          "Contenu": "The conscience and easiness of the app. The wonderful staff and quick response of your support team. Overall the innovation of the app and brilliance to have a business card so easily accessible was beautiful. I would give Popl overall a 10/10. Bravo! Stunning Creation and contribution to the business world."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Friedlander",
          "Nb_Reviews": 2,
          "Date": "2023-07-21T15:53:09.000Z",
          "Titre": "Popl has really changed the way I share and network",
          "Contenu": "Popl has really changed the way I share my contact information when I attend networking events. Now when I do Zoom Meetings I used the Popl Virtual Creator to create and display my Popl QR code to capture emails - a great tool and now no more purchasing of business cards!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria L Young",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T22:03:39.000Z",
          "Titre": "Simple. Easy. Effective. Affordable.",
          "Contenu": "This is a great tool for anyone who is networking. We use our phones literally all the time and with Popl you can share your info and collect others info in a simple click or pop! Popl has allowed my business to grow exponentially!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Cohv",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T19:16:57.000Z",
          "Titre": "You Will Never Go Back to a Paper Card",
          "Contenu": "Popl Co's digital business card app is really useful. Once you start using it, you never want to go back to a paper business card. I even upgraded from Popl Co's useful free app to the company's powerful Pro+ app."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 6,
          "Date": "2023-07-14T16:29:51.000Z",
          "Titre": "My popl is great",
          "Contenu": "My popl is great.  It's so cool to go to events and easily exchange information on the go.  And, I get the prospects info too.   Everyone is really impressed. One feature I would like is a note that we can easily add right away so I can easily remember who the person is. I just got back from one and am confusing myself who everyone is."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "G. W. Tabbi Dorsey",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T15:17:23.000Z",
          "Titre": "I love Popl",
          "Contenu": "I love Popl! It is the easiest most efficient way to share information. In a world where everyone is needing to network, keep in touch and build effective business relationships, Popl is perfect and unmatched. Sharing contact information and even acquiring contacts takes less time than any other communication medium available. The price makes this technology perfect for new and upcoming businesses and business owners. Nothing compares to Popl. I never leave home without my bracelet!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose Aviles",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T15:28:07.000Z",
          "Titre": "Very",
          "Contenu": "Very, very good, it satisfies the need of a business card without having to carry a bunch of cards around in a case or wallet. Very intuitive app with amazing UI that makes it easier to use. So far I'm loving it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan White",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T18:36:53.000Z",
          "Titre": "Goodbye Business Cards",
          "Contenu": "You’ll never need to carry business cards ever again! Personally, I love the digital card, but there are so many great solutions! Maybe put a sticky popl on the back of your phone, maybe wear a lanyard, maybe get a keychain, there are so many options! Get one, you won’t regret it. :-)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T15:36:30.000Z",
          "Titre": "Popl is absolutely amazing",
          "Contenu": "Popl is absolutely amazing! It has made networking and growing my business so much easier and stress free. I recommend it to anyone whether it’s for personal use or for business.  100% best investment!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michele with Meritus",
          "Nb_Reviews": 1,
          "Date": "2022-04-08T17:02:40.000Z",
          "Titre": "HIGHLY recommend for busy professionals!!",
          "Contenu": "I received my Popl wrist band a couple days ago and already LOVE it! The design is comfortable and light weight and the material is way softer than I anticipated. Ease of using it as a resource to share contact information about my business is AMAZING! This is so much simpler than carrying around a stack of business cards!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BK",
          "Nb_Reviews": 11,
          "Date": "2023-06-21T21:00:22.000Z",
          "Titre": "Best solution on the market",
          "Contenu": "The popl solution was the best after a lengthy evaluation of their competitors. The devices they offer their NFC tech on for generics is definitely the most sleek of all the competitors also. Their prices are keen and their interface is solid. Finally the responsiveness of their service team is exceptional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Foulon",
          "Nb_Reviews": 2,
          "Date": "2023-07-15T00:21:41.000Z",
          "Titre": "I love using Popl as a booking home…",
          "Contenu": "I love using Popl as a booking home page for people I am connecting with, as well as a quick way to change what information I am providing them. I love the feature of collecting information first vs just sharing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mimi Kottmeier",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T20:03:38.000Z",
          "Titre": "I love my Popl!",
          "Contenu": "I love my Popl!I haven't used traditional cards since trying Popl a couple of years ago. I love that I can change my info as often as I like without  having to order anything new. They are especially great for networking at trade shows or vendor fairs. No more finding your business cards on the ground or seeing them in the trash at the end of an event. I have the keychain and a popl on my phone."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Alvin John Albay",
          "Nb_Reviews": 1,
          "Date": "2022-04-10T00:47:15.000Z",
          "Titre": "This is a game changer for my business…",
          "Contenu": "This is a game changer for my business as a content creator for Real Estate Agents. It's so much easier for me to connect with agents on the go especially on times they're asking for my business card and I just get them to tap my popl and they are already impressed with the innovative approach on connecting. Thanks popl! Keep creating amazing products!"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Rezwin Farhan",
          "Nb_Reviews": 2,
          "Date": "2023-07-21T15:41:42.000Z",
          "Titre": "The innovation of POPL made my work…",
          "Contenu": "The innovation of POPL made my work life and networking more easier. Carrying business card is always a hassle. Sometimes i run out of business card. But with POPL it has made more accessible to use and carry"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monty Wiradilaga",
          "Nb_Reviews": 2,
          "Date": "2023-07-13T17:19:40.000Z",
          "Titre": "Vital!",
          "Contenu": "As a social media influencer, Popl’s a vital part of my networking game!  I always have the card connected to the back of my phone, because you never know who you’re going to meet!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gaby Luna",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T17:42:26.000Z",
          "Titre": "Save money and impress your clients",
          "Contenu": "I bought these to avoid the costs of having to get business cards all the time. I haven't found another option that is as seamless as Popl. I have purchased it for my dad's tile business and my new notary services. It's been amazing for a small business owner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "That One",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T06:51:57.000Z",
          "Titre": "The New Age of Business Cards",
          "Contenu": "I randomly saw an ad through Instagram about Popl and I have been skeptical about it but I finally bought one this last December 2021. Honestly, this has been the best purchase that I bought because it easily provides my social media profiles as well as my contact information to new people that I met. This is such a great marketing tools for business and I wish people will soon ditch those business cards and upgrade it by getting any Popl items"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chef Monica",
          "Nb_Reviews": 2,
          "Date": "2022-05-01T18:18:10.000Z",
          "Titre": "Popl stacked my Campaign!",
          "Contenu": "I am an excited, small woman owned company business, starting life over in my 50’s. Popl has helped me to keep to “Go-Green”, become more efficient and look cool💥 with marketing my brand on the go. Everyone is impressed and getting me connected IS EFFORTLESS!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Sculpted Body Company",
          "Nb_Reviews": 1,
          "Date": "2022-04-14T06:51:03.000Z",
          "Titre": "Popl is genius!!",
          "Contenu": "Popl is genius! What a great way to share your information to potential clients or customers. Not to mention save the cost of business cards.The only complaint I have is contacts do not HAVE to fill out their information, they have the ability to bypass it. Defeats the purpose if you are trying to collect contacts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Random The Engineer",
          "Nb_Reviews": 1,
          "Date": "2022-04-15T23:16:41.000Z",
          "Titre": "Best conversation starter!",
          "Contenu": "The Popl wristband is such an awesome way to get to talk to people, such a conversation starter which is the best way to network! I’ve recommended this to all my friends & clients. i’m always on the go & out networking with others to grow my business so this popl wristband helps out so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fredrick Crump",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T17:43:41.000Z",
          "Titre": "My Popl really changed the game for me…",
          "Contenu": "My Popl really changed the game for me as a horseman and being on the mounted unit in Tarrant county, it makes it easy for me to connect and share my contact info from the side of my horse instead of fumbling with cards  or trying to hear and Type a number. Just tap and go."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kendrea Thorne",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T10:46:53.000Z",
          "Titre": "A must have for business owners!!!",
          "Contenu": "As a business owner with multi platform this popl is very convenient. When speaking with a potential client I just ask for their phone, tap my popl to their device and all my information is there and ready to be saved. I've even purchased some for my other business friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victor Castillo",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T17:40:49.000Z",
          "Titre": "Person to person VIP experience",
          "Contenu": "The best way to share person to person your contact information with people you can trust. The best part of Popl is the \"Wow\" when people see the fast interaction of the Tapping card.Thanks Popl !!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken",
          "Nb_Reviews": 5,
          "Date": "2022-06-01T05:00:12.000Z",
          "Titre": "I am hooked on these things",
          "Contenu": "I have ordered a couple custom Popls over the past couple months, and one standard.  The customs take longer than expected to deliver, but they are worth the wait.  I'm hooked on a really neat product and great services to back it up.  Popl business cards are a convenient way to exchange contact information, and they are a conversation starter to boot!  Perfect for anyone in a tech industry or anyone who doesn't want to carry around paper cards all the time even though they may run into a potential contact unexpectedly.I signed up for their referral program not because I want to promote another gimmick, but because I wholly believe in the value of what this company is doing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn Oxnard",
          "Nb_Reviews": 4,
          "Date": "2023-07-21T15:13:38.000Z",
          "Titre": "This is a lifesaver!",
          "Contenu": "This is a lifesaver! I'm an Inside Sales Rep by day & a Baker with my own business at night & on the weekends. Instead of handing out a bunch of business cards, I use Popl. It's the perfect way to share my info & help save the planet at the same time!!! Maybe it'll start a trend with my customers from both sides 😉"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KWHammes",
          "Nb_Reviews": 2,
          "Date": "2022-04-09T18:30:41.000Z",
          "Titre": "Best Contactless Business Card!",
          "Contenu": "With all the worry these days about spreading illnesses, I love that I now have a great way to exchange business card type info with a tap of a phone. I used to spend hundreds of dollars on business cards, and if any info happened to change, I was out that money and needed to order more. Now with Popl, all I need to do is update the information on my profile, and it is set to go! It is that easy, and it is also a great conversation starter.If you are someone who exchanges contact info regularly, I highly recommend checking out what Popl has to offer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesse Riggs",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T17:15:35.000Z",
          "Titre": "Sharing my Biz info just got 1,000% easier!",
          "Contenu": "Popl has to be one of the coolest ways for me to share my business information! With several links tethered to my account, as well as my personal Popl devices, where share my info just got 1 million times faster and easier! By far one of the best investments I’ve made for my business!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Channing Dippel",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T10:51:49.000Z",
          "Titre": "5-Star Support and Customer Service",
          "Contenu": "Popl has been an amazing company to work with! I was deciding between Popl and another competitor and I am SO glad I went with Popl for my digital business cards - not only is their SaaS integration is second to none, but so is their customer service and support! Any time I have had trouble, they've been easy to get ahold of and so quick to respond. When needed, they've set up ZOOM meetings and tutorials with REAL people! I could not be happier with the support I have received. Thank you, Popl!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Colter",
          "Nb_Reviews": 2,
          "Date": "2022-04-11T03:32:02.000Z",
          "Titre": "A game changer",
          "Contenu": "Popl is amazing for quickly and efficently directing people to any of our socials or payment methods. its so nice to not have to scramble trying to locate business cards and instead tapping my phone to theirs and instantly opening all of our contact info"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cat Parker Photography",
          "Nb_Reviews": 4,
          "Date": "2022-04-12T18:57:03.000Z",
          "Titre": "I love the creation of the instant…",
          "Contenu": "I love the creation of the instant business card. Popl has set the standard for sharing your information without spending a ton of money where others throw your card away. You can share your contact data quickly and discreetly if needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Husky Coaching Services",
          "Nb_Reviews": 2,
          "Date": "2022-04-12T13:40:18.000Z",
          "Titre": "I absolutely love Popl",
          "Contenu": "I absolutely love Popl. This is a transformative idea to eliminate business cards and has more control over updated information being available to clients, friends, family, and more. As mobile as everyone is today in society and people wanting to carry the least amount of stuff possible....popl is perfect solution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Howell",
          "Nb_Reviews": 2,
          "Date": "2023-07-23T18:00:38.000Z",
          "Titre": "I just “POPPED” a new client!!",
          "Contenu": "Popl has made my life so much easier. I’m a busy photographer and whenever I’m out in the field photographing a family, a portrait or a wedding, without fail someone always comes up to me for a business card. I always say, “Do you have your phone on you?” (and of course they do) so I simply place my Popl phone card on their phone and “POP” they get all of my info. Info includes my phone number, website, Instagram and even how to pay me. It’s so simple!! I was literally spending hundreds on business cards before and when people used to ask me for cards it took a cool minute to shuffle through my bag to get them a card. It was so annoying. Now, I just take my phone out and I have everything I need in a second. New clients are easier for me to acquire these days thanks to my Popl Phone Card."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Cooper",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T20:17:58.000Z",
          "Titre": "PopL saved me HUNDRED$$$ YEARLY",
          "Contenu": "PopL has helped me TREMENDOUSLY; not to mention that it saved me hundreds of dollars per year on buying business cars (& 99% of them get misplaced).By using PopL, I retain the prospects contact information quickly & efficiently.  Kudos to the creators of this ingenious idea"
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Abed AlRahim Ghalayini",
          "Nb_Reviews": 2,
          "Date": "2022-04-12T09:36:20.000Z",
          "Titre": "Magical technology",
          "Contenu": "Hi, i became familiar with Popl 1 year ago, and it was a magical idea about contacting people via digital bracelet or card in no time making it the easiest way to deal with people.That was one of the biggest advantages i have ever seen.On the other-side what i have experienced as a disadvantage, is stealing the information on the card or the bracelet is so easy, which i had faced that incident unfortunately with a friend who visited my place 6 months ago.In conclusion, i wish this enormous technology to keep evolving into perfection. Thank you in advance, & I wish all Popl team the best.Abed Ghalayini"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chasity Lynn",
          "Nb_Reviews": 3,
          "Date": "2023-07-13T19:13:24.000Z",
          "Titre": "Used Pop’l for the ease and convenience…",
          "Contenu": "Used Pop’l for the ease and convenience it has. I hate being weighed down carrying business cards. This was so easy and integrated everything into one spot."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tameca Coleman",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T18:54:15.000Z",
          "Titre": "Very Excited Popl Newbie",
          "Contenu": "From the moment I saw a Popl, I was determined to get one. I didn't quite understand how it worked but, once I watched a video I came across while scrolling my social media, I knew I had to have one. Lucky for me, my birthday was in that same week and it was ordered as a gift. I selected a custom Popl  XL and, I am very pleased. I am so happy with this purchase that I immediately set up my Pro account. I feel so much more professional and efficient with my business information."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Blotsky",
          "Nb_Reviews": 2,
          "Date": "2023-07-13T17:51:48.000Z",
          "Titre": "Made networking easy!",
          "Contenu": "My Popl digital business card made connecting with new colleagues at conferences absolutely seamless.  It also felt more \"fluid\" and conversational than having to exchange physical cards. And I love that I can turn specific contact pieces off/on depending on the type of event I'm attending."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Puneet Chadha",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T15:23:34.000Z",
          "Titre": "Super easy to use and seamless tech",
          "Contenu": "Super easy to use and seamless interface - both physical and software components. Everyone please BUY THIS DEVICE and change your life :D"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "YOLIHAIRKUTZ The Channel",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T17:01:56.000Z",
          "Titre": "I like the product",
          "Contenu": "I like the product. i love how they have an app where you can update and manage your card. You can have multiple cards as well. There’s so many options and collaborations that makes it endless. One thing I would like is if they made the circle tag bigger."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alejandra Parsons",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T16:36:26.000Z",
          "Titre": "Makes networking a breeze",
          "Contenu": "Makes networking a breeze! All my business is handles on poppl including my sites and contact info. People are always so impressed when they tap and everything is there for them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Creighton Spies EA",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T17:30:56.000Z",
          "Titre": "Easy Process and Custom options",
          "Contenu": "Nice product and understanding when it came to a replace."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jakievious Phillips",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T17:55:43.000Z",
          "Titre": "The epitome of networking",
          "Contenu": "Popl is the epitome of enhancement within the networking industry. In today's time where the environment has made some extra sensitive on cleanliness even while trying to still network or share basic personal info, Popl slipped out of heaven and made things graceful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Barnett",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T07:53:33.000Z",
          "Titre": "POPL has helped Barnett Pro Care…",
          "Contenu": "POPL has helped Barnett Pro Care measure trends from the dashboard insights. The flexibility of being to adjust the business is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edgar Chavez",
          "Nb_Reviews": 3,
          "Date": "2023-07-13T22:58:45.000Z",
          "Titre": "Surprisingly great!",
          "Contenu": "When I found about popl I was a bit skeptical since I thought it would be a similar experience as just having a links page but it turned out to prove me completely wrong! The card is one of my most handy items on my photographer profession, I can share my details with potential new clients with no effort and I still look professional doing so."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leon Gomez",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T15:37:42.000Z",
          "Titre": "Popl has become an essential tool for…",
          "Contenu": "Popl has become an essential tool for my business. As an entrepreneur that runs several companies, the integration that Popl has built allows me to network & do business that can be tracked, 24/7 and from anywhere that I’m at."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carina Morris",
          "Nb_Reviews": 2,
          "Date": "2023-07-15T23:52:55.000Z",
          "Titre": "I love popl!",
          "Contenu": "I love popl! I currently have a card and a band. I LOVE the band and wear it whenever I am out. It's comfortable and easy for me to share my business information with people I meet. Everything arrived quickly, and the set-up process was easy. I can customize my card exactly how I want, generate leads, and more! If you're on the fence about getting products from popl, just do it! You'll be so glad you did."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chas Frick",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T03:12:19.000Z",
          "Titre": "Great tool to grow your brand!",
          "Contenu": "We are still in the early stages of growing our brand. We happened to stop by our favorite offroad park Gulches in Waterloo SC and the folks running it had a few Popls to help grow their brand. We loved the ease of using it and ordered some for ourselves. We have to say they have been fantastic for networking with folks! We have one of the cards and two of the bracelets and they both work fantastic. Thanks for the great networking tool!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexandra Cohen",
          "Nb_Reviews": 1,
          "Date": "2022-04-08T22:38:06.000Z",
          "Titre": "Popl is a revolution",
          "Contenu": "Popl has revolutionized the way I network! Having a digital business card makes connecting with new contacts so much easier, and much more fun than collecting a ton of business cards. It's a cool, useful technology, and I'm excited to tell all my connections about it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Devyn Adams",
          "Nb_Reviews": 1,
          "Date": "2022-04-10T21:51:02.000Z",
          "Titre": "Popl isn’t just for business!",
          "Contenu": "Popl isn’t just for business, I love using my Popl when I meet new friends! It’s so easy to share my socials and contact information to stay connected to people I meet. Highly recommend for business & fun!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "StYles",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T14:37:59.000Z",
          "Titre": "Get it, got it, good!",
          "Contenu": "I have just became a user of Popl and this card is radical. I use it and show it off. It’s so much easier when I am networking to pull this card out and tap, the asking for a text for a reminder or putting in a new contact.The subject then changes about the card instead of my business. I’m a ambassador sooooo,  but then I circle back."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sammy L.",
          "Nb_Reviews": 1,
          "Date": "2022-04-09T05:33:18.000Z",
          "Titre": "A revolutionary way to connect with your customers!",
          "Contenu": "Onboarding and using Popl has been a great experience! As a small business, I have been continuously finding ways of making the most out of this digital business card, which now acts as many things and has led to a more streamlined lead capturing process, as well as a platform to engage customers and promote other business-related opportunities. I highly recommend people to use this app and technology, and use code WANDERLUST to get some perks when signing up or purchasing your own Popls! Cheers!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrice Hall",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T16:17:35.000Z",
          "Titre": "Popl game changer!!",
          "Contenu": "Popl digital business cards are amazing! No more fumbling for the paper cards. I just whip out my keychain, connections scan it and we're good to go!! Total game changer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tiffany Dorsey",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T16:08:29.000Z",
          "Titre": "Using Popl is so amazing",
          "Contenu": "Using Popl is so amazing.  Being that my phone is always with me I can let a potential customer scan my popl and have all of my info in less than a second."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Tyler Keddy",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T17:04:15.000Z",
          "Titre": "I love pool so have use it on my…",
          "Contenu": "I love pool so have use it on my business. However I'm disappointed how the band watch I got from them aren't secured on my waistband and I wanna order but not waste money. Still love the app."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bradley Heath",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T21:08:46.000Z",
          "Titre": "Love popl",
          "Contenu": "One of the best opportunities and gateway in my everyday life. Best product for the new day age techy! Love the simplicity for sharing data."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "anabelle",
          "Nb_Reviews": 1,
          "Date": "2022-04-27T21:02:18.133Z",
          "Titre": "Popl is an amazing tool!",
          "Contenu": "Popl is an amazing tool! I love that I can be anywhere and be able to give a potential client my information right on the spot. I don't have to worry about them losing the card, they automatically have it on their phone. What an amazing invention!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Palladium Title",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T19:51:56.000Z",
          "Titre": "BY FAR THE BEST DIGITAL BUSINESS CARD PLATFORM",
          "Contenu": "For anyone looking for a digital business card and an impressive way to network, I would highly recommend checking out Popl.co. I looked at several alternatives and this is by far the best option. The design, integrations, and customer service are next level."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Suzanna Powell",
          "Nb_Reviews": 1,
          "Date": "2022-04-08T18:10:22.000Z",
          "Titre": "Love my Popl!!!",
          "Contenu": "I love the fact that I am able to change my information as the need arises without the expense of printing new cards.   Professional looking card and transfer of info is so easy!  Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Santa C",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T00:44:11.000Z",
          "Titre": "Very Unobtrusive",
          "Contenu": "Very UnobtrusiveAs a Professional Real Bearded Santa no one should ever see Santa handing out business cards. Wearing the Popl bracelet under my white gloves allow me to remain professional and capture new business opportunities at the same time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "April",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T00:53:46.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "I made some mistakes when I ordered and they were taken care of in an easy and efficient manner.When my item did not arrive as ordered the issue was addressed right away."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angel Quintana",
          "Nb_Reviews": 1,
          "Date": "2022-04-15T07:42:32.000Z",
          "Titre": "I absolutely love Popl!!",
          "Contenu": "I absolutely love Popl, I use it at every social event i go to when I want to network with others. I think its such a quick and easy way to connect with people and to grow your engagement on your links!"
        },
        {
          "Note": 5,
          "Lieu": "DO",
          "Pseudo": "Rocío D Oleo",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T14:19:47.000Z",
          "Titre": "Great solution for entrepreneurs",
          "Contenu": "Great solution for entrepreneurs! This has made networking so much easier for me. Setting it up was fairly quick and easy! Love it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JemiQui",
          "Nb_Reviews": 1,
          "Date": "2022-04-15T18:22:32.000Z",
          "Titre": "Smooth and easy experience",
          "Contenu": "I ordered a few popls and have been very please with just how easy everything has been. Their website is great, their customer support is great, and setting up your account is really great! I love that all my contact and social media info is now so easy to share!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JAZMIN RIVERA",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T21:16:01.000Z",
          "Titre": "I ordered a custom Popl for my…",
          "Contenu": "I ordered a custom Popl for my photobooth business. It has greatly enhanced traffic to my social media pages and makes it so easy at events to just have them scan and go! No need for small talk or wasting time spelling anything out! Love anything that saves me time!!"
        }
      ]
    }
  ]
}