{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "power.tenergy.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tracy Andrus",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T11:58:38.000Z",
          "Titre": "I have not received my batteries yet",
          "Contenu": "I have not received my batteries yet. They said they were delivered on the ninth"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T23:01:25.000Z",
          "Titre": "Not sure any humans actually work here",
          "Contenu": "After placing my order, a coworker asked me to make a change to it. I had only placed it hours before, so I did not think it would be an issue. There was no clear way on the website to make an alteration to the order. No big deal, I'll just call them on the phone and explain the situation.... For the rest of the day and the following day I attempted to get in touch with someone who worked there, calling multiple times, but was always kicked to voicemail. I did receive the product quickly, so they at least deserve the one star for that, but zero customer service, will not order from them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JJ Lopez",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T23:41:49.000Z",
          "Titre": "I ordered a battery for my flashlight…",
          "Contenu": "I ordered a battery for my flashlight and was sent the incorrect battery…I emailed your Company and they will not do a refund…battery was only over 5$. They are saying it was my fault for the incorrect battery ordered…if I return it would cost me more on shipping that the battery itself. This is rediculas on there part."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Watson",
          "Nb_Reviews": 3,
          "Date": "2023-10-24T00:40:50.000Z",
          "Titre": "I placed my order on the 17th and now…",
          "Contenu": "I placed my order on the 17th and now it's  23 rd and still no batteries. Why send USPS. They are the worst and ups is the best. if I don't receive them tomorrow I shall cancel the order.I should have ordered from Amazon,I would have had the batteries days ago.Jim Watson"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Allen",
          "Nb_Reviews": 2,
          "Date": "2023-03-02T03:24:19.000Z",
          "Titre": "You sent me the wrong batteries.",
          "Contenu": "You sent different batteries than I ordered.I ordered Tenergy NiCd Sub C 2200mAh 1.2V Paper Wrapped Rechargeable Battery (Flat Top) with tabs.I received Tenergy ICR18650-2600 3.7V 2600MAH 9.6/wh. These are too long and wrong voltage for my application.  The only thing right was the tabs. Delivery was on time.  These won't fit my application.Order # 156627, SKU 20305-1"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Stone",
          "Nb_Reviews": 2,
          "Date": "2022-12-14T05:40:52.000Z",
          "Titre": "Rate me without a product",
          "Contenu": "Do you want me to rate you I never received the product yet you should least check to make sure that it’s been sent out before you asked somebody to give you a rating? the reason you got one star is because you’re not checking to see if your product even got to its destination you could let me know when you sent it out that will get you two stars"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ronald wagner",
          "Nb_Reviews": 2,
          "Date": "2022-11-29T18:00:53.000Z",
          "Titre": "The item I ordered has free shipping…",
          "Contenu": "The item I ordered has free shipping when I added 2button battery cards and went to shipping I found shipping charges were added, I tried 3 times to get free shipping on my entire order when additional shipping was added I cancelled the additional items. So we both lost out. This was the black friday deal. Thank you Ron Wagner"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Kvochick",
          "Nb_Reviews": 3,
          "Date": "2023-06-01T11:35:55.000Z",
          "Titre": "20 dollars shipping for 2 little…",
          "Contenu": "20 dollars shipping for 2 little cables? If I could have found another source I would have. Based on this horrible experience never again and no positive referral. Thanks for gouging America!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "D J",
          "Nb_Reviews": 1,
          "Date": "2022-08-12T20:22:46.000Z",
          "Titre": "The tracking app is a Joke !",
          "Contenu": "I used your tracking app and once it arrived at a UPS customer service hub it sat for 3 days and when I called requesting to pick it up before being transferred to USPS instead of just being delivered to my address I was told I couldn’t change the process. UPS wanted $8 and Tenergy to call and ask for it to be held and wouldn't let me come pick it up. Tenergy refused to make the call, I’m not impressed and would prefer that I be able to pick up MY purchased items given the fact that it’s already been 5days and will now be 8. I won’t be ordering anything further and so a zero you will get.Thanks !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TM",
          "Nb_Reviews": 1,
          "Date": "2022-06-30T20:08:42.000Z",
          "Titre": "Retroactively canceled a valid coupon",
          "Contenu": "Retroactively canceled a valid coupon. I ordered over $500 worth of stuff online and applied a coupon code for free delivery. The coupon did work and I did not have to pay for shipping, but then a few days later they contacted me and told me that I would have to pay for shipping. Worst customer service ever."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tina Starman",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T13:11:01.000Z",
          "Titre": "We are tax exempt",
          "Contenu": "We are tax exempt, so we needed to fill out your form in order to move forward.  We filled it out and emailed it back on 11/16. I reached out on 12/6 asking the status of our order and was told you never received the requested form, which at that time I RESENT the original email along with the filled out form.  No apology, nothing!! And then the nerve of whoever called for payment said AGAIN they never received the form! I have asked the teacher to never use you as a vendor in the future."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles Gentile",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T00:59:29.000Z",
          "Titre": "Didn’t receive product",
          "Contenu": "It wasn’t your company, it’s the post office. The product was shipped on May 17 and it’s May 25th and I still didn’t receive it. The tracking looks like it left Fremont ,CA came to Harrisburg, PA and then back to Lancaster, CA."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alex Aiu",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T16:50:54.000Z",
          "Titre": "Ordering and searching was great but…",
          "Contenu": "Ordering and searching was great but forcing someone to sign up to track there  order just seems over the top to me"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Yiu Wong",
          "Nb_Reviews": 3,
          "Date": "2022-12-27T18:38:19.000Z",
          "Titre": "Batterries won't charge",
          "Contenu": "I bought the TN160 charger and 12 AA and 12 AAA Tenergy batteries, half of the batteries could not be charged after the first used, garbage."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 5,
          "Date": "2023-03-02T22:29:12.000Z",
          "Titre": "Lousy company",
          "Contenu": "Lousy company.  Lies, nothing but lies.Tenergy’s response has nothing to do with the batteries not working."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary Lindsey",
          "Nb_Reviews": 1,
          "Date": "2022-07-09T00:48:22.000Z",
          "Titre": "One out of four packs is bad.",
          "Contenu": "I purchased 4 packs on June 29th.  One was bad.  I have been quizzed about the way I charged and tested the packs.  Three of the packs work as they should.  The 4th will not take a charge.  I have been in contact with your service team... \"Alex T.\".  After 2 emails detailing the problem, he now wants me to try the bad pack in an application.  I won't be a customer again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Fabrizio",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T23:24:47.000Z",
          "Titre": "I purchased a new battery pack from…",
          "Contenu": "I purchased a new battery pack from you. It has an issue and I emailed you. You have not responded. Is this the way that you treat your customers?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "unhappy",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T22:20:07.000Z",
          "Titre": "placed order on 12/31/22 slow customer service",
          "Contenu": "placed order on 12/31/22, what is taking so long to get my order moving, yes I know it was placed during the holidays but it could have shipped tuesday or wednesday with an email tracking, or is the store down the street out of them right now, I had the same problem last time I ordered from you, guess I need to start buying locally next time"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barry Burson",
          "Nb_Reviews": 2,
          "Date": "2023-05-03T14:01:49.000Z",
          "Titre": "Super slow customer service",
          "Contenu": "I bought two devices from them and they both were broken. No one could fix them and it took over a month to get any real help."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rocell Aguilar",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T23:12:21.000Z",
          "Titre": "The batteries I received were all dead",
          "Contenu": "The batteries I received were all dead. Zero charged in it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lord Brad",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T17:51:11.000Z",
          "Titre": "I have not received my order yet"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Suzanne Sontag",
          "Nb_Reviews": 9,
          "Date": "2023-05-07T03:39:06.000Z",
          "Titre": "Waiting to see if om",
          "Contenu": "I get an update to shipped on the day I received the rec'd the item.. funny"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Art Ghere",
          "Nb_Reviews": 1,
          "Date": "2022-05-31T20:27:09.000Z",
          "Titre": "70mm does not equal 65mm.",
          "Contenu": "70mm does not equal 65mm.You failed to provide physical dimensions in the \"specifications\".If you're not going to adhere to form factor 18650 standards, then that must be stated somewhere in the product description.Your \"FAQ\" button produces zero response.Your shipping information and review web pages need to support all web browsers, not just a select few.I need to know your product return procedure."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Manuel de Vengoechea",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T20:14:49.000Z",
          "Titre": "The batteries did not work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Morgan",
          "Nb_Reviews": 6,
          "Date": "2022-03-08T11:58:22.000Z",
          "Titre": "Do not purchase anything from this…",
          "Contenu": "Do not purchase anything from this company through Amazon. My husband did and got screwed over twice. Then when he used the card that came in the package from Tenergy the basically called him a liar because he wrote them the same day as Amazon answered his return request. Even though in the end we ended up with 4 working D Rechargeable Batteries we had originally ordered 12. Purchase from EBL, they care about their customers. After I told them what Tenergy had done they gave us 50% off our order and it came within 2 days and was exactly what we had ordered."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deana White",
          "Nb_Reviews": 1,
          "Date": "2021-10-01T16:24:59.000Z",
          "Titre": "Fedex delivered to the wrong address",
          "Contenu": "Fedex delivered to the wrong address. Luckily I had my garage door opened when the truck passed by. I heard the trucks sliding door. I checked online and it showed it was delivered to my address at 10:57 am.Nothing on my porch. I had to go look for it. What the hell is wrong with Fedex. I will be looking for another source for my batteries and solar equipment. Have a nice day. Get someone else but Fedex, they are not doing a good job."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bruce Gibson",
          "Nb_Reviews": 1,
          "Date": "2022-04-18T13:00:58.000Z",
          "Titre": "Lengthy Shipping Time",
          "Contenu": "Sadly to say the product has been in transit for 12 days and it is now past Easter. What else is there to say as the shipping time from the company did not indicate this length of time to deliver. I will review the product when it arrives."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Clifton  Onaga",
          "Nb_Reviews": 1,
          "Date": "2022-02-08T19:04:12.000Z",
          "Titre": "Well tried to cancel my order on a few…",
          "Contenu": "Well tried to cancel my order on a few occasions,  I call the next morning from when I placed my order inquiring about how long it will take to ship it out? They 5 to 7 days because it needed to be built.   Text back the same day to cancel it could wait that 5 to 7 the said it to later to cancel to was shipped out?  Texted  back on status of shipping because my in Status say it still being in process of being filled. Confused anyways, the person texted back confirmed that hasn’t shipped yet? So at this point just not worth loosing anymore time with trying to canceling order !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eileen P",
          "Nb_Reviews": 3,
          "Date": "2020-11-10T21:53:16.000Z",
          "Titre": "I just installed the last 4 batteries…",
          "Contenu": "I just installed the last 4 batteries of my last shipment to find that they are only at 30%, not 100%.  Even the other cameras are only at 30% - 47%.  The original batteries lasted a few months, these are only good for a few weeks.  I am hoping that the white ones that I just ordered are better than the blue ones I recently purchased. Too expensive to keep changing 6 Arlo cameras."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephan Gaebel",
          "Nb_Reviews": 2,
          "Date": "2020-11-10T19:04:19.000Z",
          "Titre": "Not worth the risk",
          "Contenu": "The THREE battery chargers and FOURTY EIGHT NIMH batteries I purchased overheated while charging and now the batteries have no capacity at all. I contacted Tenergy for return & replacement right away and they said NO. I then filed a dispute and Tenergy got my BANK account closed. FIVE days without being able to buy groceries, (thanks Fifth Third). SO DON'T BUY!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve Daniel",
          "Nb_Reviews": 7,
          "Date": "2020-10-28T15:54:34.000Z",
          "Titre": "Poor why to do business",
          "Contenu": "Contacted about charger issue right after I purchased batteries and charger.  Took a month to get an answer, I was informed that they were the only Arlo rechargeable battery sellers.  Not true,  I test three others on amazon and much better products.  There was no action taken on their part just had to eat the product.  Now a few months later and charge is not working at all.  They will not even answer my emails."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "richard  lucas",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T15:32:22.000Z",
          "Titre": "shipping charge"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Caroline",
          "Nb_Reviews": 1,
          "Date": "2020-04-21T17:52:04.000Z",
          "Titre": "I haven't rec'd my package yet",
          "Contenu": "I haven't rec'd my package yet, I called Tenergy for help they sent me to UPS.  My package has been in limbo since the 8th of April.  Apparently it's out for delivery as we speak, then I go check and it says it my incorrect apartment address.  I live in a house.  It says it is trying to locate my address, I can't get thru to UPS, 25 min wait at least.  So infuriating. I wish I never placed the order.Caroline"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Trudy Sturk",
          "Nb_Reviews": 1,
          "Date": "2020-10-16T14:03:49.000Z",
          "Titre": "I was very disappointed that the…",
          "Contenu": "I was very disappointed that the rechargeable batteries were not charged! I did not get notice of low battery until they were at 13% so when the new batteries came I needed to use them immediately and I couldn’t. Very disappointing. They are now charging but the camera is not in use and it is a safety issue in our house."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Neil H",
          "Nb_Reviews": 1,
          "Date": "2020-10-23T16:02:13.000Z",
          "Titre": "Where Is My Order?",
          "Contenu": "After placing my online order, and receiving an order confirmation email, I have heard NOTHING from Tenergy Power regarding my order. Crickets! No indication that my order has been shipped. No indication as to when I should expect my order to be delivered. No tracking information. Nothing! Crickets!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Bindas",
          "Nb_Reviews": 1,
          "Date": "2018-12-08T15:03:19.000Z",
          "Titre": "Purchased Nov 29",
          "Contenu": "Purchased Nov. 29, received email with USPS tracking dated Nov.30. As of today Dec.8, check USPS Tracking, shipment never left facility and picked up by USPS.Would never purchase from this company again. I want a full refund and will be filing a complaint with the California Attorney General Consumer Fraud and also U.S. Interstate Commerce and the Controller of Currency."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Randy Quenett",
          "Nb_Reviews": 2,
          "Date": "2020-03-28T23:47:10.000Z",
          "Titre": "Don’t expect your package 2nd day by…",
          "Contenu": "Don’t expect your package 2nd day by fed ex.  If you need it fast find another company. This is the reason I got this one. I believed I was going to get 2nd day. Only because amazon said they couldn’t get me the brand I wanted for 5 days. I shoulda just bought the other from amazon. I knew it was to good as well.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cynthia Henson",
          "Nb_Reviews": 1,
          "Date": "2018-12-25T19:13:36.000Z",
          "Titre": "Placed order on 12/17",
          "Contenu": "Placed order on 12/17. Told tracking number on 12/18. Told would be either fedex or usps. Received notice from ups that they have my package. It has sat in Sunnyvale, CA since 12/19. IF had actually been fedex or usps instead of ups, I probably would’ve had it BEFORE Christmas. If it is NOT here by 12/27, like ups says it will be, I will be refusing the order and requesting refund! This kind of customer service is totally unacceptable!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jeffrey hicks",
          "Nb_Reviews": 1,
          "Date": "2021-08-20T11:42:52.000Z",
          "Titre": "Last 2 orders I have gotten 4 batteries…",
          "Contenu": "Last 2 orders I have gotten 4 batteries for arlo camera, both of those orders one of the batteries died and wouldn't hold a charge after 2 or 3 charges ,so I'm trying one more time with this order ,if happens again I'm done with the company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Mielke",
          "Nb_Reviews": 1,
          "Date": "2021-04-06T23:16:21.000Z",
          "Titre": "The eggcopter wouldn't even charge",
          "Contenu": "The eggpter wouldn't even charge.  I tried it several times and nothing. The unit was used as all cellophane seal were wrinkled and not sticking there are stains on the instructions and scratches on the unit.  Very disappointed not up to your usual product standards."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Allen Salsbury",
          "Nb_Reviews": 1,
          "Date": "2020-11-10T18:47:02.000Z",
          "Titre": "I ordered a number of parts for my…",
          "Contenu": "I ordered a number of parts for my Phoenix Interchangeable Modular Drone which were delivered. The drone still did not work and I ordered another controller and was told it was no longer available. I therefore have a drone with new parts that is useless. Probably not their fault"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MaryAnn Rosenberg",
          "Nb_Reviews": 1,
          "Date": "2020-04-03T15:25:03.000Z",
          "Titre": "Received battery charger",
          "Contenu": "Received battery charger. It doesn’t work. Made several calls to Tenergy to no avail. No one has called back to address the issue. My first call was 2 weeks ago. I will never use your company again. My phone # is on the several messages I left to call back. A simple call back to address the issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe Griego",
          "Nb_Reviews": 1,
          "Date": "2020-04-09T18:15:39.000Z",
          "Titre": "I am upset because when I ordered",
          "Contenu": "I am upset because when I ordered, the should have known that batteries were a hazards and shouid have let me know right away, but they waited and so I had to wait a lot longer to receive my order. I changed the shipping method on Monday and today is Thursday and still have not received my ORDER."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lauren Becker",
          "Nb_Reviews": 1,
          "Date": "2016-09-20T15:58:02.000Z",
          "Titre": "cheap garbage made in china",
          "Contenu": "Battery recharger takes 7+ hours to charge batteries fully. Device overheats & needs to be unplugged halfway through, so it takes 2 attempts to charge batteries. Batteries held charge for insufficient time (less than 10 hours) Returned everything. First device- they sent pre-paid return label. second device sent as replacement that was also garbage. No return label, despite my request for one. Total junk"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 2,
          "Date": "2017-12-01T22:47:24.000Z",
          "Titre": "Extremely disappointed",
          "Contenu": "Extremely disappointed. Never had a problem with previous purchases.I bought this package of 56 rechargeable NICD/NINH batteries because I previously bought and used your 8 bay charger model V-868. These batteries will not charge. They only get very hot! Now only 2 of the 4 charging indicator lights come on. Lights go out after charging time. No green ok lights come on.Therefore I request a return authorization with shipping label for this order #542048."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Catherine Haller",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T20:08:58.000Z",
          "Titre": "Just received my order in the mail",
          "Contenu": "Just received my order in the mail. One package of batteries has only 8% left.... and the other has only 15% left.  $100 for batteries that are near empty?? I'm not happy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Chinal",
          "Nb_Reviews": 2,
          "Date": "2016-08-26T05:37:04.000Z",
          "Titre": "Bad experience",
          "Contenu": "I ordered what was described as rapid high capacity chargers. What I received were ancient technology chargers that were at least ten years old and two of the three arrived scratched and dented.When I contacted All Battery they demanded I send pictures, I did. I have heard nothing from them since. Unless you have more money than sense, shop elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeffrey Teaford",
          "Nb_Reviews": 1,
          "Date": "2016-08-11T14:11:17.671Z",
          "Titre": "Shipping the item",
          "Contenu": "So they show a UPS  shipping and tracking number.8 days go by and I finally call about the tracking number.The guy says my batteries will ship in a day or so.So the tracking number is a crock, meant to string you along into believing your battery has shipped.I'm calling UPS to see if they are OK with this.I won't be back in the future."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jake cuccia",
          "Nb_Reviews": 2,
          "Date": "2020-04-16T16:54:49.000Z",
          "Titre": "can't ever get anyone by phone",
          "Contenu": "can't ever get anyone by phone. no return calls . been using chargeable battery's .on your page they came with charger's ,i have 3 now ,so i just ordered 2 12 packs of non-rechargeable battery's and they don't work in my camera's.was ordered on around 3/24/20."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bruce Mowry",
          "Nb_Reviews": 1,
          "Date": "2020-11-11T01:01:40.000Z",
          "Titre": "Purchased a battery pack that would not…",
          "Contenu": "Purchased a battery pack that would not charge.  Tenergy did not replace the defective pack after multiple request from me.  I eventually had to open the battery pack and repair the defective battery pack.  I will never purchase anything from Tenergy Power again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "mable oneal",
          "Nb_Reviews": 2,
          "Date": "2021-06-11T13:20:53.000Z",
          "Titre": "You don’t answer your phone calls I…",
          "Contenu": "You don’t answer your phone calls I send text messages and emails concerning this item to be canceled wrong purchase I never got a response from anyone and now I have this item that needs to be sent back I tried to cancel it four  times!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen Ruppert",
          "Nb_Reviews": 1,
          "Date": "2019-01-08T12:22:23.000Z",
          "Titre": "Tenergy Power order was defective",
          "Contenu": "Purchased 4 lithium batteries from Tenergy Power for my brother. Shipping time was fair but the product received was defective.  When he tried to contact the company it took most of the day to finally reach a person. In nicer words than my brother told me, the company will not stand behind their product and lied to him.  When I tried to log back on to their website, my login and/or password would not work. Their website shows numerous 5 star reviews on trustpilot but when I tried to find their company on trustpilot I was unsuccessful."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Westetn",
          "Nb_Reviews": 1,
          "Date": "2016-12-02T13:43:26.000Z",
          "Titre": "Never received",
          "Contenu": "UPS sent me an e-mail claiming they delivered this package to my front door 12/1/16, however I never heard the doorbell ring, and it's very loud, nor a knock on my door. I searched the entire front of my house, there were no packages of any kind. My guess is that it was mistakenly delivered to another house, that has happened before. I can't rate the order without seeing it, this leaves no no way to respond but to say it was never in my possession. When I receive the order, I will change the rating."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jo Battle",
          "Nb_Reviews": 1,
          "Date": "2020-11-10T18:36:04.000Z",
          "Titre": "I order 2 charger from your company",
          "Contenu": "I order 2 charger from your company. One through the main company and ond through Amazon.  Needless to say neither one of them charge your batteries. I am very disappointed with since you are the only one to charge Arlo batteries. SincerelyJo Battle"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2017-05-23T01:08:14.000Z",
          "Titre": "S  l   o    w  to ship the order out …",
          "Contenu": "S  l   o    w  to ship the order out and even though I clicked on USPS Priority they shipped it with the more expensive UPS Ground.Your stated you used the shipping option a selected at check-out.I'm saying I selected USPS NOT UPS.  I've seen this happen twice before with other vendors."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles LoPresti",
          "Nb_Reviews": 2,
          "Date": "2021-11-13T14:42:15.000Z",
          "Titre": "These AA recharagable batteries Suck",
          "Contenu": "These AA recharagable batteries are terrible.  I have more bad ones than good ones at this point.  I get two charges out of them then they don't show up in the charger!Tenergy has become a big disappointment."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kristy",
          "Nb_Reviews": 2,
          "Date": "2016-09-20T15:27:49.000Z",
          "Titre": "Horrible Delivery time!!",
          "Contenu": "I needed these batteries for my wedding,  I placed the order 2 1/2 weeks out thinking it would be enough time.  It says 3-5 days delivery... Its now week 3. Totally did not make it to my wedding and I still haven't seen these batteries yet.  Very Disappointed and will never buy from here again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2017-07-25T17:01:42.000Z",
          "Titre": "Will not answer phones",
          "Contenu": "Will not answer phones. Needed to correct order. I called over 20 times in the course of a 5 day work week. Would not answer. Left voice mails with call back info....still no call back. Clicked on customer service links. went to bogus URL. FAKE COMPANY or they just don't give a F_ck"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tristyn Griffin",
          "Nb_Reviews": 1,
          "Date": "2016-12-14T07:53:27.000Z",
          "Titre": "Not happy",
          "Contenu": "I put the batteries in the charger then plugged it in and 1 to 2 hours later they were so hot that you could not touch them and the plastic cover on one of the batteries exploded because it got too hot. i feel like it's dangerous to use and definitely would not recommend this to a friend."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Sam Rihani",
          "Nb_Reviews": 1,
          "Date": "2017-07-31T07:21:59.000Z",
          "Titre": "Unhappy with products",
          "Contenu": "Hi, I have purchased the first charger from an electronic store, and it did not work, then I have contacted your technical department, and they advise me to buy this charger which it recommended by your expert, and unfortunately still not working.I am not happy at all, as the chargers still not giving me 100% charge, I have to charge it for more than 2 days, and less than 50% and I am not sure how long will last.I have bought two of them, and I am surprised it is held only for two battery.Please note the Battery are new. Sam Rihani"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Melisa Kaschmitter",
          "Nb_Reviews": 2,
          "Date": "2020-02-13T17:26:13.000Z",
          "Titre": "It was explained that the shipping…",
          "Contenu": "It was explained that the shipping would be increased for the hazardous materials and that the total would be 145, but it was not explained that the 145 would be over and above the original shipping cost of almost 80 dollars.  This is for a 4 dollar battery!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Melisa Kaschmitter",
          "Nb_Reviews": 2,
          "Date": "2020-02-13T17:25:32.000Z",
          "Titre": "It was explained that the shipping…",
          "Contenu": "It was explained that the shipping would be increased for the hazardous materials and that the total would be 145, but it was not explained that the 145 would be over and above the original shipping cost of almost 80 dollars.  This is for a 4 dollar battery!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LB",
          "Nb_Reviews": 4,
          "Date": "2017-02-05T03:16:35.000Z",
          "Titre": "Horrible Experience",
          "Contenu": "I was unable to complete my transaction because of a horrible language barrier. I ask continously to speak to someone else, and the second representatives accent was just as unintelligible. I  was very disappointed because I  needed the items. I tried communicating through email and the issue still could not be resolved. The representative ask me to photocopy my credit card front and back and email it to her. I  thought that request was utterly ridiculous with the amount of fraud and identity theft that exists. I was very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Janet Rinehart Batease",
          "Nb_Reviews": 2,
          "Date": "2020-11-10T17:51:02.000Z",
          "Titre": "I have called and sent many emails to…",
          "Contenu": "I have called and sent many emails to your company for a refund on your product. If you look at my account you will see all of that. I am very displeased with your product and I want to send it back ASAP but I was told I could not. I want you to credit my charge card for the amount. I was also told I needed a form to fill out if I am returning for repair. I need to resolve this immediately as I have the box ready to come back to you. I have the receipt and i will send you a copy with the return order. Please provide this info ASAP my next step will be Atty Generals office and Better business Bureau. Janet P Rinehart-Batease."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dan W.",
          "Nb_Reviews": 1,
          "Date": "2021-05-26T02:42:15.000Z",
          "Titre": "Ordered May 10th",
          "Contenu": "Ordered May 10th. Contacted me on May 11th, about shipping and billing address mismatched.  Called and sent e-mails confirming address.  Called again on May 19th, was told it was their mistake, would ship that day.  Called on May 20th, and again told it was made and shipped, would send tracking number.  No number came.  Called again on May 21st, told it had shipped, would send tracking number.  No number came.  Finally received tracking number on May 24th, confirmed it was picked up on the 21st.  Poor response time, did not follow through on order in a timely manner, and basically made up shipping information when it was clearly not correct.  Will not order again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ben Polk",
          "Nb_Reviews": 2,
          "Date": "2016-12-20T20:43:58.000Z",
          "Titre": "Horrible",
          "Contenu": "Thefirst battery they sent didnt work and then they sent another battery to replace it. the other battery was too long for my gun wen i tried using it it butned the connector cable in my gun . Now my gun doesnt work at all. Id give 0 stars if i could...waste of time and money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Never again",
          "Nb_Reviews": 1,
          "Date": "2017-09-06T12:36:26.000Z",
          "Titre": "All-Battery - Outrageous Delivery Fees",
          "Contenu": "I was dismayed by All-Battery's inability to provide an estimate of the shipping and customs fees for shipping their product to Canada.  The calculation of the product value for canadian takes was inflated by All-Battery's shipping fees. All-Battery ships via UPS which added a broker's fee that was equal to the total inflated customs fees.  The final cost was an additional 85% of the cost of the product itself. I will NEVER USE ALL-BATTERY AGAIN  to ship to our canadian location.  If I had known the TOTAL or ESTIMATED cost, I would NOT have used their service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Martin Hernandez",
          "Nb_Reviews": 2,
          "Date": "2020-04-15T03:29:57.000Z",
          "Titre": "I asked for my order to be canceled…",
          "Contenu": "I asked for my order to be canceled before it was shipped. Instead I did not receive an answer to my request until my order was shipped. So they answered my request to cancel after my order was shipped not before. Very sneaky and underhanded"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bob K.",
          "Nb_Reviews": 1,
          "Date": "2016-09-12T00:52:03.000Z",
          "Titre": "Very lengthy turn-around time... Yet high cost shipping charges!",
          "Contenu": "Ordered on 9/5.  Paid almost $16 for shipping.  Yet merchandise is not expected to arrive until at least 9/16.  Many retailers offer free shipping and the goods are delivered in 3 to 5 days.  Not impressed with the value proposition offered by All-Battery at this point."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Warren Heidenreich",
          "Nb_Reviews": 1,
          "Date": "2017-01-02T22:45:42.000Z",
          "Titre": "Company is quick to charge, slow to refund",
          "Contenu": "I ordered from the company on 26 Dec; they charged my credit card on 28 Dec, even though they hadn't shipped my order yet. On 30 Dec they sent me notification that they had cancelled my order. No credit has shown up on my credit card account as of today (2 Jan)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Larry Davis",
          "Nb_Reviews": 1,
          "Date": "2017-09-29T19:06:34.000Z",
          "Titre": "I recently purchased a solid brass …",
          "Contenu": "I recently purchased a solid brass fidget spinner which was not in the package that showed up at my door, inside was a battery which I did not order, and the packing slip says the contents of the package is supposed to be a fidget spinner.I've emailed the company 3 times on 3 separate days, and still no reply, I'very called the customer support line 2 days in a row no answer my order arrived Monday and today is Friday, no email response or call back, I've requested a refund and still no reply, starting to feel like I've been scammed!Do not buy form this company, no bueno no bueno"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Glenn Lane",
          "Nb_Reviews": 1,
          "Date": "2019-10-05T03:06:13.000Z",
          "Titre": "Dissapointed; still looking for battery pack charger.",
          "Contenu": "I needed a battery pack charger for rechargeable Ni-MH 2.4V 2000mAh,4.8Wh Garmin battery pack GPS batteries. I ordered the Tenergy 2.4-7.2V NiMH/NiCD battery pack charger.When I received it and opened the box; it was not anything close to what I needed. None of the leads for connecting the negative and positive poles would remotely fit these AA battery packs that are manufactured with the two poles side by side that are turned and fused together, opposite of one another. They need to be clear in description what this battery charger fits.  I am open to suggestions if it can be made to work for what I need it for, because I am still searching."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 2,
          "Date": "2019-02-01T18:28:18.000Z",
          "Titre": "Terrible",
          "Contenu": "Terrible. Ordered last week, for ground delivery. Got a notice via email my order was being shipped. Then a notice via email my shipment was cancelled. No communication from the company since. And no batteries received. What gives???"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kim Sermersheim",
          "Nb_Reviews": 1,
          "Date": "2020-11-10T21:08:47.000Z",
          "Titre": "Short life duration of Tenergy rechargeable ARLO batteries",
          "Contenu": "I continue to experience very short life from Tenergy batteries.  I must keep 12 extra batteries just to keep 4 ARLO cameras operating.  Experience to date is Tenergy batteries are of poor performance and value."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas Roth",
          "Nb_Reviews": 1,
          "Date": "2017-02-05T03:28:58.000Z",
          "Titre": "Don't buy the Tenergy rechargable batteries",
          "Contenu": "I bought the charging station and 16 C batteries for a baby swing and they do not have enough power fully charged to run the swing AT ALL!!! I just hoping I can return them and find a better battery. I would give zero stars if possible!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Justin Kemper",
          "Nb_Reviews": 1,
          "Date": "2021-11-25T01:34:58.000Z",
          "Titre": "I paid more money for these batteries…",
          "Contenu": "I paid more money for these batteries because I needed the 4/5 Sub c 1300 mAh and they sent me the 2200 mAh that I could’ve gotten for under half the price on Amazon. Explain that?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "andy malding",
          "Nb_Reviews": 1,
          "Date": "2019-07-13T22:53:25.000Z",
          "Titre": "You suck I have tried texting you…",
          "Contenu": "You suck I have tried texting you several times and tried to call. I shouldn't have been charged shipping on the charger I just ordered.now I want a return auth. To return it and have got no response from your company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason Coons",
          "Nb_Reviews": 1,
          "Date": "2017-07-29T02:31:48.000Z",
          "Titre": "Paid extra for quick shipping through …",
          "Contenu": "Paid extra for quick shipping through UPS, but it was mailed through USPS.  I emailed asking why my 2 day shipping took 5 days and I was told to contact the shipping company and ask them.  Sophie was rude and not helpful in anyway."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Malique Serieux",
          "Nb_Reviews": 1,
          "Date": "2016-09-26T04:42:39.000Z",
          "Titre": "Bad for Li-Polymer batteries",
          "Contenu": "I tried charging my Li-Po 7.4 battery for my airsoft rifle and it never charged. It's indicated that it was fully charged but when I placed it back in my AEG it did not work.  Highly disappointed and will return this product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Harry Morgan",
          "Nb_Reviews": 1,
          "Date": "2020-04-21T14:45:08.000Z",
          "Titre": "Under preformed and under delivered",
          "Contenu": "I bought 12 rechargeable batteries for my arlo cameras.  Charged 4 batteries and I installed them when they where fully charged.  Less then 2 days and they needed recharged. The cameras are on my rafters outside and require a ladder. I even upgraded to the better battery that they offer.  Under preformed and under delivered.  I want to send them back butTenergy wants me to pay shipping and a 15%restocking fee for a batteries that don't last as advertised.  If I go buy energizers they last around 4-5 months.  I was trying to save myself some money but this will cost me time every other day to replace.  I was assured when I called about them that the life would be similar.  Run far away from this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-01-21T16:21:05.000Z",
          "Titre": "The advertisement said that I was…",
          "Contenu": "The advertisement said that I was suppose to receive batteries and a charger but that was not received yet.  If I don't receive what was ordered, I want a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dieter Walsemann",
          "Nb_Reviews": 2,
          "Date": "2016-11-21T18:16:59.000Z",
          "Titre": "This unit is terrible",
          "Contenu": "It charges 9 volt Durecella....but the charges are barely in the green indicator...and the next day...the charge is gone, evern when that charged battery is NOT installed in anything....Bad Product...I wasted my money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Allan Davidson",
          "Nb_Reviews": 1,
          "Date": "2020-02-04T18:40:46.000Z",
          "Titre": "There was no way to view my shipping…",
          "Contenu": "There was no way to view my shipping status without creating an account. You should have a way for those who do not want to create an account, to view shipping status. Many other sites have this feature."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carlos Chaves-Velando",
          "Nb_Reviews": 1,
          "Date": "2021-06-05T13:42:59.000Z",
          "Titre": "Not good at all.",
          "Contenu": "Shipping was slow. Batteries were loose and rattling around. Shorted me 8 Batteries of a 12 pack. Now I have to deal with their customer service which I'm sure will be just as bad."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Evangeline Cantu",
          "Nb_Reviews": 1,
          "Date": "2016-09-18T17:16:47.000Z",
          "Titre": "Batteries",
          "Contenu": "Your camera batteries do not have a long life cycle, they die very quickly. I installed the cameras at the beginning of August with new batteries and I am now having to replace them and it is the middle of September."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JOHN W.",
          "Nb_Reviews": 1,
          "Date": "2020-03-17T12:08:19.000Z",
          "Titre": "I do not want unsolicited emails asking…",
          "Contenu": "I do not want unsolicited emails asking me to rate you.  I already unchecked the box for receiving promotional emails.  We are not engaging in a long-term relationship, I am placing a one-time order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Moore",
          "Nb_Reviews": 1,
          "Date": "2017-12-06T04:24:33.000Z",
          "Titre": "I tried to cancel just a few hours …",
          "Contenu": "I tried to cancel just a few hours after posting. I received reply: (Tracking ID: NQ2-3HG-AZDJ) has been created from your inquiry or by our service staff.The next day you shipped the order anyway . . .bye"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patricia Brodin",
          "Nb_Reviews": 1,
          "Date": "2020-04-12T15:44:19.000Z",
          "Titre": "Charge me for what you give me",
          "Contenu": "Charged for priority mail and it was shipped first class. If you charge me $8 for shipping, and then ship 1st class $2, the $6 goes in your pocket? Unacceptable guys...This really turned me off."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "heidi hodges",
          "Nb_Reviews": 1,
          "Date": "2017-03-21T23:18:16.000Z",
          "Titre": "How do you rate a product you have never received",
          "Contenu": "I have never received the battery so how do I review it , I paid as much in shipping as I did for the battery that I never received , I get free shipping on other products and receive it in about 3 days . ?????"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roy Halsey",
          "Nb_Reviews": 1,
          "Date": "2020-06-19T17:33:23.000Z",
          "Titre": "No Batteries",
          "Contenu": "Ordered charger and battery COMBO from wal mart. It did not come with the 12 batteries as described.Not happy. So much for the customer being right. It appears to be my word against theirs."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "robert cone",
          "Nb_Reviews": 1,
          "Date": "2016-12-15T21:39:38.000Z",
          "Titre": "All Battery cancelled my first order .",
          "Contenu": "All Battery informed me that my first order was cancelled. I sent them an e-mail and was told, just re-order which I did. Problem is, two orders arrived at different times and I was billed twice."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Natalie Nadine Cerny",
          "Nb_Reviews": 3,
          "Date": "2021-04-22T23:03:51.000Z",
          "Titre": "Don't waste your money on the Tenergy…",
          "Contenu": "Don't waste your money on the Tenergy Otis Vacuum unless you want a vacuum that completely breaks on you beyond repair just two months after the warranty is over. I used this vacuum maybe once a month over the 2 year period so the fact that it is broken after maybe 25 uses is unacceptable. I contacted customer service and instead of just sending a replacement roller brush over (which I'm sure costs nothing) or offering it for purchase I was basically told to throw the entire thing away and that they were sorry for the inconvenience. What a waste!!!!! If I could give it zero stars I would. They love to block people and won't publicize any negative reviews, so the reviews that you are seeing on their website are not the when story! I wish I knew this company didn't practice proper business ethics before I gave them my money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kenneth Freeman",
          "Nb_Reviews": 2,
          "Date": "2017-04-16T18:25:09.000Z",
          "Titre": "Got my shipment on hold...As many …",
          "Contenu": "Got my shipment on hold...As many batteries they ship could have let me know up front about extra charges...Or even just changed the shipping.. I would have had my product by now..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "UNHAPPY CUSTOMER",
          "Nb_Reviews": 1,
          "Date": "2021-01-02T12:42:48.000Z",
          "Titre": "I placed my order on the 23 Dec 20",
          "Contenu": "Most people DO NOT WANT  an account opened in their name. Nor do they Want public posting. If this company wants to get reviews to better themself.Then THEY would respect the people spending their money with them.I placed my order on the 23 Dec 20. It was flagged as Fraud, right out of the gate. I called on Monday. And talked to a young man. Who said YOU do this to everyone ( first time buyers ), and that a person calls to verify name and address SAME DAY,. THAT DID NOT HAPPEN !!! THIS YOUNG MAN TOLD ME HE WAS SORRY THE BALL WAS DROPPED AND THAT HE WOULD MAKE SURE IT WENT OUT ASAP IN 1 OR 2 DAY SHIPPING. I was Impressed, I checked on my order later that day NOTHING. I talked to someone in chat.  i was NOT HAPPY. i ASK A QUESTION  I EXPECT AN ANSWER NOT THE RUN AROUND. NOT EXCUSES AND NOT TO BE TALKED DOWN ON. i AM STILL WAITING FOR MY ORDER !!!!!! 2 JANUARY 21"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jon Snyder",
          "Nb_Reviews": 1,
          "Date": "2021-05-04T17:10:31.000Z",
          "Titre": "Slow to respond",
          "Contenu": "Slow to respond.  Have not received my order yet I placed almost 2 weeks ago. label says Shipping Label Created, USPS Awaiting Item for the last 4 days now."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank Fetter",
          "Nb_Reviews": 2,
          "Date": "2017-05-11T18:50:47.000Z",
          "Titre": "It's extremely frustrating when you gat …",
          "Contenu": "It's extremely frustrating when you gat these before you receive the product.According to my email notification, the batteries were delivered yesterday...they were not..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pamela Fingar",
          "Nb_Reviews": 1,
          "Date": "2019-01-18T17:33:13.000Z",
          "Titre": "Need refund",
          "Contenu": "I cancelled the order just minutes after ordering and was advised that it couldn't be cancelled. It was delivered and I returned it UPS but no refund was given??????"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "George Stack",
          "Nb_Reviews": 1,
          "Date": "2021-04-24T09:35:14.000Z",
          "Titre": "I ordered button top batteries",
          "Contenu": "I ordered button top batteries. Not flat top batteries.How do I go about returning a order of unwanted flat topped batteries. Yours truly George Stack"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary Fleetwood",
          "Nb_Reviews": 1,
          "Date": "2020-01-22T13:58:12.000Z",
          "Titre": "I received email to receive $5 off my…",
          "Contenu": "I received email to receive $5 off my purchase and did not receive it. I sent an email  to the  company and did not receive a response.  Very unhappy  right now."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Catherine McCarter",
          "Nb_Reviews": 3,
          "Date": "2020-11-11T14:54:54.000Z",
          "Titre": "When ordering I specifically asked if…",
          "Contenu": "When ordering I specifically asked if charger worked for all 123 batteries. When I received charger it only charges tenergy batteries which I do not own."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William Walsh",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T15:49:56.000Z",
          "Titre": "Can't Cancel on Website",
          "Contenu": "I don't like that my credit card was charged as soon as I ordered but the order wasn't shipped for 5 days. There was no option on the website to cancel the order, only to reorder."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephan Werick",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T16:39:46.000Z",
          "Titre": "I wanted to explore further purchases…",
          "Contenu": "I wanted to explore further purchases on your site,a request to register was recommended,my effort to register on your site was continually rejected.At this time I remain after 3 tries to register on your site I have chosen to remain unregistered and will seek purchase options on another site. Thank you Stephan"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ian K",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T15:08:24.000Z",
          "Titre": "I didn't receive a confirmation",
          "Contenu": "I didn't receive a purchase confirmation email or shipping updates. The product is correct and arrived in the time it should have, but I wasn't certain the order was placed and I was suspicious I had been scammed for a few days until the product showed up"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "spammed to death",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T15:29:12.000Z",
          "Titre": "the shipping was fine but the unit has…",
          "Contenu": "the shipping was fine but the unit has ruined several of my batteries.  also i get a ton of spam from trustpilot."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sherman Hudson",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T17:18:45.000Z",
          "Titre": "Couldn’t place the order online"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marvin  Jones",
          "Nb_Reviews": 1,
          "Date": "2022-06-09T23:46:50.000Z",
          "Titre": "Another point of view",
          "Contenu": "Unlike many reviewers I was very disappointed by this company’s processing &/or handling delivery.  Had a hard time learning status of my order.  It’s too soon to address quality of the products. Battery charger included in the battery pkg was better than expected."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Pokorski",
          "Nb_Reviews": 1,
          "Date": "2022-04-20T14:46:43.090Z",
          "Titre": "I unknowingly ordered both 600ah and…",
          "Contenu": "I unknowingly ordered both 600ah and 750ah batteries last year and the difference is astonishing. The 600ah I have to charge after 1 to 2 weeks of use. The 750ah last months. Why the difference escapes me, but I just ordered 12 of the 750ah batteries. Had I only had 600ah from Tenergy, I would have become an avid critic of the companies rechargeable batteries. Why they are both described as Arlo approved, I have no idea. So my experience with Tenergy batteries is so mixed that I will call it a draw at this point."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JLK",
          "Nb_Reviews": 1,
          "Date": "2022-01-19T09:31:10.000Z",
          "Titre": "I ordered 4 Tenergy 9V batteries",
          "Contenu": "I ordered 4 Tenergy 9V batteries, and you never let me know that the batteries were NOT in stock.  When I contacted you a week later you said that you would send a email with the tracking number when the batteries were sent out, you did not do that either.  Excellent product, terrible service.JLK"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Niall O'Driscoll",
          "Nb_Reviews": 1,
          "Date": "2021-06-17T15:06:03.000Z",
          "Titre": "Website offered free shipping on a $70…",
          "Contenu": "Website offered free shipping on a $70 order with next business day shipping. Turned out to be $100 shipping and two days later it still hadn’t shipped. I called to see what was going on. They said they couldn’t ship LiPo via air and we’re planning to contact me. They ended up charging $50 to ship ground. Seems they could have figured this out in the first place."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Liam Marks",
          "Nb_Reviews": 1,
          "Date": "2021-06-26T04:41:33.000Z",
          "Titre": "Poor Customer Service",
          "Contenu": "Poor Customer Service I ordered a battery from them and had to cancel the order, which they did immediately. I was told I would get a refund in 1-3 days but after 4 days I still hadn't gotten a refund so I e-mailed them about it. They told me they would figure out what the issue was but it took another 3 days for them to confirm that I would be getting a refund soon. The next day I got my refund, but I was getting suspicious that I was never going to get a refund."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "custom-er",
          "Nb_Reviews": 2,
          "Date": "2020-12-18T22:01:24.000Z",
          "Titre": "Wrong item was shipped, but customer is responsible to return or will be charged?",
          "Contenu": "Wrong item was shipped.  In order to get a replacement, I need repackage and drop off at post office with RMA label, otherwise I'll be charged for the wrong item, which I didn't buy.  The effort that I've already put into this (haven't even shipped it yet) is already exceeding the replacement cost.  Time wasted between all of the shipping is the worst part."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steve B",
          "Nb_Reviews": 1,
          "Date": "2021-04-23T18:12:17.000Z",
          "Titre": "Sneaky \"Subscribe to our newsletter\" tactic",
          "Contenu": "Sneaky. Forces me to enter an email address to place an order and automatically checks the \"Subscribe to our newsletter.\" even if you uncheck the box, it saves it with it being checked. Not cool people. If I wanted your newsletter I would check the box. As for the batteries. Their claim of \"recharge up to 500 times\" .. Baloney. I bought batteries 3 years ago for my Arlo cameras and have recharged them, at most, a couple dozen times and they are all dying one by one."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Emily Bonilla",
          "Nb_Reviews": 1,
          "Date": "2020-11-10T23:15:21.000Z",
          "Titre": "I bought two of the 8 pack rechargeable…",
          "Contenu": "I bought two of the 8 pack rechargeable batteries with charger. One of the set of 8 do not hold a charge. I put them in my Arlo camera and set the camera setting for best battery life and they still died right away. Within a day of putting them in. The camera is on the side of the house so there is no traffic going through there yet it still died within 24 hrs of  changing them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MAX",
          "Nb_Reviews": 1,
          "Date": "2020-11-11T02:04:32.000Z",
          "Titre": "Order Missing Items",
          "Contenu": "When I received my order it was short a package of batteries.  I contacted the company and they acted like I was trying to steal them. They required me to take a picture of what I received and email it to them.  That was really stupid because if I was stealing them I just would take a picture with 1 package short.  It actually too several weeks to get it straightened out.  I won't do business with them again unless I have NO choice."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christine Dands Greany",
          "Nb_Reviews": 2,
          "Date": "2020-11-11T15:04:17.000Z",
          "Titre": "I bought the large quantity of solar…",
          "Contenu": "I bought the large quantity of solar batteries.  I was excited and expected them to work for a long time, they did not.  Some only worked for a few weeks (yes in the full sun).  Others did not work when I took them out of the package.The price was okay for the quantity.  But the quality of the batteries working was poor and disappointing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 7,
          "Date": "2020-12-26T21:59:47.000Z",
          "Titre": "Just okay. Small.",
          "Contenu": "There are couple reasons I only gave two stars. First of all the window does not open on its own when pushing unlock button. I have to put my nail in air vent to lift open. Also I thought it could charge mor batteries at one time. Also, thought it had enough room in it to store batteries when not in use."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CustomerEd",
          "Nb_Reviews": 3,
          "Date": "2020-02-05T16:27:53.000Z",
          "Titre": "In all honesty",
          "Contenu": "In all honesty, received the batteries on or about January 18 and installed four in my Front porch Arlo camera which is normally dormant due to little mobility to capture.  Once functioning Arlo showed the batteries at 97 percent.  February 4th checked on the system and found the batteries on the camera measuring 21 percent. That was very fast and didn't last as the previous batteries I use.  I expect more based on advertising?  Oh well?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gwen Fee",
          "Nb_Reviews": 2,
          "Date": "2020-10-24T20:30:11.000Z",
          "Titre": "Not The Best",
          "Contenu": "The batteries are not holding the power like I thought they would.  Regular batteries are lasting at least 2 to 3 months and these lose a lot of power within a week.  I use them in my Arlo cameras.  Also one battery would not charge to a “full” charge.  Maybe I got a bad batch of batteries.  I don’t know."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Fritz",
          "Nb_Reviews": 1,
          "Date": "2022-01-11T00:35:00.000Z",
          "Titre": "Ordering/Shipping Issues",
          "Contenu": "The product (in the past) has been good. But ordering this time was very slow. The person they assigned to assist was unhelpful (and possibly detrimental). When I ordered online (after getting some help), there was nothing saying there's a very expensive hazmat fee for sending batteries 2nd day air. So we lost one or two days (time is critical and I let them know that). Also, it shouldn't take 6 days to get to the middle of the country by Ground. At least one courier  company can get a package delivered by ground anywhere in the country in 4 days. To be fair, that may have changed with supply-chain issues. But many of these issues could be fixed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Bradford",
          "Nb_Reviews": 1,
          "Date": "2019-05-03T16:33:12.000Z",
          "Titre": "Look elsewhere.",
          "Contenu": "The only reason they get a second star is because they were never rude. Ratings of the batteries I bought were not clearly identified on the web page - had to pour thru several tab type menus to get the required info. The batteries didn’t meet expectations and customer service took over a week of back & forth emails with attached videos & photos with circles & arrows to come to a “NO. We won’t take them back.” Decision. Buyer beware."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Jeffrey Groves",
          "Nb_Reviews": 1,
          "Date": "2020-06-16T20:46:06.000Z",
          "Titre": "At this point I am very disappointed",
          "Contenu": "At this point I am very disappointed. 80$ for 16 pack of rechargeable batteries. It was marked “free shipping” and then as I’m about to check out, my order goes from 98$ with tax to 178$. It is 80$ for shipping. So much for the “free shipping.” I also ended up buying the battery charger cheaper on amazon. And now I just got an email from them saying my item is class 9 hazardous and if I don’t pay 132$ In fees, my shipping time will be delayed. What a joke. This company hides a lot of important information."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frank Cipolla",
          "Nb_Reviews": 1,
          "Date": "2020-06-14T17:38:38.000Z",
          "Titre": "No better than the standard gold rechargeable.",
          "Contenu": "Bought a full complement of these for my Arlo system. Previously had standard Tenergy batteries. Full charged all 4 sets of 4 but decided to test them against the basic Tenergy ---as I suspected---they did not last any longer than the standard ---- don't waste your money upgrading to these high capacity"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard  McPherson",
          "Nb_Reviews": 1,
          "Date": "2018-08-22T03:53:55.000Z",
          "Titre": "New lithium that Weren't as Advertised",
          "Contenu": "I thought I bought 8 New lithium ion rechargeable batteries and a battery charger. I got 8 lithium ion batteries that were almost totally discharged (about 20% each). I called to complain and was told that they have to be mailed this way, legally. There was Nothing Anywhere in or on the packaging to indicate they had to be fully charged before use. That Consumer Disclosure could and should have been made in their advertising and packaging."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2022-03-24T23:18:24.000Z",
          "Titre": "Poor information provided",
          "Contenu": "I queried the company about the weight of battery pack 34042-03. I was informed that the pack weighed 56grams. On the basis of this I purchased 2 of the packs. The actual weight of each pack is 102grams."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Brooks",
          "Nb_Reviews": 1,
          "Date": "2017-03-25T16:02:15.000Z",
          "Titre": "Where the heck is my battery ?",
          "Contenu": "I did not expect it to take this long for my battery to arrive. I only ordered ONE battery - because I wanted to TEST it before I ordered a couple more. It never occurred to me that it would take well over two weeks for the battery to be shipped and arrive at my house.Actually - they promised it would arrive on Monday or Tuesday.....today is Saturday and still NO freaking battery.What happened ? Did it get lost in the mail ?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Vasquez, R",
          "Nb_Reviews": 1,
          "Date": "2017-03-23T01:37:27.847Z",
          "Titre": "Battery never arrived - poor customer service",
          "Contenu": "Ordered a battery on March 5th. Free shipping. Today is March 22nd and I have yet to see the item. It was supposed to be delivered on March 13th, but was not. I have made several attempts to reach out to All-Battery, both email and phone call. Today(March 22nd), I spoke with one of their reps who informed that he would resend the item. No explanation, no signs of concerns on the reps part. Not sure I will be a repeat customer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dan Rudolf",
          "Nb_Reviews": 1,
          "Date": "2016-07-27T11:31:06.000Z",
          "Titre": "Actual lead time on items is in fine print. Poor Communication.",
          "Contenu": "I ordered a battery and charger and received a tracking number. When the order didn't show up I called and they referred me to the fine print that said it would be another 8-10 days. I just got notification (almost 3 weeks after the order) that the charger is not in stock and even though I received another email saying the order was shipped, it wasn't really. Won't be ordering again from them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eugene Peetz",
          "Nb_Reviews": 1,
          "Date": "2016-03-22T04:40:56.000Z",
          "Titre": "Wrong battery type received.",
          "Contenu": "Response and shipping were fine, but one of the battery types I wanted was not what I received.  I wanted a 386 battery.  When I requested the 386 on your website it redirected me to AG13/LR44 which I ordered.  Turns out this battery is not interchangeable with the 386 as it is too thick and won't fit in my application.  This was disappointing.  Do you not carry the 386 battery?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Bloch",
          "Nb_Reviews": 1,
          "Date": "2015-12-14T17:40:27.938Z",
          "Titre": "Appbot-Link purchase",
          "Contenu": "Purchased an Appbot-Link from All Battery.  Ordering is easy, shipping is quick, product came as expected.  However it doesnt reliably charge while on the base, many times it will wont charge after docking and the robot is drained during the day just sitting there.  It is then unusable.  Haven't had an opportunity to get back with customer service yet, more a problem with product quality than All Battery."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2015-06-04T08:08:34.091Z",
          "Titre": "Disappointed",
          "Contenu": "Placed order for item that showed in stock, sent payment, and received tracking number. Item stated at ups ready to ship for 3 days then I get an email stating item was not in stock and there is no known date when it will be available. I wasn't given offer of similar items or even a small discount  off another purchase.  I canceled and got refund, found items I needed at batteryspace.com"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matthew Heins",
          "Nb_Reviews": 1,
          "Date": "2015-06-11T14:25:24.824Z",
          "Titre": "Often delayed shipping and inaccurate stock information",
          "Contenu": "Twice I have placed orders only to find out that the items I ordered were inaccurately portrayed as having been in stock when they were in fact not in stock. This has delayed my projects. On one occasion, it delayed my project by a number of weeks. I find this deeply troubling and would suggest that All Battery improve their inventory management to accurately reflect stock levels and do a better job of keeping items in stock."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike B.",
          "Nb_Reviews": 1,
          "Date": "2018-11-30T04:42:20.000Z",
          "Titre": "Still no delivery... Would order somewhere else",
          "Contenu": "Order batteries on November 16. Today November 29. Still no batteries have arrived. First time I contacted support, they told me my order was selected as a random audit check. I received no call or email. I was told I would get a call in the next 10 minutes. Got a call 2 days later. Have been waiting for shipment. I called again and was told order was on backorder. I was also told I would be sent a tracking number. Neither has happened. Very disappointed with service. My CC was charged with no delay !"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alan T",
          "Nb_Reviews": 2,
          "Date": "2015-09-15T13:07:10.675Z",
          "Titre": "Weird unhelpful customer service",
          "Contenu": "This is the 3rd or 4th time I have ordered from them but certain they have gotten worse. My orders mostly don't show on my account so I can't tell you how many I ordered. Customer service won't connect them with my account so they are lost. Also very slow to ship.\r The products are nice as are there prices but this is probably the last order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Manuel",
          "Nb_Reviews": 3,
          "Date": "2016-08-13T22:52:34.058Z",
          "Titre": "How long does it take to ship an item?",
          "Contenu": "It has been over a week and my tracking information still says that a label was created 8 days ago but the item has not shipped. This is for my parent's chair lift so such delays puts a strain on them physically. The price also went up on a battery that only lasted a year. Hopefully I will find another source before I need to order again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeff Wilson",
          "Nb_Reviews": 1,
          "Date": "2017-02-17T18:01:44.000Z",
          "Titre": "Too SLOW Shipping",
          "Contenu": "Ordered on 2/10/17 for 2/17/17 delivery.  Delivery delayed until 2/21/17.Did not ship until 5 days after the order was placed, and funds received.  11 days for delivery is slow in this day and age.  Order was only 6 D-Cell batteries.  Will look elsewhere next time.Cannot review the product, as I am still waiting to receive shipment."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2015-06-07T11:39:39.209Z",
          "Titre": "Sent the wrong charger to the the wrong address",
          "Contenu": "I purchased rechargeable batteries and a charger. The charger data sheet clearly indicates the mAH range of the battery packs it works with and the charger that was sent was not applicable fro the battery pack I received. The customer service was friendly. Suggest you have a more experienced person checking orders or recommending batteries and a chargers."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike M",
          "Nb_Reviews": 3,
          "Date": "2015-12-05T16:55:08.620Z",
          "Titre": "Can't review what I never received",
          "Contenu": "Placed and paid for order 11/27/15. Not shipped until 12/2. As of today 12/4, package is still in California, heading to PA. Not expected to receive from UPS until 12/11, maybe. Email shows up today asking if I'm satisfied with my purchase. Never had a problem with this company before but after reading some of the reviews, it looks like I'm not alone with the slow shipping. Hope it's a one time screw up. Can't review what I don't have"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Laurie K",
          "Nb_Reviews": 2,
          "Date": "2017-01-09T18:26:10.000Z",
          "Titre": "Where is my order?",
          "Contenu": "I gave been waiting and waiting and have not received my order. The order was placed on 1-1-2017 at 1:50 am.  It is stated on my receipt that the order will ship in 3 to 7 business days.  As the order was place on a holiday, I figured it to be 4 to 8 business days before it would ship.  I just need the merchandise.  Please advise."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SDD",
          "Nb_Reviews": 14,
          "Date": "2020-01-21T22:32:56.000Z",
          "Titre": "product is over priced but you have a…",
          "Contenu": "product is over priced but you have a controlled market if a person wants a decent battery.I ordered Panasonic rechargeable batteries and charger.  This what came with the Arlo cameras and are performing better than   the Tenergy power.  After charging they lasted about a week the needed recharging.  To be fair not all 16 are having problems.  only 8 are having issues.  Part of the problem appears to be the charger as batteries never show full as it should, shows 4.17.  this the cameras are not showing more than one or two 10 sec videos a day."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paul Faini",
          "Nb_Reviews": 1,
          "Date": "2015-06-05T20:38:15.937Z",
          "Titre": "Tracking Information Useless",
          "Contenu": "I ordered two \"To be assembled\" battery packs on 5/29. I was informed that as a special order, it would take 10 days to receive them. It's been 7 days, and the tracking number is still only telling me that \"a label has been created.\" After 7 days, I would expect a more updated message would have been provided.."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "shirley miller",
          "Nb_Reviews": 1,
          "Date": "2016-01-09T04:17:09.917Z",
          "Titre": "out of stock",
          "Contenu": "I placed an order a few days later received an email stating one of my items are out of stock. when I replied all I received was a tracking id. no conformation weather or not my other item will ship. now when I decide to order the item that was out of stock again ill have to pay shipping because I wont qualify for free shipping"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeff McCoy",
          "Nb_Reviews": 3,
          "Date": "2017-08-31T23:15:02.000Z",
          "Titre": "Well when I got the battery I had to …",
          "Contenu": "Well when I got the battery I had to pay for more postage post office said they used a envelope that was for letters and ext,then I ordered 20 battery 16 where in a box and the other 4 where just laying in the envelope so the tabs where sticking out of the envelope so they all got here but a rough ride.Thank you"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Phil Caruso",
          "Nb_Reviews": 1,
          "Date": "2016-09-02T06:45:53.000Z",
          "Titre": "Disappointed - again",
          "Contenu": "I was willing to overlook the inadequate packaging -  a paper mailer - since the chargers were not real fragile and survived the crushing that they received in transit. However, my NiMH battery packs got so hot during charging, that I feared they would ignite.  I will be looking elsewhere for a reliable NiMH charger."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matthew  Trawick",
          "Nb_Reviews": 1,
          "Date": "2015-10-18T02:41:19.387Z",
          "Titre": "Usually good but this last order horrible",
          "Contenu": "Ordered batteries paid for batteries got an email that order was processed for shipping got a tracking number and then an email saying the batteries I ordered were out of stock with no anticipated availability date. If batteries out of stock it should say so on the order screen before payment accepted. Very poor business."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Wes Kinsy",
          "Nb_Reviews": 1,
          "Date": "2016-03-28T13:45:41.000Z",
          "Titre": "Item was not in stock on original request",
          "Contenu": "Been buying the same item since 2004. Went to make a purchase and item showed no longer available. Impacted our production. Had to contact engineering to approve a new battery pack. There was not information about when of if product would be available again. After two weeks, the product showed available again after much hustling and wasted time on our end. Please put a product availability date on product that continues to be stocked OR make it clear if product will no longer be available."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "snelson600",
          "Nb_Reviews": 2,
          "Date": "2017-01-12T09:46:04.000Z",
          "Titre": "Still waiting......",
          "Contenu": "I have ordered from All-Battery before, but it has been 3 years. I like their products. My recent order was placed January 3. Tracking shows it was delivered Jan.7--to a front porch 1900 miles from me!!  I called customer service number Jan. 7 to report error. I received a recording asking I leave a detailed message, including \"the name of the company\" I was calling about! I received a call back Jan. 9, saying my items were reshipped to my home Priority 2 day. It's Jan 12, still no pkg."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jerry Nadler",
          "Nb_Reviews": 1,
          "Date": "2015-09-16T18:23:14.831Z",
          "Titre": "False advertising no integrity.",
          "Contenu": "Purchased \"I-Phone compatible\" Tenergy Super Power Bank, item # 51029. When an item is advertised as I-Phone compatible customer expectations are for the item to connect to an I-Phone with what is provided in that package. This product is only I-Phone compatible when using a cable that is not included in the package. This product is not I-Phone compatible with what is provided. Misleading the customer with false advertisement. I am looking for a new source to do business with."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kimberley Orcutt",
          "Nb_Reviews": 1,
          "Date": "2017-02-22T18:14:11.000Z",
          "Titre": "shipping",
          "Contenu": "I have not received the items ordered to review. I received a tracking number a week ago. When I go to tracking number, it says a shipping label has been created but has not yet shipped. I will guess that the box is still sitting at store with no label and no one is sure where it need to go at this point."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2016-06-05T02:00:33.000Z",
          "Titre": "First order didn't work properly.",
          "Contenu": "Seems like a good site, but my first order did not work properly.  Spent an hour on chat w the service dept. They also couldn't figure it out.   Still waiting on a response to the email I was asked to send.   If they can get me fixed up, I'll try again. Otherwise, I'll have to look somewhere else"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Laura Morgan",
          "Nb_Reviews": 2,
          "Date": "2017-01-11T03:33:00.000Z",
          "Titre": "Second purchase dissapointing",
          "Contenu": "I placed an order and was thrilled with the product of rechargeable camera batteries so I placed a second order for three additional sets. However none the batteries I received on the second order take a charge. They appear to be ready according to the charging base but my camera says 6% and they last less than 5 minutes in my device. My emails for support have gotten one response via automation stating a ticket was started. But no results have come from this and no human replies have been received.Frustrated and disappointed!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alex Aguiar",
          "Nb_Reviews": 1,
          "Date": "2016-10-01T01:51:08.000Z",
          "Titre": "Hassle getting urgent parts",
          "Contenu": "Well first, they cancelled my order without giving me an explanation.  Apparently the called me and I didn't pick up so they cancelled.  Then I tried to contact them and ask them why my order was cancelled and they said my card was rejected and I should bring it up with my bank - this is the first instance of my card not working.  Then I tried to get a hold of them and ask them what I can do about it because my bank says the card should work - and it was an absolute nightmare getting them to respond to me.  Terrible experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard Jensen",
          "Nb_Reviews": 1,
          "Date": "2017-07-30T19:43:35.000Z",
          "Titre": "Still haven't gotten my batteries",
          "Contenu": "Prices seem good, but it's been ten days since my order, and still no batteries. The company asks me to rate them before I've even received my order. That sort of thing is ridiculous, and most companies play this game. They don't bother to check if the order was completed. They just want \"feedback,\" and they dun you with emails until you give it.Okay, I've given it. I'll look elsewhere in the future, even if it means a somewhat higher price. Actually GETTING what you order is worth paying a bit more, if necessary!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Ledogar",
          "Nb_Reviews": 5,
          "Date": "2018-08-09T21:50:37.000Z",
          "Titre": "You sent the wrong battery charger --you sent…",
          "Contenu": "I ordered a battery charger --you sent the wrong one as there are several size batteries rated at 3.7V.When I called about the error you said I had to pay for the shipping to return it.  It makes more sense to just keep it .  I have ordered and received the correct one."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Greg S Saunders",
          "Nb_Reviews": 19,
          "Date": "2015-11-14T00:48:53.438Z",
          "Titre": "Never arrived. No Communication.",
          "Contenu": "I ordered the item over two weeks ago, from Fremont, CA. Living in Sacramento, I could have walked to Fremont and back by now to pick it up. Not a word from All-Battery about the status of my order. Only the single email asking me what I think of their service. Two words: NOT MUCH."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Burt",
          "Nb_Reviews": 1,
          "Date": "2020-11-10T22:28:04.000Z",
          "Titre": "Battery charger not that great",
          "Contenu": "Battery charger not that great.  A couple batteries already not showing on charger.  Do not know if charger or batteries.  Asked questions from support but no answer from them.  Buy from a company that actually answers your questions."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JT",
          "Nb_Reviews": 1,
          "Date": "2016-07-12T06:32:53.000Z",
          "Titre": "Still waiting for shipment",
          "Contenu": "All-battery asked me to rate them, so...  They sent me a tracking number on the 5th and here it is about to turn over to the 12th and nothing's been shipped.  Tracking shows \"Pre-Shipment Info Sent to USPS.  This does not indicate receipt by the USPS or the actual mailing date\".  I would expect a shipment to be delivered to USPS within a day or two of placing the order.  I think a week is excessive and that's assuming it gets shipped tomorrow.  I guess I will have to contact them to find out what's going on and I think that's a problem."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "A Satisfied Customer",
          "Nb_Reviews": 2,
          "Date": "2017-11-04T22:38:59.000Z",
          "Titre": "Horrible experience: Stay Away!",
          "Contenu": "Horrible experience. I paid for and selected USPS and they unilaterally changed it to USP (takes well over a week to arrive). When I called them and asked about it they said that it was their policy. Additionally they gave my order information to an outside company!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Skywave Tape Deck Repair",
          "Nb_Reviews": 5,
          "Date": "2020-11-10T18:03:10.000Z",
          "Titre": "Shiny and Fancy Labels Do Not Guarrantee A Good Product",
          "Contenu": "First, all of these product are marked made in China. This then tells me from their history how well they are made. Second the product such as a D cell that are suppose to have 500 charge and discharge cycles sometimes do not make it past 5 cycles- I have a shorted cell here for example. Then I have numerous AA cells that have not made it past 30 to 40 cycles and all this while using their very own chargers which also indicate the cells are bad even before 30 cycles are used.I have had the 9V batteries explode on me in the chargers. This all adds up to indicate a poorly made product as they have real trouble making a 100% reliable item. Buy American!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RC",
          "Nb_Reviews": 1,
          "Date": "2020-11-24T13:34:43.000Z",
          "Titre": "You sent me an email that told me my…",
          "Contenu": "You sent me an email that told me my order was on hold and I had to call to clear it and you gave me 48 hrs.  Called, got voice mail, left a message.  Did not get called back with the 48 hrs.  I sent an email immediately telling you the information was valid and please complete the order - no reply.  When you called, after the 48 hr window, I verified the information I provided.  Then my order was on hold for another 5-6 days.  I had to call again to find our the batteries were being built and would be sent when they were done.  Why did you not tell me that when you called me?  All-in-all, not a good experience and would not order again from this company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Gels",
          "Nb_Reviews": 1,
          "Date": "2016-10-26T14:20:36.000Z",
          "Titre": "Wrong Parts Provided",
          "Contenu": "I ordered 80 AA 2600 NiMH Batteries.Received 60 AA 2600 NiMH Batteries and 24 NiCd  Batteries that I cannot use.Left a voice mail message with All-Battery.com this morning to get the correct parts and a Return Authorization to send the Batteries I cannot use back"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "michael j pair",
          "Nb_Reviews": 3,
          "Date": "2016-06-12T00:44:23.000Z",
          "Titre": "Shipping was not acceptable",
          "Contenu": "I ordered May 27th and realized it was a holiday weekend.  I upgraded my order to UPS one day (another $10) because I needed items for my overseas trip.  I had to call on Wed because my order still wasn't in the system.  All Battery rep said it wasn't a guarantee one day shipping - Great!!  Three hours later when I checked on my order it was all of a sudden in the system ready to ship.  It still didn't arrive until Monday June 6.  I picked it up on my way to the airport.  Bad customer service, but great products at a great price.   I feel I deserve my upgraded money back!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Craig  Couch",
          "Nb_Reviews": 2,
          "Date": "2015-12-30T01:01:43.649Z",
          "Titre": "The batteries did not weigh what was stated in the advertisment.",
          "Contenu": "Although the batteries preformed adequately, they didn't weigh what was stated in the advertisement. The weight was the biggest factor I used in their purchase. I have got several batteries on ebey, the weight and the power has gone hand in hand. The heavier the more power and these batteries were supposed to be heavier than all that I got from ebey. It turns out they are no heavier than the best I got from ebey. I expected All Battery to be the standard from which to judge others. Turns out they are just as prone to over statements as ebey. At least on ebey I would probably get a refund."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ronny",
          "Nb_Reviews": 1,
          "Date": "2017-05-27T23:39:56.000Z",
          "Titre": "Shipping $$$",
          "Contenu": "Good: Web site was easy enough to pick and choose, ordering was simple.Bad: I needed something else and located it and went to checkout and the tax on the second order war more than the item I wanted. Undecided: The review beat the product delivery."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brian Miller",
          "Nb_Reviews": 2,
          "Date": "2016-09-20T17:27:00.000Z",
          "Titre": "Slow shipping, batteries are poor performers.",
          "Contenu": "I have 1s Tenergys that perform great, but these 2s 900mah tenergys are larger and dont last but half the time of the xk batteries they are used to replace. I really expected much better quality from Tenergy batteries. I thought Tenergy was the best."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dwight",
          "Nb_Reviews": 2,
          "Date": "2020-11-10T17:37:29.000Z",
          "Titre": "Batteries wouldn't hold a recharge…",
          "Contenu": "Batteries wouldn't hold a recharge after after a few cycles.  Bought for an Arlo camera, so instead replaced the camera with one that can be recharged through a solar cell instead of replacing the batteries again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 2,
          "Date": "2015-08-17T23:51:43.000Z",
          "Titre": "Good batteries, watch the fine print",
          "Contenu": "Always have liked the batteries but very disappointed in last experience. Had a coupon code for a free keychain backup power source and added it into the cart. Received my order in the normal quick response time but the free item was missing. Used the online chat to find out why and was told that even though I DID add it, I didn't add it again in the checkout phase but if I was willing to pay the shipping they would send it to me. Told them I wasn't going to pay more in shipping than the item was worth and their response was basically too bad. Will have to seriously consider using this company again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Karen D",
          "Nb_Reviews": 1,
          "Date": "2016-09-12T23:39:40.000Z",
          "Titre": "Still waiting",
          "Contenu": "This order was placed on 9/1and I was told it would arrive by 9/8. The order wasn't even scanned by UPS until 9/7. It is scheduled to arrive 9/14 That is a long wait for a $15 shipping fee. No comment on the product as it has yet to arrive."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Terrence Godfrey",
          "Nb_Reviews": 1,
          "Date": "2016-08-04T16:24:31.000Z",
          "Titre": "Battery orders are beyond slow",
          "Contenu": "If you need a battery in less than a few weeks, do not order from here.  I needed two batteries and ordered with a two week lead time.  At 10 days the batteries haven't even shipped.  Deadline will be missed.  Highly regret this order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "james carr",
          "Nb_Reviews": 1,
          "Date": "2015-12-02T07:43:09.141Z",
          "Titre": "no batteries",
          "Contenu": "ordered $76 worth of batteries and received nothing,nada,zip,zero batteries only empty mailer package.not packaged well,should be more carefull .send me my order,make it good,your fault,then i will give good review.?????????????????#$$%%!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Timothy Pavey",
          "Nb_Reviews": 1,
          "Date": "2018-08-29T13:50:53.000Z",
          "Titre": "Recieved email from shipper that…",
          "Contenu": "Recieved email from shipper that package was cancelled. Never recieved any info about what was going on with it from the company. Did receive the package from different carrier a day later than supposed to. Paid for 2nd day air."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Henry Paulsen",
          "Nb_Reviews": 1,
          "Date": "2019-03-30T19:49:59.000Z",
          "Titre": "created shipping label on Monday but…",
          "Contenu": "created shipping label on Monday but didn't actually ship until Friday!  Poor service and no live person available to address the situation.  I tried to call several times but just got a message that no reps were there."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jean Norton",
          "Nb_Reviews": 1,
          "Date": "2015-09-19T10:55:02.657Z",
          "Titre": "battery purchase",
          "Contenu": "Found the site easy to navigate still have not yet received my order and when I track it it just tells me a shipping label was created nothing else tomorrow willvbe 7 days since I ordered it.  Not sure if I will purchase from here again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Terry Molewyk",
          "Nb_Reviews": 1,
          "Date": "2016-12-12T04:05:48.000Z",
          "Titre": "Poor packaging and wrong items shipped",
          "Contenu": "The goods were shipped in a mailing envelope and were loose and able to bang around. A battery case was broken.  The order also shipped the wrong batteries,  AAA instead of the AA ordered.  Emailed Customer Service but no reply yet."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sarah Nelson",
          "Nb_Reviews": 3,
          "Date": "2019-05-29T00:18:43.000Z",
          "Titre": "Still waiting",
          "Contenu": "I just placed my order 4 days ago I have not received it yet or a shipping confirmation email or an order confirmation email gave it a 2-star because I don't know the quality of product because I have not received it"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Aryana F",
          "Nb_Reviews": 1,
          "Date": "2020-02-26T15:47:22.000Z",
          "Titre": "Ordered in December but due to your…",
          "Contenu": "Ordered in December but due to your internal process your team cancelled the order. Very complicated process to place a simple order. It's easier to order via Amazon. Please use amazon to fix your issues."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Orchard Christian Fellowship",
          "Nb_Reviews": 1,
          "Date": "2021-06-30T15:47:46.000Z",
          "Titre": "Your webpage said that shipping was FREE",
          "Contenu": "Your webpage said that shipping was free on orders over $50 my order is $91 with $8.80 shipping how was that free shipping please reply there are other people out there selling batteries"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Leslie Gardinier",
          "Nb_Reviews": 1,
          "Date": "2018-01-27T16:13:24.000Z",
          "Titre": "I ordered a charger for the Tenergy …",
          "Contenu": "I ordered a charger for the Tenergy Li-ion CRC123A batteries and what I though were 12 more compatible rechargeable batteries. The 12 extra batteries are not compatible with my Arlo security camera system and can not be charged in the charger.The 12 batteries were the CRC132A LiFe-PO4 batteries and while if you look hard enough at the detailed description you find that the LiFe-PO4 batteries are not reccommended for the Arlo cameras. Now I have to send the batteries back at my cost ($11). I still do not have enough rechargeable batteries for my 3 cameras. I guess I have a bone to pick with Netgear also as their Arlo cameras can only use one brand of rechargeable batteries, also not made clear."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Malcolm Leighton",
          "Nb_Reviews": 1,
          "Date": "2016-11-10T19:39:21.000Z",
          "Titre": "Battery service/proper parts number",
          "Contenu": "I ordered the DL 1/3 N battery. The battery I received was the incorrect part number and size for my tool. I called and received an RMA number to return the batteries. The service personnel are very good and helpful."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David M",
          "Nb_Reviews": 1,
          "Date": "2021-08-11T19:19:19.000Z",
          "Titre": "Too long",
          "Contenu": "Was hoping to use these to replace the unprotected batteries that came with the device, but sadly they are too long.  Not the batteries fault, but will see if I can return them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kenneth Williams",
          "Nb_Reviews": 1,
          "Date": "2016-06-16T16:02:46.000Z",
          "Titre": "Did both received the batteries on time",
          "Contenu": "I order a 2 day Shipment, then when I required explanation the custom service rep told me it is only when UPS decides to ship.. I received my batteries  wI think in 9 day of the paid for 2day shipment, NOT HAPPY"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joanne Soltani",
          "Nb_Reviews": 1,
          "Date": "2016-01-20T19:18:58.146Z",
          "Titre": "Order not yet delivered",
          "Contenu": "The tracking status of this order has been \"Ready for UPS pickup\" for five days.  Sending an email with a tracking number when there is in fact no transit taking place is a poor communication process."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joe, W Chester PA",
          "Nb_Reviews": 3,
          "Date": "2017-05-01T19:36:59.000Z",
          "Titre": "Earth day coupon for 15% was just a \"come on\" coupon for nothing.",
          "Contenu": "There was a \"come on\" coupon for 15% off on an \"earth day\" special coupon the catch was that you had to forfeit the free shipping that come on orders over $75.00.  The end result was that it was cheaper to take the free shipping on an order in excess of $300.00.  I tried to split the order to into two but the real savings were still not there.  I called and talked to a customer rep who said the all too common \"Sorry but there is nothing I can do...only one coupon per order\".  The big 15% savings was just a \"come on\" to get me to place an order.  As just a normal person that works hard for my money I will do the only thing that I can do and that is to take my business somewhere else."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "michael dvenport",
          "Nb_Reviews": 1,
          "Date": "2017-02-07T11:33:36.000Z",
          "Titre": "sad is the word of the day",
          "Contenu": "spend over a $1000 and no correspondence, sad service still not received my order 10 days later after paying an extra $60 for hazardous goods and over $200 for express delivery. SAD is the word of the day"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nick Dilorenzo",
          "Nb_Reviews": 1,
          "Date": "2016-02-21T14:04:47.120Z",
          "Titre": "Bad batterys",
          "Contenu": "This is the last time I buy 9v Li-ion batteries. The last time 2 out of 6 were bad this time 1 out of 4 bad, I didn't learn the last time but I will remember to never buy 9v LI-ion recharge again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eric Lofton",
          "Nb_Reviews": 2,
          "Date": "2020-03-03T22:12:30.000Z",
          "Titre": "Made a purchase with Tenergy Power on…",
          "Contenu": "Made a purchase with Tenergy Power on the web site and with an service opp and never received my purchase. After two weeks I had to call once again to reorder the product again!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shawna",
          "Nb_Reviews": 3,
          "Date": "2020-02-21T14:45:30.000Z",
          "Titre": "My questions were never answered",
          "Contenu": "My questions were never answered.  I tried to ask questions about getting lower pricing when buying in bulk if I signed a no return, no cancel agreement.  No one ever replied."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joseph M Bartzi Jr",
          "Nb_Reviews": 1,
          "Date": "2016-10-15T14:44:23.000Z",
          "Titre": "Out of stock",
          "Contenu": "Said my order would be shipped, then a day later informed me the product was out of stock. We are traveling so I had a specific time frame to receive the charger. I cancelled the order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2016-10-02T13:04:36.000Z",
          "Titre": "Slow service",
          "Contenu": "The process of ordering was great, but I have still yet to receive my product. Ordered on the 9-24-16 and now I'm being told it should be received 10-4-16 ...Ten days for batteries."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jim stogdill",
          "Nb_Reviews": 1,
          "Date": "2019-12-31T01:52:35.000Z",
          "Titre": "I have been a customer of All-Battery…",
          "Contenu": "I have been a customer of All-Battery (now Tenergy Power) for 10yrs. I went to do my annual Christmas shopping on line at Tenergy and to my great delight there was a banner across the middle of the page saying use this code for 20% off your order. Great, right? Wrong! When I had my order ready to check out, I input the discount code but a red banner came up saying, 'the code is not valid'. So, I tried it again. Then I called CS. That's when I was told that the code was no longer valid...and that there was nothing anyone could do. I was in retail for over 35yrs; I guarantee I would never let that stand in the way of good customer service.  I have had issues with Tenergy not calculating discounts properly in the past, but they always made it work. This time, they didn't and it has left a bad taste in my mouth."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Philip",
          "Nb_Reviews": 2,
          "Date": "2021-07-18T17:19:02.000Z",
          "Titre": "It's almost impossible to buy these…",
          "Contenu": "It's almost impossible to buy these products in Canada. The shipping charge on batteries was very expensive, over 100$! There should be more options."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2017-02-14T08:36:14.000Z",
          "Titre": "Bad web site",
          "Contenu": "A week after placing my order i got an email saying there was an extra handling fee and questioning i place a second 'order' for the amount of the fee. Big waste of time"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alexander",
          "Nb_Reviews": 1,
          "Date": "2015-07-31T04:25:29.361Z",
          "Titre": "I shouldn't have to find out after I order an item that it is out of stock",
          "Contenu": "The title is basically the issue. I ordered an item that wasn't in stock and this was an inconvenience. I gave 2 stars, however there wasn't a lot of \"friction\"."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jay Converse",
          "Nb_Reviews": 2,
          "Date": "2017-06-12T00:15:35.000Z",
          "Titre": "You need a \"null\" review option",
          "Contenu": "You need a \"null\" review option.  All I know is that they created a UPS label a week ago, and it's supposed to arrive tomorrow, but AFAIK nothing has shipped."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tyler  Michael",
          "Nb_Reviews": 1,
          "Date": "2020-04-04T05:46:48.000Z",
          "Titre": "Shipping said free one day shipping",
          "Contenu": "Shipping said free one day shipping, went to order and said it was $5.00 and some change. Didn’t even leave the story until 3 days after purchase. Will update"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 1,
          "Date": "2016-03-30T09:25:27.000Z",
          "Titre": "Not fast charging",
          "Contenu": "I was expecting my S7 edge would fast charge with the cable that came along and with the S7 edge wall charger that came with phone bundle, but it is not fast charging."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kerry Gilham",
          "Nb_Reviews": 1,
          "Date": "2016-11-13T00:21:53.000Z",
          "Titre": "Poor connection",
          "Contenu": "The connector sticking out of the battery wobbles when I try to plug in the helicopter. It's that way on all six batteries.  Very disappointed. Kerry Gilham"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William Meier",
          "Nb_Reviews": 2,
          "Date": "2021-10-14T23:37:53.000Z",
          "Titre": "Never got batteries but tracking say…",
          "Contenu": "Never got batteries but tracking say it's delivered.After support finally responded, month, the batteries were finally delivered."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chuck Markins",
          "Nb_Reviews": 3,
          "Date": "2019-09-12T22:07:46.000Z",
          "Titre": "I purchased batteries and chargers last…",
          "Contenu": "I purchased batteries and chargers last Friday and they have yet to be sent to me.  Last time I looked yesterday, U.S.P.S. have yet to receive my order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "kevin smith",
          "Nb_Reviews": 1,
          "Date": "2015-12-18T15:04:28.328Z",
          "Titre": "slow shipping",
          "Contenu": "I ordered batteries on Dec 10th, it is now Dec 18th and the package is still in CA.  Look for another place to order batteries from unless your not in a hurry."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "larry goad",
          "Nb_Reviews": 4,
          "Date": "2019-09-19T03:11:59.000Z",
          "Titre": "Too early yet,",
          "Contenu": "Too early yet,the smaller nicads did very well, but the next size up did not do so well.  Installing more into battery paks now.  Will review again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "dogfarm",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T12:21:15.000Z",
          "Titre": "5 days before shipping?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer Mike L.",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T18:59:29.000Z",
          "Titre": "Everything was fine except for shipping options",
          "Contenu": "Everything was fine except for one important issue, shipping options.  USPS does not deliver in this region.  We use UPS or FedEx for deliveries."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steven Saunders",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T19:49:48.000Z",
          "Titre": "I was looking for more technical info…",
          "Contenu": "I was looking for more technical info for charging and testing metal based batteries. I didn’t get it. Good line of product , no backup technical information nor knowledge based information to ensure top performance from stored and charged batteries"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CB",
          "Nb_Reviews": 5,
          "Date": "2022-09-21T17:25:55.000Z",
          "Titre": "Great selection, slow processing and shipping",
          "Contenu": "Nice selection of battery products and ordered what I needed.  I will say it took them 6 days to process order and ship it out.  And that is after I sent in a message to customer service asking about order and when I could expect it.  For two small batteries this waiting period was excessive and will likely be almost a week and a half.  Hopefully products work correctly when I do finally receive them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "STEPHEN SCHLUETER",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T02:44:04.000Z",
          "Titre": "some times all the good doesnt cover a possible bad product",
          "Contenu": "What I dont like so far, the batteries I got, don't appear to be capable of getting and holding a charge. The two year old batteries I've been using took a charge right away, they just cant last all night. My new batteries don't show any sign of charge at all. Any help in this matter would be appreciated."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard Reich",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T00:53:59.000Z",
          "Titre": "In the past",
          "Contenu": "In the past, the product was great, delivery was expedient and I was a satisfied customer.  I have had to complain too frequently as half of the batteries I receive are no good as soon as I put them in my cameras.  I once got some extra free, next time they wanted me to send the bad ones back and the third time, I threw half of the box away.  Product quality is lacking."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Flick",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T20:15:32.000Z",
          "Titre": "Free Shipping",
          "Contenu": "I purchased  a a package of D cell batteries that had free shipping. After adding a smaller and less heavy pack of AA cell batteries that were in a smaller pack of less weight, I lost the free shipping.  Even though they shipped in the same package...Tenergy is the first company that has not honored a free shipping price because of adding an item of lower cost and weight.NOT COOL"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard Alvarez",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T17:02:34.000Z",
          "Titre": "I ordered the wrong battery size",
          "Contenu": "I ordered the wrong battery size. I immediately contacted the company to request a change. The company would not allow the change because the order had been placed and paid for, even though I immediately noticed my error."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bill Schafer",
          "Nb_Reviews": 1,
          "Date": "2022-10-09T01:37:34.000Z",
          "Titre": "Great, On delivery time. An issue with size on the DC end.",
          "Contenu": "The delivery time on my purchase was great, how ever the DC end of the charger is the wrong size, its to small, I don't know if I can splice the right size to it or not, ?? Maybe there should be a option on these, for different sizes, ?? It is for a battery operated security light.. Thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donald Sogge",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T17:45:36.000Z",
          "Titre": "Lack of info on purchase!",
          "Contenu": "Placed the order 2/25 Tenergt said I would get an email with info on the purchase, it's now the 28th no email but the cost is on my credit card!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dale DeToni",
          "Nb_Reviews": 2,
          "Date": "2023-01-27T17:45:27.000Z",
          "Titre": "Slow on shipping took 7 days or more to…",
          "Contenu": "Slow on shipping took 7 days or more to ship had to call to get shipping confirmation they did call back and gave me a possible shipping date"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dorothy Smith",
          "Nb_Reviews": 2,
          "Date": "2023-06-06T17:45:42.000Z",
          "Titre": "The battery was out of stock.",
          "Contenu": "Unfortunately the battery I requested was out of stock but the lady I talked to, suggested a substitute which I ordered and hope it works."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vicki Pottinger",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T18:45:00.000Z",
          "Titre": "I received my batteries",
          "Contenu": "I received my batteries but like the last order I got they are only normal charged. My first time order through Walmart showed a full charge and are still working after 5-6 months the normal charge ones only last a couple days and then show low, I have to throw away."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "T. Rogers",
          "Nb_Reviews": 4,
          "Date": "2021-09-13T16:22:08.000Z",
          "Titre": "Need larger bundles",
          "Contenu": "I was disappointed I had to limit my choice of options for the premium pro batteries I bought to groups of just 20.  In the past, I'm pretty sure I bought your previous premium version in a 60 pack, which means a lower price per each price.  You almost made me go look at your competitors.Shipping was quick and appreciated!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2021-06-04T14:07:23.000Z",
          "Titre": "Ordered product May 28th",
          "Contenu": "Ordered product May 28th. Today is June 4th and product is still sitting in California facility waiting to be shipped out.  Tenergy website indicated about 3 days shipping time. Understandably, it was a holiday weekend on Monday, but to still be at USPS shipping facility 4 days after holiday is a bit long. My guess won't receive product until sometime next week."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Davidson",
          "Nb_Reviews": 2,
          "Date": "2022-02-09T00:12:12.000Z",
          "Titre": "3 out of 4",
          "Contenu": "Before using the batteries, I cycled them thru 3 discharge/charge cycles, then measured capacity. One of the three was 25% lower than specified capacity. Cycled again and retested, still 25% lower than capacity. The other three tested fine."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Theresa Quenga",
          "Nb_Reviews": 1,
          "Date": "2020-02-25T16:08:37.000Z",
          "Titre": "Although there is good customer…",
          "Contenu": "Although there is good customer service, it took two days to send an email to let me know something was out of stock. Even if I answered the email the day it was sent, the order would not have made it to my grandson for his birthday.  Maybe as soon as an item becomes out of stock, it will flag any orders when ordered then another choice could be made immediately."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Scheurer",
          "Nb_Reviews": 2,
          "Date": "2020-11-10T19:21:16.000Z",
          "Titre": "Worth the Wait",
          "Contenu": "Great product at a reasonable price, but it took an inordinate amount of time (about 10 weeks) to receive it.Quality is solid, appears reliable, and has nice features (LED, variable intensity, and different color temperature options).  All-in-all, if you have to stand a long wait, it's ultimately worth it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "J Meno",
          "Nb_Reviews": 3,
          "Date": "2019-12-09T23:21:41.000Z",
          "Titre": "place them in my arlo camera and the…",
          "Contenu": "place them in my arlo camera and the camera kept disconnecting from the hub. I replaced the batteries with a non-rechargeable energizer battery, and I have no problems with the camera disconnected from the hub. The batteries only seem to work for a short time and for some reason I have to reset the camera when I use Tenergy batteries with the arlo camera."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "L S",
          "Nb_Reviews": 1,
          "Date": "2020-11-10T18:12:52.000Z",
          "Titre": "The buying experience was okay however…",
          "Contenu": "The buying experience was okay however the product did not perform as expected, from the batteries received, one set lasted less than a week while another lasted for a month, all batteries lart of the same package. Havent tried the last set but so far it's been a very mixed experience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Zach",
          "Nb_Reviews": 1,
          "Date": "2018-11-06T18:51:19.000Z",
          "Titre": "Good service, bad QC",
          "Contenu": "Pros: Very nice customer service, replaced defective (expanding Li-Po battery) item very quickly, without hassle or requesting that I return the original.Cons: Defective item was replaced with a second, equally defective item. I probably won’t be contacting customer service again, I’ll just replace the battery on my own, despite the uncommon connector."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Milt Sanders",
          "Nb_Reviews": 4,
          "Date": "2017-09-13T00:57:25.000Z",
          "Titre": "Sub C battery I ordered is too big to fit my Sub C device",
          "Contenu": "I ordered a sub C size battery to fit in a device I have that uses sub C size.  The battery I received from All Battery will not fit in my device.  I wasted my money.  In their behalf, they did give me the battery dimensions, but I didn't check them against my device.  Isn't a sub C, a sub C all the way around?  The two other battery packs I ordered are just fine and I am using them in my RC planes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve Seidensticker",
          "Nb_Reviews": 1,
          "Date": "2017-07-29T03:50:28.000Z",
          "Titre": "Battery Pack Delays",
          "Contenu": "I buy Li-on battery packs.  I get an immediate acknowledgement of the order and a tracking number for the shipment, but often have to wait a week or more for the pack to be made up, shipped, and delivered.Suggestion 1 - Make up and keep in stock the popular packs so that they can be shipped immediately.Suggestion 2 - If the packs have to be made up, provide some indication when that will happen."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 3,
          "Date": "2018-06-13T15:39:04.000Z",
          "Titre": "While they do have great prices and…",
          "Contenu": "While they do have great prices and products, it is very difficult to speak to a sales person and get a quick answer to a question.  You have to e mail, then wait until they respond (usually 2-4 days.  Some of the response's were good, some were general and not really an answer, and vague.If price is your only concern they are great, if you need help and have technical questions, educate yourself elsewhere, then comeback and place your order."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "David Smyth",
          "Nb_Reviews": 3,
          "Date": "2017-05-12T05:25:33.000Z",
          "Titre": "Good products, Very high international shipping charges!",
          "Contenu": "Hi,I am very happy with the products available from 'All-Battery.com', and never had a need to ask for any warranty service.However the international shipping charges are just enormous - this one situation stops me purchasing more often. They have further items I defiantly  would purchase! This shipping cost is compared to other online stores in the USA shipping to this same Aust. address."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shelley Nunn",
          "Nb_Reviews": 1,
          "Date": "2018-08-08T13:53:47.000Z",
          "Titre": "Feedback",
          "Contenu": "I just received my Tenergy Solis Smart Food Thermometer today in the mail and look forward to using it. If I could make a suggestion that the unit be looked at before packaging for future buyers as mine had a large scratch on the face of the unit.  Thank you. I emailed them my concerns with pictures and have not gotten a response."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Crosby",
          "Nb_Reviews": 2,
          "Date": "2016-06-01T16:56:01.000Z",
          "Titre": "one good , one bad",
          "Contenu": "They build a good 4.8 ,2000 ma battery of which I have never had any trouble with. The same company sells a 6.0 volt ,2000 ma battery that I have tested and all I can get out of two them 7.0 volts which is OK but then the most ma I get 150 out of rated 2000 ??????? I called and they did send me a replacement at no charge. I now have two 6.0 volt paper weights. Don't buy the 6.0 volt.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PT",
          "Nb_Reviews": 3,
          "Date": "2021-01-21T14:00:54.000Z",
          "Titre": "Missing Arlo Batteries",
          "Contenu": "Tenergy batteries are fine and the website/shipping is also fine. I am frustrated that I had to spend $70 for a set of 12 rechargeable batteries and charger for my Arlo as it only comes with 12 non-rechargeable batteries. This should come standard with the set. Shady."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Barry Bullard",
          "Nb_Reviews": 2,
          "Date": "2020-04-09T21:35:54.000Z",
          "Titre": "Shipping hiccup.......",
          "Contenu": "I was offered free shipping and given 5 choices.  Turns out free shipping did not apply to all the choices but all the choices were available to choose from.  I use the product and find it works really well.  Just hate that the website did not adjust the shipping choices if all are not free."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Samir Sedek",
          "Nb_Reviews": 1,
          "Date": "2021-04-08T12:11:10.000Z",
          "Titre": "Order took 2 days to be process",
          "Contenu": "Order took 2 days to be process, then one of your sales rep told me the shipping charges are very different than i paid on my order and i have to switch to ups ground if not my shipping will be 160$ in addition to the 93$ shipping charges that i already pay.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Janet Wilkins",
          "Nb_Reviews": 4,
          "Date": "2022-06-28T02:35:10.000Z",
          "Titre": "Products work well but it took way too…",
          "Contenu": "Products work well but it took way too long to receive. 2 weeks!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ethan W.",
          "Nb_Reviews": 1,
          "Date": "2017-11-01T20:51:56.000Z",
          "Titre": "Checkout Troubles Online",
          "Contenu": "The first time I clicked on the final step to process the online payment of my cart, the page failed and reloaded to the beginning of the cart process. This resulted in me having to call them to figure out if the order actually processed or not, which it didn't. Also, the checkout page does not provide a verified secure link for payments, as indicated by the absence of the lock symbol in Google Chrome, IE, and Mozilla Firefox. The products work well though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bruce Howard",
          "Nb_Reviews": 2,
          "Date": "2015-05-26T14:30:03.675Z",
          "Titre": "Need to check stock if your in a hurry",
          "Contenu": "Ordered 15 sub-c batteries with tabs on Monday. Got the tracking number Monday afternoon.  Contacted on chat Thursday and was informed they were out of stock and had to be made. Did ship Thursday. When I received the batteries most of the tabs were not secured very well.  A lot of the spot welds were not done very well and did not adhere. Looked like a rush job.  Had to re-solder most the tabs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Edward Badger",
          "Nb_Reviews": 1,
          "Date": "2015-06-17T22:43:16.827Z",
          "Titre": "Batteries, What Batteries",
          "Contenu": "Ordered batteries on 6/10/2015 in the AM.. Today is 6/17/2015 PM and I still haven't received any batteries. Funny, I ordered two trailer tires on Monday 6/15, and received them on Tues, 6/16, and they were \"free shipping\". Once again I ask. What Batteries.... If these were something I needed quickly I wouldn't be a happy camper, but since I'm not too concerned, it's no big deal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dave Stout",
          "Nb_Reviews": 3,
          "Date": "2015-07-17T02:08:54.686Z",
          "Titre": "Can't get the batteries I need",
          "Contenu": "After a week with a supplied tracking number they email me and told me to disregard the tracking number because what I ordered was out of stock until farther notice.  So I said fine just ship the other battery and I hope I get a lesser shipping fee since it's only one battery.  Well it's been another week and I have heard NOTHING,  nothing,  I dont know whats up.  WHAT'S UP!?  it used to be a good company."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Geoffrey Bailey",
          "Nb_Reviews": 1,
          "Date": "2021-02-10T15:55:04.000Z",
          "Titre": "Mixed bag",
          "Contenu": "The ordering process was fine, but I was supposed to receive a confirmation email that never arrived so I had no idea if my order went through or not.  I had to call your company to confirm myself.  No, there was no email from Tenergy in my junk or spam folders."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "suzanne sawyer",
          "Nb_Reviews": 1,
          "Date": "2016-11-24T00:19:39.000Z",
          "Titre": "Still waiting for service",
          "Contenu": "I ordered a battery for my I Robot Roomba. It came fairly quickly but the battery did not work. It stayed charged for only a short time and got very hot. I contacted the company who told me they would send a new one which would arrive in 1-2 days. I am still waiting. I sent back the old battery as instructed. I tried to call the company during regular business hours but was told no one was available to call back when they were open. I feel very frustrated."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Barry Sawester",
          "Nb_Reviews": 2,
          "Date": "2016-06-10T00:12:59.000Z",
          "Titre": "Your rechargeable AAA batteries do not last long enough",
          "Contenu": "Even though the AAA rechargeable batteries do have a life based on usage, but it seems your batteries do not last 12 charges per year.  I have other AAA rechargeable batteries that I purchased from another firm, and I get twice as many charges and I purchased 3 years ago and they take a charge and their life is far better than your batteries."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kenneth Majchrzak",
          "Nb_Reviews": 3,
          "Date": "2015-07-10T15:25:46.536Z",
          "Titre": "Model Railroad Battery Order",
          "Contenu": "I placed my order on July 2nd but have not received it yet.  According to the tracking e-mail I got it will not arrive until July 15th.  I ordered other parts from three different suppliers on July 2nd and they all have arrived already.  None of my orders had any special shipping.  Based on what is occuring here I can only rate All Battery with 3 stars."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve M.",
          "Nb_Reviews": 1,
          "Date": "2015-06-11T15:03:47.108Z",
          "Titre": "Freight charges",
          "Contenu": "I have now purchased AAA batteries from you twice.  On the most recent order the freight for the batteries was free.  This time I started adding additional items to the order.  I was shocked that the freight for these few items exceeded the price of the products I added.  I removed those items.  I will stick with purchasing just the batteries and purchase the accessories locally.  PS.  On a good note to end, the batteries are fantastic.  Thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sean Torrez",
          "Nb_Reviews": 1,
          "Date": "2021-10-13T15:20:34.000Z",
          "Titre": "Website is not great",
          "Contenu": "Website is not great. Difficult to search.Don't have tabbed versions of each thing that I wanted and don't always have my desired quantities.On the other hand, they did have what I was looking for at a reasonable price."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Don Zacharie",
          "Nb_Reviews": 3,
          "Date": "2017-11-04T22:58:33.000Z",
          "Titre": "I would usually give 5 stars but this …",
          "Contenu": "I would usually give 5 stars but this time I had a problem with the order which qualified for a discount. I went through the cart and checkout process as usual but using my VISA it didn't go through after several attempts. Several days later I refilled my cart but used Paypal and it went through but the cost was about $20 more.This isn't the first time I've had problems ordering and think your system could be greatly improved by simplifying the process.The order was #540740"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Don",
          "Nb_Reviews": 2,
          "Date": "2017-06-10T15:09:31.000Z",
          "Titre": "TLP4000 battery charger.",
          "Contenu": "I just received the TLP4000 battery charger yesterday.  Although I have not had time to check it out, it is the type of charger I was looking for, as I am converting my G scale train engines to battery power.  The type of conversion calls for a charger that has your features. I am looking forward to see how well it works."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Candadian_hamster",
          "Nb_Reviews": 1,
          "Date": "2015-05-13T15:40:13.000Z",
          "Titre": "Reasonable parts cost, exhorbitant shipping costs",
          "Contenu": "No problem with my order. The charge controller and charger were as advertised. However, All Battery charges to Canada are exceptionally high.  Other suppliers that I order from will ship USPS which come right through with reasonable International postage charges. Shippers that use UPS, FEDEX are exposed to over exploited brokerage charges."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-06-26T16:13:24.000Z",
          "Titre": "products are great but took 2 months…",
          "Contenu": "products are great but took 2 months and three shipments to get my three item. 1st shipment only had one item(two were missing) took 6 weeks to get second shipment(sent double of one item still missing the cable) 3 weeks I received my cable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Krystal Flores",
          "Nb_Reviews": 1,
          "Date": "2021-06-02T06:49:00.000Z",
          "Titre": "I find it frustrating that I chose to…",
          "Contenu": "I find it frustrating that I chose to buy the more expensive rechargeable batteries and a year later im struggling to have them keep and hold a charge for more then 45 minutes right off charger now I have to buy all new rechargeable batteries."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kenneth Harper",
          "Nb_Reviews": 1,
          "Date": "2015-07-27T12:29:43.528Z",
          "Titre": "Returned batteries",
          "Contenu": "After sending two unanswered e-mails, trying to order the right batteries for my solar lights, I ordered what I thought was needed. They were the wrong batteries. \rAfter returning the batteries, they did reimburse me for what I paid for them but not the return postage.\rWhy do you have a help line but do not respond to questions!!!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph Minshew",
          "Nb_Reviews": 1,
          "Date": "2017-08-13T19:21:06.000Z",
          "Titre": "I purchased the Tenergy LifePO4 RCR123A …",
          "Contenu": "I purchased the Tenergy LifePO4 RCR123A Battery Charger plus 6 RCR123A LifePO4 400mAh Batteries for my Arlo camera. I have fully charged the batteries and inserted them into my Arlo camera. The Arlo indicates that the batteries are only charged 2%. Are these batteries compatible with Arlo cameras? Any suggestions?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marc Jackson",
          "Nb_Reviews": 1,
          "Date": "2017-12-04T17:33:26.000Z",
          "Titre": "AA rechargeable batteries.",
          "Contenu": "I would have given a higher rateing if I had received the items. It was ordered and shipped on 23 Nov and as of 30 Nov I have not received anything. Finally received the batteries and they were exactly as described and they work great.  I would recommend this site to anyone.Upgraded from a 3 star to a 5 stsr."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nekoda Massey",
          "Nb_Reviews": 1,
          "Date": "2015-08-02T13:52:05.833Z",
          "Titre": "Don't trust USPS",
          "Contenu": "Date of order: 7/24/2015 \rJuly 27, 2015 FREMONT, CA 94539  \r                      OAKLAND, CA 94615  \rJuly 28, 2015 OAKLAND, CA 94615  - the package departed from facility\r The end. Today is 8/2/2015 and still haven't gotten an update on the package yet. (I know its Sunday but I've NEVER GONE 4 days without update). Very frustrating because I even called USPS but the lines were \"busy\" all the time. I actually do not know if it even left the facility."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gordon Mason",
          "Nb_Reviews": 3,
          "Date": "2015-10-17T17:42:44.857Z",
          "Titre": "Tenergy Premuim NI-MH Batteries",
          "Contenu": "Being as I go through so many C batteries and they are sometimes harder to find, I thought I'b buy some rechargeable C batteries. I got the batteries and the charger and charged them up. The charger is nice and works fine, but the batteries drain too fast in my trail cam. I thought being NI-MH, they would last a bit longer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christopher Ortiz",
          "Nb_Reviews": 3,
          "Date": "2015-12-31T01:37:51.304Z",
          "Titre": "Disappointed in shipping......",
          "Contenu": "I ordered the products 1-2 days before Christmas and paid for the next day air shipping.  After checkout I observed the message orders take 1-3 business days to process.  My order did not process until the 28th, 4 days after my order and it did not arrive until the 30th.  Waste of money.  I ordered products from Amazon the same day with next day air shipping and they arrived the next day before Christmas.  I have not tested the products so my review is of order processing and shipping."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CHRIS GARDNER",
          "Nb_Reviews": 2,
          "Date": "2016-03-20T20:35:12.000Z",
          "Titre": "kind of a waste",
          "Contenu": "I bought the 5 in 1 cell meter specifically to test IR as listed. The readings for IR on this tester are pretty much useless and do not match the real readings from a good charger. I emailed all battery but have never heard back. So basically I have yest another regular volt checker. With shipping I just wasted $17.00"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Terry",
          "Nb_Reviews": 3,
          "Date": "2017-07-09T23:22:25.000Z",
          "Titre": "Good Batteries, Sometimes Slow Delivery",
          "Contenu": "I have ordered li-ion batteries several times for my customers.  Deliverieshave been pretty fast is the past, but the last 3 times whey were SLOW.When I called All Battery they have said the batteries were not assembled and that would take several days.  They all ways print the UPS shipping label as soon as they receive your order, but don't actually ship until severaldays later.   I like their batteries and hope they can improve delivery.   It makes it hard for me to quote a delivery for my customers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph D Harkey",
          "Nb_Reviews": 3,
          "Date": "2017-04-24T20:56:37.000Z",
          "Titre": "12AA and 12AAA combo pack orders",
          "Contenu": "I ordered a combo pack 12 AA and 12 AAA. Well last thursday I only received 12 AA I contacted right away to let them know I only got half my order. It;s monday and I still waiting. This has been the only time I've had any issues with them. I've been shopping with them for over a year now maybe two."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BatteryBuyer",
          "Nb_Reviews": 1,
          "Date": "2015-10-25T18:30:14.833Z",
          "Titre": "5 for service - 1 for back order handling",
          "Contenu": "Customer service was outstanding. \r However, you guys let me order something and then to tell me 4 days later it's on back order for 6 weeks ONLY after I called because I saw the UPS package didn't ship out yet for my 2-day shipping!\r Need to be more proactive with back order statuses and information."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RM- CU",
          "Nb_Reviews": 1,
          "Date": "2016-07-15T15:06:21.000Z",
          "Titre": "order cancelled",
          "Contenu": "had a little trouble with the website, and getting a discount - customer service chat person was VERY helpful - finally got order placed....only to find out two days later is was cancelled (not in stock) - otherwise product is wonderful and reasonable. The order cancelled would have been our 3rd placed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda Cziraki",
          "Nb_Reviews": 1,
          "Date": "2016-08-15T17:59:25.947Z",
          "Titre": "Happy with Products & Shipping....Not Happy with Returns Experience!",
          "Contenu": "Have ordered several times with All Batteries.   Very satisfied with what I've purchased and timeliness of receiving product.   However, 1 item recently purchased had a broken part; requested Return authorization and still have not received what I need to return this part.  Not happy about that!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tony Coffman",
          "Nb_Reviews": 1,
          "Date": "2015-08-07T16:44:30.118Z",
          "Titre": "Good customer service.",
          "Contenu": "The web page is a little difficult to navigate.\rI tried ordering online with no luck. The website is a little difficult to navigate. A customer service rep ...Andrew G...did a great job of getting me the batteries I needed. The batteries arrived in a satisfactory time frame. Not Andrews fault but the batteries were shipped in a box that was put in a envelope which was crushed by the UPS company. I can still use the batteries even though they were bent up pretty bad. All in all I would buy from the company again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Van Loon",
          "Nb_Reviews": 3,
          "Date": "2018-06-16T00:55:28.000Z",
          "Titre": "Its been a week since my order was…",
          "Contenu": "Its been a week since my order was placed. I did get a notification on sending me a tracking number when it ships but nothing since. I haven't received any notification on when it will ship. I'm anxious to receive my order. I'm disappointed with why its taking so long."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Bleam",
          "Nb_Reviews": 1,
          "Date": "2017-04-11T00:33:11.000Z",
          "Titre": "Tenergy 438 Battery Charger lack of sufficient instructions",
          "Contenu": "I purchased a Tenergy 438 Battery charger.  I have only had a 2 day experience with charging both AA & AAA Tenergy Batteries, but the instructions are insufficient.  The charger is very simple but final charging indications are not clear.  Also, if someone is not familiar with NiMh characteristics, there is no information. Also, a Plug with Cord comes with the Charger (and that is nice) with no mention at all.  I intend to discuss some more detailed points with All Battery and with Tenergy design personnel within the next few days."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wesley Morita",
          "Nb_Reviews": 1,
          "Date": "2018-10-26T05:58:06.000Z",
          "Titre": "My order of Tenergy rechargeable…",
          "Contenu": "My order of Tenergy rechargeable batteries and charger arrived pretty fast.....in just 4 days so that was great!  But when I installed the 4 batteries into  my Arlo Camera the charge was only 26% full.....you would think if it was new batteries the charge would be full power 100%....somehow I don't feel that's right...but after charging the batteries up my camera went to 96% which is acceptable to me......so all in all..that's why my rating is 3...it would have been 5 if the batteries went up to 100% right from the start without having to charge up...."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Randy Richardson",
          "Nb_Reviews": 2,
          "Date": "2019-12-18T23:05:31.000Z",
          "Titre": "The battery packs I bought seem to be okay, but the product support and documentation is lacking.",
          "Contenu": "The battery packs I bought seem to be good, but the charger only worked to charge each battery one time.  After that, it doesn't do anything except the start-up blinking.  The support for the product is less than minimal.  I am an electrical engineer with 36 years experience and the help they gave didn't help at all.  I finally just purchased 2 more units with the hope for better results.  If they work about the same I will abandon Tenergy as a source.  This rating is for the battery pack.  May be a good product, but lousy support.  I would give much higher if the support was better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Miller",
          "Nb_Reviews": 1,
          "Date": "2017-05-23T01:28:38.000Z",
          "Titre": "I don't like that you create a shipping …",
          "Contenu": "I don't like that you create a shipping label before the items are ready to ship.  A shipping label was created on the 16 th and it is now 6 days later and it still has not shipped.  If one item is holding the shipping up then call/ email asking if I would like split shipping."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aaron Raufman",
          "Nb_Reviews": 2,
          "Date": "2016-06-02T14:05:05.000Z",
          "Titre": "Decent Prices, Poor Ordering Process",
          "Contenu": "I placed an order for a 14.8v 4400mAh battery pack and only was made aware that this is an \"AP\" (apparently meaning assembly required) item after purchasing. All-battery.com was eager to send me tracking info shortly after my confirmation, only to have it remain in the \"Ready for UPS\" status ever since. It's been 8 days and counting and the tracking is still \"Ready for UPS\". I'm not entirely dissatisfied, but all-battery.com wanted to me leave a review for them; before I receive my order? So this is what they get."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas Mays",
          "Nb_Reviews": 1,
          "Date": "2015-07-04T23:48:50.766Z",
          "Titre": "Purchase of battery for Roomba",
          "Contenu": "I all very pleased with the battery and the service I received.\rI have tried several times to order a second battery for a friend and can't get it ordered. I keep getting told my password is incorrect and I will be getting a email that doesn't come.\r    HELP\rTom Mays"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JESSE ROBINSON",
          "Nb_Reviews": 1,
          "Date": "2017-07-16T20:47:10.000Z",
          "Titre": "Haven't received my battery yet as I'm …",
          "Contenu": "Haven't received my battery yet as I'm am using it for a replacement for my Marshall Kilburn Bluetooth speaker.  Shipping is taking a little longer than expected but that would be fine if I receive exactly what I order. Let's keep our fingers crossed"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph Labeck",
          "Nb_Reviews": 1,
          "Date": "2015-11-18T14:51:48.614Z",
          "Titre": "I would give them another chance",
          "Contenu": "Price and delivery times were both excellent. The quality of the batteries, however, was inconsistent.  While the AA and AAA were both fine, the 9-volt battery registered as nearly dead. It could have just been a random mistake. If it happens again, I would get upset."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Armand C",
          "Nb_Reviews": 2,
          "Date": "2020-04-25T20:19:48.000Z",
          "Titre": "Felt cheated.",
          "Contenu": "Everything was great,the products I needed, the ease of ordering.One problem.  One hour after I completed my order, I received an e-mail offering a 10% discount if I completed my order which I already had done.What's up with that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mozell Young",
          "Nb_Reviews": 1,
          "Date": "2017-08-05T23:19:53.000Z",
          "Titre": "To be fair",
          "Contenu": "To be fair, I had to wait to respond to this review. I ordered two batteries for my helicopter with the hopes that they would arrive before it did. I got the batteries in three days but they were the wrong ones! It took a day before I got a RMA . I was told I would receive a refund after they received the wrong batteries back and that I would have to reorder to get the batteries I want. My helicopter, my charger, transmitter are all here ... but no batteries! I finally got the refund but I don't want to go through that again! It is a shame because they had the best price for a quality battery!"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Unhappy customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-12T17:04:33.000Z",
          "Titre": "Will order from Tenergy again",
          "Contenu": "Will order from Tenergy again. The provided shipping options were incorrect for shipping batteries so shipment was delayed. I got credited for the lower cost of ground shipping but had to pay brokerage fees."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Larry Prover",
          "Nb_Reviews": 2,
          "Date": "2015-07-09T12:16:10.174Z",
          "Titre": "What Happened!",
          "Contenu": "I always liked ordering from your company, and the big reason was because I would receive my order in two or three days. This order I've been waiting a week so far and still haven't received it, maybe it will come today.  Thank You for listening,  Larry"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2019-08-26T15:11:54.000Z",
          "Titre": "The batteries are priced well but the shipping cost is outrageous.",
          "Contenu": "The batteries are priced well but the shipping cost is outrageous. I would have purchased over $70 worth of batteries except the shipping charges were in the $30 range. For that reason, I just ordered what I couldn't get in the store."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eileen P",
          "Nb_Reviews": 3,
          "Date": "2021-04-03T14:46:05.000Z",
          "Titre": "Batteries are just way too expensive",
          "Contenu": "Batteries are just way too expensive, especially because they don't last long, unless you put the cameras in an inconspicuous place where they get no action.  Otherwise, they just get eaten up way too fast."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Howard Miller",
          "Nb_Reviews": 1,
          "Date": "2021-01-16T20:23:19.000Z",
          "Titre": "Recent order of Centra  batteries and…",
          "Contenu": "Recent order of Centra  batteries and charger No problem with batteries or charger, but I feel the charger should come with better instructions on diagnosing battery problems and what to expect when using REFRESH"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Deborah Keirnan",
          "Nb_Reviews": 2,
          "Date": "2017-08-05T12:10:03.000Z",
          "Titre": "Amazing that I was charged close to …",
          "Contenu": "Amazing that I was charged close to $15.00 for shipping and it has taken forever. Now I am being to review my experience and I still don't have my order. So I you order, be aware that it takes forever and they charged you a unbelievable fee."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeannene Jones",
          "Nb_Reviews": 1,
          "Date": "2021-04-09T14:58:29.000Z",
          "Titre": "five of the batteries did not power on…",
          "Contenu": "five of the batteries did not power on anything I tried them out in one that was working and they did not power up the lights so I put them in the sun and it still did not work other than that they were fine"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2018-05-10T15:40:47.000Z",
          "Titre": "Service review?  Really?",
          "Contenu": "I don't even have the batteries yet, so sort of tough to do a review on the service.  They won't even be here for another day or so.  They might want to hold off on asking for the service review till I actually have the product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Milt Sanders",
          "Nb_Reviews": 4,
          "Date": "2017-07-30T20:33:39.000Z",
          "Titre": "Nicad Single Cell batteries",
          "Contenu": "The batteries I found and ordered were exactly what I needed, and they arrived quickly and in good shape.  My problem is with your business model forcing me to purchase more than what I wanted (minimum order of $12) when I simply wanted about $9 worth.  No one else I have dealt with has a minimum purchase quantity, although when a $2 purchase has a shipping charge of $7 to ship (Like Radio Shack), I don't make a purchase.  The only reason I made this purchase is that I couldn't easily find these specific batteries (high capacity Nicad) in other places without fear of getting a small capacity battery in a larger nearly empty case."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Edward Brown",
          "Nb_Reviews": 2,
          "Date": "2015-07-31T23:02:33.892Z",
          "Titre": "Good service poor product",
          "Contenu": "Liked the product, but the batteries only lasted a year. Out of 12 batteries only two are still working. And the newest set I ordered still have not come in even though it was supposed to be here yesterday and haven't came in today either."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Long Time Customer",
          "Nb_Reviews": 2,
          "Date": "2015-05-28T02:06:18.556Z",
          "Titre": "Excellent  products and service-BUT------",
          "Contenu": "I have been buying batteries from All-Battery for many years.The NIMH batteries are excellent and the prices are very fair.The delivery is prompt.Now that they use USPS priority mail I expected their shipping price to be reasonable but I feel that charging $11.45 for shipping 13 sub C NIMH\rbatteries in a USPS flat rate envelope that retails for $4.95 is punitive.I love their products but for a company to make extra profit on shipping is not right.I know they will claim part of the charge is \"handling\", is no excuse.\r      This is my opinion and I'm sure others feel the same way and no longer do business with All-Battery."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris Bailey",
          "Nb_Reviews": 1,
          "Date": "2018-06-18T13:42:52.000Z",
          "Titre": "There's no guarantee/warranty",
          "Contenu": "There's no guarantee/warranty. One of the 8 batteries that I purchase was faulty and I received no response or interest from All Battery about a replacement. The good news is that the other 7 have been working well so far."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Hopper",
          "Nb_Reviews": 2,
          "Date": "2016-05-31T14:32:54.000Z",
          "Titre": "Returned Charger",
          "Contenu": "I ordered a charger that did not function properly.  I sent it back and got 3 emails asking questions about what was wrong.  I told them the problem and have not heard from them again, nor have I received a new working charger."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2021-01-14T00:36:30.000Z",
          "Titre": "When I put this battery in the Arlo…",
          "Contenu": "When I put this battery in the Arlo camera, the Arlo application showed that the camera has only 85% of power.  I expected at least 95%.  Now I am waiting to see how long these batteries last."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "richard",
          "Nb_Reviews": 1,
          "Date": "2018-01-30T13:11:41.000Z",
          "Titre": "Hello",
          "Contenu": "Hello, I haven't received my order yet, supposed to be here 01-26-18, still not here, not a good thing, I received emails on delivery date, still haven't  received my order yet. not happy, thanks richard mills"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nathaniel Du Pree",
          "Nb_Reviews": 4,
          "Date": "2020-01-19T12:55:33.000Z",
          "Titre": "Long Process",
          "Contenu": "The purchasing process is to long and frustrating. I used Paypal as a choice to buy.  I still had to go through the new customer process. You should not have to go through this if you purchase via Paypal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Hawk",
          "Nb_Reviews": 3,
          "Date": "2015-05-13T02:19:22.000Z",
          "Titre": "Nice lamp, but zero service",
          "Contenu": "Tenergy T-1800 LED lamp works great, but it arrived without the promised adjustment wrench.   I called customer service and didn't reach anyone - I had to leave a message informing them of the problem - no call back."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2017-03-25T01:29:15.000Z",
          "Titre": "Too bad shipping needs to be so much",
          "Contenu": "I feel the info on the website and quality of the batteries are good. I have ordered batteries to rebuild battery packs for many of my power tools. The only thing that I find as a deterrent is the cost of shipping."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Neff",
          "Nb_Reviews": 7,
          "Date": "2017-11-18T19:15:57.000Z",
          "Titre": "Your website is clunky",
          "Contenu": "Your website is clunky, has several categories with no product.In credit card verification, however you set it up, it has to be copied exactly like the statement where most sites just need your address to be valid... that meaning, it seems if the apartment number is first or second, or on the same line or if something is abbreviated like W for West the smallest variation and it fails. It's frustrating to use, my last two orders it took over six tries each, I was locked out each time for some unspecified period. If it actually remembered the correct address from the last time I ordered perhaps it would be fine but still I had to go through it all again without knowing which parameter was the problem."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Barry Cantor",
          "Nb_Reviews": 1,
          "Date": "2020-11-10T18:22:27.000Z",
          "Titre": "Pricy",
          "Contenu": "No issues with my order. I just feel that your prices are higher than they should be but since you’re the only game in town, I was forced to purchase my Arlo batteries and charger from you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kristi",
          "Nb_Reviews": 1,
          "Date": "2015-07-16T14:36:38.562Z",
          "Titre": "Could be better....",
          "Contenu": "Expensive pricing and NO option to ship on a customers account.  If I found my product elsewhere and the competition allows me to ship on my account, I will buy from them.  The bottom line rules the business world."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Al Purdon",
          "Nb_Reviews": 1,
          "Date": "2016-06-04T14:37:26.000Z",
          "Titre": "Moderate with disappointments !!!",
          "Contenu": "Ordered #01436 TB6AC.. charger and #31340 Lipo Battery back in Dec, as usual didn't to that part of the project of running 4 313rpm motors.  Got the battery down a bit and decided maybe a good time to check the charger.  The charger wasn't the same as the manual, after contact with support, it was determined to try a different charger, which I ordered, the screen now shows a message not in the manual.  It was after 90days, so they wouldn't do an exchange, but after scanning the manual looking for the screen display, the warranty and service section shows 1 YEAR.  So Monday will be a support call, You should have waited a few days to ask for the review. Thanks, let's get it working!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Warren S",
          "Nb_Reviews": 1,
          "Date": "2015-12-04T21:35:00.198Z",
          "Titre": "Actual mAH are 70% to 80% of stated values on 4 battery types I bought",
          "Contenu": "Except for the overly optimistic Amp Hr ratings the batteries worked good.\rAAA 1000mAh Tenergy Premium NiMH cells had 710mAH @ 300ma.\rAA 2500mAh Tenergy Premium NiMH cells had 1950mAH @ 300ma.\rSub C 2200mAh NiCd  Tenergy cells where 1850 mAH at 300ma load.\r Tenergy SideKick Storm Kit Portable LiFePO4 Power Bank rated at 13600mAH capacity  was 9400mAh. (using four 2.3 AHr 3.2V cells.) \rThis provided only 2.3 AHr on the 12V output at 4A load.\rThis is enough to charge my small laptop about 25% using the 19V output.\rThe 12V jumper output provided about 200 CCA for 30 sec total, in 5 sec burst. Probable not enough to start 30 cars as stated but at least good enough for more than one quick starts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bonnie Kopko",
          "Nb_Reviews": 2,
          "Date": "2015-12-28T15:01:23.948Z",
          "Titre": "First Time Loss",
          "Contenu": "Shipment was short of product ordered. Have always recived products with out incident.  Still working on tryng to recover missing items.  Everything else was great.  Shipping needs to be a little more acceptable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David  Ross",
          "Nb_Reviews": 1,
          "Date": "2021-06-03T10:14:52.000Z",
          "Titre": "Rather slow response to my orders my…",
          "Contenu": "Rather slow response to my orders my 1st order has not been filled yet I have  God noticed that my 2nd order Has been  Filled Hopefully this is not the way the discompany works"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Edwin Collins",
          "Nb_Reviews": 1,
          "Date": "2016-09-01T18:45:37.000Z",
          "Titre": "tracking problem",
          "Contenu": "I ordered a few lipo batteries on 8/25. On 9/1 there is a UPS tracking no. with no indication that my items were shipped but my CC was charged.Your order number is: 518888Date of order: 8/25/2016 9:59 AM"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sharon Duble",
          "Nb_Reviews": 1,
          "Date": "2016-09-17T00:31:54.000Z",
          "Titre": "It took a couple of days to tell me I couldn't get one item",
          "Contenu": "They did contact me and said there was one like I ordered. Also thought they could have rushed it to get it here in time for 8 year ld's birthday because of the delay. Also the postage was outrageous."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Unsatisfied Customer",
          "Nb_Reviews": 4,
          "Date": "2020-02-06T04:10:29.000Z",
          "Titre": "Very happy",
          "Contenu": "Very happy. Was received in a very timely manner Only one problem inner box was torn on one corner and outer packaging  too Would have given 5 stars if wasn't  for those torn packages"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "WILLIAM HENDERSON",
          "Nb_Reviews": 3,
          "Date": "2018-10-05T20:05:06.000Z",
          "Titre": "A real pain in the ____",
          "Contenu": "Even though the ship to, the billing,the credit card and my home all have the same name and address they would not ship until they were able to speak to me on the home phone to verify the order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gail Phillips",
          "Nb_Reviews": 1,
          "Date": "2016-01-20T15:39:28.796Z",
          "Titre": "No return information",
          "Contenu": "I ordered a battery for a dental instrument that matched the model number but the connector to the piece was not the right size.  There was nothing in the packaging that indicated an option for return."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "kevin storm",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T12:59:45.000Z",
          "Titre": "good rechargeable batteries",
          "Contenu": "good rechargeable batteries , investment that will save you money if using frequent batteries !!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy Meinert",
          "Nb_Reviews": 3,
          "Date": "2023-06-05T18:07:48.000Z",
          "Titre": "TENERGY HAS BEEN SUPPLYING THIS…",
          "Contenu": "TENERGY HAS BEEN SUPPLYING THIS BATTERY TO US FOR QUITE A WHILE NOW.  ANY PROBLEMS THAT COME UP ARE QUICKLY HANDLED AND RESOLVED.MAIN ISSUE IS WE CAN NOT SCHEDULE FUTURE SHIP DATES ON OUR ORDER. WE ARE A CONTRACT MFR AND OUR CLIENTS PLACE AN ORDER FOR THEIR YEARLY REQUIREMENTS WHICH WE SCHEDULE PRODUCTION DATES IN THE FUTURE TO MEET THEIR NEED BY DATES.  IT WOULD BE BEST THAT WE SCHEDULE DUE DATES ON ONE ORDER OUT TO ONE YEAR AHEAD."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Philip Hanks",
          "Nb_Reviews": 5,
          "Date": "2023-07-07T21:00:10.000Z",
          "Titre": "Your batteries are rated very highly",
          "Contenu": "Your batteries are rated very highly. I haven't received them yet, but don't expect any problems. I have a Tenergy battery charger. My only disappointment was an account was created for me when I didn't ask for one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marcia Miller",
          "Nb_Reviews": 2,
          "Date": "2023-07-28T19:14:30.000Z",
          "Titre": "I purchased a dehumidifier",
          "Contenu": "I purchased a dehumidifier, and upon opening the box, the water tank was missing. I emailed Tenergy, and when no reasons I called (total of 2-3 days). Then 3 days later the water tank was at the door. Ps: I haven’t looked at the water tank yet as I just picked it up the package."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bear",
          "Nb_Reviews": 3,
          "Date": "2022-12-14T16:12:01.000Z",
          "Titre": "Tenergy VS Interstate",
          "Contenu": "These work great in my Trail cameras. Do not purchase Interstate rechargeable AA batteries they fried two of my trail cameras by leaking. but the Tenergy Pro Works great Wish they held a charge like store bought. But technology is not there yet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen BRUNNER",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T20:43:09.000Z",
          "Titre": "Battery Charger Order",
          "Contenu": "Young lady was very professional and helpful when followed up on purchase made on line.  Only gave 4 stars, however, as made call because never received E-mail acknowledging order with number and tracking data although was sent customer survey request.  No real problem, just felt compelled to make call after several days to confirm order was in fact on the way (which it was)."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Eric Carter",
          "Nb_Reviews": 1,
          "Date": "2022-08-03T18:07:07.000Z",
          "Titre": "Tenergy Online Shipping Costs",
          "Contenu": "The customer service was excellant at Tenergy Power but their online shipping costs consistently on their website is outrages.  Reguardless of the quantities ordered, the shipping costs often costs far more then the items.  They need to get a grip on this as many are turned off as soon as they see the delivery costs!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Catalano",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T23:41:50.000Z",
          "Titre": "The site was easy to use",
          "Contenu": "The site was easy to use.   I was able to find what I was looking for.. The only problem that caused me to just give 4 stars, is that it was hard to see  that the red (Pos) wire was on the round end and not on the square of the connector (Found out when it arrived) which made me have to improvise tagging the wires to avoid ruining my equipment.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keith O",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T19:44:57.000Z",
          "Titre": "Outstanding!!",
          "Contenu": "Order was quickly filled. It delivered days earlier than it first showed. I've ordered several types of batteries and charging PCB boards (Protection Circuit Modules) - never disappointed.I would recommend them to a friend!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 4,
          "Date": "2022-07-11T16:01:06.000Z",
          "Titre": "Tenergy Premium NiMH C 5000mAh…",
          "Contenu": "Tenergy Premium NiMH C 5000mAh Rechargeable Batteries 8-pack & charger.Easy to purchase and reasonably quick shipping. I am changing the batteries at this time and have not used them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shane Neal",
          "Nb_Reviews": 2,
          "Date": "2022-11-26T21:03:03.000Z",
          "Titre": "Price of AA and AAA seem good",
          "Contenu": "Price of AA and AAA seem good, have not used any yet to rate their longevity. The $1.29 battery tester would embarrass me to sell or give away even. No real indication of battery status. One light, says good on one side of it, replace on the other. Let’s just call it bad."
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "Jhonathan Posada",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T21:27:39.000Z",
          "Titre": "Account access should be fixed for a…",
          "Contenu": "Account access should be fixed for a better customer experience. However, the sale service is very sure and reliable, and the support help you with information about your orders."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Martin Ruiz Moreno",
          "Nb_Reviews": 1,
          "Date": "2022-06-23T22:30:21.000Z",
          "Titre": "Ordered material was hazardous for air…",
          "Contenu": "Ordered material was hazardous for air transportation. However that was not clear prior to complete the ordering and had to be fixed after ordering.It would be great to have this information in advance of the purchase"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Minh Mach",
          "Nb_Reviews": 1,
          "Date": "2022-11-26T02:16:16.000Z",
          "Titre": "I order two battery one of them the…",
          "Contenu": "I order two battery one of them the taps fell off.  I used the second one installed in my toothbrush it worked great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keith",
          "Nb_Reviews": 5,
          "Date": "2023-03-09T04:27:01.000Z",
          "Titre": "They saved my light…",
          "Contenu": "Found a battery for a rechargeable light at a reasonable price. The lead time was just as they had said"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-12-24T04:32:45.000Z",
          "Titre": "Good prices and easy checkout",
          "Contenu": "Good prices and easy checkout.  However, I could not see my order details at a later date/"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gerald",
          "Nb_Reviews": 2,
          "Date": "2022-11-19T21:23:07.000Z",
          "Titre": "Exactly what I needed",
          "Contenu": "Finding and ordering was very easy.  The shipping was fast and the product was first rate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "albert whyte",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T04:15:56.000Z",
          "Titre": "Valuable Products",
          "Contenu": "Easy listening with clear choices and description."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paula R",
          "Nb_Reviews": 1,
          "Date": "2022-06-23T15:45:33.000Z",
          "Titre": "Perfect so far...if delivered as…",
          "Contenu": "Perfect so far...if delivered as promised I would give 5 stars"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roy Hendershot",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T15:39:28.000Z",
          "Titre": "I missed the website having a compare…",
          "Contenu": "I missed the website having a compare feature, to compare the premium battery to the regular battery"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randy Daye",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T14:39:10.000Z",
          "Titre": "Fast and reliable",
          "Contenu": "It was easy to find what I was looking for and the process was easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "everett",
          "Nb_Reviews": 4,
          "Date": "2023-09-12T13:15:33.000Z",
          "Titre": "great customer support",
          "Contenu": "web site wanted to charge for shipping"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tommy Cunningham",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T03:45:05.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping, good service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis Meyer",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T16:27:22.000Z",
          "Titre": "After numerous attempts to place an on…",
          "Contenu": "After numerous attempts to place an on line order form with out success. I then left a recorded message seeking help from customer assistance. Side note. The failure to process the order was on my end as I was not  completing the order form correctly. My request for help was provided in a timely manner by email and the shipment was sent. THANKYOU everbody."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary M",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T17:42:27.000Z",
          "Titre": "Nice Batteries/Website Could be Better",
          "Contenu": "I found the website to be a bit confusing, but after multiple filters and searches I found exactly what I wanted. Price and selection were good. Batteries came very well-packed and in a reasonably speedy timeframe. I haven't tried the batteries yet but I'm sure they will be of high quality."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Buki Aloha",
          "Nb_Reviews": 2,
          "Date": "2022-06-02T11:10:10.000Z",
          "Titre": "Has the batteries",
          "Contenu": "Reordering batteries after four years of service.  The website was very finicky about accepting credit card payment on tries with two different cards due to failure of exact match of billing address and had to process payment via telephone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "EMORY HUTT",
          "Nb_Reviews": 2,
          "Date": "2022-12-11T14:50:35.000Z",
          "Titre": "I like the ease of online shopping"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 4,
          "Date": "2022-01-12T04:51:56.000Z",
          "Titre": "Good prices",
          "Contenu": "I am only giving 4 stars because I haven't got my purchase yet. Prices are good and I like the batteries. I have not purchased from them before but I have their batteries from another store's purchase. The shipping time seems to be good. Ordered Monday, supposed to be here Saturday.If that happens, I would give 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Maxime Brousseau",
          "Nb_Reviews": 1,
          "Date": "2021-11-05T11:36:32.000Z",
          "Titre": "Shipping to Canada",
          "Contenu": "We are situated in Canada, we needed 10 batteries to test them before we buy few thousands, but the only shipping option offered on your website cost 150$.I spoke to your amazing customer service and they found a good shipping option for 34$. Your website should offer more than one shipping option, with a range of price.have  a nice day!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Hedden III",
          "Nb_Reviews": 1,
          "Date": "2021-12-08T11:14:25.000Z",
          "Titre": "The order experience was fine however I…",
          "Contenu": "The order experience was fine however I do not like you telling me how to write an order review or as you title how to write a useful review. I am quite capable Of writing reviews since that Basically what's my job for the last 35 years. Now that I'm in my mid 60s I don't need you telling me how to right I want to catholic school both In elementary and high school and University at state of Delaware. Thank you for your time and consideration in this matter, please have a good day.YoursJohn Hedden"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelle Williams",
          "Nb_Reviews": 2,
          "Date": "2021-11-08T17:39:08.000Z",
          "Titre": "Fast Delivery",
          "Contenu": "Ordered Online, customer service agent was very helpful when thinking about the purchase & delivery was really fast.  Ordered on Friday afternoon and received order on Monday morning. Our company ordered the Combo: TN145 8-Bay AA/AAA NiMH/NiCd Charger + 8 AA NiMH Rechargeable Batteries961001"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "I Martinez",
          "Nb_Reviews": 1,
          "Date": "2021-02-16T15:12:35.000Z",
          "Titre": "Dear Agent,",
          "Contenu": "Dear Agent,1) I asked a question using the chat and never received a response2) I used my credit card and was rejected (3 times), I called my bank they never received the transaction.3) My billing address is a PO Box for security reasons and the delivery address is my Hone addr3ess,  I placed an order 4 years ago and requested to be delivered to my PO Box and I still have the envelope as evidence.Thank you.Regards,Ivan"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "bill",
          "Nb_Reviews": 3,
          "Date": "2021-02-07T19:53:11.000Z",
          "Titre": "For Arlo Security Cams",
          "Contenu": "First time buyer after two sets of non-rechargeables for our Arlo Security cams.  FAST shipping.  Appears to be quality product (battery) and very nice charger.  Charging is not fast but the charger is well-designed.  Time will tell how long they last and how many recharges they take.  4/5 because I do not have performance history and the price was on the high side."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jet Hajec",
          "Nb_Reviews": 1,
          "Date": "2021-01-16T00:33:28.000Z",
          "Titre": "After 1 short season of use",
          "Contenu": "After 1 short season of use, my beanie speaker battery died.  It will not take a charge this season less than a year later.  Customer service says I need to keep this charged every once in a while.   Who knew?  They discounted a new speaker/battery combo for my beanie which I purchased.  Good service, but still bummed the speaker/battery in my beanie died in less than 1-year."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald Mcgee",
          "Nb_Reviews": 2,
          "Date": "2021-01-01T02:44:33.000Z",
          "Titre": "Pleased so far,",
          "Contenu": "Pleased so far,I'm very pleased with the price and quick delivery of the batteries I ordered during this corvid 19 virus and Christmas holiday season, however I am not as pleased with the batteries because when I placed 4 of them in my Arlo camera it showed only 82% charge, so I could not give 5 stars but we will see if they hold up as long as the more expensive brands."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Philip Sargent",
          "Nb_Reviews": 34,
          "Date": "2021-10-17T01:15:39.000Z",
          "Titre": "AAA rechargeable batteries",
          "Contenu": "I was very upset that this item hadn't shipped. However , I did receive the batteries today. I received the batteries before I received your notice of shipment...Kind of backwards, don't you think. You can lose customers that way. Glad I have the batteries now.  Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wayne Miller",
          "Nb_Reviews": 4,
          "Date": "2020-11-09T17:46:01.000Z",
          "Titre": "I am a big fan of Tenergy NIMH…",
          "Contenu": "I am a big fan of Tenergy NIMH rechargeable batteries.  I just got an order of 16 AAA batteries.  There was a hole in the shipping bag big enough to empty the contents (Shame on the USPS.)  Miraculously, although one of the bundles of 4 batteries was broken, all of the batteries were still inside.  Great batteries.Maybe extra care in wrapping before putting stuff in the hands of the shipper."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J Stassin",
          "Nb_Reviews": 1,
          "Date": "2020-12-06T04:56:19.000Z",
          "Titre": "Rechargeable reliability",
          "Contenu": "I am a car electronics guy and have found that the gold lithium-ion worked for exactly what I needed them to to do with my bright my head lamp that uses 18650 3400mah  6- 8 hour a day, and have used only two sets for almost two years, have gone well over  the life cycle. Really great paired with the smart charger, best money spent on batteries in a long time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mr Blizzair",
          "Nb_Reviews": 1,
          "Date": "2020-11-22T00:08:36.000Z",
          "Titre": "4 Stars",
          "Contenu": "The whole process would be 4 stars! Price is decent and the process from start to finish was easy and pretty fast, but the only issue was the status of my order never changed from the day I ordered it until the day I received my items! Keeping customers informed of the status of their would ease a little frustration but overall a 4 star process!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bradley Rinehart",
          "Nb_Reviews": 5,
          "Date": "2020-11-20T13:44:10.000Z",
          "Titre": "Website is a Little Difficult",
          "Contenu": "Website is a Little DifficultI was introduced to your products by Reconyx.I was able to place our order via your website. However it was a little difficult to find the area on your web site that is intended for ordering. It appears that part of your web site is designed for quoting. Another is designed for on line sales. Also, your web site references Streamlight but it appears that you do not sell their product.Suggestion, make your products in the USA."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Prusinski",
          "Nb_Reviews": 1,
          "Date": "2020-12-18T03:11:33.000Z",
          "Titre": "Could have been 5 Stars!",
          "Contenu": "Could have been 5 Stars!The only reason it isn't  the area's where the Battery types are selected should be color Marked, like all of them under rechargeable be one color and the standard rechargeable under a different color, I seemed to keep looking under the wrong one, not a big deal but could be improved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 4,
          "Date": "2021-04-11T12:54:10.000Z",
          "Titre": "Long life batteries",
          "Contenu": "I like being able to reuse these batteries and they seem to last a long time (not my first purchase but others still working fine). Shipping is my least favorite part because it took quite a while to get here and I don't want to pay a fortune for that. But  definitely a quality product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Virginia B Gornto",
          "Nb_Reviews": 1,
          "Date": "2020-03-17T13:17:31.000Z",
          "Titre": "Could not complete order on-line and…",
          "Contenu": "Could not complete order on-line and could not reach someone right away to manually complete.  Setting up account and finding product was fast and easy, just would like to be able to complete actions at one time rather than having to call and complete, or wait for a callback to complete my order on a busy day for me.  The Customer Service person was very nice, apologetic, and completed the transaction quickly once we were in touch.  Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis Loewen",
          "Nb_Reviews": 2,
          "Date": "2019-08-09T15:22:22.000Z",
          "Titre": "Your website is very easy to navigate…",
          "Contenu": "Your website is very easy to navigate to find my item.  I was able to place the PO by sending it to the link that process PO.  However, it took a couple of days before anyone contacted me to let me know if anyone received the PO so I placed the same order online.  It would have been nice if there was an automatic response sent to the customer email to let them no they have received my order and it's in process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandra",
          "Nb_Reviews": 5,
          "Date": "2020-11-10T17:23:42.000Z",
          "Titre": "Chargeable Batteries $$",
          "Contenu": "I love the idea of charging my batteries as needed. The price was expensive to me, but over time I will get my money worth. I’m not sure why they drain really fast with the Arlo cameras though. I have to change them every three to four days. I didn’t have this problem with the non chargeable batteries."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "k g",
          "Nb_Reviews": 3,
          "Date": "2021-12-02T22:54:07.000Z",
          "Titre": "I have been getting my batteries from…",
          "Contenu": "I have been getting my batteries from them for a good while now.  The only reason I gave them 4 stars is, the update from ordering to being shipped is off.  The day it says my order has been shipped, I actually received them in the mail."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Wagner",
          "Nb_Reviews": 4,
          "Date": "2019-12-14T01:23:58.000Z",
          "Titre": "So far a good experience and good price.",
          "Contenu": "Have not received the batteries yet, but expect they will perform as expected since recommended by Arlo.Purchase was easy other than wondering about the application of the discount code. Did not show up until the last screen so I was not sure if the price shown was before or after discount. Finally, everything worked out okay.Price for non-rechargeable batteries, even before discount, was less than I paid on Amazon 4 years ago.Shipped the next day after order placed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2019-01-03T23:52:54.000Z",
          "Titre": "good phone customer service",
          "Contenu": "good phone customer service. however, when completing the order, the ordering system via phone support was providing a ridiculous cost estimate for simple shipping of the item. the customer service rep had to contact the shipping department to correct the shipping cost.order was received without a problem. The batteries are operating without problem after 30 days of use"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kyle Scott",
          "Nb_Reviews": 1,
          "Date": "2020-10-18T16:32:40.000Z",
          "Titre": "It worked as promised,but . . ..",
          "Contenu": "It worked as promised, but wouldn't take my viable credit card - has to use PayPal to purchase the battery charger and batteries. I still don't understand what the real reason was though. The charger worked perfect as with a old depleted one - charging it sooner than expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Kozloski",
          "Nb_Reviews": 3,
          "Date": "2017-12-04T17:59:28.000Z",
          "Titre": "Great Stock, great delivery. But not responsive for items they need to modify.",
          "Contenu": "They carry a great stock of just about every battery or accessory you could want.  Just don't try to get them to modify one the sell.  The carry 4 square 7.4V 4400mAh battery that a lot of us model train enthusiasts would like to be rewired as a 14.8V 2200mAh battery so we can buy from them.  After four years of requesting the mod I finally found them from another source."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Giem",
          "Nb_Reviews": 1,
          "Date": "2018-01-27T23:20:28.000Z",
          "Titre": "Over the short time I've had the unit",
          "Contenu": "Over the short time I've had the unit, it is working satisfactorily. Using a voltmeter, I have verified that the charger does drop back to a trickle charge mode when the LID changes from red to green.I am a bit confused as to why two replacement fuses were included in the package since I cannot find anyplace on the unit where they can be utilized."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mooser",
          "Nb_Reviews": 3,
          "Date": "2019-12-21T00:46:20.000Z",
          "Titre": "Wrong battery placed in package",
          "Contenu": "Wrong battery placed in package and was shipped to me. I had to work through a slow RMA process to return this battery before getting the part that I originally ordered. This happened during the busy time of the year, at year's end and a promotional sale was also going on..  so it is excusable to me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David McKinnney",
          "Nb_Reviews": 1,
          "Date": "2020-11-10T22:58:07.000Z",
          "Titre": "Nice Roof and Gutters Poor Workmanship!",
          "Contenu": "Roof seems to be great and Gutters are good but the installation crew had to come back for quality issues with installation of Dormer Flashing (I am now happy with the second time fix), They broke my Solar Flood Lights and they didn't clean the nails up well enough by far. Even after the Rep. went over it I have found 50 plus more roofing nails. I found over 250 roofing nails with many of them still stuck with the support washers 1 1/2 in. They were messy and plenty of people working as they took off leaving a Mess. Sincerely and Respectfully, David McKinney."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Steppy",
          "Nb_Reviews": 1,
          "Date": "2018-07-30T10:16:38.000Z",
          "Titre": "Received the batteries and chargers in…",
          "Contenu": "Received the batteries and chargers in a timely manner.  Batteries charged fairly quickly so I assume they are partially charged before shipped.  Have not put the batteries in the cameras yet but should be doing so on one camera in the next week or so.  Will check how long they last before needing to be charged again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessie S",
          "Nb_Reviews": 1,
          "Date": "2021-06-05T03:49:39.000Z",
          "Titre": "Couldn't order online orders over the phone",
          "Contenu": "I would've ordered these along time ago but I kept getting an error message when I try to order them online I finally had to call in an order the man who helped me was very knowledgeable and helpful wish I would've done it along time ago."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Hays",
          "Nb_Reviews": 1,
          "Date": "2018-07-25T00:22:47.000Z",
          "Titre": "The batteries were top quality",
          "Contenu": "The batteries were top quality, and they came charged and ready to use. These were NiCad batteries and the tabs were covered with shrink-wrap insulated material. Good thing too cause they were all loose in the packaging when I opened it. That's the only reason I gave this transaction 4 stars instead of five."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve N.",
          "Nb_Reviews": 2,
          "Date": "2020-02-18T14:19:19.000Z",
          "Titre": "Solved the problem",
          "Contenu": "Nice, well packaged product.  I was able to rebuild the battery for my power using the 1.2V sub-c cells.  I ordered cells without tabs but was sent cells with tabs.  I easily pulled the tabs off with pliers since they were not oriented in positions where I could use both."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony Ott",
          "Nb_Reviews": 7,
          "Date": "2022-03-23T15:29:54.000Z",
          "Titre": "Wasn't necessarily great or bad",
          "Contenu": "Wasn't necessarily great or bad. Pretty much what I would expect. Product seems to have shipped within a normal amount of time. Will wait and see what the product is like when it arrives."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 11,
          "Date": "2021-01-17T15:49:59.000Z",
          "Titre": "Love the batteries",
          "Contenu": "I would have given you 5 starts but I got the request for a review 3 days before the batteries I ordered.  That told me the batteries were shipped but I did expect them a day after I got the e-mail but it took 3 more days  Batteries are excellent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karla Riter",
          "Nb_Reviews": 1,
          "Date": "2020-02-25T14:05:07.000Z",
          "Titre": "I simply placed an order",
          "Contenu": "I simply placed an order - I haven't even received it yet, and you're asking for a review to be done? I think that you should wait until the order has processed and the customer has tried out the product that was ordered before you ask them to do a review."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Roberson",
          "Nb_Reviews": 2,
          "Date": "2019-12-20T16:24:27.000Z",
          "Titre": "Tenergy great but Website  flawed",
          "Contenu": "Tenergy great but Website  flawed.  For example I'm looking for NiMH batteries and charger combo.  I click on Chemistry...NiMH and it shows 72 items and displays first 12 on page 1 of 6.  EVERY ONE of the 12 showing are rechargeable but if you click Rechargeable...\"Yes\" - it only shows 4 that meets your criteria.  Only an example showing the flaw for your website designer to review.  Website search is NOT accurate nor user friendly.  Each selection should be a further refinement of the filters.  Your website search screens really needs to be reviewed and fixed as this is your bread and butter guys!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rei",
          "Nb_Reviews": 1,
          "Date": "2021-06-04T02:28:36.000Z",
          "Titre": "Very good",
          "Contenu": "Very good. The order arrived in three days. I would have given 5 stars if the site would have informed the customer about how much it was going to cost to ship the merchandise. I only knew that after placing the order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "joan miller",
          "Nb_Reviews": 1,
          "Date": "2020-11-10T19:24:35.000Z",
          "Titre": "My resent purchase of Tenergy solar…",
          "Contenu": "My resent purchase of Tenergy solar batteries has me questioning theses batteries. They don't stay charged as long as the same batteries I purchased awhile back. I will look into other brands the next time I need more batteries."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brenda Edwards",
          "Nb_Reviews": 2,
          "Date": "2022-05-03T22:49:58.000Z",
          "Titre": "I thought the batteries came in a 4…",
          "Contenu": "I thought the batteries came in a 4 pack. I was going off the pictures. I needed 4 and I only got 3. Thinking I was ordering 3 packs.  I guess I need to read fine print."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Levy",
          "Nb_Reviews": 1,
          "Date": "2020-11-11T15:15:09.000Z",
          "Titre": "The charge up time is quick",
          "Contenu": "The charge up time is quick.  But since they are rechargeable, they don't last as long as the lithium batteries.  But since they are rechargeable, you're still saving tons of money and the hassle of having to get new ones."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric Arndt",
          "Nb_Reviews": 1,
          "Date": "2020-01-20T14:05:04.000Z",
          "Titre": "Product Works fine, but....",
          "Contenu": "I bought this charger for one of my son's remote control trucks.  The connector works fine, however the light that tells you when it is done charging stays red for the entire time.  Would have given it 5 stars if the light turned to green."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Doug L",
          "Nb_Reviews": 1,
          "Date": "2018-12-17T01:53:42.000Z",
          "Titre": "15 of of 16 are good",
          "Contenu": "The order arrived in a timely manner. Out of 16 batteries received, one was defective. It would not charge. I called and they will send me a replacement. The rest of the batteries are good. I am using the batteries with my Arlo system and so far so good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Bushroe",
          "Nb_Reviews": 2,
          "Date": "2020-03-17T22:01:45.000Z",
          "Titre": "Many options to choose from",
          "Contenu": "Many options to choose from. But even with filters on the side I still spent a lot of time searching for the combination of charger and lots of batteries that I wanted. The final price was good considering how any extra batteries I ordered."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DLMoe",
          "Nb_Reviews": 4,
          "Date": "2018-07-08T20:30:42.000Z",
          "Titre": "I needed a specific brand battery pack for an older R/C car",
          "Contenu": "I needed a battery pack for a R/C car.  The local merchants did not carry a compatible product and recommended that try this vendor because of the wide selection offered.  This was my first purchase from this vendor and the overall experience was good.//"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alexander Vaughan",
          "Nb_Reviews": 2,
          "Date": "2020-12-31T21:55:54.000Z",
          "Titre": "Ordered 12 bay AA/AAA battery charger",
          "Contenu": "Ordered 12 bay AA/AAA battery charger, received 8 bay charger. Tenergy’s customer service people responded within a day of my complaint and has agreed to send the 12 bay unit asap. I shall donate the other to my church."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenneth",
          "Nb_Reviews": 2,
          "Date": "2018-06-19T10:36:45.000Z",
          "Titre": "Mostly found what I was looking for",
          "Contenu": "Mostly found what I was looking for. One area was a bit confusing, NIMH AA sizes including 2/3AA shows the size listed but not product available or even a place to look and see if and when it will be available. I got everything else I wanted ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TINA LIERMAN",
          "Nb_Reviews": 2,
          "Date": "2020-04-20T19:33:56.000Z",
          "Titre": "Fast shipping",
          "Contenu": "I only game 4 stars, because I just got the batteries.  I haven't had a chance to charge them or use them.  I'd like to see how they hold charge before I give them 5 starts.  They did a nice job of shipping in a jiffy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 1,
          "Date": "2018-01-15T01:52:50.000Z",
          "Titre": "Web site made ordering and payment very …",
          "Contenu": "Web site made ordering and payment very easy. However batteries were shipped in a box that was too large,with a small amount of bubble wrap. Ends of batteries were contacting one another. This is NOT the proper way to ship Lithium Batteries."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas Spiering",
          "Nb_Reviews": 1,
          "Date": "2018-12-13T21:44:56.000Z",
          "Titre": "I guess the battery will work",
          "Contenu": "I guess the battery will work, it is smaller then the original and theconnector, is not then same as the original, I will have to switchthe connector. I am not sure if this battery will last as long beforeneeding charging."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Albert Priselac I",
          "Nb_Reviews": 1,
          "Date": "2021-12-09T17:56:50.000Z",
          "Titre": "Correct batteries!",
          "Contenu": "Sent back four incorrect rechargeable batteries sent to me to be exchanged for the correct rechargeable batteries ! Haven’t seen credit on my Visa card yet!!!🤔"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott Steiner",
          "Nb_Reviews": 1,
          "Date": "2021-02-18T11:55:05.000Z",
          "Titre": "Tenergy needs to answer their phone",
          "Contenu": "Tenergy needs to answer their phone. I like to place orders by phone so I can ask questions. Shipping was terrible. They used USPS and as always they are late. Still waiting for product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric Schaefer",
          "Nb_Reviews": 1,
          "Date": "2020-11-10T20:00:07.000Z",
          "Titre": "Great product after a rough start.",
          "Contenu": "The first unit I received was dead-on-arrival, so I can't give 5 stars. When I reached out for support and warranty replacement, it took around a month to resolve the situation. In normal circumstances I would think this was unreasonably slow. However, this process was happening in the midst of COVID shutdowns, so I'm inclined to give the benefit of the doubt on slow response times. I will say that each response was good - they had good attitudes, asked the right questions, and ultimately did send me a replacement unit. That unit works perfectly and offers great controls and flexibility. Aside from the delays, the product and the support have been great. I'm very happy now (even if I was a little disgruntled for several weeks in the middle there!)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald Ziegler",
          "Nb_Reviews": 1,
          "Date": "2018-01-06T17:00:40.000Z",
          "Titre": "Great selection and great price on all …",
          "Contenu": "Great selection and great price on all types of batteries. Have used your tenergy batteries previously and have been very satisfied. Ordering was easy online and the product was delivered within 4 days."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rich Johnson",
          "Nb_Reviews": 2,
          "Date": "2018-06-11T16:37:45.000Z",
          "Titre": "I was happy to see such quick service",
          "Contenu": "I was happy to see such quick service. I was disappointed the plug was not there this time.  I am glad I had some on hand.I will repeat this order again.I have more G scale trains to power up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Sogla",
          "Nb_Reviews": 10,
          "Date": "2021-09-18T16:44:15.000Z",
          "Titre": "Did it ship? When will it arrive?",
          "Contenu": "Service was Great but I had no idea if it was shipped or when it would arrive. Let me know those 2 things next time and you will be rated 5 stars.Thanks Again!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Margaret Doverspike",
          "Nb_Reviews": 1,
          "Date": "2017-12-27T04:55:02.000Z",
          "Titre": "I need to return this item",
          "Contenu": "I need to return this item. I ordered the wrong batteries and charger. I need 9.6v NiMh for a 1:6 scale new bright Hummer h2. The battery pack he contacts on the sides  please help if you can."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Duane  Stalker",
          "Nb_Reviews": 2,
          "Date": "2020-01-23T22:39:52.000Z",
          "Titre": "So far I’ve had no issues",
          "Contenu": "So far I’ve had no issues, I would order again, jump to 7 cell cuz I run some 11 and 13 turn motors so it kinda eats my battery up, so I went to a different gear ratio on my rc 10"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diane Tabaco",
          "Nb_Reviews": 2,
          "Date": "2020-01-06T21:47:02.000Z",
          "Titre": "The service as fast",
          "Contenu": "The service as fast. I would have rated it 5 stars, but I had to a rough time before  all my information would go through.  Thank you for a great product. Sincerely, Diane.Tabaco."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joel Reyes",
          "Nb_Reviews": 4,
          "Date": "2018-01-19T11:50:30.000Z",
          "Titre": "Smooth buying experience",
          "Contenu": "Smooth buying experience. Super fast shipping.You should offer some kind free shipping to Puerto Rico customers as half of the island is still without power. At least for a limited time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marion",
          "Nb_Reviews": 1,
          "Date": "2018-08-11T01:15:34.000Z",
          "Titre": "I got what I needed and will be making…",
          "Contenu": "I got what I needed and will be making another additional order soon, wish I would have just order more batteries the first time, excellent service and got what I ordered right on time!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sue",
          "Nb_Reviews": 2,
          "Date": "2022-01-09T03:40:23.000Z",
          "Titre": "I ordered my stuff and I received it in…",
          "Contenu": "I ordered my stuff and I received it in the mail. One of the packages of batteries case was busted when I got it, but the batteries were ok."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Philip Sargent",
          "Nb_Reviews": 34,
          "Date": "2021-09-08T17:40:51.000Z",
          "Titre": "Charging Unit",
          "Contenu": "This item just shipped today, so I have no idea yet how to review this item. I'm not real pleased with the amount of time it has taken to ship."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 5,
          "Date": "2018-07-10T00:30:49.000Z",
          "Titre": "I ordered a LED lamp and really like it.",
          "Contenu": "I received the lamp I ordered. Looks nice and works well. I had a little trouble with the shipment tracking, but all is fine. Very nice product. I recommend this company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Raymond Thayer",
          "Nb_Reviews": 1,
          "Date": "2018-11-28T00:41:01.000Z",
          "Titre": "Everything was great except I still…",
          "Contenu": "Everything was great except I still have not received the batteries the tracker said they were delivered but not to my mailbox. I find the U S mail is not very reliable"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 3,
          "Date": "2019-03-12T18:18:34.000Z",
          "Titre": "SATISFIED CUSTOMER",
          "Contenu": "I gave been ordering from all batteries for over three years. I gave their charger and recharable batteries I have never had any issues with orders or their products."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul O",
          "Nb_Reviews": 1,
          "Date": "2020-11-10T18:32:22.000Z",
          "Titre": "Recharging was a little difficult after…",
          "Contenu": "Recharging was a little difficult after batteries were fully spent. Some had to be put through charger several times, but, eventually they all recharged"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edmund Cramp",
          "Nb_Reviews": 2,
          "Date": "2020-10-20T11:49:49.000Z",
          "Titre": "Nice batteries that work well and…",
          "Contenu": "Nice batteries that work well and people who are very helpful - occasionally I have a questions about orders and they always answer in about 30 seconds!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MARCIA GUTIERREZ",
          "Nb_Reviews": 3,
          "Date": "2020-11-11T14:00:37.000Z",
          "Titre": "Love the convenience!",
          "Contenu": "Love the convenience of having rechargable batteries and knowing Tenergy provides top quality when I need to replenish my supply.  Great chargers too!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Judy George",
          "Nb_Reviews": 1,
          "Date": "2019-02-04T05:25:50.000Z",
          "Titre": "The ease of ordering with the person on…",
          "Contenu": "The ease of ordering with the person on the phone was very easy. Definetly will order sgain thru this company for any item for my Irobot. Shipping was fast!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shawn R Hill",
          "Nb_Reviews": 1,
          "Date": "2019-12-14T15:12:24.000Z",
          "Titre": "Hope to receive soon",
          "Contenu": "Hope to receive soon. Been pleased with the product but regretted buying the rechargeable batteries so I am sure it will be just what I need Thank You!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mario O'Neill",
          "Nb_Reviews": 1,
          "Date": "2018-08-22T16:41:21.000Z",
          "Titre": "Good experience",
          "Contenu": "Good experience, professional staff. Did not find exactly what I was looking for but the staff was very helpful. A good place to go for any battery needs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Geraldine Bottari",
          "Nb_Reviews": 1,
          "Date": "2022-08-18T05:21:37.000Z",
          "Titre": "Batteries AAA",
          "Contenu": "Good product and fast shipping!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peter Stevens",
          "Nb_Reviews": 4,
          "Date": "2019-12-05T00:57:55.000Z",
          "Titre": "Had some difficulty determing out how…",
          "Contenu": "Had some difficulty determing out how to use the free shipment with the black Friday sales.  I sent a chat message and received a clear response."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Greenlee",
          "Nb_Reviews": 2,
          "Date": "2018-07-31T21:50:04.000Z",
          "Titre": "Everything went well",
          "Contenu": "Everything went well.  The shipping envelope was pretty well destroyed.  I would recommend using a padded envelope or a small usps box to ship in."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Robbins",
          "Nb_Reviews": 1,
          "Date": "2019-06-18T00:26:14.000Z",
          "Titre": "Good and fast service, but...",
          "Contenu": "good fast service, but need to inform better on when the product ships. I still thought it hadn't shipped yet when it showed up at my door."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed  Pienkos",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:16:32.000Z",
          "Titre": "What a great product",
          "Contenu": "What a great product. I ordered several different products for my camera, lights and other devices.  They last the longest hands down and I can charge and put them back in the different devices.  Ty to all at Tenergy. Iam in my seventies I don't want to waste time driving to stores looking for the battery isle picking the battery's I need sometimes I need 4 they have only 3. Drive to another store in traffic. I am all for team Tenergy keep up with the great products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T18:11:43.000Z",
          "Titre": "Quality Resource for Batteries",
          "Contenu": "I've ordered batteries from Tenergy before and found their quality and price better than any from a store."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Curt coate",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T19:04:30.000Z",
          "Titre": "Service I was having trouble ordering…",
          "Contenu": "Service I was having trouble ordering and they were very helpful getting the right battery pack."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pav",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T02:04:37.000Z",
          "Titre": "Great service",
          "Contenu": "Great service! Fast shipping!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy Tran",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T14:39:19.000Z",
          "Titre": "Good communication with the staff via…",
          "Contenu": "Good communication with the staff via email and quick processing of order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ellis",
          "Nb_Reviews": 2,
          "Date": "2023-08-25T22:17:40.000Z",
          "Titre": "Great performance.",
          "Contenu": "The batteries were delivered well-packed and within 2 days [shipped free]. Altogether, brilliant performance.The digital side could use some attention. It didn't affect the transaction but . . . well, have a look, yeah? For example, the site wouldn't let me sign-in because it said my Email address was wrong. May be, but it's the only one I've got."
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "Eric B.",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T05:01:31.000Z",
          "Titre": "Great Battery Supplier",
          "Contenu": "Tenergy has been been great with pricing, shipping rates and customer service. They are our first stop for battery needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Dolan",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T14:32:05.000Z",
          "Titre": "Delivery was as anticipated",
          "Contenu": "Delivery was as anticipated.  Sub-c cells being used to rebuild battery pack for cordless drill that I hope to utilize."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T20:22:57.000Z",
          "Titre": "Great customer service",
          "Contenu": "The replacement part that I was looking for wasn't listed on the website. The customer service department was able to help me locate the piece, so that I could continue using my charging base. I enjoy the products, and have recommended them several times to others. I also don't like tossing perfectly working items over small issues. This was a great solution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan Shobe",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T23:28:02.000Z",
          "Titre": "Quality product from a quality company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michiel Kappeyne",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T22:56:01.000Z",
          "Titre": "Top products and fantastic customer care",
          "Contenu": "‘Have been using Tenergy Power rechargeable batteries for some ten years now and will never look back. Measured capacity is always higher than stated, internal resistance is low, and they stay healthy longer than the competition in my experience. Tenergy also offers a wide range of characteristics for any given size. Only top manufacturers can achieve this because it takes research, dedication, and a variety of manufacturing methods.The same applies to Tenergy's range of chargers. I now use the TN456 because it's superior in every way to the brand name unit I had before. (You can find my rave review of it on Amazon.)What sets Tenergy apart as well is how they treat us. Several times it was a very senior engineer who answered my detailed questions in a delightful email dialogue. How rare is that in a world where chatbots and canned replies have taken over?Summing up, Tenergy Power cares about its products, its customers, and its reputation. You will be very pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "skipper",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T20:54:17.000Z",
          "Titre": "Customised and delivered ahead of time",
          "Contenu": "I am a visitor to the USA and needed a battery pack before my imminent depart. It had to be made to order. The Tenergy team patiently (and relentlessly) made sure they got all the necessary specs from me. Finally, they delivered a better product than I expected, more adapted to my need. We also worked out shipping, that was cost effective and delivered to me well ahead of my deadline. I preferred the product to one available at less than half right price, as it was US made, and I didn't want a possible drop in quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 2,
          "Date": "2023-08-16T16:23:53.000Z",
          "Titre": "I am so impressed with Tenergy's…",
          "Contenu": "I am so impressed with Tenergy's products. I ordered a charger and some batteries a while ago, and they last a LONG time, so I just ordered some more!! Their shipping, ordering, etc. is very efficient, and their customer service is top-notch. Nice job, Tenergy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PAM G",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T19:05:25.000Z",
          "Titre": "Great Batteries at a Great Price!!",
          "Contenu": "I have purchased Tenergy batteries for several years now, both for home and work.  We find that they are just as good as the name brands, which cost way more.  I would highly recommend trying them for all your battery needs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R K",
          "Nb_Reviews": 4,
          "Date": "2023-06-14T21:17:22.000Z",
          "Titre": "Easy to find the type of replacement batteries I need",
          "Contenu": "Easy to find the type of replacement batteries I need for my alarm system sensors.  My alarm system technician uses the same Tenergy batteries I purchased; they last a really long time; and they fit perfectly in my sensor units. Since I live in a rural area, no one near me carries the exact type I need to replace the original batteries.  Plus, I was not only able to find the type I need, but I was also able to select the quantity I wanted--from only 1 on up. I opted for the 16-count package, since most of my sensors are close to needing battery replacements. I appreciate that Tenergy sells to individuals. Check out was easy.  Shipping was prompt.  I will definitely look to Tenergy first for my battery needs going forward."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 17,
          "Date": "2023-11-02T18:13:43.000Z",
          "Titre": "They called and gave me new shipping…",
          "Contenu": "They called and gave me new shipping options to Canada for Lion batteries - very helpful. John"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Manchester",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T12:36:27.000Z",
          "Titre": "You make great AA & AAA batteries",
          "Contenu": "You make great AA & AAA batteries.  They last a long time .  I have never removed one that leaked or corroded."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex Brand",
          "Nb_Reviews": 3,
          "Date": "2023-04-10T18:57:39.000Z",
          "Titre": "Good Stuff. Fun Stuff.",
          "Contenu": "Products shipped in good time and arrived as advertised. The battery testers are easy to use, and honestly kind of fun. I have four of the 5,000 mAh C batteries in a baby toy right now. I'll update my review once I see how long they last.So far, the products seem quality and reliable. If I ever experience otherwise, I'll be sure to update my review.Get the pocket AA/AAA battery tester. It's $1.30 and fun to carry around."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benjamin Burenstein",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T16:01:19.000Z",
          "Titre": "John S on Support gets an A+!",
          "Contenu": "John S on the support team went out of his way to find a product that would work for me. He gave me fantastic service and helped save me money. It was one of the best customer service experiences I've ever had!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rob Davis",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T16:11:16.000Z",
          "Titre": "My old cordless screwdriver lives again!",
          "Contenu": "I bought this cordless screwdriver, Blue-point model# ETBSL365 many years ago from the tool truck and it saw limited duty and eventually ended up in my tool locker at work. I found it in there covered in dust and 3 dead NiCDs in it. After a quick interweb search I found Tenergy Power and they had a slightly better version of the original batteries, in stock, so I ordered them on a Friday... and received them on Monday. The solder tab 4/5ths C cells are an exact fit, a few mAhs bigger and had the option of solder tabs. The tabs made the refurb installation a breeze. I plan to actually use the tool this time around, thank you Tenergy Power for the super fast service and great quality batteries."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Dawkins",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T12:29:43.000Z",
          "Titre": "They responded quickly and were helpful…",
          "Contenu": "They responded quickly and were helpful to answer my question about one of their products and pointed me in the right direction. I first found their products through a third-party supplier I liked the product so well I decided to look the company up and found I could deal directly. I prefer to work with companies that let you deal directly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cliff Hardin",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T08:08:34.000Z",
          "Titre": "Great service as always!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Hirsch",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T21:05:39.000Z",
          "Titre": "Great Service",
          "Contenu": "After placing an order on-line yesterday, as well as, emailing your service department, your staff has been very helpful.   They promptly emailed and called me to communicate regarding the lead time of our order.  Thank you so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Irma Muhammad",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T16:00:44.000Z",
          "Titre": "100% Satisfied",
          "Contenu": "First I read the owners manual to locate every feature. After fully charging my radio, I checked every feature. Everything worked as advertised. Then I chose where I would hook it to my emergency backpack, when needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FH",
          "Nb_Reviews": 4,
          "Date": "2023-01-26T08:49:39.000Z",
          "Titre": "Promising Product",
          "Contenu": "This company has provided an unusual battery at a great price. It is scheduled to arrive only 4 days afer placing the order. I have no previous experience with this product but I will definitely buy from this comapny again if the battery performs well in service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Satisfied Buyer",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T17:08:37.000Z",
          "Titre": "The website provided good details about the products.…",
          "Contenu": "The website provided good details about the product I wished to buy. The website was easy to navigate and had no \"traps\" that would fool the buyer into getting something not desired. The site provided easy means to use my credit card for making purchase. This is one of the best sites I have ever used because all of the features show on the screen work well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Romeo Farese",
          "Nb_Reviews": 4,
          "Date": "2023-01-19T23:10:53.000Z",
          "Titre": "Community project will be a success",
          "Contenu": "I called for a 120 pack of lithium batteries for a community project and the whole process went very smoothly and the package is on the way.The only thing I would like to see is an updated website for pricing. There was a significant price increase that I did not expect."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lou",
          "Nb_Reviews": 2,
          "Date": "2023-01-20T01:28:06.000Z",
          "Titre": "great service",
          "Contenu": "I sent Tenergy customer service an email about my problem  It was answered the next day. I was sent an order and called back to arrange shipping.  Called back and gave your rep the information needed and got back a confirmation,of my part order. I was told I would receive it in a few days  Great service"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Nate G",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T17:36:46.000Z",
          "Titre": "The team gave a call to clarify…",
          "Contenu": "The team gave a call to clarify shipping and present options. Really appreciated the phone call. The rep on the phone was clear and concise and presented me with all the options necessary to make an informed decision."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "j-gru",
          "Nb_Reviews": 2,
          "Date": "2023-03-16T19:33:02.000Z",
          "Titre": "Great Products with Longevity",
          "Contenu": "Great prices, great selection of product. Also I have used rechargeable batteries from this company for at least ten years and they continue to perform. Quality company! Oh, delivery was very quick!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deven Dallmann",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T21:30:01.000Z",
          "Titre": "They were an immense help",
          "Contenu": "They were an immense help, figuring out exactly what I needed, as well as the turnaround time for the product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerald Wegner",
          "Nb_Reviews": 4,
          "Date": "2023-10-11T20:34:02.000Z",
          "Titre": "Tenergy Li ion battery charger was a bargain",
          "Contenu": "I was pleasantly surprised that the Tenergy Li ion battery charger that I ordered not only was reasonably priced but also arrived with two new compatible batteries."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Johnson",
          "Nb_Reviews": 14,
          "Date": "2023-04-06T17:23:13.000Z",
          "Titre": "04/05/2023",
          "Contenu": "04/05/2023I know Tenergy Power always has the battery in stock that is needed to power my outdoor cameras. They keep a person updated on the status of their order. Their website is convenient & easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOHN S.  BIZUKIEWICZ",
          "Nb_Reviews": 4,
          "Date": "2023-07-26T23:21:54.000Z",
          "Titre": "\"Play with the best\". A great selling line to use.",
          "Contenu": "Your products are far better than the batteries out there. They hold the charge and last for a longer time than the best battery that I bought from local stores. The higher prices are worth it because, I don't have to just look for a recycle place. I can re-charge them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Evan Anderson",
          "Nb_Reviews": 1,
          "Date": "2022-12-25T10:12:18.000Z",
          "Titre": "Super quick delivery, good prices",
          "Contenu": "Super quick delivery. Haven’t tried the batteries and charger yet, but everything I read looks great, and the prices are great if indeed the product is as reviewed elsewhere."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ray Quirino",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T14:14:58.000Z",
          "Titre": "Great website",
          "Contenu": "Great website, great products at competitive prices. Shipped quickly. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Badger",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T21:14:43.000Z",
          "Titre": "The charger arrived",
          "Contenu": "The charger arrived, super quickly and working like a charm. Great product exclamation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Norman",
          "Nb_Reviews": 4,
          "Date": "2023-03-08T21:57:44.000Z",
          "Titre": "We had an important race date and our…",
          "Contenu": "We had an important race date and our 7yr old Tenergy battery died.  Tenergy came through in record time to get us a pair of batteries to make our race date.  THANKS TENERGY!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Belinda Sue  McCain",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T12:44:58.000Z",
          "Titre": "Was very happy with the price",
          "Contenu": "Was very happy with the price, and the fact that they called me to get my complete address! Never had anyone do that before!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rob Stangle",
          "Nb_Reviews": 2,
          "Date": "2023-10-19T01:40:35.000Z",
          "Titre": "A quick fix to my problem",
          "Contenu": "A quick fix to my problem and extra advice about various Tenergy products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa harville",
          "Nb_Reviews": 3,
          "Date": "2023-02-04T19:44:29.000Z",
          "Titre": "Customer service is great!",
          "Contenu": "Customer service is great!! I ask for my shipping address to be changed and they did so right away with no problem and I really appreciate that 😃 The shipping was so quick I got it in 4 days that’s unbelievable 😃 I will definitely order with them again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SFLILLY",
          "Nb_Reviews": 2,
          "Date": "2023-04-14T19:05:24.000Z",
          "Titre": "Fast delivery/good quality",
          "Contenu": "Received the 4 pack CR123A batteries in 2 days. I always have good lasting results with these in my weather station.  Web site easy to use. Order placed on 11th, received on 13th. mail"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Counce",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T15:27:10.000Z",
          "Titre": "You made my experience working with you…",
          "Contenu": "You made my experience working with you so easy to order everything went like 123 keep up the good work"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "L. Rutledge",
          "Nb_Reviews": 11,
          "Date": "2023-08-19T12:13:31.000Z",
          "Titre": "So far",
          "Contenu": "So far, the products have stood my very sceptical test of stated quality.  I have ordered a few items and so far have been very satisfied with the quality of your products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger Luce",
          "Nb_Reviews": 4,
          "Date": "2023-01-19T23:19:30.000Z",
          "Titre": "Great price",
          "Contenu": "Great price, excellent service making sure I recieved exactly what I ordered, sure fast with regular shipping. Great job every one"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Cooper",
          "Nb_Reviews": 2,
          "Date": "2023-10-19T18:45:42.000Z",
          "Titre": "Excellent long lasting rechargable…",
          "Contenu": "Excellent long lasting rechargable batteries of all kinds. Good chargers and good price. Fast delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Forrest",
          "Nb_Reviews": 2,
          "Date": "2023-10-25T11:11:39.000Z",
          "Titre": "Haven't received my order yet,but…",
          "Contenu": "Haven't received my order yet,but things are moving along nicely."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KRB",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T13:43:44.000Z",
          "Titre": "Great Rechargeable Batteries",
          "Contenu": "I have bought from Tenergy before and was happy with how easy it was to navigate the website. The batteries are of great quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jaroslaw zubenko",
          "Nb_Reviews": 2,
          "Date": "2023-10-01T01:34:37.000Z",
          "Titre": "Good job",
          "Contenu": "On time and packaged well. Good batteries for my USCG portable 2way system."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rosemary Kawcznski",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T20:30:12.000Z",
          "Titre": "The price was great",
          "Contenu": "The price was great. If I purchased the product from an other source, the price would have been doubled. the shipping was faster than I expected. Thank you very much. 06/07/2023 Rosemary Kawczynski"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Betsy T",
          "Nb_Reviews": 2,
          "Date": "2023-07-11T01:33:09.000Z",
          "Titre": "Great batteries",
          "Contenu": "I use these batteries in two wireless security cameras.  The batteries last a lot longer than others I have tried."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Zappettini Jr",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T15:45:53.000Z",
          "Titre": "Great customer service and fast shipping",
          "Contenu": "What keeps me coming back to Tenergy is there great customer service and fast shipping. I could not be happier with there products.Frank ZSan Jose, Ca"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Munch",
          "Nb_Reviews": 2,
          "Date": "2023-02-11T17:54:59.000Z",
          "Titre": "Tenergy Rechargeable AAA batteries!",
          "Contenu": "I have been using Tenergy Rechargeable AAA batteries exclusively, ever since I found them at Fry's Dallas location. I still have my Tenergy TN160 12 slot AA/AAA battery charger and I use it everyday! Tenergy Rechargeable AAA batteries have saved me about $1000 a year by recharging vs buying a 20 pack of conventional Alkaline batteries every week for $20.00 a pop! I'm service tech that works on commercial coffee equipment, combination fountain drink/ice maker equipment, etc., for a very large convenience store corporation. I don't use my flashlight occasionally, I actually carry two, with freshly charged Tenergy AAA batteries in both. Do the math! A 20 pack of Alkaline batteries is now over $22, so $22 x 52 weeks = $1144 a year, just for freakin' batteries so I can do my job! And on top of that, figure the carbon footprint for all of those batteries going into a landfill! Our beloved parents did not understand how they were polluting our land and water. All they cared about was making their fortune by stripping all the natural resources, then dumping all of their pollution back into the environment. They even said that the effects of pollution are nothing but lies, dreamed up liberal Left Wing radical hippies. It's all a lie they said! I dare them to say it now. Any way you look at it, rechargeable batteries by Tenergy outlast, out perform, are better for our environment and just make good sense for your wallet!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony Hamilton",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T15:44:57.000Z",
          "Titre": "Successful Tenergy Transaction",
          "Contenu": "Aside from some login issues that have not been resolved yet, my purchase transaction was smooth, professional, and handled with courteous Tenergy staff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter J. Pallesen",
          "Nb_Reviews": 2,
          "Date": "2023-01-13T18:33:41.000Z",
          "Titre": "Met a Need",
          "Contenu": "Easy to find and order just what I wanted at a reasonable price. What's not to like? Well, there's the shipping charge that was pretty high, I thought. Nevertheless, I will be happy to get the battery tester."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Tozier",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T20:06:42.000Z",
          "Titre": "As usual",
          "Contenu": "As usual, great products at great prices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacqueline",
          "Nb_Reviews": 10,
          "Date": "2023-05-26T19:16:03.000Z",
          "Titre": "Prompt",
          "Contenu": "Prompt, efficient, and very professional service!  Fast delivery of battery, works great!  Thank you.J  Spears"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "virgie lovelace",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T20:30:57.000Z",
          "Titre": "great choice and price",
          "Contenu": "I always find what I'm looking for and have a choice of different size packages at a great price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra Sachs",
          "Nb_Reviews": 3,
          "Date": "2023-06-28T21:33:12.000Z",
          "Titre": "Phone Batteries",
          "Contenu": "I am making the assumption that these batteries which are inexpensive will keep my phone working as they have in the past."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David M.",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T02:29:10.000Z",
          "Titre": "An excellent experience from start to…",
          "Contenu": "An excellent experience from start to complete!Thank you!David M."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Lazarre",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T17:43:14.000Z",
          "Titre": "Quality batteries for the right device.",
          "Contenu": "Tenergy provides quality batteries that last a long time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christian Hernandez",
          "Nb_Reviews": 3,
          "Date": "2023-10-18T22:18:33.000Z",
          "Titre": "Prefect customer service",
          "Contenu": "You guys went above and beyond to sell me a part that I needed and could not find anywhere else and stores. So I went to the source you guys"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy",
          "Nb_Reviews": 8,
          "Date": "2023-02-26T03:48:32.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Wow, I ordered one afternoon and had the package the next. Talk about fast shipping...I will be using This supplier again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Surfingjay",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T16:54:18.000Z",
          "Titre": "Order was completed in timely fashion",
          "Contenu": "Order was completed in timely fashion.  Product performs as designed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A. Willi",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T00:55:34.000Z",
          "Titre": "5/5 Stars",
          "Contenu": "Easy to order. Quick delivery. Fast customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacqueline",
          "Nb_Reviews": 10,
          "Date": "2023-03-24T19:37:09.000Z",
          "Titre": "Helpfulness",
          "Contenu": "Helpfulness, working hard to get the part that I need.  They found what I needed and got it to me in a very expedious manner!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Popil",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T16:38:17.000Z",
          "Titre": "the help i received over the phone",
          "Contenu": "the help i received over the phone. she was very professional"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Georgette",
          "Nb_Reviews": 3,
          "Date": "2023-05-07T01:33:41.000Z",
          "Titre": "I was surprised of the quality how they…",
          "Contenu": "I was surprised of the quality how they were the AA were in four packs and in a nice box and the AAA came in plastic box of four"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JJ Kul",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T14:02:09.000Z",
          "Titre": "Good service",
          "Contenu": "They respond quickly to questions, my order was shipped quickly too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Teresa Van Dusen",
          "Nb_Reviews": 2,
          "Date": "2023-01-06T14:35:10.000Z",
          "Titre": "Their customer service is great",
          "Contenu": "Their customer service is great! They answered my request super fast, were very kind and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert  Holzhauser Jr",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T09:24:05.000Z",
          "Titre": "Tenergy Power great batteries at a good price Power has really good quality…",
          "Contenu": "Tenergy Power has really good quality batteries in all sizes at a good price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Fikse",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T04:42:11.000Z",
          "Titre": "Got just what I needed",
          "Contenu": "Got just what I needed. Great price! Quick delivery!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EDWIN H BLACKBURN",
          "Nb_Reviews": 2,
          "Date": "2022-12-24T01:15:04.000Z",
          "Titre": "Very pleased the fast delivery",
          "Contenu": "Very pleased the fast delivery. I ordered the power supplies on Thursday and received them on Friday. Outstanding!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan Flores",
          "Nb_Reviews": 3,
          "Date": "2023-09-10T04:23:53.000Z",
          "Titre": "Great customer support",
          "Contenu": "Great customer support, I’ve been a happy customer for 2 years now."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T01:22:13.000Z",
          "Titre": "fast shipping",
          "Contenu": "Batteries were a perfect replacement for rebuilding my Solus pro 2008 battery pack.  Thanks a lot."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James M.",
          "Nb_Reviews": 5,
          "Date": "2023-03-07T03:47:41.000Z",
          "Titre": "Very pleased!!!",
          "Contenu": "My order arriveed on the date it was expected and securely wrapped. Very satisfied with the service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phil L.",
          "Nb_Reviews": 7,
          "Date": "2023-01-11T23:00:54.000Z",
          "Titre": "You handled my sales tax exemption…",
          "Contenu": "You handled my sales tax exemption request promptly and shipped my subsequent order promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clarence Carson",
          "Nb_Reviews": 7,
          "Date": "2023-07-19T21:36:25.000Z",
          "Titre": "Outstanding Service",
          "Contenu": "Been ordering for a long time great service and shipping very good .............."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Romeo Farese",
          "Nb_Reviews": 4,
          "Date": "2023-02-24T15:52:01.000Z",
          "Titre": "I worked with customer service before…",
          "Contenu": "I worked with customer service before and they were helpful. Ths time I just used the website and it was also great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Sarris",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T02:17:42.000Z",
          "Titre": "I was able to get the correct battery…",
          "Contenu": "I was able to get the correct battery and installed it from there video. The vacuum is working great now."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mikhail Kogan",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T13:19:00.000Z",
          "Titre": "Thank you for quick response.",
          "Contenu": "Thank you for quick response.Order was placed with no any problems. But I am not sure if this remote matches to my lamp. Anyway thank you very much for great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Stickles",
          "Nb_Reviews": 2,
          "Date": "2023-04-01T12:11:02.000Z",
          "Titre": "Very fast ordering and shipping",
          "Contenu": "Very fast ordering and shipping. Have ordered may times and not been disappointed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carl St Pierre",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T14:40:39.000Z",
          "Titre": "Quality of product --  superior price -- long usage -- ease of order -- attention to delivery  --  informed  order status",
          "Contenu": "quality of product  -- superior price consideration compared to similar products. --  long usage. --"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Blecharczyk",
          "Nb_Reviews": 4,
          "Date": "2023-01-15T01:02:39.000Z",
          "Titre": "Tenergy product descriptions are excellent",
          "Contenu": "Tenergy product descriptions are excellent, complete with specification data and even test sheets.Shipment is super fast!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sammo",
          "Nb_Reviews": 2,
          "Date": "2023-01-24T15:27:54.000Z",
          "Titre": "Any info that i needed was explained…",
          "Contenu": "Any info that i needed was explained very well. Good shipping practices. Stellar products that i feel are the best in the market place."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Alexander",
          "Nb_Reviews": 2,
          "Date": "2023-09-03T09:09:28.000Z",
          "Titre": "Website  was  Straightforward Easy to…",
          "Contenu": "Website  was  Straightforward Easy to use. Price is reasonable."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Samuel",
          "Nb_Reviews": 3,
          "Date": "2023-03-01T22:46:03.000Z",
          "Titre": "Excellent fast delivery",
          "Contenu": "Excellent fast delivery. Easy to order online. Batteries are charging and have not used yet."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sam Cooley",
          "Nb_Reviews": 3,
          "Date": "2023-09-24T02:14:26.000Z",
          "Titre": "Always send the orders out  right away…",
          "Contenu": "Always send the orders out  right away and have a great product with  no hassle."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marco Edwards",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T18:33:10.000Z",
          "Titre": "Love this place",
          "Contenu": "First time using them. My battery and the charger got here when they said it would be here will use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ricardo",
          "Nb_Reviews": 3,
          "Date": "2023-05-17T13:45:52.000Z",
          "Titre": "Awesome Battery",
          "Contenu": "I got this battery a long time ago. It lasted me a long time. It was about 10 years. Now I’m going to be recharging them. Great battery.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phillip Degitz",
          "Nb_Reviews": 3,
          "Date": "2023-09-24T00:09:47.000Z",
          "Titre": "Arlo batteries.",
          "Contenu": "Great price. Always kept informed. Speedy delivery!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Johnny L Brock",
          "Nb_Reviews": 3,
          "Date": "2023-10-12T15:18:57.000Z",
          "Titre": "Great company and great products",
          "Contenu": "Great company and great products. Every time I need batteries,this is the go to place"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dale Kruse",
          "Nb_Reviews": 3,
          "Date": "2023-07-28T15:44:49.000Z",
          "Titre": "Persistence",
          "Contenu": "I think my order was a little unusual for you but turned out to be good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ROBERT KINSMAN",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T20:46:48.000Z",
          "Titre": "easy ordering and received product in a…",
          "Contenu": "easy ordering and received product in a timely manner"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Casey",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T23:10:50.000Z",
          "Titre": "A better product than I expected a very…",
          "Contenu": "A better product than I expected a very pleasant surprise"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wesley Kozireski",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T00:58:51.000Z",
          "Titre": "Always quick to ship orders and to fix…",
          "Contenu": "Always quick to ship orders and to fix any issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "N. Yagar",
          "Nb_Reviews": 2,
          "Date": "2023-01-08T21:36:05.000Z",
          "Titre": "Great experience with Tenergy Power",
          "Contenu": "Prices most reasonable.  Quality great.  Shipping right on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "syd",
          "Nb_Reviews": 3,
          "Date": "2023-02-04T06:41:54.000Z",
          "Titre": "9 volt NIMH",
          "Contenu": "4x 9 volt NIMH. Ordered the night of the 31st, received the day of the 3rd. Great price, too! Tenergy Power is where I buy my batteries now."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Viscardi",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T16:17:40.000Z",
          "Titre": "Had the products  I wanted at a good…",
          "Contenu": "Had the products  I wanted at a good price.  Shipped same day.  Very efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al S.",
          "Nb_Reviews": 2,
          "Date": "2023-05-10T22:25:31.000Z",
          "Titre": "Extremely easy ordering experience",
          "Contenu": "Extremely easy ordering experience. Well designed web site, easy to navigate. Very fast processing and shipping. Overall great experience."
        }
      ]
    }
  ]
}