{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "primeopinion.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deb Patterson",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:51:55.000Z",
          "Titre": "Are you kidding me",
          "Contenu": "Are you kidding me? Just spent 45 minutes doing a 20 min survey, getting up numerous times to fact check to make sure what I put down was right, answered all questions honestly, and I get done and it says not qualified or something to that meaning, and I got a whole 3 points!!! Didn't even count for fulfilling a survey for that day! Bull crap!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Helen Harris",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T06:19:16.000Z",
          "Titre": "If I could give 0 stars I would:",
          "Contenu": "If I could give 0 stars I would:Customer Service is a joke!Completely gaslight customers and wash their hands of any problems from surveys.If they allow survey suppliers to use their site, they should ensure they know what's happening and help resolve any issues!  Telling customers they should know the names of each survey supplier and which survey the issue is with is unrealistic. Doesn't help that you can only look back on the last 10 surveys...Don't bother using Prime - it takes forever to build up enough points to cash out and there are so many glitches it's untrue - you have to wait 4 weeks for points to be awarded after technical issues - unbelievable!"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Pravesh",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T10:33:30.000Z",
          "Titre": "DONT USE PRIME OPINION AS THEY WILL BANNED 🚫 YOU WITHOUT A REASON",
          "Contenu": "I would give 0 star if it is possible.What is this,a survey company or  a joke? The company is full of joke  The company  will qualify for only  1 survey out of 20 and even if you qualify when completed it shows 'ERROR'.They provide survey as they claim.WHEN YOU ARE ABOUT TO COMPLETE A SEVEN DAY STREAK THEY WILL NOT GIVE YOU A SURVEY TO CLAIM FOR LUCKY DRAW.And they banned me without any reason. Telling me   the usual'That quality of response is not good'. I am being very honest to the survey. This company is doing a scam  and customer support is very poor.company support is very poor. They me make feel like talking to a wall.They just took my PRECIOUS time and do not pay for it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "BrandonK",
          "Nb_Reviews": 22,
          "Date": "2023-12-16T15:06:38.000Z",
          "Titre": "Not a good experience",
          "Contenu": "Not a good experience, you will eventually get shadowbanned if you make a good amount of cash. This site went from the best of all time the first week of use to honestly the worst..."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Justin",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T02:08:48.000Z",
          "Titre": "Screen out issue",
          "Contenu": "For unknown reason i have been screened out of every single survey. I sent a query couple of times and never got a response. Scamm"
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Jo",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T16:38:40.000Z",
          "Titre": "Whenever you connect to the app in a different…",
          "Contenu": "Whenever you connect in a different country or with different world sim, it won’t let you log in as the app / account is linked to one sim only. Frustrating and stupid!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Ball",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:41:17.000Z",
          "Titre": "Obviously this site is a scam!!!!",
          "Contenu": "Obviously this site is a scam since I didn't sign it for a couple days and when I did sign back in I was 2000 points short on my points.  I ask them about it but suddenly they were gone, no reponse after I told them what the problem is."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:39:48.000Z",
          "Titre": "You guys went from having an easy to…",
          "Contenu": "You guys went from having an easy to use app to the app and surveys constantly crashing. Y'all suck."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Dharmendra Patel",
          "Nb_Reviews": 3,
          "Date": "2023-12-10T11:36:25.000Z",
          "Titre": "they pay good enough till first 5…",
          "Contenu": "they pay good enough till first 5 level, after this, your survey points getting too low like 2 to 4 points for 25 to 30 minutes of surveys, and every time contact their live chat team they have a same answer that we don't have control on this"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T01:34:39.000Z",
          "Titre": "Takes too long to get to a meaningful…",
          "Contenu": "Takes too long to get to a meaningful reward after wasting hours and hours of my time.  It has taken me months to get to 5000 points; that is ridiculous. I have literally taken or tried to take many many(hundreds) surveys and most do not work or I get an error or they just stop....really disappointing overall."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Mercedes",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T04:37:59.000Z",
          "Titre": "I had spent OVER ONE hour completing a…",
          "Contenu": "I had spent OVER ONE hour completing a survey but was rewarded with just 3 points (=5AUS CENTS), completed ALL the questions, including the final household ones.  Somehow I am unable to send them a message about this as somehow their system, survey site, does not allow me to send them message whereas it does definitely allow other users of its survey site (my co-workers) to send them live in time messages. Very odd. Further, they have not yet replied to my numerous emails to them about other issues, such as logging into their survey site. Reset password link."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nouman",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T10:09:40.000Z",
          "Titre": "It's a fake and false statement that",
          "Contenu": "It's a fake and false statement that Fake. Fraud , wastage of timeearns points and receives them at the same time.I earned 633 and wasted my time but now they said 2500 points earned to claim for withdrawI'm going to unsubscribe Thanks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "de cee",
          "Nb_Reviews": 15,
          "Date": "2023-12-07T16:45:58.000Z",
          "Titre": "Scamm!!!BEWARE.I like to make gas money…",
          "Contenu": "Scamm!!!BEWARE.I like to make gas money answering surveys and came across this gem.Well I played for an hour made $5 in cash and was trying to cash out into PayPal.To my surprise it wouldn't let me ,a \"message blocked \"appeared when I tried to cash out and trust me I tried everything.Well I checked online to see how to fix issues and it seems EVERYBODY HAS SAME ISSUE.DONT WASTE TIME ON THIS SITE ITS A SCAM!!!.I even tried contacting them and went round and round in circles."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Shawn Bishop",
          "Nb_Reviews": 4,
          "Date": "2023-11-30T04:56:51.000Z",
          "Titre": "Don't bother with this site",
          "Contenu": "Don't bother with this site. I qualify to participate in every survey offered until I answer the first screening question. There is supposed to be some sort of contest that you can get a bonus if you answer a survey every day. Trouble is you don't get surveys every day. Points that you do earn are few and far between. I go many days and the best I can accumulate is 3 points. It's impossible to get to a reward at that pace. If I ever do get a reward, I'll be saying good bye to this site as quickly as getting denied a survey opportunity."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James S",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T16:00:09.000Z",
          "Titre": "Starts of with a bang, then......",
          "Contenu": "The first week is fine. Then prepare to get locked out of survey after survey. Of course, only after you've answered about 10 minutes worth of \"PRE-QUESTIONS\" I've been screened out of my 5 previous surveys. I got a total of 6 cents for about an hours worth of \"PRE-QUESTIONS\" It's just not worth it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "peter",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T03:16:26.000Z",
          "Titre": "I'm working with several survey…",
          "Contenu": "I'm working with several survey companies and have for over a year and this has never happened.  I'm new to Prime surveys and checked in today and the site has been breached and 3 paypal payments were executed from my account none of which I authorized or attempted to make.  I am waiting now 3 hours and 11 minutes for resolve."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Anna O Riordan",
          "Nb_Reviews": 3,
          "Date": "2023-11-28T20:16:03.000Z",
          "Titre": "Contacted prime opinion today to…",
          "Contenu": "Contacted prime opinion today to complain after fully completing a survey on fast food restaurants a survey I took through prime opinion app I did not get paid I was also directed to join another survey company I contacted prime to say I wanted my points and prime basically said Haha to bad.  Zero help."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KING",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T03:30:15.000Z",
          "Titre": "IS THE WORSE APP EVER!!!!!!!",
          "Contenu": "IS THE WORSE APP EVER!!!!!!!! - YOU STEAL MONEY THROUGH REJECTING SURVEYS & I CAN TELL BY THE NAMES YOU DON'T LET BLACK OR WHITE PEOPLE SUCCEED - BE CAREFUL WHO YOU URINATE ON!"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T23:43:07.000Z",
          "Titre": "Most of the time my surveys got…",
          "Contenu": "Most of the time my surveys got declined either after completion or during middle of the survey and I get nothing. This is not good, all my hard work and energy are wasted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T05:21:14.000Z",
          "Titre": "1 Since you asked let me tell you how I really feel.",
          "Contenu": "1. Surveys take longer than the stated times.               2. Surveys are too long for the small number tokens     earned.                                                                     3. Surveys wait too long into the survey to      inform you, \"Unfortunately, you do not qualify.\" or     \"You have been screened out ...\"  Our time has no      value to Prime Opinion.  I start each survey with the      fear that I will be wasting my time again.     time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Blessings DT",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T23:06:49.000Z",
          "Titre": "Prime Opinion",
          "Contenu": "I actually wanted to wait to give my review for this particular reason, as I am not new to taking surveys on these surveys apps/platforms.However as expected, the Prime Opinion survey app is similar to a lot of these other survey app/platforms. I was doing pretty well with earning from completing surveys during the first few days or so during the honeymoon stage, but of course my earnings have drastically stopped. I would only recommend this survey app for new users to earn for a few days, after that I'd highly recommend moving on."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Colin Stapp",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T22:26:29.000Z",
          "Titre": "Great initially, but total rubbish now for no apparant reason",
          "Contenu": "After signing up for this i managed to get on numerous surveys and quickly got to the initial points required to cash them in for cash. Now after this initial ability to take surveys I have virtually.had zero success in getting onto any other surveys despite remaining consistent in my replies. I'm told that this is.out of their control and that that the more surveys I do the better chance of getting on to them improves which is a ridiculous argument as I cant seem to get on any since achieving the first goal of points. I give up and it's such a waste of time, best survey site by far is Branded Surveys, I wouldn't use Prime Opinion"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Stephen",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T06:37:06.000Z",
          "Titre": "I have not received the $20.00 Coles…",
          "Contenu": "I have not received the $20.00 Coles voucher I applied for on Wednesday even though my points show that the application was successful"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bobby",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T14:35:09.000Z",
          "Titre": "Horrible company",
          "Contenu": "Horrible company. For about the first 7- 10 days you will be fine then after that, when you start making decent money you will be phased out of every survey. It also doesn't give you the rewards that are promised. I made it to gold level and then all of a sudden I was either phased out of every survey or it just stopped offering me surveys. The site is a scam and after a certain amount of time will subtlety block you to prevent having to pay you. I would do this for the first week then I would leave it. It draws you in then phases you out once you advance a little bit."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "SS",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T12:04:02.000Z",
          "Titre": "Rubbish Don't waste your time",
          "Contenu": "Day 1 started off great. Qualified for a lot of surveys. Day 2 I got locked out of my account for 24 hours, with the reason being given as 'fraudulent' behavior. I was qualifying for no surveys so kept clicking through to the next available survey to see if I would qualify for at least one. This is deemed fraud apparently. Can't be bothered with a survey platform that treats its participants as 'frauds'. Goodbye."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jacob Smith",
          "Nb_Reviews": 15,
          "Date": "2023-11-22T20:48:54.000Z",
          "Titre": "Will improve review when support stops…",
          "Contenu": "Will improve review when support stops ignoring me.No reply since the 17th despite numerous messages in two tickets...Was enjoying my time on the site apart from an issue with an error 403 message plaguing the highest value surveys...The fact chat has clearly been removed from my account and NOW NOBODY IS REPLYING TO MY SUPPORT MESSAGES. Suggests it was removed on purpose contrary to the lies Salvador told saying it was being investigated.IF it was truly being investigated, then why not reply to say it's still ongoing?Ignoring me suggests that like I thought previously, lies have been told over and over again.So kindly respond to my message/s. And I'll up this review to a more appropriate rating. At this point in time the review is more than fair at 1 star. Since support arent actually doing their goddamn jobs.Furthermore, staff repeatedly telling me I'm seeing less surveys due to survey inventory refreshing is complete crap. I see the same amount of surveys regardless of if I have blocks on my account, if they've expired or if there are ZERO blocks...Add to that more surveys appearing for a split second and then ALL disappearing upon attempting one is pathetic."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tina Schrader",
          "Nb_Reviews": 3,
          "Date": "2023-11-05T05:17:13.000Z",
          "Titre": "Terrible",
          "Contenu": "I had a terrible experience with Prime Opinion. I think I qualified for one survey, but the worst part was being told I qualified for some high-point surveys only to soon after be told \"The leader of this survey [or something to that effect] has screened you out.\" Why tell people they qualify and get their hopes up when it turns out they actually don't? That's pretty low."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "c p",
          "Nb_Reviews": 79,
          "Date": "2023-11-10T19:44:37.000Z",
          "Titre": "Awful The sent me an adidas voucher instead…",
          "Contenu": "AwfulThe sent me an adidas voucher instead of Amazon.It was very difficult to contact they all their emails are not reply.They said they will not send me the correct voucher that I ordered.I will not be completing any surveys for them.Last time I redeemed you they not send the correct number off vouchers until I chased you several time.Each time I redeem they make some sort of  mistake."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "W. Mac",
          "Nb_Reviews": 7,
          "Date": "2023-10-29T03:28:12.000Z",
          "Titre": "well it's been almost 2 months since I…",
          "Contenu": "well it's been almost 2 months since I started a month since I gave a review. Well sad to say it's just like the rest after a while most all the survey screen u out asking ethnic identity and other so called screening questions which I feel is racially biased and the ones that let u participate are for small amounts that take longer time to complete and half of those freeze up or kick u out during the survey some once u get to the very end. It's all a catch my mother always said if something sounds too good to be true it usually is well prime opinion surveys is another example of that being exactly true. Don't waste ur time"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "c p",
          "Nb_Reviews": 79,
          "Date": "2023-11-27T17:31:32.000Z",
          "Titre": "i unsubscribed Prime Opinion due to…",
          "Contenu": "i unsubscribed Prime Opinion due to them sending the wrong voucher for a company that I do not use and they wouldn't change it,They are still sending me surveys."
        },
        {
          "Note": 1,
          "Lieu": "ID",
          "Pseudo": "Vetriyanto",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T05:47:22.000Z",
          "Titre": "An online survey platform that in my…",
          "Contenu": "An online survey platform that in my opinion does not respect its partners, is just a waste of time. 1 (One) word, 'LEAVE'!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr Lee",
          "Nb_Reviews": 4,
          "Date": "2023-11-28T01:07:42.000Z",
          "Titre": "Scam company",
          "Contenu": "Scam company. I have used many survey sites and 99% of allSurveys you are screened out of, or complete the survey it pays you less points than it said it would at the start. As soon as i got to my first £5 to claim, it said for my first reward i need to go for £10…fair enough…a few weeks later I do and suprise suprise…my account is blocked and no replies to email sent etc. so looks like they have stolen my £10 earned. Immoral."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dale Chaney",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T23:37:37.000Z",
          "Titre": "I completed 3 surveys last night",
          "Contenu": "I completed 3 surveys last night, total value over 300 points, and after FINISHING the surveys the message came up that I was being weeded out because I didn't meet their criteria.  I wasted over an hour and a half for no points ..What a JOKE!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "gabriel salwa",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T09:45:22.000Z",
          "Titre": "I think this site is scam because I…",
          "Contenu": "I think this site is scam because I have created an account filled my personal data verified my mobile phone number withdraw threshold is 5$ but after I have earned 4.7$ I can't able to take any surveys a lot of surveys available I don't find any warning or ban message"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Louis Ysaguirre",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T20:16:31.000Z",
          "Titre": "A lot went wrong and enough times where…",
          "Contenu": "A lot went wrong and enough times where I do not want to continue using your company. I have already sent you reply’s and no response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Eyerly",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T22:31:39.000Z",
          "Titre": "Prime duplicates.",
          "Contenu": "Prime refers you to other surveyors, which means that you'll re-enter things like age, State you live in, Income, zip code, and other \"screening\" information at least twice per survey.  Can't they screen BEFORE they send you to the survey?  Can't the pre-populate?  Apparently not.  One star."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T11:59:03.000Z",
          "Titre": "You will lose more and not be paid more than you earn",
          "Contenu": "You will lose more time andnot get paid more then you will get paid. Spent near a hours total on 2 surveys right after each other than didnt pay. Coustomer service is poor and dont care for non payments dont want to help or know. They are breaking uk law but dont care. The way to make these companies care is to hit them where it hurts is there pockets. If they haf no users they would make nothing. They want users ti be loyal but cant be loyal to users. There are plenty better surveys sites out there. I would mention then but dont know if im allowed to or not on this. Do a google search for best paying survey sites and will have no problem finding better and finding a company that actually helps there users get there payment.Other survey sites still pay a part of the payment for non payment so you dont completely lose out.STAY AWAY"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "emanuel williams",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T15:40:24.000Z",
          "Titre": "this company waits until cashout to…",
          "Contenu": "this company waits until cashout to tell you your account is under review then they disqualify when you only need 50 points to cashout...these people are crooks and im gonna report them to the right ones"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Brona",
          "Nb_Reviews": 4,
          "Date": "2023-10-19T00:18:02.000Z",
          "Titre": "Signed up through a link emailed to me",
          "Contenu": "Signed up through a link emailed to me. Read reviews seemed very promising. So wrong. Accepted sign up bonus and tried to complete surveys but after answering “multiple questions within surveys” would be presented with sorry not suitable, screened out and awarded on average 1 point. Left it a few days then tried logging back in to be placed under review. 24 hours later message reads “Due to recurring complaints about the quality of your responses you can’t take more surveys forever” I only earned 954 points in total and considering the bonus I don’t understand how they can accuse me of quality of response when they didn’t allow me to complete surveys. Wasn’t even able to withdraw the points earned. Absolute waste of time better off checking out other sites. Iv always answered honestly and find surveys both interesting and thought provoking. If I could give 0 stars I would."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "wayne dome",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T22:37:43.000Z",
          "Titre": "Way to hard to resolve issues with…",
          "Contenu": "Way to hard to resolve issues with payments. Even your advice that bearly gives accurate directions to resolving issues. You need someone who doesn't have site knowledge try without your helping them navigate your site trying to solve issues. Make it more easy to get back to having fun. I am not mad. Wayne Dome"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carl",
          "Nb_Reviews": 4,
          "Date": "2023-10-17T17:39:37.000Z",
          "Titre": "Possible Fraud",
          "Contenu": "I opened an account with this company. They asked for verification by using verification through my phone number. By accident I provided it and now they have placed my account on hold. This place is obviously obtaining personal information for their own reasons. It is very much the same as fraudulent crypto mining websites. They get your money and then claim that you have more than one account so they don't have to pay back your money. I don't trust them!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kensi Blonde",
          "Nb_Reviews": 5,
          "Date": "2023-10-11T16:14:51.000Z",
          "Titre": "Time waster",
          "Contenu": "Most of the surveys ask you very personal questions such as your finances, what you invest in, etc. Then you answer and it moves you through, so you think you're approved for the survey, but then it asks you something very standard like the year of your birth and you will be suddenly rejected and it gives you one point for your time. A lot of effort and time for very little to no reward."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen MONTEIRO",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T22:36:29.000Z",
          "Titre": "50% of the time Surveys are broken you are non-qualifying. more or yo don;t qualify More than half the time the surveys you…",
          "Contenu": "More than half the time the surveys you are given either time you out or make you proceed half-way through and then decide you are not eligible or a good fit.  A tremendous waste of time.  Enough of a waste of time to encourage me to look elsewhere to do surveys.  You need to do a much better job to prequalify the survey takers for all surveys one-time, up front before sending them to a survey."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dior Lux",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T04:48:05.000Z",
          "Titre": "There is a scam you do the surveys and…",
          "Contenu": "There is a scam you do the surveys and when you get to payout they say your account is under review."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Please",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T03:02:03.000Z",
          "Titre": "If you don't have a degree or college…",
          "Contenu": "If you don't have a degree or college education don't plan on making money on this app because they will discriminate you they won't even let you qualify for a survey but the customer service is good they reward you from time to time do you know how long it took me to make $5 3 days that's insane"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ean Brown",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T02:54:03.000Z",
          "Titre": "Avoid, there are better options",
          "Contenu": "Alot of surveys hosted on this site will record your answers and not pay, and support is not at all accommodating of this. There is virtually no oversight."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Branda Edwards",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T19:19:40.000Z",
          "Titre": "This site is awful",
          "Contenu": "This site is awful, you rarely qualify for surveys, maybe 1 out of every 15-20 that you try.  I think it is a waste of time and even 1 star is a better rating than they deserve.  I have tried other sites and Amazon Mechanical Turks is the best by far."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Unknown",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T04:20:40.000Z",
          "Titre": "Don’t Do it",
          "Contenu": "Terrible Site.  They banned me with no option of response. I can’t even get into the site to write. I’m sorry pretty crappy company if all of sudden they ban you and don’t give you a chance to respond. You can think these people with “1” for review are just bad mouthing company but I tell it how it is."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T22:02:10.000Z",
          "Titre": "Prime Opinion is a literal scam",
          "Contenu": "Prime Opinion is a literal scam. they will wait until you have 470 points (500 are needed for a cashout), and then they will arbitrarily ban you from taking surveys. Their \"customer support\" is literally ai chat bots that refuse to help in any manner at all. I cannot believe that I have my account where I cannot cash out. This site is a terrible scam, and you would be better off watching paint dry."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T09:20:05.000Z",
          "Titre": "Has no survey on weekends and always…",
          "Contenu": "Has no survey on weekends and always screens out and problem with some surveys"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thành Kim Nguyễn",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T21:27:10.000Z",
          "Titre": "not worth 1/2 star",
          "Contenu": "not worth 1/2 star. spend all your time and get a little pocket change"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T03:09:53.000Z",
          "Titre": "All the screenout survey should be not…",
          "Contenu": "All the screenout survey should be not there in the bucket list all should be generous to fill the survey and we should get our rewards beside that what about the survey get screenout in between what we will earn"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "David Blenkinsopp",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T11:37:35.000Z",
          "Titre": "Absolute definition of a scam",
          "Contenu": "As others have said, initally starts off great earned approx 500 points per day for the first three days, hoever for the last 4 days I have not been able to reach the magical 500 points to withdraw at 2500. I keep getting disqualified AFTER I have completed the survey which is annoying as heck, and shows that they are doing everything to prevent you hitting the magical withdrawal figure. This is even worse than other sites! AVOID - I know I will if I can ever get the last 36 points to withdraw. Oh and the line that they always pay twice what the surveys provider do, that may be true for the first three days then they UNDERPAY, yep the same surveys on other sites are higher"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Hutchings",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T06:58:58.000Z",
          "Titre": "I haven't been able to qualify for a…",
          "Contenu": "I haven't been able to qualify for a survey for a week and a half, I have 414 points out of 500 needed to cashout. Emailed them over 2 times and my account is still the same can't qualify for a survey."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Q Roberts",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T17:35:05.000Z",
          "Titre": "This app is very fraudulent",
          "Contenu": "This app is very fraudulent. Will always log you into surveys, then kick you out last second before obtaining your reward just to have your time wasted. 971-3292234. Prime opinion also bans accounts for arbitrary reasons. Prime Opinion sucks!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 3,
          "Date": "2023-07-22T04:55:55.000Z",
          "Titre": "They're worse than the gestapo",
          "Contenu": "If you vacation in the area code of someone else on the site, unqualified. If you use another device from someone because you don't want to be tracked, unqualified. If you visit anyone and use even their internet on another device, unqualified.My sister referred them to kill time, but I'm not stupid enough to use my primary device with all my information. Everyone has burner phones and prepaid cards these days.Makes me wonder exactly how much information they're truly after. Waste of time.Too much drama."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "opinion",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T14:03:02.000Z",
          "Titre": "Complete waste of time",
          "Contenu": "So many survey glitches where I would complete a survey and then be told I was screened out (after spending upwards of 29 or 39 minutes of my time) and basically get no points. Then after my first week of using; I got blackliated somehow despite always having shared my honest opinions. Total waste of time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe Robot",
          "Nb_Reviews": 4,
          "Date": "2023-08-29T04:16:35.000Z",
          "Titre": "Another rip off survey site....",
          "Contenu": "Another survey site where you can spend hours searching and doing surveys to end up with 50 cents. I spent 20 minutes doing a survey just to to be knocked out with a penny compensation. It happens often. I don't understand the appeal of spending hours trying to find surveys and doing surveys for very little compensation just because you are in the privacy of your own home. You could go out for a walk and find spare change and at least you would get exercise."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T22:53:04.000Z",
          "Titre": "I finished two entire surveys and never…",
          "Contenu": "I finished two entire surveys and never received credit for them. Too many surveys pay terrible amounts, like 8 cents. This is simply not worth anyone's time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T01:13:18.000Z",
          "Titre": "exactly the same as all the other…",
          "Contenu": "exactly the same as all the other survey sites ... you take a survey for 200 points you have to answer a couple questions then ,,,,\"Sorry you dont qualify\"  and if by some extremely slim chance you do \"qualify\" it takes you to another page and get a ton of questions after about the time it states the survey takes it kicks ya out and says \"sorry you were disqualified by the surveyor\" smucksthen they have a bs reply to my comment psh"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Haseena Mohammad-",
          "Nb_Reviews": 4,
          "Date": "2023-10-03T17:52:36.000Z",
          "Titre": "Worst platform everWorst website",
          "Contenu": "Worst website . They never allow to complete the surveys. They interrupt in the middle of the survey and send message try again .Don’t waste your time . It’s a genuine review. These type of companies should be banned. They play with public emotions. Worst platform."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paul",
          "Nb_Reviews": 40,
          "Date": "2023-09-17T17:25:07.000Z",
          "Titre": "Once again!",
          "Contenu": "Once again the supplier of surveys blocked my accountUS cheat all the time ,non stop errors and you loosing points but that's fine The survey are not realistic on beginning you have been told we will take you 10 min but afterwards is 24min .They pay you little penny and still punished you if they don't like your answerFor Ukraine and others aid issue plus when is conflict US is first to show up how great country and nation they are but for couples penny they are blocked you , punished you because they don't like your answerHow ridiculous is thatUsually they are blocking you before prize drawn ,so this is really planned from their side."
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Bree",
          "Nb_Reviews": 3,
          "Date": "2023-08-10T23:52:05.000Z",
          "Titre": "I would say this is one of the worst…",
          "Contenu": "I would say this is one of the worst survey sites I ever joined. I regret joining this!!! Everytime I try to take a survey they screen me out without even answering a single question 😡😡. Their welcoming bonus is unrealistic how can I reach 2500 points in order to withdraw. Not forgetting their customer service that is so bad I sent alot of messages but they didn't even bother to reply. I'm thinking to delete it even though I have 869 points 😒😒"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gogirl",
          "Nb_Reviews": 3,
          "Date": "2023-09-17T19:10:40.000Z",
          "Titre": "The first 5 days I qualified for…",
          "Contenu": "The first 5 days I qualified for surveys worth over 200 points.  This has dried up quickly, and I am being disqualified for a very high proportion of surveys with no explanation.  What happened??  Is this website a come-on?  Feedback is appreciated."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Heather Tate",
          "Nb_Reviews": 6,
          "Date": "2023-10-11T21:48:03.000Z",
          "Titre": "There was a problem that took place and…",
          "Contenu": "There was a problem that took place and the manager took the customer service agent side over mine when she lied to me and the manager. Eventually he will find that out but in a bad way. Don't wish any harm on anybody but it's his own fault for taking her side. He also punished me by taking away instant message which helped me to let them know when there were bugs in the survey. Not happy I feel like my heart has been ripped out! Don't use!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-13T01:12:41.000Z",
          "Titre": "Crap Company",
          "Contenu": "Unlike Prolific, this site is asking the same 'qualification' questions that could take up to 3 minutes before being disqualified. There is no contact email, so that means zero support if anything wrong happens. This company is total crap.Wasted my time trying this out and the points is only worth .8 pence. I only found out about this site from a survey done on Prolific. They were trying to pull me off of Prolific. NOPE!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rick Stewart",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T20:49:26.000Z",
          "Titre": "Everyone seems to like this survey…",
          "Contenu": "Everyone seems to like this survey website but I can't understand why. I get asked simple questions and then they block me. I believe they discriminate and nobody seems to care. Don't believe the good ratings"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David French",
          "Nb_Reviews": 2,
          "Date": "2023-08-19T08:36:11.000Z",
          "Titre": "Cheating me on points",
          "Contenu": "I signed up for PrimeOpinion, they claimed to offer a LOT higher paid surveys. That is false, they're about like everyone else.  Even worse, I have taken three surveys tonight, and the number of points promised at the beginning of the survey for a COMPELTED survey is not the amount I received at the end of the COMPLETED survey.  I took screenshots and messaged the company through the survey website."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "ROSARIA DI",
          "Nb_Reviews": 3,
          "Date": "2023-11-21T15:58:42.000Z",
          "Titre": "Too many surveys are not even possible…",
          "Contenu": "Too many surveys are not even possible to complete. Too many broken or just with few points.Shame that your bonus reset every week"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T23:54:52.000Z",
          "Titre": "This site has gone downhill",
          "Contenu": "This site has gone downhill. Here are all the things that have happened to me.- ended up getting banned because I kept telling customer support to compensate me after I never received points after completion of surveys (with proof), they ban you for the dumbest things like earning too many points and asking for help. - most of the users on the leaderboards are bots, no way anybody is making over 70 dollars a week on this site. (See below) - it’s hard to get approved for surveys, and there are cases where even if you complete it, you’ll never receive points because “the survey provider forgot to” - when you get banned, customer support won’t help, emailing doesn’t help, only way I could chat is through Reddit which is f^cking embarrassing on their part"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T16:54:53.000Z",
          "Titre": "Prime Opinion Doesn't Care About Users",
          "Contenu": "Prime Opinion was a favorite of mine, until I was \"suspended\", but it was never explained what it was that I supposedly did. The chat bot said that companies that they use can suspend users at their discretion, but again, nothing was explained to me. I take every survey seriously, so I cannot understand what the issue was. I will never use Prime Opinion again, especially because Branded Surveys are so much better, especially as it relates to customer service, and how they treat the users that they rely on. If you're thinking about using Prime Opinion, DON'T."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Andrew Dicks",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T03:14:59.000Z",
          "Titre": "Misleading, no where near what they advertise",
          "Contenu": "They hype this as an amazing way to make money, unless you are on this site 24hrs a day you might make 20 bucks a month. I got so frustrated with being phased out of surveys and misleading info (site would say 5 minutes and it would take 20). I deleted my account won't be back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T01:54:50.000Z",
          "Titre": "Started good, currently not worth the effort",
          "Contenu": "Started good completed a lot of surveys, made some money, lately, no matter how hard I try to get more surveys, I am not able to get or complete them. Spending more time attempting to get surveys, than actually completing them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joann Singer",
          "Nb_Reviews": 3,
          "Date": "2023-09-01T17:01:18.000Z",
          "Titre": "It takes way too long to get a survey",
          "Contenu": "it take's way too long to get a survey. Then when you do get one you can take it three quarters of the way and then they decide your not \"a good fit\" so you have just given away your information for fifteen minutes and just get dumped out of the survey with no points to show for all your time, effort, and exposed privacy. This needs to be fixed."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jprx",
          "Nb_Reviews": 19,
          "Date": "2023-09-11T16:29:54.000Z",
          "Titre": "Underpaid",
          "Contenu": "Underpaid, I was meant to receive £20 but I only received £19.42 I know it's only an underpayment of 58p but if I get underpaid every time I cash out through PayPal then that 58p could turn into more, best of taking surveys elsewhere so that you get paid what your meant to be paid, I did contact their customer support yesterday and have heard nothing backWhat do you mean take it into consideration if qmee can pay exactly what you earn through paypal so can prime opinion"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T01:26:30.000Z",
          "Titre": "Tired of  starting surveys and not getting credit",
          "Contenu": "I am tired of  starting surveys and getting several minutes in asking questions related to products , then being sent to another survey . I understand there are questions asked for determination of eligibility . But i am talking about a survey within a survey . I also have had many times where i get to the end of a survey and I dont get credit for it .  Lately there havent been many surveys available to me at all !! . if this continues I will no longer use this website"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Stanley Vokes",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T16:36:46.000Z",
          "Titre": "WASTE OF LIFE!",
          "Contenu": "WASTE OF LIFE!Worked well for a while, was taking around 30-60mins to earn £5 paypal. This quickly changed to over 3 hours due to the fact surveys constantly screen you out. Also, if a survey is labelled as 10mins it will take 30 and will probably screen you out at the last minute. It seems they want you to answer all questions before they screen you out so they get the data but you don't get the reward."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T19:11:12.000Z",
          "Titre": "Absolute waste of time",
          "Contenu": "Absolute waste of time. Apparently as a working adult (teacher) I dont qualify for most of the surveys (not one of the 8 that I tried. It would work far better if one could put in the relevant information at the start and only get offered surveys for which one qualifies, instead of wasting so much time!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Joanna Cao",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T10:39:00.000Z",
          "Titre": "Waste of time",
          "Contenu": "So not worth the time, as it kicks you out in some survey. You'd also have to get around 2500 points in order just to claim $5, one survey is around 10minute and you'll only earn 50-100 points. Meaning this would take forever and honestly a waste of time just for $5?? I could sit on the street dressed up homless and I'll earn more."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paul",
          "Nb_Reviews": 40,
          "Date": "2023-08-28T21:05:09.000Z",
          "Titre": "Again US playing doggy games and…",
          "Contenu": "Again US playing doggy games and punished your blocked your accountI wish to punished that US as well because everything bad came from there and if is any conflict they are first to supportBut in real life look what they are doingNo surveys at the momentUnfortunately currently there are no surveys Please come back later!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Samuel",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T10:13:51.000Z",
          "Titre": "They decided to disqualify every survey…",
          "Contenu": "They decided to disqualify every survey just before reaching the allowed withdrawal amount. Their contact has been ignoring support tickets for the last 4 months."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T20:30:11.000Z",
          "Titre": "This is not rocket science/short surveys and better rewards are needed.",
          "Contenu": "This is not rocket science. Many of the surveys are way too long. They ask way too much. And they don't give enough rewards/points for the time and effort. A lot of the time, we do long surveys, more than 15 mins to get \"disqualified\" at the end of the survey. That is 100% unfair and dishonest, especially considering that before the survey they said it was gonna be just 10 mins! We need double or triple the points for the surveys. They should always be short, less than 10 mins to get the best honest answers. People get tired and bored after 10mns."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T23:19:27.000Z",
          "Titre": "you suspended my account because your…",
          "Contenu": "you suspended my account because your customers reported I was being dishonest.But you allow them to change the time of the survey, and not pay after completion of them.and my favorite one, I get disqualified on a 20 minutes survey after spending 19 minutes on it and I get paid 19 minutes.I have to get pre-qualified prior to the survey and then go through sometimes 4 more qualifications before FINALLY getting to the survey.then disqualified and no points or just 4 points"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Raju",
          "Nb_Reviews": 4,
          "Date": "2023-10-20T09:03:13.000Z",
          "Titre": "Very Poor customer service",
          "Contenu": "Very Poor customer service, i sent an query twice but not a single response received from their side and i need to delete my account today.... they don't care about their users"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacqueline Mayfield",
          "Nb_Reviews": 5,
          "Date": "2023-08-17T20:02:53.000Z",
          "Titre": "Banned Permantly After Trying to Send a Message",
          "Contenu": "I started out liking Prime Opinion, but then they banned my account because of the quality of the answers I was given. They said that my band would lift on August 4th, but it never did. I reached out to chat with them, apologized to them, and told them I would give better answers, although I did. They never replied, and all of a sudden they banned me permanently. Very unprofessional company. I would not recommened."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T14:09:21.000Z",
          "Titre": "Best survey platform around!",
          "Contenu": "Best survey platform around! ***Update: best platform around…in the beginning. As you do more surveys and earn some payouts, you’ll notice the amount of surveys available go from many to maybe 2-3. Or none at all. When I asked why I was told I’d gotten complaints from their survey partners about my answers. Odd because I’ve been taking surveys on other sites for years and have never had that issue. I answer surveys honestly, and apart from the basic questionnaires, don’t speed through them (honestly, how hard is it to answer your age and gender?) so I find that explanation hard to believe. Just my experience. I just ended up deleting my account, not worth the hassle."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T20:01:18.000Z",
          "Titre": "Bad cause you banned me for no reason…",
          "Contenu": "Bad cause you banned me for no reason when half of the surveys kick me without me even getting to do the survey"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Starr Gay",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T15:36:37.000Z",
          "Titre": "Banned Account",
          "Contenu": "Prime opinion has banned my account for no reason saying that it was because of surveys being banned by the provider. However, it happened on a weekend when those survey providers were open and despite my trying to reach out several times, they haven't responded back to me. I'm now at a point where I have surveys but I'm not qualified for any of them so I'm unable to make money on the platform in my points are just getting wasted. They won't respond to any request for information about it nor will they acknowledge the problem at all"
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Lesego Mokgojoa",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T16:20:24.000Z",
          "Titre": "I always get screened out after…",
          "Contenu": "I always get screened out after spending so much time answering the survey."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T11:04:59.000Z",
          "Titre": "Well",
          "Contenu": "Well, not good as it may look like. I saw a lot of positive comments about the site, then I decided to try it out. I completed a few surveys which got me to 400pts, 100pts before cashing out, and I got a message on the screen to confirm my phone number, which I also did. I was then told that it will take 24hours to review my account, I waited for a few hours, then I logged back in. I saw lots of surveys, but couldn't take any. I have sent a mail to support, but didn't get any response. What a joke"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paul",
          "Nb_Reviews": 40,
          "Date": "2023-08-07T20:19:12.000Z",
          "Titre": "Bad experience",
          "Contenu": "Bad experience because the company blocked you as the company who offered the survey did not like your answerIs that individual responding it what they wanted???They should improve also the errors on the survey as they cheated a lot of"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Andrew N Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T18:16:24.000Z",
          "Titre": "Not able to claim my reward",
          "Contenu": "After taking 2 survey successfully.My point is 529 but can't withdraw my reward.I verified the account with the phone number and it got approved.Whenever i am trying to withdraw my reward  as 5$ visa card it's showing block message.Such a trash site.Waste of time"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "ABDULRASHID JIBRIN",
          "Nb_Reviews": 9,
          "Date": "2023-08-24T19:46:58.000Z",
          "Titre": "BEWARE OF SCAM SURVEYS",
          "Contenu": "1☆ -1☆=0☆!!!! BEWARE BESAFE !All survey apps are basically the same: They extract the needed information from you, and then they disqualify you, JUST to save their POCKETS. Don't even bother trusting this app!!!!Review from experience"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "OML",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T17:11:14.000Z",
          "Titre": "Prime Opinion SUCKS!",
          "Contenu": "This platform promises a lot and gives you crap. The most UNDERPAID platform I have ever experienced!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Michelle",
          "Nb_Reviews": 4,
          "Date": "2023-10-25T03:47:11.000Z",
          "Titre": "Scam",
          "Contenu": "I have tried to claim a $20 Coles gift card for the past 3 days and keep getting messages saying they'll get back to me, just now I've tried to change to a $20 PayPal credit and the site tells me my email addresses don't match. But they do. Total scam site."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Katrina",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T02:18:51.000Z",
          "Titre": "I have made about $20 in the first day…",
          "Contenu": "I have made about $20 in the first day I signed up, but now I'm not making a single dollar due to the fact I attempt a survey and then get disqualified almost straight away. I did a 20 minute survey, only to get to the end of it for it to crash and tell me I've already done the survey, so I didn't get a single point! Disappointing."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Dark Beautyy",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T07:26:28.000Z",
          "Titre": "Under review for 24 hours",
          "Contenu": "I signed up to prime opinion whilst completing a survey through another site (obviously a recruitment style survey).It gave me an option for extra rewards with a bonus code for a limited amount of time. After completing 5 surveys, and just under the lowest cashout/ redemption available I was asked for my phone number (verification I get it) however after submitting my phone number and the code sent to my number it has now locked my account for \"Max 24 hours\" whilst under review. So essentially the bonus code they have given me will expire before my account becomes available again after their review."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Lissa",
          "Nb_Reviews": 30,
          "Date": "2023-07-13T18:44:51.000Z",
          "Titre": "0 stars no one ever answers u my…",
          "Contenu": "0 stars no one ever answers u my friends been waiting 3 days for answer n still not seen message n I've no surveys again on my account haven't even cashed out n I don't think I'll ever at this rate"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Abbey Watson",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T21:39:07.000Z",
          "Titre": "Never gives enough points"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ruth Onyett",
          "Nb_Reviews": 9,
          "Date": "2023-08-28T15:04:06.000Z",
          "Titre": "Prime Opinion is a rip off!!!!",
          "Contenu": "I change my review for Prime Opinion to a zero because it is a bunch of crap. My answers to all questions are truthful and very honest. They stopped me doing survey to Sept 3rd because they said there were complaints about my answers to the survey's I think it's a rip off. Most the survey 's are not no good and I don't get credit. I am very honest and truthful."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Kevin McDade",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:42:03.000Z",
          "Titre": "the surveys don't give enough points",
          "Contenu": "the surveys don't give enough points.  Other sites give better rewards than you do.  For example: a 20minute survey with you reward is so low that sometimes I don't do them.  With other sites a 20 minute survey could be worth 300 - 400 points. Your point system is really bad. If I have to spend 20 minutes of my time doing a survey then I would want to see better points system."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Roger Pyle",
          "Nb_Reviews": 6,
          "Date": "2023-12-10T15:01:35.000Z",
          "Titre": "Like most survey sites",
          "Contenu": "Like most survey sites, at first the surveys are relatively easy to qualify for, have a reasonable payoff, and you can accumulate enough points for a reward in a short period of time, sometimes the first day or two.  But the longer you are a member, the number of surveys dwindle, they become more difficult to qualify for, and the amount of points per minute ratio decreases rapidly.  It becomes hard to reconcile taking a survey that requires 30 minutes of your time and only get 30 points...which is .01 per minute, or a \"pay rate\" of 60 cents per hour.  All too frequently the time required is greatly underestimated so a survey advertised at 10 minutes you are only halfway through 15 minutes later.  So my advice to those who rate these surveys, or who read them, make sure you read the ones from people who have been the service for a month or so, not just the ones who have had it for a week."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "NJplantsman",
          "Nb_Reviews": 5,
          "Date": "2023-11-21T13:11:55.000Z",
          "Titre": "A very frustrating survey company to work with.",
          "Contenu": "This is a very frustrating survey company to work with. Often times the surveys take significantly longer than what was estimated. You are often redirected to different surveys from what you initially started. You sometimes spend 5 minutes or more qualifying only to be rejected when the survey itself was only supposed to be 5 minutes long. They're far better companies to work with."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T01:37:50.000Z",
          "Titre": "Broken Surveys",
          "Contenu": "Most of the surveys I encounter are either broken or I get screened out of them. Unfortunately, I don't find that out until I've invested a lot of time and don't end up getting the points offered. I enjoy the surveys that I'm able to complete but those are few and far between."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "LH Castle",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T05:19:45.000Z",
          "Titre": "Unfortunately very underpaid studies",
          "Contenu": "There are a lot of surveys, but the compensation is lacking given the amount of time spent completing a study."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris Lynch",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T20:07:19.000Z",
          "Titre": "Pretty Bad Overall",
          "Contenu": "Pretty bad overall, you get screened out of almost everything, sometimes in the last few questions of surveys. Haven't been able to reach the cash out amount because of these problems. The pay rate is also very low compared to other sites. I'm sure it does pay, but getting there is a struggle compared to other survey sites."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Amit Kumar",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T14:58:46.000Z",
          "Titre": "No surveys anymore",
          "Contenu": "HiWell its about my account from gmail omshantiop@So like its not getting survey , is there any problem with it?"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Lexihb",
          "Nb_Reviews": 12,
          "Date": "2023-10-05T17:14:29.000Z",
          "Titre": "Very slow earning rate",
          "Contenu": "Very slow earning rate. Unlike some sites that give subject titles to their surveys, this site doesn't , so it's a case of going through 3 to 7 'qualifying questions' before the Sponsor decides if you qualify or not. This site does not filter the best ones suited to you. On the plus side, there are lots of surveys, so when you've completed the ones on other sites, if you've got spare time, you'll usually find more here. And they do give rewards for each level you reach."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "pipz",
          "Nb_Reviews": 8,
          "Date": "2023-11-15T21:45:35.000Z",
          "Titre": "It’s okay",
          "Contenu": "It’s okay, I mean I can earn some money to be able to afford to eat every week. Downside is that there are far too many surveys where time is wasted filling in the same basic info and then being told you have been screened out. Too many broken surveys and wasted time. I’ve earnt £35 in Tesco vouchers over a week and a half and it’s money I wouldn’t have had for shopping. I just feel like I’m wasting my life! There must be quicker ways to earn some money"
        },
        {
          "Note": 2,
          "Lieu": "BE",
          "Pseudo": "Silverlining Fashion and Decor",
          "Nb_Reviews": 8,
          "Date": "2023-11-03T20:52:44.000Z",
          "Titre": "Unfortunately i can't say anything…",
          "Contenu": "Unfortunately i can't say anything other than after i signed in and did a few surveys, i now already for weeks am not able to do a survey and gaining points. To me that is not honest at all. I give my time and each time i am blocked or it isn't a match for me.What is the purpose of doing this to people that are wellwilling?"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T20:18:02.000Z",
          "Titre": "Spend a lot of time not qualifying for…",
          "Contenu": "Spend a lot of time not qualifying for surveys.Sometimes extremely lengthy surveys have very few reward points."
        },
        {
          "Note": 2,
          "Lieu": "MY",
          "Pseudo": "Melvyn ng凯贤",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T07:48:56.000Z",
          "Titre": "I have reached to 500 points so I’m…",
          "Contenu": "I have reached to 500 points so I’m enough to redeem the 5 USD reward so I did it, but it say I will receive within 30 minutes, but I waited for more than 10 hours, I still haven’t receive it… I have double confirmed with my prime opinion email and my paypal email, can you check what’s the problem? Prime Opinion?"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Cindy Cheney",
          "Nb_Reviews": 4,
          "Date": "2023-11-16T23:35:30.000Z",
          "Titre": "The surveys are coming back all broken",
          "Contenu": "The surveys are coming back all broken? Your website pays out great best in ages but now every survey I enter won’t let me continue???"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lori Mulligan",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T18:03:46.000Z",
          "Titre": "Surveys are not a match",
          "Contenu": "A lot of the surveys do not let you know you are not a match until the survey is almost complete and some of them time out."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Debbie Wilda",
          "Nb_Reviews": 2,
          "Date": "2023-11-05T01:00:16.000Z",
          "Titre": "Unhappy with not receiving my prize",
          "Contenu": "On the 4th of November I wrote and shared that I had yet to receive my prize. I was sent a link, but it would not work, so I wrote back and asked to have the link resent so I could try again,  I have yet to receive it.  This has given me a worse experience for the surveys.  I like taking them but am not happy with how much time it is taking to get the prize.  I think prime opinion could do better for the members if they were a little more proactive in their handling of their situations"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nick Nicodemus",
          "Nb_Reviews": 4,
          "Date": "2023-09-11T19:56:03.000Z",
          "Titre": "Not great tons of very very late unfair…",
          "Contenu": "Not great tons of very very late unfair disqualification. You waste a lot of time taking surveys just to have them not pay out. I woukd reccomend swagbucks or branded surveys or even freecash because they have better surveys and when you complete them.they actually pay. I have used this site every single day for a week now and at least 3 surveys a day inhave spent over 15 mins on individual surveys not to get paid."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T11:12:06.000Z",
          "Titre": "I've made plenty of Amazon vouchers but…",
          "Contenu": "I've made plenty of Amazon vouchers but alot of the time i complete surveys and don't get paid.Like today I spend 51 mins on a high paying survey and did not get paid.Contact coustomer service they give me 30 points compensation witch is less that 30 pence ,that does not make up for the time and the amount of points I lost. In total I've made and cashed out around £100 Amazon, should of been more but I've maybe lost total of over couple thousand points and maybe near 7 hours of not being paid.If you don't mind wasting your time alot of the time not getting paid you can still earn from this site,it will just be stressful at times. Today so far I've wasted 2 hours in which I didn't get paid and lost out points. Im starting to have the feeling of giving up on this and deleting my account. I'll see how it goes for now but continues wasting my time I'm gone.I have to drop a star now as not being paid Is getting worse and coustomer service don't care. I suspect they still get paid even though they say they dont, I believe if they didn't get paided themselfs they would have more of a problem with it, seeing they dont care when it happens Leads me to believe they do still get paid.I think that's me done with them now."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dr. Virio Guido Stipa",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T21:04:12.000Z",
          "Titre": "Most of the surveys either don't work…",
          "Contenu": "Most of the surveys either don't work well or do not pay. In order to get what they announce, it looks like seven planets have to align."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Velma Henderson",
          "Nb_Reviews": 8,
          "Date": "2023-10-19T15:47:45.000Z",
          "Titre": "No vouchers sent and no customer service",
          "Contenu": "I loved this site to begin with. I claimed three £20 vouchers(two Amazon and one Asda) in the first nine weeks. Since then I have tried to claim £20 amazon vouchers TWICE and have not received them (shows as claimed in my account). Nothing from customer services. Going to find better more reliable site."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Terry Walker",
          "Nb_Reviews": 5,
          "Date": "2023-10-02T22:18:32.000Z",
          "Titre": "Some positives, some negatives",
          "Contenu": "The positives are that there are many surveys to take and when you select a reward you get it in minutes. Alsp most of the surveys are short, under 10 minutes. The drawback is that you are screened out of most surveys and although some give you 1-4 points most don't give any points so your effort is not rewarded."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Louise Meyers",
          "Nb_Reviews": 5,
          "Date": "2023-10-19T23:53:38.000Z",
          "Titre": "I was frustrated because I tried…MANY surveys.",
          "Contenu": "I was frustrated because I tried multiple surveys, over 100 or more, and was kicked out of almost every one for no reason given. It is discouraging.I did manage to complete enough to make over $60 in a few weeks."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bree",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T18:44:10.000Z",
          "Titre": "My account keeps getting put under…",
          "Contenu": "My account keeps getting put under review and as of today all of sudden I don’t qualify for any surveys and I’m so close to cashing out. I had such high hopes for this site"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Elle Stall",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T19:22:38.000Z",
          "Titre": "As with other survey sites",
          "Contenu": "As with other survey sites, the first few weeks are awesome where you get all of the surveys you want.  But later, your surveys become limited and you have to click on multiple surveys just to complete one.  I'm no longer impressed...."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KingPin",
          "Nb_Reviews": 2,
          "Date": "2023-10-16T16:05:21.000Z",
          "Titre": "Prolific 10x Better",
          "Contenu": "Surveys take forever, longer than stated, and many consume significant amounts of time, only to tell you that you aren't eligible to participate. The pay is peanuts."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Barbara Ducharme",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T18:34:48.000Z",
          "Titre": "I don’t like that on some of the long…",
          "Contenu": "I don’t like that on some of the long surveys I can get in about 20 minutes and it shuts down so I don’t get any points."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T00:48:30.000Z",
          "Titre": "The same thing that goes wrong all the…",
          "Contenu": "The same thing that goes wrong all the time; you complete a survey and are denied points upon submission, and I mean after completing the WHOLE survey. Something does not add up here."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T06:31:26.000Z",
          "Titre": "I like that I am able to make some…",
          "Contenu": "I like that I am able to make some extra money, however, I don't like that you click on a survey and before you can add any information it says, unfortunately, you don't qualify for this survey, or you go through the whole survey 20-30 mins long and at the end, it says you don't qualify and gives you 4 points what is that all about? Some surveys don't open at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T17:06:37.000Z",
          "Titre": "Started Good, Slowed Down Substantially Thereafter",
          "Contenu": "This was initially a fun site to earn money on, but the surveys and available opportunities washed up extremely quickly and I find myself only looking to see if there is any reason to login since I signed up. I also commonly complete surveys that take over 15-20 minutes and am conveniently screened out once the data has been collected. This was not the experience I had in the beginning..."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Jon Heels",
          "Nb_Reviews": 34,
          "Date": "2023-10-05T17:24:50.000Z",
          "Titre": "Prime Opinion over rated…",
          "Contenu": "II have just started Prime Opinion about a week ago. The site offers lots of surveys but I am usually screened out of most of them, even the short low paying ones. I think Prime Opinion is a bit over rated to be honest"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T15:41:18.000Z",
          "Titre": "A lot of broken surveys and it will…",
          "Contenu": "A lot of broken surveys and it will often let you finish the survey, but then say you screened out. You will get to the last page that literally tells you that you completed the survey and then it will say it screened out. Its the companies way of getting your data, but not having to pay for it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chy",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T19:55:17.000Z",
          "Titre": "A lot of wasted time",
          "Contenu": "A lot of wasted time, unpaid surveys, screened out even after it being suggested for you and VERY low compensation."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Mark Brummel",
          "Nb_Reviews": 4,
          "Date": "2023-08-04T01:00:43.000Z",
          "Titre": "Addictive but disappointing",
          "Contenu": "The amount of commitment for each survey is excessive for the rewards of a few cents. Often a whole survey is completed only to have you screened out at the finalisation of the survey. The site for me is mildly addictive as it has a leaderboard and being competitive I am always attempting all the surveys to further my ranking but these very low ranked surveys either screen you out after a couple of minutes (wasted) or pay so little it has no impact. I am lefty wondering how some members can get upto 4500 points in two days when the average survey is around 50 points."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Hudson",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T15:06:21.000Z",
          "Titre": "Too much wasted time",
          "Contenu": "There is way too much wasted time filling out the same demographic information for each surevy and then being screened out. It would be much more helpful if you took basic demographic information (age, race location, etc) and gave the researchers the ability to apply filters to their research. I spend more time filing out the same demographic information only to find out that I have been screened out of a survey. Also a short description of what the survey was about would help me make a decision as to whether I wanted to spend time on it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ted",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T00:16:50.000Z",
          "Titre": "ARE THESE ASNWERS THEY WANT TO HEAR OR WHAT IS REAL FEELINGS",
          "Contenu": "I GUESS YOU USE AI. SOMETIMES YOUR QUESTIONS ARE NOT VERY CLEAR WHICH MAKES MY ANSWERS SEEM WRONG. I READ EVERY QUESTION AND ANSWER TO THE BEST OF MY ABBILTY BUT YOU THINK THEY ARE WRONG. I AM STARTING THE SURVEYS ONLY WANT THE ANSWERS ONLY FIT THIER PROFILE, NOT MY REAL FEELINGS."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Sveta5",
          "Nb_Reviews": 3,
          "Date": "2023-05-30T16:49:45.000Z",
          "Titre": "Blocked for two weeks",
          "Contenu": "I started with the first reward and I consistently earned more points every day, both towards reward card and for Weekly Streak. On May 14, my access was suddenlty restricted on the basis that PrimeOp received too many complaints on the quality of my responses. Without further explanation, I was restricted for 2 weeks from doing surveys, and my progress for Weekly Streak was lost. No details of my perceived 'low' quality responses were given. On May 28, 2023, my access was restored, also without explanation or warning. I will keep doing surveys, but if more problems arise, I plan to escalate my reviewing to the higher level at the organization."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stickydude",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T03:43:18.000Z",
          "Titre": "Bonuses are bogus",
          "Contenu": "Two weeks in a row right before I was supposed to get a bonus for doing a survey 7 days in a row I mysteriously have no surveys available."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kathy M",
          "Nb_Reviews": 2,
          "Date": "2023-10-08T22:41:12.000Z",
          "Titre": "I cannot redeem my rewards",
          "Contenu": "I cannot redeem my rewards. I go through the redemption phase. It tells me an email will be sent and I never received the email. Trying to do an ACH reward. I contacted Health. They did give me a link where I was able to enter in my information and the money is on the way to my bank account. I tried claiming a reward again, and I still did not get an email with that link in it. I haven’t heard back from help. in two days.I received every other email just not the one to clean my reward"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DH",
          "Nb_Reviews": 3,
          "Date": "2023-10-27T23:43:25.000Z",
          "Titre": "Intelligent and interesting surveys…",
          "Contenu": "Intelligent and interesting surveys available at all times, with little redundancy in questions asked within the survey.After a few weeks on this site, I have learned that it is simply another \"also-ran\" with poor payouts and very obvious exclusion factors in completing surveys. Save yourself any expectations of fairness or opportunity, because there are none."
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "Anthony O FLANAGAN",
          "Nb_Reviews": 6,
          "Date": "2023-11-29T17:25:50.000Z",
          "Titre": "finding im been screened out…",
          "Contenu": "finding im been screened out unnecessarily for some reason found this site useful but i feel im been targeted by the surveyor and wish this did not happen as i thought it was useful but loads of surveys are been screened out unfairly but hope this will change as the site would become difficult to use but the surveys are becoming more frequently since my review but I just want fairness in the survey s"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Santos",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T20:56:15.000Z",
          "Titre": "Not what always meets the eye.",
          "Contenu": "There are too many qualification requirements and sometimes completed surveys that don't pay out properly or longer than described."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Otuche Apochi",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T15:32:42.000Z",
          "Titre": "I  cashed in after getting enough point…",
          "Contenu": "I  cashed in after getting enough point for £5 it’s but I still haven’t received cant money on my PayPal and points have been deducted"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Gary",
          "Nb_Reviews": 4,
          "Date": "2023-09-21T19:38:30.000Z",
          "Titre": "EXCHANGE RATES",
          "Contenu": "This site needs to up date the exchange rates between $$ and ££ more often, My points total shows I'm over my £20 target in value, but the points still shows i'm about 100 points short .. It can't be both that's not rite ..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ighofose Seth",
          "Nb_Reviews": 2,
          "Date": "2023-10-07T16:57:20.000Z",
          "Titre": "Very bad",
          "Contenu": "Very bad, it just stopped allowing me qualify and now I got screened out for all surveys, now no more surveys and no compensation."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Eliza",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T04:02:32.000Z",
          "Titre": "1 in 5 surveys actually work the rest…",
          "Contenu": "1 in 5 surveys actually work the rest screen you out"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T15:11:51.000Z",
          "Titre": "to many throw you out and several late…",
          "Contenu": "to many throw you out and several late in the survey, I don’t enjoy answering questions for 10 minutes just to see I don’t qualify"
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-02T16:28:08.000Z",
          "Titre": "I have not been getting any surveys…",
          "Contenu": "I have not been getting any surveys even after I was told that I was unblocked and the chat operators don't help with anything."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "judy",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T01:37:37.000Z",
          "Titre": "it was good when i first started doing…",
          "Contenu": "it was good when i first started doing surveys, and now i get hardly any surveys, it screens me out before i get to answer any questions, and i have been doing the surveys honestly"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T10:01:12.000Z",
          "Titre": "At first",
          "Contenu": "At first, the surveys were a decent amount of points for the time allotted. Now it's too little points for too much time. Almost not worth the effort."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kathy",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T01:49:55.000Z",
          "Titre": "Let me qualify for more surveys",
          "Contenu": "Let me qualify for more surveys, it's crazy how many I clicked on just to not qualify for them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Vanessa Wright",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T09:19:02.000Z",
          "Titre": "The site is ok but way too many surveys…",
          "Contenu": "The site is ok but way too many surveys either don't pay or kick you out completely."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T04:08:10.000Z",
          "Titre": "One of the best survey sites but needs…",
          "Contenu": "One of the best survey sites but needs more surveys.customer support staff are great very helpful"
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "Jarmila Trstanova",
          "Nb_Reviews": 13,
          "Date": "2023-08-01T05:48:29.000Z",
          "Titre": "Bad surveys",
          "Contenu": "Surveys often crash without even loading. I have tried variety of different browsers yet no improvement."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Rajat",
          "Nb_Reviews": 8,
          "Date": "2023-08-16T09:02:50.000Z",
          "Titre": "Completed 1 hour survey only to see SCREENOUT and no help from Customer support",
          "Contenu": "This site has a good UI and Engaging activity for their panelist. But they do not a customer support Via Email. And the Chatbot do not even read the message. It feels like they just ignore me.Edit:If I share Screenshots, then no reply from themMy Survey was of 198 points and i only got 4 points saying \"screenout\". Someday  later they compensate me with 30 points and not ready to see the screenshots.I mean if its 60-70 points than 30 is reasonable but.... Also if survey take 10-15 min. It took one hourFirst of all, they say it was of 15 min and when i checked the clock after completing, one hour has passed. The Next was message mention as above.Not first time this type of SCREENOUT has happened. Its 4th time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 3,
          "Date": "2023-08-31T21:40:34.000Z",
          "Titre": "I would like an email address to speak…",
          "Contenu": "I would like an email address to speak to whomever is in charge of this site. I did absolutely NOTHING wrong here today, except to back out of 2-3 surveys that had no option to hit none. Then my account gets banned or should I say, there are no surveys at the moment, are you kidding me right now!?  I am NOT a happy member right now. I will go to a site ,who appreciates my time. And one of their team members and was told my account is fine, well if that is the case.......WHY  is there not even 1 survey there and why is it say this.No surveys at the momentUnfortunately currently there are no surveys Please come back later! ? Makes no sense to me. If this is fixed, I will rethink my review, but until then, this is how I feel about this site.UPDATE : I appreciate your response and hope there is no further problems, because I rather liked the site upon finding it recently. Thank you! Your response is much appreciated.Thank you for making things right with me. I was so upset after that had happened to me. Have a great night and I hope the kinks get worked out."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Shiladitta Biswas",
          "Nb_Reviews": 3,
          "Date": "2023-10-18T19:17:34.000Z",
          "Titre": "Not satisfied",
          "Contenu": "Most surveys get terminated for no proper reason. Frequency of surveys has reduced drastically"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T02:53:12.000Z",
          "Titre": "Never let me do surveys",
          "Contenu": "Never let me do surveys, always kick me out when I’m not even starting. And if I finish them, there’s no points"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T01:36:56.000Z",
          "Titre": "I did not received confirmation email…",
          "Contenu": "I did not received confirmation email about my redeemed $5 to cash directly to my bank account from completed surveys."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Hippie",
          "Nb_Reviews": 12,
          "Date": "2023-10-03T20:37:19.000Z",
          "Titre": "Sad that my 34 day streak was ruined…",
          "Contenu": "Sad that my 34 day streak was ruined because there were no surveys available"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T06:20:33.000Z",
          "Titre": "When I get rewards",
          "Contenu": "When I get rewards, I have to email two or three times befroe I receive them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pinky DeSola",
          "Nb_Reviews": 3,
          "Date": "2023-06-03T17:13:34.000Z",
          "Titre": "Was great until...",
          "Contenu": "I initially liked this site. I made $10 on my first day and Cash out was quick and easy. Now every time I get on the site the surveys will never load. I've tried everything to fix it and still nothing. Very disappointing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "mercury52",
          "Nb_Reviews": 6,
          "Date": "2023-08-02T13:16:02.000Z",
          "Titre": "Get rejected for too many surveys…",
          "Contenu": "Get rejected for too many surveys before I get one i can finish and get points.  Wastes too much time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer...bruh",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T19:07:02.000Z",
          "Titre": "Prime Opinion: From Promising to Problematic",
          "Contenu": "Prime Opinion initially presented itself as a promising platform for earning rewards through online surveys. The platform boasted a diverse range of surveys, a straightforward payout system, and a user-friendly interface. However, recent experiences have revealed a decline in the quality and productivity of the surveys offered.Screening Out and DisqualificationsOne of the most frustrating aspects of Prime Opinion is the high frequency of screening out and disqualifications. Users often invest time in completing surveys, only to be disqualified at the end, receiving no compensation for their efforts. This occurs even after completing qualifying questions and providing accurate information.Painful and Time-Consuming SurveysThe quality of surveys has also deteriorated significantly. Many surveys are poorly designed, repetitive, and unnecessarily lengthy. They often ask redundant questions and provide confusing instructions, leading to frustration and wasted time. The excessive length of some surveys makes them feel like a chore rather than a rewarding experience.Declining RewardsThe rewards offered for completing surveys have also become measly. The compensation no longer reflects the time and effort invested in these surveys. The payout thresholds have increased, making it more difficult to redeem rewards.ConclusionPrime Opinion has unfortunately fallen short of its initial promise. The frequent screening out, poorly designed surveys, and meager rewards have turned a once-productive platform into a frustrating and disappointing experience. Users are advised to seek alternative survey platforms that offer better compensation and a more worthwhile experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 2,
          "Date": "2023-08-25T00:48:01.000Z",
          "Titre": "I don't get approved for a lot of surveys",
          "Contenu": "I don't get approved for alot of surveys and it is frustrating"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-05-22T08:55:32.000Z",
          "Titre": "Alot of surveys don't pay out and for t…",
          "Contenu": "Alot of surveys don't pay out and for t amount of time spent. The compensation is not worth it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T23:45:59.000Z",
          "Titre": "I never qualify for full surveys"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "wilma",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T11:54:00.000Z",
          "Titre": "Unethical researchers abound and Prime Opinion sets no limits to protect both researcher AND participant",
          "Contenu": "This company does NOT hold their researchers to any standards.  Studies say they'll take 15-minutes, they take 30-minutes or longer and then the study can screen you out up until the last question.  This has happened to me multiple times, it is not a rarity like the company would have you believe and at least twice, I thought the screen was changing because the study was finished and I was getting paid, but instead, they screened me out after the study was finished and paid me 3-cents for 29-minutes of my time.  I'm all for companies setting a certain criteria to be met for their research, but it should be in a reasonable amount of time ie 5-minutes to find out if you're what they're looking for.  Not after you answer all their screening questions, complete their studies and then screen you out right at the end.  And EVERY study will take at least 2-3X what the study says.  And a lot of studies will screen you out, which is fair enough, but they take way too long for it and most pay nothing when they screen you out, not even 3 or 4 cents.  You never know until you're paid that you're actually going to get paid for the time you put in.  I've only been on Prime Opinion 9-days and this is my experience.  The rate per hour on Prime Opinion is dismal and you have to be desperate for every penny to make this worth your time.Until Prime Opinion sets some ethical standards for their researchers, this will be an exercise in frustration for all.  Other survey sites have standards for the researchers to follow, so they can't just set out to take advantage of you, it's clear Prime Opinion has not done that and does not seem to want to do that in the future.  It's just commonsense that they should try to protect both sides, but they don't seem to care about the participants getting screwed by unethical researchers and to my knowledge even when you're screened out the researcher can still use your data.If you're going to get paid, they pay promptly, but you never know until the end if that's the case.Update:  Response to Prime OpinionI have done a lot of surveys on Prime Opinion, screening you out is not unusual and I don't have a problem with that if I don't fit the demographic, HOWEVER, the researchers are asking you the demographic questions, then letting you start or complete a survey for anywhere up to in my case 29-minutes was the longest and then screen you out after the last question and Prime Opinion allows this, because I did complain and on this occasion was told that the researchers can screen you out at anytime.  They should not be allowed to just waste your time.  They should ask any questions that may eliminate you upfront and not have you complete most of a study before screening you out.  Just tonight I spent 20-minutes or more on a study that was only suppose to take 10-minutes (all studies are 2-3X the estimate) and in that 20-minutes I had completed 70% of a study and was screened out.The fact that Prime Opinion replied the way you did trying to give the impression that screening out is a reasonable part of the business and doesn't happen that often, shows you will never do anything or set standards to improve the situation of abuse by the researchers.  I have acknowledged multiple times that screening out is reasonable as long as it's ALSO done in a REASONABLE amount of time, allowing you to complete 70-100% of a study before screening you out is NOT reasonable.  Even screening you out 10% into a survey is not reasonable.  Screening questions should be asked prior to starting the study.  I even got screened out of a study yesterday that said I qualified after the so-called demographic questions etc and then it said that \"there are no correct answers, we just want your opinion\" and I was still screened out after completing a decent amount of the study, clearly there were correct answers.  Screening questions should not include the survey itself, screening questions should be asked prior to the survey.It is clear that Prime Opinion does not intend to set standards making researchers ask all \"elimination questions\" upfront and in a reasonable amount of time, taking 20-30 minutes to screen you out is NOT reasonable, it's abusive."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T09:09:31.000Z",
          "Titre": "They say a survey takes 10 minutes and…",
          "Contenu": "They say a survey takes 10 minutes and they really take 30 minutes to complete"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T03:40:54.000Z",
          "Titre": "Too much screen out",
          "Contenu": "Too much screen out. Pls that should be reduced."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Tim",
          "Nb_Reviews": 5,
          "Date": "2023-08-16T18:21:16.000Z",
          "Titre": "Stopped giving me any surveys"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T00:57:59.000Z",
          "Titre": "Too many surveys fail."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dennis Bajgrowicz",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T03:14:20.000Z",
          "Titre": "most surveys will not let you enter"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T20:03:08.000Z",
          "Titre": "low pay out then others"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T17:43:27.000Z",
          "Titre": "I only gave this middle rating because…",
          "Contenu": "I only gave this middle rating because your company should do more to make sure I actually receive points upon completing a survey.  On two occasions, I completed a survey and then there was a glitch and I was back to selecting surveys.  Not fair.  Also, when determining if a survey is appropriate, I should either get more points than \"one\" when I have at time spent more than five minutes working through a survey before it either drops me, or tells me that I am not suited to this or that survey.  Also... I get frustrated when the approximate duration of time to take a survey is presented, and in actuality it takes 10-15 minutes more than presented."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stella",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T04:06:47.000Z",
          "Titre": "Likes and dislikes",
          "Contenu": "I like that there are many surveys to choose form. I like short surveys less than 10 min.I don't like when I answer questions only to be told I didn't qualify and some surveys say 6 min, nut ends up 16 min."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CGH",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T23:48:27.000Z",
          "Titre": "Way too many surveys where I spend…",
          "Contenu": "Way too many surveys where I spend 10-15 minutes of information only for it to be cut off & I only get 1 or 2 points credit."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:55:08.000Z",
          "Titre": "I was enjoying the experience until the…",
          "Contenu": "I was enjoying the experience until the last couple of days it started kicking me out of some of the surveys.  A couple of them just as I completed them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T17:40:55.000Z",
          "Titre": "Compensation needs to be improved upon",
          "Contenu": "I dislike how you can go halfway or more through a survey and it either times you out or disqualifies you and don't even receive a third of the points that are owed to you when survey is completed. I also dislike that the best matched surveys are majority of the time not best matched. I think that we should be compensated better for the time it takes to go through each survey and for when a survey times out or your disqualified after reaching the halfway point."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "I B",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T17:51:12.000Z",
          "Titre": "I dislike surveys of a length of 30…",
          "Contenu": "I dislike surveys of a length of 30 minutes (and more) and then I get 9 points. That's not real to get only 5 cents. I dislike to start to answer this and this and that and then to learn I had already done the survey. Why don't these not disappear? Sometimes I have the impression that a survey is several times in the list. I like to earn sometimes some points supplementary (but don't understand the system)."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "joyce Yurek",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T19:43:17.000Z",
          "Titre": "It's not that I disliked the overall…",
          "Contenu": "It's not that I disliked the overall surveys. Out of 10 I tried for yesterday I only was excepted for 2.  So that is very frustrating I spent over 11/2 trying to complete it.  I also have been doing these surveys every day since I signed up and only one time was I able to try for the prize. Just a bit frustrated."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T15:25:53.000Z",
          "Titre": "An increase on survey issues has…",
          "Contenu": "An increase on survey issues has increased. Sometimes it happens towards the end of the survey which can be frustrating"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Sean",
          "Nb_Reviews": 33,
          "Date": "2023-12-11T23:59:43.000Z",
          "Titre": "No way to complain about surveys not giving points",
          "Contenu": "Pays, but it’s incredibly frustrating. Twice this week I’ve wasted my time completing surveys that then freeze and don’t give points - & there’s nowhere to complain and get the issue reviewed. For this most annoying aspect, Branded Surveys and ipsos remain more professional and user-friendly. Completing a survey that takes 20 minutes and getting absolutely NOTHING for it is beyond annoying."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Sandra Broneske",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T10:12:13.000Z",
          "Titre": "Most of the best match surveys do not…",
          "Contenu": "Most of the best match surveys do not work mostly if location is London or 1 or points are differ"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas C",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T07:12:37.000Z",
          "Titre": "Survey rejection.",
          "Contenu": "Most of the surveys reject my participation.   Most of your listed estimated times are wrong."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nykea",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T04:41:38.000Z",
          "Titre": "I like when I start a survey and I…p",
          "Contenu": "I like when I start a survey and I qualify. Also when start doing a survey I get so far and I don't qualify that what I don't like."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dan K",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T18:15:20.000Z",
          "Titre": "Some good, some bad",
          "Contenu": "You can definitely make money doing this and they offer good perks but it's hard to get qualified for surveys and it seems the more surveys you do, the less you are qualified for. All that being said, I do feel it's the best survey sight I have experienced"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Karen Archer",
          "Nb_Reviews": 4,
          "Date": "2023-12-06T21:41:50.000Z",
          "Titre": "Great survey site not had any problems…",
          "Contenu": "Great survey site not had any problems at all.Sometimes you don't qualify which is a bit frustrating but just keep plodding on. It does take a lot of surveys to get your rewards but overall no complaints so far."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Prime opinion leaver",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T22:49:21.000Z",
          "Titre": "Gone downhill",
          "Contenu": "Used to be good but there are way too many screenouts even when selecting the best match surveys. Wasting my time know trying to answer anything especially since the payout per survey is so low."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T02:22:57.000Z",
          "Titre": "Always screening me out when I get half way through  and the most points survey never work at all inlets you agree to cut your web camera on and that's not fair of the survey says 223 point for 5min",
          "Contenu": "What I don't like is that the survey with the most point always screening  me out after I get half way through and then they have survey that be for 265 for 5 minutes and it never works but overall it a good app just have to do better with the survey exactly finished"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Zon",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T00:53:29.000Z",
          "Titre": "Cut off mid survey often.",
          "Contenu": "I like it but there have been multiple surveys that are not interested and give you 1 point when you are already halfway through the study."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maurice Allen-Cambridge",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T05:48:37.000Z",
          "Titre": "Prime Opinion Is A Great Company",
          "Contenu": "Prime Opinion Is A Great Company! There Are A Few Minor Problems. Example, Sometimes I Get Disqualified Out Either, Before The Survey Starts, Or After The First Question, Or Either In The Middle Of The Survey. But, The Company Does Do Great With Getting The Points Correct. And The Pay Outs Are Excellent!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joshua Greer Sr",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T03:15:57.000Z",
          "Titre": "I don't like getting bumped off with…",
          "Contenu": "I don't like getting bumped off with pennies. I don't like not getting accepted for surveys. I don't like the IT stuff. I do like the pay. Or getting paid immediately."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Skip Shaffer",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T02:28:51.000Z",
          "Titre": "Nice but repetitive!",
          "Contenu": "Being asked for nearly every survey month, year and zip code is a pita. Save the info and use it to find accurate fits."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "DIN",
          "Nb_Reviews": 8,
          "Date": "2023-12-12T17:36:27.000Z",
          "Titre": "getting enough surveys but some of them…",
          "Contenu": "getting enough surveys but some of them not opening or asking too much personnel information and hence not able to collect rewards as like to"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T18:10:09.000Z",
          "Titre": "It’s a little upsetting..",
          "Contenu": "It’s a little upsetting..I don’t like when you open the survey and it automatically tells you.. it doesn’t work and it goes right back to the main page. I don’t like when you have to wait for hours to get surveys, if you do get one it automatically disappears or it’s filled already."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph Kingsman",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T06:43:59.000Z",
          "Titre": "Surveys",
          "Contenu": "as with many survey sites, there are many surveys that cheat the user out of the promised reward due to glitching and other technical issues"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pretty Happy Customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T02:49:30.000Z",
          "Titre": "Have enjoyed using Prime Opinion",
          "Contenu": "Prime Opinion.  Do wish some surveys wouldn't have you spend so much time answering questions before they disqualify you.  It's been really frustrating to think you are going to be rewarded for your time just to be kicked out with no reward."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Lauren",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T14:17:49.000Z",
          "Titre": "Legit way to make money, but takes a lot of your time",
          "Contenu": "This is a great way to make some extra money, but I don’t like how stingy they are with points, esp for the surveys that take 20+ mins.. I’d like to see an increase in points for longer surveys. I seem to get screened out of the surveys that earn you higher points, which is very frustrating. I’ve come across several surveys I’ve done previously, and it’s wasted my time. I’d like to see that issue sorted as well"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stan Mlynarski",
          "Nb_Reviews": 20,
          "Date": "2023-12-12T15:42:26.000Z",
          "Titre": "Newbie Surveys",
          "Contenu": "Its unfair to rate surveys based on a \"handful\" versus the hundred's I have taken thru 15-30 other companies I'd appreciate getting this survey once I attain enough oints to be redeemed and see how  well the system performs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "VJ",
          "Nb_Reviews": 11,
          "Date": "2023-12-09T19:05:36.000Z",
          "Titre": "Was Good For Awhile",
          "Contenu": "I was doing good with nice survey times and payouts. Then after I cashed out after the first time the survey times and payouts wasn't very great. I still do one or two a day. I wish surveys were like when I first signed up."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T02:42:42.000Z",
          "Titre": "There are too many time you finish a…",
          "Contenu": "There are too many time you finish a survey then you get screened out and get no points."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Elisa",
          "Nb_Reviews": 5,
          "Date": "2023-12-19T13:34:53.000Z",
          "Titre": "A lot of enquetes are not for me,so I…",
          "Contenu": "A lot of enquetes are not for me,so I waist a lot of time for little points"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JVinz",
          "Nb_Reviews": 7,
          "Date": "2023-11-18T02:25:01.000Z",
          "Titre": "Typical Survey Site",
          "Contenu": "I was all prepared to give a five star review after the first two days.  I made $15 almost effortlessly and I was thinking I'd finally found a survey site that pays relatively well and is straightforward. However, after that initial $15 things took a pretty serious downward turn.  Almost all of the surveys now disqualify me and pays me one or two cents as a consolation instead of the promised amount which is much more.  Like many others, Prime Opinion seems to be a site that makes you think they're different from the rest in the beginning but just turns out to be as confounding in the end.  Wouldn't it be great if a survey site came along who was as good as they appeared to be during the initial two days?  I'm still waiting."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rare",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T17:35:55.000Z",
          "Titre": "Survey price",
          "Contenu": "Yo so i previously rated the website 5/5 and yeah it was but now adays i don't know what happened but i havent gotten a survey worth more then 50 points in 2 weeks and ive asked the staff they all say the same thing. If they fix that then thatd be amazing 5/5 again."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T23:41:27.000Z",
          "Titre": "It’s not bad but it’s not good…",
          "Contenu": "It’s not bad but it’s not good especially when you do a survey and you get to the end but you get timed out and don’t get the points?"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "caromihd",
          "Nb_Reviews": 4,
          "Date": "2023-12-06T19:24:37.000Z",
          "Titre": "I dislike the fact that while doing the…",
          "Contenu": "I dislike the fact that while doing the survey it stops and rejects my survey it says safari cant open the page and so prevents me from continuing my survey to have point at all which seems unfair"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Baz Smith",
          "Nb_Reviews": 7,
          "Date": "2023-12-08T21:39:12.000Z",
          "Titre": "Screened out of FAR to many surveys",
          "Contenu": "Screened out of FAR to many surveys, several have NOT paid out at end of completed surveys!"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T16:39:54.000Z",
          "Titre": "Error message when trying to redeem…",
          "Contenu": "Error message when trying to redeem gift card, customer service is apparently not reading my support email because they are offering \"advice\" that is not applicable. Also, too many surveys screen you out."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Faye",
          "Nb_Reviews": 3,
          "Date": "2023-11-17T06:13:28.000Z",
          "Titre": "Mostly good, could be better",
          "Contenu": "Mostly good, but sometimes after spending quite a bit of time doing a questionnaire, it drops out and you get No points or credit for the time you’ve put in. Today I had nearly finished a long one on insurances, when it disappeared."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T03:45:44.000Z",
          "Titre": "Variety of interesting tipics BUT",
          "Contenu": "Variety of interesting tipics BUT too many screened out surveys both before and after completion.Not sufficient high value reward value points.Helpful live chat helpline with live agent. Prompt response to queries."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Tony Dunn",
          "Nb_Reviews": 36,
          "Date": "2023-11-15T08:37:12.000Z",
          "Titre": "good but not great",
          "Contenu": "I completed some low 10-20 point surveys today and they were not long at all which is great. The higher-point surveys tend to have too many silly qualifying questions & are too long for less than $1 but at least they tell you the length beforehand. You do get extra points when you get to another level by completing surveys several days in a row. My 1st payout was 6 weeks ago but haven't done surveys every day"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lori Cronin",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T04:26:15.000Z",
          "Titre": "Health insurance companies",
          "Contenu": "This last survey i did, I didn’t like much. It was about different health insurance or health insurances, & I didn’t no about a lot of them so I did the best I could. It also seemed like it took forever & could not wait until the survey was finished. I couldn’t even remember how many points I was going to get. So I was finished that I was only getting 26 points."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T07:03:26.000Z",
          "Titre": "I like them",
          "Contenu": "I like them. I don't know if it's my age or location but it's difficult to qualify for surveys. I would like to take more surveys than I am able to."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ABG",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T03:33:16.000Z",
          "Titre": "The mobile app is awful",
          "Contenu": "The mobile app is awful. Too often it will freeze at the very end of a survey and you will have wasted your time because you won't get credit for it. It does pay better than other survey sites, but not by much. I will continue to use the desktop site but the mobile glitches really need to be fixed because it's robbing people of their valuable time and effort."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T17:48:48.000Z",
          "Titre": "Knowledge and experiences",
          "Contenu": "We can find aranges of surveys that fits us in one of them and share our thoughts for better results for those who needs it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T20:46:52.000Z",
          "Titre": "I love having the opportunity to do…",
          "Contenu": "I love having the opportunity to do surveys online.  1 suggestion would be to categorize them.  There are some that I love doing and others not so much. If I knew it was about food, shopping, animals, tv shows or politics, I would love to do them.  I do not like when I pull up webcam ones or ones about cars.  I hate when I literally complete 98% of a survey, literally 20-30 minutes, and it says that they disqualified you.  That is not fair.  You should get the points if you put in the time.  I have also had many cases were the screen freezes up when I am well into a survey and I am out the points again."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T18:37:14.000Z",
          "Titre": "We have to fill out so many surveys…",
          "Contenu": "We have to fill out so many surveys just to make $25. Surveys are easy and straightforward though."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mr Stephen Roberts",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T16:44:47.000Z",
          "Titre": "TIME vs REWARD",
          "Contenu": "Dislike; 1) Surveys often take much longer than you state and 8 points is poor return for 15 minutes for instance2) Respondee is not suited to approx 40% of surveys, despite having completed profile with youLike:General layout of surveys available"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DH",
          "Nb_Reviews": 3,
          "Date": "2023-10-30T00:43:15.000Z",
          "Titre": "Make just a little $",
          "Contenu": "It is good for making just a little extra money. Be prepared for a lot of surveys that kick you out because of the following:Unfortunately the advertiser screened you out.We still compensated you for your efforts.Your Reward1 PointsThis often happens after spending time entering information."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "JesusBayangos",
          "Nb_Reviews": 5,
          "Date": "2023-11-04T17:14:54.000Z",
          "Titre": "To be honest",
          "Contenu": "To be honest , kind and polite i will give this one a 3 stars because. So many surveys too much stack , repeating questions , many times no english language. In the beginning they bring you a good rewards but after that i got that rewards no more decent surveys as of now. I think for improvements do not put dummy surveys. Put only the legit surveys that you can earnings rewards for sure."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Timothy",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T16:03:25.000Z",
          "Titre": "So-So",
          "Contenu": "Because I am retired, I have time to do surveys on this site.  I have done them elsewhere in the past.  Like all the survey sites I have experienced, it is necessary to spend many hours to obtain much cash, although this site is far from the worst in this regard.  Cons:  I have gone through a significant portion of a survey only to be told after some minutes that I have been weeded out.  Sometimes, I think there are actually two surveys in one, and after getting my responses on the first -- without compensation -- I am told that I don't qualify for the one that pays."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gina Q",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T07:55:44.000Z",
          "Titre": "I am giving a three out of five rating.",
          "Contenu": "I am giving a three out of five rating. I am sorry that I cannot give more than a three out of five because there are times when I finish the survey and submit and I do not get the points that I have earned. I do enjoy doing surveys and giving my opinions and many of their surveys are actually really interesting and stimulate thought I always take time to give careful thought out answers and it's disappointing when I take time to do a survey submit it and then not awarded the points that I expect to see. I still will recommend this program to others."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Liz Minnick",
          "Nb_Reviews": 3,
          "Date": "2023-11-13T01:38:45.000Z",
          "Titre": "Too many screenouts",
          "Contenu": "Too many screenouts. Too many times doing a lot of questions to have survey lock up or disqualify late.  I was just on a survey finishing q29 and got a 500 server error. Had to tap out of survey to go any farther and it shows 0 min..??"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Themba",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T16:28:45.000Z",
          "Titre": "Too many screenouts especially on the…",
          "Contenu": "Too many screenouts especially on the high points surveys. Its like its deliberately done. I have never been able to complete a survey with more than 100 points ever. I stopped even trying those because they will screen you out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 7,
          "Date": "2023-12-01T23:04:10.000Z",
          "Titre": "I enjoy doing these but I get blocked after finishing them..",
          "Contenu": "I enjoy doing these but I get blocked out after I finish them sometimes. That is a waste of my time. I'm not working for free. Please fix this. I like doing these but if it continues I will quit. Oh and I am disabled so I can do a lot of these."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carilyn",
          "Nb_Reviews": 5,
          "Date": "2023-11-02T06:47:44.000Z",
          "Titre": "There are lots of surveys",
          "Contenu": "There are lots of surveys, but lots result in nothing. I dislike the \"cat\" surveys because they only ask about politics or they ask all the same questions about politics. When I see the cat come up, I simply leave the survey.Points accumulate fairly quickly."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Inge",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T21:17:56.000Z",
          "Titre": "Good platform to join Market Research",
          "Contenu": "Good platform to join Market Research interviews digital to several topics. With every finished interview you collect points to be changed for gift cards.Very good is that the points also can be loaded on your PayPal account, as well now and then you get bonus points. Usually the UX and the system works fine. In case of technical problems, you get help."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "harold smith",
          "Nb_Reviews": 16,
          "Date": "2023-10-25T11:56:16.000Z",
          "Titre": "Started off really good and got my…",
          "Contenu": "Started off really good and got my rewards with no problems.Just over a week ago i had enough points for a Marks and Spencer £20 voucher,i ordered and still not received it,even though it says it has been completed.No customer service address for the UK,so i emailed the USA,got no answer.Today i had enough for a £5 Marks and Spencer voucher,ordered,it said its on the way and can take upto 30 Minutes,1 Hour later nothing.My application to join the facebook page has been in for a week and still shows pending,Just wonder if something had gone wrong at the UK branch"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Louise Brady",
          "Nb_Reviews": 7,
          "Date": "2023-11-01T03:16:37.000Z",
          "Titre": "Lots of surveys but hard to qualify!",
          "Contenu": "This site has lots of surveys but it is so frustrating because I don't qualify for very many of them. I do like the payouts, how quickly you receive the gift card but it takes a lot longer to get your points. It would just be so much better if I qualified for more of the surveys so I could reach the payout quicker. Over and over and over I'm told I do not qualify."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Terry Purcell",
          "Nb_Reviews": 5,
          "Date": "2023-09-27T16:03:02.000Z",
          "Titre": "Fairly average",
          "Contenu": "Fairly average. The supposedly favourable surveys are NO different to the unmarked ones. One can attempt 10 marked and 10 unmarked and probably answer more of the unmarked ones. The rewards are all over the place with no consistency. Low rewards for time consumers (many), high rewards for short (few). Some extra benefits include the weekly run (IF you are lucky enough to get answerable surveys) and the increasing level bonuses."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bella",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T20:01:55.000Z",
          "Titre": "Ups and Downs",
          "Contenu": "Some surveys are decent, and provide a reasonable rate ( I usually don't take any task that doesn't pay at least 0.12 a minute). Then, there are surveys that I've spent twenty minutes completing, and then I am screened out. After 20 minutes. And I am granted 1-4 points to compensate for that wasted 20 minutes.That said, despite the constant late screen-outs, I've earned decent money. One or two hours a day has given me at least $35 a week."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 6,
          "Date": "2023-11-12T04:10:28.000Z",
          "Titre": "A lot of time with little or no pay",
          "Contenu": "I like the fact that they pay you in cash.  At times I have spent over a hour trying to qualify for their surveys with no luck.  They could definitely improve their website by paying you more considering all the time it takes you to fill out one of there surveys.  Time is precious, please pay us fairly for our time and trouble.  Thank You."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bud Kelly",
          "Nb_Reviews": 9,
          "Date": "2023-10-03T20:05:11.000Z",
          "Titre": "Started better",
          "Contenu": "Initially there were a lot of surveys to complete.  Now, although there are many on the page, I don't qualify for most of them, so you go minutes into each one, adding the same information again and again, the get kicked out.  I do not understand why their technology can't eliminate the ones they know I am too old for or too male or too white or too married or whatever.   Also, there are many times that fewer points than promised are given for the survey; but it's not worth arguing with them for 40 cents or whatever."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Tuvijat Joshi",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T03:21:35.000Z",
          "Titre": "Not a very much Good experience as I…",
          "Contenu": "Not a very much Good experience as I didn't get any high points survey since more than 30 days and even customer service doesn't respond to our tickets/complaints.Very much frustrating experience here.If you are listening sir then please update.Thanks..Tuvi..Thanks for updating sir,But since past 2 days no survey were available to my account.Pl review and resolve..Regards,Tuvi"
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T23:45:13.000Z",
          "Titre": "I like prime alot ...",
          "Contenu": "I like prime alot ...but some days they have no doable surveys... other days there are very little  surveys to do"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Glen",
          "Nb_Reviews": 8,
          "Date": "2023-10-07T01:06:37.000Z",
          "Titre": "It's an ok site and has some good rewards",
          "Contenu": "It's an ok site and has some good rewards but like many of these has far too many surveys that either dont work or you spend 5 minuets filling out the survey only to get kicked out or not receive the reward. Sometimes you can spend an hour and get nothing. But on the good side has a quick redemption method starting at $5."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Vipul",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T05:44:31.000Z",
          "Titre": "Nice survey experience on Prime",
          "Contenu": "It has been really good survey giving experience on this platform with humble customer service and easy to redeem your rewards.However higher points survey were lagging need more and 100 points should be equal or more than $2 then it would be much better choice than other providers..Please provide high frequency of survey in our country with High points which are missing here.. 7 days survey streak were not possible as no survey available on Sunday either....Thanks Prime opinion...Regards,,Vipul"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Ian",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T09:08:04.000Z",
          "Titre": "It's pretty good for a couple of weeks…",
          "Contenu": "It's pretty good for a couple of weeks then all the points seem to be lower per survey. If you do manage to find a big point survey  it usually fails after a minute . I'll continue to use it as it's better than Curious Cat and YouGov ."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "NightNurse",
          "Nb_Reviews": 9,
          "Date": "2023-10-23T15:10:20.000Z",
          "Titre": "A lot of “broken” surveys and time wasted for nothing.",
          "Contenu": "Started out ok about a month ago. Surveys were good and points were earned. However, now encountering so many broken surveys where points don’t get given. Especially annoying when you’ve spent all the time filling them in and on the last page the survey breaks or times you out when you press finish. Not acceptable!! And a fix is needed. I have now been able to exchange for rewards, but it has taken almost a week to score 100 points due to these broken surveys and wasted an awful lot of time in the process."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Olamide",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T19:08:56.000Z",
          "Titre": "I just opened an account and I’m…",
          "Contenu": "I just opened an account and I’m getting screened out for all the questions and because of that I loose my daily streak so overall this website is not a reliable website"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tanya P",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T10:42:35.000Z",
          "Titre": "What's up with screenouts and freezes?",
          "Contenu": "It's great to get paid for answering some questions, but there's way too many surveys that are either screening me put, or the survey freezes as I'm about to finish and I get nothing"
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T12:14:13.000Z",
          "Titre": "Good Survey site",
          "Contenu": "Good survey site. However, I do find it hard to get 7 day runs and very often get pushed out if a survey near the beginning. It would also be handy to review your survey options as your circumstances change."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Birgit Schuh",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T21:24:33.000Z",
          "Titre": "When I start I like it a lot there were…",
          "Contenu": "When I start I like it a lot there were good surveys and I get paid 4 times but now after that surveys doesn’t work the same surveys most time or they kick u off even u worked in surveys 20 minute! Not fair😓"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2023-11-05T20:05:40.000Z",
          "Titre": "They have some surveys with a fair…",
          "Contenu": "They have some surveys with a fair amount of payout points, but I have never been eligible for any of them.  The rest of the surveys are small to extremely small payout points for the time spent.  I spend a lot of time answering a lot of questions to be disqualified.  I have done a few surveys and didn't get paid at all.  They don't seem to be able to help me with that issue.  Having said that, they are extremely quick to redeem points and I've cashed out 3 times already in about a month.  The cashout minimum seems to be $10.  They also have an immediate bonus amount of points when you spend 7 days total doing at least one survey a day.  They also have bonus points for different levels you reach.  All in all, I like this site and will continue to use it."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T11:44:10.000Z",
          "Titre": "OK but ennoying",
          "Contenu": "Platform is OK and PayPal money transfer very quick. But there are a lot of surveys that take you until the half or nearly end and then just sort you out when you are almost done. That really is enjoying."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Ronaldinho",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T10:28:08.000Z",
          "Titre": "Too may are broken",
          "Contenu": "I'm very happy with the number of proposed tests. However, too may are either broken or claim that I already did the test (which is often not true)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chuck",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T22:31:03.000Z",
          "Titre": "PO had surveys with great \"ratios\" when…",
          "Contenu": "PO had surveys with great \"ratios\" when I first got on board.  Now, most of those ratios are gone or quickly failed.  PO's greatest virtue is its \"always\" available, vast amount of surveys to pick from.  A great many of the PO surveys are different than Survey Junkie, One Opinion, and/or Swagbucks.  One last negative for PO requires you to accumulate 2500 points for a $20 E-card."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "rewtho",
          "Nb_Reviews": 10,
          "Date": "2023-10-01T15:44:33.000Z",
          "Titre": "Some half decent surveys",
          "Contenu": "Some half decent surveys.  Can achieve simple pay-outs.  Do lose some credits by surveys screening out at the end of surveys, which is frustrating.  Better than many survey sites.Not lucrative"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John T R",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T23:49:21.000Z",
          "Titre": "Repeating data",
          "Contenu": "I don't like having to repeat my birth information and zip code so many times only to get turned down for a survey.  why the duplicates?"
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Juankihr",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T11:39:32.000Z",
          "Titre": "Not bad for moments",
          "Contenu": "I have been doing surveys for 3 weeks and there are surveys that I cant do and for me it's impossible to reach the same points as other people. I dont recieve big surveys and in a lot of them I go in and inmediatly it close."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T00:22:11.000Z",
          "Titre": "You bad about the surveys not allowing…",
          "Contenu": "You bad about the surveys not allowing one earn points but waiting until you complete the survey."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-09-27T04:40:45.000Z",
          "Titre": "Better than others, but...",
          "Contenu": "Its better than the other survey company I was using, but after a couple of small payouts, suddenly its a lot harder to be approved for a survey. Too many are too specific for what they want, but you don't know this in advance. I wish there was a way to screen surveys yourself and see what you qualify for."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T19:55:24.000Z",
          "Titre": "Everything was pretty great until I…",
          "Contenu": "Everything was pretty great until I tried to redeem two Amazon gift cards on the same day and only got the redemption code for one of them. I emailed back and was not able to get a resolution so far."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Barbara",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T17:50:16.000Z",
          "Titre": "problem getting my reward",
          "Contenu": "I like doing the surveys but it seams like half the time when I cash out I have to get help because I don't get my reward sent to my Venmo account."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "William Carter",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T13:45:27.000Z",
          "Titre": "It's okay but I get refused for many…",
          "Contenu": "It's okay but I get refused for many more surveys than I am accepted for, and they don't pay as much as some other companies"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T22:11:01.000Z",
          "Titre": "I am not happy about the redeem points…",
          "Contenu": "I am not happy about the redeem points changes made recently however great website for surveys"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T17:13:34.000Z",
          "Titre": "A lot of the surveys don’t complete or…",
          "Contenu": "A lot of the surveys don’t complete or kick you out. I’ve done multiple surveys to completion and then didn’t get credit. I wish the redeem cash out was lower"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Isaac M.",
          "Nb_Reviews": 8,
          "Date": "2023-09-25T14:27:43.000Z",
          "Titre": "Ok for now but can be improved",
          "Contenu": "For now( a couple months since i registered) Prime opinion is a slightly above average survey aggregator. with good and quick payout thresholds.Like with other Open survey Sites getting through screenings is rather cumbersome. But you Always get 1 Point. It's better than nothing. The overall Dashboard is kept Clean, simple, mobile friendly and being able to sort surveys by time or Points is neat.But sorting it by relevance is barely reliable and the simplicity can be annoying sometimes.For example: I don't own a car but the most relevant surveys are, if i have a certain car brand without any option to state I don't own any of them.Meaning 4 or 5 of these surveys stay on top with no option to opt out.A function to enter common demographic question in my profile to instantly sort those out would be a right step.But for now it works for me even with those gripes i have.Depending on how it develops I'll change my rating."
        },
        {
          "Note": 3,
          "Lieu": "IE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T15:59:02.000Z",
          "Titre": "Generally good but some rare frustrating issues",
          "Contenu": "While the surveys generally work quite well there have been a lot of times where I have almost completed a survey after 25 or 30 minutes and just at the end I get kicked out and only received 1-4 points even though the survey itself was worth up to 100 points. I can understand if are removed from the survey in the first couple of minutes but not after that length of time. It seems to happen during the clarification questions at the end where I am usually just confirming information that was entered previously to qualify for the surevy in the first place."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T16:39:33.000Z",
          "Titre": "A lot of time wasted with surveys that…",
          "Contenu": "A lot of time wasted with surveys that ask a lot of questions and then disqualify you with no points given. Or they disqualify you before even asking any questions at all.I understand that I will be screened out of some surveys as they want certain demographics, but I should not be answering 10 or 15 minutes worth of survey questions on their subject before being told I have been screened out with no points given. Also, I do not see how I am screened out before I answer even one question on some other surveys, and there are a lot like that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Martha",
          "Nb_Reviews": 2,
          "Date": "2023-10-07T00:36:12.000Z",
          "Titre": "What I Like and Dislike About Prime Opinion",
          "Contenu": "I like that it is an easy to use site. I have difficulty finding surveys for which I qualify. It infuriates me when I spend 10-15 minutes or more answering questions and the all of a sudden the pop- up thanks me and says I don’t qualify OR the site freezes and I have to close it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bridget Straub",
          "Nb_Reviews": 2,
          "Date": "2023-11-05T03:16:08.000Z",
          "Titre": "Too often I spend at least 5 minutes…",
          "Contenu": "Too often I spend at least 5 minutes filling out a survey only to have it screen me out. I have also completed one or two that then say they have gathered enough surveys so you get no points."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony Porteous",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T16:26:08.000Z",
          "Titre": "Customer Review",
          "Contenu": "I disliked the fact that at times whilst doing surveys I was screened out for no particular reason. Also some of the questionnaires display false information as it relates to the amount of time they will take to complete."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Dear Mr Smith",
          "Nb_Reviews": 4,
          "Date": "2023-09-30T10:57:20.000Z",
          "Titre": "Quick payouts",
          "Contenu": "Reasonably quick to build points and fast payment. Failed to manage to keep one 'streak' going because no surveys available at the time (could almost do with one held in reserve for this)."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T16:53:05.000Z",
          "Titre": "I am disqualified from too many of the…",
          "Contenu": "I am disqualified from too many of the surveys listed when I logon. Every time I log on, I click on a dozen, or more, surveys and get \"you do not qualify\". I realize my demographic profile disqualifies me from many surveys; it would be nice if they did not appear on my account page."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karen Farmer",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T08:16:40.000Z",
          "Titre": "Most surveys screen me out so they are…",
          "Contenu": "Most surveys screen me out so they are a waste of my time. But I do appreciate that I and get $1 out at a time."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "lcustomer",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T19:36:56.000Z",
          "Titre": "decent",
          "Contenu": "before it was good however it had started to remove me from so many surveys and overall had so many errors with their surveys"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Ben sing",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T08:03:39.000Z",
          "Titre": "Inconsistency with points available",
          "Contenu": "I like that there are many, surveys, and a wide variety of lengths of surveys. Not qualifying regularly is frustrating, but you take the good with the bad. There is an inconsistency with the points available and time taken to do surveys. Also the times displayed can be a bit inaccurate"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Edline P",
          "Nb_Reviews": 5,
          "Date": "2023-10-09T20:17:54.000Z",
          "Titre": "They take too long to give their…",
          "Contenu": "They take too long to give their rewards. I made a second request on September 21sr for 2000 points that they deducted from my account and I have not received any code yet to request my Amazon gift card."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Joe Telford",
          "Nb_Reviews": 23,
          "Date": "2023-10-24T13:28:30.000Z",
          "Titre": "OK-ish",
          "Contenu": "They seem reasonable but you really have to work hard to get points. Interestingly unlike Swagbucks  they do not match 100 points to £1.00.  Also  you can only withdraw Paypal cash  in chunks of £5.00 ( 633 points)"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "darren",
          "Nb_Reviews": 6,
          "Date": "2023-10-20T11:02:23.000Z",
          "Titre": "It's ok for doing a few surveys while…",
          "Contenu": "It's ok for doing a few surveys while having a cup of tea , but the amount you get is not very good , there are better payers out there"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "annek",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T16:01:42.000Z",
          "Titre": "More surveys, less time to load them",
          "Contenu": "The survey questions ought to load faster. It takes a lot of useless time to do these. And then I get screened out more often than not. Why? My age? I buy just like anyone else. Just more particular and I know quality."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marlon Syvette Scoggins",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T15:18:33.000Z",
          "Titre": "I like taking Prime Surveys",
          "Contenu": "I like taking Prime Surveys. I don't like when I am disqualified or blocked and I do not know why? It does not tell me the reason?"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Cath Jeffrey",
          "Nb_Reviews": 14,
          "Date": "2023-12-21T21:47:44.000Z",
          "Titre": "Plenty surveys but a large number turn…",
          "Contenu": "Plenty surveys but a large number turn me down. Some turn down immediately others after completion. However the points can add up fairly quickly."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T01:55:11.000Z",
          "Titre": "The survey choice & variety is good",
          "Contenu": "The survey choice & variety is good. However the points have gone right down to below 100 in all categories now that I have a higher level. That's disappointing considering how much time I have out in over the past week"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Rebeccalou",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T17:14:14.000Z",
          "Titre": "The surveys seemed great for the first…",
          "Contenu": "The surveys seemed great for the first week, when I was successfully completing them, but the second week, it seems harder to be successful. surveys are generally high values and are not too long either. I will continue to see if my completion rate improves."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sheila Gaston",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T20:24:14.000Z",
          "Titre": "I find I qualify for more survey on…",
          "Contenu": "I find I qualify for more survey on Prime Opinion than other survey sites.  Sometimes the surveys are a bit long and I wish I qualified for even more.  I'll keep trying.  thanks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jane Anderson",
          "Nb_Reviews": 5,
          "Date": "2023-12-16T16:24:43.000Z",
          "Titre": "Surveys",
          "Contenu": "Most of the surveys are easy to answer & usually take about 1/2 hr from start to finish.  I do run into some surveys that for whatever reason won't let me select the order of priority by dragging them in the order of my priority."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda Nall",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T09:22:35.000Z",
          "Titre": "Survey Qualification",
          "Contenu": "I qualified for several surveys tonight.  This is better than me spending over an hour trying to qualify to no avail."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "jason",
          "Nb_Reviews": 14,
          "Date": "2023-12-16T14:51:54.000Z",
          "Titre": "I love the idea on making a little…",
          "Contenu": "I love the idea on making a little pocket money, however, there are many surveys that seem to gather substantial information and throw you out with no points. it is very frustrating when you get 90% through with no reward"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Victoria",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:02:59.000Z",
          "Titre": "Very easy way to earn gift cards for my household",
          "Contenu": "Jesus always provides for his people, so never doubt him. Very easy way to earn gift cards for what myself and my daughter want or need. This is one of the best sites I have visited so far that you can earn quickly. The best part I think is how fast (within minutes) you can choose your rewards and have them in your email to spend. That’s amazing especially when you may be in need of something for your household, no waiting, so that’s a plus. Only thing I don’t like is being denied so many surveys or all the ones about alcohol because I don’t drink."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ruby B",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T01:39:42.000Z",
          "Titre": "Easy To Do Surveys",
          "Contenu": "The surveys are easy to understand and the points are applied right away.I would like more surveys that take a little longer and provide more points upon their completion."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T20:00:37.000Z",
          "Titre": "Recently joined",
          "Contenu": "For the past three years I have taken part in other online survey sites and by far Prime Opinion is the best overall experience I have had. I no longer waste my time with other platforms."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donatta Franklin",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T04:02:00.000Z",
          "Titre": "Easy money",
          "Contenu": "Offers plenty of surveys daily. Cashing out is easy. Some surveys are redundant. But I find the site easy to use. Satisfied with payouts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RickB",
          "Nb_Reviews": 4,
          "Date": "2023-12-08T18:02:49.000Z",
          "Titre": "Good Experience Overall",
          "Contenu": "My experience has been positive for the most part. The points given for the surveys seems to be better than other survey sites I've used. The point bonus structure is also better. My only complaint would be that some surveys allow you to do a large portion of the survey then kicks me out saying \"I'm not a good fit for this survey\". This is after I've spent more than 10 minutes filling out questions. Waste of my time. This does not happen often, but when it does it's very frustrating."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T01:55:08.000Z",
          "Titre": "I enjoy doing Prime Opinion",
          "Contenu": "I enjoy doing Prime Opinion, but get frustrated when start a survey and do it for a few minutes and then all of a sudden kicked out and only get 1 to 3 points with no reason"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:09:59.000Z",
          "Titre": "helpful customer service",
          "Contenu": "even though the customer service person could not help the situation i was reporting with some surveys, she did give me 100 points to my account. I appreciate the help."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Paul",
          "Nb_Reviews": 10,
          "Date": "2023-12-21T12:31:22.000Z",
          "Titre": "A bit of free money!",
          "Contenu": "Well I did manage to earn £25.00 in the first 2 days after joining, but since then its more like £5.00 in 2 or 3 days. Still worth a punt if you have plenty of time on your hands though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathy",
          "Nb_Reviews": 6,
          "Date": "2023-12-15T15:52:25.000Z",
          "Titre": "I like Prime Opinion because you can…take a survey in five minutes or fifteen minutes and you get to choose the amount of time you want to spend here.",
          "Contenu": "I like Prime Opinion because you can choose the type of survey you want to take. You can take a short survey, a best match survey or a more point survey. The surveys are fair and easy to take. It helps me earn my points to get a few small items for myself at home. Thank you and Merry Christmas!"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Matthias",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T10:28:47.000Z",
          "Titre": "It's not easy to find the right surveys…",
          "Contenu": "It's not easy to find the right surveys but overall great service, fast payout. I like it!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customerChris H.",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T01:56:56.000Z",
          "Titre": "I have used a few other survey sites.",
          "Contenu": "I have used a few other survey sites in the past couple years and they all have the same issues of either not paying when you finish a survey or kick you off half way through.I have only used this site for a week now but have not had those problems yet on this site and have made the same amount of money in a week as I would in a month on another survey site."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Josh Snyder",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T22:42:22.000Z",
          "Titre": "I enjoy the surveys",
          "Contenu": "I enjoy the surveys, but the only thing I would change is the redemption aspect. It takes 5 business days to redeem points to my bank account and if it was faster, it would be better."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "MARY GRACE FROM AUCKLAND",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T09:26:36.000Z",
          "Titre": "Prime Opinion is truly a legit paying…",
          "Contenu": "Prime Opinion is truly a legit paying survey app..so thankful I came across this platform.Whenever I encounter survey technical errors,the support team would never fail to assist.More power.God bless"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Phil Wythe",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T19:22:13.000Z",
          "Titre": "Simple way to earn some vouchers",
          "Contenu": "Mostly works well but a small number of surveys do not allow you to complete even after you have started them which wastes time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roger",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T20:15:11.000Z",
          "Titre": "This is a wonderful site to make a few…",
          "Contenu": "This is a wonderful site to make a few pocket coins. What I don't like is spending 5 minutes \"qualifying\" for a survey and then being dumped. It adds up after a while and I just have to close it down."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "customer Maria",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T22:12:46.000Z",
          "Titre": "Keep wining with prime opinon.",
          "Contenu": "With prime opinon you will recive your payments. They have a-lot of speacial bonus  and extra points."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "CreativeBean",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T04:57:16.000Z",
          "Titre": "In comparison to all the other survey…",
          "Contenu": "In comparison to all the other survey for cash companies, this is pretty good. It's easy to cash out and mostly easy to earn points. You can also provide feedback when the survey link is broken or the surveyor screens you out at the end (this is becoming increasingly common).I also like the opportunities to earn bonus points and the leaderboard."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T05:48:13.000Z",
          "Titre": "trustful",
          "Contenu": "this site has given me an opportunity to earn working from home and is trustworthy. I have earned and redeemed also."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Zureida",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T12:26:43.000Z",
          "Titre": "I like the variety of surveys…",
          "Contenu": "I like the variety of surveys presented. I am jus sometimes disappointed when I spend a lot of time to complete the surveys and at the end it doesn’t close off properly and you don’t get the points"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Paulina Radzi",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T22:27:35.000Z",
          "Titre": "Good site",
          "Contenu": "Good site. They paid me some money. Lots of surveys just kick me out with no reason and I am not able to use it on vacation abroad, but in general it's a good survey site."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 8,
          "Date": "2023-12-10T03:02:47.000Z",
          "Titre": "Good to Work With",
          "Contenu": "I like the choices of Most Points, Best Match, etc. I think the platform is well done. The only negative is taking surveys and not getting points, which happens too often."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Gem",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T01:23:30.000Z",
          "Titre": "As far as survey apps go",
          "Contenu": "As far as survey apps go , and I've tried a few now. This has been great. Been on it since September and earnt over 75Aud from answering 79 questions in spare time all pay outs to Paypal have been pretty much instant (within 30mins). Great having random bonus codes too which give you more % of points which means you warn faster."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Kate",
          "Nb_Reviews": 8,
          "Date": "2023-12-18T00:27:19.000Z",
          "Titre": "Quick, reliable pay outs",
          "Contenu": "It's one of the quickest survey sites I know for building up pay outs."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Thomas Tonge",
          "Nb_Reviews": 11,
          "Date": "2023-12-04T00:00:51.000Z",
          "Titre": "Straightforward Opinions.",
          "Contenu": "Prime Opinions is a delight to work with when proffering your opinion on any topic, whether it be the weekly shop or the economic state of the nation.The questioning is concise, a pleasure to consider and this element has long-lasting results  for ones good-humour while considering your answer.  So often with competitors ones humour is blighted by the sheer length of the survey and worst still, that other survey no-no , Repetition.   There is a noticable lack of this in Prime Opinion Surveys and they are top of my list in their field."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:37:52.000Z",
          "Titre": "Great survey site but I feel like I…",
          "Contenu": "Great survey site but I feel like I come across ALOT of surveys that kick me out after a few minutes or don’t work"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Kate Howard",
          "Nb_Reviews": 6,
          "Date": "2023-12-17T22:38:06.000Z",
          "Titre": "Good for some extra cash",
          "Contenu": "A good survey sight with a good range of surveys to complete from short to long."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MRC",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T03:06:28.000Z",
          "Titre": "Prime Opinion's Reign",
          "Contenu": "You have a variety of surveys. you also pay a little more than other sites. Your estimate of surveys time is more accurate than other sites"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Frau Olena Bohm",
          "Nb_Reviews": 4,
          "Date": "2023-12-15T15:43:02.000Z",
          "Titre": "4 not 5 because from time to time they…",
          "Contenu": "4 not 5 because from time to time they send my home without points, all others the handling, the points are great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Natalie Berkowitz",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T17:39:55.000Z",
          "Titre": "Qualifying questions for surveys need to be first questions",
          "Contenu": "I get too many surveys which ask for information twice and/or ask too many questions to figure out if I qualify. This means I spend five minutes answering questions and there is no benefit to me. It is as if there is intention to drag out time."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Scott Lomax",
          "Nb_Reviews": 12,
          "Date": "2023-12-14T03:59:24.000Z",
          "Titre": "Some of the providers lie about how…",
          "Contenu": "Some of the providers lie about how long the survet is. But apart from that this app is really good. Payouts are quick and the goals to complete to earn more points is cool. This is the best survey app I've used."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael K",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T18:59:20.000Z",
          "Titre": "I like Prime Opinion very much",
          "Contenu": "I like Prime Opinion very much. My only complaint is that there are a few surveys that get stuck or won't upload."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "One customer",
          "Nb_Reviews": 13,
          "Date": "2023-12-18T22:38:26.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience, good surveys availability and fair payout which are quick to be transferred to PayPal."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T16:16:09.000Z",
          "Titre": "I guess the only annoyance I have with…",
          "Contenu": "I guess the only annoyance I have with the surveys is when they say you’re qualified and spend time answering questions and then get screened out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tim B",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T07:48:52.000Z",
          "Titre": "have not be able to do many high point…",
          "Contenu": "have not be able to do many high point surveys i dont qualify."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "paul ryder",
          "Nb_Reviews": 4,
          "Date": "2023-12-16T16:14:23.000Z",
          "Titre": "one of the top survey sites out there",
          "Contenu": "one of the top survey sites out there, easy surveys and earning easy to get paid out."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Pieter de Villiers",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T21:13:59.000Z",
          "Titre": "Surveys on Prime Option are great and very topical",
          "Contenu": "Surveys are great and very topical. Only negative is that some survey are not properly tested beforehand and cannot be completed - sometimes after spending up to 30 minutes on my time and effort on it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Betts",
          "Nb_Reviews": 4,
          "Date": "2023-12-13T23:51:01.000Z",
          "Titre": "Good site",
          "Contenu": "Good site, but too many wasted hours getting rejected for surveys."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Prime member",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T20:04:18.000Z",
          "Titre": "Good as it compensates your efforts",
          "Contenu": "Prime opinion compensates you for your efforts and gives and it is simple and straightforward way to withdraw money.However why I have not given it 5 stars is due to the fact that survey times can be inaccurate. It might say a survey takes around 10 minutes when it actually takes 20 minutes. I've also had a few errors where I have completed a survey to the end and it doesn't reward me, but instead tells me I have been screened out which was infuriating."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Natasha",
          "Nb_Reviews": 7,
          "Date": "2023-12-20T09:52:49.000Z",
          "Titre": "They have a good amount of surveys and…",
          "Contenu": "They have a good amount of surveys and they have really good rewards"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T03:09:31.000Z",
          "Titre": "More reliable than other survey sites",
          "Contenu": "More reliable than other survey websites, I don't feel cheated out my time. Although the average reward is smaller.Good bonuses (leaderboard, level up). Pretty instant payout and no limit on payouts it seems."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T22:16:47.000Z",
          "Titre": "Simple clean interface with a selection…",
          "Contenu": "Simple clean interface with a selection of surveys of varying lengths and types. If you complete a survey each days for seven days you enter a prize draw where you can earn up to 1000 points."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Eileen C",
          "Nb_Reviews": 4,
          "Date": "2023-12-13T21:44:54.000Z",
          "Titre": "Experience is good",
          "Contenu": "Experience is good.  Would like to see a redeem at 500 points as others have."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T19:24:59.000Z",
          "Titre": "It's a great app to earn passive income…",
          "Contenu": "It's a great app to earn passive income ,have great features too, but sometimes it screen you out after you have done 20 minutes of survey"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Naotnie",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T20:09:01.000Z",
          "Titre": "Pretty good experience",
          "Contenu": "The website and idea are pretty nice overall. However, I must say that getting kicked from 45%+ of my surveys is kind of annoying (especially when I'm in the middle of it and it's only because my household makes around 124,999$ a year and not more). It's a bit long as well to claim rewards so if we could get a bit more points it'll be awesome. Great experience overall. I recommend if you want to make money online and if you just don't know what to do in the bus, well do a survey."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "R. Beasley",
          "Nb_Reviews": 9,
          "Date": "2023-11-18T21:12:00.000Z",
          "Titre": "It's a good service. However.....…",
          "Contenu": "I give 4 stars due to fact it's good but you can go through an entire survey and spend like an hour for a survey that promises 190 points and end up only getting 3 points which is truly frustrating and you don't know until the very end what they will decide to give you points wise.   Other than that you will receive pay if you get enough points which is why i gave 4 stars.   It loses a star for the hit or miss of the companies that take advantage of people by having take an entire survey and not give credit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A May",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T17:01:44.000Z",
          "Titre": "Very pleased, but need to pay more.",
          "Contenu": "Very pleased, but think compensation should be more due to lengths of surveys compared to other companies."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "steve gajewski",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T16:08:41.000Z",
          "Titre": "Plenty of surveys",
          "Contenu": "Plenty of surveys.  Also has bonuses for reaching different levels.  I've tried other sites and am very happy with Prime."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ROBIN",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T23:40:02.000Z",
          "Titre": "Thank you Prime Opinion",
          "Contenu": "Prime Opinion offers more surveys that are better quality than most. There is always a survey available .There are fewer incidents where you spend five or ten minutes and then out of the blue you are kicked off with no explanation. The bonuses are a real incentive. Very easy overall."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Survey Taker",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T02:31:36.000Z",
          "Titre": "Good Survey Site",
          "Contenu": "Good site to take surveys on. Easy to access. Has short or longer surveys and matches them to you. I would give 5 stars but I've run into many broken surveys."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "William Lunio",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T04:00:34.000Z",
          "Titre": "The page set up is easy to navigate",
          "Contenu": "The page set up is easy to navigateThere are sufficient surveys to completeThe bonus points are a handy inclusionThe only problem I am having is not being able to start or conclude surveys due to Aged prejudices I am completing 2 out of 10 on average which is not the fault of Prime Opinion they are just the facilitator"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:30:38.000Z",
          "Titre": "I like the constant availability of…",
          "Contenu": "I like the constant availability of quality surveys to take and also like the instant payouts."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T21:37:04.000Z",
          "Titre": "The app is legal everything is ok but…",
          "Contenu": "The app is legal everything is ok but the surveys somethings you don't qualify to all and the rewards are very low"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lou",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T16:25:08.000Z",
          "Titre": "Answer categories",
          "Contenu": "Some questions provided only answers that were absolute with no room for gray areas in the response. Some of these were a little uncomfortable to answer."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T16:03:43.000Z",
          "Titre": "Rewards for completing surveys",
          "Contenu": "Rewards for completing surveys, works ok majority of the time, have had 2 £20 vouchers in a month"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T06:03:36.000Z",
          "Titre": "i only gave 4 stars because there is…",
          "Contenu": "i only gave 4 stars because there is always room for improvement. the only real complaint i have is broken surveys."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Alina",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T11:39:56.000Z",
          "Titre": "I enjoy an app",
          "Contenu": "I enjoy an app. It is great survey app. Very easy  to navigate and with great  .. quality surveys  . It  Is one of few best apps I ever used. I am happy I signed up for pyime opinion. Thank you and good luck in everything"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Oliver",
          "Nb_Reviews": 3,
          "Date": "2023-11-10T23:09:09.000Z",
          "Titre": "The surveys are pretty straightforward",
          "Contenu": "The surveys are pretty straightforward. However some glitches in few surveys so can't complete. A very few surveys I have done have been extensive and on the last screen said the screener screened me out. So I never got the whole reward even after completing everything and 30 minutes later.The one thing Prime does well is pay you immediately. I use PayPal but other options available... overall happy"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T03:26:02.000Z",
          "Titre": "Nice variety of surveys",
          "Contenu": "Nice variety of surveys, with ability to rate each survey afterwards.  Potential surveys show composite ratings, which can help one avoid those where completion is unlikely."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "C. Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T02:04:52.000Z",
          "Titre": "Great, But Must Be Selected",
          "Contenu": "Prime Opinion is good in that one can recieved their chosen reward right away, and there are always a great number of surveys available. However, one must be quick in their selection and relatively quick in their answering. The surveys tend to fill up fast. I also wish the screen-out process was a bit more thorough, and the compensation reward cap higher than 4 points. I've been screened out of surveys after answering for 15 minutes sometimes. On the whole, though, Prime Opinion does have good surveys and pays well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "james",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:29:22.000Z",
          "Titre": "good and bad",
          "Contenu": "great perks and many surveys only problem ia most of the surveys do not work"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T08:43:58.000Z",
          "Titre": "I like the weekly bonus you can get",
          "Contenu": "I like the weekly bonus you can get, I wish their were more surveys under 10 minutes with more points"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Tania Q",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T20:40:01.000Z",
          "Titre": "It's good to have the surveys available…",
          "Contenu": "It's good to have the surveys available all the time but you still have to do a lot of surveys to even get a little bit of money but apart from that I think it is worth your while to join prime opinion because I like it very much thank you"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Julian PULLEN",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T23:39:55.000Z",
          "Titre": "Great Survey Site",
          "Contenu": "Experience has been mostly good with great number of surveys to part in.Think they need to a slightly better job in screening surveys so that you are not kicked out while completing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandra Cuenca",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T20:04:14.000Z",
          "Titre": "My experience has been great so far 1…",
          "Contenu": "My experience has been great so far 1 month into joining. I’ve been able to complete a lot of surveys. I like that the disqualification is done  at the beginning of the survey so my time is not wasted. I have found a few broken or surveys with glitches that cannot be completed."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Lb",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T19:57:08.000Z",
          "Titre": "Guaranteed pay",
          "Contenu": "Doing survey for 4 months now . Everyday one survey for sure with good points. You choose the survey if you qualify you get to finish it and get the points. It's really simple."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Graham Hannah",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T15:12:33.000Z",
          "Titre": "I quite enjoyed the Surveys",
          "Contenu": "I quite enjoyed the Surveys, I think a lot of people just do it for the money, which is a good idea, but I think doing it that way becomes quite laborious"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T15:46:21.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience, but you need time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kay",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T13:36:45.000Z",
          "Titre": "Go For It!!!",
          "Contenu": "I would try the survey platform if I were you! Not only can you get paid in the same day, but if you have an issue with a survey that you almost completed the CSRs are real people who will rectify the survey glitch!"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Ela Sturm",
          "Nb_Reviews": 10,
          "Date": "2023-11-16T10:48:03.000Z",
          "Titre": "Unfortunately",
          "Contenu": "Unfortunately, I have to deduct one point. Many surveys don't work, or even though you've been selected, you're excluded from the survey after the first two questions. Which is incomprehensible to me. I like the site and it's a lot of fun"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis M",
          "Nb_Reviews": 4,
          "Date": "2023-11-15T01:52:57.000Z",
          "Titre": "Prime Opinion Review",
          "Contenu": "It seems like you can chat with staff at any given time and they try to help you as much as possible. $$$ amount for the surveys is good and you can get paid a thousand different ways and the payments are immediate except for the direct deposit, which took about 6-8 hours. Still get screened out a lot but at least they give you a few points if you do. 4.5 stars and one of the best survey sites around."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nigel",
          "Nb_Reviews": 15,
          "Date": "2023-11-20T22:00:12.000Z",
          "Titre": "It's One of the Few Good Survey Sites",
          "Contenu": "It's one of the better survey sites. Prime has the options for short surveys, high paying surveys (which will take longer). You can cash out with only 200 points with an $2.00 Amazon e-card. The threshold for paypal is 500 points. I also like the fact I can rate each individual survey once I'm done."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T23:38:11.000Z",
          "Titre": "I do not get kicked out of more than 25…",
          "Contenu": "I do not get kicked out of more than 25 % of the surveys you choose for me."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T20:58:46.000Z",
          "Titre": "Some surveys don't let me finish them…",
          "Contenu": "Some surveys don't let me finish them when I'm already 10 min or plus in it"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 9,
          "Date": "2023-11-12T18:58:14.000Z",
          "Titre": "Good site, underhand survey providers.",
          "Contenu": "I've literally only been doing these surveys for about two weeks and Prime is the second site I've joined. Both sites in themselves are fine with Prime being slightly better. The big issue anyone will have if deciding to go down this route for a bit of extra money is not the standard/reliability of the surveys site themselves but the honesty of the survey providers.After only a short time, I've quickly realised that a lot of these survey providers are dishonest and underhand in a lot of their practices. The amount of times you'll enter a survey, give them valuable information for sometimes up to 6 or 7 mins only for them to get to the part where they actually decide if you're a match and kick you out.The criteria to decide whether you're a match should be given in the first minute or two or it's grossly unfair and frustrating.All in all it's a good way of making a few extra pounds if you can deal with a lot of frustration."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Halim",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T16:29:51.000Z",
          "Titre": "Adorebale application",
          "Contenu": "Since, i started with Prime opinion,  i am just enjoy to reply on survey et all this survey are profesionaly and great.I take my free time on the this adorable application.wish you best."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Gary",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T12:10:35.000Z",
          "Titre": "Enjoying the surveys",
          "Contenu": "Enjoying the surveys but seem to be screened out a lot. I may still get a couple of points but can take some time to get to compete a survey. Like the bonus code but wish for more often."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Murray Featherly",
          "Nb_Reviews": 3,
          "Date": "2023-12-03T12:43:43.000Z",
          "Titre": "I like learning and being helpfull",
          "Contenu": "the Surveys i get are helping me learn a little as well as giving my opinion on different areas"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T23:08:53.000Z",
          "Titre": "Sometimes it's good and sometimes it's…",
          "Contenu": "Sometimes it's good and sometimes it's bad like sometimes it takes forever just to even complete one survey but sometimes you just sit down for a couple hours and make 15 bucks real quick so overall it's pretty good."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "kristen kelly",
          "Nb_Reviews": 18,
          "Date": "2023-11-16T08:13:53.000Z",
          "Titre": "Good site…",
          "Contenu": "Would give more but so many of the surveys stop working half way through. There are at least 70% that I’m not eligible for before I even answer a question. However, if you keep trying you can build your points quickly but you have to put the effort in."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "tomczakj",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T18:37:37.000Z",
          "Titre": "Works well enough",
          "Contenu": "Works well enough. Sometimes the surveys are broken. Better than the last survey app I used with more winnings."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T05:30:04.000Z",
          "Titre": "Review",
          "Contenu": "So far, taking these surveys have been enjoyable except when they are broken... or when I have completed all questions and still don't get the reward which is annoying."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Alan",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T13:29:41.000Z",
          "Titre": "Good experience",
          "Contenu": "I have had a good experience, would of given 5 Stars had it not been that I have done a couple of surveys and it has got to the end and it has just stopped working and all you can do is lose all the points you should of had, and I cannot find anywhere to report it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edmund Miarecki",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T19:40:40.000Z",
          "Titre": "The have been a few times where the…",
          "Contenu": "The have been a few times where the survey freezes or some issue and I can’t complete the survey even though I spent sometimes 20 minutes already doing it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T00:46:31.000Z",
          "Titre": "I would give it five stars but and…",
          "Contenu": "I would give it five stars but and several occasions the surveys are broken. And a handful of times I've completed a survey just to be told the advertiser screened me out."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "customer  Cathrine Benson",
          "Nb_Reviews": 11,
          "Date": "2023-11-23T23:24:21.000Z",
          "Titre": "a fantastic survey site very well run …",
          "Contenu": "a fantastic survey site very well run  and that personal touch love it your by far the best one so glad i discovered you0"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debbie Hill",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T03:09:36.000Z",
          "Titre": "Good Experience",
          "Contenu": "I gave 4 stars because I seem to be finding a lot of surveys that I get half way through and it gets stuck or tells me I didn't qualify after I finish the survey."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T15:27:50.000Z",
          "Titre": "I gave it a 4 because some surveys take…",
          "Contenu": "I gave it a 4 because some surveys take longer than what is advertised or you get screened out even after you’ve been on the survey for 15 mins. and you get 1 point for your time."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "NATASHA M",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T15:28:01.000Z",
          "Titre": "Some tweaks needed but mostly good",
          "Contenu": "I love this site however I get annoyed when I’m 3/4 through a survey and an error occurs and I’ve wasted time with no reward. More needs to be done to fix this. Time is money!"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "AKKI",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T06:05:51.000Z",
          "Titre": "The company is doing very well but…",
          "Contenu": "The company is doing very well but sometimes it has server error which is a problem"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customerZephyr",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T05:53:42.000Z",
          "Titre": "Steady Work",
          "Contenu": "Nice variety of surveys and work is always available.  Better screening.matching would be appreciated as occasionally a significant amount of time is spent and then the participant is screened out."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Tara",
          "Nb_Reviews": 9,
          "Date": "2023-11-12T23:51:31.000Z",
          "Titre": "It's great in the sense that you get to…",
          "Contenu": "It's great in the sense that you get to pick a box of points if and only if you complete 7 days on the run so you cannot afford to really miss out a day. Customer Service is excellent 👌"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Ray Whitworth",
          "Nb_Reviews": 4,
          "Date": "2023-11-28T02:07:19.000Z",
          "Titre": "Am enjoying the surveys which makes me…",
          "Contenu": "Am enjoying the surveys which makes me use my brain and also keeping me active in use of IPhone."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Customer Svetlana marchuk",
          "Nb_Reviews": 12,
          "Date": "2023-12-05T23:26:47.000Z",
          "Titre": "tHERE ARE ALWAYS PLENTY SURVEYS",
          "Contenu": "tHERE ARE ALWAYS PLENTY SURVEYS, pRIME oPINION IS VERY GENEROUS, GIVES BONUSES AND THIS ENCOURAGES ME TO CONTINUE"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean M.",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:15:37.000Z",
          "Titre": "Definitely a top choice for those who…",
          "Contenu": "Definitely a top choice for those who like taking surveys. There are plenty of surveys to choose from as well as plenty of rewards. Plus if you can do a seven day streak, there are additional points to be awarded. I definitely recommend this site if you're looking for good prizes and plenty of surveys"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CookieGcustomer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T14:23:39.000Z",
          "Titre": "Prime Opinion is one of the best survey…",
          "Contenu": "Prime Opinion is one of the best survey sites. There are lots of surveys available. The survey questions are easy to understand and to complete, however it is very important that you take your time and answer the questions carefully. Prime Opinion pays immediately after cashing out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda M",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T08:11:46.000Z",
          "Titre": "I just love this survey site",
          "Contenu": "I just love this survey site! Prime Opinion is now my favorite site to do surveys. They're prompt attention to any issues cannot be beat! I was skeptical at first, thinking it was just another survey site. But I am beyond satisfied with everything on Prime Opinion. The great customer service is a plus, questions answered and taken care of immediately, gives me the confidence to continue doing surveys at Prime Opinion. Thank you everyone at Prime Opinion! Keep up the great work!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dariusz W",
          "Nb_Reviews": 5,
          "Date": "2023-12-20T01:08:25.000Z",
          "Titre": "Prime Opinion is a very fair and…",
          "Contenu": "Prime Opinion is a very fair and reliable site in regards in offering rewarding surveys. And these awards are better than most of its competitors. And every time there are so many surveys available that it’s unbelievable in comparison with others brands. Great fun and entertainment. And the most important thing which I do value the highest is that you are screened out after initial input maybe once in 30 surveys attempts. This is reassuring that your valuable personal time is not wasted.Thank you for this opportunity."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth Orman",
          "Nb_Reviews": 9,
          "Date": "2023-12-20T14:29:04.000Z",
          "Titre": "One of my Favorites!",
          "Contenu": "Prime Opinion offers a variety of surveys, different lengths, different types, and I always have a good percentage of those I qualify to take. I have had no problems logging in.  Once in a great while the site doesn't load very quickly but it's rare and not a big deal. Prime Opinion is one of my favorites!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:39:59.000Z",
          "Titre": "Prime opinion is the best for people…",
          "Contenu": "Prime opinion is the best for people like me who need a side hustle. Honestly is so easy but does require you to be attentive and honest which I am. Thank you Prime Opinion for allowing us to earn some money right now in this period of economic climate."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "jenny lea",
          "Nb_Reviews": 41,
          "Date": "2023-12-20T12:30:17.000Z",
          "Titre": "One day a member and $30 AUD EASY",
          "Contenu": "I've only been a member for one day and already I've made $30AUD Unlike other sites you rarely get \"zoned out\" So many surveys to choose from short length with lower pay or longer length with higher pay Take your pickPayment immediately to PayPal"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ted B.",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T00:38:30.000Z",
          "Titre": "New to Prime Opinion",
          "Contenu": "Have some experience with other survey platforms and found prime opinion to be the best. The surveys are \"pre-screened\" and properly tailored to avoid the constant wasted time and motion experienced in other surveys.  The experience has been fun and the payouts processed timely. FIVE STARS.  Ted B."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James C",
          "Nb_Reviews": 7,
          "Date": "2023-12-20T23:51:37.000Z",
          "Titre": "My new Favorite",
          "Contenu": "This is a great site to start, only have been a member for a couple of weeks but they have many surveys and are not too crowded like others.  Have had some non-credits after completing surveys, more the last few days but still my favorite survey site compared to others.  Very good customer support that is chat based and is real people, not AI like most others (Swagbucks).  They have very good rewards as well and is simple to survey with.  The biggest positive for me is when you don't qualify for a survey it is at the beginning, quick disqual if you aren't their demographic, and you don't spend 10 mins before being screened out (other than some non-credits).  The redemptions are immediate and has a large variety of gift cards or payments to choose from.I have been a member for a short time, but give it a A+ to start."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luke G",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T06:51:33.000Z",
          "Titre": "Pretty reliable panel",
          "Contenu": "The survey invites pretty well give accurate time frames  for surveys. I don't get routed around to other surveys after clicking on the first one. Is a reliable payer and I have cashed out twice so far."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:56:36.000Z",
          "Titre": "easy website that has enough surveys…",
          "Contenu": "easy website that has enough surveys and has many types of gift cards, certainly many more type of giftcards then other survey website."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Dennis Ng",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T06:11:43.000Z",
          "Titre": "Best ever survey site",
          "Contenu": "Best ever survey site I ever used. No regret and payout is immediately. None of the survey platforms is as good as Prime Opinion. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Yulia Du Meyns",
          "Nb_Reviews": 11,
          "Date": "2023-12-20T03:02:07.000Z",
          "Titre": "I am very pleased with Prime Opinion…",
          "Contenu": "I am very pleased with Prime Opinion and really enjoy taking surveys and I am very happy with customer service.  If I have some question I shortly receive an answer."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Carol",
          "Nb_Reviews": 7,
          "Date": "2023-12-17T13:46:34.000Z",
          "Titre": "I cannot speak highly enough anout…",
          "Contenu": "I cannot speak highly enough anout them. I have been a member for just a month and had a £50 cash out already. Every day there are huge amounts of surveys available.Generally they are not big paying but they accumulate so quickly they really do mount up. They reward you for doing at least 1 survey every day by giving you a free reward on the 7th consecutive day. Each one I've had has been worth at least £2 which is great. Most impressive of all though is how quick payment is. My redemption came within hours,which surpassed all of my expectations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sue W.",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T02:21:45.000Z",
          "Titre": "I have qualified and completed more…",
          "Contenu": "I have qualified and completed more surveys on Prime Opinion than all the sites combined . Big variety of surveys and easier to earn money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zach",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:23:49.000Z",
          "Titre": "Solid Survey Site",
          "Contenu": "This site does a great job matching you to surveys that are relevant to you if you keep looking under the best matches tab and they also make the survey screening process quick and painless."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Bushra Ansari",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T05:55:47.000Z",
          "Titre": "Just AWESOME 👌",
          "Contenu": "Doing surveys can help you earn some pocket money tbh I have been using this app for over 6 months now and I have never seen such rewarding app ever for surveys! Support team is fabulous 💗 Very happy with prime opinion. Keep on doing the great work prime opinion 🤝"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Deb",
          "Nb_Reviews": 7,
          "Date": "2023-12-21T20:47:28.000Z",
          "Titre": "There are loads of surveys to do",
          "Contenu": "There are loads of surveys to do, from high scoring long surveys to low scoring shorter surveys if you are in a rush. also a prize draw after 7 days to win extra points. one of the best out there"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jen Wallace",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T11:43:59.000Z",
          "Titre": "Great way to make so money🙂",
          "Contenu": "Started doing surveys a week ago and already earned forty dollars. The surveys are easy to follow. Sometimes you will be kicked out of surveys you started. But if you have some time on your hands it is worth a try."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T15:45:43.000Z",
          "Titre": "The best survey site by far...",
          "Contenu": "The best survey site by far paying quickly via PayPal. Most don't do PayPal but offer vouchers like Amazon which I have enough of"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sarah R",
          "Nb_Reviews": 12,
          "Date": "2023-12-20T22:39:20.000Z",
          "Titre": "I enjoy using this site easy to do and…",
          "Contenu": "I enjoy using this site easy to do and don’t take up all the time,  good to earn a few bucks will not make you 1000s but can make you some poker money"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly Haley",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T04:10:16.000Z",
          "Titre": "I love that not only do y'all have…",
          "Contenu": "I love that not only do y'all have multiple different surveys, y'all change it up to see our different responses and y'all have surveys that interact with us. Thank y'all for the amazing job and great surveys y'all let us do."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "MrJohnOldfield",
          "Nb_Reviews": 26,
          "Date": "2023-12-18T16:01:37.000Z",
          "Titre": "Prime opinion i",
          "Contenu": "Prime opinion is a useful and interesting way to make some pocket money. Some of the surveys are really interesting. Some are not so interesting. You won't get rich but on the train or bus its a rewarding use of time."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Norwich",
          "Nb_Reviews": 24,
          "Date": "2023-12-21T21:19:32.000Z",
          "Titre": "A great survey site.…",
          "Contenu": "Lots of different surveys to choose from. Various lengths and rewards. extremely fast pay outs. So interesting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T14:31:49.000Z",
          "Titre": "Prime opinion is hands down the best…",
          "Contenu": "Prime opinion is hands down the best survey site that I use!  Always has surveys to take and I qualify for about 90% of them.  Rewards are very fair and the extra incentives such as the leaderboard are very fun and engaging.Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sean Barton",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T00:44:41.000Z",
          "Titre": "New survey company,well new to me…",
          "Contenu": "New survey company,well new to me anyway.They offer up a mix of different interesting studies that are enjoyable to participate in and they reward any participants with a rewards bonus that you get straight away..no messing about..highly recommend this company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Monroe",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T17:08:57.000Z",
          "Titre": "5 Star Review",
          "Contenu": "Prime Opinion is a great site to take surveys and give honest feedback on a variety of different topics. Payout is fast too! I give them 5 Stars"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T17:15:55.000Z",
          "Titre": "Fun - most of the time.",
          "Contenu": "The surveys are a means of a little extra spending money are fun. Sometimes frustrating when you think you just completed a survey only to find the final page locked, and thus, no points accumulated."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Walter Buckeridge",
          "Nb_Reviews": 10,
          "Date": "2023-12-17T20:51:07.000Z",
          "Titre": "New Dimension",
          "Contenu": "Prime Opinions has elevated my survey-taking to a new level.  It gives you so much choice & so many options, you’ll always find several to do every day.  I’m really enjoying it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katherine Guzman",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T20:32:34.000Z",
          "Titre": "Great survey company",
          "Contenu": "I am so glad that I joined Prime Opinion. I like it is fast paced. Consistent, fast paying. Lots of fun and different surveys. If you are consistent you get rewarded. Come join it is great!"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T13:43:57.000Z",
          "Titre": "Amazing website to earn some extra…",
          "Contenu": "Amazing website to earn some extra money by filling in surveys. Fast and reliable and the beste website i’ve used for this matter."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tillie Sears",
          "Nb_Reviews": 6,
          "Date": "2023-12-20T22:42:01.000Z",
          "Titre": "Better Than Most",
          "Contenu": "Overall I get more money from Prime than the others. But in general the surveys are longer than what is presented as the time it takes to complete."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "EUGENE",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:41:34.000Z",
          "Titre": "Nice!!!!",
          "Contenu": "It is fun and nice to participate on Prime Opinion. The companies and goals for the interviews are nice and gives me great fulfillment to give my opinion. That I can earn some money aswell is also a surplus"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robin S.",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:42:19.000Z",
          "Titre": "I have made money everyday since day…",
          "Contenu": "I have made money everyday since day one! The surveys are fun, and engaging. I love looking forward to logging in everyday because the site is like a game. So much fun, Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:39:36.000Z",
          "Titre": "This is a great site the admin can help…",
          "Contenu": "This is a great site the admin can help with problems and are quick to respond and they do help I have been on this site for a little while but I love it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:25:59.000Z",
          "Titre": "Well for the most part it's great but…",
          "Contenu": "Well for the most part it's great but when you start a new account you get timed out of everything it's ridiculous"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T02:41:29.000Z",
          "Titre": "This is a great site that does what it…",
          "Contenu": "This is a great site that does what it says it does, and respects the opinions of its users. Pretty much perfect experience so far after a couple weeks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Zhang",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T03:55:42.000Z",
          "Titre": "Good place to earn extra cash.",
          "Contenu": "I joined the Prime Opinion in November 2023. Its platform is easy to use. The Prime Opinion lists a variety of surveys. I really like the rating, and survey minutes features which can help me to select the best fits. More importantly, the payout is faster than I expected."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Nicholas Warren Richardscustom",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T13:13:45.000Z",
          "Titre": "This site has been “my bread and butter…",
          "Contenu": "This site has been “my bread and butter “on occasions and it’s a top up for my bank account now ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Becca Page",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T19:17:38.000Z",
          "Titre": "There are companies that are clear and…some clear some not",
          "Contenu": "There are companies that are clear and concise. Then there are companies that are repetitive and confusing. Sometimes it’s a waste of my time when a company agrees to give you points for a certain number of minutes and goes over the minutes or time out after the competition of a survey. Otherwise I have enjoyed most."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Derrick Massey",
          "Nb_Reviews": 4,
          "Date": "2023-12-19T08:24:57.000Z",
          "Titre": "The best survey site I've used.",
          "Contenu": "The best survey site I've used. Great range of interesting surveys, good bonus scheme, well worth trying!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Speedo",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T03:40:57.000Z",
          "Titre": "Reach for the stars",
          "Contenu": "This survey site is truly a site that has some really good surveys. I wish I could qualify for even more higher paying surveys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Kuehl",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T21:40:50.000Z",
          "Titre": "I like the way I'm able to answer daily",
          "Contenu": "I like the way I'm able to answer questions daily and get credit for them. I play the survey game on Publisher's Clearing House, and they have cheated me out of at least six rewards."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "mkremer80",
          "Nb_Reviews": 8,
          "Date": "2023-12-17T14:05:44.000Z",
          "Titre": "A good and easy way to earn much extra…",
          "Contenu": "A good and easy way to earn much extra money or other extra rewards. It is very cool and easy to use. I can recommend it very much. You can join when ever you want and benefit from it. And payment is very fast and comfortable. I am proud to become a member of Prime Opinion. ThanksMichael K."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "allalyalf",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T00:59:43.000Z",
          "Titre": "\"SO GLAD PRIME OPINION FOUND ME!\" Most of my surveys were for a dollar or…",
          "Contenu": "Most of my surveys were for a dollar or more and whenever I have been kicked off a survey, (which is rare) it is right away and not after investing 30 minutes into the survey. Love you guys!! So glad you found me!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bee",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:47:41.000Z",
          "Titre": "Easy & Fast",
          "Contenu": "I like that, unlike other survey websites which decline you every time, this one actually works well and consistently gives the types of rewards that other sites promise & don't deliver - I've already made $50!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chriss",
          "Nb_Reviews": 4,
          "Date": "2023-12-17T20:50:26.000Z",
          "Titre": "Kudos to Prime Opinion.",
          "Contenu": "Prime Opinion is one of the best surveys I have engaged with. The successful survey completion rate is high, there is always a lot of surveys available with good points, and redeeming rewards is instant. I highly recommend it to serious survey participants."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ydoc",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T02:16:44.000Z",
          "Titre": "Great survey app",
          "Contenu": "Great survey app. I’ve download and used 20 apps in the past and found this one that relatively easily to acquire points."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:20:47.000Z",
          "Titre": "I like that it is different than other…",
          "Contenu": "I like that it is different than other survey sites. More for your time and the largest variety of gift cards."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:44:50.000Z",
          "Titre": "because there are many relevant surveys…",
          "Contenu": "because there are many relevant surveys for me. that makes me more interested and funny about surveys."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Elaine Hosken",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T05:03:17.000Z",
          "Titre": "Well designed survey platform",
          "Contenu": "Well designed survey platform which is easy to access and complete surveys.Nice incentives along the way too.Redeeming rewards is quick and easy."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:59:57.000Z",
          "Titre": "Lots of Surveys.",
          "Contenu": "Like being able to do surveys when I want rather than when the become available"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T18:23:16.000Z",
          "Titre": "when it was time to payout i used…",
          "Contenu": "when it was time to payout i used paypal and had the cash in 15 minutes. get a lot of rejects but a lot of them give a few cents which is better than nothing but the ones you get are often interesting or fun"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T04:37:34.000Z",
          "Titre": "I've really been enjoying my Prime…",
          "Contenu": "I've really been enjoying my Prime Opinion experience thus far! Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chiquita",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T06:14:31.000Z",
          "Titre": "Great Survey Experience",
          "Contenu": "The surveys are interesting and easy to fill out. The points I receive are fair and rewards are easy to claim and paid out quickly."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T11:09:38.000Z",
          "Titre": "great surveys and easy claim of points",
          "Contenu": "great surveys and easy claim of points, not to mention easy claiming of rewards."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T23:39:06.000Z",
          "Titre": "This is by far the best survey app I've…",
          "Contenu": "This is by far the best survey app I've came across. I've been doing surveys for over 4 years and used a handful of different survey apps. Fantastic job guys keep it up!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindi B.",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:20:40.000Z",
          "Titre": "The surveys are interesting and easy to…",
          "Contenu": "The surveys are interesting and easy to complete.  It’s a great way to make a little extra money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fee Fee",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T01:31:24.000Z",
          "Titre": "Prime Opinion is the best survey site I…",
          "Contenu": "Prime Opinion is the best survey site I have came across an I’ve tried plenty they have multiple surveys to choose from cash out is quick an easy I received my payment within 30 minutes to my paypal account oh forgot to mention you can cash out daily if you’d like to ."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Glenn Henderson",
          "Nb_Reviews": 5,
          "Date": "2023-12-18T21:44:41.000Z",
          "Titre": "Really good survey app",
          "Contenu": "Really good survey app, always surveys on it to complete and has enough about it that keeps you regularly using, would recommend to all who enjoy surveys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy Camper",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T23:41:49.000Z",
          "Titre": "Good Choice",
          "Contenu": "You qualify for more surveys and there are lots of them to choose from.  So many ways to redeem your reward points too; helped with Christmas shopping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:29:59.000Z",
          "Titre": "Easiest survey platform I've seen",
          "Contenu": "Points are easy to earn, there are big points surveys, surveys can be rated with a 5 star system so you know the likelihood of earning points from it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:23:04.000Z",
          "Titre": "$50 gift card",
          "Contenu": "they provide a large area of surveys that I can take to earn money the surveys are good ones to complete too"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "E.P",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:40:17.000Z",
          "Titre": "This survey app is the real deal!",
          "Contenu": "This survey app actually lets you do surveys and will pay you for your time. You can set any amount for your payout as well"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michael Hoiles",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T19:10:41.000Z",
          "Titre": "Satisfactory.",
          "Contenu": "My own personal experience is that overall the surveys are good. Like everyone could always do with more money/rewards."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Suzanne S",
          "Nb_Reviews": 21,
          "Date": "2023-12-15T23:51:29.000Z",
          "Titre": "I love the variety of interesting…",
          "Contenu": "I love the variety of interesting surveys...! Easy to reach payout..site so well set up with extra bonuses..etc..and payout within seconds..!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bekah",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T03:28:24.000Z",
          "Titre": "The BEST site for surveys",
          "Contenu": "The best site for surveys! More money than others with quick payouts and more surveys! Glad to be apart of prime opinion to ear extra cash in my free time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "OM",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T06:08:30.000Z",
          "Titre": "Excellent!",
          "Contenu": "I highly recommend Prime Opinion for anyone interested in paid surveys. Having subscribed to various survey platforms over the past five years, Prime Opinion stands out as one of the most satisfying experiences. What sets it apart is the almost instantaneous money transfers to PayPal, providing a quick and convenient way to access your earnings. Additionally, the platform offers the option to donate if you're feeling generous, adding a charitable dimension to your participation.One notable feature is the daily availability of a diverse selection of surveys that you can qualify for, enhancing your earning potential. While it's true that the pay may be slightly lower compared to some claims, in my opinion, Prime Opinion remains one of the best-paid survey platforms. It's important to note that, like any survey platform, some surveys may take longer than estimated, which is a common aspect of this type of opportunity."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Anja Mossink-Zwart",
          "Nb_Reviews": 18,
          "Date": "2023-12-18T17:34:16.000Z",
          "Titre": "Excellent surveys",
          "Contenu": "Excellent surveys, difficult to achieve a streak.Fast payout with giftcard of your choice."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Michael G.P.",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T15:51:15.000Z",
          "Titre": "decent rewards can be earnt",
          "Contenu": "Many surveys are offered some short some longer and there is many ways of earning bonus points."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "G.R.",
          "Nb_Reviews": 10,
          "Date": "2023-12-21T04:15:06.000Z",
          "Titre": "A good survey site.",
          "Contenu": "Lots of surveys. Not many screen-outs. Rewards add up quickly, and I don't have to wait too long for a payout."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "C Bishop Sussex",
          "Nb_Reviews": 8,
          "Date": "2023-12-18T12:59:03.000Z",
          "Titre": "Excellent mix of surveys…",
          "Contenu": "Excellent mix of long and short surveys easy to claim rewards. Good streak incentive."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Vin",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T05:38:23.000Z",
          "Titre": "I love the surveys that were offered",
          "Contenu": "I love the surveys that were offered. It was very meaningful and informative."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Trish",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T23:52:17.000Z",
          "Titre": "It's one of the best survey site with…",
          "Contenu": "It's one of the best survey site with very simple reward system."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sabrina",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T14:57:55.000Z",
          "Titre": "Made 40 dollars in less than 2 weeks",
          "Contenu": "Made 40 dollars in less than 2 weeks! I'm a single stay a home mom so everything helps! Surveys are easy and don't take too long!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jamie Smith",
          "Nb_Reviews": 6,
          "Date": "2023-12-21T13:40:15.000Z",
          "Titre": "Always lots of surveys",
          "Contenu": "Always lots of surveys.  Payout from as little as £1 and instant"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T22:07:20.000Z",
          "Titre": "I loved prime opinion",
          "Contenu": "I loved prime opinion, it is the best survey network so far, they could improve with greater rewards"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOSEPH S KINNARD",
          "Nb_Reviews": 6,
          "Date": "2023-12-22T00:38:33.000Z",
          "Titre": "Interesting surveys",
          "Contenu": "Interesting surveys, a fun way to make some extra cash."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lisa  Davies",
          "Nb_Reviews": 9,
          "Date": "2023-12-19T09:40:14.000Z",
          "Titre": "This app is great easy to use",
          "Contenu": "This app is great easy to use. Plenty of survey opportunities and practically instant payment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kay Rudicell",
          "Nb_Reviews": 4,
          "Date": "2023-12-17T17:55:46.000Z",
          "Titre": "There are always surveys available.",
          "Contenu": "There are always surveys available.  I gain a lot of knowledge from taking these surveys."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ana Glavina",
          "Nb_Reviews": 5,
          "Date": "2023-12-17T12:05:06.000Z",
          "Titre": "The surveys were relevant to me and I…",
          "Contenu": "The surveys were relevant to me and I was rewarded once they were completed.They were easy to understand and follow."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lurch",
          "Nb_Reviews": 8,
          "Date": "2023-12-16T19:04:22.000Z",
          "Titre": "A fair survey site that offers a large…",
          "Contenu": "A fair survey site that offers a large number of honestly ranked surveys with fair rewards."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas Duck",
          "Nb_Reviews": 7,
          "Date": "2023-12-18T15:54:08.000Z",
          "Titre": "Lightning fast payments!",
          "Contenu": "The surveys are easy to take and their payment is the fastest I have seen from a survey site."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lazaro Barrios",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T23:31:58.000Z",
          "Titre": "Because it’s the best survey site I…",
          "Contenu": "Because it’s the best survey site I have found online."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "KafayatB",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T07:35:42.000Z",
          "Titre": "The reward system is nice",
          "Contenu": "The reward system is nice! We have so many options of survey."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T07:48:35.000Z",
          "Titre": "The Best !!!",
          "Contenu": "I honestly love this app. It's my favourite so far when I  need to make a quick buck."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T18:49:04.000Z",
          "Titre": "They pay out immediately unlike other…",
          "Contenu": "They pay out immediately unlike other sites that take a long time or don't pay"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:59:54.000Z",
          "Titre": "I’m earning at a faster rate than the…",
          "Contenu": "I’m earning at a faster rate than the other survey payout sites. I haven’t had a payout yet so we’ll see. But for now prime opinion is great!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:38:03.000Z",
          "Titre": "Very enjoyable",
          "Contenu": "There's such a variety of surveys and you get paid instantly"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "tina osman",
          "Nb_Reviews": 9,
          "Date": "2023-12-17T12:23:59.000Z",
          "Titre": "Very good survey site",
          "Contenu": "Very good survey site, accumulate point quickly and not many screen outs."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Anthony Allen",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T20:23:21.000Z",
          "Titre": "Prizerebel are excellent with plenty of…",
          "Contenu": "Prizerebel are excellent with plenty of surveys available and they pay the rewards quickly."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Susana F.S.",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T14:24:23.000Z",
          "Titre": "I am very happy with PrimeOpinion",
          "Contenu": "I am very happy with PrimeOpinion. Try it. Probad porque yo tengo cobro semanal. Muy sencillo de usar."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Icky",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:13:15.000Z",
          "Titre": "It is a legit website",
          "Contenu": "It is a legit website. I work on it for 1 month and took 3 withdraw and all the time they give withdraw in just 1 second. I think you should trust it."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T08:08:35.000Z",
          "Titre": "Great surveys earning website and its…",
          "Contenu": "Great surveys earning website and its very trusted website."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T02:15:21.000Z",
          "Titre": "Its a ultimate channel to grow a some…",
          "Contenu": "Its a ultimate channel to grow a some money"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "allena weber",
          "Nb_Reviews": 4,
          "Date": "2023-12-19T21:55:56.000Z",
          "Titre": "Best survey site",
          "Contenu": "There are lots of surveys.i like how easy it is to get points.i like the weekly  points giveaway.you get paid quickly as well. I like the sign up bonus.its the best survey site i have used."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Des",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T13:31:05.000Z",
          "Titre": "I really enjoy this platform",
          "Contenu": "I really enjoy this platform. It’s easier than most survey sites and they’re very clear and to the point."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carla Baslee",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T05:08:34.000Z",
          "Titre": "My favorite survey site",
          "Contenu": "Good variety of surveys and rewards paid instantly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 10,
          "Date": "2023-12-15T18:42:48.000Z",
          "Titre": "There are so many surveys available to…",
          "Contenu": "There are so many surveys available to to participate in with generous rewards when completed. Best survey on the internet."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger W",
          "Nb_Reviews": 13,
          "Date": "2023-12-20T02:12:12.000Z",
          "Titre": "Lots of surveys and can get rewarded…",
          "Contenu": "Lots of surveys and can get rewarded fast"
        }
      ]
    }
  ]
}