{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "qr.io",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GR",
          "Pseudo": "Panos",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:18:14.000Z",
          "Titre": "This is just a scam",
          "Contenu": "This is just a scam. Plain and simple. They advertise as FREE QR generator but never mention it is only for a trial period. Then they charge you 35$ per month to use your QR. There was nowhere in their site a reference about their pricing list nor did they mention anything about trial mode. I would not recommend using their service unless you are willing to pay annually 350 $."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Rich Smith",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T11:43:52.000Z",
          "Titre": "4 or 5 star reviews are yet to discover the 400 dollar catch",
          "Contenu": "Unfortunately most positive reviews on Trustpilot for qr.io have 'just created a code' or similar and are yet to discover that they will need to pay 35 dollars every month or face losing the use of the QR code. Creating and using QR codes is usually a free service without a catch. Sadly qr.io are charging more than 400 dollars per annum for the same service."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Lewis",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T06:45:43.000Z",
          "Titre": "SCAM",
          "Contenu": "This company needs to investigated on a federal level.The only positive reviews here seems fabricated and completely fake.This website presents an easy way to make beautiful qr codes. These codes link to whatever you like eg a URL. They work for a week or two and then suddenly demand payment of USD35/month. Ok fair enough they never mention FREE on their site but there pricing structure remains elusive until you hunt for it and it lets you generate the QR codes without prompt or mention.They also come up as a top hit upon googling \"FREE QR generator\". They know exactly what they are doing. Shame on you all."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Dylan Naorem",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:59:11.000Z",
          "Titre": "It is NOT FREE.. Turned out it's a 7 days trial!!",
          "Contenu": "Turned out it's a 7 days trial!Recently generated QR for an event which I thought is free to use. Once the fliers are published and shared all over, then only I realised that the QR is not working anymore. Luckily the flier had the original link and escaped from this scam."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Carl Smith",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T16:28:32.000Z",
          "Titre": "This website is a scam",
          "Contenu": "This website is a scam, pure and simple. It came top of the advertising list when Googling “Free to use QR codes”, but having embedded one of their QR codes into a leaflet, which I had printed thousands of, I discovered upon scanning it to test (which I had done many times at the proofing stage) that the code had expired and I now need to pay $35 per month to subscribe to their plan and re-activate it. Nowhere was this made clear on their website. I've used many QR code generators over the years and have never been scammed in this way before.It seems from reading many other reviews that I’m by no means their only victim, and makes me wonder how many other businesses/charities/individuals have been conned in this way, and wasted thousands in printing costs. Is a single one of their positive reviews genuine?Avoid this site at all costs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shelby Counts",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T22:59:37.000Z",
          "Titre": "This isn’t free and you will be expected to pay $35 just for your code to work. We used this for baby registry codes and now have to pay every month till the baby shower for people to get to it",
          "Contenu": "Contrary to the link and Google name this isn’t a free generator as your codes will expire after 7 days. It does not tell you the monthly charge you will need to pay until AFTER the “trial” is over which is $35 of $350 for the year.  There is also no page disclosing it’s a trial. Upon making a new link and account it’s fine print at the top after the codes already been generated and downloaded. We used this for our baby shower and now have to pay every month so people can access the code we put on our invitations. Be careful because they are not upfront with their information and now we are going to be out $100+ because of it."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "AlexH",
          "Nb_Reviews": 22,
          "Date": "2023-12-12T16:18:55.000Z",
          "Titre": "Unreasonably expensive & misleading",
          "Contenu": "Scam! They suck you in with a free trial which states that QR codes will continue to work after the trial. Guess what! They don't and you are then forced to pay an unreasonable amount of money to continue using your QR code.There are literally hundreds of free services out there, use any one of those and not this company."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Emma",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T06:09:54.000Z",
          "Titre": "Beware this is a scam",
          "Contenu": "Beware this is a scam. Advertised as free QR codes, only found out it was an expensive monthly fee once the QR codes were printed on posters. I was then unable to login to cancel the payments as an email link is required but never arrives. All attempts to contact the company were ignored. I was forced to block my bank payments instead. Miraculously I'm then sent a link which works asking me to pay.I was finally able to login to cancel via the link sent to pay, this function actually doesn't work and takes you in circles. One month later I received a second demand for funds for the account I thought was cancelled!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Mutch",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T00:42:27.000Z",
          "Titre": "Scam - be aware",
          "Contenu": "Very irrational that it advertised unlimited free qr codes. I added it our Christmas cards to connect to a virtual family newsletter. Then sent it to 50 people, family, colleagues, etc. Only to find out when my card was received it told the users I hadn't picked a plan and needed to if I were to use it. It worked before I sent it out. Then stopped working unless I signed up for an expensive monthly fee. Scam! I'll keep my subscription through December, then I'm canceling it. Don't be fooled like me!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carlos",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T19:15:46.000Z",
          "Titre": "Avoid!",
          "Contenu": "Avoid!The website is nice, lets you create a QR code very easily. It is not very clear that after the 7 day trial you are forced to pay $35 a month!!! to continue using their service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Heidi",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T18:04:55.000Z",
          "Titre": "Unclear trial period",
          "Contenu": "Unclear trial period. All the codes you generate will be deactivated if you are not paying a monthly or yearly subscription. There are free options out there. If you want to make a QR code and don't want to pay $35 a month for it, then don't use this site."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Serena Cahill",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T18:00:32.000Z",
          "Titre": "Misleading Website",
          "Contenu": "Misleading Website. Beware of hidden Charges...This is not a 'Free QR Code generator' as it states on their site. QR Code stops working after 7 days and turns out there is a 7 day trial which is not clearly stated on their website forcing people to pay 35 $ per month.QR.io your headline screams 'FREE' qr code generator which is of course completely misleading. You are offering a 7 day free trial!! This is not accurate information on your site and has caused me to waste hundreds of business cards and professional roll up posters and banners. Looking at other reviews more people also have fallen for this 'trap'."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Daniel",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T20:29:40.000Z",
          "Titre": "Absolute scam - AVOID",
          "Contenu": "Absolute scam. They pull you in with 'free qr code generator' when actually they mean free for 7days. Then it's $35 a month and until you pay your qr codes are useless. This is a predatory business model that is literally designed to scam people. The company and it's employees should be ashamed of themselves. Please note, if you are looking for TRUE free QR codes for life then just Google: 'Free QR code Adobe' and they have an excellent 100% free service that far exceeds this."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "A shocked user",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T06:41:14.000Z",
          "Titre": "misleading website. Codes stop working after 7 days unless you 35 $ per month",
          "Contenu": "After 7 days ‘free qr codes’ stop working all together!!!??? Your headline screams free qr codes which is ofcourse completely misleading. You are offering a 7 day free trial!! I shouldn’t have relied on your website but instead gone to several others who are genuinely free and don’t put people in a difficult position to get them to sign up to an overpriced subscription. I have to throw all my business cards in the bin now, which is actually cheaper to do than pay your subscription of 35$ pmThis should get listed in how not to run a business 101!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Rasa Petronyte",
          "Nb_Reviews": 4,
          "Date": "2023-12-10T22:58:07.000Z",
          "Titre": "Be careful",
          "Contenu": "Be careful! Its a scam, first they say its a FREE QR code , I made couple and printed 5000 leaflets with them on. After one week I tried to scan the code and it doesn’t work , they ask you to pay for the subscription (35$) PER MONTH !!!!! I wasted my money on ordering leaflets now they have to go to the bin, so much money wasted……."
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "Val Lazard",
          "Nb_Reviews": 5,
          "Date": "2023-12-05T06:49:22.000Z",
          "Titre": "Scammers",
          "Contenu": "Gave me a QR code, didn't say anywhere it's not PERMANENT. I printed it on my business cards and now, 7 days later, it's unusable. I mean, I just wanted a QR code, didn't care about all the perks and benefits. It's something that costs nothing to get with other sites. And now asks for 35$/month. This is ridiculous."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Alura Bht",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T06:57:11.000Z",
          "Titre": "Very misleading and expensive",
          "Contenu": "Very misleading, created a QR code and printed a bunch of business cards, the QR code didn't work after 7 days of free trial (whereas it's written that it's free and free trial is for the premium features). 35 USD / month just to be able to have my clients read my code..."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Riccardo Iacobucci",
          "Nb_Reviews": 4,
          "Date": "2023-12-07T20:34:43.000Z",
          "Titre": "Scam",
          "Contenu": "They say free qr code, then after 7 days they ask for $35 a month or the qr code becomes useless. It's a scam. There are plenty of other qr code generators that are actually free"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AndreaAndJarek Rakowski",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T06:17:38.000Z",
          "Titre": "I created a QR code under the…",
          "Contenu": "I created a QR code under the understanding that it was feee as long as it was not dynamic. But now it won’t work it aka me to upgrade to $35 a month to use it."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mick James",
          "Nb_Reviews": 6,
          "Date": "2023-11-19T13:36:51.000Z",
          "Titre": "DO NOT USE.- SCAM!!",
          "Contenu": "DO NOT USE.- SCAM!!Looks legit. Loads of positive reviews- BUT, after 7 days the QR code stops working and re-directs to a $35 monthly subscription.PRETTY EMBARRASSING AND COSTLY FOR US. We printed up a whole load of publicity material, which we distributed widely. MAKES US LOOK VERY UNPROFESSIONAL."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Teresa Fernandez Burke",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:22:45.000Z",
          "Titre": "Very complicated",
          "Contenu": "Very complicated.  Find simpler one"
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Daniel Kuptsov",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T11:35:33.000Z",
          "Titre": "Misleading",
          "Contenu": "Very tricky, misled me into thinking I could get a limited free version and keep it (for those who don't want to pay for unlimited subscription as I only needed 1 code). But actually they only have paid version after 7 days, and its quite expensive as well"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe Roddy",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T20:09:55.000Z",
          "Titre": "Thinly veiled extortion scheme",
          "Contenu": "This whole website operates a clever little scam where they:1) get user to generate a QR code \"for free\"2) user prints and distributes materials with QR code3) after 1 week (enough time for the user to distribute their flyer/business cards/invitations), QR code stops working and redirects to an extortion page saying you need to pay, or elseBy the time the week is up, it's too late to switch to a legitimate QR code generator, because materials have already been mailed.If you've been affected, you can:- report them to Stripe (payment processor) - google \"stripe fraud report\"- open a fraud claim with the ftc via reportfraud.ftc.gov"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gordon",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T06:20:41.000Z",
          "Titre": "An unbelievably scummy site",
          "Contenu": "An unbelievably scummy site. They sneakily change your QR code to a \"redirect\" style, and nowhere on their page do they explain that after 7 days the redirect will stop working, then they want $35 for a MONTH, for a service that you can get elsewhere for a fraction of the price. It's a horrible business model that only survives by tricking people into becoming customers. PLEASE go ANYWHERE else."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nico",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T20:34:29.000Z",
          "Titre": "IS NOT FREE. DO NOT USE",
          "Contenu": "Like the majority of the legitimately written reviews... this is a thinly veiled scam, no where is payment mentioned as they let you create a qr code \"for free\" until a week after you've generated and wasted money on marketing materials. I'd rather pay double and reprint everything then pay this deceptive business"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J A",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T04:33:52.000Z",
          "Titre": "Complete SCAM",
          "Contenu": "I needed to create a simple QR code for wedding invitations. Their website claimed to be completely free until we realized that all the weddings invites we sent out had a broken QR code, and now we are FORCED to pay $35 a month for the next 6 months. Avoid this website and use QRCode Monkey instead, for an ACTUALLY FREE QR code."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Noma",
          "Nb_Reviews": 13,
          "Date": "2023-11-30T17:59:06.000Z",
          "Titre": "Dishonest",
          "Contenu": "I generated QR codes which I was just about to use in a book I was putting out to print, only to find out that your site is not free to use and that I was on a 7 day free trial. Honesty would be appreciated up front to let users know that your site is a trial site. That way they wouldn't waste precious time.I got the same quote from Adobe for free. Please don't waste people's precious time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sadie Ricci",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T16:53:25.000Z",
          "Titre": "This company is a SCAM",
          "Contenu": "This company is a SCAM. I don’t know how they have so many positive reviews, but they are an absolute scam. They are NOT FREE despite actively marketing themselves as such. I am not nearly as impacted as the NGOs and others who have shared their poor experiences, but it has severely affected my business as well. There are multiple truly free ways to generate QR codes, you absolutely DO NOT need to be paying $35/month for the service, and you SHOULD NOT have to pay if they’re holding your already generated QR codes hostage."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ms Ariadna Danilova",
          "Nb_Reviews": 3,
          "Date": "2023-11-15T14:23:53.000Z",
          "Titre": "I feel like I have been mislead",
          "Contenu": "When creating my codes, this was not made obvious at all that unless I pay over $30 p/m the codes would stop working after 7 days. So having already printed my codes on a product, I find out that the codes do not work after 7 days. I am not going to pay $30 p/m when I can create QR codes for free on Canva. This looks like a good tool but very overpriced, and I do not appreciate being mislead like this into paying for something."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anine Colaire",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T16:39:23.000Z",
          "Titre": "Quite the little scam",
          "Contenu": "Yep, like others I thought I was making a static QR code because that's all I needed, but this website defaults to dynamic without telling you. Then, you must pay $35 a month (far, far too much for one code) in order for the code to keep working. Fortunately, I only mailed out a few items, so I made a new code on a free site and stickers to go over these expensive codes. Horrible business.UPDATE: after posting this review and contacting customer support, they offered me a plan to keep my code for $9 a month. So now that I have a premium plan at a more reasonable price, I see there is STILL no way to create a static code. Even though they advertise you can do both dynamic (needs subscription) and static (no subscription needed), they actually only allow you to create dynamic QR codes for which they can charge you. Buyer beware."
        },
        {
          "Note": 1,
          "Lieu": "HR",
          "Pseudo": "38Monkey",
          "Nb_Reviews": 42,
          "Date": "2023-11-07T12:15:40.000Z",
          "Titre": "As many of the other reviewers have…",
          "Contenu": "As many of the other reviewers have said, this is a scam. I work for a charity and used QR.io to generate a QR code to include on a brochure. A week or so into the project (after I got some brochures printed) I received a notification saying that I needed to pay $35 a month to reactivate the code. Why so much when I can get the same service elsewhere for about $5 a month? So, I've printed some stickers to go over the QR.io versions and will never again touch the services of this unscrupulous company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 4,
          "Date": "2023-11-18T19:45:30.000Z",
          "Titre": "These are NOT free QR codes and it's…",
          "Contenu": "These are NOT free QR codes and it's pretty embarrassing when you create a dozen flyers using one of these QR codes, because after a few days of \"free\" clicks, everyone that scans it will be prompted to give money to qr.io.  It's so gross."
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Fabian Hattke",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T15:13:30.000Z",
          "Titre": "Scam: abduction, extortion",
          "Contenu": "Hands-off! They first let you create a \"free\" QR code (just asking for your email address), but after a week or so, the link is being redirected to another page - unless you buy a paid subscription for 350 USD a year. This is criminal activity!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "lou machugh",
          "Nb_Reviews": 3,
          "Date": "2023-11-14T15:55:23.000Z",
          "Titre": "'Bulk creation' feature does not work",
          "Contenu": "'Bulk creation' feature does not work. I spent an extra 40 minutes trying to get it to work, and I did not have time for that. I exported it in the required format, and it kept telling me 'invalid format'. My file and the example looked the same. I had to play detective to figure out how to format it because the example does not make this obvious. I have work experience in Product Design & Management, and I am shocked that this feature made it live, as it does not work. These issues should have been spotted in testing and resolved before the feature was pushed to live. Lazy product work results in frustrating products, and this is a prime example"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Keary Suska",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T07:27:14.000Z",
          "Titre": "Unethical Bait and Switch",
          "Contenu": "They talk about free QR codes and when you create a code it falsely shows a QR code that goes to your desired site but then when you try to download it makes you create an account and re-create the QR code to something that routes through their site, which means the QR only works as long as you pay them."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Pia Aaes Møller",
          "Nb_Reviews": 16,
          "Date": "2023-11-07T08:09:37.000Z",
          "Titre": "What a piece of scam",
          "Contenu": "What a piece of scam! I ust generated a smart and pretty QR-code. I LOVED the options for design. Then, about a month later, I get the option of paying for it - after I printed it on my marketing material! It's very obvious that their marketing-scheme is to just pressure people to buying their insane expensive service for 35 UDS a MONTH?! (Or 350 a year, but honestly that doesn't seem like a bargain). I feel really betrayed and hurt that it has to be THAT expensive, cause I'm not above paying for a service. I found others that offer the same thing for 5-10 dollars a month and a better annual deal than this is. Please not fall for this trap!"
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Fabio Sarto",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T12:23:20.000Z",
          "Titre": "You ran out of the 7-days free trial.",
          "Contenu": "You ran out of the 7-days free trial.Please, upgrade to the basic plan to get a precise review and improve your system.Only 35 USD for a concise review report.Jokes apart: the service is not what users expect and it doesn't seems to worthy the subscription. There are cheaper and more convenient alternatives on the market. :-)"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Adam",
          "Nb_Reviews": 4,
          "Date": "2023-11-22T14:34:09.000Z",
          "Titre": "Clear issues with Bulk / Batches",
          "Contenu": "1) Bad but minor - the bulk upload is clunky - would be easier and less work for most people to upload data in different columns rather than \"semicolon delimited\"2) Good - you can sort QR codes into folders3) Bad - no bulk download of QR codes or bulk download of a folder - so after a bulk upload - lots of clicking and risk of human error when you download. Facepalm4) Bad - when you download - the platform removes any dashes or underscores in the file name  - so all names are a long string - this makes it more difficult for clients to easily see what's what5) Really Bad - Logos in the QR codes can disappear - e.g. if you download a .png or .svg and then want to move the file elsewhere - it loses the \"properties\" - this makes it very poor when sharing with third parties. @ QR.ioI'm happy to be corrected on the above - but your help section is also very poor - there aren't even search results for \"upload\", \"download”, “batch” or \"batch\"In QR.io's defence - I don't understand the 1 star reviews for the \"free 7 day trial\" - the FAQs clearly state the QR codes will stop after that."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Aaris Sooch",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T01:18:03.000Z",
          "Titre": "A subscription to even scan the QR code…",
          "Contenu": "A subscription to even scan the QR code I am never making QR codes from you and even if somebody uses you I am asking them to stop using ur QR code make there are beater QR code makers out there 😡😡😡😡😡😡"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kris",
          "Nb_Reviews": 24,
          "Date": "2023-11-07T13:00:09.000Z",
          "Titre": "Very clever SCAM",
          "Contenu": "Very clever SCAM! I found them after Googling Free QR Code Generator and created a QR code, which I then added to 250 leaflets I then ordered. I then got an email to say my 7 day free trial had ended. Throughout the process, there was no mention of a free trial or pricing so the QR code I designed, as well as the 250 leaflets I added it to are useless.I've gone back on the website and there really is no mention of a free trial or price, so please don't get stung like I did!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John T.",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T22:37:34.000Z",
          "Titre": "Bait and Switch",
          "Contenu": "They leave you with the impression that you get a free QR Code for the link.  However, what they actually do is charge you $350-420 ***PER YEAR** and lock you in by making the QR codes they generate go through a *SLOW* (> 15 seconds) link rerouting site they own and therefore can track who uses the QR code and lock out anyone who does not pay their ridiculous fees.  SCAM!  Avoid!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Danny S",
          "Nb_Reviews": 2,
          "Date": "2023-10-29T14:19:24.000Z",
          "Titre": "False advertising",
          "Contenu": "Advertised on Google as a free QR code service, but after  days it will break your links and and request that you pay $35 per month to re activate the links. Not only is this QR service obscenely overpriced but they deliberately hide the fact that their will be any fee system when you sign up and create a QR code."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Tyson Haseltine",
          "Nb_Reviews": 7,
          "Date": "2023-11-25T20:00:16.000Z",
          "Titre": "just a scam",
          "Contenu": "just a scam. Does not generate a personal QR code but creates a code to advertise their own services. WASTE OF TIME!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Gary",
          "Nb_Reviews": 15,
          "Date": "2023-10-20T17:47:03.000Z",
          "Titre": "Unable to cancel account after trial",
          "Contenu": "Unable to cancel account. One of those 'try us for free' websites but when it comes to cancelling your trial the delete account sections fails, and is also craftily hidden from view.Had to block their constant emails and report as spam."
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "AJ Davis",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T16:53:39.000Z",
          "Titre": "A bit deceptive",
          "Contenu": "After creating my QR Code, I decided to read up on other people's experience with the service, and I'm glad I did. I found that the codes stop working after a few days. That's terrible. It would seem like they are banking on people creating their business cards, flyers, etc., and subscribing in an act of desperation when they find all of their printing and graphic design work is suddenly useless.They should really let people know ahead of time. Maybe less people will impulsively use the site, but at least those who do won't be mislead."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "NS Biker",
          "Nb_Reviews": 5,
          "Date": "2023-11-11T06:38:16.000Z",
          "Titre": "20 minutes of futsing around and no…",
          "Contenu": "20 minutes of futsing around and no further ahead.Instructions seem a bit .... weak to say the least.Maybe it doesn't work, but I doubt that.  Just frustrating trying to do this with no background or experience with the system."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "RCR",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T13:55:45.000Z",
          "Titre": "Need full disclosure uofront",
          "Contenu": "I am giving this a 1 star mainly because it is only after I created an account did it become clear to me that this was a free trial. I would bypassed this app entirely if I had known. I only occasionally use a QR code and therefore it doesn't make sense to pay for an account."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Geoffrey M",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T18:24:22.000Z",
          "Titre": "QR code will expire unless paying for an account",
          "Contenu": "I had to change my review after realizing I paid and printed for 500 business cards that needed to go out on a rush order. I didn't have time to look up the company and assumed initially the QR code I created will continue to work after my trial. What a disappointment, waste of time and money. I spent $200 on business cards with a QR code that will stop working."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christopher Harrell",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T05:28:30.000Z",
          "Titre": "Create \"Free\" QR code and then Hold it Hostage Behind Paywall after 7 Days",
          "Contenu": "DO NOT USE!  Really unethical business practices here.  They offer that you can generate QR codes for free for seven days, but they don't tell you that they will suddenly be deactivated and held behind a subscription paywall at the end of seven days only after you've printed your QR codes and printed your flyers and materials with them.  Our youth group is raising funds for Ukrainian refugees in Poland and I needed a QR code for the fundraising materials.  After seven days and after sharing all the flyers with the youth to fundraise I received an email from QR.io saying that I would need to now subscribe or the QR code will no longer work.  I contacted customer support and they said they could not help me but offered a discounted \"subscription.\"  No thank you.  Stay away!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jack Rice",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T15:56:16.000Z",
          "Titre": "Absolute rip off !!!",
          "Contenu": "Absolute rip off !!!Most providers including adobe give lifetime free qr codes but these guys feel the need to charge £300 a year !!! I generated a code as it said they were free and when my business cards arrived which cost £40 it said I had to pay £300 for a year to re activate my code - fair enough if you had clearly stated you will have to pay but your website says “ free qr code “ which is incorrect and now I am heavily out of pocket . Very dissatisfied with your company"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Chobi Netwibe",
          "Nb_Reviews": 3,
          "Date": "2023-11-20T15:31:18.000Z",
          "Titre": "scam !!!!",
          "Contenu": "scam. You make qr code for free and when printer printed  bags, code redirect to the there site asking to pay it for to be activated."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LMA",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T23:09:19.000Z",
          "Titre": "Wouldn't use again",
          "Contenu": "Wouldn't use again. Created a design with their free QR tool, but in order to download, it's required to create an account. This deletes the design you just made. I had to create the design 5 times to get to a download, and it now says 7 day free trial. I'll use another free service next time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LocalCharity",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T18:40:14.000Z",
          "Titre": "SCAM",
          "Contenu": "This company advertises free QR Codes (trial) with little information regarding what happens to the codes generated after the free trial.  We have yard signs that were meant to be used ANNUALLY (i.e. an investment) with a QR code that no longer works unless one has the budget to cover 35/month or 350 annually.  Really?  What organization looking for a free QR code to use for a charity event would have an extra $350 laying around?  Deceptive, and ridiculously expensive for what you get.  If it were $5 a month to cover using it, well, that would make sense for the little you receive in return."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Mikkel",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T08:33:29.000Z",
          "Titre": "SCAM COMPANY",
          "Contenu": "SCAM COMPANY - DO NOT USEFirst of all, I just scrolled through the reviews here on trust pilot and most 5 star reviews are made from profiles with one review history- that should be a major red flag.Usually I’m pretty aware, but I guess you do slip and fall sometimes. In a hurry I generated a QR code for a business card. Keep in mind that a QR code is a completely free thing to generate and should not cost ANY money!Accidentally I generated what qr.io calls a dynamic QR code. This comes with a 7 days trial period and after that it’s crazy expensive. At no point during the generation was I informed about the trial period nor the price. It wasn’t clearly stated that I was generating a “dynamic QR code”Now it’s printed out and completely useless. I reached out to the company and they offered a one time payment to “activate” the code. This is a completely scam for something that is free.I don’t need to change the code or use any “features” just needed it to work.I refuse to pay for something that’s FREE and rather get new stuff printed, with a new QR code, then pay money to this scam of a company.With all the missing information about this “product” before generating a code I think this “company” should probably think them self happy any the fact that they are not based in the EU.STAY AWAY"
        },
        {
          "Note": 1,
          "Lieu": "AT",
          "Pseudo": "Paul Holler",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T23:01:36.000Z",
          "Titre": "I quit my trial in time - still got charged 35$ !",
          "Contenu": "I have registered my qr.io account on Sept. 29th and quit my 7-day free trial a couple of days later. Unfortunately, the company still charged 35$ from my bank account, which is unacceptable."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Gustavo Monteiro",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T09:13:46.000Z",
          "Titre": "I've cancelled the subscription 4…",
          "Contenu": "I've cancelled the subscription 4 months ago but keep getting billed every month. I`ve contacted customer support twice and nothing has been solved.THIS COMPANY IS A SCAMEDIT: they have contacted me in september and told me it was finally cancelled. A month later, now in October, I got billed twice. This a damn joke."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Habeebat Umeike",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T02:56:53.000Z",
          "Titre": "VERY MISLEADING",
          "Contenu": "I just deleted my glowing 5-star review. At the time I created the code, everything pointed to the service being free...nowhere did it mention it was for a 7-day trial period. I was horrified when I scanned the code after I'd rolled them out in a published work and the link took me to their website! I went back to the sign-up page, thinking I must've missed something, but it was the same false advertising, tricking people into paying for a subscription after the fact.I'm leaving this review because this shady business has the potential to cause some serious damage, especially if you're not looking to commit to a long-term subscription plan.The service itself is stellar, but I just can't get behind tricking people out of their money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alexandria Mackelprang",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T18:15:04.000Z",
          "Titre": "This is a scam!",
          "Contenu": "This is a scam! We used a code generated by QR.io on printed materials, nowhere during this process do they warn you that they will deactivate your QR Code if you don't pay them after a week. We lost sales and ended up having to pay $30 just to keep the code functioning. DO NOT USE QR.io!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T03:50:37.000Z",
          "Titre": "Free, but only temporarily",
          "Contenu": "I love that it was apparently a free app, but after 7 days the app no longer worked without paying a large fee for it.  It was almost like they had you over a barrel, because once you’ve distributed this QR code, you either pay their fee or have to change all your marketing.  I would not recommend."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paddy Green",
          "Nb_Reviews": 3,
          "Date": "2023-07-24T20:59:19.000Z",
          "Titre": "No way are these reviews legit, this is a SCAM",
          "Contenu": "There is no way the reviews for this product are legitimate. This website acts like the QR codes are free, then after a week deactivates them and demands an insanely expensive subscription.Naturally, this all happened after we'd got the posters and flyers for our event printed. Absolute disgrace."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-08-08T23:50:37.000Z",
          "Titre": "TOTAL scam",
          "Contenu": "EDITED to say they provided a satisfactory resolution.TOTAL scam. if they had been transparent about a fee up front, I probably would have just paid it. Instead they present lke they are free and gve you enough time to distribute the code and then lock it, forcing you to upgrade to a $35 / month fee, wasting any money you spent on printed materials."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Megan",
          "Nb_Reviews": 3,
          "Date": "2023-11-06T19:31:36.000Z",
          "Titre": "Idk why but my account was deleted and…",
          "Contenu": "Idk why but my account was deleted and now I can’t use QR codes. Trying to open my account again and the website is soooo confusing it doesn’t help at alll!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joy Inn",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T09:46:20.000Z",
          "Titre": "Extortion?",
          "Contenu": "The site advertises \"static code will remain active after trial period.\" I spent $150 on cards, flyers etc, believing my code would still work after a week. I just tested it out today. It's been a week since I created it- and it's blocked. They want $35 a month. I was on their Facebook page. People report a similar experience to mine. They also report difficulty stopping the subscription.I reached out to the company. Waiting to hear back. I'll be throwing out all my print advertising and starting with another company. I feel extorted by this company.11/16 Response: They replied to my email. They offered me a lower amount per month.   I don't need to know how many people click through the code.  I don't need to make multiple new codes a month. I need to keep my costs under control. The promotional items I bought will last me 3 to 5 years.  The interface to make the QR codes is fantastic.  They have managed to be the top of all search engines. I wasn't impressed with their response to me as a consumer. The website still has not cleared up the poor communication. It is not yet managing expectations to a degree most people will be able to use the service without problems. I would recommend people use another site.  I was not impressed with their follow up with me.11/17/23 Another response: Yesterday morning, after my TrustPilot complaint, another person from the company reached out to me.  Said they would activate my account for life.   I didn't check it yesterday but I checked it this morning.   It's not on."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "honesty",
          "Nb_Reviews": 4,
          "Date": "2023-10-03T18:10:51.000Z",
          "Titre": "nice interface but sadly unusable",
          "Contenu": "nice interface but sadly a classic \"lock-in\" strategy. They generate a free code and ask for money once you want to start using it. Go die with your greedy capitalist attitude!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kyle Powers",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T00:22:08.000Z",
          "Titre": "not an honest company",
          "Contenu": "not an honest company. said nothing about a monthly subscription until i ordered 250$ worth of business cards and now you want 35$ a month? Eat s&%$."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "william Li",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T22:38:23.000Z",
          "Titre": "SCAM SCAM SCAM",
          "Contenu": "words can't even describe what just happened, this site claimed to be a \"free business card generator\" yet a week later I get an email that \"my free trial expired\" and that I would need to pay 35 USD a MONTH just to have my code working, I already printed business cards.... NEVER USE THIS"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Megan Clifton",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T08:12:30.000Z",
          "Titre": "Avoid",
          "Contenu": "There is no way this company should be allowed to operate. They are a scam who back you into a corner by giving you a \"free code\" but when someone goes to use it 7 days late it is inactive and you have to pay to reactivate it. This financially damaged our non for profit sports club."
        },
        {
          "Note": 1,
          "Lieu": "ID",
          "Pseudo": "Dinda Khairunnisa",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T18:48:28.000Z",
          "Titre": "NO TRANSPARENCY FOR $35 PER MONTH! TOTAL SCAM.",
          "Contenu": "There's no way they received such high ratings here, as you can see – most 5-star reviews are recent and might be ordered by them. We used their website last year for a non-profit organization building a school in Africa and then suddenly it charged us USD 35 per month for people to be able to scan our QR (now it is directed to their site). Mind you, we have printed thousands of business cards to gather donations. I hope their CEO/Founder reads this so they know how UNETHICAL their business is and it should be categorized as a scam. They never made it transparent that you had to pay for their service and there is no way their service is worth USD 35 per month. We don't need analytics or fancy frames, we only need QR codes."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Issy Britton",
          "Nb_Reviews": 4,
          "Date": "2023-10-15T19:19:43.000Z",
          "Titre": "Lack of transparency has meant we're now struggling to balance our wedding budget",
          "Contenu": "Generated a QR code for my wedding invites; we did this because it was a free QR code and it meant we didn't need to spend a fortune (or hours of emailing or money on extra info invites) to get the details of our wedding out. The QR code worked before I ordered my invites so I ordered them. As soon as my invites arrive (which cost enough in their own right), the code stops working and they want £28 per MONTH to reactivate it. When I set this up, there was no clear information about having to subscribe to keep it open. It is also 3 times more expensive than most of its competitors. I now have to create a new FREE QR code with another company and reprint all of my invites which is a cost we cannot afford. I am absolutely devastated by this as we have a very tight wedding budget and have tried to do everything ourselves. There is so little transparency with QR.io. It is a complete con and now I am back to square one."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Craig Rich",
          "Nb_Reviews": 3,
          "Date": "2023-07-16T17:44:35.000Z",
          "Titre": "Be warned, this isn’t free as advertised.",
          "Contenu": "Found QR.IO by searching for “Free QR Code generator”. Set one up for a charity / just giving page which was laser printed onto wooden medals for a fund raising running event. I had no message to say the link had expired and it now resolves to an error page. I can either pay $35 per month or have the error and no-one can donate to the charity. At no point on the creation page or the welcome email does it warn you of this, otherwise I would have chosen another service that wasn’t designed to entrap people into paying. Terrible."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Sam",
          "Nb_Reviews": 3,
          "Date": "2023-10-10T16:22:08.000Z",
          "Titre": "SCAM!",
          "Contenu": "SCAM!! stops working after 7 days and they you're stuck being billed stupid amounts of money. \"free qr code\" is a lie, and a scam. Their responses on Trustpilot are also the same generic thing, no care for customers."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "RIP GTBSG",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T13:55:09.000Z",
          "Titre": "Missleading business practises",
          "Contenu": "Recently, I had the unfortunate experience of using Qr.io for my business needs, and I am compelled to share my dissatisfaction. Initially, the service seemed promising, offering the creation of QR codes, which appeared to be free. However, this turned out to be misleading. Major Issues:1. Deceptive Pricing: The QR code I created was deactivated after 7 days, revealing a hidden catch - a subscription fee of $35 per month to keep it active. This pricing is exorbitant, especially considering the basic nature of the service provided.2. Poor Customer Service: My attempts to address this issue with their team were met with indifference. Instead of acknowledging their deceptive practices, they offered a slightly reduced price of $12/month or a one-time purchase of $50, which still didn't justify the value.In conclusion, Qr.io's service was not only disappointing but also seemed to employ questionable business practices. The hidden costs, lack of proper customer support, and overall approach to business are concerning. I advise potential customers to be wary of these issues and consider other more transparent and cost-effective options available in the market. Rating: 1/5 - Highly Disappointing"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Steph Reid",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T22:01:03.000Z",
          "Titre": "Have been charged without any email…",
          "Contenu": "Have been charged without any email notification for months and there is no way to unsubscribe."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mrs. Y",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T17:34:38.000Z",
          "Titre": "Absolute scam",
          "Contenu": "Absolute scam. There is no way the five star reviews for this company are legitimate. Offered free QR code generation, made no mention of a trial in which QR codes would be deactivated after just a week, then held the QR codes hostage, forcing a $35/month subscription to unlock the already generated QR codes. I used them for a client of mine and now their marketing material is unusable. Deplorable practice."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Amna Bakhtiar",
          "Nb_Reviews": 4,
          "Date": "2023-08-06T18:56:45.000Z",
          "Titre": "Scam - AVOID",
          "Contenu": "Scam. There’s no transparency when you are creating their supposedly free qr code that it will deactivate after a week and to keep using it, you have to pay 35 USD per month. This happened after I’d printed all my posters and flyers for my festival show. I was trapped. Which is what this company relies on to keep their scam going. I hope they shut down. And there’s no way anyone gave them legitimate positive reviews. Horrendous business. Evil."
        },
        {
          "Note": 1,
          "Lieu": "FI",
          "Pseudo": "Jenny",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T14:06:29.000Z",
          "Titre": "What an absolute scam",
          "Contenu": "Advertised as free so I went and printed the code on my business cards only to realize when they arrived that the code doesn't work anymore unless I pay for a subscription which is outrageously expensive for something I can create in InDesign and have that work for forever. Absolute scam and waste of time and money!! I'm left extremely irritated."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Paula",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T15:07:23.000Z",
          "Titre": "Misleading",
          "Contenu": "Misleading. They make you automatically start a free trial, no credit card information required. It looks like a way to present special features, but I never thought the qr code itself would stop working. Now I have material with the code in it and feel like I've been charged \"ransom\" to have the code back working."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Elena Zwetsloot",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T09:12:21.000Z",
          "Titre": "QR code stopped working after a few days",
          "Contenu": "I’m the owner of a small Pilates studio and I created a QR code for some flyers - after a few days it got disconnected and so all those flyers went out for nothing. I feel ashamed that I didn’t even know that I would be scammed into having to buy a monthly membership for one QR code.There is no option to buy one Code but all they want is you to pay 35 dollars to create codes - I only needed one. I feel tricked because if I would have known, I would have never got it done with them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "kemtis",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T07:23:29.000Z",
          "Titre": "This is a scam",
          "Contenu": "This is a scam.  They offer youwith a free trial without really give you the notion that QR code you generated wouldn't work unless you paid for the hefty price"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Michelle OnYouTube",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T05:35:09.000Z",
          "Titre": "Please dont use QR.io if you are…",
          "Contenu": "Updated - Also to note, all comments made on the negative reviews are the same, generic and non personalised.Please dont use QR.io if you are looking for a free QR code.Had an awful experience, as you may read here, the 'free' QR code is actually a trial, which isnt detailed - no 'read more' options or 'further info' when signing up. I feel this actually needs to be reported, maybe when I have time I will. But I came on here to see if I had missed anything. I hadn't. I got in touch with them as I had generated the QR added to WEDDING INVITES and had them printed! They offered $12 a month to keep the QR code active (bearing in mind the wedding isnt for another year!) or a one off fee of $50 for the purchase of the QR code. Both of which seem incredibly unreasonable when I signed up for a FREE QR Code (without any other info!)Off I go to find a genuinely free QR code..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aleda",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T03:36:05.000Z",
          "Titre": "Claims to be free so you use them for a…",
          "Contenu": "Claims to be free so you use them for a QR code and then a week later deactivates it and asks you to pay $35 to reactivate. Very scammy. Does not tell you this upfront. Wasted money using them, now have to reprint to avoid ridiculous fee. Absolutely won't give them my money"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 4,
          "Date": "2023-06-30T07:17:22.000Z",
          "Titre": "Scam company",
          "Contenu": "Scam company! As many others said, the \"free\" qr code will expire in 7 days and they will ask 35 dollars per month to reactivate it.  Most likely you will have printed it on your marketing material and they know it. What a disgusting strategy to get costumers! At no point it was said I was entering a free trial. This is misleading and I will report it to treading standards.I'd rather remake my posters than paying you a cent!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tiffany",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T16:21:25.000Z",
          "Titre": "Charged double the listed price and customer service is unresponsive",
          "Contenu": "Edited on Thursday, October 26 to add - We have continued to try to reach Lucy and still no response._____Edited on Wednesday, October 4 to add- Lucy was contacted per the standard copy-and-paste response from QR.io and have yet to receive a response.____We have contacted customer service via the provided email 4 times over the past 3 months and no one will respond. We have provided a phone number and no one will call us. We can't call them because they do not have a published phone number.The card they continue to charge has not been on file for 2 months and yet they keep charging it? We paid $350 for the annual subscription. The QR code was paused briefly (less than a month). When it was reactivated we were again charged the $350 yearly rate. Bottomline - Customer Service is unresponsive and they will continue to charge your card. We've been charged $700 for the annual ($350) subscription. I do not recommend QR.io. If I could give them a zero, I would because they have provided zero support."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Marie",
          "Nb_Reviews": 2,
          "Date": "2023-06-08T16:32:18.000Z",
          "Titre": "BE CAREFUL!!",
          "Contenu": "BE CAREFUL!!! After you 7 days trial, all the QR code you created will been keep on their website without any acces to delete them!I needed several days and several emails and chats before someone answered me and listened to me.Deactivate me, I have no problem, keeping my information against my will is unacceptable!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jacob Foster",
          "Nb_Reviews": 3,
          "Date": "2023-08-18T21:50:26.000Z",
          "Titre": "Absolute scam",
          "Contenu": "Exactly same as other reviews, labels \"free qr code\" to print 1500 cards and then have to pay extortionate amount a month to have a qr code. Absolute scam preying on vulnerable people trying to make a living."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Richard P",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T16:25:55.000Z",
          "Titre": "I thought I had created a static QR…",
          "Contenu": "I thought I had created a static QR code to include on some business cards. In fact I had created a 'dynamic' one that stops working after 7 days unless you pay $30 a month. Total con."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Katherine Thorpe Katherine",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T19:49:01.000Z",
          "Titre": "Scam Generator",
          "Contenu": "This is a scam. After 7 days the QR code becomes paused and they want you to pay 35usd a month to get it back. Printed 100 useless business cards with this code. Go use a generator with integrity and basic decency."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "anon reviewer",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T21:35:00.000Z",
          "Titre": "FAKE ADVERTISING & SCAMMING",
          "Contenu": "FAKE ADVERTISING & SCAMMING: Advertises as a free QR code generator then tries to scheme you out of money 7 days later. I used this because it was advertised as free. Created my QR code, printed it out on flyers, and handed those flyers out. Only after 7 days did I find out that my QR code was deactivated and I had to pay up to keep it active. This puts people in a horrible position: Do I just pay up so the hard work of printing and giving out the flyers doesn't go to waste? I contacted customer service asking them kindly to just extend my free trial for a few more days just until the day of my event. Mind you, this \"free trial\" I didn't even know I was using because they do not tell you you are in a trial and must pay $40 after. Customer service refused to extend my free trial and/or help in any way or form. BEWARE - avoid at all costs. Go use any other free QRcode like bitly etc."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Annabel",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T10:50:47.000Z",
          "Titre": "I used QR.io to create a QR code for a corporate partnership",
          "Contenu": "I used QR.io to create a QR code for a corporate partnership, and at no stage was it made clear or obvious that the code was part of a free trial and that it would be deactivated almost immediately without payment. Clearly, this setup is designed to place users in a bind where they need to sign up, or risk their project being ruined (QR codes are usually used for print). I would have considered a subscription had the communications around this been more clear, but the experience has entirely put me off."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Kathe Lemon",
          "Nb_Reviews": 3,
          "Date": "2023-08-26T18:37:02.000Z",
          "Titre": "Qr.io extortion",
          "Contenu": "Qr.io presents itself as a free qr generator. Then seven days later turns off the code to extort money from the user. These are underhanded business practices. Don’t trust them."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Bruchy K",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T11:08:06.000Z",
          "Titre": "This site is not free, don't let yourself be scammed.",
          "Contenu": "Hi, I used this site to generate QR codes for business cards without realizing after the 7 day free trial they would be deactivated unless i pay the high monthly or annual fee. The business cards have already been printed and distributed and my only option is to let myself be scammed and pay.What really shocks me is seeing all the reviews and how many others have been scammed like me, and this website has STILL not been changed to make it clear that after the free trial you need to pay a subscription or your codes stop working and are useless.A good option would be to let customers pay a one time fee to buy single QR codes they have already used."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Axel Becerra",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T17:49:27.000Z",
          "Titre": "Poor service.",
          "Contenu": "I made a qr code through your website and it doesn't work anymore, I've contacted you for assistance and have not heard back."
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "QR QRUSHED",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T15:38:54.000Z",
          "Titre": "WARNING: YOU ARE GETTING A TRIAL",
          "Contenu": "This is the sort of backwards, unethical, and deceptive marketing that I hate most about companies. At no point during the sign up process are you informed you are creating a \"free account\" for a 7 day trial. After the trial expires you are left with nothing, your QR codes are held to ransom, and so if, like me, you've used them for a business card... Well pay up, or get some more business cards. At $35 a month, the \"premium\" features of 1) Having the ability to HAVE a QR codeand2) Adding a little picture in the middleis extortionate, leading me to believe that this company runs off the ransom model I mentioned earlier.Avoid.Disclaimer to avoid a \"The notice was there\" message: When you RETURN to your dashboard, but not when you first enter it, a banner does appear telling you you are on a 7-day free trial. But a free account with no features is just an email address on somebody else's list."
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "Msstuf Sub",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T22:28:01.000Z",
          "Titre": "SCAM! Extortion",
          "Contenu": "Please read this before trying this website!!!!!!!!!I am absolutely disgusted by this company. So shameful, can't describe it any other way. You register, all seems great, you create your QR codes, NOTHING AND NOWHERE says it is trial only and that after 7 days you'll have to pay crazy amount of money to keep your QRs active. So you print out your marketing materials and boom - after few days you'll get an email about paused QR codes (they are not working!!!!) and required payment. Tell me how this is not an EXTORTION. I'm so disgusted I can't describe it with words. I saw a lot on internet, but never a website taking such an advantage of people. Please report this anywhere you can, this is the only way to stop them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T19:03:15.000Z",
          "Titre": "Trash - The QR Code Download is just an empty…",
          "Contenu": "The QR Code Download is just an empty file.  This was such a waste of time and now I'm probably on some stupid mailing list, like I don't have enough junk emails."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Bertus",
          "Nb_Reviews": 3,
          "Date": "2023-06-27T16:05:07.000Z",
          "Titre": "Scam",
          "Contenu": "It was never stated that the QR code would expire after a few days if you don't get an expensive membership. I have printed business cards with a QR code that will expire, meaning I have no choice but to pay, which is impossible for me because the only option is by creditcard.."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Graham",
          "Nb_Reviews": 4,
          "Date": "2023-11-25T11:37:46.000Z",
          "Titre": "$35 A Month to keep code active.",
          "Contenu": "Just like the others said. I've paid for a pop-up banner and 600 flyers with their qr code on. Now they want $35 A MONTH!!! to activate it.b"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Chris Dixon",
          "Nb_Reviews": 5,
          "Date": "2023-08-30T18:39:49.000Z",
          "Titre": "Created a QR code for a client's…",
          "Contenu": "Created a QR code for a client's business card as the QR code was advertised for free.Got the cards printed. QR code not free, it doesn't work. Forcing me to subscribe to monthly payment.QR.io has wasted £100 for me based on false advertising.Not great for a self employed marketer like me."
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "Yoga-Shop-Online GmbH & Power-",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T00:17:47.000Z",
          "Titre": "wasted time for nothing",
          "Contenu": "I try to create a QR Code. I found it extremely annoying, first you do all the work, set everything up, (design, Contact, Profil and some Conten) then all of a sudden you have to log in, do everything again, because it just disappear and then you find out that it's only free for 7 days and then costs 35 USD per month, unless you don't use it anymore. If I had known that from the beginning, I would have logged in somewhere else. I was searching on Google for \"design QR Code for free)  and I wasted time for nothing so that I could start again from scratch somewhere else. Thank you very much."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Chelsea",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T00:53:28.000Z",
          "Titre": "Impossible to cancel your subscription",
          "Contenu": "Impossible to cancel your subscription. The \"verification email\" doesn't actually send to your email so you are unable to cancel and they will keep charging your credit card. Do NOT use their service."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Nat PW",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T11:13:41.000Z",
          "Titre": "Free trial out to trick people!",
          "Contenu": "Unfortunately as with others I failed to spot the 'Free Trial' element that was not mentioned to me at any stage in the creation of my QR code. It was only when I got emails just over a week later saying my free trial had ended that I realised this and that my QR code which needed to be active had been deactivated.When you read the FAQs it tells you there is a difference between dynamic and static QR codes, and that only your static codes will stay active after the free trial. When you set up a QR code, the option to choose a static code is hidden at the bottom of all of the options in greyed out text which I only found when I went back in looking for this option. It doesn't even look like an active link.Definitely a company that are out to trick people and not clear in their options up front. Have rated 2 as the QR code itself does work well. I've very reluctantly paid for a month to keep using the QR code which I need for a short while but will then be cancelling and never using again."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Barbora Bajuska Jedina",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:58:12.000Z",
          "Titre": "IG link won't work",
          "Contenu": "I woould give 5 stars, but I have been \"fighting\" with the app all evening long. Whenever I put Instagram link, upon clicking on it it says, the page doesn't work. TikTok link on the other hand doesn't redirect me to the profile, but only to the main page. The only link that works is Facebook. Fix the bug pls, and I will give 5."
        },
        {
          "Note": 2,
          "Lieu": "UY",
          "Pseudo": "Pedro Strauch",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T19:30:10.000Z",
          "Titre": "Subscription plans are disappointing",
          "Contenu": "Subscription plans are disappointing, and jumping from a free accont to 35 dollars a month is harsh. This must be thoroughly cleared at first, or offer a free plan with one code only and a certain scan limit."
        },
        {
          "Note": 2,
          "Lieu": "AE",
          "Pseudo": "Pavel Charny",
          "Nb_Reviews": 3,
          "Date": "2023-11-18T06:32:17.000Z",
          "Titre": "Incredibly hard to use",
          "Contenu": "Incredibly hard to use. Asking to subscribe for unlimited codes when I need only one.Not recommended."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CrypticAcon",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T20:28:24.000Z",
          "Titre": "I guess it could be better to have more…",
          "Contenu": "I guess it could be better to have more social media icons or at least let people customize that better because just having a linked picture makes it look cheap. also better customization of the link pages. It is bland and sad."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Karen Kingston Fan",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T22:31:28.000Z",
          "Titre": "Goggled for a free use- Nope",
          "Contenu": "Goggled for a  free use, no cost FREE OR code generator and got a second,  bait and switch \"free trial\" for  what  is really a paid service."
        },
        {
          "Note": 2,
          "Lieu": "AE",
          "Pseudo": "Al mustaqbal al fadhi",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T12:50:25.000Z",
          "Titre": "multiple links",
          "Contenu": "This is generated only link, and user will be copy and paste somewhere, then to click. if direct come out link touchable so wil be nice."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Kevin",
          "Nb_Reviews": 17,
          "Date": "2023-06-16T16:56:34.000Z",
          "Titre": "Hasslesome and not free.",
          "Contenu": "I found this site from a Google search for free online QR generators.  The site opens with a reasonable page to design a QR code, which I fill in, then I find that before you can actually download the code you have to open an account, again supposedly free. You do that, and it loses all the information you just typed in for the QR code. *Then* you discover that it's only free for 7 days...  Cancelling this account and have now found a truly free, honest and open Static QR site elsewhere."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "Sumoling",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T13:24:23.000Z",
          "Titre": "Not useful for me",
          "Contenu": "It is possibly one of the best options for creating qr codes out there.Unfortunately it does not allow you to customize the domain of these links and the domain qr.codes is banned by vodafone as an unsafe site. So most users will not be able to open the code and will have a horrible experience.I asked the team for help several times for this one, until they stopped answering me.I had to look for another solution that would allow me to customize my own domain.But I insist that it's a great platform, even if it's not useful for me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T08:23:40.000Z",
          "Titre": "Pretty deceptive regarding the Free…",
          "Contenu": "Pretty deceptive regarding the Free part. They lead you believe it'll be free... then boom.. pony up $420 a yr or your clients get a disabled message. Client had B-Cards and flyers printed. I bought him qr stickers to cover up the QR.io codes on his printed material. Don't get scammed. If you have a WP site get a plugin and DIY it for free."
        },
        {
          "Note": 2,
          "Lieu": "NO",
          "Pseudo": "Frank",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T08:11:12.000Z",
          "Titre": "Great site",
          "Contenu": "Great site, probably. But only after I spent a lot of time making the fancy ass qr-code, they told me I'm on a free trial. Bruh, if I knew I had to pay for this exquisite qr code I'd rather find a free plain generator. I don't need colors and logos on the code.  Waste of my time. Now I have to write a review too, so other people won't waste their time, even more waste for me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Soul Inscribed",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T20:46:50.000Z",
          "Titre": "Free QR, think not",
          "Contenu": "Free QR is surprise, not so free. No other option but to pay 35 bucks, or 350. They ransom your QR code for payment, if you already have media out, you have to pay. 35 bucks is a lot considering what this is being used for and don’t get stuck like us. Use a true FREE service, not this."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Noah Casarotto-Dinning",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T18:02:41.000Z",
          "Titre": "The QR codes do not attach to the links…",
          "Contenu": "The QR codes do not attach to the links I provided, otherwise was good user experience"
        },
        {
          "Note": 2,
          "Lieu": "TH",
          "Pseudo": "TK",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T12:59:52.000Z",
          "Titre": "Expiration of the link",
          "Contenu": "Expiration of the link. Format and layout didn't turn right. VDO file to youtube doesn't work. Several old file doesn't work as expected..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeane Guthrie",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T19:18:49.000Z",
          "Titre": "My QR code won’t connect to my…",
          "Contenu": "My QR code won’t connect to my Instagram account"
        },
        {
          "Note": 2,
          "Lieu": "RO",
          "Pseudo": "Alexandru Tremurici-Mavropol",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T16:29:46.000Z",
          "Titre": "Misleading wording and marketing tricks…",
          "Contenu": "Misleading wording and marketing tricks you into thinking your getting a free QR Code. I had to pay €35 to active my code after their 7 day trial."
        },
        {
          "Note": 2,
          "Lieu": "DK",
          "Pseudo": "claus",
          "Nb_Reviews": 3,
          "Date": "2023-08-27T19:49:25.000Z",
          "Titre": "Huge scam....I have 200 worthless QR… (Read update)",
          "Contenu": "It is scam....I now have 200 worthless QR stickers... This is only a free service for 7 days after that you have to pay 35$ a month for the QR code to work. .. I had a terrible experience. Update: After I wrote this review I was contacted by customer service and I got my QR code for free and an apologize since my account was deleted after I complained and told them that I had - no - idea that the service had such a high price. And... That I had to pay for it. It was advertised as a free service. I was confused and sad when I discovered that I had to pay 35$ to get the code to work again. I had printed the QR code on 200 expensive glow in the dark stickers. The result was this bad review.The customer service has now re-activated my account and I am extremely happy about that. It seems that the company values what is written about them. I am really happy that my QR code works now and that I can use the stickers. I hope that no one else - in the future - will be confused as I was when they use this service. The custom QR code looks beautiful. Thank you."
        },
        {
          "Note": 2,
          "Lieu": "GR",
          "Pseudo": "Nicoleta",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T03:49:05.000Z",
          "Titre": "the codes are not working",
          "Contenu": "the codes are not working, I tried to make one for my websites and no success"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jimmy Tate",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T05:28:40.000Z",
          "Titre": "Unfortunately I will not be returning…",
          "Contenu": "Unfortunately I will not be returning to do any business at you store, as I received my purchase on Nov 4 7:04 pm, i said thank you baby doll and proceeded to leave, as I was leaving the cashier basically confronted me “I ain’t baby doll” I thought it was silly and departed, I later realized this person this person was prejudiced. I have not had a bad experience with any employee, until this person, i spend a couple hundred dollars monthly in your store, but having being confronted by this “Karen” I won’t be returning, and also will tell all my friends (fellow firefighters and veterans of this person, feel free to contact me 314-704-0236, I am so dissatisfied and discussed with this type of person"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Peach",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T21:39:52.000Z",
          "Titre": "I couldn't open the downloaded png…",
          "Contenu": "I couldn't open the downloaded png file.  That's pretty useless.  And no jpeg format."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bradley Czajka",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T01:35:46.000Z",
          "Titre": "some files are corrupted and wont open"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "galilea guevara gali",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T20:20:58.000Z",
          "Titre": "The QR doesn’t work",
          "Contenu": "The QR doesn’t work. It says it’s an active QR, but it won’t scan on any device I try."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Flare Dino",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T05:39:05.000Z",
          "Titre": "Was super lame"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jake",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T18:09:20.000Z",
          "Titre": "Very buggy software",
          "Contenu": "I got this on an appsumo deal. It is very buggy and I'm not sure you can rely on their qr codes.Their server keeps crashing and breaking qr codes. Then when you go to reactivate them, you have to rebuild the whole thing from scratch.I recently created a new qr code, and it had a bug that made 8 qr codes and when you archived it, it archived all 8, when I reactivated, it reactivates all 8.Also support is pretty slow.It just seems like they have a lot of issues and don't have the resources to properly support and/or run this software."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "ann fulton",
          "Nb_Reviews": 5,
          "Date": "2023-09-11T19:08:19.000Z",
          "Titre": "Too early to advise",
          "Contenu": "Too early to advise.  Will try after a few months."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alicia Grays",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T15:23:16.000Z",
          "Titre": "QR code stopped working."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer My absolute pleasure",
          "Nb_Reviews": 2,
          "Date": "2023-06-17T17:51:46.000Z",
          "Titre": "Didn't activate and giving error code.",
          "Contenu": "Didn't activate and giving error code.Disappointed"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Emma",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T23:09:29.000Z",
          "Titre": "Recommend but with Caution!",
          "Contenu": "I created a funky QR Code in my logo colours, simple to use. However, I then read the Trustpilot reviews and realised that my code will only work for 7 days unless I pay and that the qr.code dynamic link is potentially blocked by Vodafone. I managed to go back into my trial account and create a static code, but I am only awarding 3 stars due to it being very unclear that I was on a trial and I should have been notified at download that my link would expire. had I not decided to leave a review this would have been a costly mistake - please amend your process to be honest!"
        },
        {
          "Note": 3,
          "Lieu": "NG",
          "Pseudo": "Sunusi Muhd",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:28:38.000Z",
          "Titre": "It's helpful to know and review about…",
          "Contenu": "It's helpful to know and review about QR scanner"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Davis",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T01:07:23.000Z",
          "Titre": "Initially frustrating but they made it right. Use caution",
          "Contenu": "I was initially very frustrated with qr.io, as they were attempting to charge me for what I thought would be a free product based on the Google ad I followed. They worked to make it right though, which I appreciate. Pay attention when creating a QR code here, as any modification of the appearance of the QR code will make it “premium” which will come with a charge of $35 per month. But as long as you keep it basic, this is a great option with no cost"
        },
        {
          "Note": 3,
          "Lieu": "IS",
          "Pseudo": "Margeir Pálsson",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T23:38:23.000Z",
          "Titre": "Customize breaks code",
          "Contenu": "The basic QR code works perfectly, but when we tried to customize it with our logo and colors it could not be read.For a basic QR code it is really quick and easy to set up but with all the custom things, they break the QR code"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Killah Savage",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T00:04:35.000Z",
          "Titre": "Everything",
          "Contenu": "Nothin it's good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "H. Lui",
          "Nb_Reviews": 2,
          "Date": "2023-09-20T16:41:09.000Z",
          "Titre": "troubles creating an email code",
          "Contenu": "It was hard to find the \"email\" generation link. The + sign and text was greyed out so very unintuitive.Secondly, I've been trying to generate a QA code with a logo, but for some reason it only appears and not the downloaded image."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jake d",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T20:54:06.000Z",
          "Titre": "Great customer service, but they don't tell you free QR codes expire",
          "Contenu": "The custom QR code configurator is easy to use and has lots of options. The customer service department of this company is outstanding, and the primary reason I am giving four stars. BE WARNED that if you make a \"free\" QR code using the customization tool on the home page, it will stop working in a week when your free trial expires, as qr.io by default forces free QR codes to go through a forwarding URL so that they can discontinue service if you do not buy a subscription. Don't be like me and buy a bunch of prints with the free code on them, they will be useless in 7 days. That being said, even though I did not even pay for a subscription, I had multiple customer service representatives reach out to me to try to rectify my situation, and they were consistently professional, courteous, and generous. I would recommend using this service if you regularly need QR codes or if you run a business that would benefit from these services and the reliable support offered by qr.io.Second edit: This problem of not telling people their free code will expire has existed for quite some time. There are dozens if not hundreds of reviews over the past 18 months of people using a supposedly free code and having access cut off without warning. One person even used these codes for wedding invitations only to be forced into a $35/month subscription fee when the code stopped working. I have taken an additional star off due to the apparent lack of concern this company has for people getting duped by their trap."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T17:14:54.000Z",
          "Titre": "Not completely honest with consumers",
          "Contenu": "We recently used QR.io for a fundraising event in our community. We took advantage of the free seven day trial period and then got notice we would be charged a $35 monthly fee. We felt dupped into paying so our flyers with QR codes would work. Very deceptive. Not a great way to generate business or faith in consumers!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas Flynn",
          "Nb_Reviews": 2,
          "Date": "2023-10-11T00:24:12.000Z",
          "Titre": "Waste of Time",
          "Contenu": "Spent a long time getting my code looking just how I wanted, clicked Download and it wanted me to sign up for an account. So I did but then it just erased all my progress on my code and made me start from scratch? Why would you make users start all over after signing up for an account?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alan Loflin",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T17:00:51.000Z",
          "Titre": "A little deceptive",
          "Contenu": "The fact that it’s a 7 day trial is blended in and very easy to miss. Seems kinda skemish to me. Should be made so people know they are going to be charged $35 a month after 7 days to keep the QE code they just generated active. Other than that the QR codes are great. I love you can chose your colors and personalize it to fit your business."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Becky Locke",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T19:56:19.000Z",
          "Titre": "I don't know if my QR code will expire",
          "Contenu": "I like the options available but I do not like that there is nothing that tells me whether the QR code I made is static or dynamic. If it's dynamic, it will expire unless I upgrade and pay money. I made it after clicking the \"static\" option so I'm *assuming* it's a static code, but when I click the \"dynamic\" option, it refreshes the page to show the QR code I already made. So now I have a cool looking code that I can't even use for promotional materials because I don't know if it will expire next week."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Robert Skinner",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T07:43:44.000Z",
          "Titre": "Dishonest is an understatement.",
          "Contenu": "EDIT: Okay so since posting this review QR.io have been in contact and have resolved our specific issue in a great way, very friendly support staff, who were able to refund us the money we had spent and upgraded our account as a good will gesture so our QR codes will now work without the sub. I am upgrading the review to three stars because of the response from customer support, however two stars deducted for the experience overall. DO NOT USE THIS SERVICE - QR.io have conveniently forgotten to inform customers in anyway prior to using their service that it is only free for 7 days, after which the dynamic qr code will not work unless you pay £28 a month or ten times that for a year. Total disgrace. They are also making a habit or not cancelling subscriptions in a timely manner. They also automatically set the qr codes to dynamic when you are creating them. Only the static we codes are free and you only learn this after reading through a lot of small print.In my opinion this is predatory and QR.io need to add this information in a clear and understandable format so people are given the info whilst they are creating their codes… before they are trapped by their service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rachel K",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T19:47:54.000Z",
          "Titre": "Be aware of cost but overall good service",
          "Contenu": "I only needed one QR code for a work project. Everything seemed fine until our customers began scanning the QR codes. Suddenly, the QR code was no longer free. Out of nowhere my QR code is deactivated and the only way to reactivate it is to pay $35, and not a one time payment but MONTHLY! This is ridiculous and once I no longer need access to my QR code I am never using this site again. I would caution anyone else to steer clear of making QR codes with this website because it is a scam. They make false promises and then use your need to extract money from you.I wrote the above review after having a poor experience with the QR.io, but after my review was posted the level of customer service I received was wonderful. I have since used the site more and am happy with its capabilities. I would say that it definitely meets my needs, and for anyone looking to use the service in the future I wouldn't advise against as long as they were aware of whether or not they would be charged."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Ota",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T16:14:08.000Z",
          "Titre": "7-day free trial then subscription afterwards",
          "Contenu": "I was unaware there was a monthly subscription fee and had already generated and sent out a QR code by the time I was asked to upgrade to keep the QR code active. Fortunately, the customer service team got back to me soon after reaching out to them and offered me a discount which was a lot cheaper. Although I would have preferred it to be free, like it is on some other websites, the discounted price was much better and the customer service I had was friendly with quick responses."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Guillaume van de velde",
          "Nb_Reviews": 2,
          "Date": "2022-08-02T08:49:17.000Z",
          "Titre": "Unclear start of a trial",
          "Contenu": "Had created a code, but it was not immediately clear to me that it immediately started a trial. This way of working seemed quite a dark pattern to me, after 7 days the QR was no longer usable. In the end I did get a nice price proposal for this one code to continue using."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Micah",
          "Nb_Reviews": 5,
          "Date": "2023-07-22T12:10:08.000Z",
          "Titre": "It was an amazingly simple process",
          "Contenu": "It was an amazingly simple process. I never used a nicer QR code generator.Update: after a week, they all of a sudden informed me that I need to pay. That's really nice to know after I distributed ads across the town."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Promise Institute",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T19:12:58.000Z",
          "Titre": "Free account vs free trial",
          "Contenu": "Looks like a really useful service.  You need to distinguish between \"Create a free account\" and \"Start a free trial\" though.  I didn't want something in trial mode.  Now I have no idea if there is a free version, and if so, what it looks like."
        },
        {
          "Note": 3,
          "Lieu": "DK",
          "Pseudo": "Lasse",
          "Nb_Reviews": 13,
          "Date": "2023-08-14T18:20:22.000Z",
          "Titre": "I made a mistake",
          "Contenu": "I made a mistake. Made QR codes for videos in our wedding photo book. Thought they were like scannable links. I was wrong. But now the trial has run out and 350 usd a year is out of my league for this. Hoping for an extremely simplified plan in the future with no tracking and vice versa. Until that. Bummer!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "King Copywiting",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T13:38:20.000Z",
          "Titre": "The QR Code is not working",
          "Contenu": "The QR Code is not working, I Scanned it wit my camera and google camera but no links shows up"
        },
        {
          "Note": 3,
          "Lieu": "PR",
          "Pseudo": "Bayo.",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T21:04:24.000Z",
          "Titre": "I love it but, subscription?",
          "Contenu": "I love it! just, WHY SHULDNT IT BE FREE FOR A DUMB PROGRAM I CAN PROGRAM MYSELF"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Vincent",
          "Nb_Reviews": 2,
          "Date": "2023-08-25T12:03:10.000Z",
          "Titre": "Good platform, but be careful with the trial",
          "Contenu": "** Edit ** The issue mentioned below was resolved after being contacted by them through this review. Thankfully, they were understanding and allowed me to keep the QR code active. Beyond that misfortune, I must admit that their platform is well-made and easy to use. If your business requires making QR codes on a regular basis, it is definitely a service worth considering. Original review: Unless you plan on using their paid services, do not use QR.io. I recently made a QR code using their platform on the free trial. Their advertising put me under the impression that the codes made during the trial would stay active. So I had business cards made and printed using their service. When I received my business cards printed, I was disappointed to realize that the QR code did not work, essentially rendering them worthless. Then, I contacted them about it. They offered me to pay 50 USD to keep the QR code active. I felt cornered into either having to waste money to keep a QR code alive or waste money to get new business cards printed with a functional QR code. From other reviews online, I see I'm not the only one. There are other truly free services to get QR codes done with similar functionalities, and I recommend anyone looking to make a QR code and doesn't need any fancy features to NOT use QR.io. It might not legally be a scam, but their behaviour of cornering people into paying them to avoid wasting money they put into printing QR codes after being misled by their advertising is certainly akin to that of scammers."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Sue",
          "Nb_Reviews": 5,
          "Date": "2023-08-18T13:06:09.000Z",
          "Titre": "The instructions are fine",
          "Contenu": "The instructions are fine - I am not a high-tech user but I was unable to download my QR code"
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "CHRI",
          "Nb_Reviews": 1,
          "Date": "2022-10-09T13:45:16.000Z",
          "Titre": "Nice but...",
          "Contenu": "Very nice website. QRCode realizations is very easy, and I really like that you can change every single thing in your project. But I think that 350$ are too much."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "S Bell",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T13:14:39.000Z",
          "Titre": "Fairly easy but some buttons a bit…",
          "Contenu": "Fairly easy but some buttons a bit confusing."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "SB Clarke",
          "Nb_Reviews": 6,
          "Date": "2023-07-12T17:51:57.000Z",
          "Titre": "Could be more clear",
          "Contenu": "Could be a bit more clear with the pricing structure. Has potential to be a good service"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "guest arf",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T01:09:01.000Z",
          "Titre": "Statistics",
          "Contenu": "I didn't like the fact that I couldn't find out how to take a look at recent scans."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Kers",
          "Nb_Reviews": 24,
          "Date": "2023-12-05T17:50:24.000Z",
          "Titre": "The logo disappeared…",
          "Contenu": "The logo disappeared after downloading...?"
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Eddie",
          "Nb_Reviews": 3,
          "Date": "2023-06-16T19:03:24.000Z",
          "Titre": "Good at first but no updates since April 2022",
          "Contenu": "Good at first, but no updates since April 2022, no roadmap. Hope they're still workin on this project"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Raul Bordon",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T17:31:03.000Z",
          "Titre": "It doesn’t let the maker view how te…",
          "Contenu": "It doesn’t let the maker view how te images would look like when the QR Code is scanned."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Liegh DeBose",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T04:56:16.000Z",
          "Titre": "First time using",
          "Contenu": "First time using.  Will follow up with experience later."
        },
        {
          "Note": 3,
          "Lieu": "HK",
          "Pseudo": "Mr Raymond Wong",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T13:38:00.000Z",
          "Titre": "So Frankly, no comments",
          "Contenu": "So Frankly, This is my first time to join this Apps. Therefore I got no comments."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Debi",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T19:15:00.000Z",
          "Titre": "What i liked was the help Lucas gave me…",
          "Contenu": "What i liked was the help Lucas gave me to help with the account.What I didn't like is the cost."
        },
        {
          "Note": 3,
          "Lieu": "AE",
          "Pseudo": "Sumoling",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T19:19:20.000Z",
          "Titre": "Still waiting for custom domain change"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Yi",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T04:19:22.000Z",
          "Titre": "弄半天完全生成不了图片",
          "Contenu": "弄半天完全生成不了图片，浪费时间。"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Results In Motion",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T00:43:38.000Z",
          "Titre": "Nice Dynamic QR but with advertising",
          "Contenu": "I need a Dynamic QR without advertising."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mohammad  Jamal",
          "Nb_Reviews": 4,
          "Date": "2023-06-10T21:04:11.000Z",
          "Titre": "it is not easy for  normal person like…",
          "Contenu": "it is not easy for  normal person like me,"
        },
        {
          "Note": 3,
          "Lieu": "NG",
          "Pseudo": "Ahmad Yunus",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T07:41:44.000Z",
          "Titre": "I have not been able to download my first QR code",
          "Contenu": "It friendly but can't downloaded the QR I did"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Alex Moy",
          "Nb_Reviews": 5,
          "Date": "2022-06-14T16:07:58.000Z",
          "Titre": "Not transparent",
          "Contenu": "QR.io encourage you to create free static QR codes, and suggest that if you like it to pay, which is fine. Once the trial ends, they say the static codes will continue to work. But what they do when you initially create a code, is make it dynamic or at least not make it obvious what type of code you're creating and therefore you HAVE to pay to use your code. $35/m for something I have printed on some business cards. They need to check themselves into some sort of institute!!I have since contacted them and they offered me a one time payment of $50 or a reduced monthly rate of $9/m"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shirley Sparks",
          "Nb_Reviews": 2,
          "Date": "2023-07-11T20:41:31.000Z",
          "Titre": "Very easy to use",
          "Contenu": "Very easy to use! Wish you didn’t say it’s free when it’s not!!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Randy Grisham",
          "Nb_Reviews": 2,
          "Date": "2023-09-10T22:23:10.000Z",
          "Titre": "The Drummers Edge",
          "Contenu": "I don't know what I'm doing"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Polly",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T23:15:49.000Z",
          "Titre": "Still working out the kinks."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Recursos Humanos B Hermanos Cu",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T23:48:42.000Z",
          "Titre": "The page was crashing a lot"
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Land Party South Africa",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T09:53:04.000Z",
          "Titre": "It is good",
          "Contenu": "It is good, friendly and easy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas BRINKMAN",
          "Nb_Reviews": 3,
          "Date": "2023-10-15T14:48:22.000Z",
          "Titre": "…free",
          "Contenu": "…free, is a trick word ."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Ruth",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T18:04:15.000Z",
          "Titre": "Great thank you so much for that"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Daniel Prevost",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T22:15:19.000Z",
          "Titre": "Just give a tray"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "David Goyder",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T16:26:41.000Z",
          "Titre": "Have not a clue"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Randy Grisham",
          "Nb_Reviews": 2,
          "Date": "2023-08-24T14:49:13.000Z",
          "Titre": "Very hard to do"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Lily",
          "Nb_Reviews": 5,
          "Date": "2023-07-09T16:16:02.000Z",
          "Titre": "Easy to find."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Leandro Benetti",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T10:02:09.000Z",
          "Titre": "Very very nice tool!",
          "Contenu": "Loved all of the variety we have to create our QR codes. I wish there was a way for the QR code to be accurately previewed before you save the design on your device."
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "Saad",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:35:54.000Z",
          "Titre": "My Experience",
          "Contenu": "I don't have outstanding experience for this service but I think it's great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T21:07:55.000Z",
          "Titre": "Some Top Features",
          "Contenu": "(Update to previous review.)The feature set for creating attractive custom QRs is one of the best I've found.  Be mindful that any non-static code(s) you create will expire if you don't purchase an ongoing subscription.  I had thought I had created a direct static link code and it later expired, but the app creator resolved the issue for me.The features and options are well executed."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "PS",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T14:27:59.000Z",
          "Titre": "This company does not make clear that…",
          "Contenu": "This company does not make clear that your “free” QR code will expire in 7 days, and then you’re basically forced to pay $35 a month if you’ve already distributed it on printed material.ETA: I have amended my rating after customer service reached out. I will note they have been very helpful, though I still think the company should be more clear about the terms of the “free” codes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Meghan M",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T19:58:10.000Z",
          "Titre": "Quick and painless QR code set up",
          "Contenu": "Quick and painless QR code set up. I was happy to see that it was actually free, like advertised, since another site I tried had false advertising. Only reason I didn't do 5 stars was because when you scan the QR code, while the website is loading, the URL shows \"qr.codes\" before loading the intended website URL. I'm not sure if this is standard, but I don't recall seeing that in other times I've used QR codes. Overall, I would recommend using them to create your code. It was very easy, and there was a good amount of customization options."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Lukas Seubert",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T17:15:14.000Z",
          "Titre": "Good customer service",
          "Contenu": "The website is very good and easy to use to create QR codes. However, you need to know that it is not free, as it seems at first, it will cost a monthly fee (which is not really mentioned before the QR code gets blocked after the 7 day free trial has ended) to keep the QR code active. However, the customer service is very responsive, and after speaking to Lucy from QR.io via Email, we were able to arrange a solution and reduce this unexpected cost."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kalani",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T03:20:22.000Z",
          "Titre": "pretty easy to adjust a QR code however…",
          "Contenu": "pretty easy to adjust a QR code however I want. at first i was able to change everything to be one solid color but now I am doing the same thing and the dots are still all black? im not sure what im doing wrong or if it's the program. but so far i love it, thank you. I will figure out why the dots are still black"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "VT",
          "Nb_Reviews": 7,
          "Date": "2023-11-06T19:48:56.000Z",
          "Titre": "QR code created in trial will expire",
          "Contenu": "I've edited my review as Lucy from QR.io got back to me and sorted my issues.  I had created a QR code during the free trial, printed it on business materials, and not realised that it would stop working after a few days.   I was offered 50 dollars to purchase the QR code to solve my problem, but ran into difficulties progressing this.  After I posted on here, Lucy sorted it all for me, so I've updated my review as everything is ok now. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "EFlatMajor7",
          "Nb_Reviews": 43,
          "Date": "2023-11-07T19:11:55.000Z",
          "Titre": "A well layed out site that provides…",
          "Contenu": "A well layed out site that provides simple and intuitive QR code generation. I've only used the test and VCard options so far. The VCard option doesn't appear to pull through the address information?"
        },
        {
          "Note": 4,
          "Lieu": "AR",
          "Pseudo": "Ale Buddy",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T00:34:11.000Z",
          "Titre": "Easy and fast!",
          "Contenu": "It was really simple, easy, and fast to use the service, so it's almost perfect.Only thing I miss is an ads system so you could watch an amount advertisements and get one use instead of the only paid version. That is why It is not perfect and it's not 5 stars ^^."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Laure",
          "Nb_Reviews": 3,
          "Date": "2023-11-14T15:07:56.000Z",
          "Titre": "Good experience but the short free trial could be better highlighted",
          "Contenu": "Good creation experience, a very intuitive and easy way to create a QR-code, also with multiple links attached to it. The only thing I disliked was that the short free trial aspect was not clearly mentioned."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Tochalauski",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T18:14:05.000Z",
          "Titre": "I'm using this to create a contact… for my mentally deteriorating grandmother.",
          "Contenu": "I'm using this to create a contact rolodex for my grandma since she can only find her camera icon on her phone and can work with prompts. However, it's discouraging how websites likes this are always so obviously about the money. I'd love to be proven wrong for something other than publicity though."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "No",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T03:24:22.000Z",
          "Titre": "Good QR maker.",
          "Contenu": "Their site says 100% unlimited full access to the premium features for the 7 day trial, but then they limit your access. Their support did end up resolving my issue after I spoke to the second agent who seemed to be more willing to assist with my inquiry. The premium features work and make it way easier to do bulk QR codes."
        },
        {
          "Note": 4,
          "Lieu": "SI",
          "Pseudo": "Neja Šmid",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T14:54:55.000Z",
          "Titre": "Easy and useful",
          "Contenu": "It is easy to use and done from my phone."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "S.P.",
          "Nb_Reviews": 4,
          "Date": "2023-11-14T11:18:32.000Z",
          "Titre": "No free account only payd after tiral of 7 days",
          "Contenu": "Good and versatile but too Costly, supposed to be a lower cost service  as competition is far down that price"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T23:03:13.000Z",
          "Titre": "Good service, but",
          "Contenu": "QR code generation works like a charm, there are plenty of attractive design options. Just be aware that dynamic QR codes become invalid if you don't sign up for the premium plan after a week. If you don't need the in-depth statistics, make sure to generate a static QR code as they last forever. Unfortunately that isn't exactly transparent on the website and I ran into the issue that the code which I had already used in print suddenly became unusable. Luckily, customer support was very helpful and proactive in solving the problem. I hope they will make it more clear in the future, because otherwise it's a great service."
        },
        {
          "Note": 4,
          "Lieu": "BO",
          "Pseudo": "Rommel Fox",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T15:04:56.000Z",
          "Titre": "Change of mind for excellent Customer Service",
          "Contenu": "I had to delete my previous comment, because the qr.io staff contacted me thanks to Trustpilot. I thank Lucy Brown for her efficiency and quick response to the complaint.  They still need to get better at communicating, to those who visit their page looking for a free qr or two. Thanks once again the qr works wonders."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eva",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T03:01:32.000Z",
          "Titre": "Impossible to cancel (Updated review)",
          "Contenu": "Impossible to cancel. They never send the email confirmation email so it is impossible to re-access your account. I even tried the cancel account/subscription link and it will say we emailed your account but then nothing comes in. No clue how to stop these $40 monthly payments.Edit: Customer service reached out by the hour to assist in resetting the log in so I didn’t need to log in with an email confirmation! I was able to cancel after that smoothly. Use of the QR code was great during our wedding- no issues there."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "SJH",
          "Nb_Reviews": 3,
          "Date": "2023-10-26T09:11:11.000Z",
          "Titre": "Good service, but check carefully",
          "Contenu": "QR.io provide a simple and effective service to generate codes. Customer support is varied, but their representative Lucy in particular was able to quickly resolve an issue I had with codes expiring with account trial period.This seems to be a common issue that others have reported (and one that I'm sure is common with all QR generator sites), it is highly recommended that users of the service carefully check whether the code they've generated is 'static' or 'dynamic', as it's not immediately obvious. And don't do what I did and go to print with an inappropriate code!Otherwise I'd highly recommend QR.io"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "T. Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T17:24:43.000Z",
          "Titre": "Exactly what you need",
          "Contenu": "Pretty great! I use it for work and it's always able to make what I need. I do wish there was a way to make added logos larger, but I understand it's necessary to keep them functional."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Benjamin",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T13:33:34.000Z",
          "Titre": "Be careful when making QR codes",
          "Contenu": "Be careful when making QR codesUpdate! I have received great customer service since this review was made and I’m very pleased with how much they cared about my situation. I will continue to use Qr.io, however still be careful of which QR code you’re making. -BenOriginal review:I made a qr code and there was no mention at all of the insane $350 dollar yearly fee that would come once your 7 day free trial ended. I then put these qr codes on 250 of my business cards so now I'm going to be forced to pay a monthly bill just so my business cards work. I am not very happy at all with how things presented themselves. They give you the \"Option\" to choose a static or dynamic qr code, but their \"static\" option is a tiny fine print option at the bottom of the page which you will never find or see unless you're looking for it. Moral of the story, make sure you know everything before setting something in stone. I was a fool and now I'm literally paying for it. Other than that however the program works great and does what it says it does"
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "Atlantika Global A.S",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T22:27:14.000Z",
          "Titre": "Qr Io works really well. Links can be improved",
          "Contenu": "Qr Io works well. the codes that can be customized. If not necessarily white labeled, they could include the name given to a code instead within the link. To use them specially for catalogues or order documents i.e. PDFs; It offers all colors and forms to give alternative designs attractive to the users, but color pallets cannot be saved and everytime is needed to look and guess what what colors were used before. Logo inside of the codes could look a bit clearer, but it gives a nice touch to brand a code. Static and, specially dynamic codes are a choice which makes them really useful. On the customer support, the team is very customer friendly and practical. Careful and transparent regarding security practices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe R. Frinzi",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T20:26:29.000Z",
          "Titre": "Easy code generator.",
          "Contenu": "I just downloaded the code but haven't had a chance to check it out yet. So far, the process was easy. Hopefully I did everything correctly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 2,
          "Date": "2023-06-27T01:16:56.000Z",
          "Titre": "It works weel. Still need minor improvements",
          "Contenu": "It works as it is supposed. I like the flexibility in QR design such as colour, shapes, logos, and icons. Overall the idea is very good. What I would like to see is:- exclusion from the search engines (VC or Contact Profile)- exclude own IP from analytics.- Profile card to be more flexible in designI will keep using it and observe how things go from here. I believe that the team listen and will implement other requests. Thanks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Samantha Enda",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T19:04:37.000Z",
          "Titre": "I love how customizable the QR code is",
          "Contenu": "I love how customizable the QR code is. Being able to change the color, background, etc. is fabulous! I just wish I could go in and change the details of the link after I've saved the initial version, instead of just the appearance. But I just used the free version, so it is entirely possible that functionality comes with the paid version"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Krista Buynak",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T20:43:56.000Z",
          "Titre": "Super easy, but I'd add just one option...",
          "Contenu": "I really like how easy it is to make these QR codes and how customizable they are. The only thing that would make it better is if I could save a template so I don't have to enter all the info and customization from scratch every time. I am an exotic animal breeder, so I make these for animals that go to new homes so their new owners can just scan and have a copy of their info. I like them to be consistent though, so not having to do everything from scratch for each code would be nice, but overall it's a great service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cheryl",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T15:29:23.000Z",
          "Titre": "ISSUE RESOLVED QUICKLY, THANK YOU",
          "Contenu": "I misunderstood that there is a trial-free period.  The use of the program is actually quite easy to set them up with many options available for 'types' of QR codes.  We had an issue but it was resolved very quickly from the QR.io team, who were very generous with their help.  You can actually reach someone if you need help, this is a wonderful thing!  Thank you, QR.io for your help! Our non-profit needs this kind of quick communication and we got it."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "HInclan",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T17:20:16.000Z",
          "Titre": "It is really very easy to use and…",
          "Contenu": "It is really very easy to use and customize. In addition to the size and formats to download of the QRs are sufficient. Perhaps it would only be ideal to make small adjustments to the output format, for example in vCards, and to be able to handle multilanguages within the landing page."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Morgan Jean",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T04:56:33.000Z",
          "Titre": "A rocky start, with a great ending!",
          "Contenu": "Creating and setting up our QR.io code was simple. The website was user-friendly as well. The only issue we ran into was that we didn't realize the QR code was not free, rather we had only received a 1 week's trial. After receiving an email asking us to pay to continue using the QR code, we immediately reached out to customer service since the prices were out of our price range. Thankfully they responded very promptly and they were able to provide us with a few options that worked better within our budget so we could get the most use out of our QR code!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "matthew willment",
          "Nb_Reviews": 3,
          "Date": "2023-09-13T09:04:28.000Z",
          "Titre": "PLEASE DON’T MAKE THE SAME MISTAKE I DID!!!",
          "Contenu": "I used this website to create QR codes to help me promote my self-published book as I thought they were free. I have very little money and was excited to add a QR code to my bookmarks for the children to find some extra stuff online. Having paid for 200 bookmarks, I find out that the QR codes no longer work and to reactivate them I’d have to pay monthly or yearly. It was not made clear at all that I was on a free trial and hearing other people it sounds like this is intentional to suck you in. I’m devastated that I’ve wasted the little money I did have on these bookmarks that will no longer function. EDIT: The company contacted me to say that they were upgrading me to the premium plans for free. The customer service is actually quite good. I will say the QR codes are fun to customise and offer lots of options. Just make sure you understand the free trial rules and how it works!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yvonne Jones",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T22:02:35.000Z",
          "Titre": "QR code - Easy!",
          "Contenu": "Creation of the QR code was easier than expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony Vaughn",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T18:08:05.000Z",
          "Titre": "Take your time.",
          "Contenu": "The app did what it was supposed to do."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Henk Broekhuizen",
          "Nb_Reviews": 2,
          "Date": "2023-07-30T12:34:08.000Z",
          "Titre": "Very good service for QR",
          "Contenu": "Very good service, works well. It would be handier to be able to go one step back after creating a QR and retain the entered text. Adding a custom logo only worked two times, after that a SVG logo was no longer added to the QR (default ones did)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lora McCoy",
          "Nb_Reviews": 2,
          "Date": "2023-07-26T17:02:57.000Z",
          "Titre": "Great product, but don't appreciate pricing that isn't obvious",
          "Contenu": "The QR codes, flexibility of design and tracking are excellent. I would have rated  a 5. The reason I did not is because the pricing is not obvious to quick users. You don't see the fees unless you scroll to the bottom or complete the 7 day free trial you didn't realize you were in. The company comes up if you search for \"free qr code generator.\" But the product is not free (except for the 7 day trial). That being said, it is a good product and we did go on with a paid plan for the tracking purposes - and because we had already printed products with the qr codes before we had the notice that our \"free trial\" had expired and now the qr codes we generated were not active. As most should know however, anything that sounds too good to be true, probably is. So, I blame myself for not searching out the site further. Were there a \"pricing\" tab in the header with clear information before getting hooked, I'd give the product 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "KW",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T11:08:23.000Z",
          "Titre": "Single QR Code Generated",
          "Contenu": "I used this website to create a single QR code, which I thought was free. Unfortunately, I didn't read the small print and soon realised that I had a free one week trial, and that the code would expire without further payment. The company were very helpful in providing a suitable alternative to cover the cost, by considerably reducing my monthly membership cost."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Karan",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T11:29:31.000Z",
          "Titre": "No complaints",
          "Contenu": "Got what I wanted really quickly with an easy options menu. No complaints"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Jessy Vee",
          "Nb_Reviews": 2,
          "Date": "2023-07-11T07:33:24.000Z",
          "Titre": "Great software, just not for me. Top notch customer service.",
          "Contenu": "Although an intuitive and powerful platform, we found the software was not quite what our client was looking for. QR.io refunded our money, no questions asked."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rhiannon",
          "Nb_Reviews": 5,
          "Date": "2023-03-18T15:19:55.000Z",
          "Titre": "Amazing Customer Service, but Need More Plan Types",
          "Contenu": "My experience with customer service was absolutely amazing. Oscar helped me very quickly when I discovered the service was more than I required. My one complaint is the lack of variety in plans. It would be helpful to have lower tier plans for those who only need a single tracked qr code, etc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Teresa Mayer",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T02:47:51.000Z",
          "Titre": "QR Generator",
          "Contenu": "The QR codes are very customizable. The only thing I wish I could change was the text color. I had to skip the frames because black doesn't work for my application."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Timothy Hinds",
          "Nb_Reviews": 2,
          "Date": "2023-09-24T21:11:01.000Z",
          "Titre": "They expired my \"free\" QR code but eventually made it right.",
          "Contenu": "My first impression of qr.io was that it seemed a useful service worthy checking out in the initial free trial.  I created and used a QR code and it worked fine until the end of the free trial period, when qr.io informed me that not only did my ability to create QR codes end with the trial period, the code I had created was now not going to function anymore unless I paid them $35/month.  It had never occurred to me that they would disable my QR code and hold it hostage until I paid them money to keep it alive.  That resulted in my first, very negative, review here.  However, upon seeing that review, qr.io quickly contacted me and offered a very satisfactory resolution, which I happily accepted.  They didn't ask me to change the review, but I am changing it to reflect my appreciation for their having rectified the situation through excellent customer service.  I can't quite get to five stars because of the substantial miscommunication of their initial offer, but I can go with four stars happily.  The service still looks useful, albeit a bit pricey.  Just beware that the free trial period is not just for creating QR codes but also for having them continue to function, which I've recommended to qr.io that they disclose when you sign up for the free trial."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Scudder",
          "Nb_Reviews": 3,
          "Date": "2023-06-15T06:01:11.000Z",
          "Titre": "Well done qr.io",
          "Contenu": "When I first used qr.io I had a problem as stated in other reviews but after some very swift action from the customer service team the problem was resolved.Great software and customer support."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "megan",
          "Nb_Reviews": 3,
          "Date": "2023-05-24T14:39:06.000Z",
          "Titre": "Great system - too pricey",
          "Contenu": "Great system, however, needs to be made more clear that it is a 7 day free trial.Maybe to compete with other QR code generators, have a free service for a basic QR code and then have the subscription for after."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Jamie Paul",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T21:25:53.000Z",
          "Titre": "LEARN THE DIFFERENCE BETWEEN A STATIC (free) AND DYNAMIC (not free) QR CODE!",
          "Contenu": "We were originally taken aback once we found out that we had purchased a dynamic code instead of a static code when receiving the bill. Thankfully we were assisted and offer the chance to purchase just one code at a reduced and fairer price."
        },
        {
          "Note": 4,
          "Lieu": "BG",
          "Pseudo": "Георги Вълчев",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T17:48:00.000Z",
          "Titre": "Expeptionally good",
          "Contenu": "Expeptionally good, however I would love to see my page opening after the scan and not just a link popping up!"
        },
        {
          "Note": 4,
          "Lieu": "LT",
          "Pseudo": "Canto Fiorito",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T08:10:12.000Z",
          "Titre": "I experienced slow and unresponsive…",
          "Contenu": "I experienced slow and unresponsive communication via chat. But, everything changed when I wrote an email to support. The problem was solved quickly, the proposed solution answered our needs. So: chat communication - 2, support - 5"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tyler",
          "Nb_Reviews": 3,
          "Date": "2022-12-31T01:16:56.000Z",
          "Titre": "Good customer support, but expensive.",
          "Contenu": "My wife used QR.io to generate a QR code we needed. Unfortunately, it wasn't plainly obvious that the free trial expired after 14 days and subscription after that was expensive, and for much more extensive service than we needed. Fortunately, the customer service team was responsive and allowed us to use the service at a discounted rate for a period due to the confusion.Takeaway: This is not the best service for the average Joe needing a QR code, but the customer support is responsive and understanding! They could just be more plain about the cost after free trial, and who their service is best suited for (not average Joe)."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Samantha Barocio Rocha Ofna",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T21:19:59.000Z",
          "Titre": "Great customer service!",
          "Contenu": "I had a specific situation with my QR code and they gave me a quick and helpful solution that worked for me. They were very attentive and open to find solutions to my problem. Great customer service!"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Nkosikhona",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T09:53:35.000Z",
          "Titre": "This website is very easy to use",
          "Contenu": "This website is very easy to use, very basic but provide  high quality experience and results. I really love the dashboard feature"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Q.",
          "Nb_Reviews": 1,
          "Date": "2023-02-05T01:52:52.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "I signed up for the service to create a few custom QR codes for work.  The process was easy and offered good creative options.  When I needed to cancel my subscription to the service, Carolina was friendly and efficient with addressing my needs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bree",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T02:59:19.000Z",
          "Titre": "Creating a QR code",
          "Contenu": "I was looking to create a QR code for my wedding invitations and found this site. I did not know that I had to pay a monthly fee to keep my QR code I created, so I emailed customer service. They helped me figure it all out and I appreciate the help they provided."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Lorraine Reid",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T23:20:53.000Z",
          "Titre": "Positive resolution",
          "Contenu": "After posting my first negative review Lucy, a customer service representative, contacted me. She was able to resolve the entire situation. I'm very pleased with how things were rectified."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Hall",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T16:51:25.000Z",
          "Titre": "Easy to make QR Code",
          "Contenu": "I'm very impressed on how together and easy it is to operate and make my QR Code,  thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shirley",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T15:00:42.000Z",
          "Titre": "The page was pretty straight forward…",
          "Contenu": "The page was pretty straight forward and mostly easy to use.  I did try to use our logo but the results were not good and I did not see a way to take it out/or undo without logging out and back in."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Annefleur Bosman",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T11:40:24.000Z",
          "Titre": "At first I was ready to give a one-star…",
          "Contenu": "At first I was ready to give a one-star experience. Why? Because of the free trial everyone is talking about in their reviews. However, I decided to not sit down and accept my defeat, I contacted them through email (which I suggest is better than filling in the contact form!). Within an hour, I got a response from Carolina. Carolina was very kind to offer me two options; either a discount per month or a one-time payment. We ended up with the one-time payment, and it was easily done. We received a one-time payment link and the qr-code worked again the second we paid. Thank you for the quick service, Carolina! I didn't give five stars because of the seven days trial, which could have been communicated better, or a better view of the differences between a static and a dynamic code. Nonetheless, I am very happy that our qr code is working again, as it was printed on growing paper, and there was no way of changing that!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nikki Gilliam",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T01:44:59.000Z",
          "Titre": "as being able to call, text, website, and all.",
          "Contenu": "It was easy to do. I wish it was a way to put all your info on 1 QR code such as not just being able to go straight to the website, but we should be able to message, call, location, etc from one code!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ian",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T22:35:03.000Z",
          "Titre": "Help there when needed",
          "Contenu": "I enjoyed the service and when I needed help it was there within 24 hours. I just wish the site made it a little clearer that you are only getting 7 days… If that’s my bad I take responsibility though"
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Mark Paul Ojemelon",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T15:10:57.000Z",
          "Titre": "The interface is so easy to work with",
          "Contenu": "The interface is so easy to work with. I enjoyed every feature."
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "Asma Ghaz",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T16:42:53.000Z",
          "Titre": "easy to use and friendly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Samuel Kuehn",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T23:39:44.000Z",
          "Titre": "Free Trial Experience",
          "Contenu": "I like how they didn't ask for your payment information out the gate, and instead made the free trial actually worthwhile."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Rod Harris",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T14:12:51.000Z",
          "Titre": "this was so easy to follow and use",
          "Contenu": "this was so easy to follow and use. I'm delighted i've created my first QR code. Here's hoping it all works on the day :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Petya Peneva",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T16:49:29.000Z",
          "Titre": "I would like to be able to clone the QR…",
          "Contenu": "I would like to be able to clone the QR code and not need to start all over whenever i need to change a color but still want to keep the old one too."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Chykes",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T03:21:57.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, being new to generating a code.I would have loved to be able to add a small text like ' Scan me'.Overall good experience though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Armand Panganiban",
          "Nb_Reviews": 5,
          "Date": "2023-06-09T17:09:40.000Z",
          "Titre": "Full Featured QR creator app",
          "Contenu": "Full Featured QR creator app.  Works as expected.  Lots of options available.  Would like to see more updates."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin Markowski",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T02:33:40.000Z",
          "Titre": "Made my first ever QR code",
          "Contenu": "Made my first ever QR code. Had a hard time with the download  and re-sizeing once downloaded. I am happy with being able to create QR codes."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Ilya Kremer",
          "Nb_Reviews": 3,
          "Date": "2023-09-27T20:23:06.000Z",
          "Titre": "Losing progress during sign-in",
          "Contenu": "The tool is super nice but after creating my QR it asked for signing up or in. I proceeded and lost my progress."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Lucas Jourdain",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T11:40:01.000Z",
          "Titre": "This experience was very instructive…",
          "Contenu": "This experience was very instructive for the team spirit. I liked this project and all the team of splash project are very sympatic"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Mich kas",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T10:25:32.000Z",
          "Titre": "AWOSOME",
          "Contenu": "AWOSOME! Allows clients to review your business with a single scan."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sana' Rasul",
          "Nb_Reviews": 2,
          "Date": "2023-06-09T17:12:56.000Z",
          "Titre": "QR.io is s versatile platform that I…",
          "Contenu": "QR.io is s versatile platform that I have been able to use for all of my QR code needs. What I love most is the ease of use and the beautiful finished product. QR codes are an extension of my marketing and QR.io makes me look good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Martha Baird",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T01:02:50.000Z",
          "Titre": "Easy to do but it told me my access was…",
          "Contenu": "Easy to do but it told me my access was denied once I made my QR code. Not sure what I still need to do to use the free time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Micah and Sarah Tomm",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T00:51:32.000Z",
          "Titre": "At first we were a little frustrated…",
          "Contenu": "At first we were a little frustrated because it wasn't super clear that we would be charged for accidentally making our QR code a dynamic one.  However, the representative that helped us was very accommodating and helped make the cost more reasonable for our circumstances."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "¿ Tiff ?",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T21:51:28.000Z",
          "Titre": "I was offered a few options to solve my…",
          "Contenu": "I was offered a few options to solve my issue. They were tailored to my specific situations to help with what i needed. Carolina was very nice and helpful and solved my issue promptly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Craig",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T22:01:20.000Z",
          "Titre": "I'm banking on this! Mad Cow Zombie Movie",
          "Contenu": "Sucked me right in and made it easy to complete so that I could make progress toward my goal!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gerry Engel",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T19:14:19.000Z",
          "Titre": "This tool allows easy sharing of…",
          "Contenu": "This tool allows easy sharing of content and information. Very user friendly with ample customization options."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Becca",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T15:59:50.000Z",
          "Titre": "Very helpful",
          "Contenu": "It was easy to create a subscription, change the price to something more affordable for me, easy to cancel my subscription, and great response time from customer support."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Yobart",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T20:17:15.000Z",
          "Titre": "Do very well the job for an affordable…",
          "Contenu": "Do very well the job for an affordable price.Suggestion add more design or customisation to the templates for redirection."
        },
        {
          "Note": 4,
          "Lieu": "RS",
          "Pseudo": "Dalibor MaThkovich",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T03:56:39.000Z",
          "Titre": "Easy and fun to use but…",
          "Contenu": "Easy to use but we like more free stuff hhhehe..only 7 days? :p  Other then that. Proces is ease and greatly fun. Nice"
        },
        {
          "Note": 4,
          "Lieu": "QA",
          "Pseudo": "MF",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T18:56:07.000Z",
          "Titre": "Easy for Non Tech minded people",
          "Contenu": "I am not a very tech savvy person so based on that it was quite easy to understand and create."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "The Pas Arts Council",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T16:04:35.000Z",
          "Titre": "New - Query",
          "Contenu": "It is all new to me and it was super easy.Question - after the 7 days does the code become inactive?"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "BMM",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T15:21:31.000Z",
          "Titre": "Service & support.",
          "Contenu": "I am very happy with this service and appreciate the service & support. Keep it up!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adam Criser",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T18:38:44.000Z",
          "Titre": "Great Service",
          "Contenu": "I did not realize I had to pay to keep my custom QR code active, so they lose one star for that, but it may have been my mistake and the customer service was very helpful in finding a solution that worked for me which is why they still earn 4."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Alice Gold",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T11:24:12.000Z",
          "Titre": "Good customer service with flexible…",
          "Contenu": "Good customer service with flexible payment plans to help find a solution which worked for me."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Vivek",
          "Nb_Reviews": 3,
          "Date": "2023-08-01T15:20:47.000Z",
          "Titre": "Good experience",
          "Contenu": "The company offered a good solution to help my situation. The response could have been a little bit faster but, its all good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Walker",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T17:46:36.000Z",
          "Titre": "QR Experience",
          "Contenu": "Most QR code websites are very expesnive to use and slow to make good QR codes that look nice. Not the case here. They are excellent!"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "DONATELLA BARTOLINI",
          "Nb_Reviews": 2,
          "Date": "2023-06-17T16:30:54.000Z",
          "Titre": "Great app",
          "Contenu": "Great app. I found this complete qr suite and it’s still my fave. Usability and top performance are the main core of QR.io"
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "Itinayla Intro",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T20:26:01.000Z",
          "Titre": "helpful for making qr codes",
          "Contenu": "helpful for making qr codes. many diffirent designs"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "DT Renney",
          "Nb_Reviews": 2,
          "Date": "2023-01-02T23:52:39.000Z",
          "Titre": "Practical and easy-to-use",
          "Contenu": "Much easier to manage than other sites I looked at.  Not too pushy.  Easy options to upgrade"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brett W.",
          "Nb_Reviews": 2,
          "Date": "2023-08-22T05:47:16.000Z",
          "Titre": "Have not actually sided yet until so…beginner",
          "Contenu": "Have not actually sided yet until so far seems simple"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Jacobs",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T21:43:36.000Z",
          "Titre": "Easy to use and understand",
          "Contenu": "Easy to use and understand.  Lots of options.  Very good app!"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Sandy",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T13:21:32.000Z",
          "Titre": "Appreciate the timely response given by…",
          "Contenu": "Appreciate the timely response given by the team to help sort out my issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amy Weishaar",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T17:25:11.000Z",
          "Titre": "Oscar was very helpful resolving my…",
          "Contenu": "Oscar was very helpful resolving my account problem but the website was not"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vicki",
          "Nb_Reviews": 2,
          "Date": "2023-06-12T05:58:32.000Z",
          "Titre": "Oscar was very helpful in answering my…",
          "Contenu": "Oscar was very helpful in answering my questions related to billing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tieska Graphix & Media",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T18:43:20.000Z",
          "Titre": "It's was very helpful",
          "Contenu": "It's was very helpful, I created my business account qr code in just a few minutes.. So the best of all"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Lucia Hammond",
          "Nb_Reviews": 2,
          "Date": "2023-07-30T09:24:10.000Z",
          "Titre": "Really great",
          "Contenu": "Really great, easy to use with lots of different options to choose from"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Natasha Lebron",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T22:13:02.000Z",
          "Titre": "Quick",
          "Contenu": "Quick, easy, self explanatory and free!"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "shane ginsberg",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T13:29:46.000Z",
          "Titre": "Easy to use an edit but pricing should…",
          "Contenu": "Easy to use an edit but pricing should only come after 2 QRcodes"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T22:18:22.000Z",
          "Titre": "Ease of use",
          "Contenu": "Ease of use; self explanatory: don't need eleven words;"
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Abhi srk",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T13:47:40.000Z",
          "Titre": "Really difficult task done easily"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Farhan A. R.",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T00:29:58.000Z",
          "Titre": "Easy to make QR codes.",
          "Contenu": "It's easy to make QR codes.You can also make nice changes and modifications."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shayne Roberts",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T08:40:29.000Z",
          "Titre": "So cool",
          "Contenu": "So cool. I’m using this to leave my girlfriend little momentos"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kyleigh Lawrence",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T04:54:02.000Z",
          "Titre": "Um I will do a good reweiw if it lets…",
          "Contenu": "Um I will do a good reweiw if it lets me post it i. Have to try first see you soon"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Butch Bradford",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:01:06.000Z",
          "Titre": "The facility and the PEOPLE!",
          "Contenu": "The facility and the PEOPLE!! From a clean reception area to the exam rooms and even restrooms were very clean and orderly. The staff from t to back very professional and caring. I’m always amazed at how they treat us as patients,caring for our needs . I’m very overwhelmed by the compassion, yet professionalism of the staff.I appreciate this practice"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tara",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T07:09:38.000Z",
          "Titre": "Honestly a great website for a quick QR…",
          "Contenu": "Honestly a great website for a quick QR code.  They don't ask for your credit card, you quickly enter your email address and it's over.  They even have an option to download the code right away.  Very pleased with this site, I even added it to my favorites."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "April",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:14:27.000Z",
          "Titre": "User Friendly",
          "Contenu": "It was quick and easy to create a QR code on this website. I'm just a little uncertain if my newly generated QR code will be active forever?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Chang Fatt",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T08:16:44.000Z",
          "Titre": "I came across qr.io after going through…",
          "Contenu": "I came across qr.io after going through a number of qr generator sites, which all lacked the features and intuitive ease of use that qr.io has.I'll be recommending this site for any looking for this service. Thanks for making it easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Newman",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T20:55:54.000Z",
          "Titre": "A very easy tool to use and process to…",
          "Contenu": "A very easy tool to use and process to follow. I would love to use this in the future more and more to cut down on printed out instructions as we move forward."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Danny",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T23:16:09.000Z",
          "Titre": "If you are looking to have a qr code…",
          "Contenu": "If you are looking to have a qr code attached to you business card, i highly recommend trying out QR.io. I had a good experience communicating with the customer service representatives. Be sure to understand the trial periods before ordering your business card prints. I am happy with QR.io and will be recommending it to my fellow peers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig Wilkins",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T22:22:00.000Z",
          "Titre": "Awesome simple to use QR code editor",
          "Contenu": "Awesome simple to use QR code editor. All the customizable features to help a company whether they are already open or need to simply drive traffic. Tool has been awesome for my students business class creating brand awareness."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Thia Patten",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T19:47:54.000Z",
          "Titre": "very easy to use for someone like me…",
          "Contenu": "very easy to use for someone like me who is not the most tech savvy.  Very customizable looks exactly how I want.  Will definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "David Rutledge",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T19:41:52.000Z",
          "Titre": "Very simple product",
          "Contenu": "Very simple product!  High quality qr codes and very strong service offering for a completely free product. highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Nicolae Lucian Savu",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T16:02:59.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, quick and customisable. As a suggestion i would recommend to give the possibility to upload a background"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dasan Haire",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T23:28:23.000Z",
          "Titre": "Very helpful and allows you the…",
          "Contenu": "Very helpful and allows you the opportunity to advertise an bring your brand to the world."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonatan",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T21:34:26.000Z",
          "Titre": "Easy and simple to use",
          "Contenu": "Made a QR code for my personal profile. The design is very clean and not intrusive at all when I share it with others. Just a quick scan of the code and the other person can save my information on their contacts list. Super straighforward."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "leroux botha",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T09:43:35.000Z",
          "Titre": "Super-easy and Intuitive",
          "Contenu": "The interface is super-easy and intuitive. Several options work really well for any QR code creation. And you can let your creative juices flow with the various options to create interesting QR codes. Amazing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arianna McKenzie Ari",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T22:26:09.000Z",
          "Titre": "I'm conducting a survey at school and…",
          "Contenu": "Izm conducting a survey at school and this website has been a huge help! Not only does it make links easily accessable, it also tell you how many scans it has gotten, which was a great motivator for me. I appreciate this site so much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MaryJane Hall",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T10:22:06.000Z",
          "Titre": "Great balance between all the…",
          "Contenu": "Great balance between all the customizations and the user friendly platform !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon Herring",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T21:43:02.000Z",
          "Titre": "Best QR code generator",
          "Contenu": "Super easy to use and customize. Results are great and I love the tracking feature that lets you see how many times your code is scanned."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jonathan Pease",
          "Nb_Reviews": 4,
          "Date": "2023-12-15T17:20:07.000Z",
          "Titre": "Carolina Saved Christmas 🎄",
          "Contenu": "After an issue with my order Carolina helped me quickly resolve an issue to ensure that a gift could be sorted for Christmas."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica Santana",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T20:16:38.000Z",
          "Titre": "Go To QR Maker",
          "Contenu": "Easy to use! Definitely recommend for your QR needs <3"
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Δήμητρα Τζιαφέτα",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T01:15:40.000Z",
          "Titre": "Very easy to use",
          "Contenu": "Very easy to use, clear instructions and layout, did the qr code quickly and it works like a wonder! Amazing"
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "Questo",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T05:16:27.000Z",
          "Titre": "easy to use and clear direction",
          "Contenu": "easy to use and clear direction. Helpful to my small business"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julia Gaines",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T07:17:13.000Z",
          "Titre": "This was so easy!",
          "Contenu": "This was so easy!! I opened up another site to choose the colors and then I adjusted them several times. I resized the logo and easily replaced the first one with the second one. Easy easy."
        },
        {
          "Note": 5,
          "Lieu": "BS",
          "Pseudo": "Sharvone Brice",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T07:16:12.000Z",
          "Titre": "I was pleasantly surprised at how easy…",
          "Contenu": "I was pleasantly surprised at how easy it was to create a QR Code using your tool. I will be sure to recommend to others."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "jenny maltez",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T19:32:16.000Z",
          "Titre": "We have visited Fur Bar a few times now…",
          "Contenu": "We have visited Fur Bar a few times now and each time the experience has been wonderful. Staff are warm and welcoming. Extremely patient and will always take the time to discuss what you expect and your options. Our last visit was with Krista and she was great!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "jessica clark",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T05:57:27.000Z",
          "Titre": "It was super easy to use the website",
          "Contenu": "It was super easy to use the website, very fast response in generating the QR code, and when I checked it, worked with no issues!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Fabio Laini",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T12:48:24.000Z",
          "Titre": "Simply perfect!",
          "Contenu": "First time I needed to generate a QR code for marketing, I did it in 10 seconds. Simple, quick and immediate to navigate.This is exactly what I was looking for!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MotJuste Tirade of Vim Andre J",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T01:31:40.000Z",
          "Titre": "We are provided goodful services absolutely satisfy and completed to customers.",
          "Contenu": "MotJuste Tirade of Vim Andre Juste is General Business Contractor who serve Residentials and Commercials & Offices providing good multiservice in the branch areas. We offer various by giving them out Best."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "tony jefford",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:05:40.000Z",
          "Titre": "So easy to generate",
          "Contenu": "So easy to generate and you can customize it to.you will wonder how you live without it until you try this"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Claris Yearwood",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T01:16:45.000Z",
          "Titre": "The process was simple",
          "Contenu": "The process was simple. Easy to generate and I appreciate that free meant free. No subscribing, no asking for payments etc."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Damien",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T23:58:28.000Z",
          "Titre": "The QR code I had published from QR.IO…",
          "Contenu": "The QR code I had published from QR.IO got paused by them as is was only a trial (I was unaware) and it cost $50US to make it work again.(I had to email to avoid ongoing subscription costs. They were very polite on email and we agreed a one off payment. I had no choice as it had been already used and printed on packaging. I would still recommend this service for putting your company logo in the center of QR but just be aware of subscription costs if you need more than 1."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Joery Labie",
          "Nb_Reviews": 4,
          "Date": "2023-12-18T18:58:31.000Z",
          "Titre": "Easy to set",
          "Contenu": "Easy to set , great choice in different media, Just a great tool"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Cheeky Fox",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T14:33:33.000Z",
          "Titre": "Super fast and easy to get a fully…",
          "Contenu": "Super fast and easy to get a fully customized QR code I love it!"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Rendi Welly",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T12:57:58.000Z",
          "Titre": "Good luck make it better than ever…",
          "Contenu": "Good luck make it better than ever before"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elixirs",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T19:52:29.000Z",
          "Titre": "I was using some other QR generator and…",
          "Contenu": "I was using some other QR generator and was frustrated at how lame it was. Unicorns and glitter, but no worky.This is the opposite. It works. It works hard. It works hard and looks good doing it. No sweat. I'm a fan!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gilbert Monroy",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T04:50:15.000Z",
          "Titre": "Made my first QR code and I didn't…",
          "Contenu": "Made my first QR code and I didn't think it would me so easy....."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Jesus Aris",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T05:19:03.000Z",
          "Titre": "first time ive heard about this service…",
          "Contenu": "first time ive heard about this service think its awesome. Fast and effective. Thanks guys."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Alan",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T10:17:08.000Z",
          "Titre": "Quick and easy to use",
          "Contenu": "Quick and easy to use. Easy to customise and straightforward export of QR code."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Freeland",
          "Nb_Reviews": 4,
          "Date": "2023-12-19T01:32:06.000Z",
          "Titre": "Super easy",
          "Contenu": "Super easy, great interface. Love it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenny Furlow",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:50:53.000Z",
          "Titre": "Wonderful and super easy",
          "Contenu": "Wonderful and super easy!  😊 thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terrye",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T20:13:10.000Z",
          "Titre": "My experience was made great because I…the honest representation which is so rare these days.",
          "Contenu": "My experience was made great because I was able to use the program free just as the description stated.  In addition, my experience was made better in the simplicity of generating the QR code and by the number of choices made available."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Amanda Hornby",
          "Nb_Reviews": 9,
          "Date": "2023-12-19T16:47:10.000Z",
          "Titre": "So easy to use",
          "Contenu": "So easy to use, download, copy and paste anywhere you need to!"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Sello Mashaba",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T11:42:06.000Z",
          "Titre": "Great Experience!",
          "Contenu": "It was easy to navigate and finding it as user friendly. The company should keep it at this level, and also have its categories be static as they are not confusing, unless favorable innovation or modification takes place."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kellen Champion",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T23:28:59.000Z",
          "Titre": "Great Service",
          "Contenu": "Really easy to use website and great quality service provided. Along with this is great customer service. Thank you, Qr.io team."
        },
        {
          "Note": 5,
          "Lieu": "BS",
          "Pseudo": "Griselda Calderon",
          "Nb_Reviews": 3,
          "Date": "2023-12-22T00:39:21.000Z",
          "Titre": "Easy to use and super useful."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Florin Florin",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T17:10:10.000Z",
          "Titre": "very easy and intuitive",
          "Contenu": "very easy and intuitive. Even for the ones who know nothing about working with qr codes"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sabrina Swenson",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T04:41:26.000Z",
          "Titre": "Principal Product Owner",
          "Contenu": "Simple, powerful, easy to use. We created QR codes for all our gear and its changing our way to doing things. Soon, QR codes for everything."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Every Man Counts",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T12:12:36.000Z",
          "Titre": "My experience was easy and manageable",
          "Contenu": "My experience was easy and manageable. This is my first time creating a QR Code for my program.  I will recommend it to many."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sahian Sanabria",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:54:42.000Z",
          "Titre": "Love that I can create and save my QR…",
          "Contenu": "Love that I can create and save my QR code very easily!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott M. Reece",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T03:41:21.000Z",
          "Titre": "Very easy to create a QR code and add…",
          "Contenu": "Very easy to create a QR code and add our logo. Very simple very easy that’s what we need"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Guillermo Riggen",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T20:42:09.000Z",
          "Titre": "Fast and easy",
          "Contenu": "Fast and easy. No insistent \"pay me\" pop-ups."
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Leen",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T20:26:53.000Z",
          "Titre": "Making a QR code is very easy and…",
          "Contenu": "Making a QR code is very easy and convenient to use"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "OGUnikitty",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T17:33:35.000Z",
          "Titre": "The UI is amazing and there is a great…",
          "Contenu": "The UI is amazing and there is a great API associated with it. it's great for once off QR code creations"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Faith Miller",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T00:50:00.000Z",
          "Titre": "Free and easy!",
          "Contenu": "This website has so many options for QR codes, it's so easy to use, and it's free!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Reutershan",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T14:49:02.000Z",
          "Titre": "Easy and fast",
          "Contenu": "Walks you through the very simple process quickly and efficiently. Easier than I expected"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T19:19:13.000Z",
          "Titre": "Super easy to use and set up",
          "Contenu": "Super easy to use and set up. Highly recommend for those in need of a QR Code for their business"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Katarina Kindic",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T12:55:21.000Z",
          "Titre": "I am surprised",
          "Contenu": "I would like to thank Lucy from customer service for resolving my issue :) I would have loved some clearer instructions on the website, but my issue is resolved and I am happy :) I hope the QR code will be working forever like promised"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fredi Brizuela",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T11:53:29.000Z",
          "Titre": "Worked great for project",
          "Contenu": "Worked great for project! I needed a place for my references and this website made making a qr code simple and easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sydney Orr",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T18:42:22.000Z",
          "Titre": "SUPER SIMPLE & EASY!!!",
          "Contenu": "SUPER SIMPLE & EASY!!!! Highly recommend! Added a lot of greatness to my powerpoint!"
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Rashida Al-ghamdi",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T16:10:27.000Z",
          "Titre": "Excellent",
          "Contenu": "The web page that I can put my important stuff in"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beckham Harris",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T03:47:53.000Z",
          "Titre": "the QR code making quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mr",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T22:36:02.000Z",
          "Titre": "Super easy to use and nice options",
          "Contenu": "qr.io was super easy to use and had very nice options for generating a qr code. I was up and running in moments."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emmanuel L.",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T03:32:12.000Z",
          "Titre": "Easy Access and Customization",
          "Contenu": "This place is great for customizing and generating a QR code exactly how you want it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Guy",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:11:28.000Z",
          "Titre": "So easy to use and plenty of options",
          "Contenu": "So easy to use and plenty of options.  Best of all it's free!"
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Juliana Durán Vélez",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T05:14:26.000Z",
          "Titre": "its very easy and friendly to use the…",
          "Contenu": "its very easy and friendly to use the qr creator."
        },
        {
          "Note": 5,
          "Lieu": "AR",
          "Pseudo": "Emilce Garrido",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:21:13.000Z",
          "Titre": "It's very useful and easy to work with",
          "Contenu": "It's very useful and easy to work with, I loved it."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Fred Viloria",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:56:42.000Z",
          "Titre": "Amazing apps"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Raheem Marchant",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T11:09:25.000Z",
          "Titre": "PERFECT PLACE FOR QR REQUIREMENTS"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Gabriela",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T13:56:28.000Z",
          "Titre": "Awesome and super easy process...got my…",
          "Contenu": "Awesome and super easy process...got my business vCard QR Code in seconds!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kaden Potter",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T20:19:31.000Z",
          "Titre": "This site is cracked",
          "Contenu": "This site is cracked. Easy to use. Super reliable."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "eric st laurent",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T17:53:17.000Z",
          "Titre": "upgrade distribution",
          "Contenu": "looking to stop barbarie distribution in a close feild"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shea",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T19:14:29.000Z",
          "Titre": "Exactly what I needed for business…",
          "Contenu": "Exactly what I needed for business cards & my website."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Lies Persyn",
          "Nb_Reviews": 4,
          "Date": "2023-12-04T12:19:50.000Z",
          "Titre": "It was very easy to make a QR-code",
          "Contenu": "It was very easy to make a QR-code, also nice that you can integrate your logo in it!"
        },
        {
          "Note": 5,
          "Lieu": "SI",
          "Pseudo": "Andrea Mariano",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T21:20:25.000Z",
          "Titre": "good and not complicated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kinsey Holt",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T01:39:23.000Z",
          "Titre": "This is super easy to use and very…",
          "Contenu": "This is super easy to use and very customizable. Great for my blog!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Voight",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T09:31:07.000Z",
          "Titre": "Easy to sign up",
          "Contenu": "Easy to sign up, easy to use, free QR code service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T04:46:20.000Z",
          "Titre": "It was easy to use",
          "Contenu": "It was easy to use.  Anyway to name the code something meaningful?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erika Harris",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T00:34:50.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use! Wish free trial lasted longer or program was free to use."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Klant",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T17:00:19.000Z",
          "Titre": "Making a QR-code was easy and quick",
          "Contenu": "Making a QR-code was easy and quick. The proces is clear and you get what you expect."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Custom Bathrooms",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:18:24.000Z",
          "Titre": "Great efficient app"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Omoyajowo Blessing",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:18:07.000Z",
          "Titre": "You are reliable",
          "Contenu": "Because this website is the best"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronald Kraft",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T15:50:20.000Z",
          "Titre": "I am new to creating a QR code",
          "Contenu": "I am new to creating a QR code, but they made it so simple. Great software"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Romain Lestuaire",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:02:08.000Z",
          "Titre": "Perfect if i can keep it for free on a…",
          "Contenu": "Perfect if i can keep it for free on a long time!!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Remy",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:11:07.000Z",
          "Titre": "Quick and easy use",
          "Contenu": "Quick and easy use, great possibilities and no hidden costs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Access Netwave",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T00:23:38.000Z",
          "Titre": "Awesome QR codes",
          "Contenu": "Free! and very easy to use software. I was able to make a QR code for my small company in 60 seconds"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tracy Jones-Moore",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T17:30:32.000Z",
          "Titre": "So very easy to use especially for…",
          "Contenu": "So very easy to use especially for those like me who aren't tech savy."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "kevin hiding",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T22:56:19.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, i use it for directing people to my website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samuel McCray",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T20:23:19.000Z",
          "Titre": "simple, easy to use",
          "Contenu": "i found this website clear, and easy to use. and it's free! way better than most free apps are."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Cook",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T07:01:00.000Z",
          "Titre": "Super easy to make the Code you need !!",
          "Contenu": "Super easy to make the Code you need.   Best site I have ever used for this so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Novani Munawar",
          "Nb_Reviews": 6,
          "Date": "2023-12-12T07:08:54.000Z",
          "Titre": "Very easy process to convert!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sacramen Tell",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T20:20:43.000Z",
          "Titre": "Awesome!",
          "Contenu": "Love the options for designing and tracking QR codes for our group."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dorian Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T02:36:08.000Z",
          "Titre": "QR for your small business.",
          "Contenu": "Amazing keep doing what you doing,thank you."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Nenengscafe",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T17:04:15.000Z",
          "Titre": "very useful and efficient",
          "Contenu": "very useful and efficient. will continue to use this"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Apple Brown Betty",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T00:51:56.000Z",
          "Titre": "Awesome Site",
          "Contenu": "Quick! Easy! Free! Great experience."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Manolis Laoudikos",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T13:19:27.000Z",
          "Titre": "Very easy and very useful",
          "Contenu": "Very easy and very useful, thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Milagros Diaz",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T22:59:09.000Z",
          "Titre": "Foundation",
          "Contenu": "Fast, easy and reliable! Can't complain."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Nathalie Jules",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T06:39:13.000Z",
          "Titre": "It was user friendly and easy to do",
          "Contenu": "It was user friendly and easy to do. Great application"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Winslow",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T16:57:04.000Z",
          "Titre": "Easy to make",
          "Contenu": "Easy to make, drop down menus help customize and add your logo!"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Anneleen",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T14:14:23.000Z",
          "Titre": "Very easy to make a personalised QR."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leonor Lima",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T12:07:48.000Z",
          "Titre": "Very comfortable ride and the driver…",
          "Contenu": "Very comfortable ride and the driver was very polite!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ekamjot Gill",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T18:34:58.000Z",
          "Titre": "I like this app it really good and better than app the other apps I tried",
          "Contenu": "This app is really fool and cool better than the other apps I have tried"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Loreto",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T00:42:18.000Z",
          "Titre": "Honestly so easy to use and worked…",
          "Contenu": "Honestly so easy to use and worked flawlessly."
        }
      ]
    }
  ]
}