{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "racktodoor.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "IsoldexChatman",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T20:42:30.000Z",
          "Titre": "We never received the package and per…",
          "Contenu": "We never received the package and per your website we sent two emails to Customer service asking for contact. Your website states someone will reach out within two days. You never reached out to us and your phone number that's published does not work. So no, you will not get a good review, nor would I recommend you to anyone else."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Heather M",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:24:40.000Z",
          "Titre": "Damaged Goods",
          "Contenu": "I ordered 2 heaters, and both were shattered beyond repair when I opened the package."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Howard Flamm",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T00:30:25.000Z",
          "Titre": "The item arrived not working",
          "Contenu": "The item arrived not working. I want to get a refund. They're not answering of how to return Do not buy anything this vendor is offering"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "WingNut",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T21:35:54.000Z",
          "Titre": "Terrible Vendor",
          "Contenu": "Absolutely the worst vendor that I have ever dealt with. I never received my order. Message stated that I would receive my order between July 18 -22. I never got it. The tracking number that they gave me didn't work. Website says \"shipped\", but track number only says \"tracking number assigned\".I'm trying to get a refund now I strongly recommend staying away from this vendor."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aimee H.",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T15:11:55.000Z",
          "Titre": "Never received my order",
          "Contenu": "Never received my order, after I reached out, was told a replacement would be sent, after a week of no update, reached out again and was then told product was out of stock. They did refund me but will never purchase from this company again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patricia Jones",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T19:42:41.000Z",
          "Titre": "Horrible merchandise",
          "Contenu": "The item was impossible to put together. It was a set of 2 pool chairs and a table  The holes did not line up so you could screw the pieces of the chairs together. The table was made in a way there was zero way to put the top on. The table had no directions on how to out it together and when I contacted customer service they told me to look it up on YouTube. Not super helpful. I will never purchase from this company again. Poorly made merchandise"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "S Smith",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T15:08:43.000Z",
          "Titre": "Flaws in the finish no response from company",
          "Contenu": "I sent two emails with pictures about the item I received. It had been returned previously. There are big flaws in the finish on every piece.This was weeks ago. I have never received a response to return item.Please send an undamaged item and return the damaged one."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "keith schlink",
          "Nb_Reviews": 6,
          "Date": "2023-08-06T07:44:08.000Z",
          "Titre": "Order from them will never do again…",
          "Contenu": "Order from them will never do again contacted them to cancel order they just stoped all communications with me still no money put back on my card had to file a dispute"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shenise",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T00:19:33.000Z",
          "Titre": "Never received",
          "Contenu": "I never received the order only a refund because it was stated the item was SOLD OUT"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carol Baker",
          "Nb_Reviews": 2,
          "Date": "2023-06-29T22:58:02.000Z",
          "Titre": "I ordered the sewing table and I'm…",
          "Contenu": "I ordered the sewing table and I'm missing nine pieces how do I get in touch with customer service?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "George Hasler",
          "Nb_Reviews": 3,
          "Date": "2023-05-23T17:40:38.000Z",
          "Titre": "Tried to return but no response from the company.",
          "Contenu": "Ordered a sewing table.  When I tried to return it, I never got a response from the company. Tried multiple times to contact customer service, but no response.Good luck ordering from this place.  They look like crooks to me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jared Felkins",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T22:22:12.000Z",
          "Titre": "It took forever to ship."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "R Llanos",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T20:02:01.000Z",
          "Titre": "You have the product I was looking for…",
          "Contenu": "You have the product I was looking for at a great price!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Davis",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T16:47:24.000Z",
          "Titre": "Got a amazing product for a really good…",
          "Contenu": "Got a amazing product for a really good price the only con I would have to say is thr delivery dates are not even close to what they should be it took almost a month past the date it said it would be he to arrive"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edgel Perkins",
          "Nb_Reviews": 2,
          "Date": "2023-06-05T22:11:19.000Z",
          "Titre": "Although I didn’t get the order do to…",
          "Contenu": "Although I didn’t get the order do to the item being out of stock. They refunded all of my money. This his in my opinion a honest company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janice Ososke",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T03:19:25.000Z",
          "Titre": "Purchase was fine",
          "Contenu": "Purchase was fine - although had to return item-"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "N Robertson",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T18:01:08.000Z",
          "Titre": "Potable net great for us",
          "Contenu": "Ordering to receiving the product was seamless.  All was easy and stress free. I never give a 5 star."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "lorc",
          "Nb_Reviews": 2,
          "Date": "2023-04-04T19:31:48.000Z",
          "Titre": "Good price, missing manual",
          "Contenu": "Good price. Shipping on time. Only complaint is no assemble instructions. Took a long time to figure out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ROBERT Thompson",
          "Nb_Reviews": 3,
          "Date": "2023-03-14T09:29:16.000Z",
          "Titre": "USEABLE",
          "Contenu": "3 weeks delivery, product was OK  PRICE WAS SUPER."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FLK",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T14:32:18.000Z",
          "Titre": "Great discovery",
          "Contenu": "Hard to find item until I discovered Rack To Door. Glad I found you guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NickL",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T18:12:01.000Z",
          "Titre": "Overall, happy with the chairs.",
          "Contenu": "Chairs arrived perfectly packaged. Assembly was easy enough and they look great. A couple of concerns: 1) chairs are very heavy and awkward to move around; 2) chairs are not stackable which will make them difficult to store in the winter."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie Sokolowski",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T22:02:54.000Z",
          "Titre": "Love Everything about this Company from…",
          "Contenu": "Love Everything about this Company from Their Direct Store/Site and Their Ebay Store.! They have a Great Selection and Most Definitely Very Good Prices with Free Shipping in all of the United States with No Extra Charge which is a Plus for Me.! Also Fantastic Customer Service/Support in My Opinion So Far.!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SivrakTesker",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T11:02:04.000Z",
          "Titre": "Fast, Easy and Fair",
          "Contenu": "amazon sellers have versions of the ratcheting screwdriver i bought for triple the price with less bits. saw an ad at the top of youtube with the exact thing i was already looking into so i decided to check it out thinking it would be some sketch website, turned out to be a legitimate quick and easy to use website. solid job"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Helen B Ross",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T16:05:25.000Z",
          "Titre": "Great Deal Ever !",
          "Contenu": "Very impressive with the quality of the product, I was a bit lire about buying the loungers especially because of the low price and the fact they also came with a table, Poolside they look great! A perfect house gift for my daughter!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anning Song",
          "Nb_Reviews": 2,
          "Date": "2022-11-22T21:08:21.000Z",
          "Titre": "legit deal site",
          "Contenu": "I was there for AUKEY cup car phone holder as aukey official site couldn't add to cart anymore for some reason and not only I found AUKEY brand products at a good discounted price, but also many kitchen items that I like for so cheap! Just got the package yesterday and all the items have nice packaging and shipping is fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wayne Robillard",
          "Nb_Reviews": 2,
          "Date": "2023-10-04T02:03:40.000Z",
          "Titre": "Happy so far",
          "Contenu": "So far the power washer I purchased is working great but I will have to  reserve judgment until I use it a second time as it is replacing a power washer I paid twice as much for which worked once and then leaked all over the place so time will tell."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LaShawn",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T02:31:05.000Z",
          "Titre": "Originally I was upset as my sewing…",
          "Contenu": "Originally I was upset as my sewing desk had missing parts but once I contacted customer service they made sure I was taken care of immediately. Will shop with them again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Bishop",
          "Nb_Reviews": 6,
          "Date": "2022-11-13T05:05:27.000Z",
          "Titre": "Trustworthy for Aukey products",
          "Contenu": "Bought an Aukey universal travel adapter for almost half the price on Aukey’s site - which is out of stock. It’s an authentic Aukey product in original packaging. Shipped within a few days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miranda Furstoss",
          "Nb_Reviews": 2,
          "Date": "2023-04-17T19:25:53.000Z",
          "Titre": "Very fast shipping and great quality",
          "Contenu": "Very fast shipping and great quality. I found the best option for both price and functionality for a balance beam for my daughter at racktodoor. Definitely will be shopping with them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "tremulus",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T23:24:09.000Z",
          "Titre": "Excellent Rings for a Great Price",
          "Contenu": "On-time, fast delivery. Rings and bands/c;asps were exactly as advertised: easy to set up, very stable, and made of quality materials."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George C. Castady",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T19:41:24.000Z",
          "Titre": "No instructions / charger works but can’t remove.",
          "Contenu": "There were no instructions so I just plugged it into the cig lighter. Is it OK to just leave it plugged in to the cig lighter all the time? (If not, I’ve got a real problem, cuz I can’t get it to come out since I put it in; it works but it’s in there so tight I can’t move it). Please help, I don’t want to damage anything by not using it correctly. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mimi",
          "Nb_Reviews": 4,
          "Date": "2023-03-16T19:38:27.000Z",
          "Titre": "Absolutely awesome",
          "Contenu": "Purchase to delivery was great. The product itself is awesome. I purchased a different juice, after using this once I completely stopped using the other. Will recommend to everyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenny Li",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T21:44:43.000Z",
          "Titre": "Nice discounted store",
          "Contenu": "Nice discounted store.  Ships fast and customer service is responsive"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steph Banuelos",
          "Nb_Reviews": 3,
          "Date": "2023-03-16T22:26:53.000Z",
          "Titre": "I was worried this was a scam website…",
          "Contenu": "I was worried this was a scam website since the price was so good, but it wasnt. i found their shop on ebay that had been around for a while. Item delivered very quickly and customer service was responsive"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenda Krizni",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T00:53:23.000Z",
          "Titre": "The patio set was amazing",
          "Contenu": "The patio set was amazing.  Had to get my son to put it together but well worth the money.  Delivered with ease and on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mala Davis",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T21:22:05.000Z",
          "Titre": "Affordable price",
          "Contenu": "Affordable price, sent on time, well made product with easy assembly instructions"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "rgstargmail.com",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T08:07:41.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. My issue was heard and resolved. I am a satisfy customer and look forward to purchasing more items in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Annette Pronio",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T05:39:59.000Z",
          "Titre": "Great Air Purifiers",
          "Contenu": "Bought several air purifiers at a great price and I'm Very pleased with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodney Darden",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T14:01:23.000Z",
          "Titre": "The ease of shopping with very good…",
          "Contenu": "The ease of shopping with very good detail to what I was looking for, not to mention the price and value of my purchase and speedy delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adrienne",
          "Nb_Reviews": 6,
          "Date": "2023-04-21T10:15:15.000Z",
          "Titre": "The price is better than amazon",
          "Contenu": "The price is better than amazon! I highly recommend these humane mouse traps. They definitely work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Loriel",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T20:44:27.000Z",
          "Titre": "Electric mower battery",
          "Contenu": "Got a replacement battery for my Tacklife mower.  It charges and works great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ray",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T00:26:37.000Z",
          "Titre": "Fast shipping on a great product",
          "Contenu": "Surprisingly swell value on a first-rate product delivered intact and on-time. Bravo and my recommendation to racktodoor !!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sabertooth",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T18:54:33.000Z",
          "Titre": "good price",
          "Contenu": "good price, prompt delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anehpets",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T19:43:53.000Z",
          "Titre": "Item was as advertised",
          "Contenu": "Item was as advertised, shipped in the time promised, and great price.  Had no issues."
        },
        {
          "Note": 5,
          "Lieu": "VC",
          "Pseudo": "Amanda W.",
          "Nb_Reviews": 3,
          "Date": "2023-08-03T15:53:08.000Z",
          "Titre": "Great product",
          "Contenu": "Great product. It was a house warming gift for my friend house. The family loves it. Great quality. It is sturdy and with the 3 chairs and table ideal for family."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Guest",
          "Nb_Reviews": 5,
          "Date": "2023-07-06T13:32:53.000Z",
          "Titre": "Works great and great price!",
          "Contenu": "Easy to order, quick delivery, good prices!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RICHARD RAU",
          "Nb_Reviews": 2,
          "Date": "2023-08-06T15:45:03.000Z",
          "Titre": "Easy installation!",
          "Contenu": "Easy installation of my fire table!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Muhammad Haseeb",
          "Nb_Reviews": 2,
          "Date": "2023-05-10T08:48:05.000Z",
          "Titre": "Research your items before ordering. L",
          "Contenu": "Easy to order. Arrived quick. Good quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anning Song",
          "Nb_Reviews": 2,
          "Date": "2023-06-06T00:35:40.000Z",
          "Titre": "The price is unbeatable",
          "Contenu": "The price is unbeatable! And fast delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ISABEL FUCHS",
          "Nb_Reviews": 3,
          "Date": "2023-07-11T05:11:16.000Z",
          "Titre": "I rated them already",
          "Contenu": "I rated them already. This is your second request for same purchase. I gave them 4 stars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra Gargac",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T22:07:35.000Z",
          "Titre": "Great product",
          "Contenu": "The delivery was speedy and the product surpassed my expectation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 3,
          "Date": "2023-07-06T01:46:40.000Z",
          "Titre": "Good quick service as promised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joyful",
          "Nb_Reviews": 6,
          "Date": "2023-05-02T04:57:43.000Z",
          "Titre": "You have the goods",
          "Contenu": "You have the goods, best prices and you deliver!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "nora farkouh",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T03:24:08.000Z",
          "Titre": "Nora's",
          "Contenu": "Good product -- Satisfied with service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T02:41:33.000Z",
          "Titre": "Good communication",
          "Contenu": "Good communication about my order and shipping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mariano Alberto",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T22:09:32.000Z",
          "Titre": "Perfect fit!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marta D Bare",
          "Nb_Reviews": 5,
          "Date": "2023-08-10T23:55:11.000Z",
          "Titre": "Delivered promptly and with care."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dillon Knight",
          "Nb_Reviews": 2,
          "Date": "2023-04-01T06:46:21.000Z",
          "Titre": "Got my charger quickly for half the…",
          "Contenu": "Got my charger quickly for half the price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Simon S",
          "Nb_Reviews": 2,
          "Date": "2023-06-08T20:41:55.000Z",
          "Titre": "Good price",
          "Contenu": "Good price, fast shipping"
        },
        {
          "Note": 5,
          "Lieu": "HN",
          "Pseudo": "Maria Stefany Silva Marino",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T23:52:45.000Z",
          "Titre": "Nice Products",
          "Contenu": "things arrived well and work pretty well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GERARD",
          "Nb_Reviews": 3,
          "Date": "2023-02-14T00:40:17.000Z",
          "Titre": "good price",
          "Contenu": "good price , well packaged, good product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Soundar Sigili",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T23:32:28.000Z",
          "Titre": "I am good with the product  I received"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GERARD",
          "Nb_Reviews": 3,
          "Date": "2023-02-11T19:37:11.000Z",
          "Titre": "well packaged",
          "Contenu": "well packaged, shipped soon. great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raymond Gates",
          "Nb_Reviews": 2,
          "Date": "2023-07-06T01:52:04.000Z",
          "Titre": "Quick",
          "Contenu": "Quick, responsive service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mamoon Abdulla",
          "Nb_Reviews": 2,
          "Date": "2023-07-06T23:11:18.000Z",
          "Titre": "compatible price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2023-02-15T19:26:12.000Z",
          "Titre": "just what I needed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Digna Falcon",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T01:49:35.000Z",
          "Titre": "Very good..."
        }
      ]
    }
  ]
}