{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "raiongroup.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "M. Romagnoli",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T22:14:56.000Z",
          "Titre": "Can't trust these people",
          "Contenu": "Can't trust these people to send the correct battery, nor to reply to requests for a return or refund when they did send the wrong battery."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bruce",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T23:42:34.000Z",
          "Titre": "Custome Service and web site search USLESS…",
          "Contenu": "I USED THE MODEL NUMBER OF MY UPS TO FIND REPLACEMENT BATTERIES. THEN MADE MY SELECTION FROM WHT YOU LISTED.THEY ARE THE WRONG BATTERIES AND YOU MADE NO EFFORT TO CORRECT THE PROBLEM. I trust your website. I enet4ers a Cyberpower model c1350pfcldcd. You are just another lying company. BURN IN h...L"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Kozinets",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T00:53:59.000Z",
          "Titre": "Wouldn't recommend if you have to return something.",
          "Contenu": "The product is good, but getting a refund for a returned product is ridiculous.  10 biz days passed and still nothing.Update: The payment was sent via Amazon Pay and not a direct credit card payment as the seller stated in the response.  Received the refund right after publishing the initial review.  Disappointing that it had to be this way."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Oscar D.",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T02:33:19.000Z",
          "Titre": "I ordered the wrong battery and when I…",
          "Contenu": "I ordered the wrong battery and when I returned it, I never recieved an update. My money and time was wasted with this site."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T02:33:53.000Z",
          "Titre": "SHOP SOMEWHERE ELSE!",
          "Contenu": "I ordered a replacement battery for my Duracell power pack 600‘s. I requested in the special request section of the order that they would make sure that the battery I was ordering was a direct fit replacement for the unit‘s. I received  two 12V 11AH batteries. The batteries inside the power packs were 12V 26AH. A huge difference! When I contacted customer service, I was told that I could return the batteries, but I would have to pay for shipping. The return shipping would cost me over 1/3 of the value of the entire order. They also stated that they did not have a battery that was a direct fit replacement. Which is what I asked for! What a scam! I will never order from this dishonest company again. Be careful. Don’t risk losing money with Raion. Apparently, they have no idea what they’re doing, can’t follow simple instructions, and accept no responsibility for their incorrect actions. That’s just bad business! There are far too many companies selling batteries to risk getting it wrong with Raion."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fredric Belfus executive chef",
          "Nb_Reviews": 4,
          "Date": "2022-04-20T22:47:11.605Z",
          "Titre": "I was supposed to have my battery by…",
          "Contenu": "I was supposed to have my battery by Monday. Today is Wednesday and still NO battery. Better find a more reliable shipper than the US postal service. 😔 VERY disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J.C.L.customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-10T16:24:42.000Z",
          "Titre": "Still don't have my battery after you…",
          "Contenu": "Still don't have my battery after you originally promised it would be delivered in a few days.  It's been 10 days and now the package is missing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AF",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T20:27:11.000Z",
          "Titre": "Ignored my support request",
          "Contenu": "Bought a replacement battery for my UPS, but for whatever reason it did not work so I contacted them for a replacement. After waiting a week I decided to just contact PayPal to get a refund. After an entire extra week I finally got a response to my original message asking that I send the battery back. They seemed to respond quickly enough at this point so I thought things were ok, but the moment I shipped the battery they stopped responding to me again.At the very least, PayPal ruled in my favor with my dispute, and I'm glad they did because it sure seems like Raion Group would've made off with my money if they hadn't. Thanks PayPal.---Update: In response to Raion Group's response, I will give a full timeline of the events on my side.July 3: I contacted Raion Group about the problem with my order through their own channels.July 11: Having heard no response from them, I initiated a dispute with PayPal.July 16: I receive a response from Raion Group through PayPal, but due to technical issues with PayPal, I am unable to view the response. I spend the next couple of days working with PayPal to resolve this, but to no avail.July 18: A PayPal support agent escalates the case without asking me - I recorded evidence and supplied this to PayPal, and through them, Raion Group. In addition to the escalation, the PayPal support agent told me to wait on confirmation from PayPal before working with Raion Group on any sort of refund involving me returning the battery.July 19: I receive my first direct email response from Raion Group. Their email is directly in response to my original message to them on July 3. In this, they ask me to return the battery.July 25: PayPal asks me to work with Raion Group to try and resolve the issue, so I respond to their email from the 19th. We send several emails back and forth between the 25th and the 27th.July 27: I contact PayPal to let them know that I had reached an agreement with Raion Group where they said they would refund me if I returned the battery. I send over the email record of this and ship the battery out. Curiously, Raion Group does not follow up with me after I ship the package.July 31: Raion Group receives the battery at 3:34pm. They do not contact me to let me know or otherwise follow up on the situation.August 1: I follow up with Raion Group to ask about the situation, but receive no response.August 2: PayPal closes the dispute in my favor, giving me my refund. At that point I have still heard nothing back from Raion Group so I leave my review here. Less than 30 minutes after my review goes up, I receive an email response from them referencing my review, and then shortly thereafter they respond to my review directly on here.And now here I am, giving the exact timeline of events that I have in front of me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rick LaBorde",
          "Nb_Reviews": 1,
          "Date": "2022-02-14T22:01:23.000Z",
          "Titre": "The battery sent did not fit the APC…",
          "Contenu": "The battery sent did not fit the APC ups that I have in spite of me looking it up to get the right one."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "T W",
          "Nb_Reviews": 1,
          "Date": "2020-09-24T15:12:13.000Z",
          "Titre": "Batteries are garbage",
          "Contenu": "Bought 12V 7Ah several times over ebay and in many cases the battery wasn't reliably holding a charge anymore after just a few weeks. I never overcharged because I always connect my batteries to a charge controller which prevents overcharging.I wanted to return a some of the batteries I purchased.Return was denied without explanation.These guys sell garbage batteries and don't like complaining customers. Customers complains are just being ignored. They did that with other people, too, on ebay. Read the negative reviews on ebay. I am not the only one having trouble with these batteries and this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter Schuchardt",
          "Nb_Reviews": 3,
          "Date": "2022-02-07T15:35:34.000Z",
          "Titre": "STATUS ORDERS  2424 AND 2417"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JD",
          "Nb_Reviews": 1,
          "Date": "2020-08-12T15:11:06.000Z",
          "Titre": "UPS Batteries died in 30 days.",
          "Contenu": "I bought 2 sets of batteries.  The first set arrived postage due, $53 -- almost as much as the batteries.  I refused per their advice, and ordered a 2nd set, as I needed them quickly.  When they got the first set back, they failed to refund me the price for about a week, and only refunded me after reminding them I hadn't received it yet.  But worse....The second set of batteries on my production UPS didn't even last a month.  Thank goodness completely failed on day 30.  Luckily, I was still in the 30 day return window.  Complete waste of time, worthless.  Put my network and data at risk.  You get what you pay for.  Looking for a better, more reliable battery option -- this isn't it.In response to the comment below: I have provided the order number to Raion, and I submitted proof to Trust Pilot after Raion challenged the authenticity of the review.  After providing the proof, they reinstated the original review.  After reinstatement, I have edited to add additional information, which is why it isn't showing as verified at the moment.Raion Group has an ebay store.  Look for \"RaionGroup\".  I did contact Raion Group's ebay customer service for resolution, and provided that info above.  It's the same company, same logo, same city, same battery, same customer service.The vendor they drop ship for is Raion Group, whom I purchased from.  I don't have issue with their service, I have issue with the quality of your battery provided by the Raion Group ebay store.  Check the ebay store.  Check their website.  Their response here is simply \"that's not us\" even though it's the same logo/city/website for both.  Step up, take ownership, stop dodging things via technicalities, which is now \"well, go complain on ebay.\"  I love when a company says \"Is there any way we can make this right/better\"?  Never received that once.  Taking ownership always impresses."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "steve",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T19:02:22.000Z",
          "Titre": "very poorly packed; expect it to be damaged.",
          "Contenu": "very poorly packed.  two layers of bubble wrap around an 8# battery doesn't cut it.  it should've been double boxed with bubblewrap/styrofoam in between box layers.  if your battery has stick-up type post, they'll most likely be bent or worse."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "BC",
          "Nb_Reviews": 2,
          "Date": "2022-12-21T20:03:32.000Z",
          "Titre": "Customer Support Falls Short",
          "Contenu": "Too little too late. I emailed seeking support on how to test a battery for a toy. This happened to be a time sensitive matter. Days later I received an email asking about my experience. Well no one has ever addressed the concern and I'm now waiting on an RMA number to return it. I would consider purchasing another item from them if needed in the future but this one gets 2 stars."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Debbi Traficante",
          "Nb_Reviews": 2,
          "Date": "2022-10-15T19:56:15.000Z",
          "Titre": "No clue…",
          "Contenu": "I can't honestly say whether the battery works in my charger. Apparently, I have to buy an extra long skinny screwdriver to open the charger to replace battery. Would have been nice to know ahead of time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ANYUH MORIARTY",
          "Nb_Reviews": 1,
          "Date": "2022-04-04T14:14:32.000Z",
          "Titre": "I ordered the battery last Sunday…",
          "Contenu": "I ordered the battery last Sunday (3/27), it indicated it will take 3-4 business days for me to receive it. Now it’s just over a week, I still don’t see it’s coming."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Danny C Malone",
          "Nb_Reviews": 2,
          "Date": "2021-05-09T23:38:50.000Z",
          "Titre": "I have not received my merchandise yet…",
          "Contenu": "I have not received my merchandise yet after a long delay.  The tracking number just states \"delayed\" in shipment.Update: I still have not received my battery package.What is going on?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Zephyn Stephens-Avery",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T15:28:17.000Z",
          "Titre": "Good product but...",
          "Contenu": "Shiping was double than what was expected, and box came with one corner completely ripped. Once the straps were cut the box could no longer be carried without batteries falling out... Batteries were great though"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ToolCJ",
          "Nb_Reviews": 2,
          "Date": "2023-07-01T22:42:25.000Z",
          "Titre": "Hard to contact during business hours",
          "Contenu": "Hard to contact during business hours. Had to get back to me on my question. The associate I had dealt with on a previous transaction was knowlegeable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "matthew roach",
          "Nb_Reviews": 3,
          "Date": "2023-03-16T11:20:56.000Z",
          "Titre": "I really like the fact of how easy it…",
          "Contenu": "I really like the fact of how easy it was to order and delivery was quick. I have an issue with the type of battery I have received due to an application error. Hoping to get this issue resolved quickly ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-01T23:18:16.000Z",
          "Titre": "Great battery but tracking shipment requires attention.",
          "Contenu": "The battery I ordered was exactly as advertised and I appreciate the extensive description including physical dimensions. I ordered from Raion specifically because I required a shorter height than generic lawnmower batteries. It dropped into the battery compartment and after I attached the leads, started my lawnmower without any issues. The ordering process was easy but the tracking was below average at best. I never was able to check on where my shipment was as it constantly said it was still waiting pickup in fact the day it delivered, the site said it was still awaiting pickup. If this process is fixed, I would give 5 stars no problem."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Karydas",
          "Nb_Reviews": 2,
          "Date": "2023-03-31T22:16:40.000Z",
          "Titre": "A bit deveptive on getting what you order",
          "Contenu": "The manufacturer of the battery advertised at checkout was NOT the same as the one sent. I used the one sent only because I was in need."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T16:58:34.000Z",
          "Titre": "battery was packaged poorley and came…",
          "Contenu": "battery was packaged poorley and came in damaged."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sydney Seal",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T01:31:54.000Z",
          "Titre": "So for the battery doesn’t charge",
          "Contenu": "So for the battery doesn’t charge. Took it out of the buster box and tried a battery charger and it still wouldn’t charge. May have to send it back if something doesn’t change ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-14T14:54:11.000Z",
          "Titre": "Order lost at post office",
          "Contenu": "Order lost at post office, still waiting for replacement or tracking"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-04T02:13:50.000Z",
          "Titre": "Order received 14th of March sent the…",
          "Contenu": "Order received 14th of March sent the 15th great, but not received till the 25th 10 days latter. The pkg.looked like it had been abused & possibly had gotten rewraped at the P.O. .Came in bad shape terminals bent and apparently had got wet.but a appears  to be O.K.after charging. Paid 14 dollars for shipping not happy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "June",
          "Nb_Reviews": 1,
          "Date": "2021-06-01T20:43:04.000Z",
          "Titre": "Their shipping was super fast",
          "Contenu": "Their shipping was super fast.  Received my batteries within three days.  Bad part was the batteries received wasn't the batteries I ordered.  I ordered a two pack 12 v batteries for my Tennis Tutor.  I needed T2 terminals.  The batteries received wasn't the same name or model number as the picture on the internet and they were T1 terminals.  I called and asked if they could send F1 to F2 terminal adapters so I could use the batteries and was told they could not.  I had to make a trip to a Batteries Plus local store to get the adapters.  Should have just gotten the batteries from them as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jm",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T21:40:10.000Z",
          "Titre": "Very good communication from RAION…",
          "Contenu": "Very good communication from RAION about the status of my order, and ETA."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KLo",
          "Nb_Reviews": 2,
          "Date": "2023-01-03T23:33:03.000Z",
          "Titre": "The batteries were received in a timely…",
          "Contenu": "The batteries were received in a timely fashion. I will see how they take a charge and remain charged. Two of the batteries had impact marks on the tops indicating they were either dropped or struck. The dents are about an inch in size, both batteries on the same area, on top next to the terminal. I don't see any indication of leaks so far. The shipping package was not damaged so it must have happened prior to shipping."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mariusz Cygan",
          "Nb_Reviews": 2,
          "Date": "2022-08-08T02:04:18.000Z",
          "Titre": "Need better protection for big…",
          "Contenu": "Need better protection for big batteries (battery cartridge) .  Everything would be great, but the battery cartage (RBC7 - dual battery) came damaged.  Just the fuse, plastic covers and batteries came separated.  Batteries itself were OK.  Just needs little bit better packaging in this case.  Otherwise, costumer service and batteries itself are great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Loraine Zingsheim",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T05:48:55.000Z",
          "Titre": "The Raion batteries were about an inch…",
          "Contenu": "The Raion batteries were about an inch bigger than the original Ryobi batteries so some adjustments needed to be made so they fit.  It took a few hours and a trip to the hardware store to make them fit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mountaineer",
          "Nb_Reviews": 2,
          "Date": "2023-04-05T23:54:01.000Z",
          "Titre": "Quick shipping and quality batteries.",
          "Contenu": "Quick shipping and well packaged.  Quality of batteries.  I was expecting Raion Group batteries, but got some other brand.  Not a big issue as I didn't think Raion Group made batteries, but that was the impression with the order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T19:03:50.000Z",
          "Titre": "Batteries are working great and fit…",
          "Contenu": "Batteries are working great and fit perfectly…I thought the website said they came charged to reduce chance of an issue during replacement recharge, but mine were pretty much at zero percent charged.. I kept critical drives offline until sufficient charge (overnight)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen McDonald",
          "Nb_Reviews": 2,
          "Date": "2023-01-21T13:16:52.000Z",
          "Titre": "Perfect fit but replacement a bit complicated",
          "Contenu": "Needed to have an exact replacement to fit into the case. The Raion battery was a perfect fit. I could have used a how-to on the doing the replacement. About a dozen screws of several sizes for the Vector product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fred Connors Jr",
          "Nb_Reviews": 3,
          "Date": "2023-11-14T03:38:10.000Z",
          "Titre": "You did fine",
          "Contenu": "You did fine, thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TS",
          "Nb_Reviews": 2,
          "Date": "2022-08-19T17:57:13.000Z",
          "Titre": "Fantastic company",
          "Contenu": "Fantastic company.  Website needs a little help to determine the correct battery needed.  Made a phone call to help line and was given all the information I needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Darryl Gobert",
          "Nb_Reviews": 2,
          "Date": "2022-10-05T00:46:20.000Z",
          "Titre": "Look before you order for post type.",
          "Contenu": "The replacement batteries were the same size and functionality was the same as the original batteries. The only issue that I had to resolve was that the battery post on the original batteries were threaded into the top of the batteries and the replacement batteries has an exposed top post with a non threaded hole. I was able to make the necessary adjustments to make everything work so all good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer Doc. B",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T00:22:11.000Z",
          "Titre": "For as I can tell the battery is what I ordered",
          "Contenu": "For as I can tell the battery is what I ordered, the price is in range of what I expected, shipping was faster than I than I expected, I receive it Sunday Jan-29-23 and put on charge, about the only complaint I have it was a  little to much crap getting through check out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-08T05:16:49.000Z",
          "Titre": "Raion fulfilled my order expeditiously…",
          "Contenu": "Raion fulfilled my order expeditiously and at a good price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Darryl Gobert",
          "Nb_Reviews": 2,
          "Date": "2022-10-04T21:41:49.000Z",
          "Titre": "Batteries for jumper.",
          "Contenu": "Everything works but had to do a small modification to battery post to make them fit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Neil",
          "Nb_Reviews": 3,
          "Date": "2021-07-22T21:19:50.000Z",
          "Titre": "Delivery took a little longer that…",
          "Contenu": "Delivery took a little longer that expected. Product seems to be working fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elwin Thomas",
          "Nb_Reviews": 4,
          "Date": "2021-10-08T01:25:52.000Z",
          "Titre": "I have been buying replacement …",
          "Contenu": "I have been buying replacement  batteries from the Raion Group for years. Great prices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jackie",
          "Nb_Reviews": 2,
          "Date": "2022-02-21T21:07:53.000Z",
          "Titre": "Seems like a good battery",
          "Contenu": "Seems like a good battery, only time will tell. Quick shipping and reasonable price!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T14:02:56.000Z",
          "Titre": "new sonic pride batteries",
          "Contenu": "exactly as ordered took two minutes to install works great thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Art",
          "Nb_Reviews": 1,
          "Date": "2021-08-02T14:05:46.000Z",
          "Titre": "Took little bit long to receive item…",
          "Contenu": "Took little bit long to receive item but perfect fit will buy again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DrWill Alley",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T15:34:53.000Z",
          "Titre": "Good pricing I think mostly what I like about your…",
          "Contenu": "I think mostly what I like about your company is there fair prices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-06T13:40:28.000Z",
          "Titre": "I don't think it is your company's…",
          "Contenu": "I don't think it is your company's fault, but I haven't received my package yet--I tracked it, and it said it was picked up at your facility on Nov 30---in Richardson--yesterday, Dec 5, I checked and it is in Coppell, TX. Again, I don't think this is an issue with your company"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "robert rotondo",
          "Nb_Reviews": 1,
          "Date": "2020-05-12T14:02:36.000Z",
          "Titre": "would have a 5 star if the battery had differant cable mounting",
          "Contenu": "would have a 5 if the battery had a built in nut as the orinal snap on did,your battery works just have to deal with stand up posts and bend the cable end for installation."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shane Becker",
          "Nb_Reviews": 1,
          "Date": "2020-07-08T17:41:42.000Z",
          "Titre": "Product shipped right away and received…",
          "Contenu": "Product shipped right away and received it very fast. It fit perfect when I installed the battery. Haven’t had to use the tool yet to give it a full review."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NDF",
          "Nb_Reviews": 1,
          "Date": "2020-05-26T14:14:03.000Z",
          "Titre": "Batteries arrived in good shape",
          "Contenu": "Batteries arrived in good shape - work greatWould have given 5 stars if you used UPS to ship. United States Postal Service took forever to deliver"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael  Barton",
          "Nb_Reviews": 1,
          "Date": "2020-08-24T06:03:44.000Z",
          "Titre": "The United States Postal Office…",
          "Contenu": "The United States Postal Office priority mail was a day late. Other than that everything so far so good. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda Boyd",
          "Nb_Reviews": 2,
          "Date": "2020-04-18T11:28:57.000Z",
          "Titre": "Love the battery",
          "Contenu": "Love the battery.  Ex - heavy.  fit perfectly.  Shipping took 6 days.  that is the only reason for a 4 rating."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elwin Thomas",
          "Nb_Reviews": 4,
          "Date": "2020-10-09T05:00:59.000Z",
          "Titre": "I use Raion Group when ever I need…",
          "Contenu": "I use Raion Group when ever I need batteries for my ups, they always have what I need."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elwin Thomas",
          "Nb_Reviews": 4,
          "Date": "2019-02-26T22:04:18.000Z",
          "Titre": "Great products and service",
          "Contenu": "Great products and service. I use them every time I need batteries."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis Kikendall",
          "Nb_Reviews": 5,
          "Date": "2020-02-02T11:48:32.000Z",
          "Titre": "Got what I ordered on time :-)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-13T04:22:50.000Z",
          "Titre": "You know",
          "Contenu": "No communication"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pak Y. PA",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T08:06:55.000Z",
          "Titre": "20 year old Diehard 750 charger",
          "Contenu": "I almost threw out my 20 year old portable battery jumper because of old recharging battery won’t recharge. I found this replacement battery from Raion by chance on internet that was compatible to my old Diehard 750 portable charger, it was delivered in a timely matter. I installed the new battery and it’s charging up like it suppose to. A new average price portable charger $100. Replacement battery from Raion not expensive. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T01:21:14.000Z",
          "Titre": "Parmak replacement battery",
          "Contenu": "Product as described and was delivered within 4 days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T21:35:53.000Z",
          "Titre": "Your part of this transaction went…",
          "Contenu": "Your part of this transaction went well.  However, the \"priority\" mailing part did not go as well.  The priority package took 5 or 6 days from Texas to Kansas and was a little roughed up when I got it.  The contents were not damaged and the batteries were fine, but I question if USPS Priority padded envelope is the way to ship these batteries.    Regards,  Gary Wike Olathe, Kansas"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Lilles",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T19:21:03.000Z",
          "Titre": "The product came in a timely manner and…",
          "Contenu": "The product came in a timely manner and the batter worked great. A little note with it saying if it was charged or the best way to take care of the batter would have been helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben Marine",
          "Nb_Reviews": 2,
          "Date": "2023-07-05T13:25:20.000Z",
          "Titre": "-:¦:-•:*'\"\"*:•.-:¦:-• * OUTSTANDING! * •-:¦:-•:*'''''*:•-:¦:-",
          "Contenu": "A friend of over two decades gifted me a Stanley J309 portable jump starter it didn't work and needed a battery. Thank you so much for a reasonably priced internal battery replacement. Like magic, it is now working as it should.BAM! ¤º°`°º‹(•¿•)›º°`°º¤"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Lauber",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T06:04:23.000Z",
          "Titre": "Great Prices and Great Service",
          "Contenu": "Rarely has an online purchase gone so well. First Raion Group had the best price for the replacement batteries for my Cyberpower Back Up Power supply -- by far. About 33% less than the next lowest price out there. Cyberpower charges $104 for the replacement batteries; Raion Group just $30. The ordering process was smooth. And much to my pleasant surprise, the package arrived two days later as promised. Cudos to them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anwar",
          "Nb_Reviews": 2,
          "Date": "2023-06-06T22:56:22.000Z",
          "Titre": "Overall 5 star experience!",
          "Contenu": "Fast ordering process; excellent range of products and availability with unbelievably good and reasonable prices. Fast delivery with standard shipping and product works as advertised. Wish I’d known about this company past few years since I overpaid for Batteries for UPS several times via Amazon. Would definitely use again for office needs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe B",
          "Nb_Reviews": 3,
          "Date": "2023-01-20T22:03:47.000Z",
          "Titre": "Great replacement battery for old CyberPower UPS for an excellent price",
          "Contenu": "Needed a replacement battery for an old cyberpower UPS. Cyberpower branded replacements were hard to find and expensive. Raion had a replacement including the special wiring harness that made the swap out really easy. They even had a video on how to do it. Shipping was very quick and appreciated!  Will certainly use them again for future replacements."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry Newell",
          "Nb_Reviews": 2,
          "Date": "2022-09-14T21:33:17.000Z",
          "Titre": "Replacement Batts Good Experience",
          "Contenu": "Did online search for replacement batts for my Liftmaster battery backup unit (Model 475LM). Found YouTube by Raion Group showing how to replace the batts alongside their advertisement. Liked the video and larger voltage of Raion batts. Ordered from Raion website with no complications, liked I could pay with Amazon pay, fair price, batts arrived by UPS within 2 or 3 days. Batts fit my unit perfectly, just as described in Raion video. Hope the batts last."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jake",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T20:57:27.000Z",
          "Titre": "Batteries were promptly shipped after…",
          "Contenu": "Batteries were promptly shipped after some back and forth emails concerning questions I had. Nobody answers the published phone number but they do respond to emails.  One of the 4 batteries I ordered was defective (7.3V, not 12V) and they quickly sent a replacement and paid for the return costs. Very happy with the battery backups for my Liftmaster garage door opener overall.  Literally plugged them in and mounted the pack back on the wall.  Posted video on their website was all I needed to understand what to do to replace old batteries."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Brooks",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T16:35:54.000Z",
          "Titre": "What's not to love...",
          "Contenu": "I was so impressed with the pricing on batteries for my parmac 12v solar hot wire. I stumbled onto Raion Group website looking for abetter price than Parmac and was so surprised. The batteries arrived in 3 days and work perfectly. Great product, great prices and fast shipping  equal a company I will purchase from again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gordy",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T22:08:35.000Z",
          "Titre": "Late day order",
          "Contenu": "I ordered these late in the day, and they got them shipped out same day. And they sent good communications on the status of the order. Installed them in 2 UPS, and let them recharge for 24 hours before I plugged in my very light loads (a wireless router on one, and a fiber modem on the other). Interested to see if there is any noticeable difference between the original lead acid and the replacement  AGM batttery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LL Harris",
          "Nb_Reviews": 1,
          "Date": "2022-02-07T22:46:18.000Z",
          "Titre": "The way things are supposed to happen !",
          "Contenu": "Ordering my replacement batteries from Raion worked out GREAT. Shippingthrough USPS was OUTSTANDING - two days ! The batteries came with the required female plugs already attached to the terminal leads. Everything was \"plug & play\", couldn't have been easier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Serengeti Sam",
          "Nb_Reviews": 2,
          "Date": "2022-06-18T17:13:41.000Z",
          "Titre": "Very Rapid Shipping and GREAT Product",
          "Contenu": "I received the replacement batteries for the Battery Backup for my garage door opener VERY quickly.  Great product that was easily installed using their install video.  My garage door opener is no longer beeping at me because of the old failed batteries.Now if they just last as long (6 years) as the factory original  batteries......."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T15:27:06.000Z",
          "Titre": "Best Deal & Fast Shipping",
          "Contenu": "The battery I ordered was cheaper here than anywhere else, including with shipping. It arrived sooner than expected and is a perfect fit in my UPS. I've had it going for a few days now with no issues. I will likely purchase more from this seller in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paint Works",
          "Nb_Reviews": 4,
          "Date": "2023-10-05T17:34:18.000Z",
          "Titre": "Easy to order",
          "Contenu": "Easy to order, very timely was on time. Product packed very well no damage. Exactly as described very pleased along with excellent pricing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D Blevins",
          "Nb_Reviews": 1,
          "Date": "2022-08-15T22:22:31.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience, fast ship and even better fast install! Having the leads already attached made the install much faster and I prefer soldered connections rather than crimped. Remounted the Evercharge, let it charge and no problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David F Moon",
          "Nb_Reviews": 3,
          "Date": "2023-08-08T04:28:21.000Z",
          "Titre": "Items received were as specified",
          "Contenu": "Items received were as specified.   Seller provided updates on shipping progress and order arrived promptly.  Batteries were well boxed to prevent damage during shipment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve S Broggie",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T17:03:35.000Z",
          "Titre": "Low prices. No problems.",
          "Contenu": "This was my 3rd order and like the others, the batteries were delivered on time, packaging intact and exactly as ordered. Can't beat the prices either."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandy Cain",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T16:35:57.000Z",
          "Titre": "Order prompt in arrival time ,exactly…",
          "Contenu": "Order prompt in arrival time ,exactly what I asked for , and reasonably priced :) Very pleasant professional experience!! I Will order my battery needs for future indevours from Raion group. Thank you 😊"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T01:53:31.000Z",
          "Titre": "Great RBC7 replacement.",
          "Contenu": "The replacement RBC7 battery was a bigger capacity and was received a day before the expected delivery date. It was an exact replacement size and after the initial charge period it works well. I need to run a time test to see the on battery runtime.... to be continued."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Lindaman",
          "Nb_Reviews": 2,
          "Date": "2023-01-06T01:46:59.000Z",
          "Titre": "New electric fence battery",
          "Contenu": "Needed a new battery for the electric fence. Didn't like the price on the manufacturer's. Found Raion's generic battery at a much better price. Delivery was fast too! Now to see how long it lasts. (((Fingers crossed))) that it will las longer than the last one - which was name brand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andy Stahlman",
          "Nb_Reviews": 2,
          "Date": "2023-08-08T15:07:03.000Z",
          "Titre": "Batteries showed up quickly and were…",
          "Contenu": "Batteries showed up quickly and were perfect replacements for my Ryobi riding lawn mower. Haven’t mowed the lawn yet but everything fired up right away."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose Vazquez",
          "Nb_Reviews": 1,
          "Date": "2022-01-22T18:37:39.000Z",
          "Titre": "Highly recommended.",
          "Contenu": "Highly recommended.Straight forward service.  Text using their contact number was best to communicate and ask questions. Got exactly what I ordered.  Answer all questions and when I had a problem offered exchange.  I determined my issues was not with the batteries but is really good to know they support their products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark D",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T23:19:43.000Z",
          "Titre": "Very Highly Recommend!",
          "Contenu": "Perfect! I ordered replacement batteries for an APC UPS, a total of 16 batteries. I had concerns about how such weight would be protected in shipping, etc. But everything was just fine. I got what I ordered. It shipped quickly --and my experience couldn't have been better."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T15:48:39.000Z",
          "Titre": "Very nice experience!",
          "Contenu": "Very nice experience from beginning to end. Fast shipping & super fresh product. I do wish they had local pickup!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose C Cabanillas",
          "Nb_Reviews": 6,
          "Date": "2022-06-05T18:57:08.000Z",
          "Titre": "Great delivery on product as advertised",
          "Contenu": "Batteries (2 as the replacement for the original 2 batteries in the mower) came fast, as promised, and with all needed attach hardware, which was a bonus.  It fit right in the mower.  I did pull out the heavy duty two sided tape to hold the two 12V batteries together, but that was not a problem.  Charged up and the mower runs like new."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aylinh Phou",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T04:47:42.000Z",
          "Titre": "A+ service. 10/10 would highly recommend.",
          "Contenu": "I am so happy with my purchase and customer service experience with this company. I ordered a battery and I was able to talk to a representative who also text me about how to replace the battery when it arrives, he was very kind and helpful. Great service, I will definitely purchase from here again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pavel",
          "Nb_Reviews": 3,
          "Date": "2023-01-01T13:56:20.000Z",
          "Titre": "My new year is happier now",
          "Contenu": "I’m a paraplegic and I’m basically dead in the water when the batteries in my mobility scooter go bad.  Glad I found a battery distributor physically closer to where I live (my previous distributor was on the east coast); I get my replacement batteries faster and I save on shipping costs.  The new batteries are already installed and the charge is topped off so I’m ready to party!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Colin",
          "Nb_Reviews": 2,
          "Date": "2022-09-13T16:06:54.000Z",
          "Titre": "Came quickly, good product",
          "Contenu": "Came quickly. Well packed, buy them nowBefore USPS figures it out. Less than half the price of genuine APC. Easy to swap the components. I even reused all the stickers. So far performance seems equal. I won’t know more until 3 years time as that’s how long the originals lasted."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T13:36:01.000Z",
          "Titre": "Great product and service",
          "Contenu": "This is the second replacement battery I purchased in order to repair a jump pack. Afterwards the jump pack has been the best performing jump pack at my dealership. I am very happy with the product, ease of ordering, and speed of delivery. Great product and service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-03T18:19:10.000Z",
          "Titre": "This is a quality battery",
          "Contenu": "This is a quality battery, and was shipped very quickly.  The battery is being used as a replacement in an APC battery backup.  It’s far, far less expensive than an APC-branded battery, and has been working fine."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Horn",
          "Nb_Reviews": 1,
          "Date": "2022-10-06T21:08:54.000Z",
          "Titre": "12v-40ah.  Times 2",
          "Contenu": "The first time I attempted to order two 12v 40ah batteries, I had an issue with the website kicking me out. I waited a week,tried again and all went well. Shipping was usps,reasonable rate and fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WDB",
          "Nb_Reviews": 1,
          "Date": "2022-04-29T03:01:19.951Z",
          "Titre": "My first order was lost upon the post…",
          "Contenu": "My first order was lost upon the post office picking it up.  It still hasn't arrived or started moving on the tracking.  My order was canceled and I ordered again.  This time the order was fast and worked as it should.  Great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred Young",
          "Nb_Reviews": 1,
          "Date": "2022-10-08T20:13:16.000Z",
          "Titre": "Great service, excellent products",
          "Contenu": "Great service, excellent products.  My phone call was responded to quickly, with a text and a link to the product I needed.  I was able to quickly order the product, which arrived quickly, and put into service the same day.  This UPS not functions perfectly.  I then ordered a second set of batteries, and will order two more sets soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Parachino",
          "Nb_Reviews": 2,
          "Date": "2022-07-07T20:31:27.000Z",
          "Titre": "I had a minor issue that was resolved…",
          "Contenu": "I had a minor issue that was resolved in a very timely manner. The batteries are doing there job. I will be using Raion Group in the future for my battery needs, and can highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Sherman",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T16:12:09.000Z",
          "Titre": "UPS Replacement Batteries",
          "Contenu": "Batteries were priced well with reasonable shipping.  Order was received quickly.  They are perfectly voltage matched and are working great.  Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad Barber",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T15:35:52.000Z",
          "Titre": "The Raion battery was a direct…",
          "Contenu": "The Raion battery was a direct replacement to the Parmak 12 battery for half the cost. Quick delivery as well. Would recommend this company to my friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J.L.P. II",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T21:48:06.000Z",
          "Titre": "Completely satisfied so far",
          "Contenu": "First, the product was exactly as it was represented.Second, the order and shipment info was accurate and timely. Third, the price was fair."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Becky",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T01:02:43.000Z",
          "Titre": "Great battery",
          "Contenu": "The battery ordered was exactly the one I needed, it was a lot less then what other companies wanted for the exact same battery. It shipped quick and was packaged well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Pichardo",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T17:47:10.000Z",
          "Titre": "Well done order…"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Stock",
          "Nb_Reviews": 4,
          "Date": "2022-07-13T14:21:11.000Z",
          "Titre": "Very Low Price, Fast Delivery!",
          "Contenu": "Not only was their price very low, the 6-volt car battery I needed came in less than a week! This goes into a Barbie Doll Lamborghini that our grand daughter used to drive and she thinks the car is gone. That car is going to HER daughter today!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T05:55:41.000Z",
          "Titre": "Good to Go",
          "Contenu": "Ordered, shipped, applied new replacement batteries = garage door backup system updated!All is Great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd Herzog",
          "Nb_Reviews": 1,
          "Date": "2022-06-13T16:21:40.000Z",
          "Titre": "Will buy again",
          "Contenu": "Shipped quickly. batteries arrived safely.  crazy good job stuffing 2 medium-sized SLA batteries in to a USPS \"if it fits, it ships\" padded envelope."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T03:34:17.000Z",
          "Titre": "Very reasonable price for batteries and…",
          "Contenu": "Very reasonable price for batteries and arrived quickly and fully charged.    Fit perfectly in my Rad 2 go scooter."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Satisfied Customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-11T16:22:36.000Z",
          "Titre": "Highly Recommend",
          "Contenu": "Excellent pricing.  Fast shipping.   This was my 2nd purchase.   Good product exactly as described.  Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T23:45:21.000Z",
          "Titre": "Everything as it should be",
          "Contenu": "Everything as it should be, descriptions, communications, delivery; will buy from again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wayne Dorman",
          "Nb_Reviews": 3,
          "Date": "2023-05-04T19:33:04.000Z",
          "Titre": "The batteries were as advertised",
          "Contenu": "The batteries I ordered were just as advertised. You said you balanced the batteries and they were balanced to .1 volt. Also, you said I would get them in 3 days. They were shipped the same day I ordered them and in 3 days they were delivered. I've installed them and they work as they should."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis",
          "Nb_Reviews": 2,
          "Date": "2023-09-09T23:55:32.000Z",
          "Titre": "Very good battery!",
          "Contenu": "Very good battery!, exactly as described before I purchase item. Very good price also."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hector Lara",
          "Nb_Reviews": 4,
          "Date": "2023-08-01T00:38:37.000Z",
          "Titre": "Replacement Battery for Diehard 750 jump starter",
          "Contenu": "I received it very fast and I was able to install it fast.  I liked that the price was very reasonable and not overpriced.  I now have a fully working Sears Diehard 750 jump starter."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danny Hughes",
          "Nb_Reviews": 2,
          "Date": "2023-08-09T02:39:40.000Z",
          "Titre": "Great value!",
          "Contenu": "Shipping was fast, comunication great. The price is right and it fit perfectli in mu old UPS."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T20:53:17.000Z",
          "Titre": "Wonderful customer experience",
          "Contenu": "Wonderful customer experience. They had just what I needed. Easy online ordering and rapid delivery. What else could you ask for?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B. Ryan",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T17:18:46.000Z",
          "Titre": "My Order came in quickly & @ this…",
          "Contenu": "My Order came in quickly & @ this moment is doing great. The price was very good for both products & I appreciate the technical organization & cooperation with Amazon Account for Payment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T18:25:27.000Z",
          "Titre": "The online ordering is great easy to…",
          "Contenu": "The online ordering is great easy to use. Easy to find products for what you are looking for. Just type what kind of product you are looking for and gives you choices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T01:45:31.000Z",
          "Titre": "Customer Service",
          "Contenu": "I ordered the wrong battery and the support group were very helpful with the return and ordering the correct one."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "satisfied customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T20:35:44.000Z",
          "Titre": "Quality Battery",
          "Contenu": "Quality Battery. Fast shipping and came well packed. Brought new life to my Toro Cordless Trimmer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald",
          "Nb_Reviews": 3,
          "Date": "2022-08-12T01:20:10.000Z",
          "Titre": "Very nice company to work with.",
          "Contenu": "I got exactly what I wanted and the shipping was very quick. Communication was excellent. I appreciate the service. I’ll be back!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JK in PA",
          "Nb_Reviews": 2,
          "Date": "2023-01-06T23:57:33.000Z",
          "Titre": "Chamberlain Replacement Battery",
          "Contenu": "Straightforward information about the battery I was receiving. Great pricing and trackable shipping. Very competitive price for a quality battery. Would buy again without question."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Burns",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T03:07:42.000Z",
          "Titre": "Great Experience",
          "Contenu": "The order and follow up emails were timely, and the product arrived well packed and in perfect shape."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elias Martinez",
          "Nb_Reviews": 5,
          "Date": "2022-09-08T17:54:42.000Z",
          "Titre": "very fast delivery",
          "Contenu": "very fast delivery, these batteries  work great, I am a user for more than three years !!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Verified Purchaser",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T20:20:28.000Z",
          "Titre": "Incredibly fast processing and…",
          "Contenu": "Incredibly fast processing and shipping. Made it in time to install in my son’s scooter in time for the weekend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sparky",
          "Nb_Reviews": 2,
          "Date": "2022-10-03T21:37:42.000Z",
          "Titre": "Great product at a great price",
          "Contenu": "Great product at a great price. Shipped immediately, and arrived quickly. Couldn’t be happier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "elton deysher",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T16:12:30.000Z",
          "Titre": "fast deliver",
          "Contenu": "fast deliver, great price and good quality product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe B",
          "Nb_Reviews": 3,
          "Date": "2023-02-05T01:50:06.000Z",
          "Titre": "Good product, prices and quick shipping",
          "Contenu": "Got exactly what I ordered at a good price and quick shipping at a reasonable cost. Will order from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Manu",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T07:53:20.000Z",
          "Titre": "RG126-22HR Batteries for APCRBC117",
          "Contenu": "Listed battery specs were slightly superior to the competitors'.Prices was reasonable and competitive.Shipping was timely and quick.Overall a very good shopping experience.Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah Cooke",
          "Nb_Reviews": 1,
          "Date": "2022-06-11T00:34:58.000Z",
          "Titre": "Quick shipping with tracking provided",
          "Contenu": "Quick shipping with tracking provided, extremely well packaged, and the battery  works great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T23:50:43.000Z",
          "Titre": "Great experience all around",
          "Contenu": "Helpful YouTube video, easy to order, good price, prompt delivery. So easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Stoltz",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T00:34:46.000Z",
          "Titre": "Right product right price right time",
          "Contenu": "These folks had the right product at the right price and got it here in very short order. It was easy to figure out which battery pack I needed for my specific unit. I swapped it out and it worked like a champ. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Lewis",
          "Nb_Reviews": 2,
          "Date": "2022-04-10T22:44:27.000Z",
          "Titre": "Fast delivery and exactly as ordered",
          "Contenu": "Fast delivery and exactly as described. Replacement was a snap, and now my garage door UPS is fully operational."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela Branting",
          "Nb_Reviews": 3,
          "Date": "2022-10-10T02:05:48.000Z",
          "Titre": "Excellent turn around",
          "Contenu": "Placed my order early one afternoon and they had my product boxed and shipped the very same day.   So fantastic!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roy Ewert",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T16:06:38.000Z",
          "Titre": "Everything worked great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Haralick",
          "Nb_Reviews": 2,
          "Date": "2022-04-05T21:22:43.000Z",
          "Titre": "timely",
          "Contenu": "Batteries were charged and put into service right away. Delivery time was quick."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald",
          "Nb_Reviews": 3,
          "Date": "2022-08-04T23:22:12.000Z",
          "Titre": "Great place to shop.",
          "Contenu": "You had exactly what I wanted and shipped it quickly and safely. Great service and communication. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dale Montecino",
          "Nb_Reviews": 9,
          "Date": "2022-03-10T11:33:33.000Z",
          "Titre": "Everything went so smooth",
          "Contenu": "Everything went so smooth, easy process to order exactly what I needed and fast shipping!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T03:41:41.000Z",
          "Titre": "Exactly as described",
          "Contenu": "Exactly as described. Will use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve L.",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T15:35:57.000Z",
          "Titre": "Great price",
          "Contenu": "Great price. FAST Delivery. Battery was an exact fit. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 2,
          "Date": "2022-01-20T19:52:06.000Z",
          "Titre": "Excellent customer service helping to…",
          "Contenu": "Excellent customer service helping to get the right package of batteries with the right terminals.  They came quickly and are working!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Mufich",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T22:01:41.000Z",
          "Titre": "Unbelievable service",
          "Contenu": "Unbelievable service, received my order the very next day!  The best price and best quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T02:13:14.000Z",
          "Titre": "Delivery on time keep me informed …",
          "Contenu": "Delivery on time keep me informed  where battery's located."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald",
          "Nb_Reviews": 5,
          "Date": "2022-12-02T03:57:44.000Z",
          "Titre": "I was very happy you had the battery I…",
          "Contenu": "I was very happy you had the battery I needed in stock plus the very price for the unit and fast delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh B",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T04:21:40.000Z",
          "Titre": "Great Seller",
          "Contenu": "Seller dispatched order quickly and accurately. The battery was packaged very well and arrived undamaged."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T00:56:47.000Z",
          "Titre": "Prompt delivery and product works…",
          "Contenu": "Prompt delivery and product works properly with device as advertised"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T21:05:23.000Z",
          "Titre": "Raion had what i needed...",
          "Contenu": "Raion had what i needed and sent the batteries quickly so that i could repair my UPS.  Job done.  Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2022-02-12T01:29:54.000Z",
          "Titre": "Great company and products",
          "Contenu": "Needed a battery for my DR machine.  Ration had it in stock and at a great price.  Batteries were fully charged and ready to go."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Brown",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T13:51:17.000Z",
          "Titre": "They had a good price on my parts",
          "Contenu": "They had a good price on my parts. And shipping charge was not bad. Got delivered in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Neal",
          "Nb_Reviews": 1,
          "Date": "2022-03-18T02:52:35.000Z",
          "Titre": "No problems, fast service",
          "Contenu": "Fast ship out, fast delivery and product works as expected. Zero issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 2,
          "Date": "2023-07-03T19:31:50.000Z",
          "Titre": "Order was quick and product arrived…",
          "Contenu": "Order was quick and product arrived exactly as described!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward Jemiolo",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T02:39:16.000Z",
          "Titre": "Delivery was excellent and timely manner",
          "Contenu": "My order came in a timely manner and parts fit and worked excellent"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WILLIAM MILLER",
          "Nb_Reviews": 3,
          "Date": "2023-01-26T07:54:33.000Z",
          "Titre": "Good selection",
          "Contenu": "Good selection, good price and quick delivery. Just unplug & plug in replacement."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WILLIAM MILLER",
          "Nb_Reviews": 3,
          "Date": "2023-01-07T02:20:46.000Z",
          "Titre": "Large selection of LED tubes and good…",
          "Contenu": "Large selection of LED tubes and good prices and quick delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2022-03-04T14:35:24.000Z",
          "Titre": "The correct batteries were shipped…",
          "Contenu": "The correct batteries were shipped quickly and seem to be working great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Winkel",
          "Nb_Reviews": 2,
          "Date": "2022-04-25T18:38:09.039Z",
          "Titre": "Highly recommended.",
          "Contenu": "Faster than expected delivery.  Exact product match.  GREAT Price!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CustomerDavid W. Grooms",
          "Nb_Reviews": 6,
          "Date": "2023-04-03T19:10:21.000Z",
          "Titre": "EXACT REPLACEMENT & GREAT PRICE!!",
          "Contenu": "THANK YOU FOR HAVING A REPLACEMENT FOR A BETTER PRICE & QUICK DELIVERY!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T11:48:10.000Z",
          "Titre": "Great service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philip Baker",
          "Nb_Reviews": 4,
          "Date": "2022-06-11T17:45:51.000Z",
          "Titre": "Great business to work with",
          "Contenu": "Great business to work with ! Recieved my order in a timely manner, price was right !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-16T03:31:39.000Z",
          "Titre": "This battery was perfect",
          "Contenu": "This battery fit perfectly and was a perfect replacement. Very quick delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T19:06:31.000Z",
          "Titre": "Arrived on time and gave updates along…",
          "Contenu": "Arrived on time and gave updates along the way. Awesome service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leslie Kelemen",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T00:56:57.000Z",
          "Titre": "Fast Shipping easy web site to navigate…",
          "Contenu": "Fast Shipping easy web site to navigate and good value!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Lipper",
          "Nb_Reviews": 1,
          "Date": "2022-05-12T14:20:25.000Z",
          "Titre": "Easy to order and they have great…",
          "Contenu": "Easy to order and they have great follow up. Also shipping was extremely quick"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-22T12:10:10.241Z",
          "Titre": "Found what I needed and ordering was…",
          "Contenu": "Found what I needed and ordering was easy. Item was shipped and delivered fast. No complaints at all."
        }
      ]
    }
  ]
}