{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "redstagsupplies.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard DeGaetano",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T16:02:13.000Z",
          "Titre": "Bought 4 ice/water filters",
          "Contenu": "Bought 4 ice/water filters, to have on hand.This week it was time to change the filter.Initially I checked the box’s the part number was correct and in the same box as in the past.Opened box inside contained a lookalike part but it would not fit. They will not answer their phones Tried to use website but would not send."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeremiah Metzcar",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T14:03:05.000Z",
          "Titre": "Hateful and condescending company",
          "Contenu": "I can canceled an order for water filters after seeing reviews the company sells knock off products in name brand packages. I tried calling them and there was no answer so I disputed the charge on PayPal. They responded and refunded the payment but then sent a vitriolic hateful email calling me names because they were charged a $25 chargeback fee by PayPal. Steer clear of this unprofessional and dishonest company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "janine cheng",
          "Nb_Reviews": 2,
          "Date": "2023-03-05T05:23:53.000Z",
          "Titre": "Fake water filter",
          "Contenu": "Clearly really good fakes.  They look exactly like original manufacturer products, but the water tastes horrible.  I ordered a filter from the fridge manufactuer and what do you know....water tastes excellent.  We'll see if RedStag lives up to their money back guarantee"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Honestly",
          "Nb_Reviews": 1,
          "Date": "2022-04-26T06:30:38.992Z",
          "Titre": "Bought two GE refrigerator water…",
          "Contenu": "Bought two GE refrigerator water filters and received without a problem. However, these filters were clearly fake/counterfeit! The taste of the water were really bad, just like those cheap fake ones sold everywhere else. Avoid buying from them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Neil",
          "Nb_Reviews": 1,
          "Date": "2021-12-14T21:36:09.000Z",
          "Titre": "FAKE / COUNTERFEIT water filters",
          "Contenu": "This company sells fake water filters.They “appear” like a legit business with a US address and phone number, but the filters dropship from random port cities and their phone number doesn’t work.They use a fake Trust Pilot style site to run up false 5 star reviews. Trustspot.io or something like that. Avoid at all costs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kian Quinn",
          "Nb_Reviews": 1,
          "Date": "2024-01-13T06:44:31.000Z",
          "Titre": "Excellent Appliance Parts Quality",
          "Contenu": "The appliance part I ordered from Redstag Supplies not only arrived promptly but also exceeded my expectations in terms of quality. Their commitment to providing top-notch products truly shines through, making them my go-to for future needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Isabelle Hodgson",
          "Nb_Reviews": 1,
          "Date": "2024-01-14T10:57:23.000Z",
          "Titre": "Impressive HVAC Parts Variety",
          "Contenu": "Redstag Supplies impressed me with their extensive HVAC parts selection. Navigating their website was a breeze, and I found the perfect component for my system. The variety and quality make them my preferred choice for HVAC needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lara Burns",
          "Nb_Reviews": 1,
          "Date": "2024-01-14T11:02:48.000Z",
          "Titre": "Fast Shipping on Obscure Vacuum Parts",
          "Contenu": "I had an extremely difficult time locating a particular attachment for my old vacuum cleaner. By chance I stumbled upon Redstag Supplies and was amazed to find they stocked the obscure part. Ordering on their website was simple, shipping was faster than expected, and the price very reasonable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Skye Warren",
          "Nb_Reviews": 1,
          "Date": "2024-01-12T19:52:51.000Z",
          "Titre": "Quality Parts at Reasonable Prices",
          "Contenu": "I ordered several appliance replacement parts from Redstag. The parts were very high quality, made of durable materials, and far less expensive than big box store alternatives. Everything fit my appliances correctly and should last."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cameron Holland",
          "Nb_Reviews": 1,
          "Date": "2024-01-15T09:15:45.000Z",
          "Titre": "Fast and Accurate Lawn Mower Parts Delivery",
          "Contenu": "Redstag Supplies delivered my lawn mower parts with remarkable speed and precision. The efficient shipping and attention to detail in ensuring accuracy were truly commendable. I trust them for reliable and prompt service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oscar Bird",
          "Nb_Reviews": 1,
          "Date": "2024-01-16T21:27:55.000Z",
          "Titre": "Vacuum Cleaner Parts Value",
          "Contenu": "Redstag Supplies offers great value with their affordable vacuum cleaner parts. I was pleasantly surprised by the quality, and the reasonable prices make maintenance a hassle-free experience. Definitely a win-win for customers!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T15:37:46.000Z",
          "Titre": "I mistakenly ordered an item and sent a…",
          "Contenu": "I mistakenly ordered an item and sent a request to their customer service folks, asking for it to be cancelled.  They promptly honored my request even though it did not result in a sale for them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T13:40:36.000Z",
          "Titre": "Lawn Mower Carburetor Brought My Mower Back to Life",
          "Contenu": "After struggling to start my lawn mower, I ordered a replacement carburetor from Redstag. I watched their carb install video and was able to easily replace the part myself. Mower started right up after installing the Redstag carb and has been running great since."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Baker",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T11:24:22.000Z",
          "Titre": "Precise Parts Identification",
          "Contenu": "I had a vacuum cleaner with a cracked housing part that I needed to replace. The trouble was locating the exact right match since there are so many slight variations and versions of components out there. But armed with Redstag's incredibly detailed parts diagrams integrated right into the product listings, I was easily able to precisely pinpoint the proper housing replacement part required to perfectly repair my broken vacuum and get it functioning like new again. Couldn't ask for more accuracy identifying niche parts!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas Lewis",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T09:33:18.000Z",
          "Titre": "Simply No Better All-In-One Parts Resource",
          "Contenu": "It's almost a week that goes by that I don't need a replacement part or specialty supply item of some kind for one project or another, between seasonal HVAC maintenance, impromptu daily home repairs, periodic appliance upgrades, and a host of other things. In this regard, Redstag has unquestionably shown itself to be the most adaptable, trustworthy wholesaler of hardware and home components that I have ever come across. To be honest, there isn't a better single option available to satisfy such a vast array of purposes!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexander Garcia",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T07:08:07.000Z",
          "Titre": "Solutions for All My Project Needs",
          "Contenu": "As an avid woodworking hobbyist constantly taking on home improvement projects like shop cabinet builds, furniture restorations, deck additions and more, I've come to fully trust Redstag to provide solutions for all my evolving needs - from specialty fine woodworking hardware all the way to heavy duty power tools. The combination of niche supplies coupled with commodity replacement parts for my workshop tools available here is unmatched. I'm constantly amazed and impressed at the range they offer allowing me to fully manifest every project I envision!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Adams",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T14:15:07.000Z",
          "Titre": "One-Stop Service Department Supply Solution",
          "Contenu": "As the busy owner of an independent home appliance and HVAC system repair outfit getting consistent, comprehensive access to parts is an absolute must for smooth day to day operations. Thankfully Redstag fits the bill perfectly as a one-stop wholesale parts supplier capable of rapidly and reliably meeting all my diverse and fluctuating inventory needs across brands and product categories. Their positively massive cross-category selection coupled with superb order fulfillment keeps my techs well armed with practically every part under the sun they could possibly need to tackle any service job tossed their way. I couldn't ask for a better inventory partner!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ethan Chan",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T09:22:00.000Z",
          "Titre": "Dependable Shipping Regardless of Size",
          "Contenu": "Recently I ordered several very large and heavy-duty industrial casters from Redstag to install a commercial grade shelving system in my garage. Despite the substantial weight and bulky shape of the casters, Redstag packaged everything up very securely to prevent damage, and I received the order delivered on time and in perfect condition within just a few days. Very dependable shipping for items of all sizes - I definitely will be counting on them again soon for all my material shipping needs around future improvement projects."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Wright",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T18:19:41.000Z",
          "Titre": "Thanks to RedstOne-Stop Convenience for All House Issuesag's amazing wide…",
          "Contenu": "Thanks to Redstag's amazing wide selection of nearly every household part imaginable, I have been able to quickly solve every residential repair situation I have come across, from recurring minor annoyances like constantly broken drawer pulls and perpetually leaky pipes to sporadic major disasters like smashed appliances, shorted electrical, and much more. I feel so much more confident and at ease knowing that I only need to deal with one supplier for any unforeseen problems that may arise with my homes!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Parker",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T16:26:53.000Z",
          "Titre": "Reliably Getting Me Out of Jams",
          "Contenu": "As a lifelong antique collector and restoration enthusiast specializing in keeping old cars, vintage electronics, outmoded industrial machines and various other finicky relic equipment running, I'm constantly finding myself desperately needing odd obscure specialty parts that most typical suppliers simply won't offer. But time and again Redstag manages to come through for me - even tracking down fiddly little belts, switches, knobs, wires, valves and more to keep my passion projects going strong. Their positively heroic inventory depth and sourcing skills have rescued me from many a jam!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Thompson",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T07:06:57.000Z",
          "Titre": "The One Stop Shop I Rely On",
          "Contenu": "As a property manager handling maintenance issues and repairs for dozens of rental units - from plumbing problems to failing appliances - having a reliable go-to source for the myriad of parts needed to keep things humming is absolutely essential. Redstag has truly become that one stop wholesale supplier I depend on to keep all my buildings up and running properly. Their positively massive catalog spanning practically every conceivable household item means I can order practically everything needed all at once, saving huge time, money, and logistics headaches."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lucas Miller",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T07:20:45.000Z",
          "Titre": "Fulfilling My Wildest Workshop Dreams",
          "Contenu": "For years building my ultimate dream workshop packed with top tier woodworking equipment, specialty tools and custom cabinetry seemed an impossible vision given the incredibly diverse niche items, specialty supply inventory and array of parts required to pull off such an elaborate build. But through Redstag's positively mind blowing hardware and replacement parts assortment spanning everything from cabinet fittings to exotic lumber to welding gases and so much more - they've removed all barriers and enabled me to fully achieve implementing this once unattainable workshop vision far beyond my expectations. Simply could not have manifested this incredible space without their support fulfilling my every unique parts need!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexander Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T05:22:26.000Z",
          "Titre": "Total Confidence Tackling Any Fix",
          "Contenu": "Tackling repairs ranging from patching up a broken window unit AC to fully rebuilding an entire commercial ice machine can be intimidating prospects. But I have total confidence in my repair capabilities knowing that Redstag's positively unparalleled wholesale parts catalog offers any component I could possibly need - even hard to locate niche items. Having ready access to such an astoundingly wide array of household parts lends tremendous peace of mind when undertaking major equipment rebuilds and restorations - I know obtaining whatever I require will never be an issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean Peacock",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T10:29:46.000Z",
          "Titre": "My Go-To For Cost-Effective Upgrades",
          "Contenu": "As a thrift-conscious real estate investor constantly balancing implementing needed unit modernizations and upgrades against tight budget constraints, access to high quality yet affordable appliance, HVAC and hardware replacement parts is critical. Redstag fills this cost-effective parts supplier role perfectly - their positively massive catalog allows me to easily pinpoint just the right moderately-priced components to improve property function without overspending scarce capital on unnecessary fancy bells and whistles we simply don't require. Their offerings strike a perfect balance between quality and value - a tremendous assist maintaining margins!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Miller",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T14:11:37.000Z",
          "Titre": "Never Fail Solutions for Surprise System Failures",
          "Contenu": "From a faulty air pressure switch that suddenly killed my elderly furnace mid-winter to a shattered plastic drainage component that abruptly flooded the laundry room and more - Redstag has repeatedly come through when unexpected critical system component failures arise bringing daily household operations to a grinding halt. Having fast access to their vast catalog spanning replacement parts across all home systems means I can rapidly secure whatever precise part is needed to get things smoothly back up running, no matter the unexpected crisis at hand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T22:25:07.000Z",
          "Titre": "Best Supplier of Obscure Parts",
          "Contenu": "When trying unsuccessfully for weeks to hunt down a worn drive belt for a very old 1930s vintage Hoover floor polisher inherited from my grandfather, I never imagined I'd actually be able to locate a replacement - but amazingly the incredibly knowledgeable buyer at Redstag managed to special order this rare obsolete part for me custom based on the unit's model specifications. It was delivered so quickly and now this cherished old polisher runs good as new again thanks to Redstag's near superhuman ability to procure practically any part under the sun, no matter the age or scarcity. Absolutely can't recommend them highly enough!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexander Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T07:10:11.000Z",
          "Titre": "The Magic Fix-It Genies",
          "Contenu": "The trials and tribulations of old house ownership definitely come with no shortage of periodic unexpected system malfunctions, appliance breakdowns, and assorted mechanical failures as infrastructure inevitably decays. But through all these unpredictable disruptions, Redstag and their incredibly deep wholesale parts inventory has been my magic fix-it genies making each of these inevitable homeowning issues far less stressful or burdensome events. No matter what odd problem or breakdown arises bringing things to a grinding halt, one quick comprehensive search of their positively unparalleled component selection catalog darn near always produces just the right solutions to rapidly get failing equipment and fixtures functioning again with minimal headaches or hassle. Honestly don't know how I'd effectively cope without Redstag's parts sourcing heroics!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Logan Lewi",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T07:22:38.000Z",
          "Titre": "My Fix-It Guardian Angels",
          "Contenu": "Between constantly malfunctioning antique appliances, the never-ending household electrical gremlins causing continual blown fuses, and perpetual leaky plumbing woes - sometimes keeping my chaotic old home continuously functioning every day can seem an insurmountable task. But through all these never-ending trials and tribulations, Redstag and their incredibly stocked wholesale parts inventory has been my fix-it guardian angels time after time - always being able to locate and provide just the right difficult to source parts I desperately need but can't find anywhere local to tackle whatever the urgent mechanical issue du jour happens to be. No matter what obscure component or replacement part any problematic repair situation calls for, they always come through in the clutch to deliver vital solutions!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacob Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T07:11:34.000Z",
          "Titre": "Total Parts Replacement Confidence and Peace of Mind",
          "Contenu": "When various critical infrastructure components around my sizeable rental property portfolio eventually succumb to age and wear - prompting major unit overhauls or full replacements - properly sourcing the wide range of replacement parts required for these major renovations can be an incredibly daunting logistical proposition. But when embarking on these large-scale equipment restorations, there is simply no wholesale supplier I have more complete confidence in to reliably deliver whatever exhaustive mix of components ends up being needed than Redstag. Knowing just the sheer scale of their positively mind-blowing parts catalog spanning virtually any imaginable item, coupled with their proven sourcing expertise gives me tremendous peace of mind that securing whatever assortment of niche parts the job calls for will never be an issue."
        }
      ]
    }
  ]
}