{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "renpho.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "SC",
          "Nb_Reviews": 4,
          "Date": "2023-12-17T13:36:55.000Z",
          "Titre": "lasts 2 years max",
          "Contenu": "I puchased a shiatsu massager & took very good care of it. I used it twice weekly, three times at most, so not excessively heavy use. I purchased it 5 September 2021 & it just stopped working on 17 December 2023 so it appears renpho massagers last 2 years maximum with mild use & probably less with heavy use. This throw away consumerism is beyond a joke. What a waste of money & I really need this as a disabling chronic pain sufferer. So if buying renpho expect to need to buy a replacement at or near 2 year mark. No wonder warranties by renpho are only 1 year. I suspect decent or heavy use means replacement purchase needed just over 1 year when outside of warranty! I might just soothe pain the old fashioned way through alcohol & meds!"
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "Carol Baubock",
          "Nb_Reviews": 3,
          "Date": "2023-11-14T11:44:55.000Z",
          "Titre": "Terrible customer service",
          "Contenu": "Bought an expensive foot massager which came with a desperately cheap power cord, the prongs of which broke quite early into its use. Same specification replacement cords aren’t working and customer service “doesn’t supply spare parts”. Another Customer Service that couldn’t care less about customers…."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Tiguan",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T17:23:06.000Z",
          "Titre": "Terrible Experience with Customer Service",
          "Contenu": "I had purchased a hand massager which broke down after only 4 months. Tried contacting customer service..took forever, then they told me what they thought was wrong with it.  They finally offered to send me a new one, after which I never heard from them again. I checked on their site…these hand massagers are now “unavailable “. Terrible company to deal with. Untrustworthy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Corey",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T04:56:50.000Z",
          "Titre": "Never again",
          "Contenu": "I mean, I placed the order in december, didn’t hear a WORD for almost 2 weeks. I reached out via email only to get a response letting me know I needed to switch colors and it would immediately be shipped to me, then to wait ANOTHER few days just to get an email that my money has been refunded and canceled. After emailing multiple times, they’ve completely ghosted me. I’ll never order here again!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jordan Saia",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T00:37:46.000Z",
          "Titre": "I am very sad about this order",
          "Contenu": "I am very sad about this order. I placed my order on 12/28 and it is 1/11 and I still have not gotten my item. I then got an email on 1/5 saying my item was out of stock and if I would be willing to choose a different color. I responded that I would be willing to do so and have not heard anything back. This is very disappointing seeing as how it is my first time ordering and I was REALLY looking forward to my item."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sharon Henchel",
          "Nb_Reviews": 3,
          "Date": "2023-01-09T21:16:02.000Z",
          "Titre": "My order was delivered  to my sister's…",
          "Contenu": "My order was delivered  to my sister's I portage, ind. She received the eye massager but not the black hand massager. I have been having poor communication since I placed this order Dec 24. I spoke  and left messages many times. The order went out and delivered but no hand massager. I want to know what's the problem. Please respond . I would also like a compensation on this order"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Johan De Villiers",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T22:39:35.000Z",
          "Titre": "Poor product - Terrible service - Not reccommended",
          "Contenu": "Got this item for my wife for christmas - never worked! red light comes on but none of the touch buttons worked from the start.Very, very dissapointing!Impossible to get a hold of anyone - they do not reply to support e-mails - the customer service is extremely poor.They must be swamped with returns of defective products or they just do not care or maybe both!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kontaratos",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T17:49:32.000Z",
          "Titre": "This review is only about the customer…",
          "Contenu": "This review is only about the customer service not the products.  I purchased the travel scale and the case was not included. I was told they sell one with and one without but there is only one listed on the site. I was told if I want the case rebuy it on Amazon to get the case.  Totally unacceptable to tell a customer to repurchase something they already purchased.  Not helpful at all.  Taking my business to Amazon from now on."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "G. Griz",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T22:11:23.000Z",
          "Titre": "Slow & Out of Stock",
          "Contenu": "Slow, disorganized and out of stock. I ordered on the 16th of Dec. You would think it's hustle time for a retailer. Not at Renpho. They take their sweet time for everything including getting back to you. Then they tell me my item is out of stock for the next 30 days but I ordered two items. So both or one is out of stock? Who knows...at Renpho, they just don't know."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas Dissatisfied",
          "Nb_Reviews": 2,
          "Date": "2023-01-12T06:54:22.000Z",
          "Titre": "ítems over 3 weeks ago. Notified 3 weeks later out of stock",
          "Contenu": "I purchased ítems over 3 weeks ago and I receive an email 3 weeks later telling the items are not in stock and offered another item. When I let them know just go ahead with the other item because I’ve been waiting so long I get a response back with an apology letting me know that they are out of that item as well. They then offer me 20% as if that is going help at all. A huge inconvenience and inconsideration. I will not be purchasing anymore items."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Madison Green",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T23:40:21.000Z",
          "Titre": "Eye Massager",
          "Contenu": "I ordered the eye massager in white. I was concerned when it didn’t ship in over a week. Then, I get an email saying it’s out of stock and asking if I would like to get the black one instead. I reply back asking a question, but don’t get a response. A week later I get another email saying it will be shipped at the end of January. Keep in mind, this money has already been taken out of my account. When I asked if I could get a refund, I got no response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terri Perry",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T04:12:15.000Z",
          "Titre": "Placed order for three jump ropes on…",
          "Contenu": "Placed order for three jump ropes on 12-11-22 after mom saw product on GMA. Placed order that morning assuming that they would arrive in time for Xmas. As of yet we have not even received any type of correspondence stating that there is a delay, that it shipped, that they are out of stock...nothing...zero...zilch. I emailed today saying that I want to cancel this order. I will also be contacting GMA and let them know of our experience with the company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sheila",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T02:31:24.000Z",
          "Titre": "SALE ITEMS NOT SHIPPED",
          "Contenu": "I ordered 18 total eye massagers during the SALE EVENT. 8 eye massagers were not sent and I'm being told it's out of stock but when you go online, you can buy it (not the sale price) just like what my friend did. Now customer support is telling me to just buy from Amazon. Not cool and hope that someone from management can fix this problem."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mohammed Sheen",
          "Nb_Reviews": 79,
          "Date": "2023-01-11T22:10:55.000Z",
          "Titre": "FAKE COMPANY ITEM NOT RECEIVED",
          "Contenu": "Really bad experience Not sure it the company is genuine or fake as they have a strong web presence but really bad reviews and feedbackBad communication and serviceHave not received my order and it’s been over 3 weeks and they respond to email and calls, lucky I paid via PayPal and received a refund that way"
        },
        {
          "Note": 1,
          "Lieu": "TH",
          "Pseudo": "Pa",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T05:56:46.000Z",
          "Titre": "Lasted 30 uses/3 months",
          "Contenu": "The eye spa pods were AUD99 and had lasted maybe 30 uses in 3 months. Good for what it does but absolutely not worth it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stefpras",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T16:38:29.000Z",
          "Titre": "Terrible company",
          "Contenu": "Worst experience. Untrustworthy company. my order was placed on 12/25, as of 1/8 I still do not have it and have never been updated. I contacted the company and was lied to and they still have not responded. They also charged my credit card immediately. So I paid for what I don’t have and am being ignored."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kaira",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T23:25:17.000Z",
          "Titre": "Never again",
          "Contenu": "Never again. I do not recommend buying from Renpho if you are not a tech savvy. My product came defective and they want me to do a lot of things to proof is not working but for someone who is not tech savvy is a waste of time and money. There are better companies out there that give you better service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Melissa G",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T23:14:08.000Z",
          "Titre": "I ordered the item",
          "Contenu": "I ordered the item. Quite awhile later I received an email saying it was out of stock but the other color was available so I said yes please send the other color item.  Quite awhile after that I received another email saying of sorry that one is out of stock as well with no approximate time."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "LMN",
          "Nb_Reviews": 3,
          "Date": "2023-01-07T12:32:48.000Z",
          "Titre": "Faulty product and faulty customer service",
          "Contenu": "I would give zero stars if I could. Contacted company the day after I received a product with numerous faults in order to return it, all I have had in response is they want me to video the faults. I shouldn't have to prove it doesn't work to return it as within the 30 day return period."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Arthur Williams",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T21:32:22.000Z",
          "Titre": "When I received my order an item was…",
          "Contenu": "When I received my order an item was missing. It took me several days of sending emails and calling customer service, I never actually got to talk with anyone. After sending my final email asking for a refund, not long after I received an email stating my item is now being processed."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "John Foster",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T09:38:42.000Z",
          "Titre": "Renpho Massage Gun not working from date of purchase.  Bought a massage gun for our son fir…",
          "Contenu": "Bought a massage gun for our son fir Christmas.  Followed the user manual but the massager did not work at all. Contacted service at Renpho who asked for a full video of the gun being charged and used. Again the gun did not work at all. Now waiting again for a response. Disappointed"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Melalex Pty Ltd",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T08:20:50.000Z",
          "Titre": "I rate them badly for sending spam…",
          "Contenu": "I rate them badly for sending spam after purchase. I do not wanna handle the spam.The product was ok. Delivery not great experience as the labels were printed incorrectly and parcel locker details were not printed. What resulted in extra call and delivery to the house. I did not wanted recless delivery drivers come to my house. Parcel Locker was for a reason"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Teresa Bowman",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T02:12:45.000Z",
          "Titre": "It should be part of the advertisement…",
          "Contenu": "It should be part of the advertisement that people with implantable heart devices, etc. are not to use the scale except for weight only, no measurements, and shoes must be worn to weigh to protect the person and implantable device. This would decrease the need to return the scale."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "JEANETTE",
          "Nb_Reviews": 5,
          "Date": "2023-03-30T23:30:28.000Z",
          "Titre": "Forced to take 50% refund",
          "Contenu": "I purchased a gun which on arrival was to large/heavy. I wanted to exchange for a mini & was happy to pay to return the product & pay more for it. But Renphi were going to charge an ADDITIONAL 15% as handling fee on original price (not sale price) So I was forced to keep it & get only 50% refund. I will buy another gun, but not Renpho & not online"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Bella",
          "Nb_Reviews": 59,
          "Date": "2023-04-14T12:52:32.000Z",
          "Titre": "Received a faulty massager gun that will not turn on",
          "Contenu": "HelloI received my order yesterday but the massager gun will not turn on despite showing fully charged, and yes I have turned it on at the bottom of the unit too. Do you not do quality control or at least check the units, just why would you send out a faulty unit? I have sent two emails to support to return the unit but have yet to hear back from Renpho. On this basis I do not recommend Renpho and will not buy from them again. Plus another thing to add regarding the UPS courier service they use, the courier left the package outside leaned up against the front door for all to see and possibly steal, instead of leaving it inside a perfectly accessible enclosed front porch, I live on a main road too - what a stupid thing to do."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amber",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T23:30:47.000Z",
          "Titre": "Company is not refunding me for an out of stock item",
          "Contenu": "I got an email that the item I ordered was out of stock, which is totally understandable. However, I have asked twice to have the amount I paid ($45) refunded to my account and it has not been and I am not getting a response from customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Latoya Salters",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T23:30:23.000Z",
          "Titre": "Never received my order or a refund",
          "Contenu": "I placed an order for a jump rope, got notification when it was shipped. About 7 days later when i tracked it, the message said that USPS was unable to deliver the item. 2 days later, I got an email stating that the item was delivered, but i never received it. Reached out to Renpho via email twice & never received a response. No refund has been given."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Genevieve Powers",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T15:58:03.000Z",
          "Titre": "Return policy is not honored",
          "Contenu": "I have been trying to initiate a return for two weeks now and customer service takes multiple days to respond. They first suggested that I gift the item instead, then offered a 30% refund, then a 60% refund — all while their website lists a 30 day guarantee and urges customers to shop with confidence.EDIT: I’m still waiting for a reply to my email to support. The order is under my name."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elaine",
          "Nb_Reviews": 1,
          "Date": "2023-01-22T03:45:58.000Z",
          "Titre": "Horrible",
          "Contenu": "Horrible! I received a defective tape measure had to send in a video to prove it was defective. It probably cost you Pennie’s to make yet you opted to refund me instead of refunding me AND sending out a new one for my inconvenience. I will never do business with you again. I will be sure to share my experience with everyone who will listen."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Stephanie Desiatnyk",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T02:24:50.000Z",
          "Titre": "ZERO STARS",
          "Contenu": "ZERO STARS my parcel is already over a week late. I’ve asked for a refund twice. With no actual response except “please wait another week” Canada post has confirmed they haven’t even received the item yet. Garbage customer service. Will not order from them again.Also note that they only respond to positive reviews on here."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kristen Israel",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T21:21:01.000Z",
          "Titre": "The scale doesn’t sync properly with my…",
          "Contenu": "The scale doesn’t sync properly with my phone, only records my weight in the app if I have the app open while I’m standing on the scale, and doesn’t reflect differences in weight that my other scale picks up. Overall very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-21T19:01:31.000Z",
          "Titre": "I think it is wrong to charge the…",
          "Contenu": "I think it is wrong to charge the customer return postage or 40 % of what they paid when they are purchasing online and have not been able to see feel size or hold the item.   Sometimes it doesn’t fit or is too big or doesn’t work the way you expected."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T23:01:13.000Z",
          "Titre": "Disgusted. Terrible company.",
          "Contenu": "Bought massage gun online through walmart. Didn't work for me, so I returned it to walmart. Walmart said Renpho was responsible for the actual refund to my credit card. Emailed renpho back and forth 11 times, giving them screenshots of my credit card statement proving that I was not refunded. Sent them the walmart receipt. Asked to have supervisor call me, but noone called. I'm normally a patient and fair person, but this company does not care about customers. I'm disgusted and going to sue them for all the the trouble, hassle, time, effort that I have gone through for no reason. Needless to say, I hate this company and noone should be treated with such disdain. Shame on them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Susan  Finefrock",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T21:16:08.000Z",
          "Titre": "My order was not processed or shipped timely",
          "Contenu": "My order was not processed or shipped in a timely manner.  There was no communication about the delay.  I never received any email confirmations of when delivery would occur only that it shipped.  Your customer service is closed on weekends.  I found out the product arrived when the person I sent it to texted.  Nothing from your company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ramon Alvarado",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T21:45:37.000Z",
          "Titre": "I ordered my scale on Nov 28",
          "Contenu": "I ordered my scale on Nov. 28.  SIX days later, I received an email that it was being shipped, on Dec. 4.  I received it on Dec. 7.  I never was notified that it was running late, or that there were none in stock!!  Terrible service!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lauren DeVault",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T22:01:57.000Z",
          "Titre": "I still haven’t received ANYTHING from…",
          "Contenu": "I still haven’t received ANYTHING from y’all. Apparently, what I ordered was sold out after being confirmed. So I emailed them back & told them a different color was fine. Haven’t heard anything since. Nor received any product."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Alison Macfarlane",
          "Nb_Reviews": 2,
          "Date": "2022-12-21T07:34:53.000Z",
          "Titre": "Item not shipped after 7 days",
          "Contenu": "Item not shipped after 7 days.  No way to call them.  Say they will respond to email within a day or two.  Not very helpful before Xmas.  I ordered direct due to a discount, but wish I'd ordered via Amazon for same day delivery!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Simon Brice",
          "Nb_Reviews": 2,
          "Date": "2022-12-13T15:30:11.000Z",
          "Titre": "Renpho forgot second item",
          "Contenu": "Ordered two items from Renpho, items were ordered together, well in advance and intended as Christmas gifts. Only one item delivered, contacted Renpho who have now sent 2nd item due to be delivered 25 January - disappointing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "kimberley tarter",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T03:44:29.000Z",
          "Titre": "I was excited to received my tape…",
          "Contenu": "I was excited to received my tape measure.  I immediately put the battery in and it slipped under the very thin metal that should hold the battery. It would not come out and the metal broke.   I reported to customer service with no luck.  They were not helpful at all.  I usually don’t provide  reviews but this product was a huge disappointment."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T23:48:58.000Z",
          "Titre": "Shiatsu Neck Massager with Heat",
          "Contenu": "Purchased an item which the description stated for NECK not neck and shoulders like other items on the website. However, the product supplied was for neck and shoulders and isn’t much use at massaging both. In fact it’s another gimmick and waste of money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Absala Mengestab",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T18:16:59.000Z",
          "Titre": "Does anyone work here?",
          "Contenu": "It is impossible to get in contact with their customer service team for any exchange or returns. I am having to deal with my bank on the charges since no one on their team has contacted me. Absolut sham that’s built out of social media hype"
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Annie B",
          "Nb_Reviews": 3,
          "Date": "2023-02-07T19:49:53.000Z",
          "Titre": "BUYER BEWARE",
          "Contenu": "BUYER BEWARE - It has taken 3+ weeks to receive my goods and I am still waiting. The website states it’s NZ based however this is not true it is sent from Australia or China? I still don’t know if I will receive my goods. Significant lack of transparency from the website - to the customer service. I would not waste my money or time again, and you shouldn’t either"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cynthia mills",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T21:20:25.000Z",
          "Titre": "I still have not received my order/…",
          "Contenu": "I still have not received my order/ they sent half of it acted like it was all in there/ never mentioned the item that wasn't in there and have been back and forth with them since. I will never order off of them again"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Hossein Karimi",
          "Nb_Reviews": 2,
          "Date": "2023-04-21T03:54:19.000Z",
          "Titre": "Their customer service is terrible",
          "Contenu": "Their customer service is terrible. It took them several days to just send an item. After days of waiting, it turns out the item is a wrong item. Now, instead of apologies they ask me to send me pictures to prove it was a wrong item!! worst customer service. They leave customers for hours without a response"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karena",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T17:30:54.000Z",
          "Titre": "Received used",
          "Contenu": "Received used, or probably returned from another dissatisfied customer, item instead of new. Only received one of my eye massager when I ordered two. No response back when trying to find out about my missing item"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bridget S.",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T02:07:07.000Z",
          "Titre": "Shop elsewhere",
          "Contenu": "Item in stock on website but notified 7 days later it is actually out of stock. Offered to substitute a different color, those were out of stock when I responded back as well. Anticipated delivery will not be for a full month after ordering."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Heather Davis",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T23:48:01.000Z",
          "Titre": "Never Received. I ordered a chair massager (received it…",
          "Contenu": "I ordered a chair massager (received it later than expected but did receive it) and two massage guns that have never arrived.I reached out to customer service weeks ago and was only told they were delayed. Nothing since."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Victor Salerno",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T15:43:49.000Z",
          "Titre": "Got an used massage scalper machine…",
          "Contenu": "Got an used massage scalper machine from the Amazon delivery service and so far never received the jump rope I bought at the same time as the used unit. They sent a new   Unit but the rope hasn’t arrived. Products are good, the service and delivery terrible"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pradheep Vemula",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T18:58:17.000Z",
          "Titre": "I was told more than a week later (and…",
          "Contenu": "I was told more than a week later (and after I sent an email to support) that my item was out of stock and the order had to be cancelled."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Jimmy",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T23:30:57.000Z",
          "Titre": "Very bad services and support",
          "Contenu": "There was no order confirmation sent to me, and when I call the contact number multiple times on any different days, no one answers. I was also emailing and only got a reply a week later. Very bad support and services!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DEBORAH BRAULT",
          "Nb_Reviews": 3,
          "Date": "2023-02-24T03:07:00.000Z",
          "Titre": "I ordered a new air purifier filter…disappointed results",
          "Contenu": "I ordered a new air purifier filter AP-088 because my filter change light was on and it was time to order a new filter. When I received my new filter order and put it in the air purifier the change filter light stayed on??? It only goes in one way so I don’t know why the light is still on?! I tried calling but no one answers! Very frustrating! Deborah"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "IL",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T20:19:45.000Z",
          "Titre": "Bad product, worse customer service",
          "Contenu": "The device kept powering off when I tried to use it because the power button is right on the grip. Also, the spacing in the case for the accessories is so tight that it was impossible to remove some of them. I reached out to Renpho to process a return, and they seem to be ignoring my request."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Debbie Rogers",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T22:12:22.000Z",
          "Titre": "I used the calf massagers for about 5…",
          "Contenu": "I used the calf massagers for about 5 minutes and the compression was unbearable. I wanted something more for massage than compression. I want to return the product. It’s no use to me. Please send me a return label and credit me back for the cost less shipping."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Celiya",
          "Nb_Reviews": 2,
          "Date": "2023-01-25T04:26:53.000Z",
          "Titre": "Irresponsible customer service",
          "Contenu": "I ordered 2 items but only received 1 item. There is no explanation and in my account it even said both items have been sent. Until I've contract them twice, they finally replied, just said out of stock and gave me the refund. I don't think the customer service is up to the standard and the stock taking seems  to be a mess as well."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sharon Walker",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T23:58:55.000Z",
          "Titre": "I placed an order on Jan 9",
          "Contenu": "I placed an order on Jan 9, 2023 for 2 teeth whitening kits and a massager. I only received the massager. I have reached out to Renpho by phone and email, trying to find out where the rest of my order is. No one has reached out to resolve my issue. This is poor customer service and I won't be ordering again from this company. I plan to file a complaint with my credit card company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brenda Belcher",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T23:04:27.000Z",
          "Titre": "Don’t buy from this company, customer service sucks!!",
          "Contenu": "I ordered the massaging face mask because I saw it on Tik Tok but it just  didn’t work as good as advertised and I just didn’t like it, contacted customer service with in 2 days of receiving the product asking to return, well costumer service is not nice and I still Have not received my refund. I first Contacted 1/9/23 and didn’t get approval until 1/17/23. The replies were not that friendly and seemed to want to make it difficult just so I wouldn’t return. The return has been received back since 1/18, I sent it back through FedEx at my expense. The representative could have been a lot nicer, now will not buy anything from Renpho because of customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "E lindner",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T21:40:20.000Z",
          "Titre": "Possible scam",
          "Contenu": "Made an order, credit card charged. Emailed company because they said product was out of stock. No response. Called no one available to speak with. Trying to cancel order and get my money back."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Simon Brice",
          "Nb_Reviews": 2,
          "Date": "2022-12-15T01:27:12.000Z",
          "Titre": "Ordered scale and foot massager…",
          "Contenu": "Ordered scale and foot massager together for christmas gift. Only the massager arrived with the scale due for delivery end of january. Unable to give as a christmas gift - very dissapointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angela Schiff",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T23:22:38.000Z",
          "Titre": "Charged my credit card when product…",
          "Contenu": "Charged my credit card when product hasn’t even shipped. Said Mr item shipped this week and then got an email saying still on back order emailed to cancel and no one has reached out to me."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Steven Wilkinson",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T23:33:42.000Z",
          "Titre": "I sent you an email yesterday as I am…waiting for the rest of my purchase",
          "Contenu": "I sent you an email yesterday as I am still waiting for the items I purchased but haven’t received A copy of the email is below Renpho AUTo: Steven Wilkinson>26/4/2023A shipment from order AU-21925 is on the wayRenpho AUORDER AU-21925The last items in your order are on the wayThe last items in your order are on the way. Track your shipment to see the delivery status. View your orderor Visit our storeTOLL tracking number: 6446136590330175102001Items in this shipment\tElis 1 Smart Body Scale × 13 AAA / With Pattern / Black FBT-BUNDLE-P-18789DC58EA (-$1.47)\tEyeris 1 Eye Massager × 1White/Without Remote FBT-BUNDLE-P-18789DC58EA (-$3.29)If you have any questions, reply to this email or contact us at support"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "vanessa woodrow",
          "Nb_Reviews": 8,
          "Date": "2023-01-31T22:33:30.000Z",
          "Titre": "I never received my order",
          "Contenu": "I never received my order. I had 2 'sorry we missed you' cards  from UPS & was given the run around to find my order between UPS and renpho. I've give up & waiting for a refund which seems to taking as long as the delivery!"
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "madame",
          "Nb_Reviews": 2,
          "Date": "2023-04-06T12:38:13.000Z",
          "Titre": "Avoid RENPHO Massage Gun: Faulty Product and Poor Customer Service on Amazon",
          "Contenu": "If you're considering purchasing the RENPHO massage gun on Amazon, I highly advise against it. My experience with the product was less than satisfactory - it arrived completely broken and wouldn't turn on. When I reached out to Renpho for support, they were unhelpful and suggested I contact Amazon instead.Amazon offered to cover my shipping expenses for the return, but the process was far from smooth. I ended up spending more on shipping than I was reimbursed for, leaving me out of pocket for a product that was never even functional.Overall, I would strongly recommend against purchasing the RENPHO massage gun on Amazon. Not only is the product of questionable quality, but the lack of customer support from Renpho is unacceptable. It's simply not worth the hassle or the money - consider investing in a massage gun from a more reputable brand instead.\""
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sam Petitto",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T20:01:35.000Z",
          "Titre": "The second scale I purchased dors not…",
          "Contenu": "The second scale I purchased dors not sync with my phone app. The first scale wouldn't either. I followed all troubleshooting instructions with each scale but still no connection."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "George16",
          "Nb_Reviews": 3,
          "Date": "2023-01-02T22:29:50.000Z",
          "Titre": "I think I’ve been conned",
          "Contenu": "Made an order on 20th December. Still no package - it is now the 1/2/23. I have contacted them multiple times and they have been very unhelpful. I’m abit worried I have been conned."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T23:38:33.000Z",
          "Titre": "The website is very misleading and customer service is terrible!",
          "Contenu": "The website is very misleading! I ordered a foot massager from a page that showed a remote control, but it was delivered without a remote. They are still refusing to send me a remote, so I will return the massager."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julian Valadez",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T23:12:33.000Z",
          "Titre": "No communication",
          "Contenu": "No communication Did not tell me my product was out of stock even tho I spoke with them days earlier Advise I can get a replacement but could not garunteed it would be in stock"
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Dayana Kaw",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T19:08:52.000Z",
          "Titre": "Horrible",
          "Contenu": "More than two weeks and I still haven’t received the product, tried to contact the company and no response"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Silvia Moncada",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T18:44:45.000Z",
          "Titre": "My order is missing and anybody answer",
          "Contenu": "My order is missing and anybody answer... well where is my order the track is a game ..was enough!!!! After buy first excuse was oh we don't have that color ... making more time ... but when I bought the option for my order was available!!! And after wait a lot time now the order is missing . .I want all my  refund not a %..all my money inmediatly.Well I wrote 2 days ago this review and I don't have my refund ready.. just annoying emails . Don't buy it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jess",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T19:33:42.000Z",
          "Titre": "Haven’t received my order.",
          "Contenu": "Placed an order for a birthday present. Get an email days later saying my product is out of stock. They offered my product in a different color. I said that would be great. Days pass by and they email me that the different color is out of stock. Haven’t received any other updates nor the offer to get my money back. Had to get a different birthday present because of this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cindy Fagan",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T00:02:43.000Z",
          "Titre": "Eye massages beware",
          "Contenu": "The scales are fine but do NOT purchase any of the eye massages.  They are heavy on the face and kind of hurt.  They just  don’t fit the eye or cover the eye well.  I tried to talk with them last year when I received mine but they blew me off I gave it way 3 times just to get it bAck 🤷🏻‍♀️."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Oskar",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T12:40:15.000Z",
          "Titre": "Buyer Beware - Broken on Arrival with No Customer Support",
          "Contenu": "I purchased the RENPHO massage gun on Amazon and was excited to try it out, but my excitement was short-lived. When I received the product, it was completely broken and wouldn't even turn on. I reached out to Renpho, only to be told that Amazon was responsible since they sold the product. This was incredibly frustrating, as I expected better customer service from a company that claims to care about their customers.I contacted Amazon, and while they offered to cover my shipping expenses, I was only reimbursed for $46, despite spending $94 on shipping costs. This was a huge inconvenience and only added insult to injury. As a result, I lost a considerable amount of money due to Renpho's faulty product and Amazon's lack of proper quality control.In summary, I do not recommend purchasing the RENPHO massage gun from Amazon. The product is poorly made, and the customer service provided by Renpho is non-existent. Additionally, Amazon's inadequate handling of the situation only added to my frustration. Save yourself the hassle and purchase a massage gun from a more reputable brand with better customer support.\""
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "K Thompson",
          "Nb_Reviews": 1,
          "Date": "2022-12-29T05:58:50.000Z",
          "Titre": "Delayed Shipping",
          "Contenu": "Items ordered on 14 December 2022 are still not shipped and no status update has been provided. I sent customer service an inquiry and have not received a reply."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Yun",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T18:21:38.000Z",
          "Titre": "I bought 8 of the same Eye Massager 2",
          "Contenu": "I bought 8 of the same Eye Massager 2, and one is for myself and rest are gifts. After using mine ~5 times, the heat on the eye massager is not functioning. So even if the massager says heat is on or even on Max Heat, there is no heat at all. I'm afraid to send out my gifts now...."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Linda Mackay",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T10:59:37.000Z",
          "Titre": "Scales  weight constantly changing as I…",
          "Contenu": "Scales  weight constantly changing as I am trying to weigh myself. Very disappointed with product."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Samantha",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T23:07:39.000Z",
          "Titre": "Rubbish, don’t bother",
          "Contenu": "Rubbish, don’t bother. All the stats are incorrect for the scales. I just compared to a body composition analysis machine; and the stats are completely different."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T22:21:34.000Z",
          "Titre": "Scale doesn't work with my android…",
          "Contenu": "Scale doesn't work with my android despite being version 12. Additionally scale won't connect to my 2.4Ghz despite being advertised as supporting 2.4 GHz."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alicia Carver",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T00:26:50.000Z",
          "Titre": "This foot massager does not do much at…",
          "Contenu": "This foot massager does not do much at all I’m super disappointed in it, it didn’t really knead the soles"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fawn Sullivan",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T00:30:28.000Z",
          "Titre": "Would not recommend any of their products",
          "Contenu": "The Renpho scale does not sync easily to apple health as this company promotes. Their app is horrendous and does not transfer data and is not user friendly. There are so many bad reviews regarding their app with similar issues as recent as January and going up to a year ago; however, their response is \"we'll pass this on to our technical department\". Doesn't look like they care to listen to their customers. Their customer service is a joke and is usually not available. The first time I called in, I kept getting an answering machine. On the third try, I finally left a message. If you want to return their product, due to the product not functioning as advertised, you could be subject to return shipping and restocking fees. When they did respond to my concerns through email, and provided the steps to connect to Apple Health as though the scale not connecting properly was my fault (I've only had an Iphone for over 10 years and have connected plenty of apps/scales without any issue) they suggested I provide my app account email so that they can forward it to the Technical Team for investigation. I also purchased their food nutrition scale which is a two star at best. It is not user friendly at all. This company definitely makes my top five worst companies I've ordered from, and would never recommend them to anyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Latoya Salters",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T20:59:24.000Z",
          "Titre": "This was my third time ordering from…",
          "Contenu": "This was my third time ordering from this company. First order delivered fine. Second and third orders were never delivered."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Disgruntled Customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T07:58:16.000Z",
          "Titre": "Poor communication unprofessional and…",
          "Contenu": "Poor communication unprofessional and incompetent; if I could give them zero stars I would. I ordered the body composition scales from Renpho and when they didn’t turn up within the stated timeframe I contacted them and was informed that the product had been returned to sender. At no point before this, did they contact me to inform me of what had happened or offer a refund. I asked them to resend the product, which they did. I asked for them to provide a tracking number, they did not. Once again, when the product had not turned up within the allotted time frame I contacted them and was informed it had been delivered. They finally provided a tracking number and told me to contact the courier. When I contacted the courier, I was informed that Renpho, had not provided the correct address or my email address, so the post office would have contacted them, rather than me that the item had arrived. Renpho did not pass this information on to me. I like the scales, they are accurate and are exactly what I wanted, however, the frustration, and angst I had to go through to get them was not worth it. I do not recommend dealing with Renpho. Their products might be good, but their poor communication, incompetence and unprofessionalism, is a huge deterrent."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gabrielle Hermosillo",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T23:43:35.000Z",
          "Titre": "My item has not shipped and when they…",
          "Contenu": "My item has not shipped and when they realized it was a po box they held it without asking for a new address. And I have yet to receive my package."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Proc",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T03:29:30.000Z",
          "Titre": "I ordered these two items and only…",
          "Contenu": "I ordered these two items and only received Heated Head Massager and not Eyeris. Have repeatedly calls and e-mail and issue have not been resolved."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Joel David  Ardila Cely",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T13:43:43.000Z",
          "Titre": "I bought a body scales no more than 1…",
          "Contenu": "I bought a body scales no more than 1 month and the super hyper fantastic sensors are no longer working"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wendy Smith Fields",
          "Nb_Reviews": 2,
          "Date": "2022-11-17T18:52:22.000Z",
          "Titre": "The scale is junk",
          "Contenu": "The scale is junk - very low quality, and not consistent (changes by a pound or more when I move it slightly). The body measuring tape is very hard to use and the screen is garbled, doesn't work well at all. I'd like a refund for both of these products -- totally a waste of money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sherwood Taylor",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T22:32:00.000Z",
          "Titre": "Ordered as a Christmas present well in…",
          "Contenu": "Ordered as a Christmas present well in advance.  Wasn’t shipped until a week and a half later.   Phone number went unanswered.  Disappointing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Imlexi",
          "Nb_Reviews": 3,
          "Date": "2022-11-15T01:34:22.000Z",
          "Titre": "I ordered 2 massagers",
          "Contenu": "I ordered 2 massagers.  Got them and plugged them in over night, the next night when I went to try them out NEITHER ONE WOULD WORK. 🤬 Now Renphro is not seeming to do anything about it.  They want me to send pictures of bar codes blah blah blah, but nothing has been done to remedy the situation of nothing working."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ranim",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T05:54:59.000Z",
          "Titre": "Respect your customer",
          "Contenu": "Received defective item, customer service deal in a unprofessional manner, they asked me to video tabe the item to proof that it is defective.I will never buy from them again and will me sure to publish my unpleasant experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Keith Bedell",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T19:02:14.000Z",
          "Titre": "Bad return policy",
          "Contenu": "I got the message chair however it does not work for my GMC Truck. I requested uti return it and was offered a 50% discount. I do not want the chair and I would like a refund for the full amount.  Please get back to me. 603-312-0716."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "EM",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T23:38:40.000Z",
          "Titre": "First and second scale did not read all…",
          "Contenu": "First and second scale did not read all metrics as advertised - horrible product"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T04:04:26.000Z",
          "Titre": "Unacceptable bugs in production, twice",
          "Contenu": "Renpho first introduced a bug that synchronised the wrong dates for body weight readings, now it has introduced one that synchronises the wrong readings (might be a date relates issue again). This is completely unacceptable in a production application, it could easily have been detected in testing and it has ruined my history of weight readings interfering with my ability to judge the effectiveness of what I'm doing to manage my weight."
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "J Ryan",
          "Nb_Reviews": 7,
          "Date": "2023-05-01T17:19:57.000Z",
          "Titre": "Massage gun died after 3 months and…",
          "Contenu": "Massage gun died after 3 months and does not have any warranty.Renpho not interested.AVOID.!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sher",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T02:47:05.000Z",
          "Titre": "Ordered 2 weeks ago and still nothing",
          "Contenu": "Ordered 2 weeks ago and still nothing. Took my $$ right away and still waiting on product.Should have never placed an order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Breda",
          "Nb_Reviews": 2,
          "Date": "2023-01-11T21:48:25.000Z",
          "Titre": "Customer service??",
          "Contenu": "Im still waiting to hear back. I need a return label please?I wanted to know the return process and I know a label is needed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patterson",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T23:46:44.000Z",
          "Titre": "The scale doesn’t work properly as the old ones.",
          "Contenu": "The scale doesn’t connect with using Wi-Fi. I prefer Bluetooth but it doesn’t allow anyone but me to connect via Bluetooth. How do I return it?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J T",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T18:34:00.000Z",
          "Titre": "Return policy is terrible",
          "Contenu": "Return policy sucks. Charging $24 shipping and return fees for a $64 order is not acceptable. Should have bought on Amazon."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Mei-Chien  SU",
          "Nb_Reviews": 1,
          "Date": "2023-01-02T12:20:43.000Z",
          "Titre": "I ordered foot massager online and…",
          "Contenu": "I ordered foot massager online and received it on 19/December/22. When I received: 1. The package outlook is like broken and old. Like someone else used it and returned.  2. When I tried it...it CAN'T turn on even. The touch panel bit weird and can't  work. I can't believe that Renpho sent this kind of broken product to me. I did read that website have over 4000 reviews and I thought it must be good product. I ordered this for my partner as xmas gift. It's really bad and shame that I ordered the broken muchine as a gift. The next day I called to customer service....the lady said she will send me an email in 2 days and let me know how to refund. And the next day I still called to ask email...then they just leave voice mail for holidays. Really terrible experience and I don't know why have over 4000 people recommended. 😕 for me I will not trust this brand and their google reviews. It even not deserved I give 1 star review!😠And Renpho should think why this thing happened. Why didn't check machine before send to customer. Quality always first."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Unhappy in",
          "Nb_Reviews": 1,
          "Date": "2022-11-13T12:24:54.000Z",
          "Titre": "Don't do it The product may be okay but it sat in…",
          "Contenu": "The product may be okay but it sat in their warehouse for almost 2 weeks after purchase before the shipping actually began.  Will never purchase from this merchant again and advise others not to as well.  Deeply disappointed."
        },
        {
          "Note": 1,
          "Lieu": "KE",
          "Pseudo": "AG",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T22:46:41.000Z",
          "Titre": "I made a request for my tape measure to…",
          "Contenu": "I made a request for my tape measure to be shipped without the battery I got no response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kelly Martin",
          "Nb_Reviews": 2,
          "Date": "2023-02-01T22:17:18.000Z",
          "Titre": "They keep bugging me to do a review but…",
          "Contenu": "They keep bugging me to do a review but it's taking weeks and weeks to receive the item. I haven't even received it yet"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "kristin white",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T21:02:37.000Z",
          "Titre": "Defective",
          "Contenu": "This machine is amazing, but it broke the second day. Still waiting for a response to my email requesting a return."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Stuart",
          "Nb_Reviews": 6,
          "Date": "2023-07-31T14:38:18.000Z",
          "Titre": "Decent Scales let down by the App",
          "Contenu": "Could be an excellent product if it had a decent app to accompany the scales. Looses past data so unless you copy it manually you are unable to compare days you are weighed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gayatri Bhanja",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T06:35:32.000Z",
          "Titre": "Product is excellent",
          "Contenu": "Product is excellent. No complaints about that. But the delivery service is worst.. first delivery has failed without informing me, second delivery was fine, but was too delayed.. Then when I received the product it was black in colour, when I have ordered white one.. very much disappointed for the service. 2 star only for the product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Debra Scruggs",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T01:10:26.000Z",
          "Titre": "Exchanging filters and I have not…",
          "Contenu": "Exchanging filters and I have not gotten return information yet."
        },
        {
          "Note": 2,
          "Lieu": "AE",
          "Pseudo": "Jonathan L",
          "Nb_Reviews": 8,
          "Date": "2023-01-09T19:36:24.000Z",
          "Titre": "Overall disappointment after purchasing three devices",
          "Contenu": "I bought a body scale, a smart tape measurement and a food scale. I'm only satisfied by the 1st device, which is well made, but the two others are a pain in the neck to use, especially the measuring tape.As to the software, frankly, we are below any other supplier Ive use like withings. 3 devices, three apps different...all in silos. But it's changing, which is good, but the app experience is not satisfactory at all, especially for the food scale, which I stopped using after a week, so much it is frustrating."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joyce Giacchi",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T23:46:32.000Z",
          "Titre": "Want to return item",
          "Contenu": "I sent an email yesterday, 1/4/2023, stating I want to return the head massager I purchased,  but I have not received a reply regarding how to return it and get a refund. Not very happy about the lack of response. If I don't get a response by January 10th I will contact my credit card company."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Laura",
          "Nb_Reviews": 4,
          "Date": "2023-06-15T14:58:10.000Z",
          "Titre": "Delivery is rubbish",
          "Contenu": "Checked delivery and it’s not left them yet it’s been 4 working days and heard nothing from them.  Wouldn’t bother with them again I wish I just bought a normal scales from the shops"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Maple",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T05:42:19.000Z",
          "Titre": "Placed an order for a foot massager on…",
          "Contenu": "Placed an order for a foot massager on 12/30. 11 days later and still nothing. The order is still in confirmed status, not even shipped and yet they've already charged my card. I sent out an email inquiring about the status of my order and all I got was an automated response saying that they received my email. If you cannot deliver my order to me before the end of next week, please just cancel it and give me back my money.Edit: After sending another email, I finally got in contact with customer service and they are working to fulfill my order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frustrated",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T20:01:37.000Z",
          "Titre": "Product not available after ordering",
          "Contenu": "I ordered timely but there was no availability of the product for the holidays so I canceled. I do understand that happens to retails but the disappointment is that until I prompted there we really no notifications or updates. First order was a complete bust."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marcie",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T00:00:57.000Z",
          "Titre": "Best gift!",
          "Contenu": "Got a massage gun for my boyfriend who has muscular pain from some of his seizures. He’s never been more excited in his life! He absolutely loved it and uses it all the time!Edit: unfortunately gonna have to give an update that it’s already broken after he had it for less than 2 weeks. The same thing has been shown in some Amazon reviews of the bottom half snapping off during use for no reason."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "HWr",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T14:39:45.000Z",
          "Titre": "delay in shipping",
          "Contenu": "delay in shipping, no communications or updates. My item has yet to ship and there is no update from the company on when this might happen or what is going on. I've reached out but still unclear on how this is proceeding. Some updates would be nice."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Christofer Worland",
          "Nb_Reviews": 5,
          "Date": "2023-06-13T04:14:41.000Z",
          "Titre": "The item did not work…",
          "Contenu": "The item did not work but the backup service staff member was helpful in allowing me to receive a refund."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mary Zalucki",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T04:06:11.000Z",
          "Titre": "It does not keep a charge for vey long",
          "Contenu": "It does not keep a charge for vey long, I have to charge every 2 days, not using it for longer than 5 to 6 minutes at a time"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Randi Henderson",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T22:13:44.000Z",
          "Titre": "They let me buy a product they didn’t…",
          "Contenu": "They let me buy a product they didn’t have enough of. When they were going to switch to a different eye massager they had in stock and send it to me they then confirmed they sold out of that one too. Pretty disappointed. I haven’t received my original eye massager because they aren’t getting them back into stock for a couple days and they said it will arrive near the end of this month. They did send an email stating they would give me an extra 3 month warranty on the product and 20 percent off any product but I don’t want to order anything else because I’m afraid this will happen again. Hopefully I can change this review once I get the product but I’m just overall not very satisfied about this whole shipping/purchase."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Lina Huang",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T05:50:32.000Z",
          "Titre": "Not pleasant experience",
          "Contenu": "Not pleasant experience. Their system appears to be messy in terms of order and refund."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cass Perkins",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T23:53:36.000Z",
          "Titre": "I ordered the blood pressure monitor…",
          "Contenu": "I ordered the blood pressure monitor and oxygen sensor assuming it Bluetooth to your app just like the floor scale.   Only to find out neither connect to app.    What a waste."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T05:44:39.000Z",
          "Titre": "I placed an order but it was never…",
          "Contenu": "I placed an order but it was never fulfilled because I used a PO Box, I think that’s absolutely absurd. I ordered from this company a few years back and I had absolutely no problems with the shipping to a PO Box so I was very disappointed that I couldn’t get what I wanted."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bill Hamilton",
          "Nb_Reviews": 4,
          "Date": "2023-01-20T16:36:07.000Z",
          "Titre": "Renpho premium leg massager",
          "Contenu": "This purchase was the premium leg massager. I've also bought a Bluetooth scale and a Bluetooth tape measure from Renpho, and I've been very happy with those items. They're easy to use, they're accurate, and they communicate well with the Renpho app. Regarding the leg massager, though; in my opinion, I think the advertising copy should be more specific about the fact that this is a compression \"massage.\" I could be wrong, but I think most people think of a massage in terms of a percussive action, or maybe a kneading action, or both, whereas this leg massager is really neither. Instead, it provides steady pressure over the whole area covered by each section (thigh, calf, foot), and progresses, one section at a time. It does provide good -and adjustable- pressure, but it's just not what I think most people would equate with a massage.Renpho customer service is responsive and pleasant to deal with, but I'd suggest purchasing something as expensive as this leg massager from Amazon. The Renpho return policy cost me about $65. This purchase was $80, and I was given the options to 1) return it, at the expense of an estimated $35 restocking fee and $25 shipping, or 2) keep it and take $15 off the price. I'm not blaming Renpho; this policy is probably stated on their website, and I just missed it because I'm not detail-oriented. But it's worth mentioning here"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tyvin Rich",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T18:50:51.000Z",
          "Titre": "this product appears shoddy",
          "Contenu": "I would like to return this product.  I have had four vibratos identical to this one.  It doesn’t hold the charge for more than an hour or so and much less like any of the previous owned ones.  This device  is either defective or your quality has dropped drastically.  Please advise.  Tyvin Rich"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "javier",
          "Nb_Reviews": 2,
          "Date": "2023-01-01T02:32:13.000Z",
          "Titre": "The required phone app leaves alot to…",
          "Contenu": "The required phone app leaves alot to be desired. The accuracy seems questionable but the scale was a very low price, so temper expectations."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lorna Fisher",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T01:52:38.000Z",
          "Titre": "I ordered the shoulder and next…",
          "Contenu": "I ordered the shoulder and next massager. I received a used product with abrasion on the product. There were no instructions and the charger loosely in the box."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sara Barsoom",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T17:09:55.000Z",
          "Titre": "I got the product but not the charger…",
          "Contenu": "I got the product but not the charger so I can’t use it. I contacted the company and was told they ran out. I’m still waiting for one so I can use the product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christy",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T22:05:31.000Z",
          "Titre": "Smart rope never worked",
          "Contenu": "The jump rope does not turn on when batteries are inserted. Have tried numerous batteries."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T04:13:52.000Z",
          "Titre": "Started off good",
          "Contenu": "Started off good. First part of order arrived much earlier than expected. The filters were shipped separately, and still, to this day have never received them. They told me they had been shipped separate through Amazon. When I still didn’t receive them, called back and was told they shipped via usps. Then told me I had to contact usps myself and also check with my neighbors to make sure they didn’t receive them. The customer service was so ridiculous, it doesn’t matter how good their products might be."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Langley Hughes",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T18:55:11.000Z",
          "Titre": "The blood pressure unit will not…",
          "Contenu": "The blood pressure unit will not connect to my phone. the unit reads high every time."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Thi hien phan",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T23:30:58.000Z",
          "Titre": "Missing item",
          "Contenu": "I ordered the foot massager with remote but they didn’t give the remote."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Bridget",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T01:50:40.000Z",
          "Titre": "Quick delivery but poor measurements",
          "Contenu": "Postage and delivery time of smart food scale and body composition scale was very quick. Unfortunately the body composition scale is not really accurate at all. Weight was +/- 500g compared to a professional scale, however body fat % was over 10% higher. I would have been happy with a couple % difference but this is just not reliable or usable for its intended purpose."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Barbara Caputo",
          "Nb_Reviews": 3,
          "Date": "2022-10-24T19:47:05.000Z",
          "Titre": "I received the product and advised the…",
          "Contenu": "I received the product and advised the company it didn't fit right. They only gave me back $19.00 with the excuse that it wasn't there fault. I will never by from them again."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "steve",
          "Nb_Reviews": 5,
          "Date": "2022-10-25T01:53:54.000Z",
          "Titre": "Does a good job of cleaning the air but…",
          "Contenu": "Does a good job of cleaning the air but the fan motor has a high pitched noise  even on sleep mode you can hear it. I like the  blower noise but the motor noise is too lowd"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Roy Ngo",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T12:06:18.000Z",
          "Titre": "Overseas transaction fee",
          "Contenu": "Hi, I have been charged $20 for overseas transaction fee on my credit card (HSBC), who advised me that my transaction is not local to Australia.  I already explained to them that this is not the case and still waiting for them to reimburse.  Lots of hassles....Hi,  this is not correct.  I have been trying to contact support but I have not received any response.  Please drop me an email and I will show you the correspondences."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Angela Deville",
          "Nb_Reviews": 1,
          "Date": "2022-08-15T17:51:12.000Z",
          "Titre": "Disappointing customer service",
          "Contenu": "I love the product but was very disappointed in the initial customer support I received. I was asked if I would consider keeping a defective foot massager and be given a $25 refund for the “inconvenience”. After I said no, I will not, I was sent a new foot massager. I considered it an insult to be asked such a thing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T09:21:14.000Z",
          "Titre": "I didnt get one of the items i…",
          "Contenu": "I didnt get one of the items i purchased. Emailed renpho but no reply."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Linda",
          "Nb_Reviews": 6,
          "Date": "2022-06-11T00:22:24.000Z",
          "Titre": "The actual bike is ok",
          "Contenu": "The actual bike is ok. The software is not. You need to set up an account & my email address cannot be recognised. Renpho have confirmed my email address will not be recognised (not sure if this is because I’m in Australia, but very odd). So I can’t set up an account therefore none of the programs work. The dial on the bike to move to different modes doesn’t always work so I’m using my iPhone as the timer etc. For this price, I’m disappointed. I could have bought better for cheaper."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Timothy Francis",
          "Nb_Reviews": 3,
          "Date": "2022-07-07T13:54:50.000Z",
          "Titre": "OK Massage Gun and questionable Customer Service…",
          "Contenu": "The massager has a rattle when applied because the design does not thoroughly secure the head in place, a short handle that makes it difficult to effectively reach and apply pressure to the lower back, and the power on the highest level is insufficient for deep pressure as described.  Worse, when I asked for a paid return label with the above description, they asked me to take a video to record the rattle, as if I could while using the massager, and ignoring the other two issues mentioned above.  Addendum: The manager has called, apologized, and fully refunded for the massager."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pablo Adame",
          "Nb_Reviews": 2,
          "Date": "2022-07-13T00:20:50.000Z",
          "Titre": "I ordered two (2) scales and paid for…",
          "Contenu": "I ordered two (2) scales and paid for them on June 29, 2022; order # SP-45515. Today iOS July 12, 2022 and still NO DELIVERY OF THE TWO (2) scales! Substandard and negligence with your delivery system!!!Pablo E Adame13712 Paseo de Fe El Paso, Tx 79928"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Sharon Costin",
          "Nb_Reviews": 2,
          "Date": "2022-04-25T22:41:38.984Z",
          "Titre": "Still not arrived",
          "Contenu": "Ordered 4th April, still not arrived so hard for me to review goods I have not received.  Contacted company re the tracking as it says awaiting processing and they answered that they did not know what this meant.  Told me that they will honour the sale, but no help in tracking the order down or offer to do this.  Covid can no longer be used as an excuse as far as I am concerned, over 3 weeks now.  Goods are worth close to $600 so would expect better service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nancy Lazcano",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T16:08:42.000Z",
          "Titre": "Worked great until it didn’t 😩",
          "Contenu": "After about 4 months , the green light will not stop blinking. I have replaced filter, reset, etc etc. I have notified manufacturer, and sent needed documentation, but have not heard back.**Update**company offered to refund half the cost since I had use of it  for 5+ months."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Schultz",
          "Nb_Reviews": 1,
          "Date": "2022-03-18T09:57:06.000Z",
          "Titre": "Product was so much less than I had…",
          "Contenu": "I am going to revise my review by giving it NO (zero) stars.  Any product that doesn't give full performance on ALL functions is less that complete.  Product was so much less than I had expected compared to others with the same features and price. Only a full replacement with a fully operating system will suffice."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Linda Camp Nelson",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T22:32:51.000Z",
          "Titre": "The Renpho scale works very well.",
          "Contenu": "The Renpho scale works very well.The measuring tape is cheaply made and very difficult to use. It is not easy like all the videos show. The pin sticks and will not release.Very disappointed in measuring tape."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Getting back in shape",
          "Nb_Reviews": 1,
          "Date": "2022-03-03T15:44:02.000Z",
          "Titre": "Bike quality is not great..",
          "Contenu": "Bike quality is not great... The resistance mechanism has a loud hum when in use. Higher resistances are not smooth, very jerky cadence. The bluetooth kept getting disconnected during downloaded rides. Not for serious exercise unfortunately."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "JG",
          "Nb_Reviews": 2,
          "Date": "2021-12-25T23:21:38.000Z",
          "Titre": "Body fat scales do not work",
          "Contenu": "I bought a massage gun (good, 4 stars but would be better with 1 more-gently setting than the lowest). The other thing I bought was a set of scales to measure % body fat. Except they don’t. Ever. Useless, waste of money. Zero, 0, no stars."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "PHANI KOSARAJU",
          "Nb_Reviews": 1,
          "Date": "2021-11-29T14:14:15.000Z",
          "Titre": "Not happy because it lacks cushioning…",
          "Contenu": "Not happy because it lacks cushioning after use u usually feel soreness on your back. Therefore i am not using it it’s just there. I used 3 times dont feel to use it.One good thing about this is It is very reliable Than other that I have used. this is real.Iam writing the update regarding the whole issue the customer team contacted me and they have refunded some percentage of money from the purchase. They are very polite to offer that.  I think if you buy one like this buy a sponge cushion or something.Updating my review form one star to two star Because of their good customer service. Either way I won't change my words regarding the product. I don't want to mislead anyone who wants it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sarahww",
          "Nb_Reviews": 2,
          "Date": "2023-01-12T23:08:53.000Z",
          "Titre": "doesnt fit well",
          "Contenu": "doesnt fit well, and massage doesn't seem to work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Disappointed",
          "Nb_Reviews": 2,
          "Date": "2022-01-20T18:34:27.000Z",
          "Titre": "The medium room sized air purifier unit…",
          "Contenu": "The medium room sized air purifier unit is ok at best.  It's for our bedrooms, they're barely 12 by 10.  And this does an OK job over a long period of time. I ordered 2 the company only sent me one, I still have yet to receive the 2nd,  and I ordered both units during black Friday at the end of November it is now almost January 1st. I ordered both of them directly from the manufacturer.I had to prove that I had only received one, when it clearly stated on the fedex delivery notes the size and weight of the Box.Will not be buying any of their products again.Response:  Add already been in contact with your customer service department. And have received the 2nd one. Your customer service is lousy. Good luck to you in the future"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kevin  Davis",
          "Nb_Reviews": 2,
          "Date": "2022-05-17T20:32:39.000Z",
          "Titre": "Don't waste your money",
          "Contenu": "Not really an upgrade from the first one my wife bought. Honestly I don't think it's very accurate. I won't be purchasing any more of your products."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Malcolm Young",
          "Nb_Reviews": 1,
          "Date": "2022-06-20T12:09:09.000Z",
          "Titre": "My Fault!,",
          "Contenu": "My Fault!,I though i was buying the current model with the longer arms and the washable cover.I was sent an old model.First world problem."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Perry",
          "Nb_Reviews": 3,
          "Date": "2021-11-09T19:28:18.000Z",
          "Titre": "The replacement battery is overly tight…",
          "Contenu": "The replacement battery is overly tight in the new charger and gun. Very hard to remove and insert from both charger and gun."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-02-02T12:55:16.000Z",
          "Titre": "I didn’t received on time after…",
          "Contenu": "I didn’t received on time after contacting the canceled my order and refund me back instead of sending me another one"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rosie",
          "Nb_Reviews": 3,
          "Date": "2022-08-24T17:28:24.000Z",
          "Titre": "Impossible to return anything",
          "Contenu": "Hard to get a hold of on a return.  Making a return is very hard to do."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Yatin",
          "Nb_Reviews": 3,
          "Date": "2022-07-29T04:30:21.000Z",
          "Titre": "Renpho smart body tape and smart scale",
          "Contenu": "The items provided are not accurate in their measurement. Not happy with this"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kenneth Session",
          "Nb_Reviews": 2,
          "Date": "2022-04-22T05:59:51.031Z",
          "Titre": "I never received my order..",
          "Contenu": "I never received my order... please resend it to 484 Lake Park Ave Suite 447 Oakland, CA 94610"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Skyler Williams",
          "Nb_Reviews": 1,
          "Date": "2022-02-18T16:03:16.000Z",
          "Titre": "It’s a good idea and has potential",
          "Contenu": "It’s a good idea and has potential, but the massager doesn’t have enough power behind it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alma",
          "Nb_Reviews": 2,
          "Date": "2022-02-22T20:58:55.000Z",
          "Titre": "It is loud",
          "Contenu": "It is loud. The slabway is much better."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "AB",
          "Nb_Reviews": 1,
          "Date": "2022-04-30T12:00:40.000Z",
          "Titre": "Not the best smart scale"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ronnie Veres’s",
          "Nb_Reviews": 1,
          "Date": "2021-10-04T00:23:45.000Z",
          "Titre": "Can’t get WiFi to work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Foster Sara",
          "Nb_Reviews": 4,
          "Date": "2023-11-29T08:04:15.000Z",
          "Titre": "My experience with Renpho.com was…",
          "Contenu": "My experience with Renpho.com was adequate. In spite of a few hiccups in the process, it was overall an average experience. Navigation was not as seamless as I had anticipated, but the service was run-of-the-mill. Prices were generally fair. Payment process was average, no issues encountered. No any excptional issues arose. Even thoguh there were a few problems here and thre, the overall experince was mstly averag."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kate Callahan",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T19:03:17.000Z",
          "Titre": "The foot pockets are too small for my…",
          "Contenu": "The foot pockets are too small for my husbands feet 🫤"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lee",
          "Nb_Reviews": 2,
          "Date": "2022-12-30T07:51:36.000Z",
          "Titre": "Changing units wasn't obvious & use on solid surface?",
          "Contenu": "Changing units wasn't obvious. I like the way the scale works but I wanted to change the units from pounds to kilograms and looked all over the scale but couldn't find a switch or setting (maybe under the battery cover - but no). I had to download two Renpho apps before I figured things out, and the tech support didn't seem very helpful either. But now I'm satisfied with the scale. NOTE: it doesn't seem to give accurate readings when placed on a carpet..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike the new guy",
          "Nb_Reviews": 2,
          "Date": "2022-12-26T19:57:27.000Z",
          "Titre": "Air purifier purchase",
          "Contenu": "After placing the order it took longer than expected (approx. 3 days) to be notified of shipping. Even though my credit card was charged immediately.  The product did arrive when the tracking number information said that it would. The purifier performs as described. I haven't used it long enough (about 2 weeks) to rate it over time. I don't know why vendors want 5 star ratings for just providing the service that should be the norm. So far it performs as described. Why should that be exceptional?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-12-12T03:54:28.000Z",
          "Titre": "Very hard to return items",
          "Contenu": "They make it essentially impossible to return something if you don't like/need it any longer. We're probably spoiled by Amazon however, and this company seems to be based overseas. I was offered a complicated return process, with a restocking fee and paying postage myself. But they also offered a 60% refund if I kept it, which they pointed out would be about the same total cost. I took them up on it, and it's a good strategy and I appreciated it. But be certain when you order from them, as if you don't like something, you're pretty much stuck with it."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Elton",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T01:49:34.000Z",
          "Titre": "Foot massager workes well for circulation",
          "Contenu": "Foot massager workes well. Great at getting the blood flowing. Just needs a few tweeks ; an inbetween setting on air and massage between medium and high . And The warmer function works at about the 12 minute function just before it finishes it's 15 minute massage."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Barry Taylor",
          "Nb_Reviews": 3,
          "Date": "2023-05-21T22:04:29.000Z",
          "Titre": "Delivery very fast",
          "Contenu": "Delivery very fast. After liking the first Renpho product I bought (hand massager), I was a little disappointed in this one (leg-foot massager). It was mainly a compression device, where I expected more vibration than it gives. Still happy with purchase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Thayer",
          "Nb_Reviews": 2,
          "Date": "2022-12-23T18:06:47.000Z",
          "Titre": "I placed an order for a gift on 12/9/22…",
          "Contenu": "I placed an order for a gift on 12/9/22 and received a confirmation. After over a week, I checked on the status and was told it had shipped and would be delivered by 12/22/22. It has not been delivered and on the tracking it says on 12/22 it is still in Colorado"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joanne Nottingham",
          "Nb_Reviews": 5,
          "Date": "2022-12-25T21:55:47.000Z",
          "Titre": "Batteries did not work",
          "Contenu": "Batteries did not work.  Zero instructions about handle without tech window - use one battery or two?  Put own battery in one handle and still did not work.  Will use without tech.  Product design is poor if inoperable but use without tech is very good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Yitzchak Ben Avram",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T17:30:27.000Z",
          "Titre": "I disliked that it has been about 2…",
          "Contenu": "I disliked that it has been about 2 weeks and no tracking nor delivery of the handheld massager I purchased.  3 stars because I like the neck massager and received it. Would have been higher rating if I didn't have to wait so long for the other product..."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "frank toner",
          "Nb_Reviews": 8,
          "Date": "2023-03-31T22:11:50.000Z",
          "Titre": "Bought hair trimmer dec 22",
          "Contenu": "Bought hair trimmer dec 22Won’t charge & wont now work . Customer service man Corey sorted out a refund & was very helpful but only after it being made more difficult than needed by the Company"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Debbi",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T20:09:24.000Z",
          "Titre": "Renpho Scale",
          "Contenu": "It’s a neat scale and all but the accuracy is not better than my Fitbit scale. The difference between standard mode and athlete mode is alarming. I had a DEXA scan done the day before receiving this scale and BF % is at least 3-4% off."
        },
        {
          "Note": 3,
          "Lieu": "AE",
          "Pseudo": "Omar",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T01:09:09.000Z",
          "Titre": "Massage is good...other stuff can be improved",
          "Contenu": "Overall I get a good massage from the machine.Haven't not been for the following items, I would have rated 5 stars:* No memory.  Whenever the machine is turned on from standby, will have to choose my favorites settings again* Low heat is too high. I usually turn it off* Remote only works from one side and when very close to the machine.  It defies the purpose of a remote* No clear instructions on what is front/back of the machine when massaging calf/foot. I still don't know the layout it was designed for. Poor manual"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Grace",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T09:06:11.000Z",
          "Titre": "This is more for athletes it’s much too…",
          "Contenu": "This is more for athletes it’s much too powerful and heavy for a regular massage or injuries in regular people.  I bought it because I had shoulder injuries and the purpose was defeated for both weight and performance"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sally Kitchen",
          "Nb_Reviews": 4,
          "Date": "2022-12-13T02:55:47.000Z",
          "Titre": "Full order finally received",
          "Contenu": "I ordered two items. A massage gun with a warranty and a scale. The scale finally arrived after contacting customer support. Both will be Christmas presents for family members and tested at that time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jaime Ramos",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T22:47:21.000Z",
          "Titre": "This package was to be sent to my…",
          "Contenu": "This package was to be sent to my country; They tried to deliver it on Friday and Saturday, but it couldn't for X reason and I received it until Monday. I have never had problems with deliveries, they leave it at the foot of the door, period."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elena",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T06:22:24.000Z",
          "Titre": "Order delayed, then cancelled, then sent",
          "Contenu": "First, I received an email from customer service that my order was delayed. Apparently RENPHO oversold the massager that I ordered. I replied that I was dissatisfied and might consider canceling. I said \"might consider\". The next email from customer service notified me that my order was cancelled. I did not request it. This is very disappointing.Update: I talked to a customer service representative on the phone, she said she could do nothing and advised to send another email to customer service. I did so and got a reply that nothing could be done since the order was cancelled. I got my money back. But then, I received the massager in the mail. So now I have a free massager. And I love it! I just wish their customer service was more adequate."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Herman Branton",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T01:31:35.000Z",
          "Titre": "A let down",
          "Contenu": "I paid for my smart treadmill for Christmas. Or at least I thought.Only to have my money refunded to say that they're out of stock.No word on when or if they will get more. Truly disappointed"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ted Bennett",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T20:37:01.000Z",
          "Titre": "Came on time and packed well",
          "Contenu": "Came on time and packed well. The initial first use was a little disappointing. I was hoping for harder rolling/kneading action. The air and heat functions are fine (don't expect hot). After about the third use, I figured out you can \"stuff\" a sock over your toes to force them down, giving you a harder massage."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ken Marsh",
          "Nb_Reviews": 1,
          "Date": "2022-12-26T16:11:59.000Z",
          "Titre": "The advertisement for the see though…",
          "Contenu": "The advertisement for the see though model is pretty deceiving. You can see through it, but it is blurry and you cannot look through it for longThe functionality of the item is good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gail - Texas Resident",
          "Nb_Reviews": 4,
          "Date": "2022-12-12T01:04:08.000Z",
          "Titre": "Shipping Notifications Lacking.",
          "Contenu": "Ordered #1 Renpho and got right away. Liked it so much I ordered #2 for my friend's birthday before Thanksgiving. Two phone calls and one email later they finally shipped the Nov 26 order to my friend's door on Dec 7. I was not given any heads-up regarding delivery estimated date on the order. The first phone call to customer service said they were backed up from Black Friday and to call back in 48 hours if not shipped, which it was not and required more follow up.  The last phone call for customer service said the business closed for 4 days for Thanksgiving. So my friend's birthday was Dec 3 but no one or the website said the shipping would be delayed due to Thanksgiving holidays. Love the product and the price. Preferred to order direct instead of third party website but you really need to let folks know you will be out or an estimated shipping date."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vivek Kumar",
          "Nb_Reviews": 5,
          "Date": "2023-05-18T04:40:59.000Z",
          "Titre": "The return policy is not very friendly",
          "Contenu": "The return policy is not very friendly. In these days re stocking fees , shipment cost etc. is unheard of.Very disappointing.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Viapiana",
          "Nb_Reviews": 6,
          "Date": "2023-03-29T18:41:06.000Z",
          "Titre": "My order with Renpho was rather confusing.",
          "Contenu": "My order with Renpho was rather confusing. After ordering I received an email stating that I would receive my item in approx. 10 days. I wrote back to cancel my order as I did not want to wait ten days. I never heard back. The unit arrived the next day. There is also a price issue. When I place the order the unit sold for $52. I was billed more than that. Also now the unit dropped to $43 on their website. Customer Service only deals with problems with shipping and problems with the unit so I had to send a email. I was told I would hear back in 3 to 5 days. I am waiting.The unit works well so now I am waiting to see how the company deals with the price issue. If corrected I will then give 5 stars."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Myles",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T03:36:21.000Z",
          "Titre": "Device seems to work as intended",
          "Contenu": "Device seems to work as intended, but the standard ball attachment became white/discolored within the first few uses."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Tog Porter",
          "Nb_Reviews": 9,
          "Date": "2023-07-23T13:30:46.000Z",
          "Titre": "Renpho Foot Spa with Massager.",
          "Contenu": "Renpho Foot Spa with Massager.I am diabetic and also have mobility issues. I cannot reach my feet to wash and dry them so I bought this to see if it would help.There are a couple of fundamental design flaws. The removeable cover does not fit well, and it is impossible to use the carry handle with the cover in place.It is very heavy with water in it, and the cable is not very long. I had to plug it into an extension to use it at my desk. Also, it would be handy if there was a cable storage facility, as there is nowhere to put the cable when transporting or storing the unit.I cannot reach the controls when my feet are in the bath under my desk, and the controls are hard to see. It would be helpful if the control buttons were illuminated.To overcome this I used a torch and one of those rubber topped pens you get for touch screens.Getting my feet in was not easy, as there is not much access room.The heater is a nice touch and the bubbles felt good. More importantly after 20 minutes my feet were much cleaner than when they went in.The worst thing about this product is the discomfort caused by the casing putting pressure on my legs during the process. I sat upright to avoid an awkward angle, but it seemed that no matter where I placed my feet, my legs were pressed against the side or the front, which was uncomfortable, bordering on painful. Even after I got my feet out, I could feel the pressure marks on my legs for some time.I wish I had found a better one, and now that I have used it I suppose I can't return it, which is disappointing. I will therefor persevere with this one and hope it gets easier to use as time passes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eishau Allen",
          "Nb_Reviews": 4,
          "Date": "2023-02-01T14:10:27.000Z",
          "Titre": "Not on same app",
          "Contenu": "I don't like that I cantbuse the watch, scale, and tape measure all on one app. I would've never bought them all. The watch was difficult to set up, and the battery does NOT last as long as you say 🙄"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Tet Lai",
          "Nb_Reviews": 2,
          "Date": "2023-01-19T03:01:45.000Z",
          "Titre": "Slow to response",
          "Contenu": "Slow to response. It took 11 days from the date I reported receiving a dead unit to receive an email they would send me a new unit."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dorothy Westmoreland",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T00:29:35.000Z",
          "Titre": "I thought I ordered the larger scale…",
          "Contenu": "I thought I ordered the larger scale but the one I received is so small not satisfied at all with the product size.  Will not order again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Allison Rowe",
          "Nb_Reviews": 4,
          "Date": "2022-11-09T05:33:50.000Z",
          "Titre": "Replacement product shows clear downgrade in quality.",
          "Contenu": "I really liked my previous Renpho back massager but it broke after about 2 years and there wasn't any repair option. I bought a replacement and its such a downgrade from the last one. Way smaller, cheaper materials, weaker motor. Very disappointing."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Narelle Herbert",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T02:25:34.000Z",
          "Titre": "No Receipt",
          "Contenu": "The massage gun was shipped promptly but there was no receipt sent with this product. Where can l find the receipt?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony  Russo",
          "Nb_Reviews": 2,
          "Date": "2023-05-24T22:30:08.000Z",
          "Titre": "It doesn't come with a remote,very hard…",
          "Contenu": "It doesn't come with a remote,very hard to operate without remote"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Terri Chapman",
          "Nb_Reviews": 2,
          "Date": "2023-03-31T22:06:23.000Z",
          "Titre": "When the scale works",
          "Contenu": "When the scale works, it's great, but I have a difficult time getting it to turn on."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian Durning",
          "Nb_Reviews": 5,
          "Date": "2022-11-08T14:08:47.000Z",
          "Titre": "I could not create an account to take…",
          "Contenu": "I could not create an account to take advantage of news and information as well as to keep buying your products so I ended up buying them on Amazon for about the same price and free shipping."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daphne Matute",
          "Nb_Reviews": 1,
          "Date": "2023-01-02T02:13:28.000Z",
          "Titre": "The measuring tape can be a little bit…",
          "Contenu": "The measuring tape can be a little bit difficult to use without the assistance of another person."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Nisrin Alia",
          "Nb_Reviews": 2,
          "Date": "2022-11-25T10:22:25.000Z",
          "Titre": "The sound is so annoying and…",
          "Contenu": "The sound is so annoying and distracting for the relaxation"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "H Kealy",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T02:56:17.000Z",
          "Titre": "Weak support / FAQs",
          "Contenu": "I found your on-line help / support to lacking.  It seems very difficult to add a second user."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "S. Smith",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T03:37:35.000Z",
          "Titre": "Products works well but could be improved",
          "Contenu": "Products works well and has some features like timer, light on/off and fan speed which I regularly adjust. The two main drawbacks I wish the air purifier had 1. Indicater display PM2.5 reading of the current room so we can compare how much lower the number is when we turn it on 2. An app where we can turn on/off the device and adjust fan speed,as well as track the PM2.5 device.Only bought this as it was on sale and had good reviews when I looked it up but I guess I had other expectations. Overall not a bad product but I would prefer the xiaomi due to the PM2.5 indicator reading and app functionality."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Maier",
          "Nb_Reviews": 5,
          "Date": "2023-06-02T18:51:28.000Z",
          "Titre": "Sad that there is not Bluetooth…",
          "Contenu": "Sad that there is not Bluetooth connectivity on my device."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andy King",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T19:02:01.000Z",
          "Titre": "the product is good",
          "Contenu": "the product is good, however, I can get the same product from Amazon for less."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steven Houser",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T12:51:45.000Z",
          "Titre": "sample eye massager?",
          "Contenu": "I thought I was to be sent the eye massager to try, and review. I never received itYour sales will do poorly without advocatesEdit: no sample sent. Wrong. Care to reconsider your claims? You suggest I am lying. I am not."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carmen Cruz-Torres",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T12:14:21.000Z",
          "Titre": "Have to weigh my self multiple times to…",
          "Contenu": "Have to weigh my self multiple times to connect to the App"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kurt",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T04:49:19.000Z",
          "Titre": "Poor customer service",
          "Contenu": "Never got a response to my follow question regarding a late delivery."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Angelica Martinez",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T21:43:29.000Z",
          "Titre": "The connection of the Wi-Fi disconnects…",
          "Contenu": "The connection of the Wi-Fi disconnects often. The balance of the scale isn’t the best. The feet stands underneath the scale move a lot. I think the previous generations is better than this new one. It’s more stable when a person stands on it. If I had the box I would return for the previous generation."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ryan Miller",
          "Nb_Reviews": 1,
          "Date": "2022-07-12T02:45:23.000Z",
          "Titre": "Bluetooth difficult",
          "Contenu": "Bluetooth connected easily but has not been connecting regularly with ease for a while since then. Data seems accurate though when connected. I have reached out to customer support a few times too but have not heard back."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LISA CARRICO",
          "Nb_Reviews": 1,
          "Date": "2022-03-28T23:47:07.000Z",
          "Titre": "They massager is ok.",
          "Contenu": "They massager is ok. I wish it was more spread out to include the shoulders better, especially since it is marketed as neck n Shoulders massager. Works mainly on neck, not great for shoulders.Also, a nice feature to add would be battery and/or charger availability so a person can move about if needed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cheryl Cichocki",
          "Nb_Reviews": 2,
          "Date": "2021-12-24T18:08:04.000Z",
          "Titre": "A bit disappointing",
          "Contenu": "A bit disappointing. I like how the app for tape measure and scale are together. The app tells you the area to measure and automatically send the data. The tape is too narrow and is hard to handle. I guess it’s better if someone else is doing the measurements for you. Shipping took forever as tracking showed my order bouncing around California for a week."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Galvin Belk",
          "Nb_Reviews": 1,
          "Date": "2022-01-12T01:44:23.000Z",
          "Titre": "Purchased a mini massage gun and was…",
          "Contenu": "Purchased a mini massage gun and was dead on arrival.Have contacted support and they will be sending a replacement.Update.Replacement has been sent and it works as expected. Overall happy with the massage gun and the service received. While disappointed I received a faulty unit, the response was quick and the replacement received within the week."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "SK Z",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T01:31:45.000Z",
          "Titre": "a lot work needed for a massage",
          "Contenu": "you have to pull down on the arm straps pretty hard so the massage can stay on the neck or the spot you want it on.it's not my idea for a relaxing experience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "rgoulet",
          "Nb_Reviews": 2,
          "Date": "2022-02-11T14:21:11.000Z",
          "Titre": "Location of my scale was uncertain.",
          "Contenu": "Tracking the location of my order was uncertain and uninformative.  Shipping details indicated the order shipped for more than a week.   Query to customer service yielded a canned email that “shipping is delayed.”   Scale did arrive in excellent condition and works as advertised."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sharon Winfrey",
          "Nb_Reviews": 2,
          "Date": "2021-12-15T16:52:38.000Z",
          "Titre": "I love the product...but",
          "Contenu": "I love the product, but I had to contact Renpho for a shipping update.  A week after I received notification that the item was shipped, USPS was showing that they were still awaiting the item.  Shortly after my inquiry, USPS updated the shipping information to item received and on the way."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ronald Walker",
          "Nb_Reviews": 2,
          "Date": "2022-06-03T20:43:59.000Z",
          "Titre": "I am quite disappointed in the Renpho…",
          "Contenu": "I am quite disappointed in the Renpho scale I recently purchased. I had an old one, which did nothing more than report my current weight.*  I decided to upgrade to a current model, touted by Renpho as offering various options for analyzing the composition of my weight and identifying tendencies over time.  I was especially interested in the prospect of linking the new scale with other health and nutrition trackers, including MyFitnesPal.  Unfortunately, I was unable to get the scale to do any of these things.  All it does is record my current weight.  *The old scale no longer even records my current weight, instead always offering only the same figure--which is less than half of what I actually do weigh!"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "michael",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T14:57:19.000Z",
          "Titre": "Not as pictured but works",
          "Contenu": "Looks nothing like the one they use in advertising pictures. Instructions not really clear took a bit to connect to the phone but overall item works Postage was prompt"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mary Root",
          "Nb_Reviews": 1,
          "Date": "2022-04-14T15:35:29.000Z",
          "Titre": "I have several products",
          "Contenu": "I have several products.  I LOVE my bathroom scale.  LOVE my kitchen scale.  The air purifier was great until I changed the filter.  I worked with cust service because its under warranty but now they are refusing to help."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Angel Vazquez",
          "Nb_Reviews": 1,
          "Date": "2022-03-15T12:45:36.000Z",
          "Titre": "It does not have enough power for my…",
          "Contenu": "It does not have enough power for my feet anyway my son and sister like it. It would have been better if it got my arches more and around my feet instead of just the bottom. I have to reposition my feet so it can get all of it. It"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Barhom",
          "Nb_Reviews": 1,
          "Date": "2021-10-10T01:49:29.000Z",
          "Titre": "I'm not sure yet",
          "Contenu": "I'm not sure yet. I asked to return the foot massager (explained to he reason why after I was asked to) and still waiting for a reply. I appreciate if someone can get back to me.Thank you for your help.Avraham (Avi) Barhom) bavi5937 at gmail.com is my main email."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Olivia",
          "Nb_Reviews": 1,
          "Date": "2022-05-14T01:42:13.000Z",
          "Titre": "Purchased the eye massager",
          "Contenu": "Purchased the eye massager. Air pressure is actually really good. Such a shame it is so so noisy I can't hear myself think! Also for people who get migraines, cold would be better than heat on the eyes."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Abacus",
          "Nb_Reviews": 1,
          "Date": "2022-07-04T16:44:43.000Z",
          "Titre": "It's good but there really is scope for…",
          "Contenu": "It's good but there really is scope for improvement ...can bearly feel the heat...it's almost non-existent. The movements could be a little more stronger."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 1,
          "Date": "2021-12-13T22:07:40.000Z",
          "Titre": "Wrong color",
          "Contenu": "Haven’t used the product yet. Shipping took longer than expected but due to the holidays that’s understandable. My problem is I ordered one black eye massager and one white. I was sent two white ones instead..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gracen Smith",
          "Nb_Reviews": 2,
          "Date": "2021-12-13T20:00:31.000Z",
          "Titre": "I guess I wasn't aware of delivery…",
          "Contenu": "I guess I wasn't aware of delivery times since I got accustomed to Amazon; but lately their deliveries do not live up to their prime members 😕 I also would like to buy the pet filters for my 5 Renpho air purifiers when I need them, this is the second time they haven't been available. I guess that's because you have to wait so long for your overseas manufacturing to get them to you. I do like your products as you can see I have purchased 5 air purifiers 3 of your massage wands and the face massage Renpho. So yes I believe that you deserve thumbs-up for products, but I really don't like when I can't purchase filters when I need them and 3 weeks it takes to get the ones I really didn't want. G.F.S"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "L B",
          "Nb_Reviews": 1,
          "Date": "2021-10-10T12:29:44.000Z",
          "Titre": "My scale is incompatible with 5G so I…",
          "Contenu": "My scale is incompatible with 5G so I am unable to use the main feature of syncing with Bluetooth. Without that feature there is no reason to use the scale over my other scale. I like the app good enough."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "N. WILSON",
          "Nb_Reviews": 1,
          "Date": "2021-11-26T20:05:14.000Z",
          "Titre": "I am EXTREMELY disappointed that this…",
          "Contenu": "I am EXTREMELY disappointed that this scale does not connect to my wifi. That's literally the reason I bought it. Waste of money, in that respect. Otherwise, it works fine."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lori Ellicott",
          "Nb_Reviews": 1,
          "Date": "2022-04-24T16:42:44.703Z",
          "Titre": "I’m having trouble adding my new scale…",
          "Contenu": "I’m having trouble adding my new scale to my iPhone. I already have the app and my sisters scale on there. Do I have to delete that one to register mine?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lamont Alford",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T18:27:41.000Z",
          "Titre": "Can't get the body fat to register."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "HonestMan",
          "Nb_Reviews": 15,
          "Date": "2020-12-21T14:42:22.000Z",
          "Titre": "RENPHO Heating Pad for Back Pain Relief, Does nothing but warming the back like Electric blanket",
          "Contenu": "I have purchased \"RENPHO Heating Pad for Back Pain Relief\" from Amazon few days ago. It was my second purchase after RENPHO branded Weight scale. The scale was amazing that made me to try the \"RENPHO Heating Pad for Back Pain Relief\".My honest review would be negative. This pad just warms my back and that's it. No other feelings, absolutely nothing at all. It works just like an electric blanket for the back, nothing else.   I believe, RENPHO got a lot of improvement to make to make this pad working and popular. But I am very grateful for their scale, that's smashing and helping me to monitor my weight controlling efforts. Thanks for that. This is why I am giving 3 star by looking at the brand. But considering the Massage pad, it deserves 1 star or less. I hope, my review would be helpful for both RENPHO and the potential customers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Curtiss Dill",
          "Nb_Reviews": 1,
          "Date": "2022-05-12T19:40:55.000Z",
          "Titre": "Pleased with service",
          "Contenu": "Pleased with service, ordered wrong size filters needed the larger size.Will be returning ones I received..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tay Curry",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T21:16:11.000Z",
          "Titre": "It’s Ehh!",
          "Contenu": "The rope could’ve been longer, I’m literally hitting my feet every time I jump messing up my jumps!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "steven perry",
          "Nb_Reviews": 1,
          "Date": "2022-02-09T08:00:47.000Z",
          "Titre": "your site doesn't tell you that you…",
          "Contenu": "your site doesn't tell you that you have to buy all the other accessories to get a accurate reading"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Xavier Mota",
          "Nb_Reviews": 1,
          "Date": "2022-01-27T18:22:54.000Z",
          "Titre": "Its ok I saw it had bad reviews after I…",
          "Contenu": "Its ok I saw it had bad reviews after I bought it and it doesn’t show the correct weight sometimes"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nicole G",
          "Nb_Reviews": 1,
          "Date": "2021-12-11T19:32:08.000Z",
          "Titre": "It took almost a month to ship",
          "Contenu": "It took almost a month to ship! I am happy with the producta but the shipping took ages!"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Kuldeep Sembhi",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T23:35:47.000Z",
          "Titre": "Nice but Not as I expected",
          "Contenu": "Not as I expected, But nice product, delivery is fast as well."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BRYAN",
          "Nb_Reviews": 2,
          "Date": "2022-08-04T22:19:04.000Z",
          "Titre": "Can't get food scale to connect to my…",
          "Contenu": "Can't get food scale to connect to my phone app."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeffrey Yoon",
          "Nb_Reviews": 1,
          "Date": "2022-12-24T03:24:32.000Z",
          "Titre": "Not warm enough"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barnes Hannah",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T13:56:22.000Z",
          "Titre": "I had an ordinrary experience with…",
          "Contenu": "I had an ordinrary experience with renpho.com. Everyting was so-so, but nothing to be excited about. Not stellar or oustanding, mereley averrage. My queries got replied at decent speed and they had decent form of servise. However, the customer soport could have been Beeter overall it did the job, nothing to complain about.  There appears to be a fair Amount of other people having similar experience as me. Howeer the 3 stars oerall does seem a bit harsh for an ok experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julia Mihalyi",
          "Nb_Reviews": 4,
          "Date": "2023-10-03T13:10:36.000Z",
          "Titre": "The mask did not work for me as my eye…",
          "Contenu": "The mask did not work for me as my eye area is sensitive, but the company offered a refund and they were very responsive. I will keep an eye on their developments in eye masks , , ,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Santa Randy",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T17:28:40.000Z",
          "Titre": "The massager itself works absolutely…",
          "Contenu": "The massager itself works absolutely great, once you get the app working.  The app used to control it was a bit complicated.  Instructions not real clear or complete.  Almost sent it back!  Oh, and the app can only be used by one phone at a time.  If you add it to a second phone, it kicks the first phone off.  I do like the expanded options with the app over the simple remote model."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin D",
          "Nb_Reviews": 2,
          "Date": "2022-12-23T16:40:13.000Z",
          "Titre": "Product is absolutely great, tracking was a let down",
          "Contenu": "Product is absolutely great. I ordered a massage gun that was on sale for US$49.99, site auto-added coupons to drop it around US$42, and taxes brought it to an even US$45. It was well packaged and came with no damage at all. So why did I dock a star?The Shopify app is absolute crap for tracking. I ended up throwing the tracking number into a much less robust, but more reliable, app that gave better updates and not full of advertising."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Phyllis",
          "Nb_Reviews": 3,
          "Date": "2023-06-19T16:47:59.000Z",
          "Titre": "Practical resolution of an issue",
          "Contenu": "Although we decided not to keep our purchase (personal preference, not any problem with the product), we were satisfied with our experience. Returning it would have cost return shipping and a 15% restocking fee. Instead they offered to reimburse us 65% if we would simply give ot to someone else to use. We found this a very acceptable solution to us, saving us time, and possibly money (shipping costs)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shishir Pandey",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T07:51:26.000Z",
          "Titre": "Good product",
          "Contenu": "This product is  impressive with high end message speed and message heads. It excels in every aspect except for the charging time. In my experience, it takes over 4 hours (specifically 7-8 hours) to charge using 5W power delivery charger. When fully charged, it delivers high intense message, but the message delivery gradually decreases as the charge starts depleting from 100%. Anyway, R-C001 is great for its price (I paid US $64)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sar",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T01:44:58.000Z",
          "Titre": "Improvement",
          "Contenu": "Its a good product but it could be better. It moves slight up the bridge of the nose and interrupts the anticipated and much needed pressure on the sinus area hopefully you all will tweek that and offer a discount or rebate when we turn in the old models 🤷🏾‍♀️"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lawrence Hufty",
          "Nb_Reviews": 9,
          "Date": "2023-05-14T16:10:41.000Z",
          "Titre": "I found the Renpho Leg Massager Premium okay to use",
          "Contenu": "I found the Renpho Leg Massager Premium to be helpful, and provided some relief from the old and achy legs. BUT, it is huge and cumbersome. There is no way to disconnect one leg unit if you only require massaging on one leg, which was my issue. In addition, the foot massager is separate, but attached. Again, you cannot disconnect it. I enjoyed to comfort that it gave to my calf muscles, but being as bulky and cumbersome as it was, giving it 4 stars was a stretch."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Hall",
          "Nb_Reviews": 3,
          "Date": "2023-01-08T17:52:40.000Z",
          "Titre": "always a reliable company",
          "Contenu": "Order came as advertised in a reasonabe time. As always, great product.Missing a star only due to communication around delivery. I saw a notice that the order was received and processing; no updates as to when it would be here. Fortunately it came pretty fast and surprised me,"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Fiona Waddell",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T05:00:55.000Z",
          "Titre": "I ve brought a few of the Renpho items…",
          "Contenu": "I ve brought a few of the Renpho items - both mini and R3 Mini guns have be great in producing the same about of power as a competitors which is bigger and heavy & both are quite to use.  Just hoping they last as long (5yrs+).  Both are similiar in weight & Managable handle size.  Have also the digitial scales & work well although having issues with the upgraded app so have reverted back to the first one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dana Orlando",
          "Nb_Reviews": 4,
          "Date": "2023-06-07T22:31:34.000Z",
          "Titre": "I love the products",
          "Contenu": "I love the products; my only complaint is in regard to shipping.  I received one item within 1 week, the other took nearly 1 month.  I would've been fine with that timeframe, but there was no communication.  I was being told that my items had both been delivered after 1 week, which had me very nervous that I would never see the second item, which was also a gift for someone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Schocke",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T01:29:33.000Z",
          "Titre": "I really like the product",
          "Contenu": "I really like the product. I've been using the scale every day for the last three weeks or so. It seems to be pretty accurate, and the connection to the app on my iphone is turning out to be quite useful. Since it does the calculations for BMI and body fat percentage automatically, I can save time and keep track of my progress."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barbara Livers",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T19:50:04.000Z",
          "Titre": "Ordered the cordless jump rope",
          "Contenu": "Ordered the cordless jump rope.  They informed me it would not be ready until late January.   I wanted the item for a Christmas present.  Just informed them I no longer wanted the item.  They credited my credit card acct immediately."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tiffany C.",
          "Nb_Reviews": 3,
          "Date": "2023-04-16T22:44:30.000Z",
          "Titre": "I love this air purifier!",
          "Contenu": "I love this air purifier! My only complaint is the app and connecting the Wi-Fi. It is not easy to connect, and the instructions do not help. I did not end up connecting mine to the app, and it runs manually from the device. I have other Renpho products (smart scale and smart body tape measurer), and I did not have any issues with connecting the bluetooth."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ruth",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T03:25:49.000Z",
          "Titre": "Generally good product",
          "Contenu": "The heating option is good. The vibration function is not good. The air pressure is not strong enough, but okay. The button is sometimes too sensitive that even I laid down one the pillow will change the setting. Overall it’s a good product."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Anggie",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T04:24:04.000Z",
          "Titre": "It’s a great shiatsu massage machine",
          "Contenu": "It’s a great shiatsu massage machine. I have used it on my neck and shoulders as well as my calves. The heating option helps with loosening tight muscles. I have given 4stars because you have to plug the machine when using it. A recommendation to Renpho to create a chargeable shiatsu massage machine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maggie",
          "Nb_Reviews": 2,
          "Date": "2023-01-29T08:45:09.000Z",
          "Titre": "I use the Renpho every night before…",
          "Contenu": "I use the Renpho every night before falling asleep and absolutely love it! I would have given it 5 stars if it wasn't for the noise.  The music does a nice job of covering the noise for the person using it, but not for the person that is trying to sleep next to you.  Also, the buttons are too close together and when I'm changing the programs, I push the wrong button and have to go through the whole series again or sometimes turn it off and back on.  But it really helps relieve the pressure around my eyes and relaxes the muscles.  I fall asleep so much faster and my eyes feel rested when I get up."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Wayne",
          "Nb_Reviews": 7,
          "Date": "2023-07-07T03:27:11.000Z",
          "Titre": "They sent me the wrong item x2 and…",
          "Contenu": "They sent me the wrong item x2 and forgot to send me the 3rd item it took 5 weeks to get only because I emailed them but eventually got everything sorted out. U neck and foot massager are both great products"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T18:24:02.000Z",
          "Titre": "Customer Service",
          "Contenu": "Hello-The eventual service was GREAT but getting there was slow and not so great.  There was a long delay before my concern/issue was addressed via email which made the urgent support/help request rather useless.The \"eventual\" service response was GREAT and you made up for the delay in responding, so I thank you GREATLY.Dave"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sacharissa Coulston",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T00:54:25.000Z",
          "Titre": "Great machine",
          "Contenu": "Great machine, would be great if the air function sat for longer before releasing. The massage is hard but not much difference between low and medium."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Oakley",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T17:28:17.000Z",
          "Titre": "My wife thoroughly enjoys this",
          "Contenu": "My wife thoroughly enjoys this, great gift for Mother’s Day or other occasion. The different areas of massage has been plus for alleviating her back pain."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jacquelyn Haugen",
          "Nb_Reviews": 2,
          "Date": "2023-04-14T05:10:07.000Z",
          "Titre": "I got the foot massager and the foot…",
          "Contenu": "I got the foot massager and the foot and calf massager. So far they are great. The foot massager I wish had an air compression between med and high. High feels like my feel are in a vice (too painful) and medium is not quite enough. The calf massager is wonderful. I use it in the evening before bed to relax my whole lower leg. Battery pack keeps a charge for several days after 40+ min of use each night."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Royal Hale",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T05:05:43.000Z",
          "Titre": "Like the bike",
          "Contenu": "Like the bike. I had contacted the company about the need to silence the sound that you hear everytime some activity occurred i.e. connecting to the app.The only thing I consider a negative is that the machine is a little louder than I thought it would be while pedaling."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Richard",
          "Nb_Reviews": 3,
          "Date": "2023-02-11T09:58:29.000Z",
          "Titre": "All happily sorted in the end.",
          "Contenu": "The product arrived quickly, but unfortunately did not work. After contacting renpho and waiting a while for a reply, they sent out a working replacement unit. Happy now with the product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Goodman J Peter",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T17:06:52.000Z",
          "Titre": "Good customer service and well-made product",
          "Contenu": "After waiting for six weeks, I finally received the jump rope.  Customer Service was quite good and very responsive.  The product is well-made, and I'm excited to start using it!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T20:39:28.000Z",
          "Titre": "Eyeris 1 Massager",
          "Contenu": "Love my Eyeris 1 Massager! Only comments: not sure if it is the heat or the mask being too close, but it dents my eyelashes. And second, it is louder than i expected. still very relaxing :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris H",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T17:26:11.000Z",
          "Titre": "Renpho bluetooth scale and blood pressure monitor.",
          "Contenu": "I have a Renpho bluetooth scale and blood pressure monitor. Both are great! The only problem I have is the bluetooth connection between the blood pressure monitor and the Renpho app. It seems to be a little finicky."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Louise E",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T03:48:27.000Z",
          "Titre": "The massage gun is great but it came…",
          "Contenu": "The massage gun is great but it came without instructions about the numbers. I thought 5 was more intense than 1 but now I've heard it's for fascia but the other is for muscles. Some instructions would be good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janet Vehec",
          "Nb_Reviews": 1,
          "Date": "2023-01-22T19:40:10.000Z",
          "Titre": "Buying the foot massager on line was…easy",
          "Contenu": "Buying the foot massager on line was very easy. I received the shipment very quick. The only problem was I ordered the massager with a remote and I received one to put the fuctions on my phone. I was alittle confued why I received a different one from the one I ordered."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "HURLEY",
          "Nb_Reviews": 2,
          "Date": "2023-01-26T08:36:39.000Z",
          "Titre": "I really enjoy my new foot massage…",
          "Contenu": "I really enjoy my new foot massage unit. I look forward to using it on a daily basis. Shipping time was great and I got a great discount when I ordered. I highly recommend getting one for your own pleasures."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kimberly",
          "Nb_Reviews": 2,
          "Date": "2023-02-11T03:03:52.000Z",
          "Titre": "I enjoy the heat and pressure but I…",
          "Contenu": "I enjoy the heat and pressure but I don't like the vibration mode it's too jerky. Also for the meditation modes the voice is a bit grainy. My eyes feel really good after using it though."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Alex",
          "Nb_Reviews": 3,
          "Date": "2023-05-23T15:04:09.000Z",
          "Titre": "Quality built products but software could be improved a little",
          "Contenu": "I purchased The Scales, Foot massager and Smart bike in one hit with a 10% off coupon. After spending a few hours for a few nights researching smart bikes and foot massagers. I started to narrow my focus onto the Renpho range. I ended up selecting the Renpho Smart bike because of the reviews on its price, quality build and the fact that it has resistance control via its free app with bonus compatibility with other reputable bike apps like zwift. After trying the App and doing a power test I found it to be quite awesome. As mentioned by the reviews, you do need to download some courses which takes time so better to do it well in advance of training on the bike. The app also has had issues connecting to my apple health app. I haven’t yet sorted that out so the way around it for me is to open the Renpho AI Gym app on my Apple Watch which will record my indoor ride with heart rate. Or alternatively use my Apple Watch indoor bike workout.  My wife is in Love with the Shiatsu foot massager. I personally am not into foot massage machines. The scale are good and do the job well.  The software unfortunately doesn’t support my body type which is very athletic. But I’m probably not the target market. I still find much of the stats good even if it does think I’m overweight which is because of my muscle mass. Keep up the great work Renpho And please address issues with frequent updates. Highly recommend the brand based on price, quality and after purchase support. Software isn’t perfect yet but I know they are really trying to make everything work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Woods",
          "Nb_Reviews": 1,
          "Date": "2022-12-29T01:35:55.000Z",
          "Titre": "Good quality air purifier and…",
          "Contenu": "Good quality air purifier and replacement filters, quality packaging and fast shipping. The filters could have a bit thicker density for the carbon layer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karmyn",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T15:29:02.000Z",
          "Titre": "Love the scale",
          "Contenu": "Love the scale, very accurate and I love all the information but the app kicks me out too frequently."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 5,
          "Date": "2023-01-22T20:11:46.000Z",
          "Titre": "Product quality is very good",
          "Contenu": "Product quality is very good. Shipping is fast. I have several different products. Finding the right filter is a little tricky."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AXEL ANTONGIORGI",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T14:26:37.000Z",
          "Titre": "Almost perfect!!",
          "Contenu": "Purchased the Foot Massager.  Really good massage pressure for the bottom of the feet.  The air helps to wrap your feet with some pressure.  It would be nice to massage the sides of the feet as well.  Other than that a great product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 2,
          "Date": "2023-06-12T07:13:55.000Z",
          "Titre": "When I adjusted the height to match my…",
          "Contenu": "When I adjusted the height to match my height, it functioned great on my back and pretty well on my neck and shoulders."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "WEUJR",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T08:00:35.000Z",
          "Titre": "The heat and massage action is good…",
          "Contenu": "The heat and massage action is good though the heavy massage is too hard on the eyes.  The vibration is more or less a joke in that it is not a vibration but a thumping action that is somewhat irritating to me.  I find the lighter massage combined with heat is awesome for relieving a tension/migraine headache and calming sinus pressure.  Would I purchase the Renpho again, definitely?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marisa",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T18:10:56.000Z",
          "Titre": "Calms me down before bed and makes me…",
          "Contenu": "Calms me down before bed and makes me fall asleep like that! Customer Service was awesome as well."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Bhesh",
          "Nb_Reviews": 2,
          "Date": "2022-12-12T01:11:39.000Z",
          "Titre": "Great Product",
          "Contenu": "Product is amazing came quicker then expected. Massages the back and neck pretty well. Satisfied with the purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Smilie",
          "Nb_Reviews": 2,
          "Date": "2022-11-11T21:46:11.000Z",
          "Titre": "Works great, helpful for migraines",
          "Contenu": "I have had another eye massager for a long time. The charge port finally broke. I decided to try this one for less than half the price. Pretty much does the exact same thing. The power button is very sensitive and easy to turn off when adjusting. I would prefer that the music not play right away when turning it on. I would rather just pick if I want that because of migraines. I can't stand the noise, and I cant put it on my eyes because it's too painful. I just wear it right above for the air pressure massage only.  Other than that it is great. I will probably order one for my brother who has severe MS. His medications gives him migraines. Very useful and helpful for headaches and migraines"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Mark",
          "Nb_Reviews": 4,
          "Date": "2023-02-10T03:06:56.000Z",
          "Titre": "ON TIME DELIVERY",
          "Contenu": "DESPITE ISSUES WITH WEB RE APPLYING DISCOUNTS AUTOMATICALY VIA CODE THEY HONOURED PER WEB OFFER. DELIVERY AS STATED."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Lorraine",
          "Nb_Reviews": 14,
          "Date": "2022-11-25T12:17:50.000Z",
          "Titre": "Bought this for my husband and he said…",
          "Contenu": "Bought this for my husband and he said it is really great and uses it every day"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Emad Amsi",
          "Nb_Reviews": 2,
          "Date": "2023-08-01T14:14:03.000Z",
          "Titre": "It is fantastic for the neck stiffness…",
          "Contenu": "It is fantastic for the neck stiffness and relief it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Shiery",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T03:28:45.000Z",
          "Titre": "Satisfied customer",
          "Contenu": "Renpho stepped up and corrected the problem, thank you for doing that"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Craig Leckie",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T07:18:34.000Z",
          "Titre": "Fast & accurate delivery",
          "Contenu": "Fast & accurate delivery, product is what was expected from website descriptions, product itself does what I want"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Green",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T00:30:35.000Z",
          "Titre": "It a great machine works on pulsating…",
          "Contenu": "It a great machine works on pulsating pressure I’m happy with it but would be better if you could seperate left from right leg because I only use right leg"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julia Patterson",
          "Nb_Reviews": 1,
          "Date": "2023-01-22T17:11:47.000Z",
          "Titre": "Love the machine it is quiet. I sleep with 3 dogs. It takes care of the dog smell and pet dander.",
          "Contenu": "Love the machine. I use it in my bedroom. I sleep with 3 dogs. It does a good job getting rid of pet smell and dander. It is quiet. I would like to be able to adjust the light on it at night. I like a super dark room."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karl Taubinger",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T01:02:33.000Z",
          "Titre": "Worked as expected",
          "Contenu": "Would have given it 5 stars if it stored the setting level between uses"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sylvia ONeal",
          "Nb_Reviews": 2,
          "Date": "2023-06-28T03:31:41.000Z",
          "Titre": "Birthday present",
          "Contenu": "It got here really quick. My girlfriend loves it. I gave her the massager for her Birthday."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anna",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T20:47:20.000Z",
          "Titre": "wowee",
          "Contenu": "wow! my partner is so in love with renpho its wild it helps him sleep as well"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Elmar  Ramos",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T23:01:07.000Z",
          "Titre": "So far so good but will be better of…",
          "Contenu": "So far so good but will be better if the balls has a little bit more of circular motion in bottom part and had something also in the bottom part rather than just vibration."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CLAYTON TURNER",
          "Nb_Reviews": 2,
          "Date": "2022-10-23T21:14:52.000Z",
          "Titre": "I'm happy  with  the  back heating pad…",
          "Contenu": "I'm happy  with  the  back heating pad , in the morning I'm  very stiff from sleeping and I use it to warm up my back to get the blood flowing better and get better movement, and use it throughout the day..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary Lawrence",
          "Nb_Reviews": 2,
          "Date": "2022-10-06T20:45:15.000Z",
          "Titre": "The scale came in a very timely manner",
          "Contenu": "The scale came in a very timely manner. What I am very disappointed about is the old Renpho app & battery operated scale synced after getting off scale & later in the day. Now I have to be on the scale to record it in the app. That stinks. I called & was told that the solar scale & app have no Wi-Fi."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Liza Alcala",
          "Nb_Reviews": 1,
          "Date": "2022-10-15T19:17:30.000Z",
          "Titre": "Wonderful products!",
          "Contenu": "The only thing I have to say is that I did not get an email stating that it was back ordered due to high demand. And took a while to receive the products. The products are very easy to set up and use. Very happy with the products."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Bernadette Foley",
          "Nb_Reviews": 2,
          "Date": "2022-10-31T23:27:59.000Z",
          "Titre": "New scales",
          "Contenu": "I had to buy a new scale because my husband dropped them and the smashed  I had to put the new set on and was given good help to put them on the old ones"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ray",
          "Nb_Reviews": 1,
          "Date": "2022-10-09T21:56:07.000Z",
          "Titre": "Straight forward",
          "Contenu": "It was pretty much straight forward.  I ordered the hand held massager and very quickly, it arrived at my door.   It is a very nice massager, the only complaint I have with it is the power button, seems to be hard turning on."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CLAYTON TURNER",
          "Nb_Reviews": 2,
          "Date": "2022-09-29T22:48:43.000Z",
          "Titre": "neck  massager",
          "Contenu": "neck massager  works great  for  taking  away a migraine  instead of  hours it's  now only 30-40 minutes till it's  gone . just wish time was longer than 10mins constantly  have to  restart it. otherwise  works great...THANKS"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "JSI",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T23:34:05.000Z",
          "Titre": "Great product at reasonable price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lina Purcell",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T23:00:06.000Z",
          "Titre": "good",
          "Contenu": "Very good, responsable and reliable company. I purchased their scale, their kitchen scale and their tape measure and have no complaints about those. The app is reliable as well and very user friendly. Their Renpho Health app though does not work as far as syncing data and could never got it to update nutrition from the kitchen scale"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Naomi M",
          "Nb_Reviews": 1,
          "Date": "2022-09-26T04:22:41.000Z",
          "Titre": "I love the Renpho foot massager",
          "Contenu": "I love the Renpho foot massager, works a treat & easy to use.  I also got the Renpho Oral irrigator, it has taken a bit to get used to & work out best way to hold it for best 'floss'."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Kien Ly",
          "Nb_Reviews": 3,
          "Date": "2022-08-24T01:08:50.000Z",
          "Titre": "Renpho massage gun and body scale",
          "Contenu": "Good product very satisfied just the current model wasnt my expectation I thought I was getting pressured massage gun instead of turn on turn off switch gun but all in all battery is amazing haven't  charged again I bought it love the body scale"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "IF",
          "Nb_Reviews": 2,
          "Date": "2022-08-21T15:35:04.000Z",
          "Titre": "Was having difficulty syncing from…",
          "Contenu": "Was having difficulty syncing from current to new Renpho app. Tech had to do it on their end.I don't care much for the new app. Since it does not sync automatically from the old to new, I find myself referring to the old app."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Patricia Coles",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T04:13:04.000Z",
          "Titre": "Very efficient quick delivery time"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "kathie healy",
          "Nb_Reviews": 3,
          "Date": "2022-05-21T08:00:55.000Z",
          "Titre": "Measuring tape",
          "Contenu": "I love your scale and being able to recharge by cable, but wish it could be read by lose it app or Fitbit app. So bought the measuring tape and it took days to hookup to Bluetooth. It was difficult to get right measurements as the tape rewinder was hit or miss. I like that it posts results on renpho app, but that needs work editing input. It’s hard when you have cataracts to read the display"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Denise  Joseph",
          "Nb_Reviews": 2,
          "Date": "2022-09-02T01:49:00.000Z",
          "Titre": "Fantastic App and tracking",
          "Contenu": "Fantastic App and tracking. The weight readings were little different than measurements on Wythings scale and another scales that I use. But, I love the design and the extensive measurement features."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Fiona",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T02:52:25.000Z",
          "Titre": "Speedy delivery,great product"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "PRATIK",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T00:06:29.000Z",
          "Titre": "The product seems very strong for me…",
          "Contenu": "The product seems very strong for me even in diy and soft mode, idk about other people, but delivery in time product is solid. People who has bought another device and feel its not powerful enough can go for this one."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Richard, Perth",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T23:58:55.000Z",
          "Titre": "Just got the eye massager",
          "Contenu": "Just got the eye massager. I would switch reduce the heat intensity and increase the massager. After 3-4 mins the heat is a bit too much switch to massage without heat. Overall the massager helps my tired eyes after  long day on the computer and reading documents. It helps. Richard"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Paul Maskell",
          "Nb_Reviews": 2,
          "Date": "2022-04-23T01:48:20.307Z",
          "Titre": "Scales!",
          "Contenu": "I bought the bathroom scale, kitchen scale and tape measure.The scales are really good and help track weight etc and great to have a record on the phone.The tape measure is harder to use and a bit fiddly getting the clip in soI don't use it as much.The kitchen scales work well and also good way to keep track of foodquantities."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andy Massik",
          "Nb_Reviews": 2,
          "Date": "2022-04-28T18:22:04.366Z",
          "Titre": "Scale was more difficult to set up than…",
          "Contenu": "Scale was more difficult to set up than expected. App should have been available through a QR code or a link. I downloaded wrong app and wasted time.Once scale was set up - it does not communicate with my Lose It app - which I would like it to do.The info available on scale is helpful - which is why I gave it 4 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Gunnoe",
          "Nb_Reviews": 3,
          "Date": "2022-04-04T12:36:19.000Z",
          "Titre": "Bought the large unit for a 200 sq",
          "Contenu": "Bought the large unit for a 200 sq. ft. sunroom because I wanted to be certain the unit would remove cigar smoke. I used the unit while smoking and, afterwards, I left it running for a few hours to continue to filter the air. When I next used the sunroom the odor of smoke was present so I opened the windows for a couple of hours and the odor dissipated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Smith",
          "Nb_Reviews": 7,
          "Date": "2022-05-11T19:10:31.000Z",
          "Titre": "Tons of traceable data!",
          "Contenu": "We are very happy with our new scale so far. It seems very accurate and provides lots of data that we are able to track and compare easily. We purchased the upgrade with the understanding that it would link to the app without the app being open on our phone while on the scale. This is not true."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Leanne S",
          "Nb_Reviews": 1,
          "Date": "2022-08-01T23:29:24.000Z",
          "Titre": "Love it!",
          "Contenu": "Relaxing foot massager which gives relief for my foot pain. Good pressure and kneading ability.Only negative is that I was charged an international fee transaction when I thought Renpho was an Australian company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Willie Collins",
          "Nb_Reviews": 1,
          "Date": "2022-03-26T01:40:42.000Z",
          "Titre": "Air cleaner",
          "Contenu": "I assume that this air cleaner is working since the filter is catching a great deal of dust, etc. But I still notice accumulation of dust on surfaces after routine cleaning. It does clear odors effectively. I need replacement filters, and I had to wait for a period until they were back in stock. Overall, I am happy with the product."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Anna",
          "Nb_Reviews": 1,
          "Date": "2022-03-15T21:36:56.000Z",
          "Titre": "Great little massage gun",
          "Contenu": "Great little massage gun, plenty of choices of appropriate head type for muscle group. Would only say it could be less powerful on the lowest power mode for when you feel like something more gentle - makes your whole head vibrate when you get stuck into the shoulders!"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "John Mills",
          "Nb_Reviews": 2,
          "Date": "2021-12-06T00:50:20.000Z",
          "Titre": "Good product and good support",
          "Contenu": "I ordered a smart digital tape measure from the Australian store, to be shipped to New Zealand. Initially, there was some problem with my order and the order appeared to have never shipped. When I contacted Renpho support, the matter was dealt with promptly and I received my purchase a few days later.I’m very happy with the device and would recommend it. My experience contacting support was also good.If the order had shipped without issue and was reflected in the order status, I would have given it a 5 star."
        },
        {
          "Note": 4,
          "Lieu": "JM",
          "Pseudo": "Celia Witter",
          "Nb_Reviews": 1,
          "Date": "2021-11-23T00:01:03.000Z",
          "Titre": "I really like the air purifier but what…",
          "Contenu": "I really like the air purifier but what i didnt like is that when the air quality changes by just me moving around in the bed, the lights change colors and the fan comes on loudly.  This wakes me up so i prefer to use the purifier during the day time and not at nights.Otherwise, it does a good job."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Lucy",
          "Nb_Reviews": 24,
          "Date": "2021-05-16T09:54:10.000Z",
          "Titre": "Bluetooth scales are awesome despite the cheap price!",
          "Contenu": "Bluetooth scales are awesome! I bought these thinking they were too cheap to be any good but they are absolutely awesome. The app works well and the read outs are consistent (so I assume they’re accurate). Much easier than having to manually input weight into a third-party app. I have the measuring tape too, and it’s a genius invention. The screen is faulty but the app captures the measurements just fine so no need to return it just for it to end up in landfill if it technically works!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Brooker",
          "Nb_Reviews": 2,
          "Date": "2022-08-28T17:24:58.000Z",
          "Titre": "Great Product",
          "Contenu": "I love the measuring tape. My reson for 4 stars and not 5, is that it's difficult to lock and unlock the tape before retracting for measuring."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Howe",
          "Nb_Reviews": 1,
          "Date": "2022-03-25T14:25:48.000Z",
          "Titre": "I was very pleased with the overall…",
          "Contenu": "I was very pleased with the overall service and quality of the product.   The only complaint is that my initial delivery time was two days ( which was probably unrealistic) but it arrived in six or seven days."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "David Jones",
          "Nb_Reviews": 3,
          "Date": "2022-09-28T01:15:17.000Z",
          "Titre": "The massager works well a bit heavy to…",
          "Contenu": "The massager works well a bit heavy to hold one handed needs another handel at top to assist when working on back"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anita Alston",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T05:50:52.000Z",
          "Titre": "Items were as advertised.",
          "Contenu": "Items were as advertised. Customer service was excellent. Seemed concerned with my questions. I am very satisfied."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Humberto Daniel Vazquez Blanca",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T17:14:40.000Z",
          "Titre": "The item arrived was incorrect",
          "Contenu": "The item arrived was incorrect, the replacement was lost on the way, the support was good and helped to get a solution."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Olive wade",
          "Nb_Reviews": 23,
          "Date": "2022-08-15T07:48:24.000Z",
          "Titre": "Good product",
          "Contenu": "Good product, easy to use website, fast delivery.Haven't noticed any difference in my feet as yet,, but I haven't been using it long"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "S S",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T22:19:08.000Z",
          "Titre": "Nice functions and effctive"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "David Fowler",
          "Nb_Reviews": 2,
          "Date": "2022-08-25T04:17:35.000Z",
          "Titre": "I would have given 5 stars but …….",
          "Contenu": "I would have given 5 stars but there is no booklet for a manual. I hate having to go online to find out how something is operated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Constance Z",
          "Nb_Reviews": 1,
          "Date": "2021-11-09T22:55:29.000Z",
          "Titre": "We love the foot massager but when we…",
          "Contenu": "We love the foot massager but when we got it there were no instructions. We had to go to the internet to find out how to operate it. Even then we had questions that weren't answered. That's why 4 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nicola Ericson",
          "Nb_Reviews": 1,
          "Date": "2022-02-23T21:11:07.000Z",
          "Titre": "The scale is good!",
          "Contenu": "The scale is good!The measuring tape the screen looks like an etch a sketch, fortunately it still send info to my phone or it would be useless.  Disappointed that it does not work properly."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Dan Salem",
          "Nb_Reviews": 2,
          "Date": "2023-06-06T00:29:10.000Z",
          "Titre": "Pretty good machine.",
          "Contenu": "Pretty good machine.Very strong  & easy to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Muriel Collie",
          "Nb_Reviews": 5,
          "Date": "2022-04-28T01:07:59.930Z",
          "Titre": "Very satisfied with product",
          "Contenu": "Very satisfied with product.  Neck massage feature is great.  Only negative comment: instructions re massage intensity levels could be clearer.Would recommend product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "norma Smith",
          "Nb_Reviews": 2,
          "Date": "2021-12-08T15:18:22.000Z",
          "Titre": "product as described",
          "Contenu": "Product was shipped in a timely matter.  I'm a bit undecided if this product is what I anticipated it would be.  It works well but is hard to put on and very bulky to store between uses."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Val B",
          "Nb_Reviews": 3,
          "Date": "2022-06-15T16:52:14.000Z",
          "Titre": "Since I found this product too harsh…",
          "Contenu": "Since I found this product too harsh for my neck and shoulders, and needed to return it, I strongly suggest you read the Return Policy before ordering,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GARY FREEMAN",
          "Nb_Reviews": 5,
          "Date": "2022-04-08T19:29:59.000Z",
          "Titre": "Honestly I am dissatisfied with this…",
          "Contenu": "Honestly I am dissatisfied with this unit because it is so uncomfortable on my nose. it needs significantly better shape, padding to use this. Please send suggestions"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leah Rohwer",
          "Nb_Reviews": 2,
          "Date": "2022-10-06T05:11:08.000Z",
          "Titre": "Love my machine",
          "Contenu": "Love my machine! But have yet to feel any heat! That’s why the four star and not a five!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lori Herndon",
          "Nb_Reviews": 3,
          "Date": "2021-12-30T17:47:48.000Z",
          "Titre": "Great Product",
          "Contenu": "The tape measure is exactly what I was looking for. The app that goes along with it is very helpful. I recommend this product to all who may be needing a tape measure.Thanks Renpho!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Caroline Roberts",
          "Nb_Reviews": 4,
          "Date": "2022-03-07T01:24:39.000Z",
          "Titre": "Service is okay although scales were…",
          "Contenu": "Service is okay although scales were sent in their box without any padding to protect from postage handling. My scale is very sometimish and the accuracy is questionable"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Tori",
          "Nb_Reviews": 3,
          "Date": "2022-05-09T14:24:55.000Z",
          "Titre": "Scales work well, app seems wrong",
          "Contenu": "Scales are good, shipping took way too long. I’m not sure how accurate the app is, how can I be severely overweight if my bmi is in healthy range? Confusing"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Leo Mancini",
          "Nb_Reviews": 2,
          "Date": "2022-07-05T23:27:05.000Z",
          "Titre": "Had purchased this product for my…",
          "Contenu": "Had purchased this product for my mother whom had very poor leg circulation. She has noticed significant improvement.Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Norma Jennings",
          "Nb_Reviews": 1,
          "Date": "2022-02-20T19:51:31.000Z",
          "Titre": "Had a gastric sleeve done a couple…",
          "Contenu": "Had a gastric sleeve done a couple weeks ago. This product has helped keep me informed about the ups and downs in the weight/inch loss process. Love it!!!"
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Rickey Walter",
          "Nb_Reviews": 4,
          "Date": "2023-11-30T13:25:29.000Z",
          "Titre": "Lightweight",
          "Contenu": "Lightweight, easy to use, and effective. After a long day at the computer, it simply save you from stress and fatigue. A variety of massage modes and heat functions make it the ideal relaxation companion. Definitely recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Suzanne Wileur",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T06:59:04.000Z",
          "Titre": "Everything was just what I wanted and…",
          "Contenu": "Everything was just what I wanted and pretty much the same as the two heating pads I had before they quit.  Hope these last longer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 3,
          "Date": "2023-11-03T01:19:47.000Z",
          "Titre": "Easy to use eye massager",
          "Contenu": "This electronic eye massager is very useful and convenient. No more pulling a chilled eye mask from the freezer or popping one in the microwave to heat it up.  This eye massager can be used anywhere and is useful for travel."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Cuong Mai",
          "Nb_Reviews": 4,
          "Date": "2023-06-24T02:37:30.000Z",
          "Titre": "Powerful little massager with excellent performance",
          "Contenu": "Powerful little massager with excellent performance that has a decent running time (2-3 hours). Despite its mini size, this baby can handle the pressure load of deep tissue massages. It got 5 speed level and comes with different attachment heads."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Sears",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T07:07:49.000Z",
          "Titre": "Great Product!!!",
          "Contenu": "I lost my first body scale in a move and tried to continue my fitness journey without it. All the information that I got from the scale help me focus on different gains and change my diet so that it will better help me towards my goal. After buying a new rechargeable Elis 1+ Smart Body Scale I'm more confident that I'll met my fitness goals."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Perez",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T11:33:15.000Z",
          "Titre": "This little guy is amazing",
          "Contenu": "This little guy is amazing. Sleek small design. Insane battery life for it's size. Keep it in my backpack for my RLS. The included changeable head selections is on point. It has surpassed my expectations for it's size and portability. Quality travel case too. Great product. Go Renpho!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 2,
          "Date": "2023-06-30T15:21:23.000Z",
          "Titre": "It’s quiet and extremely effective",
          "Contenu": "It’s quiet and extremely effective! I watched AQ climb quickly when I opened my front door for only 10 minutes during this poor AQ alert. I shut the door and this purifier did it’s job efficiently!  Renpho thank you for yet another amazing product."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Sandy",
          "Nb_Reviews": 2,
          "Date": "2023-05-17T01:22:01.000Z",
          "Titre": "The best buy for sore shoulder and neck",
          "Contenu": "Bought the shoulder and neck massager as a gift to partner. It’s very practical and works like a dream particularly for people who sit all day staring at a computer. You hold the straps down to add or release additional pressure and it’s great."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Carl Hodson",
          "Nb_Reviews": 14,
          "Date": "2023-03-27T06:25:08.000Z",
          "Titre": "Prompt Replacement",
          "Contenu": "Purchased a Renpho Shiatsu Foot Massager Pro+ direct from the company on-line. The control panel did not work.Renpho replaced the item within a week, but there were some odd requests:1. Submit a video displaying the fault.2. Submit a photograph of the power adaptor. I did this, but questioned why as the adaptor came with the unit.3. Reach inside the unit and press the buttons from the inside??? This I didn't do explaining that I didn't want to damage any circuitry and wanted a unit that worked as intended.4. A further email was received requesting the serial number of the defective unit.Once the above was done Renpho sent me a replacement, stating that there was no requirement to return the defective item.The replacement was delivered by Amazon interestingly enough."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn Barnes",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T17:02:51.000Z",
          "Titre": "Very Accurate Weight",
          "Contenu": "I found Renpho to be very accurate.  I weigh myself before going to the doctor's office and am usually spot on with my weight.  I have been using Renpho for many years now and have absolutely no complaints.  I enjoy using it with my Fitbit and cell phone with ease."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy Ragsdale",
          "Nb_Reviews": 3,
          "Date": "2023-07-07T01:46:18.000Z",
          "Titre": "Renphor Eyeris is so soothing",
          "Contenu": "Renphor Eyeris work so great. My eyes suffer all year with allergies and always seem tired. I find the Eyeris soothing. I chose Renphor because I was so pleased with the scale I purchased in April. Quality products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terri Milliken",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T00:23:48.000Z",
          "Titre": "Convenient",
          "Contenu": "Convenient, easy and a good product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shauna T.",
          "Nb_Reviews": 5,
          "Date": "2023-05-25T21:04:03.000Z",
          "Titre": "Innovative, helpful, well made, easy to use products",
          "Contenu": "Products are well made, innovative, and helpful. Instructions are clear. Shipping is a normal period of time. My especial favorite that I use every night, is the Sleep Mask with Speakers in it. Buttons are easily accessible and simple to understand. I love that I can connect to my phone via Bluetooth so I can listen to my Audible while sleeping. My only Con, is the Velcro to secure behind your head, it sometimes pops open while I'm trying to put it on. But that's a small price to pay for something so awesome. I also love their Sleep Mask that provides heat and massage. Very helpful with headaches or just to calm down and de-stress. Thanks Renpho, keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rose Lampert",
          "Nb_Reviews": 4,
          "Date": "2023-03-01T19:36:31.000Z",
          "Titre": "Great Product high quality",
          "Contenu": "Great Product high quality, exactly what I need for my dry eye. I started using and love how the eyes few after using it.  There is different settings on the temperature, vibration and pressure.  This an amazing product and I think its an ingenious invention."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 3,
          "Date": "2023-05-09T16:49:41.000Z",
          "Titre": "I love this scale!",
          "Contenu": "We received this in no time after ordering.  I love all the information it provides (although it can be a bit judgmental!)  Pairing with the app was super easy. One thing I would change is the fact that everyone's info downloads to my app and I have to distribute it to the other users.  Otherwise, I would definitely buy recommend this scale!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Becky",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T11:30:52.000Z",
          "Titre": "Bathroom scales",
          "Contenu": "I bought two bathroom scales, I sent one to my sister whom lives in Alabama, when she had to be weighed in at her Doctors appointment this scales and the doctors scale weighed her the same. I also who lives in Kentucky had the same experience at my Doctors appointment the scales weighed the same."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Krystal",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T03:59:31.000Z",
          "Titre": "Renpho Massage gun and…",
          "Contenu": "We Bought Renpho Massage gun and initially it did not work, but customer service person Sami was great at sorting the problem and provided a quick solution within 7days and by sent out a replacement product. Massage Gun works great and as expected, very happy with the product and service"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "miki D",
          "Nb_Reviews": 5,
          "Date": "2023-06-16T05:34:03.000Z",
          "Titre": "Mini Massage Gun",
          "Contenu": "The size of the mini massage gun fits perfectly into my hand, the blue-silver colour is calming, and the range of attachments will cover any possible area of tension.Thank You!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Marc",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T02:41:09.000Z",
          "Titre": "Great neck and shoulder massage",
          "Contenu": "We previously bought a Renpho massage gun and found it well made and effective. We found it a little too aggressive for neck and shoulders so opted to buy a Shiatsu massager. It too was well made and very effective. Can't believe how effective the massager is.Very happy with both purchases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MaryAnn Camacho",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T21:23:31.000Z",
          "Titre": "Beautiful packaging with a sleek…",
          "Contenu": "Beautiful packaging with a sleek design. Was concerned about glass being slippery but it is not. It worked right out of the box!  App sync was easy, although the instructions in the box referenced an outdated app."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Amanda  Princi",
          "Nb_Reviews": 2,
          "Date": "2023-02-20T06:11:00.000Z",
          "Titre": "Great foot massage",
          "Contenu": "Great foot massage, my husband uses it every night. I have purchased another renpho foot massager for my in laws as They love it also and have been using mine. Really good pressure and foot warming great machine love it. Nice fast delivery also"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ASM",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T02:03:44.000Z",
          "Titre": "Consumers Do Matter",
          "Contenu": "Prompt attention to shipping.  The follow up customer support shows genuine interest in me as a consumer for satisfaction of product.  Good Value for item purchased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LINDA",
          "Nb_Reviews": 2,
          "Date": "2023-06-21T03:36:32.000Z",
          "Titre": "Searching for a product on the website",
          "Contenu": "Searching for a product on the website was very easy and informative.  I purchased for a gift which has not been given to the recipient yet so I can't rate the product itself for very user friendly website (did not have to reach out to customer service)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Curt Roberts",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T22:23:47.000Z",
          "Titre": "I researched a dozen different air…",
          "Contenu": "I researched a dozen different air purifiers, and found this to be the best product and at an amazing price.I purchased 4 for my home, then turned around and purchased two for my brother and two for my Dad!!!  THEN my uncle purchased three units at my urging!I even had a problem with one of the units, and after a couple weeks of testing, Renpho sent me a brand new unit!  The problem was with a sensor and not the filtration itself.I can always do business with a company that will stand behind their product and deliver on their word. This filtration unit has made a huge difference in my congestion that I used to wake up with each morning.   Also, I am not aggressively clearing my throat as I used to do, almost habitually!  I have much fewer occurances of stuffy nose because the air and crap is filtered over and over again!I really enjoy my Filter unit!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rosanna  Esposito",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T22:16:43.000Z",
          "Titre": "Great customer service",
          "Contenu": "I was going to return the product because my mom wasn't going to use it. Instead of the returning it, the company gave me 45% refund and got to keep the product. Thank you for great customer service. I was pleased and satisfied."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "L. Lipari",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T05:54:24.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service, delivery on time and wow the mini gun massager works very well so so great. Thats why all my workmates ask me to place order for them. They really like this massager. I recommend this cute and powerful massager. Very helpful and pain away. And wait More orders to come."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Vittoria",
          "Nb_Reviews": 3,
          "Date": "2023-07-01T01:20:42.000Z",
          "Titre": "Work from home - feet massaged amazing!!",
          "Contenu": "I love it! I also work from home a couple of times a week and I place this under my desk and have my feet massaged while I work! I have already recommended this product to a couple of friends a d one of them received it yesterday. She messaged me to say it was amazing! Happy to promote a great product and a local business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sallie",
          "Nb_Reviews": 3,
          "Date": "2023-05-22T10:30:03.000Z",
          "Titre": "The scale and tape measure are a game changer.",
          "Contenu": "I bought the bath scale a couple years ago and love it. The body reading composition is right on target. I compared the readings to the large scale at the gym and it's exactly the same. The tape measure is a game changer. It's so hard to do my measurements by myself. It is easy to use and love that it records my measurements."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Collins",
          "Nb_Reviews": 2,
          "Date": "2023-05-04T18:09:20.000Z",
          "Titre": "I NEVER HAD SEEN ONE OF THESE MASSAGE…",
          "Contenu": "I NEVER HAD SEEN ONE OF THESE MASSAGE TOOLS UNTIL MY CHIROPRACTER USED ONE ON ME! HE SAID HE HAD HIS OWN PERSONAL ONE AND SO DID THE OTHER CHIROPRACTER IN THE OFFICE! IT SEEMS TO WORK WELL BUT YOU MUST REMEMBER I HAVE NOT HAD IT LONG!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Kim Forsyth",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T22:49:09.000Z",
          "Titre": "Massage gun",
          "Contenu": "Massage gun was easy to order and arrived promptly thanks Am finding the gun very helpful with my arthritis in my legs back and arms My chiropractor recommended this product for me"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Robb",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T00:07:29.000Z",
          "Titre": "The product itself",
          "Contenu": "The product itself, is amazing. It does everything a massage gun needs to do. I personally think 6 Speeds is all you need. (Training in the gym 5 days a week and playing AFL on the weekends)The service was second to none, the product was delivered to my front door the next day. (To a country town) Outstanding service.Would highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "John Richardson",
          "Nb_Reviews": 2,
          "Date": "2023-05-27T03:45:33.000Z",
          "Titre": "My first order",
          "Contenu": "My first order, seem to have gotten lost in transit, so when I called them up, they offered to send another one through no extra charge."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara Rochester",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T17:56:08.000Z",
          "Titre": "The experience my love for my Renpho massager    with your company was…",
          "Contenu": "The experience with your company was great, I had an a problem and it was handled.I love my massager, I am a hairstylist and my back and feet need the massage, it is a must to have this valuable tool."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah Rohlfs",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T16:38:24.000Z",
          "Titre": "I love my air purifier",
          "Contenu": "I love my air purifier. It works great. I just ordered replacement filters. The prices were reasonable and the service was great. They came right away. I would recommend Renpho air purifiers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Viapiana",
          "Nb_Reviews": 6,
          "Date": "2023-04-07T04:16:06.000Z",
          "Titre": "I would like to amend my earlier review…",
          "Contenu": "I would like to amend my earlier review of Renpho. There was a small problem but Renpho's Customer Service took care of the problem in a timely manner. I am completely satisfied with the product and the service. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RACHEL DOBBS",
          "Nb_Reviews": 3,
          "Date": "2023-06-02T19:15:27.000Z",
          "Titre": "I love my Renpho smart scale",
          "Contenu": "I love my Renpho smart scale. I had one for many years  (that I \"borrowed) from my husband and it finally stopped working properly so I bought a new one in white and love it.I love checking all my health stats and that it's connected to my Apple products via the app.I like the former app better though. Since they made the new app, I'm not as satisfied. The old one was better so I kept it and actually keep data on both of them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 6,
          "Date": "2023-04-03T17:07:15.000Z",
          "Titre": "I have enjoyed your products",
          "Contenu": "I have enjoyed your products, especially the eye spa pods. I had a problem with one of the pods I ordered, and customer service was able to easily replace it for me.  They were professional and friendly throughout the process."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Dee Carter",
          "Nb_Reviews": 3,
          "Date": "2023-05-17T04:05:12.000Z",
          "Titre": "This set of scales just adds to my…",
          "Contenu": "This set of scales just adds to my renpho family, I find then easy to use, also being on a diabetic eating regime helps measure exactly what I need."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Elizabeth Campbell",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T01:23:25.000Z",
          "Titre": "Great product",
          "Contenu": "Renpho Active Massager works well on tight sore muscles. Would definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara Figlewicz",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T00:44:57.000Z",
          "Titre": "Nirvana for Your Eyes and Mind",
          "Contenu": "I received the Renpho eye-massager for this past Christmas from my husband, a great guy who is always at a loss as to what to buy for me that might be a surprise. One early December Sunday, we were watching the CBS morning show that included a review by David Pogue of cool, new  \"techno\" gifts. As I oohed and aahed through the segment, my hubby was taking mental notes, and actually surprised me with a few of the reviewed products - one being the Renpho Eye Massager. Oh my goodness! I had no idea what the box contained, but my husband instructed me to just open up the headset and put it over my eyes. At once, the soft pads went to work, massaging pressure points around my eyes and temples while soothing sounds (which may be turned off) piped through the unit. It was absolutely heavenly! Stress, headaches, and tight muscles melt away while you're under the relaxing spell of the massager.After I finished my minutes of Nirvana, I took off the headset and passed it around so my family members could try it out. They loved it so much that our adult daughter ordered her own set after she returned home, and I went on to purchase another set as a gift. I highly recommend the Renpho Eye Massager. It's a perfect gift and a welcomed antidote for the over-worked and media-weary friends in your life. : )"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liz",
          "Nb_Reviews": 3,
          "Date": "2023-05-24T16:29:07.000Z",
          "Titre": "All around good experience",
          "Contenu": "Customer service chat answered all my questions prior to my purchase.  My items came quickly.  I love everything I bought, would highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mindy",
          "Nb_Reviews": 2,
          "Date": "2023-05-25T15:21:02.000Z",
          "Titre": "Perfect Mothers Day Gift",
          "Contenu": "I gave these little gems as Mother’s Day gifts this year. I purchased 5 in all They were a HUGE HIT! Everyone loved them! I personally use mine daily and can’t imagine not having it by my bedside"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcela MOLINA",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T06:42:03.000Z",
          "Titre": "Awesome products",
          "Contenu": "Very impress with the ordering process it was quick and the whole experience was smooth.  The foot massager was great and loved it makes my feet feel awesome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Troy Aldridge",
          "Nb_Reviews": 2,
          "Date": "2023-06-23T02:36:58.000Z",
          "Titre": "Massager works good",
          "Contenu": "Massager works good.  I had a problem with the first one that came and Renpho had great customer service resolving the issue quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Schmigel",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T17:14:47.000Z",
          "Titre": "One arrived before",
          "Contenu": "Of the two purchases I made, one arrived before the promised date and the other was right on time and both were well packaged. I couldn't ask for more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ellen Samuel",
          "Nb_Reviews": 2,
          "Date": "2023-05-15T22:33:38.000Z",
          "Titre": "Very easy to navigate the website to…",
          "Contenu": "Very easy to navigate the website to find what I wanted. Shipping was fast. Packaging helped make sure the product was not damaged during shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elliot",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T01:30:14.000Z",
          "Titre": "The instrument works fine and I like…",
          "Contenu": "The instrument works fine and I like the ability to add BP and notes. Very easy to operate.I wish it came with a bit more details on how to interpret the results"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Franz",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T14:50:11.000Z",
          "Titre": "I’m very satisfied with my purchase!",
          "Contenu": "From the first day this body weight scale has done everything I need!  It gives a ton of information and updates it to my ihealth app automatically."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Saranga Fernando",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T13:17:29.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service, I ordered the Security alarm battery and deliver it on next day, only 24 hours. Well done team !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "VICKY",
          "Nb_Reviews": 10,
          "Date": "2023-03-31T00:04:49.000Z",
          "Titre": "Had to have one myself",
          "Contenu": "I had tried the product at a friend's house and was impressed with how good it made my feet feel and how it relieved the pain in feet and helped with pain in my legs and my walking. I knew I had to have one for myself.  Ordered it right then and there so I knew I was getting the same thing from the same company. I use it every day now that I have my own."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy Rasmussen",
          "Nb_Reviews": 4,
          "Date": "2023-06-11T21:01:12.000Z",
          "Titre": "I love my scale so I had to try the smart measuring tape",
          "Contenu": "I love my scale! I thought I would try the smart measuring tape to measure my weight loss progress.  It is as fantastic as the scale.  Easy to use and consistent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Noreen T",
          "Nb_Reviews": 2,
          "Date": "2023-07-12T07:27:22.000Z",
          "Titre": "Everything came as promised",
          "Contenu": "Everything came as promised. It works well and really works into the kinks! The one thing I wish it could do would be to roll down into the top of your shoulders but the rest feels fantastic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MD",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T22:05:33.000Z",
          "Titre": "GREAT VALUE, extremely happy",
          "Contenu": "This made my 3 purchase and I'm still very happy. Great product,  great price, great experience. Easy  provides great products with a positive value to the consumer"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Susan McKinnon",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T15:34:47.000Z",
          "Titre": "I’m unable to do a review due to still…",
          "Contenu": "I’m unable to do a review due to still not having received my last two items from my last order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Jo Gall",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T01:45:23.000Z",
          "Titre": "Your customer service is excellent!",
          "Contenu": "Your customer service is excellent. I contacted them with an issue and the responses quickly and sent out a new foot massager."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lady Reyes",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T05:14:28.000Z",
          "Titre": "I am very happy with the product",
          "Contenu": "I am very happy with the product. I am going to 3 years and I just upgraded. I love the style, the finish material, the app. Renpho has helped me loose weight and watch my weight and that of my family."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Horia",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T00:10:19.000Z",
          "Titre": "We have 2 products at home",
          "Contenu": "We have 2 products at home, the massage gun and an air purifier.Both working great, good quality"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Keith Adamson",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T07:00:34.000Z",
          "Titre": "Highly recommended",
          "Contenu": "Great product that lives up to expectations. Compact yet powerful enough to be effective. Pleased to recommend."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Jessica Cammarata",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T02:59:44.000Z",
          "Titre": "it's a very good product",
          "Contenu": "it's a very good product! Service was excellent. It might not do miracles but it surely helps relaxing the muscles and feel better. I am happy with my purchase"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cordell",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T05:03:24.000Z",
          "Titre": "Weight Scale",
          "Contenu": "Great description of product, it had every feature they listed. Fast shipping and looks fantastic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Augustine Dunson",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T08:54:04.000Z",
          "Titre": "I was able to order the correct Renpho …",
          "Contenu": "I was able to order the correct Renpho   replacement with no problems.  It came within a few days and I was very satisfied with it.  And, it was easy to install.   Thank you!  AD"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory Benedict",
          "Nb_Reviews": 2,
          "Date": "2023-02-28T22:45:54.000Z",
          "Titre": "This app of course helps you help yourself",
          "Contenu": "This app of course, along with my nutritionist is really helping me get my butt on track… Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Toshiye Estes",
          "Nb_Reviews": 12,
          "Date": "2023-02-25T03:29:04.000Z",
          "Titre": "I gave the watch box to my son for his…",
          "Contenu": "I gave the watch box to my son for his birthday.  Currently he has 10 wrist watches so now when he travels, he'll have a secure place to keep them.  He usually travels with 3 watches, so this box will help protect his watches."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Jeannette C.",
          "Nb_Reviews": 4,
          "Date": "2023-05-25T17:46:43.000Z",
          "Titre": "Happy client ..The leg massager is very easy to use",
          "Contenu": "The leg massager is very easy to use; you don’t need to waste time assembling it is a plug and play kind of item.  After 20 minutes it turns off by itself.  It is very good and it is working with my swollen legs.  Great purchase!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "iLA",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T15:34:43.000Z",
          "Titre": "Warrants",
          "Contenu": "At first I had challenges with product(scale) They were quick to replace scale and now it’s working. Thank you Renpho for your services."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Teresa Fox",
          "Nb_Reviews": 2,
          "Date": "2023-08-02T01:13:58.000Z",
          "Titre": "Very happy with the product",
          "Contenu": "Very happy with the product works perfectly and fast shipping definitely would recommend 👌"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Angela Zaccaria",
          "Nb_Reviews": 6,
          "Date": "2023-05-31T08:31:45.000Z",
          "Titre": "As I have had the foot massage for a…",
          "Contenu": "As I have had the foot massage for a short time so far working well. Just wish the heat function could be increased. The product arrived promptly!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Jeff Cruise",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T02:18:14.000Z",
          "Titre": "Pain reduction",
          "Contenu": "The unit helped to reduce pain and inflammation after a covid vacination in my left side muscles and joints"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "MAL",
          "Nb_Reviews": 6,
          "Date": "2023-06-13T06:31:27.000Z",
          "Titre": "The whole family loves it",
          "Contenu": "The whole family loves it. That’s why I’m buying another one!  Easy to use. Can have it strong or light. Long lasting battery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "theresa",
          "Nb_Reviews": 3,
          "Date": "2023-02-23T00:55:49.000Z",
          "Titre": "This was a purchase through “The Talk”",
          "Contenu": "This was a purchase through “The Talk”. I gave the 2 items I got to my sons and they were both pleased! Especially the one who got the foot massager, he is on his feet 12 hours a day. Thank you for the gift certificate!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Skeele",
          "Nb_Reviews": 6,
          "Date": "2023-03-30T15:26:25.000Z",
          "Titre": "I'm always completely satisfied with…",
          "Contenu": "I'm always completely satisfied with products and services, that's why I keep coming back."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alicia Drew",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T16:12:17.000Z",
          "Titre": "Renpho responded quickly & professionally",
          "Contenu": "Renpho responded quickly & asked if I would like another item sent out or reimbursed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-02-26T16:01:35.000Z",
          "Titre": "I enjoy using these",
          "Contenu": "I enjoy using these; feels kinda cool. And they have helped with my edema in my feet and lower legs. Have only been using them a month so it is too early to say how well they'll hold up. Seem well-made, though."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rosa Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T23:58:51.000Z",
          "Titre": "Great Massager",
          "Contenu": "The Active Massage Gun was exactly what I expected.  Works well and helps with sore muscles."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "patrick amadieu",
          "Nb_Reviews": 3,
          "Date": "2023-05-14T23:07:22.000Z",
          "Titre": "Very responsible and we received the…",
          "Contenu": "Very responsible and we received the goods extremely quickly, well packaged thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa Michaelis",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T01:37:53.000Z",
          "Titre": "The eye massager came quickly and in…",
          "Contenu": "The eye massager came quickly and in good condition.  I had a chance to try it before I bought it since someone I know bought one before I did.  I am happy with the product so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-20T05:01:45.000Z",
          "Titre": "Excellent Metrics",
          "Contenu": "The metrics provides by the scale and blood pressure cuff are excellent and useful!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "CATHERINE A  OLIVIERI",
          "Nb_Reviews": 2,
          "Date": "2023-05-29T08:51:52.000Z",
          "Titre": "Great product and quick delivery",
          "Contenu": "Great product and quick delivery! Very effective and so compact. Completely happy 🙂"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Fern Raintree",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T13:30:03.000Z",
          "Titre": "Mini Massage Gun is great value",
          "Contenu": "The Mini Massage Gun is smaller, easier to handle and cheaper but still plenty strong enough. Great value!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Mills",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T20:59:08.000Z",
          "Titre": "Product was received in a reasonable…",
          "Contenu": "Product was received in a reasonable timeframe and I am overall very happy with the product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashwini",
          "Nb_Reviews": 4,
          "Date": "2023-06-08T21:45:34.000Z",
          "Titre": "works well and relieved my allergy…",
          "Contenu": "works well and relieved my allergy symptoms, easy to set up and change filter"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Mark Pearce",
          "Nb_Reviews": 8,
          "Date": "2023-05-16T23:26:31.000Z",
          "Titre": "Awesome products at affordable prices",
          "Contenu": "Awesome products at affordable prices. Highly recommended if you’re tracking your fitness journey."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ANGELA LEWIS",
          "Nb_Reviews": 2,
          "Date": "2023-02-15T14:05:43.000Z",
          "Titre": "Renfro has excellent customer service",
          "Contenu": "Renfro has excellent customer service. I had several questions and they were responded to expeditiously.  They listened to my concerns and updated their listing based on information I provided."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kachhbin",
          "Nb_Reviews": 3,
          "Date": "2023-02-16T02:23:50.000Z",
          "Titre": "A good massager with user friendly…",
          "Contenu": "A good massager with user friendly modes of operations for different body parts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CryptoFuze",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T11:15:51.000Z",
          "Titre": "Best scale I've ever had",
          "Contenu": "Best scale I've ever had. First one bought in 2020 and still works and looks great.  Fast shipping.  This was my second purchase as a gift to a family member."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Jasmin  Cowan",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T01:27:52.000Z",
          "Titre": "Great Service",
          "Contenu": "Received the item in excellent condition, well packaged and so quick delivery. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael McClister",
          "Nb_Reviews": 3,
          "Date": "2023-03-01T22:47:04.000Z",
          "Titre": "My interaction with all your people has…",
          "Contenu": "My interaction with all your people has been quite good. Everyone has been quite helpful"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Arden",
          "Nb_Reviews": 2,
          "Date": "2023-05-29T14:15:48.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience, was kept up to date on delivery and family live the foot massager"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lin Engie",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T19:19:29.000Z",
          "Titre": "Fast delivery",
          "Contenu": "Fast delivery,  product as advertised, easy to use, convenient to travel with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "steven b",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T17:26:05.000Z",
          "Titre": "We purchased two eye massagers",
          "Contenu": "We purchased two eye massagers, Renpho customer support was great with processing our return."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T09:04:09.000Z",
          "Titre": "Greatly improved air quality",
          "Contenu": "Good quality filter,  fast shipment, fair pricing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 4,
          "Date": "2023-02-28T01:05:36.000Z",
          "Titre": "Love the eye massager",
          "Contenu": "Super fast shipping. Item came just as described. Love this eye massager"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T00:55:57.000Z",
          "Titre": "Check out was easy",
          "Contenu": "Check out was easy, fast shipping, and the product is great! The massage gun is powerful and the heater head is a nice touch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Manning",
          "Nb_Reviews": 2,
          "Date": "2023-09-03T00:40:41.000Z",
          "Titre": "Wonderful massager",
          "Contenu": "Wonderful massager, we are so happy with it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard in St Louis",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T20:06:28.000Z",
          "Titre": "I love the information from the scale",
          "Contenu": "I love the information from the scale. (Working on improving the numbers.)Richard"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Trina",
          "Nb_Reviews": 4,
          "Date": "2023-05-21T09:47:09.000Z",
          "Titre": "Great massager",
          "Contenu": "The product was just as described. Timely arrival. And a fantastic product to use. Thanks Renpho"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "STEVE SAXON",
          "Nb_Reviews": 2,
          "Date": "2023-04-16T01:41:10.000Z",
          "Titre": "Looks good",
          "Contenu": "Looks good, works really well, syncs with iPhone easily and effectively"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Lynne Robertson",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T05:34:05.000Z",
          "Titre": "My Renpho scales came quickly after…",
          "Contenu": "My Renpho scales came quickly after ordering them. Good service."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Belinda King",
          "Nb_Reviews": 3,
          "Date": "2023-04-03T01:53:30.000Z",
          "Titre": "Very happy!",
          "Contenu": "My partner is a hard man to impress and he highly rates this foot massager!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "serge vrabec",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T04:44:15.000Z",
          "Titre": "This massager is amazing",
          "Contenu": "This massager is amazing, very heavy duty and reasonably priced"
        }
      ]
    }
  ]
}