{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "repairpartsusa.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T01:56:17.000Z",
          "Titre": "Schemers",
          "Contenu": "I'm in the same boat as some of the guys above - I ordered a new display screen for an iPhone 13, the display screen came with a broken ribbon cable although my package was also not very well packaged. When I realized the ribbon cable was broken, I immediately submitted an exchange request. I received a response next day requesting photos of the screen. After submitting the photos of the screen, I heard no response. I submitted multiple emails and called their \"Customer service\" number dozens and I mean dozens of times.. No answer, no call back after voicemail.A week later, I receive an email telling me I broke the ribbon cable and that's not covered under warranty. These guys are trash."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Trembath",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T01:55:58.000Z",
          "Titre": "Repair iPhone 12 mini screen is very poor",
          "Contenu": "Repair iPhone 12 mini screen is very poor. Colors are off (especially blue hues) and after a few days will periodically not register screen touches. Connectors have been inspected under a microscope and show no damage. Parts are also not Apple genuine and will show alert message until an OEM screen can be installed. Battery appears to hold a decent charge after a week of use. Battery also shows an alert message until an OEM battery can be installed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jump Into The Matrix",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T22:32:30.000Z",
          "Titre": "Overnight shipping is a waste. Sent me a broken screen and don’t want to refund it",
          "Contenu": "Sent me a broken screen and don’t want to refund it. Paid $30 for overnight shipping and it comes in a flimsy package, no bubble wrap, no wrapping, no protection at all! I Spent over $100 for a screen just for it to come like that. I will never use this company ever again. On top of that, they tell me i attempted an install When i literally took it out the package. Please be aware. Very shady company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nick Erickson",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T23:38:01.000Z",
          "Titre": "Have been buying from RepairPartsUSA…",
          "Contenu": "Have been buying from RepairPartsUSA for years and have been happy with their products and customer service. However, recently I purchased an iPhone 13 screen for a personal replacement and the quality was very subpar. Moreover, when I attempted to return the screen they told me that the screen I sent back was not one of their screens due to it missing their manufacturing stamp. I emailed back and forth for several days trying to troubleshoot and eventually, they simply stopped replying. After spending $80+ on a screen and the $10 cost of return I am very frustrated to be holding the bill due to their inventory management issues. I am quite certain the screen I sent back was the one they sent me, I have no other iPhone 13 screens anywhere except the OEM one in my phone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Claude",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T05:17:14.000Z",
          "Titre": "I got a garbage screen that didn't work",
          "Contenu": "I paid for a new replacement screen and when I finally got it and set it up it randomly turned off and has been doing so ever since. I got literal garbage."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg WIttman",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T22:08:50.000Z",
          "Titre": "I purchased an iPhone 13 Premium Hard…",
          "Contenu": "I purchased an iPhone 13 Premium Hard OLED and Glass Screen Replacement and within 10 days the screen quit working.  It wasn't dropped or damaged in anyway, it just went completely dark.  The company initially said that they would replace it, however, while removing the screen, the plastic support plate separated from the glass, causing small spider cracks in the glass.  Again, this was secondary, as I was just removing the faulty to return it.  The ribbon cable was still intact, which could be used for testing to prove that it was a bad screen.  However, the company said that they would no longer warranty the screen because of the damage (done after the screen was already bad).  There are many other companies that offer the same product for much less and are way more reasonable to deal with!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aidan Dang",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T02:42:57.000Z",
          "Titre": "customer service nonexistent",
          "Contenu": "customer service nonexistent. Battery gone bad after a month. Dont be fooled by their lifetime warranty. THEY NEVER PICKUP THE PHONE or even answer any emails. Do yourself a favor don't buy from this place."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Logan",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T02:43:07.000Z",
          "Titre": "Do not trust them.",
          "Contenu": "I ordered a black iPhone 6 s plus replacement screen and when I received the package on the description it said what I ordered and it was correct but when I got to the product, it was a white iPhone 6 screen and it was too small. This isn't ok."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "C Choy",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T19:23:45.000Z",
          "Titre": "Faulty Products - Terrible Customer Service",
          "Contenu": "Purchased a screen from this company. Less than a month since, it has stopped working. The screen is glitching and blacking out, it’s currently flashing uncontrollably. I tried contacting the company twice, both times there was no response. It’s not worth the hassle, save your money and shop elsewhere. I’ve seen nothing but faulty products and non existent customer service from this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mo",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T17:41:56.000Z",
          "Titre": "Bent Battery",
          "Contenu": "Ordered iPod Mini 4 Premium battery as they call it for $19.99 plus $4.99 shipping! Item arrived in a thin padded envelope not sufficient to support a rigid Lithium battery! upon inspection I realized that battery was bent!! I called them up but nobody answered so I sent an email, their respond was to send the battery back and they will send another one! Now a responsible company would have provided a free return shipping label so customer don't have to pay for shipping!! after all it was their own damn fault not securing the package properly. Never going to order from them anymore."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas Massey",
          "Nb_Reviews": 2,
          "Date": "2023-03-20T01:18:29.000Z",
          "Titre": "Upon contacting repair parts about the…",
          "Contenu": "Upon contacting repair parts about the tool kits that come with parts, I recommend not buying the “plus tool kit included” parts.   You’re wasting your money and they are junk.  The ends of the screwdrivers round off and will not work Buy a separate premium tool kit and save yourself a lot of headache.   However, repair parts did contact me back on sending me a premium tool kit, under the condition that I changed my original review about how cheap the generic tool kits are.  I did not agree, and don’t think anyone should be shielded from the truth.  I never received a tool kit from them to resolve the issue because of this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-01-12T13:37:46.000Z",
          "Titre": "Horrible customer service, fraudulent company",
          "Contenu": "Horrible customer service, tried calling numerous times and all you can do is \"leave a message\" they never got back to me. Sent emails never heard back. Placed an order, payed extra for 2 day shipping and never received my order. No help from them at all. Totally fraudulent company, had to get my money back through a fraud claim on my credit card. Never use this company again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lina",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T16:52:48.000Z",
          "Titre": "horrible customer service, fault website?",
          "Contenu": "I ordered a replacement screen, it was delivered to my neighbors with proof and they told me there was nothing they could do about it. I ordered again and ordered an ear piece, never received confirmation or my package a week later, but the money was sure to be taken out of my account. Let’s see if customer service can actually help this time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kathleen A. Broderick",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T17:20:34.000Z",
          "Titre": "The screen did not fit my phone and it…",
          "Contenu": "The screen did not fit my phone and it would cost more to send it back so I'm stuck with a screen that qas advertised to fit my specific phone and it is definitely too large for the screen. I am disappointed,  but it's my own fault. I should havekn own better than to order something online and after-market."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "VCU PIANIST",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T11:42:54.000Z",
          "Titre": "They sent me a broken screen",
          "Contenu": "They sent me a broken screen. It looked fine, but one of the connectors was broken as I plugged it in it just basically disintegrated, but they blamed me for it somehow and refused to send me another one or refund me the money so I’m out $90. No phone terrible service can’t recommend them at all stay far far away"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jasmine Christie",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T17:11:14.000Z",
          "Titre": "UnResponsive",
          "Contenu": "Haven't received my order EVEN THOUGH I ordered it FEDEX OVERNIGHT SHIPPING (1 NIGHT) - $36.99 extra. I am pissed and I failed to check the reviews/ratings of this website and products that people have previously have had here. I have sent numerous emails in regards to what I ordered and if I pay extra for my shipping to have more priority, then it should be established as such. I DO NOT RECOMMEND THIS COMPANY."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T18:52:01.000Z",
          "Titre": "The part didn't work at all",
          "Contenu": "The part didn't work at all. And when i tried to return it on the website nobody even contacted for the return process over a week ago. I also emailed customer support and got no response over a week ago as well. Terrible customer service!!!UPDATE: COMPANY RESPONDED 1 WEEK AFTER THIS REVIEW (2 WEEKS LATER ) AND BASICALLY TOLD ME IT WAS MY FAULT THEIR CRAPPY CHINESE EAR SPEAKER ISNT WORKING AND THAT THE PART THAT WAS INSTALLED COULD NOT CAUSE THE ISSUES I DESCRIBED. ( NEW EAR SPEAKER CAUSED HOME BUTTON TO NOT WORK AND GOT MOTHERBOARD HOT) but when I installed the old damaged speaker everything went back to normal. Did this process 2 different times. TERRIBLE COMPANY!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jessica N",
          "Nb_Reviews": 3,
          "Date": "2023-06-09T07:14:46.000Z",
          "Titre": "What is going on?",
          "Contenu": "I have been using this site for years, usually order is placed and a confirmation email is sent. Later that day or next I get an email saying my order has shipped and lastly an email saying the package has been delivered. I haven't gotten anything since my order was confirmed. No reply to email, call back or text.idk what's going on with you guys but someone needs to get it tf together!*Original review*I ordered this replacement in April, today my son knocked it out of my hand and it landed flat. To my surprise the screen was not shattered but when I tried to unlock it the screen had 4 wide green strips and became less and less responsive to touch so here I am, ordering another screen."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason Wright",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T21:14:28.000Z",
          "Titre": "I placed an order with 2-3 day…",
          "Contenu": "I placed an order with 2-3 day shipping. I’ve made many calls and sent plenty of emails and I’ve heard nothing back from the company. My tracking shows they’ve done nothing with my order since I have placed it. They’re scamming customers at this point I feel this is fraudulent"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sidney DeGrasse",
          "Nb_Reviews": 2,
          "Date": "2023-04-21T02:06:30.000Z",
          "Titre": "Poor Customer Service with Problem Resolution",
          "Contenu": "In the past 2 years i have ordered a replacement screen for my iPhone XS Max. The first was in November of 2021. I ordered a hard OLED replacement and some accessories. In November of 2022 I had to replace the hard OLED screen because it failed and decided to purchase the Soft OLED replacement screen. It went out last week at the 4 month mark and I have been trying to contact Repair Parts since. Sent an email, left numerous messages and texted. No contact, no response, and no return calls."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew Truong",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T15:38:43.000Z",
          "Titre": "Submit an orders",
          "Contenu": "Submit an orders,  filled out the shipping information on the website when I made the payment through Google PayPal they took my old shipping address that I had moved, I did the order on the Saturday. I had sent the email and the text for them to change to the new shipping address but never responded and I waited to Monday when their business opened . I did called them 20 times no one answer their phones leave the message no one responded. I just received the email to day and they sent out to the wrong address. I had orders so many items online this company is the worst customer service that I have experienced with."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2023-04-16T14:42:05.000Z",
          "Titre": "Iphone X OLED screen stopped working 4…",
          "Contenu": "Iphone X OLED screen stopped working 4 months after installation, for no apparent reason. I received returen authorization and sent it back over 2 weeks ago but haven't received a refund. Repeated attempts to contact customer service unsuccessful, phone line always busy, no reponse to email or messages.Addendum: Finally, after posting the review above, a response from Repairparts and a refund. Took almost 3 weeks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "O t",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T23:16:37.000Z",
          "Titre": "Ipad digitizer adhesive is not strong",
          "Contenu": "The digitizer adhesive is not strong. The flex connectors are thick so pushing the screen out. The customer service is not good. I sent an email about the issue and they did not get back to me for a solution. iPad 9 (2021) Premium White Glass Screen Digitizer Complete Assembly"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Doug Congleton",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T18:28:01.000Z",
          "Titre": "You did not ship same day as you say",
          "Contenu": "You did not ship same day as you say. I paid for two-day ship, it will now take 3. I called and left phone message and two emails telling you to refund my order if it could not arrive in two days. You ignored it all and just went against everything I instructed. This is horrible customer service, and actually NO CUSTOMER SERVICE. I am totally unhappy with your company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Priscilla martins",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T00:06:17.000Z",
          "Titre": "Many events followed in different…",
          "Contenu": "Many events followed in different purchases.  First, I made a purchase for an iPhone XR screen swap, paid for faster shipping, and received it several days later than the expected delivery date.  Everything was fine until the moment, I installed the screen on the phone and to my surprise, it didn't show any signs of life, nothing.  I removed all plugs and reinstalled again, nothing happened.  I received a broken product.  I then contacted the company's supposed support, and after 1 month, I did not receive any response about what happened and neither the return of the product was suggested.  So I decided to do another test and buy another screen, but for an Iphone 12 pro max, I received the screen this week, but for an iphone 12 and not for a pro max.  I opened another ticket to support and once again, I have no response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lanzo Pierre",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T15:59:47.000Z",
          "Titre": "They sent me the wrong iPhone screen…",
          "Contenu": "They sent me the wrong iPhone screen and ghosted me after sending them the proof. Left without a phone for 2 weeks. Customer service is slow and they never answer the phone. Sent package days after placing order. Parts are knockoff and cheap."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Troy Donovan",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T22:39:26.000Z",
          "Titre": "Customer service is non existent",
          "Contenu": "Customer service is non existent. Parts won't show up. They listed items as \"Shipped\" but never delivered to carrier."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom Wanamaker",
          "Nb_Reviews": 2,
          "Date": "2022-12-29T08:18:21.000Z",
          "Titre": "On the upside",
          "Contenu": "On the upside, my package did arrive promptly.  However, the wrong part was sent. Not a big deal if it can be exchanged for the right part. But I sent an email summarizing the problem and asking for a return authorization in order to exchange the part . . no reply.  So I then asked to return the part for a refund. Again, no reply.  A sale and prompt shipping of an order is important, but by itself does not a business make.  Service after the sale is equally important.  This is an area where this vendor could greatly improve its service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Si Ckofit",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T06:42:42.000Z",
          "Titre": "ZERO customer service",
          "Contenu": "Website easy to navigate.  All parts I needed were in stock, but, as soon as I finalized the order I realized I forgot an item. Paying double for shipping is idiotic so I tried unsuccessfully to find a way to cancel the order and place a new one with all my items so I called.  All agents busy.  Live chat unavailable, leave info and your question we will get back to you, so I did and they did not. \"Contact us\" so I emailed, NO response again! All of that within minutes of placing the order.I called at various times of the day and night but their alleged \"agents\" were always allegedly assisting other customers. I also emailed again with NO response. I will be buying parts elsewhere.  Even bad customer service will be better than being ignored."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Alvarez",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T22:23:32.000Z",
          "Titre": "You dont give enough detail on where my…",
          "Contenu": "You dont give enough detail on where my order is at. Relying on a third party like shop wont cut it either make better arrangements with shop or find a better way."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "aaron halstead",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T10:21:57.000Z",
          "Titre": "wrong parts were sent",
          "Contenu": "wrong parts were sent, used parts were sent, very unhelpful with returns. Doesn't cover return shipping for faulty/used/wrong parts, so you end up eating the cost to replace."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "violet gonzales",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T22:25:09.000Z",
          "Titre": "They litteraly didnt send me what they…",
          "Contenu": "They litteraly didnt send me what they wrote in the description they sent the tools only no screen scammed and they never answered me back"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stan",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T02:41:10.000Z",
          "Titre": "Purchased a ipad air 4gen lcd screen +…",
          "Contenu": "Purchased a ipad air 4gen lcd screen + digitizer, I shipped it back for a full refund, it still worked perfectly when I requested a return and was approved for a return and refund after they receive it, I paid return shipping made sure I did everything they asked regarding reference number all that. Well days pass I check the tracking and it shows delivered 10 days prior to me checking, I contact them about my refund, gave them tracking number, took screenshots of it showing delivered,called them, emailed them, nothing but run around, no refund,then after almost a month since I contacted them they completely ignored me and never refunded my money $200 stolen from this place, never again scammers. Dont waist your money, they will just take it and never respond."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brett Cassells",
          "Nb_Reviews": 2,
          "Date": "2022-11-21T23:15:50.000Z",
          "Titre": "Terrible, Awful, Horrible Experience",
          "Contenu": "Terrible, horrible, awful experience. Do not buy from here. They sent me the wrong part. I've called twice, I've texted the support number on their website twice, I've emailed twice for a week and 0 response. This company is a scam. I still have yet to receive a response, a solution, or a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matt Yostpille",
          "Nb_Reviews": 1,
          "Date": "2022-11-05T17:28:35.000Z",
          "Titre": "There’s no customer service",
          "Contenu": "If you have to try to contact them for exchanges or returns good luck. I’ve been waiting over a month and have tried everything from multiple emails, phone calls with no answers and I even text the support number. When you submit the RMA it says someone will get back to you in 1 business day. That’s not true, they will ghost you and never get back to you"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "juan r parrales",
          "Nb_Reviews": 1,
          "Date": "2022-11-06T02:30:15.000Z",
          "Titre": "lousy warranty service from this…",
          "Contenu": "lousy warranty service from this company.               they were never responsible for the coverage of a poorly assembled screen.                                            that you sent poorly assembled"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Allen Jenkins",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T02:07:10.000Z",
          "Titre": "No response from customer service",
          "Contenu": "The one part I received was cracked. But the reason for the one star is because I send an email 2 different times and I wait's been 4 days now no response. Not even a generated message to say that I'm in a queue or anything. no response at all"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jayachandran kamaraj",
          "Nb_Reviews": 1,
          "Date": "2023-02-19T15:11:39.000Z",
          "Titre": "It was the wrong part",
          "Contenu": "It was the wrong part. I tried to contact within 5 minutes of ordering that it is wrong and wanted it cancelled and didn't have any response even thought it was shipped 5 days after the order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicholas Brager",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T00:33:38.000Z",
          "Titre": "Never received package",
          "Contenu": "Never received package. I gave the new address and it was sent to the old address anyway. And now I don’t know where it went. Contacted the new tenant and USPS and it still hasn’t been recovered."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Haley Renee",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T16:05:46.000Z",
          "Titre": "Poor Quality Missing Items",
          "Contenu": "Let me start by saying shipping was fast ordered Friday received via USPS the following Monday. I ordered the premium hard oled screen kit for iPhone 11 pro max with premium tool kit, this also comes with the the display seal, Along with a back glass and new pentalobe screws. Now this is where my issue is, when i opened the package the tool kit was not there, understandable mistakes can be made, but it is the single upgrade they offer and I cant understand how it can be overlooked. Unlike the shipping you can expect 3-4 days for a customer service response. Do not waste your time calling, rings for 15secs and is sent to an automated voicemail. With no luck and in dire need of my phone i had to over night tools because i do not have anywhere locally that stocks them. After installing the screen, the display seal is trash would not come off the plastic, it works fine but touching the edges require more force and it may just be me but when typing it will almost always press an extra key or double tap space and add . Not sure how it will fair but if you are debating between this site and iFixit i would recommend to go ahead and spend the extra money with iFixit, I have always purchased my parts there and never once had an issue. I had there premium tool kit for years until and cant find it now. the back glass looks great and the screws are screws.Just an honest review of my experience, but take your chances🤷‍♀️"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vincent Chavez",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T06:02:54.000Z",
          "Titre": "Well I placed order and I upgraded…",
          "Contenu": "Well I placed order and I upgraded shipping to 2 day express Nd paid a extra 34.99. Its been now 4 days and I ha e yet to receive my package very unhappy at the moment"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Khia Beasley",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T17:01:59.000Z",
          "Titre": "HORRIBLE",
          "Contenu": "First I ordered a screen and it was useless. It would never turn on.. I contacted via email and got no respond so I ordered another one to see if it would work but never received it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Mitterando",
          "Nb_Reviews": 2,
          "Date": "2023-02-13T19:21:35.000Z",
          "Titre": "Overpromises and underdelivers.",
          "Contenu": "Do not offer same-day shipping in concordance with what is listed on the website. The product received is defective. I was given an RMA no and no shipping label to exchange it, which would leave me on the hook for shipping the defective product and not having any access to my phone until they received the defective product and returned a replacement. Also, they do not respond to all customer service inquiries or take responsibility for miscommunicating their shipping policy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alex Serafin",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T19:55:17.000Z",
          "Titre": "1883/4000 mah",
          "Contenu": "Got replacement battery and it's only showing 1883/4000 mah. Worse than the battery that came with the phone!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary Canter",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T01:47:14.000Z",
          "Titre": "It did not last the cracked the first day and kept on cracking",
          "Contenu": "When I installed it did not fit flush around the camera lens. A cracked the next morning. And the next day and my top shirt pocket it kept cracking very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angel Dominguez",
          "Nb_Reviews": 4,
          "Date": "2023-05-24T02:58:46.000Z",
          "Titre": "Customer service sucks warranty sucks…",
          "Contenu": "Customer service sucks warranty sucks don’t buy anything from them you will regret it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amber Hobday",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T03:11:15.000Z",
          "Titre": "battery was wrong  battery",
          "Contenu": "battery was wrong  battery , so i have now been 9 days without a phone , wile i wait on a new battery to be delivered"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Not mad, just disappointed",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T12:52:42.000Z",
          "Titre": "Incorrect item shipped",
          "Contenu": "Incorrect item shipped. Was given full refund. I did ask about what I could do to get the correct item and have yet to receive a response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "mary huskey",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T15:05:25.000Z",
          "Titre": "the item only had sticky along the…",
          "Contenu": "the item only had sticky along the edges and would not stay on and in trying to press on the center to get air bubbles out the thing cracked and was usless. Threw it in the trash"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard achtzener",
          "Nb_Reviews": 1,
          "Date": "2022-11-06T23:30:58.000Z",
          "Titre": "Kit was made for rocket scientist not easy",
          "Contenu": "Wires were detached and phone only works on speaker gonna but new phone 😡thAnks but to complicated"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Erica Bartle",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T17:41:32.000Z",
          "Titre": "This company can improve by actually…",
          "Contenu": "This company can improve by actually sending the product I ordered. Extremely disappointed with this online store, would not recommend to anyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bryce Sasser",
          "Nb_Reviews": 1,
          "Date": "2023-02-05T13:53:42.000Z",
          "Titre": "They said my order was sent and I never got it",
          "Contenu": "They said my order was sent and I never got it. They sent an email saying I could track anytime but didn't leave a link"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Trevor Baker",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T02:06:03.000Z",
          "Titre": "I cant find any information on my…",
          "Contenu": "I cant find any information on my package in which I paid for overnight shipping for. It’s been 4 days"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "thomas kilts",
          "Nb_Reviews": 3,
          "Date": "2022-11-23T07:44:44.000Z",
          "Titre": "Scam",
          "Contenu": "I get emails saying to leave a review and get 5$ back from the purchase. I have left about 3 reviews. All 5 star and I haven’t gotten a single penny back. And I left these reviews months ago"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Katamara Jarrett",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T22:23:52.000Z",
          "Titre": "My order never arrived",
          "Contenu": "My order never arrived. I emailed the contact support and nobody responded. I basically paid for nothing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "C Smith",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T14:49:46.000Z",
          "Titre": "Worst place ever",
          "Contenu": "Worst place ever, I order the wrong size batteries contacted them and was told to send them back once I receive them so I sent them back still in the original unopened package my tracking shows that they delivered back to them 2 weeks ago and yet I still have not been refunded."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chet Ranger",
          "Nb_Reviews": 2,
          "Date": "2022-12-13T01:54:39.000Z",
          "Titre": "Looks good but doesn't work",
          "Contenu": "I could not operate my phone through the protective screen.  Had to remove it altogether."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ayanna Ivey",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T19:22:32.000Z",
          "Titre": "I accidentally put the wrong address…",
          "Contenu": "I accidentally put the wrong address but you guys won’t reply to my email"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alexander",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T23:49:07.000Z",
          "Titre": "Bad quality screen arrived damaged…",
          "Contenu": "Bad quality OLED screen arrived damaged customer service didn’t help"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Usafmw Watches",
          "Nb_Reviews": 3,
          "Date": "2023-01-27T19:15:39.000Z",
          "Titre": "The battery don’t fit in the phone",
          "Contenu": "The battery don’t fit in the phone, the plug is on the opposite side of the battery."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Trent Gaona",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T19:40:37.000Z",
          "Titre": "Received damaged product and you…",
          "Contenu": "Received damaged product and you refused to refund me or send a replacement."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aundrea Vanduyn",
          "Nb_Reviews": 1,
          "Date": "2023-01-22T13:28:36.000Z",
          "Titre": "You won't acknowledge nor respond to my…",
          "Contenu": "You won't acknowledge nor respond to my emails with questions"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CB Roberts",
          "Nb_Reviews": 1,
          "Date": "2022-10-22T04:23:15.000Z",
          "Titre": "Poor quality screen and tools",
          "Contenu": "Home button hole was too small. Tools were made of really cheap metal. The screws the stripped the teeth off the screwdrivers. Had to find my own tools. Only to be disappointed with the screen itself. Coloring is off and screen has some light patches. Altogether this not something I would buy again nor would I suggest anyone else waste their time and money on it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Sheridan",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T18:54:40.000Z",
          "Titre": "I don't know where my order is",
          "Contenu": "I don't know where my order is.  It's been 8 days....no tracking number provided.  Order  #279058R....its not in my mail today...."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Will Burns",
          "Nb_Reviews": 2,
          "Date": "2022-10-31T00:30:16.000Z",
          "Titre": "Battery would not register with Apple…",
          "Contenu": "Battery would not register with Apple screen. Worked camera did not work. Speaker did not work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lenward Caraway",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T17:00:50.000Z",
          "Titre": "Presently Disappointed",
          "Contenu": "Good delivery time; however shipping failed to include two tool kits, but you were advised and you resent them.  Battery installed and worked well.  Disassembled phone again to replace screen, my iphone 6, Model MG4N2LL/A, has 4 (four) plug ins, your replacement has 2(two), you sent a 6G, mine is a 6.  Your text on notification stated that the 6G and 6 are the same without addressing the plugins.  I have not reopened the phone to see if that is true at this point.  Will address the issue this afternoon, and will contact you accordingly to my investigation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 2,
          "Date": "2022-10-18T04:06:45.000Z",
          "Titre": "Was mailed a broken defective…",
          "Contenu": "Was mailed a broken defective replacement display just to be told that it was damaged by my improper installation attempt. Called and emailed the same day it was delivered- after I got off work and had the chance to inspect the product. This is NOT a trustworthy, reliable company. I will never give them a dime of my money again. It doesn’t matter whether you attempted any repair. It doesn’t matter whether you email with pictures and call as soon as you received their garbage. This is the most dishonest, inept, incapable vendor experience I have had in many, many yrs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Kosiek",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T17:54:22.000Z",
          "Titre": "Still haven’t received my order and…",
          "Contenu": "Still haven’t received my order and when I send emails to them I get no reply! Super salty"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hunter Wood",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T01:28:54.000Z",
          "Titre": "Paid For Next Day Air was sent sent 2…",
          "Contenu": "Paid For Next Day Air was sent sent 2 day Fedex ordered on Wednesday Night Website says same day Shipping was then Shipped outside there normal Hours 10 minutes before the the 24 hr deadline for my order causing the item that should have been sent out the following morning and received on a Friday to get postponed to Saturday because they dragged there feet I could have got this same service off of any generic vendor off eBay very disappointing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Colombo",
          "Nb_Reviews": 1,
          "Date": "2022-10-07T15:38:46.000Z",
          "Titre": "I ordered a stylus for my phone it…",
          "Contenu": "I ordered a stylus for my phone it slips into the phone itself.I ordered the model for my phone.It arrived , it did not fit the phone.I called , dropped emails no response.So in short.So this is my rating."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Emily L",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T18:19:09.000Z",
          "Titre": "Part didn't fit",
          "Contenu": "Part didn't fit, it's the second one I've tried. No idea how to return it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brittany Wolf",
          "Nb_Reviews": 2,
          "Date": "2022-10-08T21:41:25.000Z",
          "Titre": "The service was horrible",
          "Contenu": "The service was horrible. I couldn’t get a response until I requested a refund from PayPal and immediately received a response, this was after 3 days of trying to contact them for product update. I paid for express 2 day shipping on Saturday and didn’t receive the item until the next Friday. They were experiencing hurricane weather (which I was unaware of where the product came from) but on other websites they inform customers of shipping delays due to weather and where product is being shipped to avoid miscommunication and extra fees on fast shipping. I needed the item quick and paid extra for it quick and had I known I would have shopped elsewhere. Also, when I replied to them (immediately) I told them not to ship the product and I had ordered it elsewhere, no response back at all. I find no excuse for horrible customer service anywhere we are spending our hard earned money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Larry Brown",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T12:44:46.000Z",
          "Titre": "The part wouldn't work and you want…",
          "Contenu": "The part wouldn't work and you want return my call"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Katie Rosa",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T21:32:15.000Z",
          "Titre": "I received the wrong part and had to…",
          "Contenu": "I received the wrong part and had to reorder a second part"
        },
        {
          "Note": 1,
          "Lieu": "JM",
          "Pseudo": "amarie",
          "Nb_Reviews": 3,
          "Date": "2022-07-14T20:15:59.000Z",
          "Titre": "The only way I can get to this company…",
          "Contenu": "The only way I can get to this company is by review as the there is no one operating the phone or emails for this company. I’m speaking directly to a person at repair parts USA in this review. I first tried direct payment by just typing in my card info . I got an error . It hen tried PayPal PayPal the. Showed me I had no money . I was confused so I check my bank it shows my order total was withdraw as it showed exactly this (Repairpartsusa           888-9923905) along with the total . Can I get a working number as I can show that the funds were withdrawn"
        },
        {
          "Note": 1,
          "Lieu": "JM",
          "Pseudo": "amarie",
          "Nb_Reviews": 3,
          "Date": "2022-07-20T14:24:55.000Z",
          "Titre": "This website has gone to shīt",
          "Contenu": "This website has gone to shīt. Used it previously and it was ok. But the other day i made an order but there was an error , turns out it still took the money from my bank. Now there isn’t anyone on the phone lines or email  to ship me my order or give me my money back"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SliceTV",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T20:30:02.000Z",
          "Titre": "Ordered a barebones iPhone 12 Pro Max…",
          "Contenu": "Ordered a barebones iPhone 12 Pro Max back chassis replacement. Order took 2 weeks to arrive, and I lost the customer before the part came in. Paid $15 for return postage and in limited correspondence have not received a refund for the return. It has been 2 weeks since UPS delivered the return to their location, and I have not been able to reach them through phone calls, emails, or social media. Disgusting customer service and I urge you to find somewhere else to source your replacement parts."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bryce V",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T19:11:12.000Z",
          "Titre": "False advertising for products",
          "Contenu": "I ordered a white back glass for the Note 20 Ultra avoiding Amazon as I had seen a bunch of knock off versions with black camera bezels instead of the factory silver and chrome. After having the part I ordered from Repair Parts USA installed I realized I was deceived and misled.  The photos on the website showed a white back glass with a chrome and silver camera bezel as if it was from Samsung, the product on my phone had a black camera bezel which is exactly the knock offs they sell on Amazon.  I emailed the company to give them a chance to make it right and was asked to send a photo showing the product, which I did.  They then asked if I could send it back on my dollar and they would refund me, knowing full well from our previous correspondence it was already installed.  HOW AM I SUPPOSED TO SEND IT BACK UNTARNISHED NOW THAT I HAD IT INSTALLED?Terrible customer service in the way this was handled.  I will not purchase from them in the future and I certainly will not consider them as a wholesale supplier!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mario Bolanos",
          "Nb_Reviews": 1,
          "Date": "2022-10-09T16:02:42.000Z",
          "Titre": "Wrost service ever im still waiying for my order to be delivery",
          "Contenu": "Worst experience i order a product and havent received yet its been 2 wks, after several attempts to reach customer service i gave up"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeremy Hatfield",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T06:14:42.000Z",
          "Titre": "I did not recieve my shipment."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kelly",
          "Nb_Reviews": 3,
          "Date": "2021-12-02T17:07:18.000Z",
          "Titre": "No No No - No response after sale.",
          "Contenu": "I had previously left a good review which was only applicable to the initial sale and the product actually working out of the box. However, now it is not working and they won't return call, text or email. Read very carefully their \"lifetime warranty,\" lol it is so not a warranty, especially if they ignore you when you have an issue. I would prefer an actual real 1 year warranty with some sort of person responding."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JG",
          "Nb_Reviews": 1,
          "Date": "2021-11-10T16:13:51.000Z",
          "Titre": "Buyer Beware",
          "Contenu": "Buyer Beware.  You are taking your chances ordering from this company.  Poor customer service and you get charged shipping if you have to return defective parts.  It's in the fine print...PS.  They do not answer the phone and you will have to spend hours trying to get in touch just to be told you have to pay for trackable return shipping - which in my case is almost the same cost as the part..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Walker",
          "Nb_Reviews": 3,
          "Date": "2022-09-20T17:39:12.000Z",
          "Titre": "i demand a refund!",
          "Contenu": "I always go to repair parts USA when I am repairing someone’s phone including mine. But when I came to fix an iPhone 12s screen the quality of the replacement screen was less than subpar. The screen did not work longer than five minutes in which it shorted out and did not work ever again. I contacted repair parts to get a replacement screen and I was never responded to. However I did manage to receive a new email asking me to rate your services. This is terrible on customer service and it made me look bad as an iPhone repairman. I ended up losing $200 to pay a company who have extra iPhone screens on site ready to use to fix the phone. I’m not asking for my $200 back that’s just the price of business, but I am demanding the money that I spent on both the screen and the camera part back. If I get these things back the review will be better but if not then I will make sure that I tell anybody I know about the bogus business that is repair parts USA."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandon Z",
          "Nb_Reviews": 1,
          "Date": "2021-10-17T17:25:06.000Z",
          "Titre": "Multple orders had issues",
          "Contenu": "Have received multiple orders from this site. Out of four orders, two have have damaged parts, missing parts, or parts that were for the wrong phone.I have tried to contact customer service multiple times and only one of the three issues were corrected. I waited for more than a week for one part to get corrected and I never heard back from them.Placed four orders with them and I will never place another as long as these problems persist."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alfred Asarisi",
          "Nb_Reviews": 3,
          "Date": "2021-10-02T23:17:10.000Z",
          "Titre": "Very poor response from them",
          "Contenu": "Very poor response from them. Apparently the item I ordered was on backorder but they did not let me know. I tried numerous times to reach the and they finally replied that it was on backorder. Still not mailed to me when they said it would be in. Left them another message via email to cancel my order. My real problem here is the Lach of communication. No one seems to care either. I won't be ordering from them in the furure."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Bellows",
          "Nb_Reviews": 1,
          "Date": "2021-09-23T04:52:08.000Z",
          "Titre": "Pure Scammers. They dont care",
          "Contenu": "This is one of the worst companies Ive worked with, they sent me a used scratches LCD, no big deal, they also sent me the wrong color of glass, I got the right color after some fighting, but the LCD they sent me was damaged, and wouldn't function, and I returned it, since than they have ghosted me on all accounts, and wont respond to my mail, I am hoping to take it to small claims court and get a settlement."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "H A",
          "Nb_Reviews": 2,
          "Date": "2021-11-09T22:53:27.000Z",
          "Titre": "Sent Wrong Product - No Refund",
          "Contenu": "I ordered an OLED screen and received an LCD. The box was not labeled anywhere as an LCD so I installed it and noticed when I turned it on that it was NOT an OLED screen. I requested a return/ exchange for the correct product but was denied since the screen was considered “used”. Terrible experience… do not waste your money here."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Toby Hidenrite",
          "Nb_Reviews": 1,
          "Date": "2022-02-06T04:55:22.000Z",
          "Titre": "Ordered an iphone 12 pro replacement…",
          "Contenu": "Ordered an iphone 12 pro replacement screen.  Received a shipment email for item when it never shipped.  After 4 phone calls and 3 emails with no response finally had to dispute charge with credit card company.  Total waste of time. If there was a way to give zero stars i would."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 2,
          "Date": "2021-08-13T19:39:29.000Z",
          "Titre": "No point of a warranty when you can't contact CS!",
          "Contenu": "Ordered some Iphone x parts, specifically the rear housing with small parts attached. After a successful install I find the Wifi module is not working.I have reached out to Repair Parts USA 5 times now. email, text, phone and RMA return. Zero contact with me about my issue No point of a warranty when you can't contact customer service. AVOID THIS COMPANY!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Moyer",
          "Nb_Reviews": 6,
          "Date": "2021-11-24T18:01:39.000Z",
          "Titre": "This is a horrible company that sent a…",
          "Contenu": "This is a horrible company that sent a screen that was cracked under the glass and told me they dont cover a installation failure. This was my first time ordering from them i usually shop elsewhere. I suggest u be very carefull ordering anything from here. I know i will order elsewhere from now on."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kapono Lindon",
          "Nb_Reviews": 1,
          "Date": "2022-09-26T12:57:34.000Z",
          "Titre": "Unprofessional",
          "Contenu": "A kid of mine was harassed by employees for something I did in the past. On top of that the representative handling my case did not have to bring up my charges from the past or any of my stories yet he did to make himself feel better after my kid said we pursue with the correct authorities if working products are not sent. The representative got upset and looked up my name and tried to use it against me by looking at a past of mine which is very highly unprofessional. I have yet to give this company -5 stars.  If I'm going to let my child run the business creeps like this guy that done this needs to be either fired or in the dirt. His kind needs to be put away for good. I know he has a past he doesn't agree with as well. We don't know your name but we wouldn't be creepy enough to look up your name and dig up information on it like that's stalking. And I still might pursue a class action lawsuit against the company for defamation of characer and emotional distress. Thank you for listening"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonathan Niemeyer",
          "Nb_Reviews": 2,
          "Date": "2021-06-23T20:45:36.000Z",
          "Titre": "Customer service was terrible",
          "Contenu": "Customer service was terrible. I received a damaged product and this company basically called me a liar saying “the screen wouldn’t just randomly break”. This screen has been installed less than two days and is flickers and has a slight crack from being in my pocket. It is in a case and has not taken any abuse at all. They refused to resolve this matter, even the hardware issue. Do not give them your buisness."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shengxi LI",
          "Nb_Reviews": 1,
          "Date": "2021-07-06T08:01:28.000Z",
          "Titre": "iPhone XS OLED screen replacement has…",
          "Contenu": "iPhone XS OLED screen replacement has very bad quality. It cracked after a few days of use with reasonable pressure applied on the top. Customer service's excuse for no warranty was that the screen is not going to crack itself. Yes, that's true. But cellphone is something we use everyday, so the screen should have good quality to withstand normal use."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve A",
          "Nb_Reviews": 1,
          "Date": "2021-07-16T23:21:57.000Z",
          "Titre": "Scammed - Do not use!",
          "Contenu": "Scammed. Ordered, they did not ship for 4 days then cancelled order when I asked for support. Did not refund and am currently requesting refund from paypal. Do not purchase from!Additionally, after canceling and requesting refund they play ignorant and try to ship out parts after I already ordered (and received!) parts from elsewhere. Beyond shady!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joaco",
          "Nb_Reviews": 2,
          "Date": "2021-05-11T18:40:01.000Z",
          "Titre": "On 03/28/21 I made an order",
          "Contenu": "On 03/28/21 I made an order, 228220, and never receive an email with the confirmation and also tracking status. On 04/02/21  Sent an email asking about my order and nobody answers me. Suddenly I received and email that my order has been shipped. My client have to expect more than usual due to you logistics procedures. Also the screens  come without camera and speaker holder.  So never again with you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kazi",
          "Nb_Reviews": 1,
          "Date": "2021-11-24T01:34:03.000Z",
          "Titre": "If you want to return, they ignore your emails or any attempt to reach them",
          "Contenu": "I bought iPhone display and cameras from them and display was good but camera quality was not anywhere near to OEM quality. So, I wanted to return and even confirmed with them before returning. Once I returned and sent them the tracking number and it was delivered to them but still after few months they did not process the refund and I tried to email and call and text, nothing worked. They email back very quickly when you want to buy or have a query but they forget you once you have any issue with the product or they need to return your money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Linus",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T20:39:17.000Z",
          "Titre": "No guarantee of functionality",
          "Contenu": "I purchased a replacement screen for an iPhone 6s. Part was defective upon arrival but the defect was not apparent until after installation (how could I know 30% of the screen would not register touch input if I don’t install it?). Since it was installed, RepairPartsUSA would not and will not back up their products with any kind of guarantee or refund. Waste of money, there are better options than this service for equivalent prices."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kaylea",
          "Nb_Reviews": 1,
          "Date": "2021-05-20T05:03:08.000Z",
          "Titre": "I GAVE YALL A ONE STAR BECAUSE ON THE…",
          "Contenu": "I GAVE YALL A ONE STAR BECAUSE ON THE INFO OF THE PRODUCT I BOUGHT IT FAILED TO SAY IT WAS ON BACK ORDER AND IT CAME 2 WEEKS LATE. COSTING ME LATE HOME WORK ASSIGNMENTS, GOT FIRED FROM MY JOB, MISSED DOCTORS APPOINTMENTS and lets not forget PARENT TEACHER CONFERENCES. i would have NEVER ordered another SCREEN from you guys.... After i already bought TWO, (A MONTH BEFORE THIS) IF I WOULD OF KNOWN THE SCREEN WAS BACK ORDERED IM STILL PISSED ABOUT IT!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fernando",
          "Nb_Reviews": 1,
          "Date": "2021-07-24T19:15:44.000Z",
          "Titre": "MY SCREEN CAME BROKEN AND I ASKED FOR A…",
          "Contenu": "MY SCREEN CAME BROKEN AND I ASKED FOR A NEW ONE AND HAVE YET TO RECIEVE IT!! THE CRACK WAS VERY SMALL AND WAS NOT NOTICABLE UNTIL I REPLACED THE OLD SCREEN WITH THE NEW ONE.. IT WAS ALSO GLITCHY AROUND THE CRACK, AND THE CRACK HAS ONLY GOTTEN BIGGER AND WORSE!! AWFUL !!!edit: THE CRACK WAS SMALL AND WAS NOT NOTICALBE UNTIL AFER THE INSTALLATION. I DID NOT DAMAGE THE SCREEN AS THESE PEOPLE THINK. THE CRACK IS SOMEHOW ON THE INSIDE YOU LITERALLY CANNOT TELL THERES A CRACK UNTIL YOU TURN IT ON"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2021-08-18T03:31:19.000Z",
          "Titre": "I recently bought a screen/lcd for an…",
          "Contenu": "I recently bought a screen/lcd for an iPhone 11 pro max.. I got the screen and upon initial inspection it was fine. Well I had it put in and it worked fine. For about three days. Then the screen started coming unattached from the lcd. After about 5 days of use the screen went black and has not been able to come on since. I paid 150$ for this part to work five days.... i tried to reach out to the company but have still yet to hear back about a refund or replacement so until then my review will stay the same."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Viktor",
          "Nb_Reviews": 2,
          "Date": "2023-09-04T14:23:18.000Z",
          "Titre": "Quality is somewhat okay",
          "Contenu": "Quality is somewhat okay, but the comunications could be better. An item of mine still hasnt shipped in a week or so."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Caidynn Melton",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T06:33:05.000Z",
          "Titre": "Screen doesn’t work every time you turn it on",
          "Contenu": "So first the screen fits but it pops out of frame anot and have a otter box and it fell off the chair and cracked and sometimes the screen just dissent want to work so you have to turn it off then back on to get it to work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Blake Ivey",
          "Nb_Reviews": 2,
          "Date": "2022-12-16T16:41:55.000Z",
          "Titre": "so the parts came in pretty quickly and…",
          "Contenu": "so the parts came in pretty quickly and i bought a toolkit as well, however the \"complete\" tool kit doesnt have the right bits to take apart an iphone fully, just the screen. The parts however are subpar, they work but are not original nor do they work like they should. i bought a replacement loud speaker for my iphone and its worse quality than before, it sounds like an old phone speaker. So parts are definitely used and not up to specs. so decent to get you by but don't expect to get your phone back to the way it used to be.  They can do better but just like most companies they don't care about quality just the money.  Id recommend getting brand new parts from iFixit."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jordan Vincent",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T16:50:19.000Z",
          "Titre": "Overall your site is good",
          "Contenu": "Overall your site is good. But your customer service is terrible. I emailed you twice before my package was even put in a box to be shipped, and never heard a reply. I strongly suggest you get a number for people to call because emailing you does not get a response."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kayden Fisher",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T04:07:59.000Z",
          "Titre": "The actual product itself was good",
          "Contenu": "The actual product itself was good, but the way it was packaged was pretty bad. The protective plastic was applied backwards. And the adhesive wasnt applied properly, so it peeled off when i tried to remove the plastic from it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jonathan Perez",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T09:50:44.000Z",
          "Titre": "Ear speakers ass screens work no feedback",
          "Contenu": "Ear speaker is muffled but screens always 10/10 I recently bought a battery and asked them if the battery would give me a warning and if it would show the percentage but they never replied so I bought it anyways it does give you a warning but it does show battery percentage so this place is ok but be aware of what you buy something might be ass but the screens are ok next time email a person back come on bad help feedback"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mo hu",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T14:07:01.000Z",
          "Titre": "Paid for best quality & the quality…",
          "Contenu": "Paid for best quality & the quality isn’t that great. My keyboard doesn’t work properly"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bobby  Underwood",
          "Nb_Reviews": 2,
          "Date": "2022-11-16T12:42:44.000Z",
          "Titre": "I called multiple times nobody answered…",
          "Contenu": "I called multiple times nobody answered it, left a voicemail nobody replied back, sent a reply through the email no response finally, I Got a email just telling me to ship it in back I wanted to speak  to somebody tech support about the problem I was having will buy from you again  Would have bought more stuff if they would answer the phone"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T15:34:01.000Z",
          "Titre": "The digitizer was faulty and not…",
          "Contenu": "The digitizer was faulty and not usable. Reattached the cable multiple times and no kinks but still was randomly activating the Lock Screen. I emailedthe help line and never heard back. Had to order a new one after waiting 2 weeks"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andy Mendoza",
          "Nb_Reviews": 1,
          "Date": "2023-02-25T05:44:56.000Z",
          "Titre": "The touchscreen on the new screen does…",
          "Contenu": "The touchscreen on the new screen does not work. Will be returning it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Raymond Smith",
          "Nb_Reviews": 1,
          "Date": "2022-10-07T17:02:14.000Z",
          "Titre": "The protective cover seems not to fit…",
          "Contenu": "The protective cover seems not to fit on the curved surfaces. I can use my fingers on the flat surface, if I press and hold.  But the curved surfaces I have to use the pen, which isn't always convenient."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Benjamin Townsend",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T01:43:57.000Z",
          "Titre": "Pen stopped working",
          "Contenu": "The pen I got originally was working and then it wouldn't link to my phone properly so it stopped working. In conclusion pen15."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christiana James",
          "Nb_Reviews": 2,
          "Date": "2022-05-07T14:42:26.000Z",
          "Titre": "OLED screen for iPhone 11pro..",
          "Contenu": "I ordered the OLED screen for my iPhone 11 Pro. Rating should be 1 but given 2 stars only because the screen works BUT the screen is not of good quality at all. It’s very dim, sharpness is low, and lacks balanced saturation of color so it’s kinda grayish. The screen looks brown when my phone screen dims. It sometimes does not respond when I'm trying to select something. The screen was inexpensive and that's probably the issue. I guess you get what you pay for."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alex Sobotka",
          "Nb_Reviews": 1,
          "Date": "2022-01-11T15:29:11.000Z",
          "Titre": "Multiple small issues",
          "Contenu": "The first replacement screen ordered over a year ago had a slight hue difference. Enough to notice, but you get used to it. The second replacement screen I have ordered through this site did not work with the original home button - home button would not function at all. I replaced the new screen with the previous cracked screen and it worked again leading me to believe the replacement screen had an issue."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 1,
          "Date": "2022-10-22T21:14:57.000Z",
          "Titre": "Screen was good - no support",
          "Contenu": "Screen was good. Tried calling, emailing and texting company to change order and never got response."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2021-08-17T18:53:19.000Z",
          "Titre": "Not impressed at all, sticking with my other distributor.",
          "Contenu": "I ordered 3 things: an iPhone 8 screen, a magnetic pad, and battery tape. The pad was cracked, the screen had a very high degree of \"washing out\" when viewed from anything over about 30 degrees, and it took almost a week to be delivered. I'm assuming the tape works, but I haven't used it. I'll stick with my other distributor (not naming who since this could read as an advert)."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Milton Torres",
          "Nb_Reviews": 3,
          "Date": "2021-11-23T19:38:44.000Z",
          "Titre": "The issues that I'm having is with…",
          "Contenu": "The issues that I'm having is with their shipping processing is taking too long ship and charger for shipping. there other company that don't charger shipping and arrive on time.I have lost customers for shipping delay/problem. But I would say their product is great can't complain there"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2021-07-10T16:51:32.000Z",
          "Titre": "I am very pleased with the product but…",
          "Contenu": "I am very pleased with the product but the return process is very flawed ... bought my item in May and returned a wrong item and still haven’t got a refund or explanation of why it hasn’t been refunded RMA number issued to me was 232471 I have made several attempts with the tracking info showing it was received but still nothing .... again great product bad return experience"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Terence O'Kane",
          "Nb_Reviews": 2,
          "Date": "2021-07-09T02:59:31.000Z",
          "Titre": "Bad iPhone 8 Screen - Color, FPS, Touch, Viewing Angle.. all bad",
          "Contenu": "Low res, low frame rate, bad colors, weird touch glitches. Bought the \"Premium\" iPhone 8 screen and its bad. About to just put the old scratched screen back on. Leaving this review because they said I'd get a $10 rebate for leaving a review.Website worked well and shipping was quick. Never heard back from anyone when I asked why the screen was so terrible."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Vane Aguilera",
          "Nb_Reviews": 1,
          "Date": "2021-05-14T02:40:51.000Z",
          "Titre": "It said same day shipping but since I…",
          "Contenu": "It said same day shipping but since I ordered it late it should’ve been shipped the next day or so I thought... it has been 2 days since and I have gotten no other email but the confirmation. They took out the money but haven’t shipped. I’m going to try to be patient and wait but if another day passes I might just have to cancel my order. I’m hoping that they reply to either my email or this review so I can know what’s going on."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Glynn Hintze II",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T08:33:43.000Z",
          "Titre": "It snapped and cracked not 10 minutes…",
          "Contenu": "It snapped and cracked not 10 minutes after I installed it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kelly J Larkin",
          "Nb_Reviews": 1,
          "Date": "2022-09-09T22:55:56.000Z",
          "Titre": "The pen is constantly selecting things…",
          "Contenu": "The pen is constantly selecting things I don't want and the cursor jumps all over and clicks what I don't want. I can't use it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 3,
          "Date": "2021-03-18T15:20:57.000Z",
          "Titre": "Overall",
          "Contenu": "Since I paid extra for expedite shipping. I received my first order within 4 days but the 2nd order took almost 2 weeks(paid shipping). Their products are good quality. The last order one of the cables for the screen replacement was too short.. They usually reply back quickly but they have not replied back to me about my last order. They do charge restocking fee."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Surlena",
          "Nb_Reviews": 2,
          "Date": "2021-06-10T17:21:00.000Z",
          "Titre": "Now although I always get my phone…",
          "Contenu": "Now although I always get my phone repair stuff from this website I feel like I was absolutely scammed today I order an IPhone 7 Plus replacement screen ( the digitizer glass screen with small parts ) and nothing worked at all after playing the 38.99 im very upset my phone doesn’t even wanna turn on this screen doesn’t work one bit it’s something wrong with it it’s either the parts that go to this phone other than that this phone doesn’t work with this screen and this screen is a rip off horrible screen"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kid Yang",
          "Nb_Reviews": 1,
          "Date": "2020-08-23T21:50:09.000Z",
          "Titre": "Product came fast but did not meet expectations",
          "Contenu": "The product did come pretty fast. But I really hate the fact that the screen itself is making my iPad crazy, I was in the middle of a meeting and it would turn on and off. It even make my iPad restart on its own. If these products are the type of products you sell for iPads, I would not recommend this to anyone. Please let your costumers know these facts before they spend money on parts that don’t function properly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RM",
          "Nb_Reviews": 1,
          "Date": "2021-01-07T17:00:02.000Z",
          "Titre": "Shortchanged refund, poor comms",
          "Contenu": "Despite contacting RepairPartsUSA by email just minutes after it became apparent a part was duplicated in my order, they responded a day later saying they could not remove the duplicate AND did NOT refund me IN FULL.  The parts I did receive were as requested.  So disappointed in the delayed response and faulty website."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julie",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T17:15:20.000Z",
          "Titre": "I ordered a replacement battery for my…",
          "Contenu": "I ordered a replacement battery for my Samsung Galaxy Note 9. Battery had horrible life. I all steps completed per instructions and I made sure the batter was completely discharged and recharged to 100%. I would get about 3 hours per charge. I could just have the phone sitting on my desk, not using it and the battery percentage would be dropping. After 2 weeks, the battery swelled destroying the back glass. Removed battery and purchased from a different seller."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Victor",
          "Nb_Reviews": 1,
          "Date": "2021-07-06T17:28:41.000Z",
          "Titre": "Screen did not work",
          "Contenu": "Screen did not work, sent an email, never heard from anyone about it. I reinstalled my cracked screen & bought a new phone. I threw out the screen I ordered & just chalked it up to never again would I try to replace my phones screen. A reply or a refund would have been nice."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2020-06-03T15:38:40.000Z",
          "Titre": "Fast and easy order but lack of responsiveness with defective item",
          "Contenu": "Fast and easy order. Item arrived promptly but was missing a screwdriver. After contacting the seller they send a replacement right away. The screen I ordered and installed was defective as the lower part was not responsive to touch. Several emails requesting replacement/returning the item remained unanswered. Installed a screen from a different seller which works just fine. Would probably not order again from them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Terence O'Kane",
          "Nb_Reviews": 2,
          "Date": "2021-07-02T08:05:26.000Z",
          "Titre": "Go Somewhere Else",
          "Contenu": "Screen is terrible. Bought the “Premium” iPhone 8 screen + digitizer. Didn’t expect OEM quality but it’s bad. Viewing angle is terrible (it turns white if you look at it from any angle), touch interface is all over the place and im hitting random keys when my cracked screen worked just fine. it’s significantly darker than my iPhone 7 screen as well.Shopping experience was easy and shipping was quick. Product is trash.Edit: Forgot to mention, I reached out weeks ago asking if I was given a bad screen, non-premium maybe. Never heard a word from them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2020-07-21T22:07:02.000Z",
          "Titre": "Long delivery",
          "Contenu": "I had chosen the USPS first class (3-4 days) and received my product almost 2 week later. They didn’t even notify me that the shipping was going to be delayed until I email them. A week after I place the order was when I  decided to email them, they reply back. It was along the lines of your product is now in shipment. That’s sooooo frustrating."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kris",
          "Nb_Reviews": 1,
          "Date": "2020-05-24T03:19:01.000Z",
          "Titre": "Very long arrival time without notice",
          "Contenu": "I'm only giving this a 2 because of how long the item is taking to get here. I ordered it on the 11th and on the 23rd I finally got a notice saying it was shipped. The notice said it was shipped on the 12th but remained in Florida all that time. There should be some notice that the company is experiencing these issues before ordering and making you wait so long. I can't review on the actual product yet. I will update when it arrives."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chrystal Harvey",
          "Nb_Reviews": 1,
          "Date": "2020-02-07T20:48:48.000Z",
          "Titre": "Worthless Customer Service",
          "Contenu": "I have used this company many years as a business and personal. Unfortunately I am rating a poor rating for lack of good customer service. I never received my package and the USPS even admitted to loosing it the response fro Repairpartsusa is \"its out of our control\" Seriously what kind of crap is that? Even knowing the package was lost they are not willing to help retrieve the items I purchased and wants me to repurchase them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William Goodnow",
          "Nb_Reviews": 1,
          "Date": "2021-01-28T22:48:26.000Z",
          "Titre": "No Tracking Information or response",
          "Contenu": "I ordered a iPhone 7 Plus screen and it was shipped the 19th after I had gotten ahold of customer service the first time. A week passed and I sent a email asking about the tracking information. No response. Few days later I texted and no response. It’s going to be nearly two weeks now and I got nothing. Don’t know really know what to say at this point. Just really disappointed that I have been patient and there’s nothing to show for it. I understand that Usps may be unreliable but at the same time I feel communication is important."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Er",
          "Nb_Reviews": 2,
          "Date": "2019-03-13T16:29:55.000Z",
          "Titre": "Can’t ship to address other than billing. Form is wrong.",
          "Contenu": "Their form has a check mark that asks if shipping address is different than billing address. However, they cancelled my order because they can’t ship to a different address! Why have that in your form! It wasn't /isn't fraud! It's me trying to buy a holder and have it sent directly to my Dad. Now, I have to send it here, then send it there, paying for shipping twice."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2019-07-09T07:17:31.000Z",
          "Titre": "The premium iPhone screens ARE NOT PREMIUM!",
          "Contenu": "At least in my instance with the 6s Plus. They have b grade sensitivity that gets real annoying when scrolling through videos on YouTube, misclicking on a video in the middle of a scroll, they also have a fake force touch that relies on surface area rather than pressure. Spend a little more money on a real screen that is oem spec from sites like ifixit. The prices are going to be doubled, but it’s way better than what you pay for this garbage."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julia",
          "Nb_Reviews": 1,
          "Date": "2020-02-04T22:38:38.000Z",
          "Titre": "Good service, disappointed in parts’ quality",
          "Contenu": "I ordered a screen for an iPhone and tools to change it. One screw driver was defective, so I ended up using a small knife instead of it. Eventually, I got a replacement but it took 2 extra weeks. The new screen worked great for the first week. After that time it started glitching — it wasn’t sensing the touch, first, occasionally, later, almost all the time. It’s been about a month since I change the screen. The phone is basically not usable. Will have to get a new phone I guess"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steve Ferguson",
          "Nb_Reviews": 5,
          "Date": "2020-06-08T18:41:58.000Z",
          "Titre": "Failed using the credit card payment option",
          "Contenu": "Using the credit card payment option would never complete, it would show a circling icon but never progress. After three attempts I used the PayPal payment option which was convoluted because it took me back to the order payment page after I filled out the PayPal info. Needs to be cleaned up and make it work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Allen",
          "Nb_Reviews": 1,
          "Date": "2020-06-17T19:07:51.000Z",
          "Titre": "Pretty crappy experience",
          "Contenu": "Parts were not the best when shipped to me. Had missing items from my order, my electronic parts were not shipped in proper packaging and were ruined upon delivery. Still havent recieved a refund or my missing parts. If you had another option to get parts from. I highly suggest you do find another place"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jerrod Anderson",
          "Nb_Reviews": 2,
          "Date": "2019-01-10T03:49:54.000Z",
          "Titre": "bad customer service",
          "Contenu": "A good website with product quality options + explanations of each tier. The problem is that the product quality options don't end up mattering! Got a screen that is more grey than an OEM screen and no color settings within iPhone can fix it. I contacted customer support nearly a week ago and they still haven't responded. IFixit's support responded in 23 min. Buying from there in the future even though it is slightly more expensive"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Becky",
          "Nb_Reviews": 1,
          "Date": "2021-12-07T16:42:17.000Z",
          "Titre": "Very hard to get in contact with company",
          "Contenu": "Update: I was finally able to get a response through email. Tracking number still shows no progress. Hopefully I'll eventually get my item, but not within the time frames stated on the site.I ordered a screen repair kit on a Tuesday night, and expected it to ship next day since the page showed it would ship same day for in stock items. 3 days go by and it still doesn't show shipped. I try calling, it goes to voicemail. I leave a voicemail, as well as sending a text message. No response at all. Trying an email as last resort, but thinking I may just have to dispute the order and place an order through Amazon or something. Don't trust this company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kelsey Ples",
          "Nb_Reviews": 2,
          "Date": "2018-12-05T12:52:15.000Z",
          "Titre": "Their website says same day shipping",
          "Contenu": "Their website says same day shipping, but it’s more like a week just to ship. They won’t send you the tracking number until a day before it arrives. You have to email them constantly. Ordered twice from them, same experience. Won’t do it again. Products are okay. The wiring for the IPad is flimsy. It was hard to insert the parts because they bend like crazy. The original parts are sturdy, which is why I know the difference. I don’t recommend them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 5,
          "Date": "2020-08-11T18:54:31.000Z",
          "Titre": "Bought replacement synthesizer for…",
          "Contenu": "Bought replacement synthesizer for iPhone 6plusUsed my original thumbprint button and it would no longer read my thumbprint.  Texted them twice and emailed them once but no response.  Replaced with old cracked screen and button worked properly.  Bought another one from a different supplier."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DEBRA SPEARS",
          "Nb_Reviews": 1,
          "Date": "2017-12-02T00:56:09.000Z",
          "Titre": "HAVE CALLED 4 TIMES AND NO ONE HAS …",
          "Contenu": "HAVE CALLED 4 TIMES AND NO ONE HAS CALLED ME BACK. I FINALLY GOT AHOLD OF SOMEONE AND THEY SAID THEY WOULD SEND ME AN EMAIL WITH THE RETURN INFO AND IT HAS BEEN ALMOST 2 WEEKS AND STILL NO EMAIL. I HAVES CALLED BACK AND STILL HAVE GOTTEN NO RESPONSE. I GUESS THEY ARE WAITING FOR MY 90 DAYS RETURN POLICY TO RUN OUT. I HAVE A DEFECTIVE PART AND JUST WANT TO EXCHANGE IT. ORDER NUMBER 27982"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2017-12-12T07:25:13.000Z",
          "Titre": "Not premium quality whatsoever",
          "Contenu": "The quality of the screen is good. The home button Touch ID didn’t work so I had to dissamble it and put in the old one. The screen did not fit on the of the phone case. After the assembling the phone the screen had a spot bc it is pressing on to the screen. Overall bad experience with this screen. I have used other replacements and this is the one that’s given me trouble the most."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "T. Ross",
          "Nb_Reviews": 1,
          "Date": "2017-11-17T18:15:14.000Z",
          "Titre": "Defective Screen",
          "Contenu": "I purchased a lcd and glass for an Iphone 6.  It took a lot longer than estimated for my item to arrive.  After it arrived and installed there was a light spot in the middle of the screen, which I was originally ready to deal with.  The next day that small white spot metastasized into a large black bar running from the point where the light spot started to the bottom edge of the screen. (See my profile photo)"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bob Hob",
          "Nb_Reviews": 1,
          "Date": "2019-01-05T22:54:05.000Z",
          "Titre": "Decent screen, Bad customer service",
          "Contenu": "Ordered a 7+ screen assembly. After I installed the \"premium\" screen according to them. I found that it was much more grey than the OEM ones. It makes you feel like you are colorblind when looking at your phone. I messaged support and have not heard back in the last couple of days. To sum this up. The part came working yes. But if there is a problem, customer service is important. I will be buying from IFixit in the future. (their support responded in 23 min)"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "disapointed customer",
          "Nb_Reviews": 1,
          "Date": "2017-11-20T05:22:05.000Z",
          "Titre": "Not such a great screen replacement",
          "Contenu": "The glass screen I ordered for my iphone 5 s was badly built.  One of the holes to put a screw in was completely filled in with plastic or wax.  I had to use a small screwdriver to scrape it off.  there was no place to clip in one of the metal hook.  I compared this screen with my old screen.  My old screen had a slot in which the hook cliped in.I didn't bother calling them back because I didnt wan to wait another week for the parts to come again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jace",
          "Nb_Reviews": 4,
          "Date": "2020-02-17T02:40:56.000Z",
          "Titre": "I replaced the screen on my iPhone XR…",
          "Contenu": "I replaced the screen on my iPhone XR In December and now the LED is starting to go out. The screen isn’t cracked and I keep a new case on the phone. It will not register to touch 75% of the time and when it does register touch then it does not last long. I was happy with the product until now."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sarah Kieschnick",
          "Nb_Reviews": 2,
          "Date": "2018-06-10T02:11:27.000Z",
          "Titre": "This is low quality and arrived…",
          "Contenu": "This is low quality and arrived bent,t even though i chose them because I read the brand name on the product and paid more even though there were much cheaper choices on other web sites.  I sent them a picture how it arrived and was promptly refunded the money no hassle.  Thank you for that much, but definitely not worth the money."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Keith",
          "Nb_Reviews": 1,
          "Date": "2020-02-20T20:22:30.000Z",
          "Titre": "I ordered a replacement screen fro my…Samsung S7 Edge",
          "Contenu": "I ordered a replacement screen fro my Samsung S7 Edge vs purchasing a new phone. First, the package took a week from RepairParts to Massachusetts due to shipping through Puerto Rico...ok not RP's fault. Then the item was not the same as the advertised picture. Did NOT come with the frame as described. I have spent days trying to get an answer on return or replacement and is still unresolved. Very little customer service through phone or messenger.  I am hopeful this situation can be rectified soon! I just want to fix my phone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 1,
          "Date": "2020-06-17T19:26:44.000Z",
          "Titre": "Just after I ordered I realized that…",
          "Contenu": "Just after I ordered I realized that the screen protector was broken not the glass, but company wouldn’t take it back.Yes they did offer to return it with instructions, but I only spent $25 and they wanted a $10 restocking fee and I had to pay for shipping. Wasn’t worth the time"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christian",
          "Nb_Reviews": 1,
          "Date": "2021-11-30T11:31:42.000Z",
          "Titre": "It was far too time consuming and…",
          "Contenu": "It was far too time consuming and difficult to place the order. It should not take a week to finalize an order. This company is more focused on collecting my business and personal information than meeting my parts needs."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "crystal rogers",
          "Nb_Reviews": 1,
          "Date": "2017-12-14T18:03:43.000Z",
          "Titre": "My initial order was here somewhat …",
          "Contenu": "My initial order was here somewhat quickly and was what i had ordered. Unfortunately i had ordered the wrong screen but you guys agreed if i sent this one back you would have the right one sent to me. I shipped it back and sent you the tracking number as requested, but have not heard another word. Ive emaied about 5 times no with no reply, and the first lcd screen had been delivered according to usps website. Why is no one getting back to me? i need this phone for work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2017-11-20T22:25:23.000Z",
          "Titre": "Parts arrived 2 days after original …",
          "Contenu": "Parts arrived 2 days after original shipping estimate. New part has a bit of damage to power edge of screen but isn't shattered like the old one so I installed it a new screen \"glitches\" every so often, doesn't turn off when phone up to face (yes the ambient sensors are installed correctly) and the pressure points on the screen do not work on the right side. Very frustrating. Oh yeah, and that orange suction cup doesn't auction worth a darn either."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sara Velazquez",
          "Nb_Reviews": 1,
          "Date": "2019-04-06T04:24:42.000Z",
          "Titre": "I never received my order even though…",
          "Contenu": "I never received my package and had to email the company numerous times to inquire about getting a replacement or refund. Wasnt until i wrote a negative review that i was finally contacted.  I did end up getting a full refund after numerous emails to the company. Poor customer service experience over all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "yuanheng xie",
          "Nb_Reviews": 1,
          "Date": "2019-02-07T19:53:42.000Z",
          "Titre": "faker battery capacity",
          "Contenu": "faker battery capacity, the original samsung battery is 3500mAh, but the one I bought from repair part is around 2400 mAh.By the way, the plastic repair tools are fragile, they are worse than the tools which I bring  from China.I am upset with this website, except things are cheap and the mail is fast."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stefano Andrade",
          "Nb_Reviews": 4,
          "Date": "2020-06-17T19:36:40.000Z",
          "Titre": "Poor Customer Service & Refound Process",
          "Contenu": "To be honest, I do not recommend this place. My experience was very unpleasant and very unprofessional. I bought the wrong screen for my IPhone and asked for my money back, but unfortunetly the entire process was a complete mess. Their customer service is incredibly slow and unprofessional and the value I received back was much lower than what I paid for. The screen was in perfect condition but I had to pay a fee and for the return shipping. Basically I just lost my time and money. Want a professional customer service and your money back? Do not buy from them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "unhappy customer",
          "Nb_Reviews": 1,
          "Date": "2017-12-07T13:55:32.000Z",
          "Titre": "My honest feedback I bought a product",
          "Contenu": "My honest feedback I bought a product, it was suppose to be shipped priority . Next thing I know its a week later. How about you ship based on the customer preference or take the option for them to get there product in priority shipping cause there is nothing priority about you getting me my package. Please do better !"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2017-08-17T17:32:41.000Z",
          "Titre": "Defective Part",
          "Contenu": "Received a defective LCD display for iPhone 5c.Got an RMA # and returned the LCD display.They never sent me a replacement and when I called nobody who could handle the replacement of the display would talk to me. I never got a refund and have no part. I wouldn't order from them ever again they are lousy!!!!!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2017-12-16T01:34:28.000Z",
          "Titre": "I paid for expedited",
          "Contenu": "I paid for expedited, US Mail Priority shipping at a cost of $5.99. I received a shipping confirmation that it was shipped at 12.47 PM on 12/07-2017 and actually received the item on 12/14/2017 - one full week. I called them on the 5th, 6th and 7th days after my order and NEVER got a response from them - ever."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chi",
          "Nb_Reviews": 2,
          "Date": "2020-10-12T17:20:05.000Z",
          "Titre": "Pay shipping and restocking fee for returning!",
          "Contenu": "I have to pay shipping and then get charged for re-stocking fee? Sorry we shouldn’t be charged for something we no longer needed or potentially ordered wrong part. There’s a bunch other stores that’ll offer it for free. (Of course if the unit is not damaged)"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2020-08-11T19:04:48.000Z",
          "Titre": "Smh!",
          "Contenu": "The screen i received had two white dots of the lcd on it the ear speaker didn’t work at all! And the bottom speaker its low on volume ... and at first they sent me the wrong order ... i just got tired of dealing with the shipping and waiting ! It was annoying!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "james",
          "Nb_Reviews": 1,
          "Date": "2020-07-03T19:31:55.000Z",
          "Titre": "I ordered a stylus pen for my Samsung…",
          "Contenu": "I ordered a stylus pen for my Samsung Note.  Honestly I was very disappointed in the service.  When I ordered the pen, it said in stock, but it took 3 weeks for me to receive it.  In an environment where rapid shipping wins, I'm sorry to say you lost."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Janet",
          "Nb_Reviews": 1,
          "Date": "2020-03-17T19:28:51.000Z",
          "Titre": "I ordered 2 iPhone screens",
          "Contenu": "I ordered 2 iPhone screens. They both arrived in a timely manner, however, one of the screens were defective. I made numerous calls and never got an answer. After contacting the company through email, they refused to refund me, or send me a replacement."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2017-12-02T02:11:05.000Z",
          "Titre": "I ordered my mail 8 days before I …",
          "Contenu": "I ordered my mail 8 days before I actually got it. It said it would take 3-5 days. If I would've had an explanation of why it was cancelled and was being held, I wouldn't have minded as much. Although I did like where it said it was currently at and was easy to order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2017-11-28T22:03:32.000Z",
          "Titre": "VERY upset I hadn’t to orders 2 times",
          "Contenu": "VERY upset I hadn’t to orders 2 times because my shipping and billing address are different. Seeing how we are a military family and I’m station in CA and he Stationed in FL they canceled my order... and tell this day I’m waiting for my refund from the first time I ordered"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "douglas",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T22:15:56.000Z",
          "Titre": "Took long time to fix mistake",
          "Contenu": "Ordered glass and kit for Iphone 6 and paid extra for faster shipping.  I only received the kit - no glass.  When I contact customer service it took a day or 2 to respond.  Then they sent the glass regular mail so it took around 5 days"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2017-11-29T20:28:57.000Z",
          "Titre": "Fast shipping and well pack but the new …",
          "Contenu": "Fast shipping and well pack but the new battery replacement for my iPhone 6 is not good.  The power of the battery drain like crazy.  It's worst than the old battery in my phone.  If I know the new battery is this bad, I would keep the old battery stay in my phone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2017-11-19T21:57:53.000Z",
          "Titre": "Get your “ship” together.",
          "Contenu": "Shipping said 2-3 days. Over a week later still no product. (USPS says “pre shipment”)  but got sent an email saying product shipped. Called in said he would have a new one shipped and said it would be to me within two days. 4 days after that call and still no product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "matt",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T20:52:12.000Z",
          "Titre": "I received the part which was well…",
          "Contenu": "I received the part which was well packaged and was as described. I put the screen on my phone and it is very temperamental. It works but will stop working and won’t be touch sensitive until I lock the screen and unlock it. Then it will work for a short period before it stops again.  I asked for help with the product and received a response but it told me I had to send the screen back so they could determine if it’s damaged. I understand that it could have damaged by install but unlikely.  I asked again how I would use my phone for a few weeks while this occurs and they did not respond. So I’m still here with a half working phone and no help"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Mendoza",
          "Nb_Reviews": 4,
          "Date": "2020-07-03T17:45:47.000Z",
          "Titre": "Took awhile fo a response then when I…",
          "Contenu": "Took awhile fo a response then when I wanted an order cancelled they send it out and responds 15 mins after they shipped item and when I ask to return 15% restocking fee. Just a way for them to make money horrible and slow customer service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Timothy P. Ashmore",
          "Nb_Reviews": 1,
          "Date": "2021-11-23T16:10:20.000Z",
          "Titre": "Quality of regarding anything they sell…",
          "Contenu": "Quality of regarding anything they sell has gone downhill. Getting ahold of customer service is a nightmare (nobody picks up or calls back), it feels like they do not care about you as a customer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dera",
          "Nb_Reviews": 1,
          "Date": "2019-01-19T20:11:35.000Z",
          "Titre": "iPhone 7 plus screen with small parts",
          "Contenu": "I bought this screen with small parts, but the front camera doesn't work and the screen has a purple spot that is very clear when you have a with background. I install the old camera and works fine, but the new ear speaker doesn't work with the old connection so I had to install the new camera and with that the ear speaker works fine but the camera still doesn't work at all. I send an e-mail about this problem, but they never respond, the only e-mail that I have from them is when the item was shipped, after that they basically don't care about the damaged item that they sold to me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Keundre Russell",
          "Nb_Reviews": 1,
          "Date": "2019-09-10T13:20:32.000Z",
          "Titre": "Worst company ever",
          "Contenu": "At first I felt good about the company with my first order. But when I ordered 2 more times they never showed up I want my money back I will file a suit against you all this is ridiculous I’ve called and sent emails and still don’t have my package"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephanie Charles",
          "Nb_Reviews": 1,
          "Date": "2019-01-03T18:52:58.000Z",
          "Titre": "I placed an order about a month ago and…",
          "Contenu": "I placed an order about a month ago and I am still waiting for someone to answer the phones and email about my purchase. I will never order from here again. They're good with taking and shipping out orders fast but their customer service is horrible"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Francisco Hernandez",
          "Nb_Reviews": 2,
          "Date": "2020-10-08T04:40:14.000Z",
          "Titre": "Screen replacEment - Power draining and inaccurate",
          "Contenu": "UPDATED From google: screen sensitivity is much lower and often inaccurate; power consumption from screen has increased, and even shut my phone off because it “couldn't maintain power to screen”; and my phone has been getting hot faster. I’ll update again with a second update after replacing this screen again.Ordered online for a screen and new battery, for my girlfriend’s iPhone 7 Plus.I initially ordered for the wrong model of iPhone and within 24hrs their customer support refunded and cancelled my order, so that I could re-order the correct parts. P.S. Thank you!The replacement screen and battery were to spec.3 outta 10, will order again and recommend."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alana",
          "Nb_Reviews": 1,
          "Date": "2017-08-25T21:34:35.000Z",
          "Titre": "I was out of town and couldn't get parts.",
          "Contenu": "I was out of town for about a month and my phone broke and I couldn't get the parts because the shipping had to have the same address as the billing but I couldn't bill to that address because it didn't match my card...... poor system."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lucas",
          "Nb_Reviews": 1,
          "Date": "2020-10-20T00:01:06.000Z",
          "Titre": "Galaxy S7 Charging Port Cable",
          "Contenu": "I ordered a replacement charging port cable for my Samsung Galaxy S7 at a great price, and Repairpartsusa was very gracious to combine that order with another so that I'd only incur one shipping charge. The item came promptly and seemed to be in good condition, but upon installation it turned out my phone could no longer connect to the cell network, and the part needed to be replaced again. I was short on time so just had a repair shop use one in their inventory, so I don't know if I could've had repairpartsusa issue a functioning replacement. My experience with them was seamless and their prices are affordable, but a defective part rendered the overall experience negative."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott Elliott",
          "Nb_Reviews": 1,
          "Date": "2018-01-08T21:06:56.000Z",
          "Titre": "Decent Products but zero customer service.",
          "Contenu": "Have made two different orders with them. 1 defective part in each order. I work in the phone repair industry and know it happens, no big deal. My main issue is with lack of customer and service poor website design.My second order was split up and delayed considerably because they were out of a screen, they took 10% off order which I appreciated.  I am unable to select the items on the website to initiate an RMA. Additionally, despite calling 5+times over the last 4 weeks and sending an email 4 days ago, I have had ZERO contact. Very frustrated with their poor RMA process on their website and poor customer service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Melissa Batterson",
          "Nb_Reviews": 2,
          "Date": "2020-07-19T23:03:38.000Z",
          "Titre": "Very disappointed with not hearing…",
          "Contenu": "Very disappointed with not hearing anything on my purchase for 8 days! Then get a email with shipping information. However said I would have my item in 2 to 7 days.... but here we are 9 days later no iphone screen..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Melissa Filipowski",
          "Nb_Reviews": 1,
          "Date": "2019-06-08T21:43:27.000Z",
          "Titre": "Got the s pen quickly, tip cheap n broke upon removal",
          "Contenu": "Got the s pen quickly,  the tip was terrible.  Went to remove and put a new one in and it broke. Can't remove the entire tip. Ready to throw it in trash. I'd just make sure the tips can be removed easily before shipping."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2017-12-18T14:01:56.000Z",
          "Titre": "I ordered a screen and it broke 2 days …",
          "Contenu": "I ordered a screen and it broke 2 days later by dropping a penny on it through a screen protector called and they refused to replace it due to a 1/16 of an ounce coin hitting it from 2 feet. Order an Apple screen they’re built better."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2017-10-30T17:37:11.000Z",
          "Titre": "Ordered replacement screen and paid for …",
          "Contenu": "Ordered replacement screen and paid for 2 day shipping, tracking number was produced but never shipped, after 5 days left voicemail with concerns with no call back, then item finally shipped and received item 9 days from order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris Roesner",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T03:37:08.000Z",
          "Titre": "BUYERS BEWARE, False advertising and bad parts..",
          "Contenu": "BUYERS BEWARE: False advertising, screen is not fully functional.. Although it says they same day if ordered before 4pm.. They do not... Took them 5 days to drop off my part to the post office and my screen a week to get here.. I got my part today so I took the screen and my phone to a professional repair shop to have it fixed.. Paid the installment fee and waited... Screen looks ok but it has a dead spot on the left side of the digitizer above the letter A.. Faulty screen.. Now I'm still stuck with a broke phone after waiting a week for the parts to arrive.. I tried contacting customer care to have them send a replacement over night and I still haven't heard anything back...  These people are a joke.. This is my first time doing business with this company and definitely my last... 🙄😒"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Delbert Johnson",
          "Nb_Reviews": 1,
          "Date": "2020-06-21T13:23:24.000Z",
          "Titre": "Today (Sunday) I was asked to write a…",
          "Contenu": "Today (Sunday) I was asked to write a review off Repairpartsusa.  I haven't received the order yet so my review is based on the promptness of getting orders out.  I ordered the parts last Sunday, received a tracking number on Monday but, based on the tracking information, the carrier did not receive the item for shipment until Thursday.  So now I'm asked to write a review and, if they checked the tracking information, they would know that I won't receive the product until Monday and therefore I can not provide a full review.  I'm rating them with 2 stars because they were too slow in shipping.  I realize that there can be many contributing factors, that I'm not aware of, but that is all I have to base my review."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "XINYU DAI",
          "Nb_Reviews": 2,
          "Date": "2021-07-06T20:39:41.000Z",
          "Titre": "I placed the order 2 times to get the product",
          "Contenu": "I got to place 2 orders to get the product. The first one didn’t make to my house. It went back to the warehouse. And I got charged a 15% stocking fee? I wanted the product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nichelle Lee",
          "Nb_Reviews": 1,
          "Date": "2020-06-17T13:37:42.000Z",
          "Titre": "Terrible...just terrible",
          "Contenu": "First and foremost the products are amazing.  They are great quality. HOWEVER!!! My second order, I paid for and they never shipped it until I emailed them.  It had been a week and a half and I had not received a tracking number. Once i emailed, then they shipped my order out. Secondly, I returned an item.  Same box, same packaging, never even took it out but was charged a restocking fee of 15% and had to pay for my own shipping.  Lastly, and most important, I am pretty sure they were not worried about giving me back my refund (which was barely anything after considering shipping charges and “restocking fee”) until I emailed, AGAIN! They received my item on the 5th. I emailed them on the 16th and had to ask for the whereabouts before any action was taken. Terrible."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Patrick T",
          "Nb_Reviews": 1,
          "Date": "2021-01-06T23:35:01.000Z",
          "Titre": "Screen was thicker than an oem screen",
          "Contenu": "Screen was thicker than an oem screen. Wouldnt align with the body of the phone and after i Installed it correctly, theres issues with touch sensitivity. I probably just got a lemon."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "jasper",
          "Nb_Reviews": 1,
          "Date": "2021-01-22T22:06:13.000Z",
          "Titre": "The screen worked great for about a…",
          "Contenu": "The screen worked great for about a week and then sometimes it would go crazy and toucj in spots you weren’t touching and if you tried to swipe it would go crazy. Wouldn’t recommend"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Darien",
          "Nb_Reviews": 1,
          "Date": "2020-01-15T05:31:34.000Z",
          "Titre": "Order screen and after waiting almost a…",
          "Contenu": "Order screen and after waiting almost a full week and not receiving anything  text company and had to complain before got any action took another 4 days to get only 11 days for 2 day shipping"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stefan",
          "Nb_Reviews": 1,
          "Date": "2017-08-17T16:36:39.000Z",
          "Titre": "First screen we got was bad",
          "Contenu": "First screen we got was bad. Could not get a replacement on it after weeks of waiting, the customer left us mad with a broken Ipad. Would have been nice to have someone keep us updated on the situation."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carlos",
          "Nb_Reviews": 2,
          "Date": "2017-08-26T12:13:27.000Z",
          "Titre": "I tried to exchange a merchandise I buy …",
          "Contenu": "I tried to exchange a merchandise I buy from you, but you didn't help me, didn't answer me, if you want that I change my qualification let me kno because I still need exchange it. Thank you!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eileen",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T14:55:07.000Z",
          "Titre": "You sent me the wrong s-pen for my…",
          "Contenu": "You sent me the wrong s-pen for my Galaxy 10 Plus smartphone. There was no way to contact you in order to return it for the right one. Your phone and email service were dead ends."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carol M",
          "Nb_Reviews": 1,
          "Date": "2019-11-24T03:58:43.000Z",
          "Titre": "I had a hard time with submitting…",
          "Contenu": "I had a hard time with submitting order.  But after 6 tries I received a confirmation that order went through.  Looks like a good quality S Pen.  Looking forward to receiving it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jenna Rain Lunato",
          "Nb_Reviews": 1,
          "Date": "2019-09-04T23:27:02.000Z",
          "Titre": "The Price Was Too Good To Be True",
          "Contenu": "Received my tempered glass screen protector for my Galaxy S10+ yesterday after 5pm. It arrived relatively fast, hence the 2 star rating. I cleansed my screen, followed the steps, and applied the screen protector. At first, it was wonderful. Full coverage, the whole nine yards. Then just now, it has up and fallen right off of my cellphone. The ONLY adhesive on this screen protector is right around the edges and around the rim of the hole for the fingerprint scanner. The remainder of the screen protector is bare, therefore not adhering to the cell phone. On top of that, the protector itself does not sit snug against the phones screen whatsoever, making connection from your fingertips to the screen nearly impossible. Long story short, it was too good to be true for the super low price, I should have known better. Lesson learned."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Evan",
          "Nb_Reviews": 2,
          "Date": "2017-12-01T04:16:35.000Z",
          "Titre": "The home button didn’t even sit right …",
          "Contenu": "The home button didn’t even sit right in the replacement screen I ordered so I’m sure I could have sent it back and waited another week without a phone...but I don’t have time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amanda Koeppel (customer)",
          "Nb_Reviews": 1,
          "Date": "2018-01-06T22:08:26.000Z",
          "Titre": "Not saying boycott, but buyers beware!",
          "Contenu": "The first screen they sent was defective, which happens, no big deal, what keeps them from getting five stars is, before I even sent it back for them to inspect, they implied that I broke the screen,  essentially calling me a liar,  then made me pay for the shipping back.  Their return policy really needs to be  reconsidered.  On top of all this the fact that they couldn’t be bothered, (FOR TEN DAYS) to confirm that they had received the broken screen after I paid to have it shipped back to them, emailed them multiple times, and nearly bought a new one from another company, really irritated me,  So to make a long story short I am fine with the products of this place but not the customer service. Can’t say I would recommend, but if they had something I couldn’t find elsewhere I would buy from them again, if I had to."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2017-10-09T17:41:01.000Z",
          "Titre": "You need to change the way you ship",
          "Contenu": "You need to change the way you ship your products.The site says it would take 2-3 days but in reality it’s about a week or 2. Overall I  would like the shipping to be faster."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jerry",
          "Nb_Reviews": 1,
          "Date": "2017-08-17T17:32:57.000Z",
          "Titre": "I ordered a part and it took weeks to …",
          "Contenu": "I ordered a part and it took weeks to get here, even after multiple unanswered phone calls and emails. The reason for 2 stars is that the part did work when I finally got it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jesus Campos",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T13:22:56.000Z",
          "Titre": "I order a iPhone 11 screen and battery…",
          "Contenu": "I order a iPhone 11 screen and battery but need shown up i usually order my screen from but this time it didn’t shown"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Danny",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T05:45:28.000Z",
          "Titre": "iPhone 13 mini hard OLED display is…",
          "Contenu": "iPhone 13 mini hard OLED display is decent for 60 bucks. But the colors are washed out significantly compared to OEM, the notch at the top is MUCH wider to the point where you could tell this is a knockoff display within a second of seeing it (cuts off part of signal bars and location icon) Also registers double taps when I’m typing when OEM would not. But for 1/4 the price you can’t really complain too much."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Don Cosens",
          "Nb_Reviews": 1,
          "Date": "2022-11-26T02:52:09.000Z",
          "Titre": "Great service, product just OK",
          "Contenu": "Fantastic service and product arrived quicker than expected. The issue I have is with the quality of the part (IPhone replacement LCD). There is severe LED light bleed from the lower right side. I am not sure if I received a bad part but in no way is this the quality of the original. It will get the job done but with noticeable degradation in image quality. Haptic response is good and the part came with all tools needed for replacement."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sherry",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T10:30:03.000Z",
          "Titre": "So far Okay",
          "Contenu": "The received SE replacement screen has some issues.  However, customer service is working to remedy this case. Therefore my review is neutral at this time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "dodgers1133",
          "Nb_Reviews": 6,
          "Date": "2022-12-09T07:21:24.000Z",
          "Titre": "Late shipping and bad customer service",
          "Contenu": "Shipment was over one week late with 2 day FedEx shipment. When my shipment arrived one part was back ordered but no communication was made by email or text of the information. I sent an email with my concerns and no email was ever replied or acknowledged. Been a loyal customer for many years and was very disappointed with this experience. I was disappointed because my customer was the one also had to experience delays and put my reputation at risk. I will continue to be a loyal customer but the entire ordering process was not acceptable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Horny",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T00:46:07.000Z",
          "Titre": "Its ok so far",
          "Contenu": "I was expecting so far for great quality but seem like the screen is fair condition as so many after market parts out there!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "M. Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-01-02T17:45:44.000Z",
          "Titre": "Discount code confusion",
          "Contenu": "I couldn’t find the place to enter a discount code, and sent a message asking about it.  Waited a few days but didn’t get a reply.  Finally placed my order without the discount.  Otherwise the experience was good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas Massey",
          "Nb_Reviews": 2,
          "Date": "2023-03-12T00:32:26.000Z",
          "Titre": "The parts seem okay but I was not even…",
          "Contenu": "The parts seem okay but I was not even able to take my phone apart because the tool kit that I received is so cheap, that it would not even take the screws out.   The tool kit is junk and now I need a new tool kit just to install the parts in my phone"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Emiliano Rogue",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T02:21:41.000Z",
          "Titre": "the screen has a slight defect the left…",
          "Contenu": "the screen has a slight defect the left side of the screen does not respond to touch i might have to order another one"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Zackary",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T19:30:59.000Z",
          "Titre": "The screen worked well the tools are a…",
          "Contenu": "The screen worked well the tools are a joke the pentalobe screwdriver stripped out before I got the screws out had to get another to get screws out"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christopher Kurz",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T18:36:22.000Z",
          "Titre": "slow delivery",
          "Contenu": "Shipping label printed 1 week before the items shipped.  Items were fine, just don't tell me my order is on its way then wait a week to take it to the post office."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Letersky",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T17:10:04.000Z",
          "Titre": "It is hard for me to give a review when…",
          "Contenu": "It is hard for me to give a review when I havn't recived my order yet. I usually give better reviews after I've used what I ordered some."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tyleasha Pettway",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T07:28:28.000Z",
          "Titre": "I enjoyed receiving product in the past but my previous purchase didn't go so well.",
          "Contenu": "I enjoyed receiving product. Unfortunately,I was unable to receive some reasonable compensation or assistance due to item not being properly delivered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Abby",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T22:30:00.000Z",
          "Titre": "Affordable screen protectors for cell…",
          "Contenu": "Affordable screen protectors for cell phones just wasnt the correct one for my phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-03-08T22:20:40.000Z",
          "Titre": "Wrong part",
          "Contenu": "Don't understand why I have to pay a re-shipping fee. I paid the postage to return to you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alex L.",
          "Nb_Reviews": 2,
          "Date": "2022-12-29T18:55:10.000Z",
          "Titre": "The kit was pretty sub par, the battery seems oke",
          "Contenu": "The kit was pretty sub par. The suction cup was not holding at all. I had to scrumble to get one elsewhere. I apparently needed tweesers, which were not there"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Collins",
          "Nb_Reviews": 1,
          "Date": "2022-11-13T01:52:27.000Z",
          "Titre": "Paid for overnight. Took 4 days",
          "Contenu": "S pen is great. However. Paid for overnight delivery it took 4 days to receive it. Oh wellI guess I'm out $35 for thatOvernight delivery."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "keith burton",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T18:56:47.000Z",
          "Titre": "its good i love it there fast and good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Atkins Stang",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T14:41:12.000Z",
          "Titre": "Shipping costs were way too high",
          "Contenu": "Shipping costs were way too high. Our company ships small items all over and we never have the kind of shipping costs that were charged to us. Also, I paid for 2 to 3 day USPS and my item took a week to get here. 5 business days and 1 Saturday. Totally unacceptable. (Especially for the shipping costs.) The part was fine, ordering wasn't too difficult but improvements in the distribution area of your company is definitely needed. To answer their reply: RepairPartsUSA claimed they shipped on Monday. The shipment wasn't sent until October 11th (even per their email confirmation) which was TUESDAY. The shipment arrived on Friday, October 14th. And yes, I agreed to and paid for '2 to 3 days shipping' but that is NOT what I got. If I am going to pay the higher shipping fees, I expect the item to arrive as promised."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rose Caman",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T19:54:57.000Z",
          "Titre": "The item didn’t fit my phone",
          "Contenu": "The item didn’t fit my phone.  It should of been a 12proMax covering"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "EdgarSingle",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T03:41:52.000Z",
          "Titre": "Not bad at all",
          "Contenu": "I have purchased from them in the past. I bought an iphone 7 screen replacement and it came out to be really good reason why i bought an i phone 8 plus screen replacement but this one came out bad, i sent it back and hoping for a refund. But over all pretty good"
        },
        {
          "Note": 3,
          "Lieu": "GY",
          "Pseudo": "nathan farley",
          "Nb_Reviews": 1,
          "Date": "2022-08-31T19:19:57.000Z",
          "Titre": "I order a note 10+ display without…",
          "Contenu": "I order a note 10+ display without frame it took 2 weeks to arrive and when it did it came with frameAnd the frame came with a fake liquid cooling chamber inside which caused the phone to over heat however after installing the necessary parts everything had been working fine so far including finger print scanner"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "HOLLIS A WILKINS",
          "Nb_Reviews": 2,
          "Date": "2022-09-11T03:37:41.000Z",
          "Titre": "The screen is great tools are junk",
          "Contenu": "The screen is great. Have bought so many screens for friends phones and my own. But my tools have worn out over the years. Bought the premium ones and they were so poorly made. They stripped out on the first screw. So I had to use an Ifixit tool set."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T14:50:30.000Z",
          "Titre": "Purchase and shipping was great",
          "Contenu": "Purchase and shipping was great. I installed the new part and it worked fine the first day, and then it's had problems since. Screen won't stay on and doesn't work well."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve Thompson",
          "Nb_Reviews": 2,
          "Date": "2021-06-05T20:58:04.000Z",
          "Titre": "At times these guys are 4 star",
          "Contenu": "At times these guys are 4 star - you just never know. Twice I’ve gotten the right parts, on time. Yesterday I got one correct part and one incorrect - they did send a return shipping label quickly for the incorrect part, but I’m still waiting for the replacement part. They have also refused to fulfill their warranty promise on one occasion."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wa Gee",
          "Nb_Reviews": 1,
          "Date": "2021-04-09T05:21:10.000Z",
          "Titre": "Batch I ordered every screen came with a defect",
          "Contenu": "For a while the screens I've been getting were fine no issues but now they are faulty... 1) the screen came with one of the flex cables cut & with a #9 on it 2) with the last batch I received every screen came with a defect, whether it was lines on the screen, jump screens, home button dysfunctional after replacements, stuck screens, already used screens etc... & now I'm assuming bc I want a refund I don't get a response back now"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TAI",
          "Nb_Reviews": 3,
          "Date": "2021-07-07T19:20:23.000Z",
          "Titre": "I ordered & received a replacement…",
          "Contenu": "I ordered & received a replacement battery kit for my iphone 11. The order was shipped promptly, however the included tool kit did not include the proper jewelers screwdriver to remove the battery screws. I submitted an RMA, and soon after received a return label. I had to pay return postage and a 15% restocking fee. After several follow-ups via voicemail & email, I received my refund. Overall I'm not too happy, but I will say if the proper tool had been included it would've been an overall good value."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maria",
          "Nb_Reviews": 1,
          "Date": "2020-10-15T16:52:32.000Z",
          "Titre": "I have ordered multiple products from…",
          "Contenu": "I have ordered multiple products from this website since years back, the products are not the highest quality but you cant complain for the price. My last order was a screen that did not function, and I will say, thier customer service is good, they respond in time give you directions and solutions to your problem. Overall I'd say its a decent website to order your phone products from."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2020-07-22T21:50:04.000Z",
          "Titre": "long wait for right item",
          "Contenu": "I ordered and was accidentally sent the wrong item, they supplied a return shipping label and I sent it back... It took an additional 3 weeks to send me the correct item, and I was not given any notice or information until I reached out to them after 2 and a half weeks.I did get the correct item a month after receiving the first item, just wished there was better communication when errors happen."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jamel",
          "Nb_Reviews": 1,
          "Date": "2020-07-03T17:50:25.000Z",
          "Titre": "Bad customer service.",
          "Contenu": "It’s an alright screen. I replaced it perfectly and my phone screen was not turning on. I made sure the one was on my testing the ringer so I knew it worked. I emailed the seller and said the screen didn’t work and they never replied. Two days later I randomly check my phone and it working. Don’t know what the issue is there but atleast it’s working."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 3,
          "Date": "2020-03-25T00:32:13.000Z",
          "Titre": "They are ok",
          "Contenu": "They are ok, I ordered the wrong screen and sent it back on my own dime so they dont offer free return shipping which is a bonus weather it's your fault or theres because mistakes do happen. It took longer for them to send the right screen back to me than it did for the first screen that was wrong, so I wasnt real impressed with that. They are fair priced I guess though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alok",
          "Nb_Reviews": 3,
          "Date": "2020-06-17T19:04:00.000Z",
          "Titre": "Bad quality product",
          "Contenu": "The product I received was of inferior quality. Did not seem to fit my device well. It was the home button for iPhone 7. It was also defective and did not work after installation.The website customer service is responsive and answer questions quickly. That's why I give them 3 stars. I might have just got unlucky with a bad product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2020-02-13T23:19:38.000Z",
          "Titre": "The website stated same day shipping…",
          "Contenu": "The website stated same day shipping before 5:00 pm, however my order did not ship for 2 days.  An incorrect component was sent and I had to return it.  The correct replacement part was shipped back to me after they had confirmed receipt of the part that I had sent back, which took a couple of days.  The reason for a 3 star rating rather than a 4-5 star rating is due to the fact that it took nearly 2 weeks for me to receive the correct part."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ger Miller",
          "Nb_Reviews": 2,
          "Date": "2020-04-23T21:56:29.000Z",
          "Titre": "Surprised delivery",
          "Contenu": "Surprised delivery, but NO feedback of when the part was packaged/shipped. After I tried to get any response the package came after 5 days from when I ordered it.I'd give it a standard 3 stars for \"rate service\" comment.  I give it 5 stars for the actual Iphone 6 screen repair part as that fit perfect as I did the repair."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2020-03-13T15:08:02.000Z",
          "Titre": "Bought an iPhone screen",
          "Contenu": "Bought an iPhone screen. Installed it. Works fine. No fingerprint id function but never used it anyway. Probably only an Apple screen would have that  functionality and no aftermarket screen would. Same day as order shipping is odd. I received two emails and one said item was shipped same as order day but the other said it was shipped the next day. Item was received soon enough anyway. Seems to be good products with decent service. I would purchase here again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hilary",
          "Nb_Reviews": 1,
          "Date": "2020-07-30T05:52:39.000Z",
          "Titre": "The only issue I had was that because I…",
          "Contenu": "The only issue I had was that because I made a mistake and left the shipping address the same as the billing address, it went to my parents house instead....(obviously my fault)...but I emailed you guys trying to change it to my apt address and I never got a response. I may have been too late and it was already shipped, and that’s also my fault, I know. But, I would have liked an e-mail response even if that was the case. Other than that, they arrived quickly, and the products were all good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Billy",
          "Nb_Reviews": 1,
          "Date": "2020-03-13T23:29:38.000Z",
          "Titre": "Would have gave 5 Stars but sent wrong…",
          "Contenu": "Would have gave 5 Stars but sent wrong battery. Ordered a iPhone 5S Battery and they sent a 5C battery instead and someone took felt pen to battery box that it came in and wrote S over the C and you could clearly see the C thru the S that they wrote over. Sent them photo of it and it clearly was evident so they sent me the right one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AR",
          "Nb_Reviews": 2,
          "Date": "2020-06-03T19:34:30.000Z",
          "Titre": "Cheap Tools and colors are off but...",
          "Contenu": "Ordered tools and screen replacement and one of the screwdrivers stripped a screw- cheap tool.  They replaced the screwdriver and we were able to continue with the screen replacement.  The colors just aren't the same so this is not comparable to an OEM part.  But it works otherwise.  You get what you pay for I guess."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nathan LonVelin",
          "Nb_Reviews": 1,
          "Date": "2021-02-06T01:05:06.000Z",
          "Titre": "The iPhone 11 Pro Max screen…",
          "Contenu": "The iPhone 11 Pro Max screen replacement with tool kit is not oem. It has a weird blue tint to it and makes all the colors on your screen look different. Blue colors look purple. It is 4K but I prefer the factory screen better. Some areas on the screen don’t work some times. Just saying."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Caleb Hathcock",
          "Nb_Reviews": 1,
          "Date": "2020-09-14T01:18:02.000Z",
          "Titre": "I have bought from them multiple times…",
          "Contenu": "I have bought from them multiple times but they always take a long time to ship my orders. This last order it took a whole week for them to even ship it but normally it takes 3-4 days for them to ship it (ship not how long it takes usps to take it to me just how long it takes for them to give it to usps)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Severance",
          "Nb_Reviews": 3,
          "Date": "2020-02-05T17:17:52.000Z",
          "Titre": "I ordered parts and tools to fix a…",
          "Contenu": "I ordered parts and tools to fix a broken Iphone 7 screen.  The customer service was fast and reliable.  I am rating them at a 3 star due to the fact that their website stated that they have same day shipping for orders over $30.  My order was over $30 and it did not ship until days after my order.  Also, the replacement screen that I received initially was incorrect and had to send the part back.  It took nearly 2 weeks from the time of ordering to get the correct screen."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Moussa",
          "Nb_Reviews": 1,
          "Date": "2020-11-06T06:06:34.000Z",
          "Titre": "Great price , battery discharging",
          "Contenu": "I received the battery and it has been installed, the battery works fine no issues,I am very impressed how timely the delivery was. And the service The company provide.Recently the battery started to discharge at a faster pace, I am concerned how the battery does not hold the charge any more ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rebecca Lintemuth",
          "Nb_Reviews": 1,
          "Date": "2018-12-10T12:57:08.000Z",
          "Titre": "I really like ordering from…",
          "Contenu": "I really like ordering from Repairpartsusa - easy to use site and great products. But their lifetime warranty is questionable. I tried returning a product for fitment issues and was contacted shortly after. However, after a few message back and forth with customer service, they stopped replying. So I was not given lifetime warranty and unable to return my product - not even an exchange for a new one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jenna",
          "Nb_Reviews": 1,
          "Date": "2020-07-03T18:20:51.000Z",
          "Titre": "Delayed shipping and overall confusion",
          "Contenu": "After ordering, I had a few weeks with no communication or shipping date. When I reached out they offered me a refund or to wait. They said they didn't have what I wanted in stock and were waiting on a backordered shipment from China. Since I needed the item I waited. When it was listed for delivery, it was listed as a cheaper item that looks the same but had fewer functionalities. When I recieved the item though, it was the correct one. Overall, a headache but I got what I wanted even though it took a while."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JGP",
          "Nb_Reviews": 2,
          "Date": "2021-07-11T22:51:17.000Z",
          "Titre": "Initially shipped me the wrong item",
          "Contenu": "Initially shipped me the wrong item.  When I shipped it back, it took about 2 weeks to receive the correct item in the mail.  And, it was difficult to communicate with customer service to get the issue resolved.  However, the issue was eventually resolved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Claudia Aguilar",
          "Nb_Reviews": 1,
          "Date": "2019-03-06T18:26:49.000Z",
          "Titre": "Average",
          "Contenu": "I ordered a screen for an iPhone 8 Plus, it’s okay, doesn’t respond to touch sometimes. The screen protector for it is good, but the screen protector I ordered for a galaxy note 9 broke right away & it only has adhesive on the edges, & the repair kit for phones is not good, they wear off quick even before you finish taking a phone apart."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Angel",
          "Nb_Reviews": 1,
          "Date": "2020-07-21T22:24:28.000Z",
          "Titre": "Purchasing is standard/easy",
          "Contenu": "Purchasing is standard/easy. You find your product, add to cart, enter information and purchase. Customer service is good. They are quick to reply and help with any issues but the parts aren’t all that great in quality(or at least what I purchased). I purchased a screen and the home button would not work with it and it had two weird holes close to the home button, one on each side. Shopping is easy and customer service is good but the faulty product and no cash back or product replacement sets me in the middle with 3/5 stars."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brandon Bailey",
          "Nb_Reviews": 2,
          "Date": "2017-12-28T23:27:10.000Z",
          "Titre": "Here I am again!",
          "Contenu": "Here I am again!! My defective screen was sent back and when they received it I was to get a phone call (they don't call you) and or an email (takes days to receive) to replace the defective screen with a better one. I feel as if I was robbed at this point now. No communication!! Do not buy from this place!!!Update *** I was refunded my money but this company really needs to work on customer service"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason Lee Jeffers Sr",
          "Nb_Reviews": 5,
          "Date": "2020-09-17T15:30:03.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good. Only placed the order will update once completed order. I will say though I was denied a wholesale account on no basis. I have a valid ein and I do repairs so I’m not sure what the issue was. It’s cool they had my part but I guess I’ll keep buying where I been buying."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Talya",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T18:08:18.000Z",
          "Titre": "I returned my item about 2-3 weeks ago…",
          "Contenu": "I returned my item about 2-3 weeks ago now. I still haven’t gotten a refund. When I reached out to the company no one got back with me and I had to reach out again where the lady immediately responded to my text. The lack of communication and customer service needs to be improved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marissa",
          "Nb_Reviews": 1,
          "Date": "2020-08-12T02:32:20.000Z",
          "Titre": "Good products but extremely hard to get…",
          "Contenu": "Good products but extremely hard to get ahold of. I called for 3 days straight multiple times to cancel an order. Replied to the email and texted. Then finally got ahold of them to find out it was already shipped. Then had to pay a restocking fee. Good products. Bad customer service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Isabel",
          "Nb_Reviews": 1,
          "Date": "2021-01-02T00:05:25.000Z",
          "Titre": "IPhone 11 Pro Replacement Screen",
          "Contenu": "Super fast shipping (came the day after I ordered) but the screen is NOT face ID compatible. Not sure if this is intentional but it is not advertised on the website. IPhone 11 Pro Premium Black Soft OLED And Digitizer Glass Screen ReplacementCODE:I11PRO-PREM-SCREEN"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2020-06-30T09:38:46.000Z",
          "Titre": "I may give them a second chance..",
          "Contenu": "They said they shipped my screen replacement 6/1 but never received a tracking number. Tried calling,  tried email with no response. It's now 6/18 and still no product. . Update: although it took 1 month after writing a review on here they sent what I ordered and it came quickly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2020-06-17T20:58:12.000Z",
          "Titre": "Good product... snail mail slow shipping",
          "Contenu": "I can understand the issues that COVID-19 might have with shipping, however, your site mentioned rapid delivery of your product. All other items sent via USPS that I have ordered elsewhere arrived within 2 to 5 days. Your product was 2 weeks or longer. Therefore a rating of 3."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alexander",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T02:06:02.000Z",
          "Titre": "Works well enough for the price",
          "Contenu": "Shipping was timely. Screen was fine, had a digitizer/touch response issue on the top after I installed it but otherwise works well enough.I would have gone for the higher quality option offered if I were to order again from this company"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mjh-oboro",
          "Nb_Reviews": 1,
          "Date": "2017-11-30T00:07:50.000Z",
          "Titre": "Slow shipping. But they resolved it.",
          "Contenu": "Received everything I ordered as advertised. They were a bit slow on shipping. It took about a week for any notification to show up saying that my item shipped, then USPS never actually received the item from them. When I inquired they re-shipped the item and refunded my shipping cost,  so that was good of them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "anfbj",
          "Nb_Reviews": 1,
          "Date": "2021-12-07T15:42:48.000Z",
          "Titre": "I wish their was a way to give a 2.7 rating...",
          "Contenu": "I wish their was a way to give a 2.7 as a rating but I cannot. First of all, I would like to thanks the people at RepairPartsUSA for adding a free tool kit after I forgot to add it to my order. Secondly, the shipping took longer than stated but I understand why it took longer than usual due to the holidays + their wholesale shipping process. I'm not mad at that. I am upset about the quality of the screen I ordered. Not only is the screen a tad bit thicker than the original apple screen but its also super glitchy. Without me touching it the screen will just move around and its very annoying. I want to go through the refund process but i do not know where to start. Please help resolve this issue."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "elizabeth santiago",
          "Nb_Reviews": 1,
          "Date": "2018-12-22T02:06:40.000Z",
          "Titre": "Not bad",
          "Contenu": "Not bad. However, the stylus wS not original as stated. It scratches the glass surface, when removed from the portal, I don't get the warning sign that the pen is missing. So I don't think it is original but it will do untill I get the real thing. Thank you anyway for fast delivery."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Erika",
          "Nb_Reviews": 1,
          "Date": "2020-03-12T17:48:21.000Z",
          "Titre": "My reason for not giving a 5 star is…",
          "Contenu": "My reason for not giving a 5 star is because I had Issues with a part and communication was not good. I had a screen that was defective; I had to go get the phone fixed either way. Another part I ordered was not shipped and they wrote on a piece of paper that it was out of stock. I had to ask if I was going to get a refund first which they then said, the part will be shipped once they get some shipped to them. I have not received any update on the part being shipped or getting a replacement or refund for the defective screen. Other than that, everything else was great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James H.",
          "Nb_Reviews": 1,
          "Date": "2018-11-10T04:36:44.000Z",
          "Titre": "I ordered two day shipping and the part…",
          "Contenu": "I ordered two day shipping and the part has still not arrived even though they stated it was shipped Monday, I have made repeated attempts to contact the company to no avail. ABSENT CUSTOMER SERVICE.Edit: Good condition part arrived 2 days late. Still no response from customer service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 1,
          "Date": "2020-07-04T01:02:17.000Z",
          "Titre": "Site was easy to use & order from",
          "Contenu": "Site was easy to use & order fromFirst order reported my CC was declinedSecond order reported my CC was declined againSecond order I received email that it was being shippedI emailed to cancel other orderReceived email other order shipped Now have 2"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Db",
          "Nb_Reviews": 1,
          "Date": "2019-10-09T20:23:59.000Z",
          "Titre": "Not Zero customer service",
          "Contenu": "Update: After this review, I sent another email and they informed me my items had shipped two days ago. That's great, and I've added a star. If they can fix their notifications, or make it possible to see the status of an order, that would be ideal. I placed two orders last week, and they have yet to ship them. I've emailed and called during their business hours, but so far no luck. I'm hoping the products aren't as bad as their service. I was glad to read the good comments about their customer service - maybe there is hope, and this business isn't a scam."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alan",
          "Nb_Reviews": 1,
          "Date": "2020-01-13T21:12:13.000Z",
          "Titre": "Good company",
          "Contenu": "Good company. But wish they would last longer have gone through 3 screens in the last months and this last time I bought the screen protector and after dropping it the actual screen was cracked not Bebe the protector cracked. It just cracked the actual screen"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew Ashby",
          "Nb_Reviews": 2,
          "Date": "2020-05-05T15:09:55.000Z",
          "Titre": "Bought two iPhone 6 batteries",
          "Contenu": "Bought two iPhone 6 batteries, one worked fine, the other had some exposed metal that arced when the cover screws were replaced (the professional technicians description).  I had to go two days without a phone because it wouldn't work, then had to pay $50 to have the problem diagnosed and a new battery installed.  I requested a refund and quickly received an email asking that I return it and provide a tracking number so I could get an exchange.  It wasn't worth it to pay $5 to return a $10 battery just to get an extra battery that I don't need anymore.  I'll just keep it and take the loss."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kingston Stephen",
          "Nb_Reviews": 3,
          "Date": "2020-04-30T22:07:21.000Z",
          "Titre": "Think twice before buying",
          "Contenu": "The products are cheap but the return policy terrible no free shipping + no return shipping cost covered + 15% restocking fee. so basically you will end up in paying for the even you don't like the product. I ordered $9.99 item and paid $3.99 for shipping.unfortunately I didn't like the product I had to return I paid another $4.29 for shipping also they charge 15% restocking fee which is $1.5 so I paid 3.99(initial shipping ) + 4.29 (Return shipping) + 1.5 total of $9.78 so basically I lost my entire money. First time i am trying outside of amazon and learnt my lesson..please think twice before you buy it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kervin Cintron",
          "Nb_Reviews": 2,
          "Date": "2020-04-08T17:33:32.000Z",
          "Titre": "Items good quality, but service is lacking in 3 areas",
          "Contenu": "The items are good quality, but the customer service response time and cross communication among there own staff about matters is lagging. Also, make sure to select correct item the first time, because if you make a mistake they have no way to stop your order from processing to edit it. Its an order and its final company. No options for you until item is received and have to pay out of pocket to send back with no reimbursements of any shipping n handling. You have to repeat yourself when addressing a concern with a different staff member then previous. Customer service response is overall a tad bit slow but not awful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kody Blick",
          "Nb_Reviews": 1,
          "Date": "2020-03-17T19:31:01.000Z",
          "Titre": "Overall",
          "Contenu": "Overall, the company offers unbeatable prices.  The Shipping the same day advertisement is misleading as you have to read in the find print that the order not only has to be placed by a particular time AND has to processed by the business by that same time to be shipped same day.  Also, paying extra for the 2-3 day delivery, a waste of money because it arrives in the same time as the standard shipping.  We will continue to buy from because of pricing & accurate information on their products however, we do not expect an quick delivery of our order which in previous our 2 orders took an average of a week to be delivered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jacob Galentine",
          "Nb_Reviews": 1,
          "Date": "2019-09-10T21:58:56.000Z",
          "Titre": "Only 3 stars",
          "Contenu": "In my opinion the graphics on the premium screens look better than even the originals however the durability still isnt good enough on top of that i have gotten a faulty power flex for an iphone 6 and ive had late parts which puts me behind schedule"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-01-15T19:37:24.000Z",
          "Titre": "Received both wrong camera's the …",
          "Contenu": "Received both wrong camera's the battery gave us nothing but problems, haven't been able to get in touch to get my money back, the only thing that worked was the screen. Had to open the phone up twice to get it fixed right.-edit; received refund. Thanks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Barry Johnson",
          "Nb_Reviews": 2,
          "Date": "2020-03-14T07:23:40.000Z",
          "Titre": "Parts arrived sooner than expected",
          "Contenu": "Parts arrived sooner than expected, screen I ordered did not work very good had to get another one ordered on amazon and it worked fine. Not blaming repairpartsusa, I may have picked a poor quality part. Other parts ordered worked just fine."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tony Duarte",
          "Nb_Reviews": 2,
          "Date": "2020-07-16T03:17:35.000Z",
          "Titre": "I've only just purchased some parts",
          "Contenu": "I've only just purchased some parts. As far as that goes it was easy to lookup and find everything I needed. I wish they had parts for other kinds of phones besides  iPhone and Samsung. I  update review upon receipt of items."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Ramsay",
          "Nb_Reviews": 1,
          "Date": "2018-04-18T16:31:29.000Z",
          "Titre": "Double check your parts before unpackaging",
          "Contenu": "First off, I am a technician and am familiar with working on small electronics. I purchased a repait part for my iPad. It didn't work. I double checked all hardware connections but the \"new\" part did not work. On further inspection, it did not EXACTLY resemble the part I was repairing leading me to believe that it was not an OEM part. For the 3 or 4 dollars I paid for it plus the 17.00 in shipping, I wasn't about to try and extract it to send it back. So, yeah, can't give them 1 star because they were prompt with shipment, but can't give them 5 stars because it was NOT an apple iPad OEM part."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "jim",
          "Nb_Reviews": 1,
          "Date": "2020-04-29T20:03:02.000Z",
          "Titre": "This review is based only upon the ordering process",
          "Contenu": "This review is based only upon the ordering process as I've yet to receive my purchased items. I realize in this time of covid 19 that many customer service reps are working from home (which is the case with this company according to their automated attendant). From the problems and amount of time involved with placing my order I believe this company is lacking in this area. I attempted to place the order on their website numerous times but it would simply display a message \"loading\". I left a couple of voicemail messages but were never returned. I finally was able to finalize the order using a different cc. I hope the order arrives as promised. Will update..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "richard pena",
          "Nb_Reviews": 1,
          "Date": "2019-07-19T04:17:46.000Z",
          "Titre": "My last order came in too late and not…",
          "Contenu": "My last order came in too late and not the date that I paid extra shipping for. The good news is; it was the correct parts. I willing to pay extra now to get my parts here on time so I will not loose another customer. Thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elisa",
          "Nb_Reviews": 1,
          "Date": "2021-07-06T19:27:41.000Z",
          "Titre": "Screwdrivers that come with the kit are poorly made",
          "Contenu": "I ordered an iphone screen.  The screen itself was fine, but the tools that came with the screen fell apart on me. I had to order a new set of screwdrivers to be able to finish replacing my screen."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "tom manchester",
          "Nb_Reviews": 1,
          "Date": "2019-10-03T19:50:39.000Z",
          "Titre": "items impossible to return/exchange",
          "Contenu": "fast delivery, be careful not to order a wrong part, i sent 2 emails to exchange  a wrong item i ordered. no response.. i called customer service on hold forever never did speak to anyone or was able to return the item..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jay Em Bea",
          "Nb_Reviews": 1,
          "Date": "2022-07-06T19:48:24.000Z",
          "Titre": "I ordered a replacement stylus for my…",
          "Contenu": "I ordered a replacement stylus for my Samsung and it works fine for typing and such but does not fit in the storage slot on the phone..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Molly McAuliffe",
          "Nb_Reviews": 2,
          "Date": "2019-12-10T17:04:12.000Z",
          "Titre": "Order not received- resolved!",
          "Contenu": "I ordered a black S-Pen for a Galaxy Note8, order #119942, and received a notification that it was shipped on November 26- it never arrived. I opened a ticket with USPS who verified they delivered to the wrong address. USPS says it is unrecoverable and that the sender (This company) is required to file a claim with them and issue me a refund. I have called over 60 times, emailed, and left messages, all with no response. At this point I would like either a full refund or for the item to be sent to me again. Please honor your high customer reviews and provide me an immediate response. Thank you.I recieved an immediate response and a full refund, I am now re ordering the package, thanks!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "No",
          "Nb_Reviews": 1,
          "Date": "2021-03-28T13:48:43.000Z",
          "Titre": "I give them a 3 star",
          "Contenu": "I give them a 3 star. The products are in good shape but they really don’t last long. My screen went out after the second one I ordered and currently have to order a 3rd(I cracked my original screen). Also they should include in the shipping section that the time doesn’t include processing. If I pay for two-day shipping, that’s what I expect. Especially since they state that they do same day shipping and processing before a certain time. Also, you can never speak to customer service. They are always “currently assisting another customer”. You can text the number as well but it may take several hours for a response. The response may not even be what you need to know either. I guess the best thing is the prices. Cheaper than most places I see."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "dirtydonkey",
          "Nb_Reviews": 2,
          "Date": "2020-11-04T05:29:39.000Z",
          "Titre": "Cheap price",
          "Contenu": "Found what I was looking for extremely fast and easy. Also cheap price is hard to beat. Just ordered a few min ago so I'll finish my review and give more stars if all goes accordingly in like 4 days."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lakesha",
          "Nb_Reviews": 1,
          "Date": "2021-01-14T01:08:04.000Z",
          "Titre": "199939 is the order number",
          "Contenu": "199939 is the order number  I had several issues with this order. I sent item back bc I need 7lcd plus  and was sent 7 lcd. I emailed them several times and and they still haven't responded yet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Johnny",
          "Nb_Reviews": 1,
          "Date": "2021-05-10T23:49:21.000Z",
          "Titre": "I ordered a screen replacement that…",
          "Contenu": "I ordered a screen replacement that worked well and was easy enough to install. Although shipping took a bit longer than expected and The screen protector that I ordered with it came broken."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2020-07-05T00:17:09.000Z",
          "Titre": "Get It Right the First Time",
          "Contenu": "It is important you put your ipad replacement screen on right the first time for once it is glued down, if you try to take it off again, the screen will crack.  Product quality is adequate -  be thorough."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Katie",
          "Nb_Reviews": 1,
          "Date": "2020-06-17T20:01:28.000Z",
          "Titre": "Even though the screen was amazing I…",
          "Contenu": "Even though the screen was amazing I was not able to get it on the phone and had to purchase a new screen it through a different company. The tools were flimsy and did not work the way they should have."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Siklade",
          "Nb_Reviews": 1,
          "Date": "2019-10-30T09:42:48.000Z",
          "Titre": "Lack of Communication",
          "Contenu": "Ordered a screen on Friday and it just shipped on Tuesday so not same day shipping. Communication has been awful as no one picks up the phone or returns calls/emails. The only communication I got was on here."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shieeda",
          "Nb_Reviews": 1,
          "Date": "2020-01-13T21:06:28.000Z",
          "Titre": "Overall it was an OK experience",
          "Contenu": "Overall it was an OK experience. I ordered a few items and most of them came back great except two of the three tempered glass protectors were cracked. I attempted to call the number to report with no luck."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jack Ziemke",
          "Nb_Reviews": 1,
          "Date": "2021-02-01T19:12:23.000Z",
          "Titre": "I ordered wrong parts asking to cancel…",
          "Contenu": "I ordered wrong parts asking to cancel order, but customer support took a while to respond, so they shipped the parts and are making me pay for return shipping after asking for a free return."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steven Holbrook",
          "Nb_Reviews": 1,
          "Date": "2018-02-09T15:05:23.000Z",
          "Titre": "It was a good experience everything …",
          "Contenu": "It was a good experience everything worked fine I was just worried about the parts where I never got a tracking number to track them because I paid for 1-3 days shipping but didn't get it till the 4th day"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 1,
          "Date": "2020-07-04T02:40:43.000Z",
          "Titre": "Got what I ordered shipped in a timely…",
          "Contenu": "Got what I ordered shipped in a timely fashion, but the digitizer was not fully functional. Could have been an installation problem, so I’m not holding it completely against repair parts USA"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2020-03-12T17:18:27.000Z",
          "Titre": "Simple, But Could be Better",
          "Contenu": "Though the quality of the screen was not what I was hoping, for the lower price and ease of access it was understandable. Hoping that more detailed guides can be provided for simple repairs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Liliana Garcia Ortiz",
          "Nb_Reviews": 5,
          "Date": "2018-04-18T16:45:45.000Z",
          "Titre": "I've receive my two Samsung pen on…",
          "Contenu": "I've receive my two Samsung pen on time, but one of them has an issue and since I use Swype a lot makes not sense my text....the price it's worth it I'm glad one of the two pens work...."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Erica McPherson",
          "Nb_Reviews": 1,
          "Date": "2020-04-24T20:17:20.000Z",
          "Titre": "It seemed like it took a lot longer…",
          "Contenu": "It seemed like it took a lot longer than 3-4 days to be shipped off and I’ve been waiting for my refund/exchange request since the 18TH, it is now the 24th and I’m still under requested."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tristan Stauffer",
          "Nb_Reviews": 2,
          "Date": "2020-03-12T21:38:10.000Z",
          "Titre": "The package came i but after…",
          "Contenu": "The package came i but after installation it had only taken 2 days before it broke the screen was in perfect condition these black lines just started appearing until you could see nothing"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2020-04-23T19:39:59.000Z",
          "Titre": "Will order again",
          "Contenu": "Took a while to get responses. I understand it was during Covid19 but I felt a response the same day was warranted. Didn’t ship the day it was promised either. Product is decent though!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike C",
          "Nb_Reviews": 2,
          "Date": "2018-04-19T17:35:55.000Z",
          "Titre": "Received iPhone new screen from…",
          "Contenu": "Received iPhone new screen from Repairpartsusa.  After installing the TouchId sensor from my old cracked screen everything worked perfectly for a couple of days until the new screen went completely black.   Repairpartsusa sent a replacement screen but I had to pay the cost of shipping the dead screen back to them.  The replacement screen worked except my original TouchId sensor will not work with the replacement screen.   After testing I determined the TouchId sensor does work with the original cracked screen so I know that part is not the problem.  Repairpartsusa did not respond to my request for help.   I am using the phone without the TouchId working but I will live with it until this screen fails and then I will look elsewhere for a replacement."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2019-12-24T05:03:54.000Z",
          "Titre": "Good product, mediocre customer service",
          "Contenu": "The screen I received was not fitting. So I emailed them and it took 3 days for customer service to reply. In the end, the issue was my fault, nonetheless, customer service is lacking."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chin",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T17:12:01.000Z",
          "Titre": "Was not really impressed with the product and costumer service",
          "Contenu": "The product came. The packaging was not impressive. Small box and inside were the iPhone 8 Plus screen replacement and the tools that I ordered separately for it. There were not any soft material in the box to prevent the items shifting or moving in the box. One of the tools was broken. I ordered their premium quality screen and changed it using YouTube video. I applied little bit of strength making sure the screen was sit tightly into the phone but unfortunately the screen got cracked. I did the same to my other iPhone 7 to see if it would crack and it was rock solid. Therefore, I was not impressed with the quality of the screen. Called and texted the company to discuss this but no phone call and only short, distant text reply saying that it happens all the time. So no more business with this company for me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ulises",
          "Nb_Reviews": 1,
          "Date": "2021-07-06T17:18:42.000Z",
          "Titre": "I phone 5 screen",
          "Contenu": "The part came a little late but it was packed neatly and there was no damage. Although with some use of the screen the screen has become harder to control or glitchy"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Asher",
          "Nb_Reviews": 1,
          "Date": "2020-08-11T17:01:37.000Z",
          "Titre": "Needs to come with instructions",
          "Contenu": "Needs to come with instructions. You make one small mistake like forgetting to unplug the battery before replacing it and the new screen is ruined. But Screen seemed good quality"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T10:38:12.000Z",
          "Titre": "I loved it the first time I bought a…",
          "Contenu": "I loved it the first time I bought a screen from here but the second time I'm pretty sure the one screen I bought was a defect cause it's still not working!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dravyn Smith",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T04:14:04.000Z",
          "Titre": "It came quickly and was easy to get."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "wtf_erick",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T06:00:39.000Z",
          "Titre": "Great Quality ! Got What i Wanted ever time",
          "Contenu": "From what i’ve ordered from these guys it’s been nothing but great quality, i’ve Been ordering from these guys for 2 1/2 years now and their products have always been great and helpful. the only thing i’ve ordered and was disappointed about was the privacy screen protector that’s it that’s all."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sidney DeGrasse",
          "Nb_Reviews": 2,
          "Date": "2022-12-09T18:34:04.000Z",
          "Titre": "iPhone XS Max Screen Replacement",
          "Contenu": "Availability of parts and prompt delivery. I would have provided 5 stars. However, the screen protector offered and purchased is quite a bit smaller than the screen leaving an exposed edge. Additionally i am interested in replacing the back glass. I did not find what i was looking for on a back glass."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ben Woodward",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T23:53:10.000Z",
          "Titre": "Thanks for sorting out the shipping…",
          "Contenu": "Thanks for sorting out the shipping issues and getting the screen sent, albeit delayed. DEf had some missed opportunities for customer service speed, but I understood it was over Thanksgiving and that can be tough. People can be unreasonable about shipping these days."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CED",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T20:32:02.000Z",
          "Titre": "Received and Returned",
          "Contenu": "The receipt, return & credit was without incident.The return was because I could not remove one of the two screws to access the interior of the phone.  Therefore, I could not attempt to replace the screen. Unfortunately, it cost me return postage & re-stocking fees."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fermin R",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T18:55:28.000Z",
          "Titre": "Bought a parts the part work but had a…",
          "Contenu": "Bought a part and the part work but had a defect. I had no problem with contacting support to return and or replace the item. Only complaint is the shipping packaging was very minimal and I had to pay for the return which idk why but oh well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stoney Summers",
          "Nb_Reviews": 2,
          "Date": "2023-08-08T20:05:54.000Z",
          "Titre": "Great screen that I received didn't…",
          "Contenu": "Great screen that I received didn't receive repair tools or I'd leave 5 stars"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Quiggle",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T13:13:10.000Z",
          "Titre": "Was shipped wrong part at first but…",
          "Contenu": "Was shipped wrong part at first but simply sent an email and was given the correct one a couple days later. Good experience and customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Reid K",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T01:41:14.000Z",
          "Titre": "Quick service and shipping",
          "Contenu": "Quick service and shipping. Screen didn’t fit as snug as original, but it was functional. I did appreciate that the plastic brackets for the lens and sensor were already installed"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T14:23:42.000Z",
          "Titre": "Good parts and deliveries are fast."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roy B.",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T13:38:36.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping, high quality. Direction would have been nice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lo",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T00:32:02.000Z",
          "Titre": "Good screen",
          "Contenu": "Good screen, put it in myself no tutorial pretty easy to work with, no Face ID tho thats the only reason for 4 stars 😭"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Garret Stensgard",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T14:28:36.000Z",
          "Titre": "The product is good quality but the…",
          "Contenu": "The product is good quality but the shipping was not. Says 3-4 days shipping and ship same day. Mine didn’t ship until 5 business days later and arrived 3 days late luckily I hadn’t left out of town yet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stanley Burgess",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T08:36:09.000Z",
          "Titre": "Took a while to ship but I assume that…",
          "Contenu": "Took a while to ship but I assume that was the holidays, display is mid quality"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chirag Patel",
          "Nb_Reviews": 2,
          "Date": "2022-12-04T17:45:58.000Z",
          "Titre": "Ordered twice back to back",
          "Contenu": "Ordered twice back to back, 1st part arrived in 2 days, 2nd part took 6 days. Also shipping was charged more than charged by usps. Besides that all ok"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jose",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T14:05:40.000Z",
          "Titre": "Shipping is slow but speaker sounds oem"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jordon johnson",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T21:43:01.000Z",
          "Titre": "the tools dont really work but…",
          "Contenu": "the tools dont really work but everything else works real good would buy again but need working tools"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Beverly",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T15:34:19.000Z",
          "Titre": "Good. Quick,  received items on 10/18",
          "Contenu": "The service and delivery were great...however one of the 2 galaxy note 8 s-pens (silver) doesn't work properly  .Jumps(doesn't connect to my phone) on the letters as I am trying to text.Good for using with my word games though..will use as a spare since I purchased 2."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brad Chet",
          "Nb_Reviews": 2,
          "Date": "2022-10-13T17:42:29.000Z",
          "Titre": "Part was good quality.",
          "Contenu": "Part was good quality.Screen looks great and works well. I did have a question and it was a bit hard to get anybody back to me from repair USA.They used to be better at this.It also took them a few days to ship the part so it took about six days to get it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brad",
          "Nb_Reviews": 3,
          "Date": "2022-10-09T17:04:54.000Z",
          "Titre": "Parts were good and shipped a little…",
          "Contenu": "Parts were good and shipped a little longer than I thought.They do have tech-support, which is cool but I was not able to get anybody to help.In the past I used to have someone you could call and ask questions but it seems not anymore."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sarim Hasan",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T20:11:29.000Z",
          "Titre": "Great products but bad communication.",
          "Contenu": "This is a great company but their communication is very bad. I got one defective screen and I tried contacting them but they didn't respond and its been 6 months. But I have ordered from here at least 25 times and everything came working but that one screen."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ashley Brown",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T05:35:54.000Z",
          "Titre": "The prices on both items I got where…",
          "Contenu": "The prices on both items I got where well worth it. My screen was cracked for over a year."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Scarborough",
          "Nb_Reviews": 2,
          "Date": "2022-09-16T19:23:44.000Z",
          "Titre": "All but one part was superb",
          "Contenu": "All but one part was superb, the screens quality has gotten better.The delivery was good.But the hoke button was missing the black gasket seal that is normally on them over all had that seal be operable or on it would have gotten the 5 Stat other than thay service was good would recommend again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-03-09T15:26:47.000Z",
          "Titre": "Waiting on part",
          "Contenu": "Problem about shipping fees has been fixed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shaun Edwards",
          "Nb_Reviews": 2,
          "Date": "2022-09-30T17:50:04.000Z",
          "Titre": "Screen works shipping not so much.",
          "Contenu": "Honestly the screen I ordered fit great works great. The shipping I paid for though was my only issue because the shipping label was printed then the screen actually finally shipped almost a week later."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sony",
          "Nb_Reviews": 2,
          "Date": "2023-05-01T02:18:52.000Z",
          "Titre": "Good",
          "Contenu": "Good quality, easy assembly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2022-07-14T22:56:09.000Z",
          "Titre": "Replacement screen",
          "Contenu": "I bought a new iPhone 11 pro OLED screen a few months back, wasn't the best quality and screen burn in started to form, but I was just glad to be able to use my phone again, and for such a cheap price it was definitely still worth it. Unfortunately, I dropped it without a case and broke the OLED panel. Just purchased a new one today, hopefully I get good results again, thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "cheap gamer",
          "Nb_Reviews": 3,
          "Date": "2023-01-03T19:56:48.000Z",
          "Titre": "Had what I needed",
          "Contenu": "Had some stuff I needed to fix my old phone. Wish the shipping was cheaper."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Manuel Avila",
          "Nb_Reviews": 2,
          "Date": "2022-07-06T18:31:04.000Z",
          "Titre": "Read entire review",
          "Contenu": "(Sorry for your inconvenience this was terrible mistake on my part, i recieved the correct item) ordered a charging dock for iphone 8 plus and recieved one for a regular 8. i tried contacting them for a week through email and telephone, being sent directly to voicemail or getting no response at all to the email.(althought this part is still true)  but nonetheless the service to recieve the items was good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keii Gunna",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T18:40:25.000Z",
          "Titre": "I love it ……….."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Dickens",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T21:09:53.000Z",
          "Titre": "EDIT: I was unable to reach anyone via phone, but they are available.",
          "Contenu": "I was not happy that I could not reach this group after ordering a screen and camera for my Note 10+. After a couple of days, the part shipped and It did in fact also get delivered on a Saturday, by FedEx, (after being ordered Sunday night). Saturday ground, FedEx deliveries are unusual. **SO SLOW GOLF CLAP on that one.**My original edit of this review was not happy. Maybe Amazon and getting things in two days or less spoiled me. It did take me 5 days to get the screen, but we all can't be a team of robots shipping things overnight."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Champagne Walters",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T18:07:19.000Z",
          "Titre": "Good",
          "Contenu": "It was ok when I first got my order it was missing parts but I emailed them  to let them know that it was missing an they sent it out the two days later"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Liz Williams",
          "Nb_Reviews": 2,
          "Date": "2022-04-03T19:01:53.000Z",
          "Titre": "Can’t beat the price!",
          "Contenu": "Fast shipping and great price. Wish they worked better with me regarding a defective part. Customer service was prompt answering my emails. Basically was told it was an installation error. Maybe it was but maybe it wasn’t?? They really weren’t open to discussion. Returns or exchanging an item seem impossible."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alex G.",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T20:07:10.000Z",
          "Titre": "Good",
          "Contenu": "I ordered the wrong battery, by mistake, and I was able to return it. Sucks that I had to cover the shipping, but at least i was able to get the correct one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Isaiah Tate",
          "Nb_Reviews": 1,
          "Date": "2022-04-01T16:04:21.000Z",
          "Titre": "Top-Tier site/Terrible return process and turnaround",
          "Contenu": "Great product for the most part; Absolute BEST prices; may not always have what I'm looking for but 9.5/10 I'm buying from here before anywhere else. Hands down best site for phone and iPad repair parts and tools. The only real downfall is the return process when needed"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 2,
          "Date": "2021-11-10T06:35:40.000Z",
          "Titre": "Fixed my iPhone Xs",
          "Contenu": "I ordered a new battery for my iPhone Xs, along with a seal and some small tools (for the guitar picks and suction cup).  It all went well, but I couldn't recommend anyone order it with the tools as it did not even come with all the required screwdrivers, and I'm thankful I had my own set.  The waterproof seal was perfect and looked just like the original.  Overall, four stars, if it weren't for the disappointing tool kit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brandon Rhen",
          "Nb_Reviews": 1,
          "Date": "2022-05-19T21:41:40.000Z",
          "Titre": "Quality consistency",
          "Contenu": "Im a teenager that’s been fixing screens since middle school. I use to buy screens from Amazon and it’s was cool at first but their screens aren’t consistent and with Irepair I know I’m getting a quality screen every time. Great work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shantrece",
          "Nb_Reviews": 1,
          "Date": "2021-07-06T22:05:53.000Z",
          "Titre": "Great Lead Time. Review Suggestions",
          "Contenu": "The company is great about getting items delivered on time, if not early. However, I was a bit disappointed when I bought my iPhone X replacement screen and realized after I received it that I had to buy the blue adhesive separately. It would be nice to include that on the purchase or a reminder before checking out that I may need it. Just saying."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "G. L.",
          "Nb_Reviews": 1,
          "Date": "2021-07-06T19:22:27.000Z",
          "Titre": "Good Company Good Service",
          "Contenu": "I’ve use this service twice now with no serious issues. I had a screen protector arrive pre-broken, saving me from being the one to do it, but that’s why I ordered two and besides they were so inexpensive. Everything shipped quickly both times and would certainly recommend this company and will do business with them again soon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Derek Lee",
          "Nb_Reviews": 4,
          "Date": "2021-05-10T19:32:47.000Z",
          "Titre": "This is the only company that I use to get any…",
          "Contenu": "This is the only company that I get any of my parts and tools to do repairs. All the parts I have received are quality and a reasonable prices especially if you become a wholesaler with the company. I live on the complete opposite side of the US but with the free shipping if you spend $40 and one two day free shipping it you spend $150 (I think those are the right prices don't quote me though) what's not to love about that. I am hoping to see more iPhone 12 parts soon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Teia",
          "Nb_Reviews": 1,
          "Date": "2021-05-15T01:15:36.000Z",
          "Titre": "I've ordered from RepairPartsUSA…",
          "Contenu": "I've ordered from RepairPartsUSA a few times now. Impressed in the quality of the parts. Although there are a lot of comments stating their parts are low quality, I have no trouble but I have had a recent issue of the parts coming in defective or missing a couple of times. For the price it's not worth it to complain but I do wish I was able to get more reliable service in trusting I will get all my parts when I order. Other than that fast shipping and carefully packaged parts!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Justin Hudspeth",
          "Nb_Reviews": 2,
          "Date": "2021-03-20T07:16:30.000Z",
          "Titre": "they're pretty fast when it comes to…",
          "Contenu": "they're pretty fast when it comes to delivery, just not so fast when it comes to them accidentally shipping you the wrong product and making you wai \"3 weeks\" for a warehouse personnel to call and validate to you they've received it. Now, the warehouse is in the same building i'm sure, so the strategy is peculiar to say the least. Either way that's my only quib, I still recommend them and believe the staff is on it, better than other places."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cameron",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T16:53:00.000Z",
          "Titre": "New Display... Like new phone",
          "Contenu": "I purchased a whole new display for my Galaxy s 10e that I broke the screen on and was super impressed with my diy repair going successfully. I only gave it 4 stars because there weren't any directions or explanations on how to install, but these can be found elsewhere online. I will definitely be looking at Repairpartsusa in the future if I need to do any self repairs again!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Unhappy Customer",
          "Nb_Reviews": 2,
          "Date": "2021-01-08T02:44:14.000Z",
          "Titre": "Replacement of screen on phone",
          "Contenu": "I replaced the screen on phone. It was good. Working after installation. Negative is that there is a extra connection flat cable that is not aligned properly when connecting the screen to the base of phone. I had to fold the flat cable a bit to close the screen to the body. Overall, it is good except for this misaligned flat cable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John L",
          "Nb_Reviews": 1,
          "Date": "2020-08-17T13:10:18.000Z",
          "Titre": "Prices and the Quality of the parts…",
          "Contenu": "Prices and the Quality of the parts were very good. I purchased a charging port along with some other parts for my S9 phone.   There was a little issue with the mail initially and when I inquired as to the status of my order, a new order was created and the parts were receive in just a few days.  The parts worked great and I will purchase from this company again if I need additional parts.  Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Winston N.",
          "Nb_Reviews": 1,
          "Date": "2021-07-06T23:44:37.000Z",
          "Titre": "The product came as described and…",
          "Contenu": "The product came as described and shipped in a timely manner. Pricing was reasonable. Constructive feedback includes: the suction cup that was included was of poor quality. This created difficulty in initially pulling out the screen itself before I was able to access any internal screws and parts. In addition, one of the screwdrivers used immediately became dull after a few use throughout the replacement process. Thus creating problems with tightening and untightening a few of the internal screws with the latter half of the the process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Quintanilla Mary",
          "Nb_Reviews": 1,
          "Date": "2021-01-29T09:13:19.000Z",
          "Titre": "Good Prices",
          "Contenu": "This is my 3rd time ordering from this company and have only had one issue I was sent the wrong screen protector which I contacted them about it. Reply to email was vague, but they send the correct item immediately and without charge. I hope to continue doing business with them and would definitely recommend this company"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jayson Clanton",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T06:08:34.000Z",
          "Titre": "Product arrived"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jaime",
          "Nb_Reviews": 1,
          "Date": "2021-01-22T20:34:04.000Z",
          "Titre": "Gets the job done",
          "Contenu": "I ordered a screen replacement for an Iphone XS, everything arrived in good condition, the only reason why I’m giving it 4 stars instead of 5 is because the colors look a bit different from the original.  I guess that is bound to happen with aftermarket screens, but it works great.  I would buy again from here."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2021-07-08T16:57:51.000Z",
          "Titre": "Cares about the customers",
          "Contenu": "Ordered a couple of parts from REPAIRPARTSUSA. Didn’t really hear from them about my parts for some time until I sent them an email about why it’s taking so long. When they replied back, they sent my parts to me via express mail. That showed me they cared. Good customer service!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Perrin",
          "Nb_Reviews": 1,
          "Date": "2020-12-16T18:39:45.000Z",
          "Titre": "Great Parts and Variety - Shipping & Customer Service could use some improvement",
          "Contenu": "They grade their products accurately and I have always been satisfied with my purchases, especially the repair kit. However their customer service phone number shouldnt even be listed because no one ever answers it. They did ship me two items that I ordered one of and also charged me for both. The second is unopened so hopefully when I return they dont try to pull the whole damaged goods card and keep my money. Anyways so far so good with these guys. Good parts, wide variety. Good customer support (CHAT ONLY)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lauren",
          "Nb_Reviews": 1,
          "Date": "2021-01-22T19:57:42.000Z",
          "Titre": "I was pleased.",
          "Contenu": "I was pleased that they were able to do the exchange without any hassle. Most places send paid shipping labels for exchanges or returns which unfortunately repair USA doesnt but that’s something you can always ask the company before purchasing. Other than that everything went well with my exchange."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Culbertson",
          "Nb_Reviews": 2,
          "Date": "2020-08-12T19:27:24.000Z",
          "Titre": "- did not last long",
          "Contenu": "I attempted to repair my iphone 8 plus and I got new screen in and followed all instructions to the tee. Success it works. So I finish screw my device back to geather and cables are fine ribbons not altered but screen DOESN'T COME BACK ON.... ??????DOES NOT MAKE SINCE. I tried old screen and it works fine!!???!@@$%%^"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michala Holmes",
          "Nb_Reviews": 3,
          "Date": "2023-05-23T11:08:15.000Z",
          "Titre": "10/10 Sim card",
          "Contenu": "10/10 Sim card7/10 shipping"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "julia",
          "Nb_Reviews": 1,
          "Date": "2020-08-13T07:25:30.000Z",
          "Titre": "I need to return an item",
          "Contenu": "I need to return an item. I followed the procedure to send email because noone ever answers the phone.customers are directed immediately to email for problems or returns.There is a deadline for returns. The message on phone said there would be reply in 24 hrs. I've waited 10days now.Not happy with customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Justin Hudspeth",
          "Nb_Reviews": 2,
          "Date": "2021-03-24T00:01:11.000Z",
          "Titre": "Have ordered from them a few times, usually on point",
          "Contenu": "Have ordered from them a few times, usually there's never any issues, but the only reason I'm leaving a 4 star this time is on the last order I made I got the wrong color digitizer, which obviously, being the exact piece i needed, did not affect the performance and the fixing of the core problem, it worked just the same. But as far as trading it in, i'm not sure how that would've gone. Blue tray, black frame. Anyways,  prior to this I have never had an issue, product arrives always on time or even early. So I would still recommend them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rachel Stanton",
          "Nb_Reviews": 2,
          "Date": "2021-04-24T22:53:14.000Z",
          "Titre": "Okay I dont know about the products yet…",
          "Contenu": "Okay I dont know about the products yet or even shipping but the prices alone are just amazing!!! Definitely become a member because goes down anywhere from 20% to 60% or more. Thats just awesome to me. Hopefully I get everything in good time and it's good quality"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Hitz",
          "Nb_Reviews": 3,
          "Date": "2022-10-23T20:00:12.000Z",
          "Titre": "Great company. Products not 100% working",
          "Contenu": "The company did well at providing products not a lot of places do, and cheaper than those that do. Great shipping speed. Arrived on time as stated.Now with every review comes some bad. The lcd replacement screen I ordered for my iPhone 12 Pro Max has some issues. The screen itself has 2 marks on it when powered on. You can’t tell unless you look at an angle or are scrolling on the phone when powered on. The touchscreen doesn’t work 100% of them time, I have to touch it multiple times for it to register. Usually right where the back button is on almost everything for the iPhone. No where on the repairpartsusa.com webpage for iPhone 12 Pro Max replacement lcd screen did it state that after installing this screen the iPhone would display a message saying the iPhone screen is either not genuine or not completely installed. This message you can not remove (unless taking parts from old screen and replacing them, but what’s the point this is supposed to be plug and play) The company itself is great which is why it gets 4 stars from me. Out of thousands of products sold there is bound to be a bad one or two. So nothing taken from that. I have however marked a star off for not being transparent. Any Company should list any issues or incompatibilities for a product they are selling as a replacement. I will be starting a return on the screen, depending how that goes may affect the score I have given today."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alec",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T19:40:02.000Z",
          "Titre": "Overall the screen replacement for the…",
          "Contenu": "Overall the screen replacement for the iPhone XS i ordered has worked very well. The only downside is that it is thicker than the original so it sticks out a little from the iPhone body. It is for that reason that i am not giving five stars. Still a great product however."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave Reeser",
          "Nb_Reviews": 1,
          "Date": "2020-12-11T18:26:48.000Z",
          "Titre": "Reviewing only the ordering portion:",
          "Contenu": "Reviewing only the ordering portion:Everything worked as it should have but and I don't know if anyone had this issue,ordered on my phone and that dam chat request would not leave the screen,I almost bought from another site but the reviews made the difference."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric Hossner",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T02:33:27.000Z",
          "Titre": "iPhone screw set",
          "Contenu": "Got the iPhone screw set—great price, quick delivery. Would give 5 stars if they were separated by head type and size."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DAVID",
          "Nb_Reviews": 2,
          "Date": "2020-10-13T16:16:20.000Z",
          "Titre": "Quality parts, no instructions and no warning in description",
          "Contenu": "I received my parts very quickly.  They were exactly as described and appear to be quality parts. The only problem is there were no instructions with the parts and I destroyed my Samsung Galaxy S9+. I did not know that attached to the front glass was a film and that it had to be separated from the glass. Now I have a phone that turns on and works, but I can't see a thing.  I can't answer the question to transfer my pictures. I will need to spend almost $200 to order a whole new screen or pay to have it repaired, which I would have done originally if I would have known."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2021-07-10T02:17:11.000Z",
          "Titre": "Premium screen for iPhone 6s Plus",
          "Contenu": "I ordered a premium screen for the iPhone 6s Plus.  It fit well and works almost like the original screen.  The home button press depth and 3d touch sensitivity is a little different, but the display is good.  I would buy from them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Danni",
          "Nb_Reviews": 1,
          "Date": "2020-10-15T02:22:33.000Z",
          "Titre": "I wasn't sure exactly what type of…",
          "Contenu": "I wasn't sure exactly what type of repair kit I needed to go along with the battery I was going to purchase.  Someone answered me via text pretty quickly and gave me the info I needed.The battery and repair kit shipped quickly.Overall, good stuff all around!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Douglas",
          "Nb_Reviews": 1,
          "Date": "2021-07-06T19:39:33.000Z",
          "Titre": "New battery kit (iPhone 7 Plus Premium…",
          "Contenu": "New battery kit (iPhone 7 Plus Premium Battery Replacement Kit + Adhesive + Tools, 7PLUS-Battery-Kit) included battery and all tools needed to replace iPhone 7 plus battery.  Helpful to search for different youtube videos to guide the process as some are more clear than others, some use heat to soften gasket glue, some do not (I tried but not sure it was necessary). Would be nice if kit description recommended also ordering separate replacement waterproof seal sticker (iPhone 7 PLUS Precut Water Resistant Frame Adhesive - White), as I didn't know it was needed (having never replaced a battery before), and ended up ordering elsewhere."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pat",
          "Nb_Reviews": 3,
          "Date": "2020-08-25T22:11:51.000Z",
          "Titre": "I'd do it again!",
          "Contenu": "My experience was almost completely positive. The only knock is that I didn't get a notice as soon as my parts shipped. Having read some bad reviews here I worried that those might be true. Happily the parts were on their way. I got them in good shape quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Martha",
          "Nb_Reviews": 1,
          "Date": "2020-08-12T03:44:28.000Z",
          "Titre": "You filled my order in timely manner",
          "Contenu": "You filled my order in timely manner, but sent no instructions for installation. I see no way to even open my phone, so the replacement screen is sitting on the shelf. I asked a handyman who know how to do everything. He said it's very complicated, and he was afraid to try it. I looked on line and found instructions, but I'm not adept enough to follow them. I am double compromised by this virus, so I am isolated. I suppose when it's safe to be out again in 6-18 months that I can take it to Apple or Verizon and ask for help. In the meantime, I'm stuck with my shattered phone screen."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2020-11-05T01:44:09.000Z",
          "Titre": "Item took a while to ship as they were…",
          "Contenu": "Item took a while to ship as they were having trouble getting the part in, but once I inquired of customer support, they replied within 24 hours and gave me an update. Otherwise, product received was exactly what I needed and it came fairly quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Heather",
          "Nb_Reviews": 1,
          "Date": "2021-01-23T12:32:00.000Z",
          "Titre": "Great replacement screen",
          "Contenu": "Great replacement screen. It worked perfectly. It was supposed to come with tools but they got left out. After contracting the company they got them out to me very quickly, which was great and helpful. Would use them again for parts for sure."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathy",
          "Nb_Reviews": 3,
          "Date": "2020-10-14T21:20:58.000Z",
          "Titre": "The glue is of extremely poor quality 😔",
          "Contenu": "The glue is of extremely poor quality 😔CORRECTION 🤪Silly me ... this case works with magnets 🧲!!! Duh!!!ISSUE:There were no instructions.  Actually, the product seems quite nice once I figured out that it was magnets."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shannon",
          "Nb_Reviews": 1,
          "Date": "2022-09-09T18:39:55.000Z",
          "Titre": "The screen was good",
          "Contenu": "The screen was good, the tool kit was kinda hard to use on account of the small screwdrivers and plastic pick."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ExoDUsTn MvP",
          "Nb_Reviews": 1,
          "Date": "2021-10-23T16:52:03.000Z",
          "Titre": "It may be a little fishy but every…",
          "Contenu": "It may be a little fishy but every thing is indeed legit even if you buy better shipping still takes like 3/4 days make sure to inspect the screen as I’ve got broken screen even from amazon"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CC music gaming",
          "Nb_Reviews": 1,
          "Date": "2022-01-25T21:47:11.000Z",
          "Titre": "👍 for iphones 👎 for samsungs",
          "Contenu": "I would just want to say that this sight is really good for their apple parts, good quality and cheap. But I've had some problems with anything other than iphone parts. I git an s10e sim tray and back. I got both in yellow, the sim came in the green variant. And I ordered 2 s9+ back glass, both seemed very off, the color, the camrea lens, and the font. And it qasn't even wide enough so jt didn't really sit all that well on the frame. And they gave me a bad galaxy S7 edge batt. Was dated for early 2021, and I got it in like December 2021. The phone kept restarting. Called them about it, but never got a call back.I would oy recomend this for iphone parts, and only if you really don't have another option for samsung phone partsPs: the s10e back glass was actualy really good, but the texture was off"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Satisfied Customer",
          "Nb_Reviews": 1,
          "Date": "2021-01-07T02:13:25.000Z",
          "Titre": "Great Product",
          "Contenu": "The product met my expectations and was a perfect fit for my phone. I would recommend this company to anyone looking for products specifically for iPhone. Product arrived a few days later but I was satisfied."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2021-01-06T22:05:31.000Z",
          "Titre": "Better than I expected",
          "Contenu": "The parts Ive ordered so far are functional. They do deteriorate quickly over time though. I do like however the lifetime warranty but it’s difficult to go without a phone until the replacement is shipped."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tommor Robinson",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T19:55:28.000Z",
          "Titre": "Alright it good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Azalia",
          "Nb_Reviews": 1,
          "Date": "2021-07-06T17:41:40.000Z",
          "Titre": "Best prices, good quality.",
          "Contenu": "Best prices, never had a problem with parts. good quality. Only issue was my order wasn't complete. I had next day delivery but the items that were sent later were not delivered next day."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gabriel",
          "Nb_Reviews": 1,
          "Date": "2021-01-23T03:06:26.000Z",
          "Titre": "Satisfied!",
          "Contenu": "The kit for replacing the iphone 6s batter had everything I needed. It was perfect for the price. Of course, the tools are hard plastic, so use caution when prying. Overall, very satisfied."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Thompson",
          "Nb_Reviews": 2,
          "Date": "2021-07-06T17:11:58.000Z",
          "Titre": "Great overall",
          "Contenu": "Good shipping times. If there are any problems, they tend to resolve them quickly. Customer service questions require email now; they used to have a chat options. Great overall."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sal Jones",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T16:52:08.000Z",
          "Titre": "Galaxy S10e Camera Replacement",
          "Contenu": "My galaxy s10e camera came within a week. No issues with delivery, the quality isn’t the same as the original s10e camera but I am satisfied. Will be ordering more parts whenever needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cary Sternberg",
          "Nb_Reviews": 2,
          "Date": "2021-01-22T20:40:25.000Z",
          "Titre": "So far, so good",
          "Contenu": "Product was delivered as promised and arrived in good shape. It was easy to install and it works as advertised. The real test will be its longevity and customer service if needed"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2021-01-23T09:25:48.000Z",
          "Titre": "pretty decent honestly",
          "Contenu": "pretty decent honestlyi use their product from time to time when i need to repair screens, they are pretty quick with shipping and such, but they dont reply to their emails."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tiffany",
          "Nb_Reviews": 1,
          "Date": "2020-08-12T13:43:50.000Z",
          "Titre": "I bought an s-pen for my Samsung note…",
          "Contenu": "I bought an s-pen for my Samsung note 9. I got the one without blue tooth and it worked fine with my phone...then it popped out like the previous one and it bent in half  :("
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 2,
          "Date": "2021-11-23T19:14:42.000Z",
          "Titre": "The battery package kit that was…",
          "Contenu": "The battery package kit that was ordered included everything but the waterproof seal. It had to be purchased separately. Great company to deal with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tanae",
          "Nb_Reviews": 1,
          "Date": "2021-08-17T16:33:23.000Z",
          "Titre": "I haven’t  exactly used the product yet…",
          "Contenu": "I haven’t  exactly used the product yet but everything I’ve e ordered from them i most definitely got no scams you can most definitely trust them to deliver."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Crystal",
          "Nb_Reviews": 1,
          "Date": "2021-01-06T23:34:55.000Z",
          "Titre": "This is my third time buying from here…",
          "Contenu": "This is my third time buying from here it takes longer than i want to receive my item but i get for great price snd it comes in grest condition and are excellent items"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jenelyn Roney",
          "Nb_Reviews": 2,
          "Date": "2022-11-10T17:52:23.000Z",
          "Titre": "Item arrived in time and it’s work"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerry David Nelson",
          "Nb_Reviews": 1,
          "Date": "2021-09-14T03:33:46.000Z",
          "Titre": "I've always had good experience with…",
          "Contenu": "I've always had good experience with repairpartsusa ive ordered several screens they have always worked great and orders are normally pretty quick...."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shirley",
          "Nb_Reviews": 3,
          "Date": "2021-08-12T14:58:48.000Z",
          "Titre": "Easy to order, return and re-order",
          "Contenu": "Easy to order. I had a return which was handled quickly. Be sure you order exactly the right part. There are many different iphone models in the same class."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2021-01-06T19:37:40.000Z",
          "Titre": "I ordered this for my brothers phone…",
          "Contenu": "I ordered this for my brothers phone and installed it myself and it worked for what it was for. Pretty decent and lasted for about 2 years until he upgraded phones."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T17:21:44.000Z",
          "Titre": "The ribbon I bought didn’t work when I…",
          "Contenu": "The ribbon I bought didn’t work when I installed it. Not 100% sure if it was bad when I got it, it may have been bent when I installed it. Customer service was great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2021-05-10T20:14:39.000Z",
          "Titre": "Great product and costumer service",
          "Contenu": "Great product and costumer service. The only complaint I might have is that it took so long for my last order to ship. Other than that, things are excellent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PAUL",
          "Nb_Reviews": 4,
          "Date": "2022-09-18T16:48:16.000Z",
          "Titre": "Part was great price",
          "Contenu": "Part was great price, works good so far. Shipping was really slow. Only drawback."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2021-07-06T20:54:32.000Z",
          "Titre": "Great website",
          "Contenu": "Ordered everything relatively easy off of your website. Everything came in a decent amount of time. Products worked as they should. I would order again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gloria",
          "Nb_Reviews": 1,
          "Date": "2021-01-22T22:20:19.000Z",
          "Titre": "Parts wasn’t quite compatible with my…",
          "Contenu": "Parts wasn’t quite compatible with my phone. I had to find a different solution to make it work. Therefore, somewhat usable. Overall great product. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2021-01-24T01:02:33.000Z",
          "Titre": "The battery works great",
          "Contenu": "The battery works great! I had to find my own tools to use which was kind of a hassle because they're a bit specific. But I received what I paid for."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Buell",
          "Nb_Reviews": 1,
          "Date": "2021-06-26T20:13:41.000Z",
          "Titre": "Easy to find I have not received the…",
          "Contenu": "Easy to find I have not received the cam yet that I ordered for our daughters iPhone 6 Plus but it looks like a reputable company by the reviews."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave Stone",
          "Nb_Reviews": 1,
          "Date": "2021-08-25T02:03:14.000Z",
          "Titre": "Website easy and smooth",
          "Contenu": "I can only review the website experience was good, I ordered a battery for my iPhone 8, it was the best price I could find.  So far, so good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elijah Luke",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T18:33:40.000Z",
          "Titre": "Screen and home button replacement",
          "Contenu": "Well my package was a day late and the home button I order was not working"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nadine",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T00:44:25.000Z",
          "Titre": "Everything wias taken care of in a…",
          "Contenu": "Everything wias taken care of in a timely manner and customer service was great on responding to my email. The lnly problem I had was getting my refund."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Guillermo Gutierrez",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T01:29:17.000Z",
          "Titre": "S10e Battery",
          "Contenu": "Received the battery I ordered quicker than expected. Very affordable price. I was able to backup and save my phone before it completely stopped working. Very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan Shoaf",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T01:57:31.000Z",
          "Titre": "The Sim card tray was an exact fit",
          "Contenu": "The Sim card tray was an exact fit. No issues no lossless it fit exactly how the original wind did. It was very cheap as far as pricewise, but for a quality product. It arrived in a timely manner when they said it would. Very happy with this company. I have been using them for over four years now for iPhone repairs and I have never had a single issue with anything I’ve ever ordered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric McPherson",
          "Nb_Reviews": 2,
          "Date": "2023-10-29T14:06:05.000Z",
          "Titre": "The screen works great",
          "Contenu": "The screen works great; I had no issues installing it. My son's Phone is like new again.  I would recommend this company to all my friends who need replacement parts for their phones."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Collins",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T21:13:40.000Z",
          "Titre": "Couldn’t be Happier",
          "Contenu": "Best place I’ve been to considering one, it’s local and two, their prices are amazing. As an upcoming business, this is a great place to shop!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jayme Fleming",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T21:06:20.000Z",
          "Titre": "Replacement screen for IPhone 11",
          "Contenu": "Absolutely amazing! The screen got delivered fast. It was in great condition and installed with no problems! 10/10 would recommend!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Connor McKenica",
          "Nb_Reviews": 3,
          "Date": "2023-04-13T22:29:31.000Z",
          "Titre": "Great replacement parts",
          "Contenu": "I've used multiple websites in the past to order parts to repair devices cheaper than going into the store to have them do it or charge me an arm & a leg to replace it. Thankfully I'm able to get every part I need here, and I can confirm the quality is superb. Great customer support if anything happens, too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kayanna jones",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T14:11:27.000Z",
          "Titre": "Awesome Screen Awesome Warranty",
          "Contenu": "Awesome screen and awesome warranty! I’ve been using Repair Parts USA for years and have never been disappointed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "McKenzie Ragle",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T17:30:50.000Z",
          "Titre": "Would Recommend to Anyone!",
          "Contenu": "This is my third time ordering from Repair Parts USA. Each time has been a great experience with fast shipping and quality products. During my most recent order, I had a faulty tool come in my repair kit. Customer service was very quick to respond to my issue, and is sending me a replacement tool to be delivered within 24 hours. Would 100% recommend this company!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R. Tran",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T10:41:26.000Z",
          "Titre": "Samsung Note 10 PLUS, Right Parts, Fast Shipping Right Price",
          "Contenu": "I received everything that i ordered for my Samsung Note 10 PLUS properly packaged and processed and shipped ver fast! (2 business day) I would like to recommend ordering parts from here any chance you get, they go above and beyond with customer service thank you Repairpartsusa !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Hardy",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T05:33:08.000Z",
          "Titre": "great experience!",
          "Contenu": "great experience!! i’m ordering again RIGHT NOW. HIT ME UP IF YOU NEED YOUR PHONE FIXED!! this is where i ALWAYS order from!!! 1000000% RECOMMEND! 💯💯"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Dillon",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T14:09:12.000Z",
          "Titre": "The iPhone 12 Pro Max Screen…",
          "Contenu": "The iPhone 12 Pro Max Screen Replacement fit perfect and was super easy to install. Highly recommend this company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Van Snyder",
          "Nb_Reviews": 3,
          "Date": "2023-04-19T21:13:55.000Z",
          "Titre": "It was a pleasure working with RepairPartsUSA",
          "Contenu": "It was a pleasure working with RepairPartsUSA. I feared I had bought the wrong replacement screen for my iPhone SE. They explained my misunderstanding, offered to let me return it anyway, and then provided a link to an excellent video how to finish the repairs. All done very quickly. I can't recommend them highly enough."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B. Walker",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T05:42:19.000Z",
          "Titre": "Great EVERYTHING",
          "Contenu": "The parts were exactly as described. Shipping was very fast and the support was on point as well. All around good experience. I highly recommend using this business. I will return if the need arises in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Palon",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T21:08:01.000Z",
          "Titre": "My latest repair of iPhone 11",
          "Contenu": "My latest repair of iPhone 11 was successful largely due to the excellent quality parts from Repairpartsusa. Quick shipping and good prices, great supplier!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike O",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T17:30:19.000Z",
          "Titre": "Bought a used iPhone (from an on-line…",
          "Contenu": "Bought a used iPhone (from an on-line reseller) that arrived absent sim-tray.  Found these guys in a google search, ordered the tray, it was affordable, easy to order and arrived in a timely manner, as advertised.  Excellent communication.  Definitely do business with them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Damian Laflamme",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T03:08:20.000Z",
          "Titre": "Absolutely perfect!",
          "Contenu": "The battery replacement works perfectly! Im so happy i got it. The replacement process was very simple."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Portia Bryant",
          "Nb_Reviews": 2,
          "Date": "2023-05-18T16:25:38.000Z",
          "Titre": "This is by far the best company you…",
          "Contenu": "This is by far the best company you will ever order from. They are quick with shipping, their customer service is astounding and they always make sure to help with any problems or issues to satisfy their customers. I will never order electronic repairs anywhere else"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sidney Kedy",
          "Nb_Reviews": 8,
          "Date": "2023-09-28T21:40:45.000Z",
          "Titre": "If they don't have the part",
          "Contenu": "If they don't have the part, you probably don't need it.  Included all installation parts & instructions, as well as the part."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gloria McQueen",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T21:08:36.000Z",
          "Titre": "I received my replacement battery for…",
          "Contenu": "I received my replacement battery for my Samsung S9 Galaxy phone in a timely manner. I just wish I would have known that you pretty much need to have it replaced professionally. Very detailed and careful replacement from what You Tube says!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elisa E",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T13:56:12.000Z",
          "Titre": "Exactly what I was looking for",
          "Contenu": "The screen protector I bought from Repair Parts USA is exactly what I was looking for. It was also the only place I could find what I wanted, online or in person. Package arrived promptly and undamaged. I was kept aware of it's progress through email which was helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather Cyr",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T04:09:53.000Z",
          "Titre": "Foxyskates are great!",
          "Contenu": "My Skates came in very quick! They’re super comfortable, stylish and true to size. I had ordered a skate bag with my skates and they forgot to send it. I reached out and they responded within minutes and sent me a bag that arrived 2 days later! I am extremely satisfied with my purchase and would continue to buy foxyskate brand in the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Bachman",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T19:20:05.000Z",
          "Titre": "Repair Parts regained my business",
          "Contenu": "Repair Parts sent me the wrong item and they did refund my money without returning the wrong item. This move has convinced me of doing business with them and understand that mistakes happen."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lori Slough",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T06:34:54.000Z",
          "Titre": "I purchased this for my daughter's…",
          "Contenu": "I purchased this for my daughter's phone. After replacing this product, bought from somewhere else before, it didn't work. So, I wasn't counting on this one to work either. I put it on, and it wouldn't even turn on. After a quick hard reset, it worked perfectly! Would definitely recommend, and do business with in the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexander Jimenez",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T00:52:15.000Z",
          "Titre": "iPhone 11 screen replacement",
          "Contenu": "Love it my customer was happy with his phone looking new like nothing happen the screen replacement was so premium I loved it so much! Definitely looking forward to buying more from y’all THANK YOU SO MUCH !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "yayunh rocha",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T20:52:18.000Z",
          "Titre": "the screen protector came intact and in…",
          "Contenu": "the screen protector came intact and in time faster than i expected it fit my phone perfect and got just what i imagined"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra Carter",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T03:03:21.000Z",
          "Titre": "The service was excellent as you kept…",
          "Contenu": "The service was excellent as you kept me updated via email with also tracking number as when delivery would happen.The product however is not sticking to my phone it keeps lifting up, now what!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Boston Bob",
          "Nb_Reviews": 2,
          "Date": "2023-04-24T13:36:54.000Z",
          "Titre": "Had an obscure product available at a…",
          "Contenu": "Had an obscure product available at a reasonable price and delivery was on time, l as promised. I will definitely go back when I need any parts again to see if they have it and how competitive is the pricing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Scifers",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T18:51:31.000Z",
          "Titre": "Right part, right price on time",
          "Contenu": "Right part, right price delivered in a timely manner. Part works as represented. I suppose this shouldn’t be considered extraordinary but in todays world it certainly is. Thanks for doing it right."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dilawar Ishaq",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T17:21:24.000Z",
          "Titre": "I recently had the pleasure of ordering…",
          "Contenu": "I recently had the pleasure of ordering 2 iPhone screens from repair parts U.S.A. and I have to say that I was extremely impressed with their of customer service. From start to finish, my experience with them was nothing short of fantastic. I forgot to add a water proof seal for one of the screens and I reached out to them to see if they can do any thing because I did not want to cancel the order. They simply said we will give you one no problem. I have to say that my iPhone looks and works better than ever. The screens are super high quality. And I definitely recommend everyone using them for their phone repair parts. The staff were professional, courteous, and efficient, and they went above and beyond to ensure I got what I needed quickly and to my satisfaction. Thankyou guys"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-02-19T01:39:37.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "Customer service is top of the line made a wrongful purchase and they canceled and refunded me within 24hrs. Thank you guys for going above and beyond to get the  transaction resolved. Definitely will do business and recommend them to anybody who is looking for quality parts at a reasonable price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Lopez",
          "Nb_Reviews": 2,
          "Date": "2023-06-01T15:00:22.000Z",
          "Titre": "I have been using Repair Parts for…",
          "Contenu": "I have been using Repair Parts for years. Sometimes I go with outside vendors, but there is always issues with faulty parts, Repair Parts never has issues the parts are of excellent quality and are reliable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Man Man",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T06:52:19.000Z",
          "Titre": "It’s great I’m glad I ordered it from…",
          "Contenu": "It’s great I’m glad I ordered it from y’all do a amazing job and I’m definitely going continue shopping with y’all thanks u very much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Max Cazares",
          "Nb_Reviews": 4,
          "Date": "2022-12-27T21:38:14.000Z",
          "Titre": "Loyal Customer",
          "Contenu": "I enjoy having a reliable site that sells nothing but the best replacement parts. I've been shopping with RPUSA for years and don't plan on stopping until phones are indestructible."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raymond",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T17:37:42.000Z",
          "Titre": "Super quality",
          "Contenu": "Always Great quality parts and fast shipping. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tonya gambrell",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T17:00:41.000Z",
          "Titre": "My order wasn’t received by the day…",
          "Contenu": "My order wasn’t received by the day they said it would arrive but once I contacted customer service they resent it with a tracking code. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zaquan White",
          "Nb_Reviews": 2,
          "Date": "2023-04-13T17:40:34.000Z",
          "Titre": "I mean I love y’all app so much fr but…",
          "Contenu": "I mean I love y’all app so much fr but it’s like when I order the iPhone se generation 3 screen it came out to be a iPhone 8 screen so I’m like what I was so pissed I have a child n it was gonna be his phone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carrie Nimbach",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T20:03:56.000Z",
          "Titre": "Efficient and professional",
          "Contenu": "Your website is easy to use, very important!!! Also, my order arrived very quickly and was cost efficient. I appreciate that"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FarmerFan FarmerFan",
          "Nb_Reviews": 2,
          "Date": "2023-03-21T17:45:53.000Z",
          "Titre": "Purchased an iPhone 7 Plus Charging…",
          "Contenu": "Purchased an iPhone 7 Plus Charging Dock Flex Cable Replacement.  I had to work with customer service on the replacement part.  They took care of me and the response was very quick !!Thanks for your service !!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Husler",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T15:39:03.000Z",
          "Titre": "Class act from beginning to end.",
          "Contenu": "Ease of ordering, excellent communication, detailed shipping and tracking, excellent packing, quality of item and function.In short this company has you covered from beginning to end. Order date January 13th Ship date January 14thReceived January 18th"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GM",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T01:12:50.000Z",
          "Titre": "5 out of 5 consistently everytime I…",
          "Contenu": "5 out of 5 consistently everytime I shop with you, will always stay loyal as long as you are in business! great prices matched with even better quality!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T01:32:49.000Z",
          "Titre": "great products and excellent delivery…",
          "Contenu": "great products and excellent delivery time no flaws in my new screen and simple installation…will most likely use this site now"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dianne",
          "Nb_Reviews": 2,
          "Date": "2023-03-17T06:12:15.000Z",
          "Titre": "Repairparts usa is a great company to order from",
          "Contenu": "Repairpartsusa is a great company to order from. For one they were very quick in shipping my product out to me. Secondly, they were very referencing in my situation. The product we purchased was the wrong product, but they worked with us and let us get this problem resolved quickly. Thank you repairpartsusa. Thank you, Barry"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan Daniel Rizo",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T22:15:50.000Z",
          "Titre": "Customer service",
          "Contenu": "My order didn’t arrive, but the customer service email me and offered a full refund. They provide great attention and they really care for the customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "peezyfx",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T14:10:17.000Z",
          "Titre": "10/10 Highly Recommend",
          "Contenu": "Cheap product but high quality and delivered in a timely fashion as advertised and shipped from USA. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Holly",
          "Nb_Reviews": 4,
          "Date": "2023-03-08T22:24:54.000Z",
          "Titre": "Fantastic prices for kit!",
          "Contenu": "I love the low price and that it comes with the tools to make the repair, but after searching for videos on how to do the repair, I realized that the glue strips for making sure your phone stays water resistant were not included. I didn't realize I needed them and assumed that because it came with a tool kit that everything I would need is included. Would love to see you include them in your kits in the future.[EDIT: MY BAD!!! The glue strips were inside of the box/bag with the battery!!! I reached out to customer service and they let me know this. I've changed my review to 5 stars. Thanks for the help!!!]Otherwise, A+ experience. Shipping was fast and the price was excellent!I would also love to see you offer repair instructions or how to videos (even if it's a link to someone else's video) in the order email. It would be a nice customer service touch!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 8,
          "Date": "2023-04-27T17:38:07.000Z",
          "Titre": "I ask for the product",
          "Contenu": "I ask for the product, come even before promises and fit okay in my IPhone, smooth business, I got what a want, everybody happy !!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nau",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T05:51:41.000Z",
          "Titre": "iPhone XR Grade A Black LCD and Digitizer Glass Screen Replacement",
          "Contenu": "wokred great dropped it  a few times since i replaced and it didnt crack or nothing good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 5,
          "Date": "2023-07-18T11:02:29.000Z",
          "Titre": "Notification - Quality",
          "Contenu": "I like being Notified of my purchase with digital invoice, with shipping status provided daily via email that is accurate to hour of my delivery by USPS-who does that-Repair Parts USA.  Quality of part received from Repair Parts USA was \"superior\" having purchased a manufacturers \"same part number\" part from another vendor a week prior to this purchase that failed to meet any claim that vendor provided. That battery was fully discharged upon delivery and was very warm while charging, took over 19 hours to fully charge, and was 70% discharged overnight without use, most notable, the battery was oversized by 1/8 inch not allowing proper seal of my phone cover, it's label had minimal data and stated made in China. The Repair Parts USA battery was exactly as stated-a new fully functional battery that was 67% charged upon delivery, and fully charged in 4 hours maybe less, I used it after charging, the next day-it shows a 92% charge after sitting non-tethered over night.  I am also confident in the battery labeling, it is the same as my Samsung OEM battery made in Japan, and yes it says \"made in Japan\".  I have high confidence in Repair Parts USA and I highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tiffany Posey",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T16:35:51.000Z",
          "Titre": "These guys are awesome!",
          "Contenu": "These guys are awesome!! I made a mistake ordering and they were quick to answer and fix my mistake!! Definitely will be ordering again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephan Isakowitz",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T16:47:07.000Z",
          "Titre": "Very fast email response time",
          "Contenu": "Very fast email response time! They also have basically every part you’ll ever need. And i can’t forget to mention the great customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aquill Tate",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T15:21:08.000Z",
          "Titre": "This repair phone kit shown me alot",
          "Contenu": "This repair phone kit shown me alot! I fix my own phones now I don’t go to anyone to fix my cellular device now. I love this kit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn Klein",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T01:22:52.000Z",
          "Titre": "Great Parts and Shipping",
          "Contenu": "I've ordered multiple parts from Repairpartsusa and they have always arrived in perfect condition and the parts have performed exactly as expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allison Curry",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T17:10:19.000Z",
          "Titre": "Updated review from support",
          "Contenu": "The phone screen I bought had some issues to it. The company is solving the issue and giving a full refund. The original shipping of the product to me was very prompt and packaged well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ahmed",
          "Nb_Reviews": 4,
          "Date": "2023-03-14T22:44:54.000Z",
          "Titre": "Have been patronizing repairpartsusa…",
          "Contenu": "Have been patronizing repairpartsusa for 2years now and I have no regrets at all I do receive my part quickly and their part are well package and works really good I will always recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Gardner",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T04:41:23.000Z",
          "Titre": "Finding the right part was a very…",
          "Contenu": "Finding the right part was a very smooth process all the way through the end."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raimond",
          "Nb_Reviews": 4,
          "Date": "2023-04-19T18:37:08.000Z",
          "Titre": "Ordering was easy",
          "Contenu": "Ordering was easy, shipping was fast and I received the product as it was described.Will return if I need to fix another phone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "casey tinkey",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T23:43:31.000Z",
          "Titre": "Love them only had one thing I got…",
          "Contenu": "Love them only had one thing I got through this website that broke a day after I got it n it was a privacy screen protector. But everything else was amazing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "沖元和子",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T04:53:12.000Z",
          "Titre": "The items I recieved were exaclty what…",
          "Contenu": "The items I recieved were exaclty what I ordered and were in great shape. They also have a great customer services and was very quick to respond. Will definitly be buying from them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tina Valencia",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T12:01:32.000Z",
          "Titre": "GO ELSEWHERE RUN",
          "Contenu": "I wanted to return the screen and ear speaker. They asked for a picture (random) I sent it and NOTHING. Never got a response. There are suppose to be returns.THAT iS A LIE."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T18:08:59.000Z",
          "Titre": "Great price",
          "Contenu": "Great price, great product, fast shipping! I got a replacement screen and came with everything ready to install! I’ll use this site whenever I need a screen replacement"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T01:34:18.000Z",
          "Titre": "Great Part Store",
          "Contenu": "I've ordered many parts from here and it's very good quality for the price. I just recently bought the wrong parts and asked if I could do an exchange and they said of course! The customer service is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 2,
          "Date": "2023-05-16T18:24:50.000Z",
          "Titre": "I use repairpartsusa for all my iPhone…",
          "Contenu": "I use repairpartsusa for all my iPhone and iPad repair needs my customers are always satisfied with the results so I’ll keep using them !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacob R",
          "Nb_Reviews": 4,
          "Date": "2023-03-31T17:18:12.000Z",
          "Titre": "iPhone 12 Pro Max screen replacement…",
          "Contenu": "iPhone 12 Pro Max screen replacement worked out great! Great quality and service. Super fast shipping!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LHVermont",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T00:05:50.000Z",
          "Titre": "Prompt service",
          "Contenu": "Prompt service, item arrived as described. The price was much less than other similar products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Keys",
          "Nb_Reviews": 3,
          "Date": "2023-02-08T15:45:28.000Z",
          "Titre": "Great experience in ordering parts…",
          "Contenu": "Great experience in ordering parts online. The website work with ease. Can’t wait to receive the parts I ordered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T09:17:41.000Z",
          "Titre": "Honestly the guesswork and sickness are…",
          "Contenu": "Honestly the guesswork and sickness are now a thing of the past. Broken iPhone now a fraction of the cost to repair with lKQ parts from repair parts USA.com. Thanks a million"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kay",
          "Nb_Reviews": 1,
          "Date": "2022-12-29T07:37:28.000Z",
          "Titre": "Price, availability, and reliability.",
          "Contenu": "Best price on parts, great detail of what’s included, always have the parts you need, easy and convenient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-10-19T21:33:31.000Z",
          "Titre": "Exactly what I needed when I needed",
          "Contenu": "Exactly what I needed when I needed, Thaks for sending exactly what I needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mingo Alba",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T17:59:32.000Z",
          "Titre": "Great place to do business",
          "Contenu": "They where very helpful and fast response in an issue with my address hope to deal with them again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Norma Jacobo",
          "Nb_Reviews": 1,
          "Date": "2022-12-26T07:07:24.000Z",
          "Titre": "Great information on product for a…",
          "Contenu": "Great information on product for a iphone se replacement screen, easy check out and the great price !!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel Deitsch",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T03:07:44.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping. Delivery not so much. Got lost in the mail. Products were in great shape when received. Work wonderful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Basacchi",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T19:38:21.000Z",
          "Titre": "Great screen, great price",
          "Contenu": "Very simple replacement. Screen is great. No issues. Will use again for all my screen replacement needs"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 5,
          "Date": "2023-03-08T19:40:29.000Z",
          "Titre": "Shipping was fast, good experience",
          "Contenu": "The shipping was fast. The product was exactly as described. Everything about the transaction was positive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darius Ouderkirk",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T06:22:14.000Z",
          "Titre": "The parts I needed at a great price",
          "Contenu": "They had exactly the parts I needed and the prices were great. Shipping was fast and when I contacted them with a question they were quick to get back to me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon A",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T16:23:30.000Z",
          "Titre": "Camera replacement for s10e was a…",
          "Contenu": "Camera replacement for s10e was a perfect fit and works pretty good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JustAnswer Customer",
          "Nb_Reviews": 3,
          "Date": "2023-03-25T17:23:34.000Z",
          "Titre": "Easy site to navigate",
          "Contenu": "Easy site to navigate. Product is exactly what I needed. Quick efficient service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon Graham",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T05:50:05.000Z",
          "Titre": "Ordered a screen replacement, was bad",
          "Contenu": "Had a bad experience but repairpartsusa solved the issue quick and easy! 5 star rating!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Howarth",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T19:30:41.000Z",
          "Titre": "Seemed easy",
          "Contenu": "Seemed easy. Reasonable price. Site was easy to navigate. If the parts that show up are as advertised, it will be great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Great chigozirim",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T03:50:26.000Z",
          "Titre": "I ordered this screen as a skeptic",
          "Contenu": "I ordered this screen as a skeptic. I chose the OLED over the regular. And this is perfect. The screen functions are supposed to.I would recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Downey",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T19:09:27.000Z",
          "Titre": "I like that the part was at a nice…",
          "Contenu": "I like that the part was at a nice price and that the service was fast and promptly mailed out.. my daughter was happy n excited for her phone to b fixed.. Great job guys Great prices and great experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Noeh",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T03:09:08.000Z",
          "Titre": "Great parts",
          "Contenu": "Received multiple parts from here none with any problems. Shipped and delivered on time as well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bridgette",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T14:29:39.000Z",
          "Titre": "Will Always buy here",
          "Contenu": "I've had to buy a few parts for different iphones now. They all work and received fast. Will remain a customer to them! This is my 3rd buy of parts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edgar Garcia Zuniga",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T13:15:01.000Z",
          "Titre": "the screen looks good and its really…",
          "Contenu": "the screen looks good and its really fast and i thought it was going to kinda glitch but its the best quality . The bestest and cheapest screen ever bought"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis Toledo",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T01:35:24.000Z",
          "Titre": "Badass displays",
          "Contenu": "This company does very well with shipping and their quality is actually good👍🏽"
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "amarie",
          "Nb_Reviews": 3,
          "Date": "2023-02-15T13:40:18.000Z",
          "Titre": "....",
          "Contenu": "Had an issue where I received a broken screen, but I've been given a refund"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bobby",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T09:30:56.000Z",
          "Titre": "my products that i ordered was  easy…",
          "Contenu": "my products that i ordered was  easy and fast looking to by bulk of my ideas they have treated me very well and thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glidden Droz",
          "Nb_Reviews": 2,
          "Date": "2023-03-15T04:28:22.000Z",
          "Titre": "Good customer service",
          "Contenu": "Good customer service, my screen was shipped right away. Very satisfied"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bram Moreinis",
          "Nb_Reviews": 4,
          "Date": "2023-01-12T14:50:57.000Z",
          "Titre": "Success re: returning a part",
          "Contenu": "I ordered the wrong part (battery for an iPhone 6S when I needed a 6SE) and was able to return it for a full refund, even though it was my own fault.  Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chloe Kuvaja",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T03:35:30.000Z",
          "Titre": "Great stuff as usual",
          "Contenu": "Great stuff as usual. Always get good, solid parts from these guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-03-27T01:14:03.000Z",
          "Titre": "My experience was good",
          "Contenu": "My experience was good, it was easy to purchase from and shipping was super fast!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andre Kelley",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T04:14:03.000Z",
          "Titre": "Very Affordable",
          "Contenu": "Mainly how fast i checked out,plus how easy it was to find the product i wanted for an affordable price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T19:43:18.000Z",
          "Titre": "Good quality for great price",
          "Contenu": "Good quality for great price. Communicates next day by email."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gabriel chavez",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T21:24:35.000Z",
          "Titre": "I bought the iphone 11 replacement…",
          "Contenu": "I bought the iphone 11 replacement screen (Grade A) and it is very nice for the low price!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allan Cooper",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T01:54:02.000Z",
          "Titre": "Happy Customer",
          "Contenu": "Easily found what I needed on your webpage, it came quickly, and the price was reasonable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacob R",
          "Nb_Reviews": 4,
          "Date": "2023-04-25T14:35:03.000Z",
          "Titre": "Great!",
          "Contenu": "This was my my second purchase from RepairPartsUSA. Great iPhone parts and fast shipping!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alonso Miramontes Huitron",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T23:01:13.000Z",
          "Titre": "I received everything in good…",
          "Contenu": "I received everything in good condition, looks like good quality too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Savannah Tyler",
          "Nb_Reviews": 2,
          "Date": "2023-08-02T18:29:08.000Z",
          "Titre": "IPhone XR replacement screen",
          "Contenu": "I always order my iPhone replacements from repair parts USA I’ve never been disappointed they are definitely fast and reliable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Wren",
          "Nb_Reviews": 3,
          "Date": "2023-02-09T07:07:25.000Z",
          "Titre": "I always deal with repair parts USA…",
          "Contenu": "I always deal with repair parts USA when ordering screen replacements.. I've never been disappointed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles H",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T20:38:48.000Z",
          "Titre": "6s screen",
          "Contenu": "6s screen, battery and home button replaced and work perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kurstin Kilgore",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T06:14:06.000Z",
          "Titre": "How they are fast on shipping and…",
          "Contenu": "How they are fast on shipping and decent on pricing with all their stuff"
        }
      ]
    }
  ]
}