{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "ringbritain.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "yakov",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T21:56:42.000Z",
          "Titre": "closed my account for no reason",
          "Contenu": "My PIN did not go through and I called them and they said they need to verify if the last number I tried to call was from a family or friend or for business I told them the number was from a friend but they  didn't believe it but asked if it was a family or a friend, I said friend, they said that they have to close my account because they see that someone with the same last name as mine also called the number and they know that I say Not the truthAnd the 1 star I give is because they at least gave me my money back"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Graham T",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T18:44:41.000Z",
          "Titre": "Unable to activate credits to my account",
          "Contenu": "After 3 years of great service I tried to add some additional time to my account. Despite polite and prompt responses (an email chain of 7 emails) from RingBritain customer support they were unable to work with my telco provider (Fido in Canada) to apply the credit amount.  I also spoke with Fido who had no knowledge of RingBritain and therefore could not help.  Unfortunately RingBritain are not willing to refund my credit card payment made to them either."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NC",
          "Nb_Reviews": 1,
          "Date": "2022-08-26T22:04:28.000Z",
          "Titre": "Calls keep dropping when in a wifi mesh…",
          "Contenu": "Calls keep dropping when in a wifi mesh environment.  Feels like it cannot handle switching from wifi point to wifi point even though coverage is continuous."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cynthia Difford",
          "Nb_Reviews": 3,
          "Date": "2022-09-29T13:31:26.000Z",
          "Titre": "Usually the service is excellent but I…",
          "Contenu": "Usually the service is excellent but I had an irritating situation. I was in deep discussion with a very dear old friend and RingBritain stopped it with a message of this number is not a working number or something like that and then off! I have to deal with organizations for my retirement so this could be a true headache!"
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "bubba",
          "Nb_Reviews": 2,
          "Date": "2022-03-10T11:58:40.000Z",
          "Titre": "your services do not work properly the…",
          "Contenu": "your services do not work properly the access number you gave me never works.. I don't know what I'm paying for...."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Ringel",
          "Nb_Reviews": 1,
          "Date": "2022-01-03T00:39:04.000Z",
          "Titre": "The lack any customer service is very…",
          "Contenu": "The lack any customer service is very frustrating. There is no phone or email to address problems."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Saby Neiman",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T00:31:43.000Z",
          "Titre": "A few issures",
          "Contenu": "*  It doesn't let me enter my number to register.*  My speed dials don't work. It says 'not enough credit'.I am very not happy with it."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "r.z",
          "Nb_Reviews": 1,
          "Date": "2022-08-27T23:57:00.000Z",
          "Titre": "Often when I use the account to call…",
          "Contenu": "Often when I use the account to call abroad then a foreign person answers and it is very frustrating"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "goldy march",
          "Nb_Reviews": 2,
          "Date": "2022-10-06T11:59:25.000Z",
          "Titre": "ring britain doesnt seem to allow me to…",
          "Contenu": "ring britain doesnt seem to allow me to call mobiles abroad. Please can you help me asapThanks!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Walter Manning",
          "Nb_Reviews": 1,
          "Date": "2021-11-05T20:55:40.000Z",
          "Titre": "Could never get the calling card to…",
          "Contenu": "Could never get the calling card to work from USA to UK"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve Taylor",
          "Nb_Reviews": 1,
          "Date": "2022-08-21T13:33:53.000Z",
          "Titre": "Doesn't work",
          "Contenu": "Doesn't work, impossible to cancel"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Schueler",
          "Nb_Reviews": 2,
          "Date": "2021-01-24T19:36:57.000Z",
          "Titre": "I tried on several occasions last week…",
          "Contenu": "I tried on several occasions last week to reach my brother who lives in London. After several failed attempts to use RingBritain's system, I wrote to you looking for help.No response was received from your firm.I will continue to be a subscriber, and hope that you will eventually offer some advice."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elaine Reichenbach",
          "Nb_Reviews": 2,
          "Date": "2019-12-02T16:26:30.000Z",
          "Titre": "Customer Service do not respond",
          "Contenu": "I recently started using \"Ring Britain\" again as it had been a good service in the past. I have an issue that when I call my access number my smart phone says I am \"calling Kenya\". This makes me nervous as I do not know if I will be charged correctly.  I have messaged customer service twice and no one responded."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Magee",
          "Nb_Reviews": 3,
          "Date": "2017-04-27T18:39:16.000Z",
          "Titre": "Poor quality horrible support send …",
          "Contenu": "Poor quality horrible support send survey with ad to buy more don't care at all about the customer after reading my review ring Britain decided to punish me and make the connection far worse so to make my service returned to bad I withdraw my comments hopefully this will allow the service to go back to barely useable"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Magee",
          "Nb_Reviews": 3,
          "Date": "2017-08-26T11:43:06.000Z",
          "Titre": "There is not an option for zero stars …",
          "Contenu": "There is not an option for zero stars so I gave it one.there is a delay in the call so you are five seconds behind when you talk. Sometimes the call goes into a repeat mode so you aren't able to speak live you suddenly hear the party in England repeating over and over. Wish an alternative was available."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Schueler",
          "Nb_Reviews": 2,
          "Date": "2021-05-24T17:15:46.000Z",
          "Titre": "Poor Service",
          "Contenu": "Despite several letters that I sent to your firm, complaining about the inability to use your 'phone service. you now have the audacity your my experience ask for my opinion. How you stay in business is a mystery to me.John Schueler"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Incredulous !!!",
          "Nb_Reviews": 1,
          "Date": "2014-12-31T01:57:52.000Z",
          "Titre": "Over charged for calls",
          "Contenu": "Calls from Australia to a mobile in South Africa. Initially charged at advertised rate of 6.9 cents/min for first year of using RingBritain. Last $30.00 I was charged at 49.9 cents/min (over 3 times what I would have been charged using my normal provider). When contacted they told me this was the charge by the MTN provider in South Africa and that I had always been charged this rate. Laughing at the \"help\" person on the other end didn't get this issue solved. I will definitely NEVER use RingBritain again !!!!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julie",
          "Nb_Reviews": 3,
          "Date": "2020-01-26T16:22:17.000Z",
          "Titre": "Love the fact that I can talk to my…",
          "Contenu": "Love the fact that I can talk to my friends and family in UK at such a reasonable rate at any time and with no time restrictions. I do wish they had a good deal for calling cell/mobile phones as many people today do not have landlines."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "HC",
          "Nb_Reviews": 4,
          "Date": "2018-05-01T16:55:30.000Z",
          "Titre": "i find the quality of the line very…",
          "Contenu": "i find the quality of the line very poor most of the time. I am using this service to phone clients on mobile uk numbers and often they cannot hear me and at times i have to resort to costly calls from my own mobile. The charges are inexpensive but the line is terrible. I ask myself why I have not tried to find a better service (line quality wise) all the time. My colleagues who use this service say exactly the same thing so it is not any settings that are the problem as far as I can see. Also the line comes up looking like I am calling from the US so some people do not trust this and don't answer these calls"
        },
        {
          "Note": 1,
          "Lieu": "LV",
          "Pseudo": "Talmid Haham",
          "Nb_Reviews": 1,
          "Date": "2021-07-10T10:33:41.000Z",
          "Titre": "web calling doesn't work",
          "Contenu": "web calling doesn't work. would be better if option didn't require some special pc requirements but would be widely and easily accessible on any laptop"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tarun Gupta Akirala",
          "Nb_Reviews": 1,
          "Date": "2017-02-19T16:56:30.000Z",
          "Titre": "Bad connection.",
          "Contenu": "Very bad connection. Takes too long to connect. The other person keeps hearing their own voice and the voice is distorting."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "B. Gallagher",
          "Nb_Reviews": 1,
          "Date": "2019-09-26T11:21:02.000Z",
          "Titre": "Ring Britain.com was exactly what I…",
          "Contenu": "Ring Britain.com was exactly what I wanted and I have not been disappointed"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Jean Hopwood",
          "Nb_Reviews": 2,
          "Date": "2019-12-11T03:31:25.000Z",
          "Titre": "STOP SENDING ME EMAILS.....",
          "Contenu": "STOP SENDING ME EMAILS...... EVEN AFTER UNSUBCRIBING"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AH",
          "Nb_Reviews": 1,
          "Date": "2017-05-26T22:40:19.000Z",
          "Titre": "Having lots of issues",
          "Contenu": "Having lots of issues.  Calls keep dropping.  Useless"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Moira Maughan",
          "Nb_Reviews": 1,
          "Date": "2019-06-02T09:26:14.000Z",
          "Titre": "Poor quality",
          "Contenu": "I find that the line is always poor to England."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Magee",
          "Nb_Reviews": 3,
          "Date": "2016-11-30T02:54:07.000Z",
          "Titre": "Horrible service condescending arrogant belittling those were there best qualities",
          "Contenu": "Think the title said it all rude."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Cliff Thwaites",
          "Nb_Reviews": 6,
          "Date": "2020-08-01T19:20:58.000Z",
          "Titre": "Good reliable service"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Paul Balcombe",
          "Nb_Reviews": 10,
          "Date": "2022-12-06T01:38:43.000Z",
          "Titre": "too much information and unable to use…",
          "Contenu": "too much information and unable to use the system"
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "Flower",
          "Nb_Reviews": 11,
          "Date": "2022-10-11T14:02:23.000Z",
          "Titre": "I cannot get through on ring Britain",
          "Contenu": "I have used ring Britain successfully for some years, and always found it very good. Of late, however, for past few weeks,  I cannot get through to the mobile numbers I usually call. Very frustrating."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Guillaume Pomerleau",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T11:03:40.000Z",
          "Titre": "Unfortunately became buggy lately",
          "Contenu": "I've used this app for a while now. I would have given it 4 stars before but I've recently been having issues with the microphones just stopping to work mid-conversation (I have to toggle between between the microphone to temporarily solve the issue, but it keeps reappearing multiple times in conversations). Calls also just drop unexpectedly. I've tried not using a VPN, I make sure I get a powerful and clean wifi signal, but the calls keep dropping randomly. I'm giving this app a chance for a few more weeks because it served me so well in the past, but I don't intend on putting up with bugs for much longer than that."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Gregory Jacobs",
          "Nb_Reviews": 2,
          "Date": "2022-07-23T18:27:31.000Z",
          "Titre": "Forever to register",
          "Contenu": "After receiving a strong recommendation from a close relative who uses RingBritian, I spent days! trying to raise the website to register. I even had other professional MAC users try. We changed browsers.There did not seem to be any way to contact  a person to deal with the problem. I'm still unsure how to place a call form a phone not my own."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "professoreugene",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T15:04:17.000Z",
          "Titre": "Had to reconnect to my brother 3 times…",
          "Contenu": "Had to reconnect to my brother 3 times during one conversation, I got cut off so often."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Sharon",
          "Nb_Reviews": 3,
          "Date": "2022-03-04T12:02:43.000Z",
          "Titre": "I just want to make sure I can now call…",
          "Contenu": "I just want to make sure I can now call Canada from the UK with RingBritain.I have not been able to get any response from a representative on that.  I went ahead and added money to do so, but I dont know if when I call Canada, I am paying 2 pence or 40 pence."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kimberly Swain",
          "Nb_Reviews": 1,
          "Date": "2022-04-04T18:34:24.000Z",
          "Titre": "Unreliable",
          "Contenu": "3 times during our call my father-in-law could hear us and we could not hear him so we had to call back several times.  Annoying….."
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "mo lev",
          "Nb_Reviews": 2,
          "Date": "2022-03-06T06:38:47.000Z",
          "Titre": "the line frequently don't work",
          "Contenu": "the line frequently don't workotherwise great service"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Withheld for legal reasons",
          "Nb_Reviews": 2,
          "Date": "2021-04-20T06:32:05.000Z",
          "Titre": "Calls made via Ring Britain to certain…",
          "Contenu": "Calls made via Ring Britain to certain UK switchboards cannot get through - always get message that they are engaged but they are not. An immediate call from a different phone not using Ring Britain always gets through. This has been reported to Ring Britain but no response."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "cj phillips",
          "Nb_Reviews": 2,
          "Date": "2020-04-21T19:46:08.000Z",
          "Titre": "Do not follow through with bonus credits promised",
          "Contenu": "Topped up $20  and applied code given for easter and should have got $3 bonus time but did not. So asked for it to be applied - they would not so asked them to refund $15 but refunded whole amount. It is not the first time they have made out they have a deal on and then not given credit promised"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GF",
          "Nb_Reviews": 1,
          "Date": "2018-04-01T15:13:55.000Z",
          "Titre": "RingBritain has the irritating feature…",
          "Contenu": "RingBritain has the irritating feature that it cuts you off when your balance is getting low and demands that you put more money in before you can use the service.  So with several hundred minutes in my account and not having access to make a top up payment I was left stranded.  Something completely unnecessary driven by a desire to get the customer's money in a bit quicker - it spoils an otherwise good service with a good website"
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "Patricia June Ayton Chambers",
          "Nb_Reviews": 3,
          "Date": "2018-07-06T20:25:29.000Z",
          "Titre": "My phone company decided to make the…",
          "Contenu": "My phone company decided to make the local access numbers premium without publishing the change and I have been charged rather a large amount of money. This is new. Have changed to 900.... number and although you pay 4 cents a minute, it's much cheaper than paying the rent phone service provider."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Geoff",
          "Nb_Reviews": 1,
          "Date": "2018-06-17T09:04:02.000Z",
          "Titre": "Absolute rubbish customer support.",
          "Contenu": "I would have given you zero stars if I could, except that your staff member was not rude (as per your description of 1 star).Your staff member did not answer my question, but I assume that it has been closed, otherwise I wouldn't have got this survey.Because you haven't answered my question, it still looks to me that you will steal my money.Trustpilot: the \"Terms & Conditions\" and \"Privacy Policy\" links below need scroll bars on the windows which open. They are probably legally meaningless the way they are now."
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "Beaky Battenti",
          "Nb_Reviews": 2,
          "Date": "2018-11-24T08:20:56.000Z",
          "Titre": "Have used ring Britain for the last…",
          "Contenu": "Have used ring Britain for the last couple of years or so to ring the UK from Ireland. On the whole it has been quite good. But in the last few months the call quality has been poor with a 2 to 3 second time delay. Time to find a different supplier now I think."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mykul",
          "Nb_Reviews": 3,
          "Date": "2019-12-28T17:26:51.000Z",
          "Titre": "Used to be excellent",
          "Contenu": "Used to be excellent. After I plunked down $50, call quality sucks. Really has gone downhill. What happens if a few minutes into the call one side or the other goes silent. Have to call back, 3-4 minutes into it, silence on one end."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "HC",
          "Nb_Reviews": 4,
          "Date": "2017-07-13T10:09:23.000Z",
          "Titre": "I have a lot of problems with the line …",
          "Contenu": "I have a lot of problems with the line when I ring mobile numbers. 50% of the time, the line breaks up and I am probably going to change providers unless this improves. Has been the same for 18 months now so may have to vote with my feet !"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Myer Goldberg",
          "Nb_Reviews": 3,
          "Date": "2018-11-23T23:43:24.000Z",
          "Titre": "My 2 credits cards  would not go…",
          "Contenu": "My 2 credits cards  would not go through on line, old card out of date, had to ring your help line to get it sorted, both cards are OK, should beeaser to change a credit card."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "suzanne B",
          "Nb_Reviews": 2,
          "Date": "2017-05-02T11:09:43.000Z",
          "Titre": "Terrible call quality using the app",
          "Contenu": "Terrible call quality using the app. Long periods of dead air. They don't care about this. I've been using RingBritain for years and it's getting worse."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "patricia fordham",
          "Nb_Reviews": 15,
          "Date": "2019-12-18T00:55:19.000Z",
          "Titre": "Incorrect price charges",
          "Contenu": "They state that you only get charged when the call is answered but YOU GET CHARGED ON CONNECTION."
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "Margaret Buckley",
          "Nb_Reviews": 4,
          "Date": "2017-05-16T21:43:18.000Z",
          "Titre": "Some calls have a lot of interference …",
          "Contenu": "Some calls have a lot of interference on the line and drop for no reason"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "franc rebec",
          "Nb_Reviews": 1,
          "Date": "2017-08-09T22:12:08.000Z",
          "Titre": "noisy chappy and gargling",
          "Contenu": "noisy chappy and gargling. it used to be better."
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Mrs Falk - Lobenstein",
          "Nb_Reviews": 3,
          "Date": "2023-10-12T12:57:23.000Z",
          "Titre": "Who is the call from?",
          "Contenu": "The numbers come up in England as numbers from Honlolulu etc. and the receiver does not know whose calling or who to call back."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marion Widows",
          "Nb_Reviews": 5,
          "Date": "2023-02-22T16:20:50.000Z",
          "Titre": "Credit card update",
          "Contenu": "It wasn't easy to update expiration date on my credit card. No customer service phone number. After several days of trying I finally was able to do it.Love RingBritain. Good for 5 years.Yeah!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Caroline Moore",
          "Nb_Reviews": 1,
          "Date": "2022-09-26T16:19:18.000Z",
          "Titre": "My experience varies widely",
          "Contenu": "Sometimes the connection is fine, and sometimes there is an echo, or even the person cannot hear me, and I have to call again."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "goldy march",
          "Nb_Reviews": 2,
          "Date": "2022-02-07T15:20:54.000Z",
          "Titre": "Well to be honest at the begining it…",
          "Contenu": "Well to be honest at the begining it was great but past week or 2 at least!, it has been playing up and cant seem to call abroad easilly!!Please help me!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Smith",
          "Nb_Reviews": 4,
          "Date": "2021-12-23T18:38:23.000Z",
          "Titre": "You sent me a $2.00 coupon to use by…",
          "Contenu": "You sent me a $2.00 coupon to use by Dec (6th?) if placed a $15.00 minimum order.   I tried to do this with the coupon code and the lowest it would allow me to buy was $25.00 amount.   This felt like a scam.Bob Smith"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Vithal Chhatralia",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T22:29:19.000Z",
          "Titre": "When an urgent help is required",
          "Contenu": "When an urgent help is required, it is not there. A live chat will be very helpful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Derek Dalton",
          "Nb_Reviews": 2,
          "Date": "2021-02-19T16:41:12.000Z",
          "Titre": "I once called customer service to ask…",
          "Contenu": "I once called customer service to ask whether the length of calls was limited, and was told that they were not. However, my experience has been different. After an hour or so -- once it was only 5 minutes -- my calls are often terminated by an auto voice saying, \"The number you have dialed is incorrect. Please enter the number you wish to call.\" I would appreciate an explanation of why the auto voice keeps cutting me off. Apart from this annoying feature, Ring Britain is an excellent deal!Derek Dalton"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ernest Dunbar",
          "Nb_Reviews": 4,
          "Date": "2020-08-11T14:52:45.000Z",
          "Titre": "Calling Home",
          "Contenu": "My wife uses your service to call home.  Overall it is a good service, however, there have been times where she has had to call over and over to get access to the overseas area she calls.  This combined with the occasional less than quality line she expects to get is the reason for the rating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony Harris",
          "Nb_Reviews": 3,
          "Date": "2015-05-13T22:28:27.000Z",
          "Titre": "What is going on",
          "Contenu": "My experience with ring britain is now becoming tiresome. After my first problem when I had to start entering a code to enable me to place a call and contacting you and that being solved, this week my credit card disappears and my automatic renewal does as well thus stopping me from making calls. Your agent tho' being polite did not understand me to well and could not get the fact that I have been with you for a considerable amount of time with a credit card on file and automatic renewal \r2 strikes so far in three weeks"
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Nigel de Sylva",
          "Nb_Reviews": 12,
          "Date": "2016-10-21T20:02:37.000Z",
          "Titre": "Variable quality",
          "Contenu": "At times it is very good value for money, but at times after getting through to Ring Britain and inputing my required number, it starts ringing then stops and I am asked to dial the number I require...can happen about three times and then I am told \"goodby\" and then cut off."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Cowell",
          "Nb_Reviews": 1,
          "Date": "2018-03-21T15:09:34.000Z",
          "Titre": "The calls from USA to UK keep dropping…",
          "Contenu": "The calls from USA to UK keep dropping the sound or the call dropped completely. Price is not bad but quality of the app is poor and unstable. The sound when working well is good but in one conversation the sound can drop several times."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "georgine murphy",
          "Nb_Reviews": 1,
          "Date": "2018-09-20T17:41:03.000Z",
          "Titre": "The line I had was very poor",
          "Contenu": "The line I had was very poor. Spent over an hour on the fone to my bank and it was such hard work. Did try to call back and get another line. No better. However. I have used ring Britain for years and this is the first bad line."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Morice",
          "Nb_Reviews": 3,
          "Date": "2018-04-20T15:53:41.000Z",
          "Titre": "beware scam",
          "Contenu": "booked through a 3rd party charging 20% commission, while thinking I had booked online direct with the taxi firm. No way to get back to them to cancel transaction.  Paid 95 GBPs therefore instead of 80 GBPs. Beware this scam."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Frustrated user.",
          "Nb_Reviews": 2,
          "Date": "2017-08-19T03:07:29.000Z",
          "Titre": "App needs fixing but call number is good.",
          "Contenu": "The app is crap and the calls never connect. Or drop out after only a few seconds. When you call up on the ringbritian number then dial that way, it works great. So if they just fix the app it would be 6 stars."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carol Robinson",
          "Nb_Reviews": 4,
          "Date": "2019-01-03T17:15:48.000Z",
          "Titre": "RingBritain is great, but...",
          "Contenu": "RingBritain is great, when it works right.  Lately I've been getting a message which says, \"You do not have enough credits\" when I try to make a call.  The problem is that I am on a monthly plan that automatically renews, so \"enough credits\" should never be a problem.  Sometimes it doesn't tell me I don't have enough credits, but instead said I dialed a non-working number.  I hope they get these problems resolved.EDIT:  After reading the response from RingBritain, I just want to say that they are incorrect.  I was calling a number in England and I was using the correct codes.  It is about the only number I call and know for a fact that I dialed correctly.  They still have a problem on their end that needs to be resolved.  Once that has been taken care of, I would say they deserve 5 stars!"
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Shrohith Reddy",
          "Nb_Reviews": 1,
          "Date": "2014-11-20T15:02:44.000Z",
          "Titre": "Most times it works and few times it is as bad as it gets...",
          "Contenu": "Most times the call quality is good. Sometimes it gets bad for a period of time how many ever time I try. After a few minutes it will work well again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "J. Hall",
          "Nb_Reviews": 4,
          "Date": "2018-10-02T18:32:39.000Z",
          "Titre": "Love the price but cumbersome process",
          "Contenu": "Love the price. From a land line I don’t  like having to dial a number, enter a code, and then enter the number you’re calling."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "HC",
          "Nb_Reviews": 4,
          "Date": "2020-11-19T07:56:17.000Z",
          "Titre": "Calling service",
          "Contenu": "A good service in general but often i find the signal not as clear as it is on whatsapp which is free."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "rajinder khullar",
          "Nb_Reviews": 9,
          "Date": "2021-12-21T01:07:19.000Z",
          "Titre": "The calls break up and hard to hear"
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Marc G",
          "Nb_Reviews": 2,
          "Date": "2019-05-01T21:48:51.000Z",
          "Titre": "Works well and great value no customer support",
          "Contenu": "Works well and great value. Customer service poor never reply to questions or issues."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "patricia fordham",
          "Nb_Reviews": 15,
          "Date": "2018-10-13T20:12:41.000Z",
          "Titre": "I am being charged for UNANSWERED CALLS…",
          "Contenu": "I am being charged for UNANSWERED CALLS for whatever reason!!!!"
        },
        {
          "Note": 3,
          "Lieu": "IE",
          "Pseudo": "Margaret Buckley",
          "Nb_Reviews": 4,
          "Date": "2017-12-12T03:54:07.000Z",
          "Titre": "Very cheap and convenient but reception …",
          "Contenu": "Very cheap and convenient but reception poor at times"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "peter Andrew",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T19:42:16.000Z",
          "Titre": "Very helpful young lady who was very…",
          "Contenu": "Very helpful young lady who was very patient getting issue rectified. Thanks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 14,
          "Date": "2022-06-27T22:18:03.000Z",
          "Titre": "The app is easily installed, BUT...",
          "Contenu": "The app is easily installed, the rates are very good and easy to top up via PayPal. The only problem is an occasional occurrence -sometimes when I phone someone  they can't hear my voice. Not faint, totally absent. And this persists for a while through repeated re-dialings. Sometimes my efforts are angrily mistaken for repeated crank calls.  On those occasions I then have to redial via Messenger or a similar platform, but this only works if the person to whom I wish to speak is on Facebook. Or WhatsApp."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 14,
          "Date": "2023-03-22T20:25:30.000Z",
          "Titre": "On balance, an excellent service",
          "Contenu": "No problems whatsoever adding money; occasionally however after the number is dialed it will ring once or twice and then go silent. This necessitates dialing again and hoping that the call will go through this time. Nevertheless, because the rates are so good, a bit of inconvenience is excusable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ann Edwards",
          "Nb_Reviews": 2,
          "Date": "2023-01-03T18:59:13.000Z",
          "Titre": "Have been using this service for years…",
          "Contenu": "Have been using this service for years and have had a great experience. Low cost even when you call from your cell phone. I wish there wasn't a time limit or it would give an option to extend your time rather than cutting you off abruptly."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Agnes Murray",
          "Nb_Reviews": 8,
          "Date": "2021-11-30T17:26:46.000Z",
          "Titre": "I am very happy with your phone service…",
          "Contenu": "I am very happy with your phone service tothe UK. I was tired of being overcharged by my phone company for long distance calling and more so with overseas calls.Thanks again for your option to call Britain we are retirees and enjoy your phone service for overseas calling. Andrew."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pete F",
          "Nb_Reviews": 4,
          "Date": "2021-09-15T12:21:56.000Z",
          "Titre": "Great service, but....",
          "Contenu": "I have used RingBritain for a number of years, 10ish I think, and it has been excellent.  The only issue I have had is in the last week, when I was in a call with the UK and got a warning about low credit. 20 seconds later, without a chance to talk to the person I was speaking to, my call was dropped. Since it was a call center that I had waited 25mins to connect to I was a little perturbed!!  Other than that faultless. I topped up the credit and continue to use, just keep an eye on your credit....."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Gitt Bilig",
          "Nb_Reviews": 2,
          "Date": "2023-04-20T01:16:33.000Z",
          "Titre": "Great",
          "Contenu": "Great! but I can't find a help center to chat with a human, or to send any inquire to a human.also we need a local Belgium number to use the calling card."
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Israeli User",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T14:05:22.000Z",
          "Titre": "usually good",
          "Contenu": "usually good ring britian must make sure that the system always works which is not the case, it,s sometimes a bit on and off"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeanette McClennan",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T01:12:09.000Z",
          "Titre": "Great value for money and good quality…",
          "Contenu": "Great value for money and good quality calls.My only complaint is that sometimes the sound disappears, but once I call back it is restored."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda Muir",
          "Nb_Reviews": 2,
          "Date": "2021-12-28T11:35:43.000Z",
          "Titre": "I have been a customer for the past…",
          "Contenu": "I have been a customer for the past year and call the UK 3-4 times a week. I am very happy with this service. I haven’t experienced any problems. Great way to stay connected to family in the UK at a very cheap rate."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mark Beasley",
          "Nb_Reviews": 9,
          "Date": "2023-08-05T17:08:12.000Z",
          "Titre": "Unfortunately every time I try to call…",
          "Contenu": "Unfortunately every time I try to call a 0800 number in the UK it never works."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tracey Ann Petrie",
          "Nb_Reviews": 3,
          "Date": "2021-09-12T13:11:01.000Z",
          "Titre": "Dropped 1 star because it does depend…",
          "Contenu": "Dropped 1 star because it does depend on internet signal, which sometimes isn't strong enough to make call."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jon Owen",
          "Nb_Reviews": 2,
          "Date": "2022-05-05T15:47:37.000Z",
          "Titre": "Good service",
          "Contenu": "Very happy with the service which I use to call home from Florida once or twice a week.  My only gripe is that the line drops off and I have to redial at around the 23 minute mark every time I use it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 6,
          "Date": "2022-12-16T17:47:38.000Z",
          "Titre": "The extra bonus incentive is a good deal.",
          "Contenu": "The extra bonus incentive is a good deal. Low price and good connection from US to Europe.Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GC",
          "Nb_Reviews": 6,
          "Date": "2022-07-22T13:45:24.000Z",
          "Titre": "Overall great service",
          "Contenu": "Overall great service. Occasional drop outs but mostly clear audio"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Ray Gurney",
          "Nb_Reviews": 7,
          "Date": "2021-08-26T05:02:14.000Z",
          "Titre": "Some passing connection problems",
          "Contenu": "Some passing connection problems, but, hey, whats perfect ?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "judy molland",
          "Nb_Reviews": 2,
          "Date": "2021-12-07T20:12:57.000Z",
          "Titre": "Mostly excellent but I have had a few…",
          "Contenu": "Mostly excellent but I have had a few dropped calls where I have had to call back."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Penny",
          "Nb_Reviews": 5,
          "Date": "2022-05-17T10:11:48.000Z",
          "Titre": "Phone app not working properly even…",
          "Contenu": "Phone app not working properly even after deleting and reinstalling"
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "Paul DeCouto",
          "Nb_Reviews": 10,
          "Date": "2022-02-01T12:24:51.000Z",
          "Titre": "Calls drop from time to time",
          "Contenu": "Calls drop from time to time. Generally very good value for money."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peter Back",
          "Nb_Reviews": 2,
          "Date": "2020-12-28T00:22:15.000Z",
          "Titre": "I have been using Ring Britain for a…",
          "Contenu": "I have been using Ring Britain for a couple of years but recently in the middle of my call the lady interrupts and  says, \" if you would like to make a call please dial the Number\"  I then have to go through the entire dialing process again, only to find out that the party I am calling cannot hear me.  other than that I have been happy with it."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "paul k",
          "Nb_Reviews": 11,
          "Date": "2020-09-24T19:50:40.000Z",
          "Titre": "I like ring Britain because...",
          "Contenu": "You get the occasional call that doesn't connect but you get UNLIMITED calls to UK mobiles and landlines for a fiver a month, thats about 10 minutes on your normal mobile phone. Call quality is fine I use the phone number and speed dials you can use an app but I hate apps, calls on things like whatsapp and facebook sounds like you're talking to Norman Collie. You can get a couple of hours to the UK for two yoyos so its cheap to try."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Mary Miller",
          "Nb_Reviews": 4,
          "Date": "2020-07-29T06:42:05.000Z",
          "Titre": "Renewal of Credit Card used for my monthly payments",
          "Contenu": "On the whole we enjoy work with RingBritain.However, recently the credit card used for my monthly automatic payments reached its expiry date. So I got a new card with a different expiry date!This set off complications with both RingBritain and my bank - which, in turn, led to hours of my time spent on the phone to sort out.It would have been easier if RingBritain had just called me - or had a phone number where I could speak to them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Gibson",
          "Nb_Reviews": 7,
          "Date": "2020-06-01T18:49:45.000Z",
          "Titre": "Great Service for Inexpensive Phone Calls to Britain",
          "Contenu": "Have been a user of RingBritain for years.  Recently we were faced with a need to expand our usage of this service.  It is easy to enable, easy to add money to the available balance (either pay-as-you-go or monthly) and easy to add users to the account.  Website is a little tricky to navigate the website, but otherwise the service is very good.  Rates are inexpensive as well. Recommend this service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 14,
          "Date": "2020-05-27T14:38:35.000Z",
          "Titre": "An excellent service at an excellent…",
          "Contenu": "An excellent service at an excellent price. My only problem is that the calls are routed by various circuitous means and don't indicate they're from me on Call Display, but rather that they originate from some exotic foreign clime instead. Therefore, sometimes friends or businesses abroad think some unknown person from Korea or wherever is phoning and don't answer. I hope this can be addressed and fixed soon."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Mary Miller",
          "Nb_Reviews": 4,
          "Date": "2021-03-21T18:17:38.000Z",
          "Titre": "We use the service to keep in contact…",
          "Contenu": "We use the service to keep in contact with our family.On the whole, we find the service very good. The thing that we don't like is that we seem to get cut off after about 30 mins conversation - and we're not sure why that has to be.When it happens, we have to redial the whole number again."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Augustine Leudar",
          "Nb_Reviews": 5,
          "Date": "2021-07-02T10:06:27.000Z",
          "Titre": "This service works perfectly from…",
          "Contenu": "This service works perfectly from Ireland. The only complaint I have is that you don't have time on a mobile to put the number in. So you \"ring Britain\" then you have to flip back between your contacts and the ring Britain screen to type the number in. You don't have a long enough pause in the software and before you've finished typing it it says \"the number you have dialled is incorrect\" so it becomes liek a race to get the number in. Give us more time to type the number in !!!!!!! And yes I'm aware of the app but I don't always have internet."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Mary Miller",
          "Nb_Reviews": 4,
          "Date": "2018-12-06T00:13:52.000Z",
          "Titre": "Things seem fine now",
          "Contenu": "Things seem fine now, but initially we couldn't make any calls for the first month and yet we were charged the monthly fee.  We couldn't understand the procedure of phoning a Wellington number first and then our overseas number after that.As I've mentioned - things are fine now, now that we understand the procedures properly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roger Desautels",
          "Nb_Reviews": 1,
          "Date": "2017-12-03T15:28:25.000Z",
          "Titre": "The service is excellent except in one …",
          "Contenu": "The service is excellent except in one way. When I no longer needed the service, I had difficulty canceling the contract and the automatic recharging from my credit card. This was particularly disturbing because I remember not checking the box \"automatic recharge\" at the time of setting up my account. It is a shame because the service is perfect in every other way."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "moss",
          "Nb_Reviews": 3,
          "Date": "2021-02-03T05:25:05.000Z",
          "Titre": "caller id",
          "Contenu": "So, the only reason there are four instead of five stars is . . . . Seems when i call into the EU (now that the UK is out) the number that shows up as the caller is pretty random as to the country of call origination.Imagine it has something to do with the routing.t."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Kenyia",
          "Nb_Reviews": 4,
          "Date": "2016-12-30T12:05:52.000Z",
          "Titre": "Good Service",
          "Contenu": "I love this service, it's easy to use functions well and works out cheap for me. I enjoy the fact that I can use it across multiple devices and easily keep check of the cost of each call. I would recommend this service. The only reason I haven't given it 5 stars is because on a few occasions the reception hasn't been good. If they can sort that out it would be a total winner for me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BARBARA H",
          "Nb_Reviews": 15,
          "Date": "2015-04-01T22:23:41.000Z",
          "Titre": "Great price for calls, great quality of calls.",
          "Contenu": "Have used RingBritain for 4 or 5 years now during our 6 month winter stay in Florida. Besides calling the UK regularly we also call Spain, Poland and Australia. Very rarely is there a problem making a connection. Very rarely is the call quality other than excellent. We use auto top-up which makes sure we always have credit,  and opt to be told prior to each call how much credit remains. Highly recommend! The call rates are unbelievably low."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ernest Dunbar",
          "Nb_Reviews": 4,
          "Date": "2020-03-14T17:36:29.000Z",
          "Titre": "Not always able to get through.",
          "Contenu": "I have had several times, we could not get through and my wife ended up calling the very expensive route of direct.  She finds it difficult do dial  and enter the pass code before she even gets to the main number.  I need to always remind her the savings is worth the effort."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julie Allen",
          "Nb_Reviews": 5,
          "Date": "2016-03-11T19:12:48.000Z",
          "Titre": "Ring Britain - Simple and Inexpensive",
          "Contenu": "I have been using Ring Britain for a couple of years now.  Its easy to use, easy top up, simple on-line account and a cheap way ot staying in touch with family and friends.  The only reason I didn't give it 5, is occasionally (not often), the line can be a little poor quality. Not sure if that is their fault though."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Stuart Kay",
          "Nb_Reviews": 9,
          "Date": "2020-02-27T23:18:17.000Z",
          "Titre": "Your service is fine except ...",
          "Contenu": "Your service is fine. My only complaint is the annoying, intrusive reminder about pressing the star key to add more credit every time I connect with RingBritain.  I don't need it, especially when I've just topped up my account.Is there a way to disable it?"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Angel 2002_uk",
          "Nb_Reviews": 15,
          "Date": "2015-08-10T22:45:26.000Z",
          "Titre": "Calling from / to UK",
          "Contenu": "Generally the service and information is pretty clear. The quality of the call is not as clear as I would like it to be but it can be managed. I have problems with the webcall service. I have never been able to use it. Does anybody else have that problem too? The information on that is pretty vague."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Julie",
          "Nb_Reviews": 2,
          "Date": "2015-08-11T00:07:30.000Z",
          "Titre": "Good calling system, but top up costs a little misleading",
          "Contenu": "I put $20 on my account in Australia but had actually been charged $27.28 when I checked my bank account. Presumably this is because Ring Britain is based in the USA, but I think the currency conversion should be clearly stated on the purchasing page so that customers pay the amount they would like to pay rather than almost $8 more on top!! The actual call system is easy to use and I have never had any problems, but I may consider using a company based in Australia when I need to top up in future so that $20 is actually $20."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PJane",
          "Nb_Reviews": 14,
          "Date": "2018-10-30T16:29:58.000Z",
          "Titre": "Generally excellent but one problem",
          "Contenu": "Generally excellent and I love that you can program in your PIN based on your phone #. However I HATE that if I program in the PIN for UK I can not use the PIN I have for Australia. If I want to call both places on the one phone I have to enter PINs EVERY call....."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gloria Sherman",
          "Nb_Reviews": 3,
          "Date": "2016-12-01T15:27:33.000Z",
          "Titre": "Easy to use",
          "Contenu": "I find it very easy to use in conjunction with speed dial. My only frustration has been that the access numbers occasionally don't work, I have added three to my phonebook and this makes it easier, in case one access number doesn't work. Incredibly inexpensive to use."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Will A.",
          "Nb_Reviews": 6,
          "Date": "2021-02-03T12:08:25.000Z",
          "Titre": "Good enough service so far",
          "Contenu": "Good enough service so far, thank you. I say 'so far', as an alternative provider started out fine then slipped badly, also in non-responsive customer service, which was the main reason I switched to RingBritain."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Martha Camacho",
          "Nb_Reviews": 8,
          "Date": "2018-11-28T21:10:11.000Z",
          "Titre": "Great clarity and ease of calling",
          "Contenu": "Great clarity and ease of calling. I have been charged 3 times as seen on my bank statement.  Emailed ring tones Received response asap and was told I had only been charged once from their end. Will try to contact you today. great price for sure."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Tracey Bridge",
          "Nb_Reviews": 2,
          "Date": "2019-07-08T08:27:01.000Z",
          "Titre": "Great App !",
          "Contenu": "I really like this app. It's a fast quick connection. I's cheap The only neg. thing is on every call I make to england there is a block during the call, having said this the service has improved since I started using it."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Nigel de Sylva",
          "Nb_Reviews": 12,
          "Date": "2018-01-28T12:16:52.000Z",
          "Titre": "Price of calls first rate.I have a bit …",
          "Contenu": "Price of calls first rate.I have a bit of a problem with dropped calls but I think it may be because I have an internet phone system and it is perhaps a fault of the internet provider,otherwise I thoroughly recommend Ring Britain."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Mary Miller",
          "Nb_Reviews": 4,
          "Date": "2020-03-20T11:44:03.000Z",
          "Titre": "We use this service every week and find…",
          "Contenu": "We use this service every week and find it very valuable. The only issue I have is that we usually get cut off after talking for an hour. If we're not finishedd speaking with family, we have to call them back."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mark Rennie",
          "Nb_Reviews": 2,
          "Date": "2016-12-01T11:46:49.000Z",
          "Titre": "Works very well, no hassle",
          "Contenu": "Excellent. Very cheap, easy to set up and use. The speed dial options and being able to allow calls from certain numbers without using a PIN means that you can basically forget about typing PINs and complicated codes, and the auto-top-up option means you never have to worry about money, so once you set it up you can basically forget about it.The voice quality is usually excellent too. The only thing that stops me giving the full 5 stars is that sometimes I get a bit of annoying echo on the line - although this may be down to the landline at home and nothing to do with RingBritain.Overall very happy, I have been using the service for years with no hassle."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer Hyams",
          "Nb_Reviews": 1,
          "Date": "2015-01-17T21:28:54.000Z",
          "Titre": "Excellent service",
          "Contenu": "Have been using this site for several years. Easy to navigate, very cheap to UK....extremely happy with the service. On occasion I do get an echo back, but not often enough to have made a complaint. All in all a really good find!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debra H",
          "Nb_Reviews": 2,
          "Date": "2019-05-10T12:59:31.000Z",
          "Titre": "Cant beat the price for calls to the…",
          "Contenu": "Cant beat the price for calls to the UK. My only complaint is that every second or third call will have either an echo or horrendous crackling on the line. I hang up and redial which sometimes fixes the problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ernest Dunbar",
          "Nb_Reviews": 4,
          "Date": "2021-04-08T12:47:41.000Z",
          "Titre": "Requested Review.",
          "Contenu": "For the most part your service is good.  There have been times I have not been able to get through or had to call back due to a bad line. These are the exception and not the rule."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "TJames",
          "Nb_Reviews": 1,
          "Date": "2016-12-19T11:43:00.000Z",
          "Titre": "Great, reliable, simple service",
          "Contenu": "I use RingBritain to call the UK from Australia - it's simple to use, great prices, and I don't think that I've ever had any issues with the connection (currently two years of using the service)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KC",
          "Nb_Reviews": 1,
          "Date": "2020-08-01T21:31:03.000Z",
          "Titre": "Overall great service",
          "Contenu": "Sometimes calls cut out after an hour or there is crackly on the line. But apart from that the service is great. I like that your credit is available immediately after it's been added."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Dan",
          "Nb_Reviews": 2,
          "Date": "2021-03-28T16:47:42.000Z",
          "Titre": "Great",
          "Contenu": "Great, cheap way to call home. Have had occasional issues calling lo-call numbers that the RingBritain switchboard hasn't connected me to, possibly deprecated numbers though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "STEPHEN PARKIN",
          "Nb_Reviews": 3,
          "Date": "2020-08-24T17:04:24.000Z",
          "Titre": "Sound quality not always perfect.",
          "Contenu": "The price is great, the reason I’ve given 4 Stars is because occasionally the sound quality isn’t good.Although I can hear the person I’m talking to, they tell me it’s not loud enough."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "paul k",
          "Nb_Reviews": 11,
          "Date": "2016-10-08T08:05:33.000Z",
          "Titre": "User review",
          "Contenu": "The number connects quickly, quality is very good to UK mobiles, I cannot figure out the speed dial however thats a minor irritation. The calls are quite cheap. You can't buy €2.00 credit any more"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Pat",
          "Nb_Reviews": 1,
          "Date": "2017-01-29T14:30:53.000Z",
          "Titre": "Good service,",
          "Contenu": "Always had good service from you. However clarification on costs when ringing 800 numbers could be made clearer because they are so expensive compared with other UK numbers.  Overall very satisfied."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "lisa",
          "Nb_Reviews": 2,
          "Date": "2018-12-24T12:30:39.000Z",
          "Titre": "Sometimes I get disconnected or call is…using the service for years",
          "Contenu": "Sometimes I get disconnected or call is dropped. I was also getting awful feedback when talking . They could not resolved that problem. Otherwise to order minutes is very easy. Price is ok ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "barbara rocray",
          "Nb_Reviews": 1,
          "Date": "2020-02-01T16:36:42.000Z",
          "Titre": "Excellent staff service",
          "Contenu": "Some snags initially with the connector but I was very impressed by Ring Britain's response to my problem and setting it up for me so all went smoothly. Excellent service."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "woodyhead",
          "Nb_Reviews": 3,
          "Date": "2016-07-14T21:14:06.000Z",
          "Titre": "magic",
          "Contenu": "thanks to Ring Britain I am able to keep in touch with my ex and hopefully reignite our relationship good service excellent price and available at all times thank you ringbritain"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "kate johnson",
          "Nb_Reviews": 3,
          "Date": "2019-04-19T16:04:44.000Z",
          "Titre": "I haven't looked back!",
          "Contenu": "Since discovering RingBritain, I have not looked back. The price is excellent. The calls do get dropped occasionally, but not so much to outweigh the rest of the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "judy molland",
          "Nb_Reviews": 2,
          "Date": "2020-12-22T16:57:32.000Z",
          "Titre": "Generally the service has been really…",
          "Contenu": "Generally the service has been really good, but in the last two weeks I have had two dropped calls - i.e. I was talking and was abruptly cut off."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Richard Newman",
          "Nb_Reviews": 2,
          "Date": "2021-08-24T01:14:41.000Z",
          "Titre": "Good easy service"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Andrew",
          "Nb_Reviews": 5,
          "Date": "2021-01-30T19:28:54.000Z",
          "Titre": "Had to redial",
          "Contenu": "Had to phone a few times as it would not connect and quality of call was very bad on several occasions but after redialling was much clearer"
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Flower",
          "Nb_Reviews": 11,
          "Date": "2018-03-05T19:36:55.000Z",
          "Titre": "Great site",
          "Contenu": "Great site, but if you falter when inputting the number you want, you get kicked out of the system, which is pretty annoying. But other than that all good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Geoffrey",
          "Nb_Reviews": 4,
          "Date": "2021-08-01T17:06:11.000Z",
          "Titre": "Very good service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Manuel Lujan",
          "Nb_Reviews": 1,
          "Date": "2022-04-25T17:27:54.824Z",
          "Titre": "It can't get better than that."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "John Baddeley",
          "Nb_Reviews": 2,
          "Date": "2023-03-08T17:53:18.000Z",
          "Titre": "Great service…and reasonable!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "USA Teacher",
          "Nb_Reviews": 5,
          "Date": "2018-05-07T20:35:48.000Z",
          "Titre": "Ring Britain is a good  service that…",
          "Contenu": "Ring Britain is a good  service that allows me to stay in touch with people I love in Britain.  It's clear and easy to use for the most part."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "M MAXWELL",
          "Nb_Reviews": 2,
          "Date": "2018-03-18T13:47:19.000Z",
          "Titre": "Starting to have connection problems...",
          "Contenu": "Easy to use but starting to have connection problems when calling a UK mobile...if it doesnt improve then will have to find an alternative."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tracey Ann Petrie",
          "Nb_Reviews": 3,
          "Date": "2021-01-16T15:11:21.000Z",
          "Titre": "Great value service",
          "Contenu": "Great value service. Just dropped a star because you do need a strong cell signal. Sometimes flags signal poor cannot connect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cynthia Overwise",
          "Nb_Reviews": 3,
          "Date": "2019-11-08T18:01:07.000Z",
          "Titre": "Lately it seems that some calls are…",
          "Contenu": "Lately it seems that some calls are lost mid call, and I have to call back. Is this my phone, or the connection? I don't know."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "patricia fordham",
          "Nb_Reviews": 15,
          "Date": "2014-12-19T20:02:15.000Z",
          "Titre": "GREAT VALUE FOR MONEY",
          "Contenu": "On the whole I have had  very good experiences but sometimes I get disconnected after a few minutes causing me to have to have to re dial."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Penny",
          "Nb_Reviews": 5,
          "Date": "2021-02-16T10:14:41.000Z",
          "Titre": "Sometimes get interference",
          "Contenu": "Sometimes get interference on the line, probably nothing to do with RingBritian.  Ok credit seems to last, easy to top up"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lesley Tucker",
          "Nb_Reviews": 1,
          "Date": "2018-07-06T15:07:39.000Z",
          "Titre": "I did have a problem when I got…",
          "Contenu": "I did have a problem when I got started, but with help from the customer service this was resolved and I have had not problem since."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Johanna Jaggs",
          "Nb_Reviews": 15,
          "Date": "2018-04-30T08:59:57.000Z",
          "Titre": "RingBritain is really good value for call Mobiles in other countries.",
          "Contenu": "RingBritain is really good value for ring Mobiles in other countries.  Sometimes they system does not work which can be frustrating."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Terry Andrews",
          "Nb_Reviews": 2,
          "Date": "2017-04-13T14:26:48.000Z",
          "Titre": "no problem buying extra time on your …",
          "Contenu": "no problem buying extra time on your system.I was hoping for a special deal but did not happen in the time frame I needed.T"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PJane",
          "Nb_Reviews": 14,
          "Date": "2019-04-19T16:29:21.000Z",
          "Titre": "Very satisfied",
          "Contenu": "Generally great connection at a good price. Occasionally get disconnected or will not connect. Love the special bonuses!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Graham Hutchison",
          "Nb_Reviews": 1,
          "Date": "2019-10-19T10:09:09.000Z",
          "Titre": "Initial difficulty online.",
          "Contenu": "Initial difficulty in attempting to download the website.Managed to get phone contact and the service was excellent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A D",
          "Nb_Reviews": 3,
          "Date": "2019-09-26T15:33:04.000Z",
          "Titre": "excellent rates",
          "Contenu": "excellent ratesonly issue there should be a 2 minute warning (you have 2 minutes left) so one can end call properly"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Elizabeth Banks",
          "Nb_Reviews": 2,
          "Date": "2020-01-03T07:35:19.000Z",
          "Titre": "Just a bit annoying to be reminded how…",
          "Contenu": "Just a bit annoying to be reminded how to top up credit when what I want is to speak to my family!!Otherwise good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "pat wilson",
          "Nb_Reviews": 2,
          "Date": "2015-10-09T10:59:42.000Z",
          "Titre": "Very good.",
          "Contenu": "Fair pricing.\r Uncomplicated.\r Would like to be able to do two or more calls without \"signing\" in each time."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Penny",
          "Nb_Reviews": 5,
          "Date": "2019-12-08T09:20:30.000Z",
          "Titre": "Good, but drops out",
          "Contenu": "OK, not costing a lot, however if calling from a Cell phone often drops out, especially if not going through wifi."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Johanna Jaggs",
          "Nb_Reviews": 15,
          "Date": "2020-08-26T14:31:23.000Z",
          "Titre": "Sometimes it does not connect",
          "Contenu": "Sometimes it does not connect and i get 'Please enter the number you require' again a little annoying,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Big Ben",
          "Nb_Reviews": 2,
          "Date": "2016-12-09T18:23:37.000Z",
          "Titre": "Service",
          "Contenu": "Service is too quick to announce call # wrong while I am still looking up the end of a number.   Not patient enough."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "brenda newton",
          "Nb_Reviews": 6,
          "Date": "2020-04-18T00:49:08.000Z",
          "Titre": "I always use Ring Britain and rarely…",
          "Contenu": "I always use Ring Britain and rarely have a problem.  The line is usually clear and I love the speed dialing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Val",
          "Nb_Reviews": 3,
          "Date": "2020-07-23T15:34:52.000Z",
          "Titre": "Could not give 5 unfortunately as…",
          "Contenu": "Could not give 5 unfortunately as sometimes the line is unclear & also occasionally have been cut off."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Karen Freeman",
          "Nb_Reviews": 2,
          "Date": "2021-06-16T09:11:45.000Z",
          "Titre": "Sometimes UK number is not accepted or…",
          "Contenu": "Sometimes UK number is not accepted or not recognised. This may not be the fault of Ring Britain."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Kathryn",
          "Nb_Reviews": 4,
          "Date": "2018-01-05T02:54:20.000Z",
          "Titre": "Great service and fantastic prices",
          "Contenu": "Great service and fantastic prices, though the line is often poor and breaks up.  Been using a few years now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diane Cady",
          "Nb_Reviews": 2,
          "Date": "2018-06-21T17:24:24.000Z",
          "Titre": "Bargain price",
          "Contenu": "Bargain price. About 30% of the time I get a very poor connection & have to hang up & start again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer Hyams",
          "Nb_Reviews": 3,
          "Date": "2017-12-11T17:26:44.000Z",
          "Titre": "Love Ring Britain  but it disconnected …",
          "Contenu": "Love Ring Britain  but it disconnected me when I still had money available, even though it s pretty low."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew McIntyre",
          "Nb_Reviews": 11,
          "Date": "2019-11-15T05:50:46.000Z",
          "Titre": "Generally excellent",
          "Contenu": "Generally excellent, but recently I was told to add money, getting cut off, when I still had .78c."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Barwick",
          "Nb_Reviews": 3,
          "Date": "2021-01-02T22:27:46.000Z",
          "Titre": "mostly good but my automaic top up was…",
          "Contenu": "mostly good but my automaic top up was deleted and a great deal o work needed to restore his."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Smith",
          "Nb_Reviews": 4,
          "Date": "2016-03-29T16:46:00.000Z",
          "Titre": "Great",
          "Contenu": "Didn't give a \"five\"star because sometimes you need to call back when lines are not busy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2015-01-08T02:12:12.000Z",
          "Titre": "Worth the money",
          "Contenu": "Calls get dropped at 59.59 minutes, every time.  Cant go wrong for the price.  Great customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Payne",
          "Nb_Reviews": 4,
          "Date": "2016-12-28T00:03:17.000Z",
          "Titre": "Good value for money",
          "Contenu": "Good value for money handy when u can't use the free ones!!  Usually no problems with charity."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Arlene Polonsky",
          "Nb_Reviews": 29,
          "Date": "2022-06-15T15:40:58.000Z",
          "Titre": "Easy to buy more time",
          "Contenu": "Easy to buy more time, and easy to use."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "AB",
          "Nb_Reviews": 1,
          "Date": "2016-09-05T08:11:05.000Z",
          "Titre": "Great, but...",
          "Contenu": "It'd be good if you didn't have to hang up and redial if calling more than one number."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 14,
          "Date": "2019-12-29T20:09:24.000Z",
          "Titre": "A now commonplace miracle",
          "Contenu": "Very good service, technically speaking, at a very reasonable price. Highly recommended!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Renee",
          "Nb_Reviews": 4,
          "Date": "2019-05-14T15:12:34.000Z",
          "Titre": "Most times able to connect",
          "Contenu": "Most times able to connect, clear line.  Great to keep in touch with friends and family."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leslie Botchwey",
          "Nb_Reviews": 2,
          "Date": "2020-02-03T20:17:33.000Z",
          "Titre": "Clear calls",
          "Contenu": "Clear calls. Credit card was hacked right after purchasing minutes from your website."
        },
        {
          "Note": 4,
          "Lieu": "JO",
          "Pseudo": "David Taaffe",
          "Nb_Reviews": 9,
          "Date": "2019-11-25T15:27:01.000Z",
          "Titre": "It would have been 5 stars but for the…",
          "Contenu": "It would have been 5 stars but for the last 2 days I have been unable to ring the uk"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandra Maker",
          "Nb_Reviews": 4,
          "Date": "2019-12-17T00:12:20.000Z",
          "Titre": "This service makes it very reasonable",
          "Contenu": "This service makes it very reasonable to maintain contact with my English family."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Tony Sugarman",
          "Nb_Reviews": 1,
          "Date": "2018-08-14T10:55:29.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good, very helpful quick reply to my emails so far all goodTony Sugarman"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Crianlarich",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T04:30:08.000Z",
          "Titre": "Super simple to use",
          "Contenu": "Super simple to use. Saves a lot on overseas calls. Pre program your most used numbers and simply hit that digit when you connect."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew McIntyre",
          "Nb_Reviews": 11,
          "Date": "2023-12-06T09:46:13.000Z",
          "Titre": "Great lines and rapid connection",
          "Contenu": "Great lines and rapid connection, a lifeline for me and my Mum."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Dee Arnold",
          "Nb_Reviews": 10,
          "Date": "2023-10-02T19:20:46.000Z",
          "Titre": "Actually Ring Britain has always been…",
          "Contenu": "Actually Ring Britain has always been great.  However from 1st November they are changing the way they operate.  They will no longer be allowing calls from landlines, instead, we are encouraged to use the app on mobiles instead.  Really not convenient for our particular set up, very disappointed in this decision."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mardi",
          "Nb_Reviews": 11,
          "Date": "2023-07-29T14:00:52.000Z",
          "Titre": "Best thing since sliced bread.",
          "Contenu": "Been hooked up with Ring Britain since 2017 when I reconnected with an old flame in the Liverpool area.  We are able to keep in touch as much as we want using not only my RingBritian over here in the US but through the virtual number I got for him to use over in the UK.  Now RingBritian is offering a special non-roaming item which I will check into before our next overseas trip."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Kowalski",
          "Nb_Reviews": 3,
          "Date": "2023-11-20T00:00:57.000Z",
          "Titre": "Always a good reception",
          "Contenu": "Always a good reception, voice is crystal clear. Highly recommend…..thank you, RingBritain.com"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "carolyn canedy",
          "Nb_Reviews": 4,
          "Date": "2023-11-30T19:06:49.000Z",
          "Titre": "It has been a lifesaver to me being…stops me being homesick",
          "Contenu": "It has been a lifesaver to me being able to phone my family everyday!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joyce Kelleher",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T17:32:51.000Z",
          "Titre": "It is so easy to use",
          "Contenu": "It is so easy to use.   Love talking to my brother in London without worry of the cost."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Andrew",
          "Nb_Reviews": 5,
          "Date": "2023-08-05T22:55:50.000Z",
          "Titre": "So Easy",
          "Contenu": "It is a very good service , Quick and easy to sign up , and very cost effective.  It's the best I've come across and there are  no hassles joining and closing, unlike other services. Could not find a better or easier service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "John Leightell",
          "Nb_Reviews": 3,
          "Date": "2021-11-05T20:25:09.000Z",
          "Titre": "Excellent audio quality in call",
          "Contenu": "Excellent audio quality in call. No dropped conversation. I am 80 and don't think very fast, and my fingers are not nimble anymore. I find the 'voice of the operator' does not allow enough time for me to enter the number I'm trying to reach which consists of 01144114234xxxx, By the time I've looked it up  (too long to remember) the voice operator has wished me 'goodbye'"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed Marciniak",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T17:54:42.000Z",
          "Titre": "EASY RINGBRITIAN",
          "Contenu": "Like. Easy to make overseas calls with numbered person calling. No fiddling with getting correct phone number with the saved person numbers.  THANKS"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara Scott",
          "Nb_Reviews": 3,
          "Date": "2021-12-23T11:56:29.000Z",
          "Titre": "I’ve been using RingBritain for about 3…",
          "Contenu": "I’ve been using RingBritain for about 3 months and am very happy with their service. My family in England tell me that they can hear so much better with this service and there are no pauses and a very clear line. I would most certainly recommend RingBritain to anyone that needs inexpensive and good calls to England."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eva Richter",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T22:02:18.000Z",
          "Titre": "I have enjoyed the services of Ring…",
          "Contenu": "I have enjoyed the services of Ring Britain for many years and really appreciate the low rates and easy access. Easy website and other means for refilling one's credit also helps, and Ring Britain also accepts calls to other countries at low rates. Thank you for the service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JUDITH YORK",
          "Nb_Reviews": 8,
          "Date": "2021-12-18T13:18:56.000Z",
          "Titre": "I appreciate my RingBritain membership…",
          "Contenu": "I appreciate my RingBritain membership very much.  It keeps me in touch with family and friends in the United Kingdom.  It is very reasonably-priced and would cost me a lot more if I tried to use other methods.  Thank you, RingBritain for providing this service, not only to U.K. nationals but also to our many friends here in the United States.  Sincerely, Judith York"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mardi",
          "Nb_Reviews": 11,
          "Date": "2021-09-19T12:45:36.000Z",
          "Titre": "Could not live without Ring Britain",
          "Contenu": "I have been using Ring Britain now for over 4 years.  My guy is in Liverpool, UK, I am here in Florida.  I purchased a virtual number for him and I use the standard Ring Britain service.  We have been separated for over one year because of the travel ban so needless to say Ring Britain has proved to be a godsend for us."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zillehuma Hasan",
          "Nb_Reviews": 4,
          "Date": "2021-12-24T12:11:46.000Z",
          "Titre": "I have been using the Ring Britain…",
          "Contenu": "I have been using the Ring Britain phone card for about 4 years now and it has never let me down. Excellent service and every penny is worth it. I always recommend Ring Britain to all my friends, especially those are originally from the United Kingdom and now residing in the U.S."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth Turner",
          "Nb_Reviews": 2,
          "Date": "2022-10-06T03:43:53.000Z",
          "Titre": "Increasing deposit amount",
          "Contenu": "I added an amount to my deposit.  It was a very simple procedure and I appreciated the ease which their design program helped me do it quickly and efficiently. Well done RingBritain, I will be a customer for many more years and the convenient local number phone service is great!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Basia Niewiadomska",
          "Nb_Reviews": 3,
          "Date": "2023-06-29T12:32:28.000Z",
          "Titre": "Easy to use",
          "Contenu": "It is so easy to use, good quality of connection, easy to recharge, you are always aware of amount of money left and the time you have left to talk. I use RingBritain for many years.Absolutely recommended"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "K Luke",
          "Nb_Reviews": 3,
          "Date": "2021-11-27T22:31:38.000Z",
          "Titre": "RingBritain is great",
          "Contenu": "RingBritain I am impressed that you responded to my comment on no longer being able to connect to Britain on the landline and  I do have a private number. Your reply and caring about your customers in such a way deserves 10 stars. RingBritain is great when using from my mobile, and I certainly have no complaints on that front.  However, when using the landline I am no longer able to make any connections to Britain. Do not know what is going on there as initially I could use both.  The website is user friendly, it is easy to access my account and to make changes and add more time etc.  The cost is really fantastic for contacting with all the family and friends back in Britain that are not yet on the internet. Thank you RingBritain."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marjorie Rankine",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T14:54:20.000Z",
          "Titre": "Excellent Service",
          "Contenu": "I dial the local number. When prompted enter the code I have assigned to a number I call on a regular basis. Call goes through. What more could a caller want? Thank you."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "JUAN",
          "Nb_Reviews": 2,
          "Date": "2023-01-08T15:49:33.000Z",
          "Titre": "Incredible value",
          "Contenu": "Excellent service. I have elderley relatives in UK who have no internet and only landlines.Never had any problems with connection. Amazing value, wish I had found you years ago."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Pigott",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T22:35:28.000Z",
          "Titre": "Got on my lap top to make a payment.",
          "Contenu": "Got on my lap top to make a payment to my account and realized I had forgotten my passward.  Made it known and you immediately e-mailed me a link whichennabled me to make new passward.  This then allowed me to make payment.. All very fast and efficient.  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Robert Batty",
          "Nb_Reviews": 1,
          "Date": "2022-04-30T20:15:32.000Z",
          "Titre": "Am using the monthly unlimited service…",
          "Contenu": "Am using the monthly unlimited service and it has been great to contact cousins.  At two hours it cuts you off and have to redial.  A little annoying but can live with it.   Connections are crystal clear."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JUDITH YORK",
          "Nb_Reviews": 8,
          "Date": "2022-08-16T16:47:04.000Z",
          "Titre": "Top marks to RingBritain.com",
          "Contenu": "Top marks to RingBritain.com!  It enables me to talk to my family and friends in Britain.   It keeps me connected and feeling secure knowing that I canafford to keep chatting whenever I feel the needkeep up with them.  Thank you for a very valuableservice.  Sincerely, Judith York"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Cherith",
          "Nb_Reviews": 1,
          "Date": "2022-01-25T11:52:38.000Z",
          "Titre": "A generally very reliable service with…",
          "Contenu": "A generally very reliable service with clear messages as to number of minutes left. In all my time using the service I think it has only been collapsed on all access numbers once. The payment plans and service is simple and also works well. I'm very happy with the service."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "April GL",
          "Nb_Reviews": 7,
          "Date": "2021-11-19T20:33:44.000Z",
          "Titre": "I've used Ring Britan for a few years…",
          "Contenu": "I've used Ring Britan for a few years without any problems. I started using it when I was in the US. I then moved to the UK and continue to use it when I travel out of the country in order to contact those back in the UK without expensive cellphone plans. The calls also are clearer and no call drops."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Agnes Murray",
          "Nb_Reviews": 8,
          "Date": "2023-02-23T15:42:04.000Z",
          "Titre": "Good and clear service with no issues. Thanks.",
          "Contenu": "Always a good and clear connection and the monthly charges are very reasonable compared to what my network would charge for long distance calls. No comparison at all so thanks for your service and I appreciate it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela James",
          "Nb_Reviews": 5,
          "Date": "2022-03-20T19:38:03.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, Easy to set up and connect.No hidden fees.I keep in touch with family in U K and this service has saved me money plus being able to stay in touch on a regular basis without going bankrupt."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mardi",
          "Nb_Reviews": 11,
          "Date": "2022-12-01T14:34:29.000Z",
          "Titre": "Best thing since sliced bread",
          "Contenu": "I have had a RingBritain number in order to call my guy in UK since August 2017.  I had a virtual number also for him to call me here in the US.  Other than when he was not in the UK for 10 mos.  I had the same virtual #.  I cancelled and re-upped when he is now back in UK (new # but who cares right).  We really thank our lucky stars we found RingBritain so we can say in touch as much as we want.  Every other option was just too, too pricey."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Glenice Leonard",
          "Nb_Reviews": 2,
          "Date": "2021-10-02T09:21:34.000Z",
          "Titre": "RingBritain is reliable.",
          "Contenu": "I find the RingBritain service excellent for keeping in touch with friends and family overseas.No worries about running out of money either as it is automatically renewed as soon as the total goes below $5."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "judith garside",
          "Nb_Reviews": 12,
          "Date": "2023-09-15T16:14:15.000Z",
          "Titre": "Just great.",
          "Contenu": "Great service,no problems with conections,clarity etc.Adding minutes is a breeze.Thank you.Ken and Judith Garside.Venice FL."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nisey Edwards",
          "Nb_Reviews": 6,
          "Date": "2021-09-10T02:59:44.000Z",
          "Titre": "Great Company",
          "Contenu": "This is a great company.  Their rates are superb.  If it wasn't for RingBritain.com, I wouldn't be able to keep in touch with my elderly father and communicate with his caregivers etc."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JBC",
          "Nb_Reviews": 1,
          "Date": "2021-12-26T16:33:06.000Z",
          "Titre": "Excellent service!",
          "Contenu": "Excellent service!! Great connection. I can finally call all my family in the UK without calling cards etc.  Ring Britain is easy to use.  Keep up the good service and excellent prices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sparky Mark",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T22:47:30.000Z",
          "Titre": "Years of great service",
          "Contenu": "I have been using RingBritain for many years and it just works! Great hassle free easy to use service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "carole dowden",
          "Nb_Reviews": 1,
          "Date": "2021-11-01T13:58:29.000Z",
          "Titre": "I love RingBritain....I have been with…",
          "Contenu": "I love RingBritain....I have been with them for many years. Very Happy. Staff are helpful and pleasant. I would recommend to anyone who needs international connection."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "UKK8",
          "Nb_Reviews": 7,
          "Date": "2023-03-03T01:27:55.000Z",
          "Titre": "Love this both sides of the Atlantic",
          "Contenu": "Love this both sides of the Atlantic. Great savings all round and a fantastic way to keep in contact with people that don’t use apps or social media."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela James",
          "Nb_Reviews": 5,
          "Date": "2021-11-20T21:17:32.000Z",
          "Titre": "I love this service",
          "Contenu": "I love this service, easy to use. Very inexpensive so I can call my 97 year old dad and check on him regularly as I haven't been able to visit because of Covid. The other service I had before used to drop calls.Phone calls are clear. Give it 5 stars"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "H.T.",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T17:29:15.000Z",
          "Titre": "works as intended..no connection…",
          "Contenu": "works as intended..no connection issues..no interference..happy to use this service..thankk you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jane",
          "Nb_Reviews": 5,
          "Date": "2022-06-28T16:40:30.000Z",
          "Titre": "Connecting with Loved Ones Overseas",
          "Contenu": "Ring Britain allows me to ring a family member, an aunt who’s 91 who does not have a mobile phone using  my mobile to her landline!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Helen Leach",
          "Nb_Reviews": 4,
          "Date": "2023-09-27T05:30:33.000Z",
          "Titre": "Ring Britain calling card",
          "Contenu": "competitive rates , easy to recharge ,been using for quite a while now."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Agnes Murray",
          "Nb_Reviews": 8,
          "Date": "2023-06-23T13:37:52.000Z",
          "Titre": "Always connects and we are very…",
          "Contenu": "Always connects and we are very satisfied with the ease to call and talk to our list of people in Britain,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "West Coast customer",
          "Nb_Reviews": 3,
          "Date": "2022-06-06T22:47:52.000Z",
          "Titre": "Great service for an unbeatable price",
          "Contenu": "Great service for an unbeatable price! RingBritain is super easy to use, and the quality of the telephone call is outstanding. I recommend RingBritain for anyone here in the US!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendy G",
          "Nb_Reviews": 3,
          "Date": "2022-01-03T16:40:01.000Z",
          "Titre": "Reliable",
          "Contenu": "Reliable, Affordable and easy to reload. I have been using Ring Britain for years and I’m very satisfied with this service. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "VERA MACDONALD",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T14:14:57.000Z",
          "Titre": "Calling USA to UK",
          "Contenu": "Perfect way to call family and businesses that cannot be reached via social media apps! I love this app!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "judith garside",
          "Nb_Reviews": 12,
          "Date": "2021-12-16T01:14:58.000Z",
          "Titre": "Punta Gorda to Concordreat airline. Great service. The best prices. We go from Punta Gorda to see our son in Charlotte. We go to Concord airport.",
          "Contenu": "We travel up to Charlotte to see our son twice a year. Great airline , great price, most of the time it runs on time, the airports are smaller so no huge delays. It is like catching a bus . Love it. Love it. Have recommended to numerous people who have all been pleased. Keep up the good work."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Keith Coburn",
          "Nb_Reviews": 3,
          "Date": "2021-12-25T23:01:28.000Z",
          "Titre": "The automated means of connection has…",
          "Contenu": "The automated means of connection has always been without fault which , in this day and age, is exceptional.Well done."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Pamela",
          "Nb_Reviews": 1,
          "Date": "2022-01-03T16:09:05.000Z",
          "Titre": "I’m very satisfied with this service…",
          "Contenu": "I’m very satisfied with this service and love how I can call using my mobile to call the UK unlimited minutes for such a great monthly rate!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "John Martin",
          "Nb_Reviews": 1,
          "Date": "2022-05-12T09:46:40.000Z",
          "Titre": "Great service!",
          "Contenu": "I have been using RingBritain for many years and have recommended them to many people. Very well priced and a consistent service, Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "STEPHEN PARKIN",
          "Nb_Reviews": 3,
          "Date": "2022-06-01T20:52:28.000Z",
          "Titre": "I have used Ring Britain for years and…",
          "Contenu": "I have used Ring Britain for years and never had any problems connecting. The local number we are given is good."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Lesley K",
          "Nb_Reviews": 6,
          "Date": "2023-12-04T11:20:11.000Z",
          "Titre": "We use the service quite regularly and…",
          "Contenu": "We use the service quite regularly and appreciate the value and reliability."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Flower",
          "Nb_Reviews": 11,
          "Date": "2022-06-12T12:13:35.000Z",
          "Titre": "Great phone service",
          "Contenu": "Great phone service. Usually I can get through no problems. Only very occasionally the lines are busy. Good clarity."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 7,
          "Date": "2021-12-31T17:35:30.000Z",
          "Titre": "This is a great service I really enjoy…",
          "Contenu": "This is a great service I really enjoy using it to call my friends and Great Britain and to replenish my account with a more money is very very simple and it done right online I really like ring Britain very much"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "David Shaw",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T02:50:25.000Z",
          "Titre": "Great call rates and good quality audio…",
          "Contenu": "Great call rates and good quality audio calls to landline and mobile."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beryl Brooks",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T22:10:31.000Z",
          "Titre": "Rates are fabulous",
          "Contenu": "Rates are fabulous.  I had used OneSuite.com for over 20 years.  Then their European rates skyrocketed!!!!!!Grateful to have found RingBritain"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Linda Smith",
          "Nb_Reviews": 1,
          "Date": "2021-09-30T02:32:37.000Z",
          "Titre": "Ring Britain is easy to use and…",
          "Contenu": "Ring Britain is easy to use and cost-effective. Great for calling mobiles overseas. And I like that it just bills me as my minutes available get too low."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "maggie potvin",
          "Nb_Reviews": 2,
          "Date": "2021-12-16T00:53:06.000Z",
          "Titre": "RingBritain is a fantastic way to keep…",
          "Contenu": "RingBritain is a fantastic way to keep in touch with family and friends in the U.K. It is inexpensive and reliable. I am so happy to be able to use it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Annon",
          "Nb_Reviews": 3,
          "Date": "2022-09-06T20:21:54.000Z",
          "Titre": "Amazing service",
          "Contenu": "Amazing service, never had a connection issue. Very easy to sign up and automate payments.I would highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Yates",
          "Nb_Reviews": 5,
          "Date": "2021-10-10T20:36:05.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service, fast and convenient. Topped up my balance instantly and kept in touch with my Mum x."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Steve Haslam",
          "Nb_Reviews": 8,
          "Date": "2021-12-15T20:47:40.000Z",
          "Titre": "A great service at a reasonable price",
          "Contenu": "A great service at a reasonable price! I use it several times a week to call family in the UK and never been disappointed."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "K Jakey",
          "Nb_Reviews": 12,
          "Date": "2022-10-01T08:29:18.000Z",
          "Titre": "Used Ring Britain for many years first…",
          "Contenu": "Used Ring Britain for many years first class service great value for money highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valerie Hassell Lloyd",
          "Nb_Reviews": 3,
          "Date": "2023-07-09T03:46:13.000Z",
          "Titre": "Easy to work with and reasonable",
          "Contenu": "So very easy to add minutes to my account at an extremely reasonable price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DJ",
          "Nb_Reviews": 6,
          "Date": "2022-06-18T13:32:34.000Z",
          "Titre": "I would highly recommend this service",
          "Contenu": "I would highly recommend this service, I’ve been using it for a long time.  It is easy to use & the line quality is excellent"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "david dickson",
          "Nb_Reviews": 1,
          "Date": "2022-08-18T16:01:12.000Z",
          "Titre": "I use this service evert week to call…Calling UK.",
          "Contenu": "I use this service evert week to call Scotland 🏴󠁧󠁢󠁳󠁣󠁴󠁿 and so far it’s the easiest way to call and it’s a clear connection. Thank you for your service."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Paul",
          "Nb_Reviews": 3,
          "Date": "2021-12-18T15:47:05.000Z",
          "Titre": "Easy to use service",
          "Contenu": "Easy to use service, great value, helps keep me connected to family at this difficult time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clive Leah",
          "Nb_Reviews": 6,
          "Date": "2022-02-28T15:58:55.000Z",
          "Titre": "Enables regular family contact",
          "Contenu": "I live in USA and use it twice a week to chat for an hour with my Mom in UK.  We really appreciate the availability of the service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alastair Harrison",
          "Nb_Reviews": 7,
          "Date": "2023-11-07T19:57:08.000Z",
          "Titre": "Greatness is....",
          "Contenu": "Greatness consists of that which we value most - reasonable cost combined with professional service professionally delivered."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2022-02-22T18:25:53.000Z",
          "Titre": "I've been using this to call Spain to…",
          "Contenu": "I've been using this to call Spain to UK for over a year. It's convenient, cheap, and just keeps on working with zero hassle. I highly recommend it."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mehboob Tarmohamed",
          "Nb_Reviews": 14,
          "Date": "2023-11-08T17:22:43.000Z",
          "Titre": "Flawless experience and superb call…",
          "Contenu": "Flawless experience and superb call quality and connectivity. Easy to use."
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Paul DeCouto",
          "Nb_Reviews": 10,
          "Date": "2023-11-12T12:48:52.000Z",
          "Titre": "Good clear system",
          "Contenu": "Good clear system. Cost effective."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maureen Kolapak",
          "Nb_Reviews": 3,
          "Date": "2021-10-17T15:15:47.000Z",
          "Titre": "This is a seamless process",
          "Contenu": "This is a seamless process and makes for a call to Britain much cheaper than other methods."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "David",
          "Nb_Reviews": 17,
          "Date": "2023-06-08T10:51:15.000Z",
          "Titre": "Easy to use and a reliable connection",
          "Contenu": "Easy to use and a reliable connection. Useful to be sure that my call costs be kept low."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wolves Fan in Houston",
          "Nb_Reviews": 1,
          "Date": "2022-02-06T16:57:37.000Z",
          "Titre": "The best phone service to the UK? RingBritain!",
          "Contenu": "RingBritain has always been a fantastic service  for us. As expats living in the US I would highly recommend RingBritain for providing consistent, awesome phone service to the UK."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GP",
          "Nb_Reviews": 3,
          "Date": "2021-12-06T04:10:11.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, better reception and very helpful service. We use it all the time to call London."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Laverna Cornect",
          "Nb_Reviews": 4,
          "Date": "2023-06-05T15:18:13.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, Haven’t had a problem placing our call to Britian…"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emma Lindsey",
          "Nb_Reviews": 5,
          "Date": "2021-12-30T14:54:01.000Z",
          "Titre": "Top rate.....",
          "Contenu": "Been using Ring Britain for years now and it’s an excellent well priced service.  Well pleased"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "UKK8",
          "Nb_Reviews": 7,
          "Date": "2022-10-31T02:36:57.000Z",
          "Titre": "Easy and smooth",
          "Contenu": "Easy and smooth, never run out of time. Best thing I ever did was to change from the previous service I was using to this one."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara Findlay",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T23:43:36.000Z",
          "Titre": "Easy to dial",
          "Contenu": "Easy to dial. Great clarity."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alastair Harrison",
          "Nb_Reviews": 7,
          "Date": "2021-11-17T19:42:37.000Z",
          "Titre": "Excellent product",
          "Contenu": "Excellent product. My previous provider was more cumbersome, taking longer to complete calls. I highly recommend Ring Britain."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jack Medd",
          "Nb_Reviews": 7,
          "Date": "2022-11-22T19:38:04.000Z",
          "Titre": "Great website.",
          "Contenu": "Your website clear and straightforward about what we get and what it costs.  Easy to use, and we save on long calls to Britain."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Remington  Jeffrey",
          "Nb_Reviews": 12,
          "Date": "2023-09-13T08:51:12.000Z",
          "Titre": "Great company to deal with always happy…",
          "Contenu": "Great company to deal with always happy to help with enquires"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Kowalski",
          "Nb_Reviews": 3,
          "Date": "2021-11-02T21:59:41.000Z",
          "Titre": "Always a very good",
          "Contenu": "Always a very good, clear line and the cost allows me to talk to my sisters whenever I want to."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "John Cowan",
          "Nb_Reviews": 8,
          "Date": "2021-09-07T14:49:44.000Z",
          "Titre": "This is beyond a doubt the best service…",
          "Contenu": "This is beyond a doubt the best service for calling the United Kingdom from Canada."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Jarleth Mcgagh",
          "Nb_Reviews": 12,
          "Date": "2023-06-27T17:54:57.000Z",
          "Titre": "Always a great connection easy to use…",
          "Contenu": "Always a great connection easy to use and prices are fantastic"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Joyce Teague",
          "Nb_Reviews": 3,
          "Date": "2022-06-28T01:50:24.000Z",
          "Titre": "I have been with RingBritain for a…good number of years.",
          "Contenu": "I have been with RingBritain for a number of years.  I could not recommend them highly enough.  Such great value for money.  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victor chapman",
          "Nb_Reviews": 2,
          "Date": "2022-06-05T19:51:33.000Z",
          "Titre": "Very good.Never had a problem.In fact…",
          "Contenu": "Very good.Never had a problem.In fact it's better than very good ! ! !.Regards Victor"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 7,
          "Date": "2022-12-27T00:00:42.000Z",
          "Titre": "Can always complete my call and rates are fantastic.",
          "Contenu": "Rates are exceptional and adding minutes to account is very easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathleen Gould",
          "Nb_Reviews": 1,
          "Date": "2022-05-31T17:47:55.000Z",
          "Titre": "We say that RingBritain is the best…",
          "Contenu": "We say that RingBritain is the best choice for overseas calling."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "M.Lumsden",
          "Nb_Reviews": 3,
          "Date": "2023-10-14T15:43:37.000Z",
          "Titre": "Absolutely trouble free",
          "Contenu": "Absolutely trouble free. First class."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Sarah Rothenberg",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T14:17:50.000Z",
          "Titre": "the line is reliable",
          "Contenu": "the line is reliable, user friendly and consisitent.Keep up your good work"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lee Whitley",
          "Nb_Reviews": 2,
          "Date": "2021-10-30T12:10:05.000Z",
          "Titre": "No problems",
          "Contenu": "No problems. Speed dial settings are instant. Great service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Alan",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T17:08:48.000Z",
          "Titre": "Generally works well and is reasonable…",
          "Contenu": "Generally works well and is reasonable value."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "hossain",
          "Nb_Reviews": 3,
          "Date": "2021-10-11T13:01:11.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. you are doing wonderful job. Thanks very much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenda Jerome",
          "Nb_Reviews": 4,
          "Date": "2023-03-24T20:15:36.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service - I highly recommend it. And easy to use."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "DEREK",
          "Nb_Reviews": 14,
          "Date": "2021-11-27T12:07:31.000Z",
          "Titre": "Service has always been available",
          "Contenu": "Service has always been available and of good quality.Have recommended RingBritain to friends"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony Leader",
          "Nb_Reviews": 38,
          "Date": "2022-02-24T20:55:47.000Z",
          "Titre": "I have used this company for some time…",
          "Contenu": "I have used this company for some time now.Great prices and connections.Easy to add money when getting low10/10 👍👍👍👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pratibha Sinha",
          "Nb_Reviews": 2,
          "Date": "2023-10-14T16:53:01.000Z",
          "Titre": "Excellent service 👍",
          "Contenu": "Low cost and efficient work"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Shari",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T13:32:47.000Z",
          "Titre": "Ring britain is TOPS!!",
          "Contenu": "Ring britain is tops. Cheap and easy to use. Highly recommended"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Kowalski",
          "Nb_Reviews": 3,
          "Date": "2022-09-26T21:28:27.000Z",
          "Titre": "Always good",
          "Contenu": "Always good, clear connection and costs are phenomenal…..thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alastair Harrison",
          "Nb_Reviews": 7,
          "Date": "2022-07-15T17:03:47.000Z",
          "Titre": "The service could not be better",
          "Contenu": "The service could not be better, especially at the price."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Faisal",
          "Nb_Reviews": 2,
          "Date": "2023-10-22T14:42:53.000Z",
          "Titre": "Great Experience with ringbritain.Their…",
          "Contenu": "Great Experience with ringbritain.Their service is cheap and reliable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ROGER SMITH",
          "Nb_Reviews": 7,
          "Date": "2021-10-31T16:16:36.000Z",
          "Titre": "Very good system and very reasonable…",
          "Contenu": "Very good system and very reasonable price. We use it constantly."
        }
      ]
    }
  ]
}