{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "ripspeakers.com",
      "Review": [
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-07-04T17:46:16.000Z",
          "Titre": "I give 2 stars for your generosity, but...",
          "Contenu": "I give 2 stars for your generosity...But the downloading is causing me some issues... Yes I have a poor internet connection, but I do know that it isn't that slow. The download just stops at any point randomly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kal Richmond",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T23:26:48.000Z",
          "Titre": "Website Layout, Is it a SCAM?",
          "Contenu": "I didn't like the over all website, seemed sketch but of course I know Thacker so I trusted it. a better layout and theme to the web site would do the trick."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Shouryaman Rawat",
          "Nb_Reviews": 2,
          "Date": "2023-01-12T18:42:32.000Z",
          "Titre": "Sounds are not unique",
          "Contenu": "Melodies and all the sounds are really good but are not unique enough fir almost every genre to fit in . There is a less variety of sounds for other genres (oyher than trap )"
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Carlos Jimenez",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T18:55:24.000Z",
          "Titre": "I have a doubt..",
          "Contenu": "I have a doubt... in the product description it mentions that it weighs 1.2 gb and that it contains 458 files and I only received a 35 mb package"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TrezPazz_DaKornerzOfUrMind",
          "Nb_Reviews": 2,
          "Date": "2023-06-13T20:37:53.000Z",
          "Titre": "New to it but I am also TRUE to it",
          "Contenu": "By being new to producing my own sound. I went thru alot of freebies packs from a lot of folks. But I did find several different types of sounds and rhythms that are packed into along with many kinds of melodies.Thank u"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Patel Pujeel",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T17:09:29.000Z",
          "Titre": "New sample pack idia",
          "Contenu": "My experience with bundle is to good and company is doing good but we need free sample pack that have a classical or metel piano 🎹 or sumthing like that free pack and new 8o8 s like in ,(nf the search)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "levi duppong",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T18:10:54.000Z",
          "Titre": "The ripspeakers techs are amazing",
          "Contenu": "The only reason that I'm rating this under a five is that there was a mistake in the first place. Somehow my account was misplaced and I lost all my purchases. However, the ripspeakers staff were extremely helpful and got me all fixed up in less then 48 hours, which is incredibly fast, and also why I'm writing this review right now. Thank you ripspeakers!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mickey",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T22:14:13.000Z",
          "Titre": "Incredible!",
          "Contenu": "Fantastic selection of music! The rate of new loops and one shots is mind boggling! A little slow, and could use more variety but other wise 4/5!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J Michael Ingram",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T18:46:20.000Z",
          "Titre": "Website is well organized and delivery…",
          "Contenu": "Website is well organized and delivery is problem free.  The content is of average to above average quality.  I have to learn to click on the time limite specials more quickly as I missed collecting the last freebie.  But that's on me, LOL."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T17:05:28.000Z",
          "Titre": "The way you get packs is a little weird...",
          "Contenu": "The way you get packs is a little finicky and almost seems like a scam. Why would RIPSpeakers need to know my location? Otherwise, this is really great! These packs are pretty sweet, and Ill actually purchase some packs soon!"
        },
        {
          "Note": 4,
          "Lieu": "AM",
          "Pseudo": "Alen Sargsyan",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T20:38:47.000Z",
          "Titre": "I like this sounds",
          "Contenu": "I like this sounds, especially percs. I honestly RECOMMEND all you to buy one of R.I.P Speakers packs!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Bridgeman",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T19:08:50.000Z",
          "Titre": "Respectable and Professional",
          "Contenu": "Very friendly and just super communal. I love it at RIP Speakers."
        },
        {
          "Note": 4,
          "Lieu": "HR",
          "Pseudo": "Luka Borjanić",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T18:50:01.000Z",
          "Titre": "Fast delivery and clear instructions",
          "Contenu": "Fast delivery and clear instructionsI'm satisfied"
        },
        {
          "Note": 4,
          "Lieu": "HU",
          "Pseudo": "Alfa",
          "Nb_Reviews": 1,
          "Date": "2022-07-04T17:00:40.000Z",
          "Titre": "there could be more free packs"
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "Shapop",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T07:09:42.000Z",
          "Titre": "Unique Sound Drumkit",
          "Contenu": "I'm looking for some unique sounds. The Trilogy drum kit bundle absolutely delivered. Amazing! 🤩 These are sounds that I've never heard before in orther label."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zackary Driscoll",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T17:31:58.000Z",
          "Titre": "BEST COMPANY FOR DRUMS & SAMPLES!",
          "Contenu": "Of one the absolute BEST companies to get loop packs/drum kits or anything related. Also the newsletter is absolutely LIT! always jammed with amazing content & useful information. Ed Talenti is a pillar of the Beatmaking community & respected/supported by hundreds of thousands across the world. Just grateful ive found his pages & was able to join his community on YouTube, Discord, Instagram Etc. & Everytime I cookup using one of his loops or drum kits. It's absolutely flames. EVERY SINGLE TIME! everything he makes personally is absolutely amazingly 🤯 mind blowing. No cap. 🧢 You'll always be thankful & satisfied with ANY & ALL purchases. Or EVEN THE FREE PACKS WILL MAKE YOU A HAPPY PRODUCTIVE PRODUCER & INSPIRED like never before. Trust. -ZDBeKuttinUp"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ray Biney",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T18:48:35.000Z",
          "Titre": "Quality Over Quantity",
          "Contenu": "I have purchased packs form many different companies over the past two years. Companies such as Unison, Cynmatics, WaveGrind, Function Loops and many more usually offer packs containing hundreds or even thousands of loops and samples. However, non of them beat the quality and authenticity of the small packs I recently purchased from RIP Speakers. They really value quality over quantity."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Delone Turner",
          "Nb_Reviews": 2,
          "Date": "2023-08-06T23:59:53.000Z",
          "Titre": "Haven't got a chance to check out all…",
          "Contenu": "Haven't got a chance to check out all the sounds yet but I have heard some of the sounds and they're sounding amazing working on a beat in a minute right now. to one of the samples I'll get back with you but the sounds are in there nice appreciate it thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T21:16:09.000Z",
          "Titre": "The thing that made my experience great",
          "Contenu": "The thing that made my experience great was the amazing sounds from the sample packs and you mite think the free sample packs are bad but there actually really good and that’s why I recommend RIP Speakers.com"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "weeyoungy",
          "Nb_Reviews": 5,
          "Date": "2022-08-29T18:15:01.000Z",
          "Titre": "Magic",
          "Contenu": "I produce dark ambient music and I downloaded a bunch of sample packs from here to use in my music. I edit and distort the samples in ways that make them unrecognisable to whoever listens, these samples are perfect. I don't know if that's helpful, but I really do think these samples are pretty great, I had a blast listening to them as I made my music."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam R",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T02:04:15.000Z",
          "Titre": "Great Site for sound packs and more…!",
          "Contenu": "RIP Speakers is a great site for sound packs! The creator Ed Talenti is awesome. You should definitely check out his Youtube Channel. My downloads were available instantly. Super Trustworthy site from my experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DaGeck0",
          "Nb_Reviews": 2,
          "Date": "2022-08-29T22:10:33.000Z",
          "Titre": "I've been shopping at RIP Speakers…",
          "Contenu": "I've been shopping at RIP Speakers since Ed Talenti launched it. The only problems I've ever had have been related to trying to use the reward coins to purchase special deals, since you have to select to use the reward coins BEFORE you can see the special deals. However, I was able to work around even that by adding an extra item to trigger the use of the coins and then removing the extra item before completing the purchase.RIP Speakers have great sounds, including some that are a bit edge-case... they might not be for everything, but in those special cases, they are perfect!"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "David Adesina",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T17:43:35.000Z",
          "Titre": "It is great",
          "Contenu": "It is a good site it's got the basic stuff and those packs🤌 but you see sometimes it distorts a bit in the mobile view. I wish there were constant update on the articles like new articles, what's new, probably even links to ed's videos cause you never know which beginners might stumble upon your site. Other than that it's great and I love it and when it comes to content, packs and tutorials 🔥. I'd give it a 4.8⭐."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Iwo Jarmużewski",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T02:18:41.000Z",
          "Titre": "My honest opinion",
          "Contenu": "Listen guys i love Ed's videos and to be honest RIP speakers never dissapoints me. Always good quality. I would really recommend buying drum kits or even download all of the free once. They really helped me level up as a producer. Thank you guys!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zeke",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T15:44:47.000Z",
          "Titre": "RIP speakers sounds are top notch",
          "Contenu": "RIP speakers sounds are top notch. I feel like  I’m really using some premium sounds in my beats and the sounds also are very unique which helps spice up my beats. The products are very high quality and I would highly recommend it to any producer who wants some different unique sounds to add to their library."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mitchell Stein",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T00:05:12.000Z",
          "Titre": "Awesome website and interface",
          "Contenu": "Awesome website and interface. Obviously very well designed and no lag when navigating the site. Sample packs are seriously good, and even the freebies are high quality. Hats off to Ed and his team.Cheers"
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Jethro",
          "Nb_Reviews": 3,
          "Date": "2022-08-29T18:02:38.000Z",
          "Titre": "Excellent.",
          "Contenu": "Very high quality, placement ready sounds for your music. Never hesitate to open a kit and use any sound from the category you want. Excellent sounds made from scratch to make your music sound clean and professional."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Emmanuel Reitz",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T14:03:47.000Z",
          "Titre": "Top of the line sound packs",
          "Contenu": "Top of the line sound packs. I like how the content matches the theme it was designed around. The website is intuitive and looks cool, plus Ed Talenti makes great videos on Youtube to help with your beat making activities. I highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "CY",
          "Pseudo": "Me",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T17:08:32.000Z",
          "Titre": "RIP speakers is the best website for your kits and one shots and effects",
          "Contenu": "RIP speakers offers a great selection of drum kits, one shots and more. Ed (who runs and owns RIP speakers) is a great guy, and brilliant on YouTube and produces some amazing stuff. Big up RIP Speakers, the best place to buy your drum kits and effects."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Sparta M",
          "Nb_Reviews": 6,
          "Date": "2022-08-29T21:10:39.000Z",
          "Titre": "Love EdTalenti's work and the…",
          "Contenu": "Love EdTalenti's work and the @ripspeakers team. High quality products for affordable price including alot of freebies and useful resources ! one of the finest production team on earth."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Cheluga",
          "Nb_Reviews": 3,
          "Date": "2023-08-05T08:37:50.000Z",
          "Titre": "The Best?",
          "Contenu": "Been watching EdTalenti for a while, I thought I should check out his site, and It was AMAZING!! Perfect Samples for free?!?! I've already released 2 songs with RIP Speakers. Congrats on the success, RIP Team!"
        },
        {
          "Note": 5,
          "Lieu": "HU",
          "Pseudo": "Attila Hermann",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T17:27:26.000Z",
          "Titre": "Perfect team",
          "Contenu": "RIP Speakers is my favorite sample source! Even the free downloadables are premium quality! For production I mostly use RIP drumkits, no need to look for any other drums."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alfie",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T22:32:12.000Z",
          "Titre": "I just got the free packs",
          "Contenu": "I just got the free packs, and they were very high quality, and i work on the mpc one, so i was happy to see how choppable some of the melodies were. On top of that the free drum pack is very good, just make sure you turn down the gain on some of those snares lol."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Tim Wiedemann",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T18:48:25.000Z",
          "Titre": "Nice Sounds for beginners and newbies",
          "Contenu": "Im just a little hobby Producer from Germany but i have to say these Sounds are amazing and the prices are reasonable. For me Personally not everything fits but i can say it was worth anyway. I got inspired in so many ways and i keep looking for new packs!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Rick Westhof",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T13:35:26.000Z",
          "Titre": "Really great site",
          "Contenu": "It’s a really nice site, visually pleasing and they really deliver on the thing you buy. I recommend this site to people who like to use new sounds in music production or to people who need good quality sounds for a good price!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T15:09:47.000Z",
          "Titre": "Sure it's 🔥",
          "Contenu": "Haven't completely listened through the RIP SPEAKERS sound packs, but if I know Ed I'm sure they're gonna be fire, As a upcoming producer who does struggle packs like this are a life saver Wether its just one shots, melodies,or drums, etc, it all helps Nice one Ed"
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Martin Casallas",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T20:08:31.000Z",
          "Titre": "Best sample packs",
          "Contenu": "The UI is very comfortable and easy to use, the drumkits are pretty useful and it has a wide range of sounds that new producers can easily use."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Wellyk",
          "Nb_Reviews": 6,
          "Date": "2023-06-20T19:05:04.000Z",
          "Titre": "RIP Speakers is the best source for…",
          "Contenu": "RIP Speakers is the best source for producers on the internet if you are looking to update your samples library they are the GOATS at providing you with dope samples"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abe",
          "Nb_Reviews": 1,
          "Date": "2022-09-11T03:16:40.000Z",
          "Titre": "Best purchase ever",
          "Contenu": "I’m producing for a year now. through out the year I obviously got better and better and bought a lot of packs from all sort. I bought cheap packs and expensive ones, I bought packs that the biggest producers gave a review on it, and I bought Ed’s new pack. The melody’s, the one shots, and the drums. I NEVER IN MY LIFE MADE A BETTER PURCHASE FOR MY PRODUCING!!!Thank you Ed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 6,
          "Date": "2023-01-14T08:17:19.000Z",
          "Titre": "Possibility of Making VST’s?",
          "Contenu": "You guys, always provide awesome kits, at decent prices, unique sounds, and all original!!!! I would love see Custom VST’s from you guys in the near future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Michael",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T21:02:56.000Z",
          "Titre": "Great products from a great music maker",
          "Contenu": "Ed Talenti is an awesome producer, musician, and friend to the music community. His products are always top-notch, and they get better with every release. Never a disappointment."
        },
        {
          "Note": 5,
          "Lieu": "MW",
          "Pseudo": "Shalom Jasi",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T13:22:51.000Z",
          "Titre": "Really great sounds overall",
          "Contenu": "Really great sounds overall, even the free drum kits go hard, especially earthquake so I can say I enjoyed my experience"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Hubs Beats",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T01:18:57.000Z",
          "Titre": "Exactly what you want",
          "Contenu": "So many times I've purchased a sound pack, to find that MOST times the only DECENT sounds are the ones they preview to you.So you end up paying big $ for a couple sounds.RIP SPEAKERS is GOD TIER.I've never scrolled through a newly purchased pack and it gets me bouncing in my seat with HYPE."
        },
        {
          "Note": 5,
          "Lieu": "HU",
          "Pseudo": "Mihály “Toxic” Barkóczy",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T15:31:35.000Z",
          "Titre": "I'm a new producer and my dream was…",
          "Contenu": "I'm a new producer and my dream was making cool music for peoples.This site definately help me a lot u can found everthing in one place to make the perfect beat or lo-fi songs.Thanks for this work keep it going!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DrDoofes",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T05:49:47.000Z",
          "Titre": "great people!",
          "Contenu": "I really love this area because all of the sounds are really good and the person behind it, Ed, makes great content and music. In fact, Ed is the only reason I’m making music right now. So that is why I leave this site a 5/5"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Driss",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T09:12:22.000Z",
          "Titre": "Great sounds",
          "Contenu": "All the packs in the store are incredibly helpful and could help improve the overall quality of the beat, even if ur only getting the free packs it’s definitely worth a shot."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Kumar",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T08:59:50.000Z",
          "Titre": "Rip Speakers provide us with really…",
          "Contenu": "Rip Speakers provide us with really unique sounds. My favourite are the one shot kits. Having Rip Speakers one shots, now I don't think now I need any plugin to create some unique sounds ❣️."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abhilash Kalyan",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T17:12:13.000Z",
          "Titre": "Thank you!",
          "Contenu": "Thank you! RIPSPEAKERS has provided me with a tremendous amount of free sounds that I have used to make tracks. They're super cool, user-friendly, and amazing. 100% recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lukas Meyer",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T18:04:03.000Z",
          "Titre": "Amazing",
          "Contenu": "I have been a fan of Ed Talenti for a while, and his sample packs really got my motivation to make more beats up!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Fabian",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T18:58:47.000Z",
          "Titre": "Ed Talenti Legend.",
          "Contenu": "Ed Talenti Legend.I really like the sounds of the free soundkits. I didn't purchase anything so far, but I will consider it, after I used the free samples.Much respect."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Lisitsyn",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T18:25:26.000Z",
          "Titre": "The best place with the best TRACKS!",
          "Contenu": "RIP Speakers has provided me with some of the best service and quality loops that are easy and very inspiring to work with! These loops are excellent for the Hip-Hop genre! RIP Speakers is the place to get your loops!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Tobiah Friesen",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T21:49:20.000Z",
          "Titre": "The packs are super high quality",
          "Contenu": "The packs are super high quality. Their drums knock and their melodies are a VIBE. Their loops even come with stems. They even have Free stuff. Go check these guys out. I just have one suggestion! I think all your melodies should come with Midi chords or something. It will help those who don't know music theory."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Salvador Delatorre",
          "Nb_Reviews": 2,
          "Date": "2022-08-29T17:37:08.000Z",
          "Titre": "This website is fantastic",
          "Contenu": "This website is fantastic! Quickly becoming one of my favorite places to get samples, and the service is fast, easy, and with no hassle!"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Qasim Nawaz",
          "Nb_Reviews": 2,
          "Date": "2023-01-12T18:50:15.000Z",
          "Titre": "I got great experience with Rip…",
          "Contenu": "I got great experience with Rip Speakers.  They just got powerful sample packs and made them very carefully.They Deserve 5 out of 5 ."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Giacomo",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T21:29:09.000Z",
          "Titre": "very useful sounds",
          "Contenu": "I use the sample packs by rip speakers in almost all my productions.unique and usable sounds highly recommended"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Martine",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T17:22:07.000Z",
          "Titre": "I made a purchase from them a while…",
          "Contenu": "I made a purchase from them a while back but lost what I bought and my account was locked out! The team got me another account and my downloads back!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Den",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T18:56:36.000Z",
          "Titre": "5 Stars! Blew me Away!",
          "Contenu": "Ed is such a great dude, and these sounds are incredible! The whole experience was tidy and streamlined! 5 Stars, Would totally recomend!Keep up the good work Ed!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T09:44:40.000Z",
          "Titre": "Awesome Sound Pack!",
          "Contenu": "Adoro i suoi video ed i suoi sound pack! Ed Talenti è un grande, sempre sorridente ci regala sempre nuovi trick per le nostre produzioni audio. Grazie!"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "TheGreat Ndira",
          "Nb_Reviews": 1,
          "Date": "2022-09-11T19:57:32.000Z",
          "Titre": "RIP Speakers Have Good Sounds And…",
          "Contenu": "RIP Speakers is a fast working website and the are amazing and good sound, you can ask me I once purchased them."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Saad Farooq",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T19:14:30.000Z",
          "Titre": "inspiring sounds",
          "Contenu": "Really high quality and inspiring sounds. These are my favorite to use whether for drums or samples."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Chris",
          "Nb_Reviews": 3,
          "Date": "2022-08-30T10:39:45.000Z",
          "Titre": "Flexible and amazing packs",
          "Contenu": "I have downloaded and used Ed packs and his beats makes somehow the workflow super easy ! Thanks for the free packs too !Totally recommended Chris"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Michał Jóźwiak",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T17:11:12.000Z",
          "Titre": "Spectacular website",
          "Contenu": "Spectacular website - if You're a music producer, no matter how advanced are Your skills, You will surely find lots of useful tools to help You with Your adventure!"
        },
        {
          "Note": 5,
          "Lieu": "BJ",
          "Pseudo": "Crestprod",
          "Nb_Reviews": 2,
          "Date": "2022-11-01T09:50:55.000Z",
          "Titre": "Love the kits I got",
          "Contenu": "Love the kits I got, most especially the freebies they all sounds fire hard hitting kicks, supa dope"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R. Ramey",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T17:13:50.000Z",
          "Titre": "Everyone experiment and enjoy",
          "Contenu": "What an excellent experience. From the website to the ease of downloading. Very professional from beginning to end. I definitely recommend for everyone to try it out. It will not disappoint."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dmitrios Andrade",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T21:12:53.000Z",
          "Titre": "Love the access to free packs and kits!",
          "Contenu": "Love the access to free sampling packs and kits and as a 15 yr old producer I appreciate free stuff alot."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Evilest Eye",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T04:07:25.000Z",
          "Titre": "Excellent quality",
          "Contenu": "The sounds are SOOO good very unique and amazing quality. These days most of my beats’ sounds are almost completely from RIP speakers"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory(Prof.Logik)Grant",
          "Nb_Reviews": 11,
          "Date": "2023-02-19T23:32:27.000Z",
          "Titre": "RIP speakers is the place to shop for sounds",
          "Contenu": "This is what an online shopping experience should be like hassle free easy to navigate and to checkout."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Krunal Chauhan",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T05:30:56.000Z",
          "Titre": "RIP speaker is very good brand for…",
          "Contenu": "RIP speaker is very good brand for awesome sounds. The design and outlook of the website is very clean and convenient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mihai",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T13:54:41.000Z",
          "Titre": "Theese packs have changed my beats…",
          "Contenu": "Theese packs have changed my beats theyre Really high quality! The Free packs are too good to Be Free,but i am thankful. I think The comunity should alslo Be a le to post drumkits for a chosen price în a tab called comunity."
        },
        {
          "Note": 5,
          "Lieu": "SV",
          "Pseudo": "David Mejía",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T21:39:37.000Z",
          "Titre": "Very good packs",
          "Contenu": "Very good packs, but I have tried to contact them from their website and via email, but they do not respond."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Randeep Singh",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T18:25:19.000Z",
          "Titre": "Great stuff for producers and artists",
          "Contenu": "Great stuff for producers and artists. Reasonable prices. You couldn't ask more."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Wellyk",
          "Nb_Reviews": 6,
          "Date": "2023-06-05T18:04:57.000Z",
          "Titre": "Dope stuff 👌",
          "Contenu": "Oh man RIP Speakers is dope I support the creator behind it Edtalenti 🙏 💜😊"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Coco Lovero",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T21:46:34.000Z",
          "Titre": "Great!",
          "Contenu": "Incredible resources for learning and getting started. It’s always affordable or even free, and high quality!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Kestal KSTL",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T19:15:00.000Z",
          "Titre": "This is the reason music is great again",
          "Contenu": "Those are all the sounds a professional producer needs, thx RIP team"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesse G. Romero",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T17:58:50.000Z",
          "Titre": "Great sample packs and rewards program",
          "Contenu": "Great sample packs and rewards program! Transactions are very smooth with instant delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trey",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T17:59:10.000Z",
          "Titre": "Searching and downloading",
          "Contenu": "The process of finding and downloading my product was very simple and straight forward!"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Kelso Keogh",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T20:37:31.000Z",
          "Titre": "The site is easy to use",
          "Contenu": "The site is easy to use, downloading the products are quick and easy, and the actual products are awesome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SlayDay",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T12:37:29.000Z",
          "Titre": "Take your music to the next level!!",
          "Contenu": "The sounds from RIP speakers are awesome! Their packs are full of great loops to take your productions to the next level!"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Ethan Jones",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T18:52:36.000Z",
          "Titre": "This is the best way in my opinion to get good quality sounds",
          "Contenu": "It was so easy to download, and I would recommend it to all music producers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Isaac Mbiad",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T02:29:52.000Z",
          "Titre": "great packs",
          "Contenu": "great packs, great sounds, the only thing i would say is better hi hats and 808s, but other than that 🔥"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Owen Robertson",
          "Nb_Reviews": 2,
          "Date": "2022-10-27T20:09:07.000Z",
          "Titre": "Very HIGH Quality One-shots!",
          "Contenu": "Very HIGH Quality One-shots. Best downloads on the market. Great For Beginners and Seasoned Pros! Keep it up!"
        },
        {
          "Note": 5,
          "Lieu": "KE",
          "Pseudo": "Joseph",
          "Nb_Reviews": 3,
          "Date": "2023-01-12T20:21:27.000Z",
          "Titre": "High quality drumkit",
          "Contenu": "They have high-quality drum samples to use for making professional beats."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Story Griffin",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T16:36:53.000Z",
          "Titre": "Great quality sounds for cheap",
          "Contenu": "Great quality sounds for cheap! Everything an aspiring producer needs!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Pauline Mancini",
          "Nb_Reviews": 2,
          "Date": "2022-08-29T17:24:28.000Z",
          "Titre": "I loved the quality of RIP Speakers",
          "Contenu": "I loved the quality of RIP Speakers! The sounds are great out of the box and help me to produce quickly and with a high quality ! Recommend it !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T. Palmer",
          "Nb_Reviews": 2,
          "Date": "2022-08-29T20:20:19.000Z",
          "Titre": "Loving The Afterlife Sound Packs",
          "Contenu": "I love the Afterlife sound packs I just got! Can’t wait to make some awesome music with these 🔥 samples!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "more CAMREN HOLMES",
          "Nb_Reviews": 2,
          "Date": "2022-08-29T22:18:17.000Z",
          "Titre": "quality sounds",
          "Contenu": "Looking for High quality sounds and some nice melodies, you came to right place"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory(Prof.Logik)Grant",
          "Nb_Reviews": 11,
          "Date": "2023-01-26T02:28:13.000Z",
          "Titre": "Rip speakers is the best",
          "Contenu": "Process was easy and direct no issues at all at checkout awesome experience thanks rip speakers"
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "ManKave Media",
          "Nb_Reviews": 2,
          "Date": "2022-09-06T03:02:25.000Z",
          "Titre": "Ed is the man!!!",
          "Contenu": "Ed is the man.  Watched his videos for quite awhile now.  They are great for sources of info or if you just want to add a smile to your day.  Very engaging.  Oh...and high quality sample packs :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AK Beatz",
          "Nb_Reviews": 2,
          "Date": "2022-08-30T21:40:16.000Z",
          "Titre": "The free packs were so good I decided…",
          "Contenu": "The free packs were so good I decided to purchase a couple. I've already used some of the sounds. Great packs at a reasonable price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon McCollum",
          "Nb_Reviews": 2,
          "Date": "2023-03-10T03:27:45.000Z",
          "Titre": "EdTalenti and the RIP Speakers crew are…",
          "Contenu": "EdTalenti and the RIP Speakers crew are the absolute best!"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Quique.r",
          "Nb_Reviews": 12,
          "Date": "2023-01-12T23:54:53.000Z",
          "Titre": "They are nice",
          "Contenu": "They are nice, and have a nice bunch of things that are usefull. so ty 100% recommended"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tyler Huneycutt",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T04:41:06.000Z",
          "Titre": "Great!",
          "Contenu": "There are a lot of free samples and the website functions very nicely. Thank you Ed Talenti and Co!"
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "Darren Hunt",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T05:00:34.000Z",
          "Titre": "Review",
          "Contenu": "Mostly I love Ed’s videos. It pulled me towards producing. And mostly I like on how you give out free packs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron Melchor",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T17:45:43.000Z",
          "Titre": "Great high-quality products",
          "Contenu": "Great high-quality products and quick, easy access to downloads."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RyanThaOldMan",
          "Nb_Reviews": 5,
          "Date": "2023-05-30T09:24:46.000Z",
          "Titre": "great sounds and samples",
          "Contenu": "great sounds and samples, great prices, great service. had my purchase within seconds"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Luca Lord",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T15:15:47.000Z",
          "Titre": "SO GOOD",
          "Contenu": "These samples sound so nice for my songs, and they are very affordable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AK Beatz",
          "Nb_Reviews": 2,
          "Date": "2023-01-12T23:16:20.000Z",
          "Titre": "Fire sound packs.",
          "Contenu": "I love the free packs. The website is user friendly. Also, the quality of the free packs is what led me to purchase a few packs as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "hector",
          "Nb_Reviews": 1,
          "Date": "2022-08-31T01:34:46.000Z",
          "Titre": "RIP review",
          "Contenu": "the site was easy to use and the down loads. super fastI would definitely order more"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PheniX",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T00:04:46.000Z",
          "Titre": "RIP Speakers is AMAZING!",
          "Contenu": "I really love to make beats with all of RIP Speakers plugins and packs!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "SPC",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T17:55:14.000Z",
          "Titre": "I love it",
          "Contenu": "Awesome and high quality samples. The right place to go for awesome stuff👌"
        },
        {
          "Note": 5,
          "Lieu": "GH",
          "Pseudo": "Frank Thompsons",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T15:58:28.000Z",
          "Titre": "If Ed Talenti is rip speakers",
          "Contenu": "If Ed Talenti is rip speakers, man you killing it 🤣"
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T02:21:19.000Z",
          "Titre": "Rip Speakers is really recommended!",
          "Contenu": "The sounds are Great!The free and paid packs are really high quality!and i had fun messing with them"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Ronan Lee",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T19:03:42.000Z",
          "Titre": "Amazing free packs and all-round a…",
          "Contenu": "Amazing free packs and all-round a great wesite"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David S",
          "Nb_Reviews": 2,
          "Date": "2023-02-24T18:42:32.000Z",
          "Titre": "Great Service",
          "Contenu": "A good service and the sounds bought are really good quality"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Lorenzo Lame",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T21:51:35.000Z",
          "Titre": "great quality and very helpful tools"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stef",
          "Nb_Reviews": 2,
          "Date": "2022-10-01T20:16:01.000Z",
          "Titre": "Hi fi sounds",
          "Contenu": "Hi fi sounds, easily categorized"
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "KhalifVero",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T01:26:07.000Z",
          "Titre": "Great Product",
          "Contenu": "Great producer Great sound 🎃"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Quique.r",
          "Nb_Reviews": 12,
          "Date": "2023-01-26T00:19:08.000Z",
          "Titre": "nice experience",
          "Contenu": "nice experience, and was fun"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Owen Robertson",
          "Nb_Reviews": 2,
          "Date": "2023-02-24T19:41:24.000Z",
          "Titre": "This Is Great with NO EXEPTIONS",
          "Contenu": "This Is Great! best store to get HARD DRUMS. I use his samples all of the time. 10 star!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "lowaco",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T22:22:58.000Z",
          "Titre": "Very Good",
          "Contenu": "The 808s smashHighhats are spicy Claps are crisp and yeah how it should be."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tunji",
          "Nb_Reviews": 3,
          "Date": "2022-08-30T08:07:06.000Z",
          "Titre": "Great pack",
          "Contenu": "Great pack, I needed some better kicks and I got them. Thanks Ed."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Adek",
          "Nb_Reviews": 2,
          "Date": "2023-03-08T19:00:46.000Z",
          "Titre": "Nice samples with the punch i am…",
          "Contenu": "Nice samples with the punch i am lucking for.😉👌🔥"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "pradawnyelf",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T18:54:02.000Z",
          "Titre": "One of best partner \"sampel\" for my DAW…",
          "Contenu": "One of best partner \"sampel\" for my DAW ;)"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Arjun",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T12:12:27.000Z",
          "Titre": "I love it",
          "Contenu": "I love it. I've bought so many packs and each new pack is a banger"
        }
      ]
    }
  ]
}