{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "rkgamingstore.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cameron Poe",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T14:47:52.000Z",
          "Titre": "Uncommunicative customer service",
          "Contenu": "Uncommunicative customer service. Should’ve bought on Amazon. I just want a full refund and a return for a practically unused keyboard but no one will respond to my emails. Amazon can create a refund and return in minutes with free shipping back. Thought I would support the company directly but I was completely wrong."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "niubisay moran",
          "Nb_Reviews": 2,
          "Date": "2022-06-29T20:22:35.000Z",
          "Titre": "Do not buy to this seller",
          "Contenu": "Do not buy to this seller. They sent the wrong item.I bought RK61 60% Dual Mode Wireless Mechanical Gaming Keyboard, Black - Red Switch.I I received totally different item, TH-90000 65W/45W mono band Fm mobile transceiver.  I don't have any idea what it is. I'm very disappointed because my son was waiting for the keyboard"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Osman Khwaja",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T02:39:42.000Z",
          "Titre": "Horrible keyboard",
          "Contenu": "My RK61 turns on but suddenly turns off. It was plugged in with full charge, until sometimes only the FN key turns on but not the entire keyboard. I don’t even know what that means."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "anon",
          "Nb_Reviews": 2,
          "Date": "2022-11-16T14:03:26.000Z",
          "Titre": "They will spam you with emails every…",
          "Contenu": "They will spam you with emails every few days until you review them. No easy way to return keyboards. I purchased the wrong one by mistake and they make it difficult to find how to return it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Louei Arias",
          "Nb_Reviews": 1,
          "Date": "2022-06-03T04:56:22.000Z",
          "Titre": "got here much later than said",
          "Contenu": "got here much later than said, box came absolutely destroyed, keys inside were in not in place at all."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2021-10-26T09:23:55.000Z",
          "Titre": "***DO NOT BUY FROM THIS SELLER***",
          "Contenu": "***DO NOT BUY FROM THIS SELLER***I bought a keyboard from them and when I plugged it in, the battery blew a spark and began to get hot until I unplugged it. They then took 0 responsibility. Worst customer service. They wanted me to send it back - tell me which postal service accepts dangerous goods to be sent such as a damaged battery also the cost of shipping their low quality product to china would be more than the product itself. Seller is a scammer. Do not buy from them."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2021-04-20T09:43:39.000Z",
          "Titre": "Ordered a keyboard for $84",
          "Contenu": "Ordered a keyboard for $84, was not in the european warehouse.I had to wait till mids of april, i sent a mail again but the mail does not exist annymore and the site isnt operating annymore, im pretty sure i got scammed.Edit: they have sent me an email but whenever i try to send one back i get the message “the message was not sent to supportrkgaming.com because the domain rkgaming.com does not exist”, ive tried this atleast 5 times without succes."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Jurgen Mathes",
          "Nb_Reviews": 1,
          "Date": "2021-05-07T09:37:38.000Z",
          "Titre": "Where is my order? Order from Germany. No info a about the shipping.",
          "Contenu": "I'm from Germany and I bought a keyboard. Unfortunately I didn't get any info when it will arrive or if it is sent already."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "akim laberge-touat",
          "Nb_Reviews": 1,
          "Date": "2022-02-03T20:23:22.000Z",
          "Titre": "My keyboard doesn't work and I stopped…",
          "Contenu": "My keyboard doesn't work and I stopped getting reply from the support"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Ancira",
          "Nb_Reviews": 1,
          "Date": "2021-08-11T00:57:22.000Z",
          "Titre": "Did not arrive"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Omo Solomon Evwodere",
          "Nb_Reviews": 4,
          "Date": "2023-11-02T17:22:17.000Z",
          "Titre": "Out of Stock after I already bought it",
          "Contenu": "I got an email saying The keyboard I bought and paid money for (RK920) was now out of stock. They gave me another module (rk96) which I paid an extra £33-£34. I thought it was rgb like the original keyboard I was getting but it was blue light only. The effects are cool I guess and it feels nice to type on but the keys are to squashed together I end up pressing the wrong key. Not much they could have done seeing as the keyboard was out of stock. They did offer a refund but I just needed a keyboard at that point."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MK",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T15:53:46.000Z",
          "Titre": "My first mechanical keyboard",
          "Contenu": "My first mechanical keyboard, so not sure how helpful my review is. The keyboard is super solidly constructed. Pretty heavy little beast. Love the different color modes. Wish the listing on Amazon would have let me know the software was NOT Mac supported."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "William Chapman",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T19:17:32.000Z",
          "Titre": "ISO to No Go.",
          "Contenu": "I wanted to get a ISO layout from them but only until I brought it, they mentioned that they don't ship those keyboards to the UK. Luckily, I was able to get a full refund back within 24 of receiving the news. Annoying that I cannot get the the keyboard. But at least I got the money back nearly right away."
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "s_m",
          "Nb_Reviews": 1,
          "Date": "2022-08-18T02:37:08.000Z",
          "Titre": "No support whatsoever - now solved",
          "Contenu": "I ordered a RK68 online through the official website. Then, I was contacted via e-mail to confirm my purchase because it was somehow detected as risk of fraud (my shipping address and payment address was different since I'm moving this week and sent it to my sister's address, so maybe that's why).I replied directly to the email. Then, the next day I got the same e-mail.....replied again. I was contacted a THIRD time today. I've checked and double checked my email to make sure it was sent in my outbox and to the correct e-mail listed on their website.Nothing. I've sent a contact form too with from a different e-mail.I'm afraid that they may not return my money; I just want my keyboard. Happy to change this review if it gets solved, but I am so frustrated that their e-mail is probably not working. It's a terrible experience.Update: The representative got back to me. They resolved my issue. I just wish I didn’t have to have had to reach out 3+ times with two different emails to get this fixed. It also delayed my shipping by a few days and I was planning on making a video about it on a certain day, so it’s unfortunate."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Begay",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T11:23:50.000Z",
          "Titre": "weird bug",
          "Contenu": "When I press A and D on my RK68 it turns on caps lock. It has been happening ever since I got the keyboard."
        },
        {
          "Note": 3,
          "Lieu": "SE",
          "Pseudo": "Debora Medeiros",
          "Nb_Reviews": 2,
          "Date": "2021-12-02T10:09:13.000Z",
          "Titre": "Would buy again",
          "Contenu": "The quality of their products isn't bad for the buck. I wouldn't buy keyboards that require more experienced hands to be modded. If it's not hot swappable, be careful: They are very cheap, but the switches spring a lot and the cases are hollow. Their customer service normally answers within 24hrs, which was perfect for me."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Xander Mesu",
          "Nb_Reviews": 1,
          "Date": "2021-05-16T12:00:10.000Z",
          "Titre": "Took a long time but finally received my keyboard, 3/4 stars",
          "Contenu": "I ordered a Royal Kludge RK84 mechanical keyboard and they told me it was not available and that it was available again in European warehouses around mid-April and that they would ship it out then (they could also ship it from China but with import taxes that would become very expensive). It has already been mid-April so I send an email about my order and I got a message that the email address (support @ rkgaming.com) is no longer in use. Hopefully I can get a respond otherwise I'm pretty sure rkgamingstore.com is a big scam.Edit: I finally received my keyboard and it's working as it should. The customer service is very serviable. support @ rkgaming.com doesn't work but royalkludgegaming @ gmail.com does so use that if you have any problems contacting them."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Jeph",
          "Nb_Reviews": 1,
          "Date": "2021-09-02T07:15:07.000Z",
          "Titre": "Not all items found",
          "Contenu": "The keyboard arrived, but it seems like it was used. No keycap puller, usb receiver or manuals. I only got the keyboard and a dirty usb c cable."
        },
        {
          "Note": 4,
          "Lieu": "AM",
          "Pseudo": "Robert Hayeapetyan",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T11:19:28.000Z",
          "Titre": "Fast on replies",
          "Contenu": "Even though I wasn't able to solve my issue (due to fundamental particularities of the keyboard's firmware) the service answered fast everytime I sent a message"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Mikael Collette",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T18:56:48.000Z",
          "Titre": "Great service and product, just needs an updated website",
          "Contenu": "I've been using a wired version (forget the model number) for work for several months and am very happy with it. So I just got the RK96 as a second keyboard to carry around with me when I go to the office. The keyboard itself feels well build and key strokes are smooth. It was a bit heavier than expected but not in a bad way. It feels very sturdy.  The only reason I gave it a 4 star is because the website wasn't reflecting what they actually had in stock. Customer service was very quick in contacting me and offered other options.  It took a bit of back and forth before finding a model I wanted as a second choice but the person that helped me was very responsive and helpful. Would buy from them again."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T15:10:43.000Z",
          "Titre": "Satisfied customer",
          "Contenu": "At first my package didn’t seem to move. But after a mail with customer service, the nice person sent me my order in 2 days and the product is exactly what I expected so I’m happy with it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Noah Dunnagan",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T18:51:29.000Z",
          "Titre": "Customer support was incredible!",
          "Contenu": "Customer support was incredible!They responded within 12 hours of my request. (thousands of times faster then any other service i have bought from) I am rating this a 4 star product because of audio control buttons not working on mac. Nor does the software support mac. Other then that 10/10 product for me. Im going to stress test it and resend this review once i have."
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "Zachs",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T13:08:40.000Z",
          "Titre": "The support was excellent.",
          "Contenu": "The support was excellent.The sales contacted me about my order because the product wasn't available but was given me some choices and the option for a refund between them.I choose to wait and the given estimation for delivery was correct. I receive the product and it is in very good condition and the quality is great too.The only negative is that the site wasn't updated about the availability of the product in the first place."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Antonio Fidalgo",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T10:28:19.000Z",
          "Titre": "I am giving them 4 stars instead of 5…",
          "Contenu": "I am giving them 4 stars instead of 5 stars because, when I told them that I wanted to return the keyboard, they tried to convince me to adjust some keyboard features instead of just proceeding with the change. Having said this, once I told them that my final decision was to return the hardware, they were really proactive in their communication and follow-ups in regard to the keyboard's return steps. I want to thank again Chance for her help and support during this process."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Lucas Gabriel Bezerra de Souza",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T14:41:21.000Z",
          "Titre": "I bought the keyboard RK84",
          "Contenu": "I bought the keyboard RK84. The keyboard is excellent, however, the app is not ideal. I updated the firmware and the keyboard just stopped working.It was necessary to download the firmware directly from the site to make it work again.Overall, the keyboard is excellent! The problem was the app."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Abe Oxley-Hase",
          "Nb_Reviews": 1,
          "Date": "2022-09-07T17:07:54.000Z",
          "Titre": "I'm very happy with the keyboard",
          "Contenu": "I'm very happy with the keyboard I received. It functions exactly as advertised, I enjoy the clarity of the brown switches, and the RGB is also fun. The only reasons it's not five stars is the software used to customized the RGB feels a little dated, and opaque."
        },
        {
          "Note": 4,
          "Lieu": "RO",
          "Pseudo": "Emanuel",
          "Nb_Reviews": 2,
          "Date": "2023-03-07T09:18:53.000Z",
          "Titre": "Be careful on description when buying ( not all models are hot swappable)",
          "Contenu": "Cons:Not Hot Swappable No place to put the usb if not used.No usb portsNot able to exchange the keyboard masksTaxes were not included in the price displayed (another 10 euro was added to the price when buying it)Pros:The keyboard worked wireless with on button selected and wired with off button selected. (the guide did not mention this aspect)I have a lot of option to select the lights without the help of the app.No lag and an ok felling when typing, plus the sound when typing does not border me. (as mentioned on YouTube).Was ok with CS: GO, League of legend and Minecraft.Verry good inclination and nice feeling. (Will see how it will work after a couple of years.)Verry nice and prompt customer service Good lighting on keyboard keysBudget friendlyOverallOn a personal note, I only like this layout out of the others available so if you’re not bother by not being hot swappable, I recommend this model. Hope they will upgrade this layout in the future. (and cover the cons like the other models)"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Iambein Thompson-Laban",
          "Nb_Reviews": 1,
          "Date": "2022-05-01T12:44:13.000Z",
          "Titre": "rk78 review",
          "Contenu": "I am very very pleased with the keyboard I got, it came faster then I thought it would and it’s great! The only problem I have had with it is sometimes the backlight turns off and I have to change the brightness for it to come back. Apart from that nothing has gone wrong and I’m happy with this keyboard! :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Luciana",
          "Nb_Reviews": 3,
          "Date": "2022-06-15T13:09:37.000Z",
          "Titre": "Great customer service / faulty product",
          "Contenu": "Great customer service. Unfortunately I received a faulty keyboard, and they couldn’t ship me a new keyboard because of my current location, but they managed to give me a full refund for the product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allison Doehling",
          "Nb_Reviews": 2,
          "Date": "2022-06-02T17:00:31.000Z",
          "Titre": "so for the keyboard has been working…",
          "Contenu": "so for the keyboard has been working great, can't wait to start customizing it. Everything was done quickly with no hiccups."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 2,
          "Date": "2022-11-08T14:25:02.000Z",
          "Titre": "Pretty good service",
          "Contenu": "Pretty good service my first keyboard I bought was a replacement from somebody they returned there was boogers and hair in the first one I thought I realized because the performance was not so good overall pretty good keyboard and pretty good service nice people"
        },
        {
          "Note": 4,
          "Lieu": "BG",
          "Pseudo": "Dimitar",
          "Nb_Reviews": 8,
          "Date": "2023-01-12T20:01:51.000Z",
          "Titre": "Best customer service",
          "Contenu": "I received an email, asking me to rate the product. Unfortunately I cannot to that, because I still don't have the product. Today, 20d after I order it - still not here. I am in Europe, btw.I actually received the keyboard soon after posting this, and I am currently typing this update on it. :)    Still did not have a chance to use it, but the first impressions are not great. Seems the only benefit so far is the form factor. 996% (yes, \"9\" key registers double press already) keyboard is a nice and compact, without losing too much of the funktioonallity (another doubles registered).    The armrest is already bended straight from the box and does not lay flat to the desk or the keyboard. The lack of middle support is not helping it - yes, it has rubber feet only on both sides, not in the middle. And it it bent a lot! The keyboard seems pretty sturdy, but it also has no middle support.   I went for brown switches. Most of the keys have nice tak-tile sound and feeling, but not all. \"Shift\" key for example feels very soft and mushy and feels more like a linear switch. Other keys has the same issue as well. Surprisingly, the \"Space\" has the most satisfying click I've ever experienced. :)    The volume dial is a nice addition, but yet another problem. Mine rotates relatively well half turn and the other half - stuck and needs a lot of force to overcome it, aaand this is every turn. The finish of the dial is a silver paint, which I expect to peel soon, based on my experience with this type of coating.   My keyboard also has an impact and two scratches on the upper right corner.What I like about it: it is relatively compact, with enough functionality. Solid and heavy build - the keyboard, not the armrest. Tons of preset modes on the backlight. Generally, a nice mechanical feeling. Three levels of the angle in which you can use it.That's all for now. I will probably update my review after some weeks of usage, when I have more experience based feedback.   UPDATE 1: For me, the battery lasted about 40 hours before need for recharging. I used it Saturday and Sunday for for about 10h a day and another 5 days for about 4h each. Not great, but not terrible either. In the evening I use very little light. Because the letters are dark gray color, on a black key caps, it is hard to see them without back light, so I had it on 50% brightness.UPDATE 2: As a matter of fact RK contacted me after this review and we had a very professional communication. It almost make me happy from having an issue on a product. They seems to take very seriously customer's feedback and really work to improve their products and production methods.   They have the best customer service I've ever spoke to so far.   At that point, cannot recommend the m enough. Try their products you wont regret it. If yo even have an issue as I did - they'll take care for it.Good! 👍"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "maggie w",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T02:46:14.000Z",
          "Titre": "its good quality",
          "Contenu": "its good quality, affordable, and comfortable to play with."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Cynthia Essiambre",
          "Nb_Reviews": 1,
          "Date": "2022-05-03T15:00:32.000Z",
          "Titre": "Great site",
          "Contenu": "Great site! Great products. I love the sound clips of the switches. I wish you sold accessories outside the us."
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "cazualchatter",
          "Nb_Reviews": 4,
          "Date": "2021-12-03T01:32:00.000Z",
          "Titre": "Cute Little Keyboard",
          "Contenu": "I bought the RK61 Brown switch. This is the perfect size keyboard for small working spaces. I bought it as my Razer mechanical keyboard keys got messed up. It takes a little getting used to with the controls but the keys are nice to type on. Less noisy than the Razer and more clicky than my normal Logitech keyboard and yes I have them all connected so i could compareI must add that their customer service is very responsive.The light is a bit dim for me so it is less effective in a bright room and not as visible."
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "cazualchatter",
          "Nb_Reviews": 4,
          "Date": "2021-12-14T01:24:33.000Z",
          "Titre": "RK61 white keyboard",
          "Contenu": "Bought the RK61 white keyboard. Their support person Winglam is outstanding. Super responsive and clear communications. The keyboard has one disadvantage. The backlight does not work in a bright room. The keys are silent and feel good. If you like a mechanical keyboard that sounds like a membrane keyboard this one should be considered. Quality looks good. Battery lasts long. Did not get to test how long but looks solid. Size is very cute can be dropped into my small size backpack. Beware that the control keys can be confusing and get to be used to."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Mats",
          "Nb_Reviews": 1,
          "Date": "2021-04-15T08:22:19.000Z",
          "Titre": "Review of the RK 84 and the customer service",
          "Contenu": "I ordered the royal kludge k84 on their website, but it was out of stock in Europe, so they send it from China. The keyboard arrived fast and feels really good and solid, mine had a little noise when turned on. I contacted the customer service and they responded very fast and friendly and gave me several options to send it back, refund it and so on. All in all I’m very happy with my purchase and especially with the customer service!"
        },
        {
          "Note": 4,
          "Lieu": "CL",
          "Pseudo": "Ignacio Muñoz",
          "Nb_Reviews": 1,
          "Date": "2021-06-16T04:24:31.000Z",
          "Titre": "RK84 - Nice customer service, fast shipping and great keyboards for their price",
          "Contenu": "The shipping is fast and the customer service is excellent they answer quickly and reply to all of your emails until your problem is fixed. The keyboards are nice and the best you can get for the price BUT I think they can do better with the software development, support and compatibility issues also their software doesn't seem trustworthy (they've been having a few issues with their software -> DYOR) and finally BEWARE if you get this model the RK84 you have to know that the dongle connectivity range is small so keep that in mind. Thanks Royal Kludge!"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Yusuf",
          "Nb_Reviews": 1,
          "Date": "2021-07-02T10:03:04.000Z",
          "Titre": "Solid source",
          "Contenu": "Solid source. Cheap and good quality keyboards. Safely bought via PayPal. Shipment was done within given time period. But wasn't clear for me which delivery company and from where it came. Also didn't understand the taxing. I guess it was included in price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2021-12-24T03:19:23.000Z",
          "Titre": "Great customer service! O",
          "Contenu": "I was having issues with my RK84 from the moment it arrived. After troueshooting with customer service they sent a replacement that arrived the same day! Excellent cuaomer service. Looking at the RK100 now."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Adriaan Blonk",
          "Nb_Reviews": 2,
          "Date": "2021-10-21T07:31:59.000Z",
          "Titre": "Good and fast service when my package…",
          "Contenu": "Good and fast service when my package got lost, good quality keyboards, only thing i can complain is that the LED's on the rk87 make a little noise when you listen very closely"
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "M.M",
          "Nb_Reviews": 1,
          "Date": "2021-12-01T18:23:28.000Z",
          "Titre": "I would provide a 5 star but im still…",
          "Contenu": "I would provide a 5 star but im still awaiting for the product I ordered to arrive other than that I am happy with the ease of use of the website and ordering"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Charlie Allen",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T04:15:53.000Z",
          "Titre": "Good keyboard",
          "Contenu": "Keyboard is amazing. Great quality and looks awesome. There were some issues with shipping to my location and some confusion but once that was settled everything was okay."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Vince Aloi",
          "Nb_Reviews": 1,
          "Date": "2021-08-09T12:25:58.000Z",
          "Titre": "Keyboard - nothing to big",
          "Contenu": "great keyboard, only issue is that the base where the keys sit are white on a black key, would of been nice to take the side panel off and it be black"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Rohit Ramachandran",
          "Nb_Reviews": 1,
          "Date": "2021-08-24T05:31:18.000Z",
          "Titre": "Pretty amazing service",
          "Contenu": "Pretty amazing service, with exceptional customer service.The software lacks a bit of customisation, but apart from that, worth every penny."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DLONTE HILL",
          "Nb_Reviews": 1,
          "Date": "2022-06-08T02:23:42.000Z",
          "Titre": "hot swappable Switches",
          "Contenu": "I not sure if it hot swappable"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Kmchi",
          "Nb_Reviews": 3,
          "Date": "2021-05-03T06:31:00.000Z",
          "Titre": "The shipping is a bit delayed and I…",
          "Contenu": "The shipping is a bit delayed and I haven't gotten the product yet, but from video reviews online I can't wait to receive it"
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Kent Österberg",
          "Nb_Reviews": 3,
          "Date": "2021-08-11T00:33:00.000Z",
          "Titre": "Really*****",
          "Contenu": "Really good, but i dont like pancakes because im in love with dogs but im allergic...so thats sad and that makes me happy :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nunya B",
          "Nb_Reviews": 1,
          "Date": "2021-12-18T16:09:38.000Z",
          "Titre": "Keyboard defective, But made right",
          "Contenu": "First keyboard was defective. Cassie however was able to replace the keyboard and the new one works perfect!"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Kas Berendsen",
          "Nb_Reviews": 1,
          "Date": "2021-06-07T09:08:21.000Z",
          "Titre": "Great product for its price",
          "Contenu": "Some shipping delays, but customer service handled it well. The product is great for its price!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rien Jones",
          "Nb_Reviews": 1,
          "Date": "2021-10-13T12:21:21.000Z",
          "Titre": "Keyboard is good for the most part",
          "Contenu": "Keyboard is good for the most part, however the Bluetooth is flaky and causes mistypes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Bob",
          "Nb_Reviews": 1,
          "Date": "2021-06-02T03:36:57.000Z",
          "Titre": "I would give it a 5 out of 5 but the…",
          "Contenu": "I would give it a 5 out of 5 but the software is very hard to download>"
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Roy",
          "Nb_Reviews": 2,
          "Date": "2022-04-05T22:30:14.000Z",
          "Titre": "Not available",
          "Contenu": "Unfortunately after ordering, product was not available"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Will",
          "Nb_Reviews": 1,
          "Date": "2021-03-23T20:34:07.000Z",
          "Titre": "Amazingly quick and is  good quality"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marceline Breaux",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T21:19:38.000Z",
          "Titre": "5 star service and product!",
          "Contenu": "This is my third order from RK gaming keyboards. The RK84 is well made and nicely built. The switches are hot-swappable and the keycaps are easily replaceable for customization if desired. I originally ordered the RK61 by mistake and had intended to cancel through customer service. However, thanks to Chance, I was able to change the order without having to cancel. Chance was very efficient and helped me get my order right! Great customer service and great product, definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "aaron",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T14:44:47.000Z",
          "Titre": "Replacement Keyboard",
          "Contenu": "I bought a Keyboard and i was really impressed and was happy at first. After a few days i noticed spring ping and an annoyingly high noise coming from the RGB Backlight. I opened a support ticket and more or less in minutes Terry responded and asked me for a video of the noise. I sent him one with the light on and one where i switch through the rgb modes. Right after he asked me if a want a partial refund of 15€ or a replacement keyboard, I chose the replacement keyboard and it arrived yesterday. Until now i didn't notice any noise but i cant seem to understand if the keyboard feels a little bit different then the first one. The only difference i found is that the new spacebar has 5 switch/stabilizer slots and the original one has 3."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jo davies",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T10:14:00.000Z",
          "Titre": "Amazing customer service.",
          "Contenu": "Amazing customer service, very prompt replies. Spoke to an individual called Chance who was professional, polite and understood the issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Isaiah",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T20:10:54.000Z",
          "Titre": "Comfortable Feel",
          "Contenu": "I chose to wait a couple of months before writing this review. So far I am very satisfied with the product. Other red switch keyboards I have bought, have had bad spring ping and I had to mod them to fix it. This keyboard does not have those issues and sounds good even before a mod. I am not a particular fan of RGB (I know what I bought) but the lighting is low and doesn't cause an annoyance. In the future, I plan to lube the switches and hope to get a thocky feel, but for now, it is a good keyboard. I may buy a smaller one as the 100 is a bit big for me."
        },
        {
          "Note": 5,
          "Lieu": "MT",
          "Pseudo": "Hayley Bassily",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T23:38:05.000Z",
          "Titre": "Love it",
          "Contenu": "Very satisfied over all. Made a mistake with the order and they responded quickly and fixed it right away! The quality feels great and heavy duty, I couldn’t be happier:)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bach Nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T11:43:19.000Z",
          "Titre": "Amazing customer service and product experience!",
          "Contenu": "I was having a misunderstanding after a few days using the keyboard. Because I was rush to conclusion and being hasty, I mistakenly did a bad review about the keyboard on the website.Despite that, the employee was really patience and kindly email me to instruct and help me understand my mistake. My apology about being rushed and thank you very much for the customer services. The keyboard was amazing as well!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kaitlan",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T03:34:11.000Z",
          "Titre": "very good customer service",
          "Contenu": "I had a very good experience with Customer service. They were very unstanding and had very quick responses. I had ordered a keyboard when black Friday was coming up, however I forgot to apply a coupon. I emailed costumer service over the weekend and they responded very quickly on the following Monday. They were able to provide me with the option of store credit OR a partial refund of the amount that would have been discounted. I hap opted for the partial refund which they immediately processed. The keyboard came in expected time. I did notice that there was a missing keycap puller but that was expected since I had purchased an open box."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kendle B",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T01:00:55.000Z",
          "Titre": "Loving the feel of the keyboard",
          "Contenu": "Loving the feel of the keyboard! Shipping was fast enough, and quality seems high. It was missing the dongle but I bought the open box version and they have sent the dongle out, so no stress there! No complaints! Also quick and helpful customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam West",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:35:49.000Z",
          "Titre": "Great customer service and great value…",
          "Contenu": "Great customer service and great value keyboards!"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Myron Shykhov",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T11:43:59.000Z",
          "Titre": "Ssounds nice ,wireless communication works great",
          "Contenu": "Keyboard sounds nice, rgb works great and everything is easily customisable via the app or via the interfacing of the keyboard itself (fn+home/ent etc)Easy to disassemble and clean Both keys and switches can be customised if desiredWireless communication works great via bluetooth and other methods.The only disadvantage I have found for people with sensitive hearing is that the sound of the switches at full silence can be a bit annoying in some cases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ASTROMAGIC",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T19:11:03.000Z",
          "Titre": "Really kind people and a pleasure to buy from",
          "Contenu": "So I had originally purchased a keyboard from RK as a present for a friend but my friend didn't actually need it (he's a massive keyboard enthusiast who is trying to downsize his collection). I didn't know what to do with the hardware since I don't know many people who as into computers as we are. I opted to return the keyboard and Chance made the process really smooth. I will not forget this kind gesture and wish only good things upon Chance and the rest of RK Gaming. I'm not a youtube reviewer but perhaps I'll give the keyboard a fun review as well :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dean",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T00:46:01.000Z",
          "Titre": "Shipment was quick",
          "Contenu": "Shipment was quick. Box had a couple bumps and bruises, but product was in perfect condition. They send you an email asking if it was really you who ordered their product as a security measure."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Teodoro López",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T15:59:10.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. It is my first time ordering a mechanical keyboard and I'm really happy with it. Solidly built and beautiful product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Me",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T23:28:10.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "Amazing customer service. Had a few problems with my order and they were all solved within 24 hours of a simple email, very nice quality as well. Also more of a keyboard review but the software they have for the boards is very well thought out and they will be able to help you with it should any problems arrive quite competently."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Fangrang Chen",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T01:28:45.000Z",
          "Titre": "really nice",
          "Contenu": "The keyboard is comfortable with my hand and the blue switches sound is so good I love how it came with a key cap and switch puller and the extra switches. The rgb is single colour but it’s still really nice and the Bluetooth was easy to pair."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T07:59:39.000Z",
          "Titre": "G.O.A.T keyboard",
          "Contenu": "Man I can‘t express my feelings about this keyboard… It feels so good to have a high quality keyboard after using mainstream goofy keyboards like from Corsair. I’d recommend those keyboards to everyone, who needs one for gaming oder something else. It’s just a piece of art"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Axollity",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T15:58:50.000Z",
          "Titre": "Good store",
          "Contenu": "Great customer service that answered every single question of mine (asked about shipping related info).Definitely a credible place to buy from, especially that RK's are difficult to get. I got an rk96 rgb limited edition and everything works nicely."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linto Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T06:42:46.000Z",
          "Titre": "The keyboard is great",
          "Contenu": "The keyboard is great, feels and sounds fantastic. Shipping was incredibly quick. I had an issue with the order and customer service took care of it in just a couple days. If you buy from RK, you will get a quality product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NewUser",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T17:52:25.000Z",
          "Titre": "Customer service the best!",
          "Contenu": "I spent a long time looking before deciding on K96, and was thrown by inability to download software.  I emailed the form through customer service, which in other cases often goes into the ether, and it was late at night and I was kind of pulling my hair out.  Surprise! I heard back from Wingram that night!!  And he provided a link to the software.  I'm still learning about the keyboard, which is amazing.  And I'm so impressed with RK customer service that I'm sure any future problem will be resolved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josie",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T18:10:05.000Z",
          "Titre": "i love royal kludge",
          "Contenu": "This company is super friendly and helpful! The product shipped super quickly and arrived just as fast. i will definitely shop here in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maurice",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T16:54:45.000Z",
          "Titre": "What's not to like?",
          "Contenu": "Excellent product (RK920 keyboard) sold at a very fair price (and shipped rapidly) by a friendly, attentive company who were quick to help with questions I had. What else could one want?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glory",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T20:24:30.000Z",
          "Titre": "Customer service and great keyboard",
          "Contenu": "Customer service was very prompt when i emailed them to return the keyboard! The keyboard itself is amazing, but i just ended up ordering one that i didnt want which is why i wanted to return it, but they gave me several options and was very quick in their response. Def recommend!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gabriel Lee",
          "Nb_Reviews": 2,
          "Date": "2023-11-12T14:51:18.000Z",
          "Titre": "Very helpful",
          "Contenu": "Very helpful, no stock for the item I wanted but they helped me get an alternative which is great - and which I'm very pleased with."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "A buyer",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T18:26:49.000Z",
          "Titre": "An emotional rollercoaster",
          "Contenu": "I ordered the RK61 keyboard from this company. For personal reasons and misunderstanding on my part (I thought I ordered the RK84, nice), I sent their customer support team an email, a couple of hours later, requesting a cancellation and perhaps a refund of my order. Unfortunately (or rather fortunately) my package was already sent for shipping so I missed the time window to do so apparently. I, initially, regretted buying this keyboard, so I went on to continue emailing their support team about a potential refund. The company does not have a free refund policy and I was aware of that, so I ultimately decided to keep the keyboard. During this whole process, they kept replying to my emails every day with details on how to reject the package, how to return the package with an RMA, etc. Basically, they guided me through this (ultimately non-existent) refund process greatly, and I appreciate it a lot. I still mod this keyboard (as I expected to do), but it turns out it's a pretty solid board for its price, so I'm glad I got it (even if I don't like 60% keyboards that much). Lastly, they even offered me a direct partial refund or a gift card that both covered half of the shipping fees in USD. That was rather unexpected and very kind on behalf of them, they didn't have to refund me anything, let alone keep replying to my emails even when I told them I'm going to keep the keyboard. I can't really complain about their refund policy because well, it is their policy, so I don't hold any grudges. Overall, even though I was kind of disappointed that I couldn't cancel the order even a couple of hours after it's been placed, it really isn't something negative. That just means they're reliable. Their support team helped me through the process and I'm thankful for that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick Gialusis",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T09:39:29.000Z",
          "Titre": "The keyboard they got me was missing a…",
          "Contenu": "The keyboard they got me was missing a key and when I asked for a replacement key, they sent me an entire new keyboard. Amazing service 10/10"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Aryan Mani",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T01:05:38.000Z",
          "Titre": "Rk84 firmware fixed a problem with the backlight.",
          "Contenu": "Recently, the RK84 keyboard I bought from the official website had an issue with the backlight. I contacted support had got a response within one day! Through a bit of trial and error, we managed to fix the problem together by downloading a firmware. Overall this was a nice interaction with the company. Thanks Royal Kludge!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lou Lam",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T03:56:50.000Z",
          "Titre": "Keyboard malfunction + Fix",
          "Contenu": "Keyboard malfunctioned as all of the keys with a second function are currently using whatever function they would use if I pressed down the \"function\" key. For example, if I pressed \"Y\" it would take a screenshot instead of typing a \"Y.\" Also, I could not type any numbers as those have second functions as well.  However, I fixed this by just pressing \"function\" and long-pressing \"spacebar.\""
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TchNwb",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T19:01:23.000Z",
          "Titre": "Help with software.",
          "Contenu": "I could not figure out how to make the lighting customization work after exiting the RK Software. The RK rep was able to walk me through this via email. Note to users: to do this, select \"Light Effect Mode\" then \"Customize\"."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Mees",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T15:55:10.000Z",
          "Titre": "Helpful customer service and friendly…",
          "Contenu": "Helpful customer service and friendly people. Quick response so excellent service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Lores",
          "Nb_Reviews": 4,
          "Date": "2023-02-24T14:59:29.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience. I ordered a keyboard and had issues with it connecting to my computer. Both the BT and the USB wouldn't work, errors. Although it connected right away to my laptop. After many attempts to troubleshoot with the tech team, nothing worked. I really wanted a wireless keyboard and although it was working as a wired keyboard, that was my ultimate preference. The agent followed up with me several times throughout the process and at the end offered me a full refund for the device since it didn't meet my expectations. Great customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Huy",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T05:56:50.000Z",
          "Titre": "I had a bit of an issue at the…",
          "Contenu": "I had a bit of an issue at the beginning but   then I contacted their customer service and got the problem solved within hours. Would highly recommend,  I have the RK96 wireless and it is a beast. Battery life is amazing and all the keys are well made, make it feel very comfortable when typing or playing games."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stunt Panda",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T11:12:47.000Z",
          "Titre": "High Quality Keyboards, Great Prices",
          "Contenu": "High quality keyboards at a great price.The mechanical keyboard I bought, the RK61, is one of the best I've ever used. It's incredibly compact but still has a lot of the keys of a larger keyboard by using mode key combo toggles like FN-Enter to enable the arrow keys and FN-Left CTRL to enable using function keys.And the support is amazing! They tried really hard to help me out and even doubled checked to make sure everything is still okay. Great work Iris!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Gil",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T23:30:09.000Z",
          "Titre": "BUY NOW!",
          "Contenu": "I love RK Gaming! They were extremely communicative, affordable, and understanding with their product!I purchased the RK x LTC PBT Double Shot 108 Black Pudding Keycaps Set and I am in LOVE! So many people have commented on my set and I can't stop talking about it. Gonna do a content post on it soon, stay tuned and thank you RK Royal Kludge!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Arif Safwan",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T07:47:52.000Z",
          "Titre": "RK96 forest blue",
          "Contenu": "I bought the RK96 forest blue, The keyboard was delivered faster than the estimated time which is a pleasant surprise. the keyboard arrived safely with all the items in it. the pre-lubed keys sounds really good. although the color is a little bit dull compared to the pictures and i thought it would have the option to make it a floating keys keyboard like the RK84 i previously bought so i was a little bit dissapointed."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Max",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T18:59:31.000Z",
          "Titre": "Customer service was very responsive",
          "Contenu": "Customer service was very responsive and generous in their help.Had an issue with the battery performance of my keyboard. I reached out to see if I could get a replacement battery but, through an assessment,  ended up getting a whole new keyboard in a very quick turn around. They really want to make sure you have a good experience with them. Definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Cliente",
          "Nb_Reviews": 2,
          "Date": "2023-06-30T20:44:31.000Z",
          "Titre": "11/10",
          "Contenu": "Product 10/10:I love every single thing of this keyboard. Even with double the budget I would have chosen this keyboard thanks to all the features it has.Customer service 11/10:A day after I placed my order the customer service team contacted me because they were currently out of stock, offering me a full refund, a change of product or just to wait. I decided to wait, and the keyboard arrived in less than a week in perfect conditions."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-03-10T13:23:12.000Z",
          "Titre": "Warranty worked as advertised!",
          "Contenu": "I had an RK68 for almost a year and one of the LEDs started to malfunction.  This could happen to literally any keyboard from any manufacturer.  The difference was when I reported it to support and they walked me through steps and then agreed to fulfil the 2-year warranty.  Very quickly my problem was solved at their expense.  It's nice to see brands truly investing in their reputations these days."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Yuni",
          "Nb_Reviews": 2,
          "Date": "2023-06-01T13:05:09.000Z",
          "Titre": "Amazing keyboards!!",
          "Contenu": "I originally changed my mind about getting the RK61 keyboard but when it actually arrived (2 days shipping - amazing!) I really loved it. Their prices are so affordable and the quality of their keyboards really are incredible for the price and 100% worth it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pranav Kuna",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T03:46:54.000Z",
          "Titre": "Customer Service",
          "Contenu": "They made a mistake in shipping. Contacted customer service and they fixed it very quickly."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "wanessa",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T12:07:44.000Z",
          "Titre": "Customer service was speedy with…",
          "Contenu": "Customer service was speedy with replies and i managed to receive my order within 3 days! Love the feel and sound of the keyboard, it works wonderfully and highly recommend everyone get their gaming keyboards from RK! Thank you for the great service and product!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "jacob",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T18:18:53.000Z",
          "Titre": "RK84. Awesome Customer Service, Guy was so nice",
          "Contenu": "Ordered the RK84 limited macchiato, immediately Chance from customer service reached out to me, kindly let me know they were out of stock and apologized for the inconvenience. I said no problem and asked if he knew when they might be, he got back to me and within like 3 days he sent another message letting me know it had been shipped. There was an issue with delivery from DHL and Chance gave me advice on how I could request a redelivery, a day later all was cleared up. Very nice experience I really appreciate Chance’s help and quick responses. A+ Customer service... thanks dude ✌️"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Kid Sponjay",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T11:06:29.000Z",
          "Titre": "One of the best customer service out there",
          "Contenu": "I had a something missing with my kb, and quickly contacted the seller and sent an email to the rk customer service, and rk cs quickly responded to my inquiries and so did my seller, they were really eager to solve my problem, problem was I was expecting a specific function on my kb but it turned out I ordered a different variant. it was my fault but it all worked out in the end. im just super satisfied by the way RK CS was so willing to help me out. they have an awesome customer service team, after sales is a plus for me when purchasing any item. and RK has the best cs out there! u guys rock! till our next transaction"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "SwerveShot",
          "Nb_Reviews": 2,
          "Date": "2023-03-20T12:35:44.000Z",
          "Titre": "Fast response time for service request",
          "Contenu": "I recently had an issue with my ROYAL KLUDGE keyboard and reached out to their customer support team for assistance. To my delight, I received a fast response from them, and although I was able to solve the issue myself before they got back to me, their customer support representative was courteous and knowledgeable.One thing where there's room for improvement is that a few days earlier I submitted a similar request via the rkgamingstore.com website. But no-one acted on that request as far as I could tell. So simply send an email to support[at]rkgaming.com. This seems to work best.Update: the minute I sent out this review someone also responded to my request via the website. This changes my score from 4 to 5 guys. 👌"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "IH",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T07:58:17.000Z",
          "Titre": "I was looking for a nice keyboard that…",
          "Contenu": "I was looking for a nice keyboard that wouldn't break the bank. I ended up ordering the RK61. Hours after I ordered it, I got an email saying that it was on the way, and it ended up on my doorstep a little over a day later! The keyboard itself is very nice and easy to use with the manual given. I would definitely recommend Royal Kludge to a friend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Miles",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T10:36:29.000Z",
          "Titre": "Customer Service Saved the Day",
          "Contenu": "I am typing this on my brand new RK96 (a wonderful keyboard) but the real star of the show is the customer service team - there was mishap in shipping and I never received the first board, without missing a beat they figured out the problem and got me a replacement. It was fast. It was easy. Thanks so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Labonte",
          "Nb_Reviews": 1,
          "Date": "2022-10-29T02:41:26.000Z",
          "Titre": "I’ve never heard of Royal Kludge before…",
          "Contenu": "I’ve never heard of Royal Kludge before watching a YouTube video using one of their keyboards and IMO they are well built and affordable. They did not have the Khalil Switches I ordered but worked quickly to refund me that part of the order. I’m not upset about that, as I can always order those another time. I did get the white pudding keycaps and they look really nice with the bright led backlit PCB. I ordered the full size keyboard and so far I’m loving it. Can’t wait to put my own customization on it!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "amfe day",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T10:09:22.000Z",
          "Titre": "Great product and great service",
          "Contenu": "The keyboard itself was great! customer service is really fast. I did not even realise I did not complete my address properly and they contacted me right away."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richie Han",
          "Nb_Reviews": 4,
          "Date": "2023-02-16T21:26:37.000Z",
          "Titre": "Great customer service",
          "Contenu": "I bought the RK68 and it worked perfectly with my Macbook via bluetooth but the wired connection wouldn't work with my Windows desktop. I reached out to customer service and they had me run some troubleshooting before sending a new one out free of charge. The new one works perfectly with both OS's and the shipping was so quick. I would highly recommend Royal Kludge."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ildar Salakhiev",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T09:21:17.000Z",
          "Titre": "Nice customer support",
          "Contenu": "I was pleased with product quality as well as quality of customer support"
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Aisha M",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T07:35:23.000Z",
          "Titre": "I saw good reviews of their products in…",
          "Contenu": "I saw good reviews of their products in YouTube and I decided to bought one. I ordered directly from their website because I wanted to have the legit product. (I'm from Saudi Arabia by the way.) But something happened with my first order, and I felt sad and hopeless. BUT, thankfully their customer service was superb, especially to John who helped me a lot and monitored my package until it was delivered. This is my first time to experience an excellent customer service online. Definitely a thumbs up and I would highly recommend them to my friends.👌🏻😁"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Dmitrii Palienko",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T07:30:26.000Z",
          "Titre": "Great product, Great Customer Service",
          "Contenu": "I recently bought a RK61 keyboard which was great for use and everything, but unfortunately I ran into an issue with it. However, the customer service team was incredibly attentive and helpful! They quickly resolved the problem and replaced it with a new one, and I am now very happy with my purchase. All in all, great customer service, and great product after all!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Ellie",
          "Nb_Reviews": 2,
          "Date": "2023-01-28T04:49:29.000Z",
          "Titre": "Friendly support, great product",
          "Contenu": "Great support responses when I was initially confused about advanced functionality of the product. (Was confused about some of the FN lock modes of their keyboard.) Love the keyboard itself too, sturdy, really good quality."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "P.",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T18:58:21.000Z",
          "Titre": "Perfect customer service",
          "Contenu": "I have bought a keyboard which was out of stock in Canada-only, however, their amazing support person (Winglam) solved my issue by providing an alternative keyboard for a similar price - and it fit me even better. I received the item in less than 2 days.Also, after using a keyboard for a bit I realized that Red switches are too sensitive for my use cases. Instead of starting a return and re-shipping procedure, their support offered me an additional discount for new switches - which was the best solution for my situation and I accepted it.So now I am just enjoying the amazing RK84 keyboard with switches which fit me perfectly. Thank you for providing us with quality keyboards and perfect customer service!"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Dam Rad",
          "Nb_Reviews": 2,
          "Date": "2023-08-03T12:04:53.000Z",
          "Titre": "Great support",
          "Contenu": "Great support, I've contact them regarding the broken firmware for their product, they sent me a new FW which is working flawlessly. Great customer service."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Daisy",
          "Nb_Reviews": 2,
          "Date": "2022-11-11T11:21:25.000Z",
          "Titre": "I ordered a keyboard but in the wrong…",
          "Contenu": "I ordered a keyboard but in the wrong colour. I emailed the company asking for a returns label and explained that I would be sending it back and then re ordering the correct colour. A complete error on my part however a very kind member of staff, Winglam, told me to keep the original keyboard and give it to a friend and that he would send out the correct keyboard at no cost at all. I received the correct keyboard on the 8/11/22 and will be gifting the original to a friend for Christmas. Very kind and in true Christmas spirit."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Rafael",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T02:42:13.000Z",
          "Titre": "Bomb as keyboard",
          "Contenu": "Great packaging, great acessories, and great customer service. Would recommend the rk68 to anyone wanting to start their keyboard hobby. Thanks to rkgaming customer service for responding to my emails. You can't go wrong with picking any keyboard made by rkgaming."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Wout",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T13:04:42.000Z",
          "Titre": "they send a new one",
          "Contenu": "i didn't recieve the keyboard at first but they contacted me and they send an other one, so i'm very happy with rk and the keyboard is also very good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon Priest",
          "Nb_Reviews": 3,
          "Date": "2023-04-14T01:42:28.000Z",
          "Titre": "Royal Kludge rocks!",
          "Contenu": "I bought a RK96 second hand and it didn't come with the wrist rest. I emailed support and got a prompt response. Unfortunately they don't offer the exact replacement rest, but they offered for me to purchase one of the rest they do offer for a 20% discount. Once the order was placed I received the unit in either one or two days. Either way it was extremely quick. Getting customer service like this is rare now a days and should be applauded when do so properly. Thank you Royal Kludge!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Rachel Park",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T11:23:25.000Z",
          "Titre": "Fast shipping, high quality!",
          "Contenu": "The keyboard shipped in a matter of weeks to me (in Aus) and the quality of the keyboard is simply divine! Great for a budget keyboard, I highly recommend this brand."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "kai murphy",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T21:00:34.000Z",
          "Titre": "Amazing product, great customer service",
          "Contenu": "While shipping my item there was some issues however they were promptly resolved. The product is incredible quality compared to others for a similar price that I have used.Customer support was great, any problems or questions I had were answered well and in detail."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Random Dude",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T18:56:54.000Z",
          "Titre": "Sublime customer service",
          "Contenu": "Don't own an RK KB, just pinged them with an email question and not only was the response very prompt, thoroughly and politely answering my question, but I received a follow up a few days later just to make sure all my needs my met. Not a form letter, but an actual human taking the time to talk to me personally. Very rare these days to receive this level of customer service, especially for someone who technically isn't even a customer."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "erika swap",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T11:45:29.000Z",
          "Titre": "The item Is beautiful but i had a…",
          "Contenu": "The item Is beautiful but i had a problem, the support was so fast in replies and so efficent, i solved the problem alone following their suggestions! Great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Weston Wing-Girot",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T17:15:18.000Z",
          "Titre": "Great company, great service!",
          "Contenu": "Great company. My RK84 Pro stopped working after a firmware update. After a few emails, they sent me a brand new one and it is working great.The representative was professional and quick to respond and the keyboard arrived in two days!I will definitely continue to purchase products from RK."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Claudio",
          "Nb_Reviews": 4,
          "Date": "2022-11-21T11:07:07.000Z",
          "Titre": "Awesome customer service problem solving",
          "Contenu": "Bought a RK87 on the official website, shipped to Italy really really fast, faster than the Italian delivery status.Had a problem with a key that was stucked. In 3 days I've received information on how to un-stuck the key but had no luck.RK ROYAL KLUDGE arranged the shipment of a new keyboard and let me kept the broken one as a backup.I will update the review once received the shipment.--UPDATE--New keyboard arrived. Everything seams to work just fine! Really happy with the customer care!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Javon Silva",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T14:41:26.000Z",
          "Titre": "Good Products from Red Dragon",
          "Contenu": "The mouse and keyboard I got were exactly like the picture! I do wish there was more RGB modes though, unless I just havent had enough time to figure out the different modes yet. But overall, Great Products!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ivana",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T22:42:51.000Z",
          "Titre": "RK61",
          "Contenu": "RK61 Amazing order, was shipped extremely quick and product was as described.The keyboard works well and for its price is an absolute steal, would definitely recommend you buy."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gman",
          "Nb_Reviews": 2,
          "Date": "2023-05-03T20:42:03.000Z",
          "Titre": "Very happy customer! Thanks",
          "Contenu": "After intially ordering the incorrect item I contacted support and was swiftly responded to by a helpful operator (Chance).We resolved my initial query swifly and a substitue item was sent out same day.Very pleasant experience with only positive comments to say. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "MT",
          "Pseudo": "Jan",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T15:18:56.000Z",
          "Titre": "Great support :D",
          "Contenu": "Great support :DI had an issue with a keyboard I had ordered from the site but the support staff were very helpful and helped me find a solution and even contacted me after a while to make sure everything was working as it should :)"
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Dmitriy",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T11:35:52.000Z",
          "Titre": "The best service and products",
          "Contenu": "I bought a keyboard for a friend from this shop. However, there was a problem with a lost part of the address, due to which the package was returned back to the seller. After contacting the seller via email, it was quickly and very well resolved. Delivered to the Czech Republic after two days. I can highly recommend it, I was very satisfied with the quality of the product and the service. Thank you for your work!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Maronbeere",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T09:00:47.000Z",
          "Titre": "Fast shipping and nice customer service",
          "Contenu": "The customer service is very nice and actually seems to care about you. They don't just copy and paste cookie cutter replies. I asked about the polling rate of one of their products, and they replied within less than 12 hours (on a weekday). They even use Amazon shipping in Germany, so my order was there in just 2 days. The only minor complaint I have is that I didn't get a message when my package was dispatched.Update June 2023: My keyboard had an issue with the RGB due to a firmware bug. I got a replacement keyboard for free and I was sent a stable build of the firmware. All I had to do was do some troubleshooting."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Mika Bouten",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T13:18:28.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "Amazing customer service. Winglam assisted me with my problems and solved everything swiftly. Literally one of the best customer service I have had."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 10,
          "Date": "2023-05-04T17:17:38.000Z",
          "Titre": "Trustworthy is the biggest part of my…",
          "Contenu": "Trustworthy is the biggest part of my order.I found what I was looking for, researched, ordered, item received when promised, dedicated  rkgamestore owners and employees.  Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emily Sellers",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T16:48:27.000Z",
          "Titre": "Helpful customer service",
          "Contenu": "Accidentally ordered the wrong switches and color on my keyboard (I know, but the website defaulted and I didn't catch it), so I worked with customer service to get it exchanged for the one I wanted. They were very helpful and I love my keyboard!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Websoket",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T23:21:55.000Z",
          "Titre": "Good customer support, overall great experience",
          "Contenu": "I misordered my rk84 with the wrong switches. I immediately reached out to customer support and they were very helpful and nice. The keyboard itself is very good and worth the money and it shipped pretty fast as well. very good experience"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "F W",
          "Nb_Reviews": 2,
          "Date": "2023-10-19T16:31:04.000Z",
          "Titre": "Excellent value for money",
          "Contenu": "Excellent value for money. I bought a RK68 for work and was really satisfied with it. Now I also bought a RK96 because also wanted to have a numpad. Great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawson Helms",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T12:58:31.000Z",
          "Titre": "Great product, even better customer support",
          "Contenu": "Their customer support was fantastic to deal with. Very proactive and very prompt to provide assistance. Their products are fantastic as well and hit way above their price point."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julian Montoya",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T13:27:58.000Z",
          "Titre": "RK84 has a been a great accessory to my computer",
          "Contenu": "I believe there are some simple mods that should be done to the keyboard, such as the tape mod which can reduce the echo of keys, but apart from that, I am very satisfied with the price and quality of the keyboard.Another highlight of my shopping experience with Royal Kludge is their responsive and professional customer service. They assisted me and resolved any issues I had. I would recommend this company and I encourage potential buyers to find promotions when shopping."
        },
        {
          "Note": 5,
          "Lieu": "BG",
          "Pseudo": "Desislav R. Lesov",
          "Nb_Reviews": 2,
          "Date": "2023-07-30T08:09:38.000Z",
          "Titre": "I’ve bought two keyboards from them",
          "Contenu": "I’ve bought two keyboards from them, both exceptional quality. And their customer support has been top notch as well!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Reyhan",
          "Nb_Reviews": 2,
          "Date": "2023-04-23T14:50:11.000Z",
          "Titre": "I recently purchased the RK96 and i am…",
          "Contenu": "I recently purchased the RK96 and i am in love with, the only issue i had with it was the keycaps on my brand new keyboard showed ware and usage which i didn’t like since i paid full price for a brand new keyboard. Long story short I got into contact with their customer support representative Chance and explained that my recent purchase had some cosmetic issues and within a day he replied and the process began, where i was sent a new keyboard to replace the one i had purchased.I have been a customer for a long time and i can say that this company goes above and beyond to make sure the customer is satisfied with their purchase. I bought the RK96 and i love it!"
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Margarita",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T11:00:23.000Z",
          "Titre": "Absolutely great customer service",
          "Contenu": "Absolutely great support team and customer service.The information provided all the way until you receive the order was fenomenal.I received the keybord ordered in great condition and really fast.Very pleased with the entire procedure."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Rogelio Lumogdang jun",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T03:36:39.000Z",
          "Titre": "Their products are great and the…",
          "Contenu": "Their products are great and the customer services are very satisfactory. Best keyboards and accessories that anyone can have. Thank you Royal Kludge"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Tyler Mckerlie",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T08:19:22.000Z",
          "Titre": "I had ordered a keyboard that was too…",
          "Contenu": "I had ordered a keyboard that was too small for my personal taste, and customer service was more than happy to help me exchange for one that suited my taste. The service was great, and extremely helpful and quick with the exchange process!"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "José",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T12:57:36.000Z",
          "Titre": "Great ROYAL KLUDGE RK84.",
          "Contenu": "Ordered a ROYAL KLUDGE RK84.It's brutality cool!Also the customer support team is really efficient team.Thanks."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Katrina",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T17:24:35.000Z",
          "Titre": "Very satisfied",
          "Contenu": "The customer service was great and sent me a replacement for my broken keyboard. They were very nice about it. Shipping comes SUPER FAST. I live in Canada and it only took the next day from the confirmation email to deliver my replacement. Thanks RK :)"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Lim Chi Ho",
          "Nb_Reviews": 1,
          "Date": "2022-12-31T15:56:17.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "A few months ago, I ordered a RK96 keyboard. The volume button broke down sadly after a few months of use. After a few emails with customer service, they send me a brand new keyboard arriving in just 3 days. Amazing customer service!"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Ulrich Volz",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T12:00:13.000Z",
          "Titre": "great service",
          "Contenu": "great service, very responsive and faulty product exchanged without any hassle"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kajen T",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T18:54:09.000Z",
          "Titre": "Had an initial issue with some damages…",
          "Contenu": "Had an initial issue with some damages to the box the product came and some scuffs on the keyboard but RK was quick to send a replacement. 10/10 experience, would recommend."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Menno van Eig",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T19:44:34.000Z",
          "Titre": "Good customer service.",
          "Contenu": "I accidentally ordered the wrong product (totally my fault) and i could send it back without any problems and they sent me the thing I initially wanted to order. Very happy with customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edrick",
          "Nb_Reviews": 1,
          "Date": "2022-12-29T06:25:54.000Z",
          "Titre": "Best budget keyboard ever",
          "Contenu": "Best budget keyboard ever. Got my brother a RK96 as his beginner Board to get into mechanical keyboard. And the best part is they also have great customer service."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Richard Obler",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T14:40:30.000Z",
          "Titre": "Great keyboard, great customer service",
          "Contenu": "The keyboard is great. Many cool features, good-looking and feels very nice.In addition, the customer service was very good. After an initial successless attempt to deliver another attempt was started in a non-bureaucratic way. Excellent service."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Duc Hiêu David",
          "Nb_Reviews": 3,
          "Date": "2023-03-24T09:17:17.000Z",
          "Titre": "Honest and efficient",
          "Contenu": "I purchased the RK96 but I received a wrong keyboard. After explaining my situation with the customer service, they quickly solved my problem by sending immediatly the right keyboard. What a great experience."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Penelope Marina",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T09:30:56.000Z",
          "Titre": "Amazing service and very efficient",
          "Contenu": "Amazing service and very efficient! They followed up with me several times as I was quite forgetful. Couldn’t ask for better"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "bobby",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T13:06:42.000Z",
          "Titre": "rkgaming.com are the most helpful",
          "Contenu": "rkgaming.com are the most helpful retailers out there i messed my order up and within 3 hours they emailed me back unfortunately my package was shipped early and they couldn’t intercept it in time however this did not stop them from trying to help in which they did my package was returned to there warehouse and the item i was originally ordering was shipped out to me and the balance was refunded"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T12:20:30.000Z",
          "Titre": "Good feeling and sound, and great customer service",
          "Contenu": "I bought this keyboard, and the feeling and sound of it was great. I had a little problem with the keyboard, but the customer service was great and a really good overall experience."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T10:44:25.000Z",
          "Titre": "Good keyboards",
          "Contenu": "Awesome customer service and the keyboard itself has a very good feeling of your looking for the best budget rgb keyboards Royal Kludge would be the best choice"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T08:31:42.000Z",
          "Titre": "Fantastic services",
          "Contenu": "First keyboard was broken but the company sends a new one immediately that is now working fine. Top-notch customer services!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy Hawk",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T22:34:48.000Z",
          "Titre": "Best customer service and products! Awesome company and employees!!",
          "Contenu": "Best. Customer service. Ever.I really wanted a nice, new 75% keyboard and RK had the nicest one with all the features I wanted.I ordered one, the M key didn't work and we went through the troubleshooting steps and came to the conclusion something was amiss. They sent out a whole new keyboard and I didn't have to return the broken one.They were so helpful and didn't give me any hassle!I found my go to place for keyboards for life.Thanks to all who helped me through my issue!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "xuan vu",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T07:50:09.000Z",
          "Titre": "Great customer service",
          "Contenu": "Their customer service is really good! Winglam responded to me super quickly and was super helpful :)"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "SC",
          "Nb_Reviews": 2,
          "Date": "2022-11-28T10:09:39.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "I had an issue with my keyboard. After I contacted them, a new keyboard was sent to me promptly. The customer service was superb. I would definitely buy from RK again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Walbecq",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T20:11:44.000Z",
          "Titre": "Phenomenal Customer Support",
          "Contenu": "Iris was amazing to work with. They made the process of fixing my keyboard very easy. So easy that I bought another keyboard since. The product is top quality and the customer service is something to look up to. Thank you so much for the qucik help."
        }
      ]
    }
  ]
}