{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "securedatarecovery.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Unhappy Customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T22:37:04.000Z",
          "Titre": "Lost media forever",
          "Contenu": "Very high pressure sell, assuring recovery.  Misstated fees and handling costs which created surprises.  Once media was received, I received a note stating they would be able to recovery the data.  I later learned this wasn't true, but they could attempt additional recovery methods for an additional fee.  Our media was lost when shipping back to us.  SecureDataRecovery's response was 'they submitted a claim to the shipping company.'  We not only wasted our money, but now do not have the media to attempt to get it fixed anywhere else.  It contained all childhood pictures of our kids from birth to present.  Gone forever!  Do not use!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "kbb bkk",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T10:24:44.000Z",
          "Titre": "Somethings wonky here",
          "Contenu": "Somethings wonky here.  I sent in my SDD after consulting with one of their agents, Val.A few days later he emailed me and said that it was \"damaged beyond repair\" and that I'd need to pay them more money to have it shipped back to me.I responded by asking if I was going to receive a diagnostic report or was I just supposed to take them at their word and send them more money?I paid to have it returned, and he never responded to my question about the report. Just thanked me for doing business with them.I don't recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CBD for sleep",
          "Nb_Reviews": 4,
          "Date": "2022-06-03T21:41:03.000Z",
          "Titre": "They don’t answer emails… I requested…",
          "Contenu": "They don’t answer emails… I requested back the drive that they couldn’t recover but they just ignored it. I repeatedly send emails and then I called  to notify them that they’re ignoring my requests and they heard me but still choose to ignore and never returned my drive."
        },
        {
          "Note": 1,
          "Lieu": "EC",
          "Pseudo": "Burcaen",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T22:57:16.000Z",
          "Titre": "Steer clear from this scam",
          "Contenu": "After reading the few but clear one star reviews I got concerned, as soon as I asked for how their \"no data no payment\" guarantee works, or how and when I would get my device back Elliot´s response and attitude changed letting me know they will not provide any assurance, even to the point of stating he could not send me the standard terms I would have to commit once their free diagnostics finished! I´ve done my research and found they in fact will not respond nor quote in a transparent manner."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Colby Shelton",
          "Nb_Reviews": 1,
          "Date": "2022-04-15T15:26:57.000Z",
          "Titre": "These guys were not honest with me",
          "Contenu": "These guys were not honest with me. Sent in a hard drive to be recovered and they said they could fix it for $1400 when all that was wrong was the enclosure of the drive. I later on found out that all I had to do was remove it from the enclosure and plug in the drive and my files would show up. I’m not an expert with this but a friend explained this to me later on and showed me after I received the drive back. Felt like I was scammed and was mistreated. Wish companies would be honest with this kind of service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Medal",
          "Nb_Reviews": 2,
          "Date": "2023-04-20T18:00:47.000Z",
          "Titre": "SHIPPER BEWARE",
          "Contenu": "SHIPPER BEWARE. READ THIS if you are mailing/shipping your hard drive to them. There is nothing SECURE here. I hope to save anyone here who made the same mistake I did. DO NOT SEND YOUR HARDDRIVE TO THEM if you plan on relying on their shipping, which is basically relying on the awful company that FED EX is (rampant theft and lost packages with no liability). I made the huge mistake of accepting SECURE DATA RECOVERY‘s offer for overnight shipping, which they claimed to have ‘insured.‘ For anyone reading this, PLEASE, if you value your hard drive and priceless data, ALWAYS, take out THIRD PARTY INSURANCE in order to save your data if anything happens to your hard drive. If your hard drive is lost (or STOLEN, like mine was) then third party insurance ‘might‘ lessen the blow financially. The most important thing to know is that the insurance they use through Fed Ex, means ABSOLUTELY NOTHING, since Fed Ex only compensates up to 100 dollars for any lost or stolen package, with or without insurance. To make a long story short, they overnighted my hard drive ( from Fort Lauderdale, Florida) via Fed Ex with insurance. Their main office is in Ohio. My package arrived in an empty and open box to the Fed Ex in Ohio. The package had made it to their main Fed Ex Hub in Memphis Tennessee location, so apparently either someone working at Fed Ex stole my hard drive from the Memphis location, or they stole it at the Ohio facility. In the end these companies could care less since they are covered legally in the fine print.Overall, the response from Secure Data Recovery was pretty deadpanned and 'procedural' with minimal words or feedback. No real apologies. All they could do was file a claim with Fed Ex for $100.00 compensation and they tacked on $60 dollars for their ‘estimate’ of what my hard drive cost. My wish for them is that they would have a disclaimer on their website regarding their shipping options. Yes, it‘s obvious that anyone runs a risk sending their package anywhere, but why would you work a company that has been experiencing more and more cases of theft. And why would you not WARN your potential customers of this happening? Overall, if I could rewind, I would never ever ever ship my hard drive anywhere. Lesson learned. I would work with someone local even if more expensive. DO NOT take a chance and rely on what shipping companies have become these days."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Carol C",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T18:14:15.000Z",
          "Titre": "Terrible experience",
          "Contenu": "Terrible experience.  Poor customer service. Strung along with empty promises.  Initially dropped their USD price by 50% with promises of 98% recovery. I was wary of the price drop but decided to go ahead.  Service update requests were ignored. Five months later, nothing had happened & when I wanted my drive back, I was told that if I waited 4 more days it would be complete.  Two hours later received an email indicating \"the drive had been deemed unrecoverable\".  Ridiculous!"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Nicolas Plée",
          "Nb_Reviews": 8,
          "Date": "2021-12-31T20:44:25.000Z",
          "Titre": "508 usd spent for a useless officerecovery software",
          "Contenu": "I bought their office file recovery software for 508 usd that happened to be a great scam. It hasn't worked properly on one single file when I was finally able to recover the files with another software. I asked for a refund as they claim to have a satisfaction customer policy on their website but I was answered that they don't refund sales...So I actually spent 508 usd for nothing... just get away from this company... if they do this for a software, I can't imagine their ethic with their data recovery lab..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marlene Suzuki",
          "Nb_Reviews": 54,
          "Date": "2021-09-19T16:02:57.000Z",
          "Titre": "\"Supposedly great\" but can't get data off a Time Capsule",
          "Contenu": "My husband sent in my Time Capsule that crashed weeks ago. Now they are telling him they might not be able to recover the data. Let me guess, they will hold my Time Capsule hostage until they get a huge payment. May have to get the Attorney General involved.Note to the company: When you read this, don't bother responding with your excuses, reasoning, etc. because I'm not the one who wants to hear it. Just send me my !@#$ing drive back. Thank you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "My",
          "Nb_Reviews": 2,
          "Date": "2021-04-21T17:53:29.000Z",
          "Titre": "We paid over 1k for our data and never…",
          "Contenu": "We paid over 1k for our data and never received. 9/1/2020 is when I placed my order. It's 4/21/21. I want a refund of the $1140I paid.  I have sent numerous of emails and the representatives  were very nasty with me. We asked to be refunded but was ignored. I have all correspondence with the representatives. I will be filing a small claim against this company. I wouldn't recommend them. My service number CDS-235330"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J. Smith",
          "Nb_Reviews": 1,
          "Date": "2020-10-27T18:26:04.000Z",
          "Titre": "Secure Data Recovery has been a disaster.",
          "Contenu": "Secure Data Recovery has had my computer for over a month and has been completely unresponsive.  They damaged my computer screen and have not returned multiple calls and emails regarding my initial request.  I read all of the great reviews on the company and went to them because I needed help.  My experience has been a disaster and has me questioning the legitimacy of the company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JG",
          "Nb_Reviews": 1,
          "Date": "2021-10-23T17:48:04.000Z",
          "Titre": "Unresponsive and terrible Customer…",
          "Contenu": "Unresponsive and terrible Customer service. It took weeks on average for my calls and emails to be answered. Staff would transfer me around, tell me messages were being delivered, promise call backs, and nothing would happen. I first send my hard drive in, they told me the job was complete but thousands of files didn't work and they never told me. I had to mail my hard drive in a 2nd time for them to tell me they can't do anything and they refused a refund. It took weeks of asking to finally get my hard drive returned to me and a refund issued. Working with Secure Data Recovery was a terrible experience and no one should have to go through that."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "pashley1411",
          "Nb_Reviews": 1,
          "Date": "2019-04-17T16:08:29.000Z",
          "Titre": "Solid state hard drive wouldn't load…",
          "Contenu": "Solid state hard drive wouldn't load up, \"I/o error\".   Brought it down to this company and gave to them for their shipment.   Turns out the drop off location is simply a secretary at a multi-use space.    There was no physical damage to the hard drive.   Response the next day (good) was severe external damage to the hard drive, $4200+ recovery.   So they trashed the hard drive while in their possession, and want to charge for recovery on the damaged drive.   What a bunch of frauds."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 2,
          "Date": "2022-04-25T16:25:05.000Z",
          "Titre": "I would not trust Secure Data Recovery",
          "Contenu": "I would not trust Secure Data Recovery.  I had them do diagnostics on a external drive.  They came back with their findings and a quote to do the work.  The amount they quoted was too expensive for me so I asked them to return my hard drive, which they did.  I then sent my hard drive to another agency to get another opinion.  I was shocked when the second data recovery company informed me that the ROM chip on my printed circuit board was missing.  I then called Secured Data back to ask them why my ROM chip was missing and they couldn't tell me.  I told them that the hard drive was to be returned to me in the same condition it was sent to them.  They had no explanation as to where my ROM chip was.  It leads me to believe that Secure Data is deceitful and not an honest company to do business with."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason Vesser",
          "Nb_Reviews": 1,
          "Date": "2021-03-25T02:07:08.000Z",
          "Titre": "Expect data recovery for a thousands not hundreds",
          "Contenu": "Expect data recovery for a thousand and a half to three thousand dollars. That is a basic recovery no fire or water damage. Just a bad chip board.  The chip board cost is $75. I think it is wrong they ransom your data."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony Bigham",
          "Nb_Reviews": 1,
          "Date": "2021-06-04T20:44:06.000Z",
          "Titre": "IF YOU DON'T WANT TO LOSS MONEY, DON'T USE THEM",
          "Contenu": "They will lie to you to make a sale and then try to hide behind a NO REFUND policy. I sent in my hard drive to see if any videos could be saved for my YouTube channel. I pay 2500 for the recovery, initial was 3300. I received the hard drive and when I check their \"GOOD LIST\" of recovered data with my videos. Half of them are folders with word doc no videos or even damaged videos to be used. I start the charge back process and  they tell my bank. I'm trying to commit fraud. Out of the 78 video folders only 40 work and had videos on their \"GOOD LIST\". I will post my experience on every forum or review board possible to out them for their shady practices. DO NOT USE THEM you have been warned!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason Moschella",
          "Nb_Reviews": 1,
          "Date": "2018-12-28T01:02:21.000Z",
          "Titre": "Looked into data recovery services for…",
          "Contenu": "Looked into data recovery services for my personal 8TB hard drive with mostly movies (recently ripped and disposed of DVDs). Hard drive was part of a WD My Book, would not connect to computer via USB 3.0. Computer would connect and disconnect every 5 seconds in an infinite loop. Secure Data Recovery proposed $1500 for data recovery, but when I declined their services, my \"Data Recovery Specialist\" wanted to know what I was willing to spend to see if there an \"option with a longer recovery timeline\" that would better meet my needs. So, I bought a $40 USB3.0 to SATA hard drive dock and was able to access and transfer my data. I would recommend fully evaluating all other options before over paying for this service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 3,
          "Date": "2021-03-30T16:14:13.000Z",
          "Titre": "Quoted Price Well Above Verbally Expected Price",
          "Contenu": "I initially had a good experience with this company. The rep (Anthony) was responsive and talked me through the process. I was told to expect about $500-600 for the problem I was having based on my hardware. The shipping and diagnostic was free so why not? I sent my computer, took over a week to hear back, and the quote was over $2900. About 6 times more than I was told to expect. Company wouldn't budge on the price, which is fine, but they charged me $30 to get my computer back. There was a lot of talk about free shipping and free diagnostics, but no talk about paying for return shipping if you decline their quote which is 6x more than expected. If this company was serious about value and their customers, they would have covered the return fee and not tried to lure me in with promises of a fair price. I hope your experience is better."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tyler Ashburn",
          "Nb_Reviews": 1,
          "Date": "2019-01-22T18:23:37.000Z",
          "Titre": "They lost it....",
          "Contenu": "After and getting an overview of their services and process for a laptop I needed the data recovered from, I sent my mechanical and solid state drives for them to inspect. They informed me there was no data on the mechanical drive and they would need to inspect the ssd. At this point they asked me to send the ssd to them. Per their original instruction I had already sent both together. They had no record of receiving it or having it. They claim to have a video of ‘unboxing’ my drives that shows the ssd wasn’t included, but refuse to share the video. My assumption is the ssd got discarded with the packaging, as it was wrapped in foam but still fairly small. They’ve offered no remedy, or even apology. I now have no option to try to recover that data with them or anyone else.I can not recommend this company by any means. I strongly warn against sending your drive(s) away to them. Huge thumbs down."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Arthur Lattimore",
          "Nb_Reviews": 1,
          "Date": "2018-07-20T13:09:14.000Z",
          "Titre": "Totally overpriced.",
          "Contenu": "Totally overpriced.. wanted to surprise my wife with data from her old hard drive, but the experience with Secure Data was terrible.  Initially they wanted to charge me $945 dollars to do the recovery, and when I said it was too much they discounted it to $500 dollars to recover 66 GB of data. I was still not pleased with this pricing and knew that I could probably get it alot cheaper locally I decided if I did a payment plan it was ok since I was dealing with so many things going on at home. So I agreed to do the recover,  and when it was ready they also make you purchase a hard drive from them.  Their options are 1TB 2TB and 3TB.  I only have 66GB of data why would I need a 1TB drive.  I would not recommend using these guys, look elsewhere, they are trying to get over.  I have gotten quotes since then and I have quotes of 200-300 dollars roughly.  Be smart and look around before you try these guys because they will take advantage of you"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 2,
          "Date": "2021-01-04T03:49:03.000Z",
          "Titre": "Be warned: not great!",
          "Contenu": "This company might do OK work but they are terrible humans to work with. After working with another data company to retrieve my data that didn't go well, I went to Secure Data to hopefully retrieve the data, which they were able to (partially) do, which is why I can give them 1 star. However in the process, they tried to slander the other company I worked with, and sent them legal documents for signature in which I had the legal contract with them, that they didn't uphold to. How unethical is that?!? Yikes! Then on top of that they said they recovered all my data in which they only got about 1/4th of it, and told me I needed to prove what was missing (sorry I failed to take a photo of the drive capacity before it was accidentally damaged, I think that's a very unreasonable expectation). And when I did find holes in the recovery they said \"that isn't enough holes\" to warrant further investigation. This could have been resolved with simple communication, however during all this they wouldn't answer their phones (cowards?) so it could only be discussed over email. What kind of company does that? You might get OK work, but you will get truly horrible customer service. Just watch out before you go to them before data recovery!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dan Rufolo",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T19:22:39.000Z",
          "Titre": "My experience with Secure Data Recovery…",
          "Contenu": "My experience with Secure Data Recovery has been awful. I highly recommend looking for a different company to recover your data.TLDR: Their actual price is way more expensive than the service they provide. They never returned the drive I sent in for repair. It's under warranty but without the drive I can't get it replaced.I had a hard drive failure in August of 2021. I reached out to this company for a quote. Although they were hesitant to give me a range they told me the services I was asking for generally was between 600 - 1k. A bit pricey but I moved ahead with it as my drive was under warranty and if I wanted it replaced I needed to use a place that was certified by the drive company. When I sent in the drive the quote came back north of 2k. If I had known that was a possibility I would have shopped around to check out other places. After calling to complain about this multiple times, and being shuffled around from my original contact, they brought the price down to 1k. Which although expensive I was thankful for and was able to commit to. They recovered a fair amount of my files but not all. 500 gb out of 2 tb. They sent me a new drive, but never returned the old drive so I could send it in under the warranty. I followed up about 4-5 times via phone after not hearing back over 3 emails. Finally they said they would send the drive back, and when they did sent it to the wrong address. Supposedly fed ex's fault. After following up again and being guaranteed it would be rectified it's now February of 2022 and I have yet to get the drive back. At this point I'm not even sure I'll still be under warranty if they ever do get the drive back. DO NOT USE THEM!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bob Brooks",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T19:24:28.000Z",
          "Titre": "Disappointing Experience",
          "Contenu": "The files on my hard drive disappeared and I took my desktop to BKB Tech in San Jose who recommended that I send my hard drive to Secure Data in Southern California.  I contacted them and chose the option that would recover up to 1.5 terabytes and take about 14 days.  The cost was $1,661.On July 20th, they received my hard drive. In the next month or so, left a number of messages for Eric Dvorin, my Secure Data rep, but got no response until I mentioned the calls to the tech at BKB Tech.  Eric finally called and said they were working on my hard drive. On September 14, I got an email saying the recovery was complete.  After picking up my PC at BKB Tech , I found out that most of the files came back in RAW format without titles.  It took me a while to go through and rename them.  When I finished, I found that none of the tax or business files I desperately needed were there.  Many of the photos were corrupted.  I think I picked the wrong company to recover my data.  In addition to only getting a fraction of my files, I was extremely disappointed with the extra five weeks they took to return my files and the lack of communication from Secure Data.  On September 16, two days after the recovery was “complete”, I got the following email message from Eric: “Also, if I were to send you over a link to our Secure Data Recovery review page would you mind posting about my customer service? We have a little contest in the office and if I finish in the top 3 for the month the company will treat my kids, wife and I to dinner. Please let me know and I will send you the link.”  As you might imagine, I didn’t ask him for the link. Based on my very disappointing experience, I would not recommend this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barbara House",
          "Nb_Reviews": 1,
          "Date": "2021-12-15T16:03:34.000Z",
          "Titre": "Be Warned: Horrible Experience and Nothing Recovered",
          "Contenu": "In November I experienced a catastrophic hard drive failure, and spoke to Jonathan Nguyen at Secure Data Recovery Services.I sent in my hard drive for the diagnostics, paying the $295.00 for expedited analysis. I was told that there was physical damage, but that the data looked to be recoverable.After agreeing to expedited service (2-5 business days), and pre-authorizing the payment, everything started to go wrong. Getting information was painful, I had to constantly chase down the status of what was happening, and I kept being told the engineers were working on my drive.I didn't even receive standard turn around at 5-9 business days. They received my hard drive on Nov 8th, 2021.  I did not receive the \"recovered\" files back until Thursday Dec 2nd, 2021. 26 days total until I received back a new drive with the supposedly \"recovered files\".After finally receiving this drive nothing on it was accessible.  Every file I tried to open was corrupted, even the ones that were supposedly marked good.  Most of the files had garbage characters written in there that said \"Data Recover Labs ?????????\" written over and over again. 99% of the files were stripped from their file structure, renamed with numbers, and stuck in a folder by \"file type\". Most of my file types, like Adobe Illustrator and Adobe InDesign were gone. The Adobe Photoshop files were all corrupt and wouldn't open, same with the jpeg files. It's one thing to tell me that the files can't be recovered - it's another to pretend they can, and send me back a drive where none of my files can be opened.  I was extremely clear up front that these were graphics files, that I was a graphic artist, and these were my critical files.  These were all on a mac formatted drive and were large Adobe Photoshop, Adobe InDesign and Adobe Illustrator files primarily, with jpg and png also.  I told the company that average files sizes were 50MB to 300mb and made it clear these were business files, not a hard drive full of personal mementos.Not only did I receive things back in a \"file type recovery\" format where all file structure was stripped, but it renamed every file so I had no clue what it was.  That too could have been dealt with if a single one of these files would open. They do not.  Not one of the psd files, not one of the jpeg files.  My Adobe InDesign files that had a file extension of .indd are just flat missing.I'm beyond disappointed in how this was handled.  At any point they could have told me that they didn't have experience with these large graphics files, or that their software was going to destroy the files, or that they didn't have experience with mac files. They didn't even tell me that my drive had been re-shipped off to Chicago instead of Los Angeles, and couldn't even get the shipping back to me with the correct method. Instead I was strung along for almost a month, while my business suffered waiting to hear whether anything could be recovered or if it all had to be rebuilt from scratch.I reached out to the company again and told them I was willing to pay the $295 for the diagnostics, the cost of the new hard drive they sent back, and a reasonable $500 fee for the work they did to access the physical drive. But I cannot pay $3,752.37 for \"recovered files\" that can't be opened.  That is simply unacceptable, not to mention ethically reprehensible.After giving them another 12 days to get back to me and make this right, I once again heard nothing from them and have proceeded to file a dispute with my credit card company and the Better Business Bureau."
        },
        {
          "Note": 1,
          "Lieu": "RO",
          "Pseudo": "Tavi Florian",
          "Nb_Reviews": 1,
          "Date": "2019-04-16T10:21:09.000Z",
          "Titre": "Hidden fees. Lack of commitment. They won't show you the listing of salvaged data!",
          "Contenu": "My name is Tavi Florian and I had a recent experience with the SDR company, which had been promising at the beginning, but turned to bitter disappointment in the end. And even to a robbing attempt from them!Now the whole story of facts:- I contacted them on e-mail, with a detailed description of my problematic hard drive, on which another recovery procedure had been done at a specialized firm in my home country, and my whishes about further recovery of files (mostly pictures) from an easy checkable listing provided by the first company (with the original file names and their structuring sorted in two groups: the valid ones and the corrupted). I also told them that in the present, the read heads are probably dead.- After a few days, my case was assigned to someone in the Ohio area, named Luke Marrali, who was saying to me (knowing all the facts) that they offer free diagnostic and the normal pricing range of 400 to 1800$, with the mention that it can be higher “if certain variables exist”. How much higher? He doesn’t said.- Then I decided against my feeling, but in favour of the reviews, to send my hard drive at SDR. - After its arrival, I went through the procedure and I authorized just the diagnostic. Then, no more than 2 hours passed, and the result came back... which was saying that the engineers are confident that they can start a successful recovery procedure. But they did not estimated any percentage of recoverable data, just that it can not be salvaged all the data because of some bad sectors. The price was about 3215$! For something very ambiguous. - Before the completion of pre-payment agreement, I gotten quickly out of there, asking the same guy for clarifications. It is unbelievable that they do not commit to anything! They won’t show you the listing of salvaged data in order to let you decide if the operation is successful or not, if you are pleased with the results! And only if you accept the results, then you should have to pay for the needed data! This way seems logical and right for me. But NO, they decide instead of you!! They are like the banks... they never take risks, never lose anything. That is why they claim such a high rate of success (96%)! What a dump head would accept to buy the same data that he already have, for a price of 26 times more expensive?!! Unbelievable policy, in contradiction with the doubled price just because another recovery had been done. Ok, high price, but show me the data and let me decide if it is satisfactory or not. - That Luke guy had become very elliptical, throwing just a few words on you. Then given their lack of commitment, I refused any further continuation and was asking for my hard back. Now, it came the stroke of this crook! I almost felt his perfidious smile on his face... saying: “Unfortunately this is an AS-IS case. You will be liable for payment either way.” - FOR WHAT, YOU CHARLATAN, WANT MONEY FROM ME?! But this type crooks never even think about the condition of their potential victims! Referring now on by background, I have to say that I was an autistic child. And now, at 40 years old, I am alone, with no job and no friends... and probably I will remain this way for ever. I never had a girlfriend in my life. And for this matter, by the way, my most important lost photo (which I wanted the most to be recovered) was a girl on the street. Unfortunately, only after this hard drive disaster I realized how much I love her... and I wanted dearly to have that picture of her to put it on my chest when the time will come. Of course... an illusory love.- The next day, I wrote to him again, repeating all my arguments. Then, with a bit of delay, he threw a reply with the “shipping fee” of 49$. This fee still looked high for me, thinking of that paying threat from Luke. And knowing the price I had paid to send it, about 19.3$.- I was also looking for a second opinion on my case, in the SDR company, writing them on facebook. Fortunately, their person on FB was nicer and I manage to communicate better with him. He made a checking in the shipping department and confirmed me the shipping fee was correct. Which was actually much smaller for companies than for a normal person. - Ok, That should be it and I paid, getting a clear invoice of 49$ for the shipping to my address in eastern Europe.- After a few quiet days, the real shock came... that Luke specimen saying the following words: “Return shipping quoted is actually $195.00 instead of $49. We cannot honor the $49.00 charge and you will have to pay the difference. We can always shred the drive for free or we can invoice you the difference.“ In the previous days, it just seemed that they had given up to charge me for the “AS-IS case”.From time to time, big companies might do charitable acts, but for this kind of scumbags it is a huge challenge just to respect the deal, to be FAIR and have clear fees! The “charitable act” of rightness was a huge challenge for that specimen! He failed! Again me on facebook and manage to sorted out on Friday (without knowing for sure)... and finally, on Tuesday next (this) week my hard came back to me surprisingly, a surprise on the good side this time, without any sending confirmation from them. - Finally, such a waste of time, energy, hopes and money! But I still keep a minimal hope.IN CONCLUSION:1. I got fooled by the good reviews, BIG TIME! Wanting to be optimistic and see only the good parts.2. With this SDR company, there is no phrase like this: “we bring your data where others have failed”. A long review, but the experience was shocking for me, in relation with the size of this company and its public quotation."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "CustomerCanada",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T18:57:30.000Z",
          "Titre": "Took over 2 months to get me back my…",
          "Contenu": "Took over 2 months to get me back my drive because of internal miscommunication despite multiple calls on my part."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William Blake",
          "Nb_Reviews": 2,
          "Date": "2022-06-03T20:46:44.000Z",
          "Titre": "Pictures look fine in the thumbnail…",
          "Contenu": "Pictures look fine in the thumbnail images but when opened most of the pictures are blacked out."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KStafford",
          "Nb_Reviews": 1,
          "Date": "2022-08-26T23:49:11.000Z",
          "Titre": "Very expensive and I didn’t get back…",
          "Contenu": "Very expensive and I didn’t get back what I was hoping for"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2022-03-23T10:30:12.000Z",
          "Titre": "The original request to recover a…",
          "Contenu": "The original request to recover a specific document- the only important document on the failed drive, was ignored on numerous occasions. Instead, I was sent an enormous text document which couldn't be opened by any common software to \"verify\". Again I simply wanted one document recovered. The company failed to produce the document and wanted more money. I was disappointed to the point of just paying the agreed sum and cutting my losses. It then took 6 months to get my original drive back.I CAN NOT recommend that anyone to use this company for recovery. I had high hopes but was disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DK",
          "Nb_Reviews": 1,
          "Date": "2021-03-08T15:30:30.000Z",
          "Titre": "Price Gouging, unresponsive",
          "Contenu": "The staff were nice, informed and professional, although there was a lack of coordination which led to poor communication. Moreover, the pricing policies seemed predatory without being upfront. My small job took several days for the free analysis and when I followed up was going to be more than $1000. After expressing my concern the estimate was lowered by almost half. Ultimately i took it to a local computer repair shop who retrieved all my data for $75.My biggest complaints are that SDR is slow to respond, not proactive, unorganized, and their pricing seems to take advantage (hijacking emergency situations). If there is a positive it is that their staff are very friendly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "phil",
          "Nb_Reviews": 1,
          "Date": "2019-09-27T07:00:22.000Z",
          "Titre": "Horrible Customer Service!!!",
          "Contenu": "How this company could put someone like luke in customer service is beyond me?!! Never returned my calls. Had to email back and forth. Very short in explanations. When calls were returned it was if i was bothering him. To the point when i asked what time did he go home he responded \"Now\" and hung up.Then he forgot we'd discussed overnight shipment!! Had i not caught the overnight shipment error who knows when i would've gotten my computer.I held my tongue on a few occasions and after the money i spent thought i deserved better treatment.I could continue but you get the gist."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gab Sh",
          "Nb_Reviews": 3,
          "Date": "2021-10-07T22:03:39.000Z",
          "Titre": "Lack of responsiveness and unclear information about turnaround time and price",
          "Contenu": "Sure, they recovered almost all the data I have lost, and that's practically really all I wanted from them. However, there are several points that should be improved during the process.1. Their customer account portal. This is very nice, but needs some improvements. Once you chose the turnaround time from several estimates, the customer account portal will NEVER show you which turnaround time you chose. I actually felt they had slightly passed the estimated time of completion of data recovery, but as the turnaround time is NEVER shown either in the portal nor in any email notification, I could not claim my right to any discount due to their (not sure, as I cannot confirm anywhere, but possible) delay in their process.  I think I ordered an expedited (2-4 days?) plan, but it took them a week (5 days) to complete the process. This is an issue related to the expensive price--customers surely pay a lot; let them know exactly the correct information about the price and time.2. Many reviews here write that they are responsive. I cannot believe it. I requested for updates through customer portal several times, as I felt the process was behind the promised turnaround time, which was due to the issue 1 mentioned above, but they replied only once, which was from a technician and was indeed relieving. It is okay, I know you are busy, and all I want from you is data recovery, period. But if you cannot reply to update requests, it might be better to delete that function in the customer portal. Also, the customer service representative responded to my multiple email questions only once during the process and ignored all the remaining questions. It is, again, okay, as I was clearly in a panic or too worried and most of my questions probably looked stupid to them; data recovery is most important, and the remainder is, after all, nothing. Still, this lack of responsiveness was enough to make me wonder about the quality of the customer service itself. Overall, extremely frustrating and not worth the extravagantly expensive price. I posted this review on Google, but somehow it does not show up on Google Reviews. Most of the reviews on Google are written by those with only one review."
        },
        {
          "Note": 3,
          "Lieu": "BS",
          "Pseudo": "Wendell Grant",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T18:12:55.000Z",
          "Titre": "Jabe was polite but the experience…",
          "Contenu": "Jabe was polite but the experience seemed 'sterile'. It seemed automated. Lacked a human touch. In fact I felt Jabe was a pseudonym."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-09-02T18:40:04.000Z",
          "Titre": "Beware",
          "Contenu": "Beware!  Services are SUPER EXPENSIVE.  That deserves 1 star. SDR delivered as promised, that deserves 5 stars, and within a several weeks, so that rated 3 stars.  Average is 3 stars.  But cost of service was at prohibitive level except that I had no choice.  My impression was that this felt like a ransomware attack only the cost to me was over $4,000 instead of several million$."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amber Queen Shopper",
          "Nb_Reviews": 4,
          "Date": "2022-08-23T13:46:28.000Z",
          "Titre": "I'm going to leave a generous 3-rating.",
          "Contenu": "I'm going to leave a generous 3-rating.Secure Data absolutely did recover an external hard drive for me which contained files that had significant sentimental value.  Do I think this should have cost $1,000?  No, I think that's a bit steep for data recovery, but if you want your files, that's what you pay.  So for data recovery services, it's 4 or 5 stars.The problem is that the level of customer service I received was pretty terrible for something costing $1,000.  I had follow-up questions about what could be the possible reasons why my hard drive failed, and if there might be anything I could do to prevent this from happening again.  After I agreed to pay the $1,000, Secure Data never responded to another email I sent.  Nothing.  I had questions, I got no answers, and not even a response.  Secure Data absolutely can recover your files, but at a very high price point, and don't expect any answers to your questions, or any responses at all.  Pretty terrible customer service for this price."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KristenN",
          "Nb_Reviews": 1,
          "Date": "2022-04-19T19:28:44.593Z",
          "Titre": "Dishonest pricing",
          "Contenu": "I appreciated the responsive communication and follow-up. However, I feel as though pricing was dishonest. I needed a very basic service, however was quoted a price that was far too high for the service that was actually needed. When I inquired further about the actual issue and asked for a price adjustment accordingly, it was then offered and explained in better detail. From my perspective, I should not have been sent “standard” pricing and been provided a fair price from the beginning based on the actual issues with my data/computer. Once the price was agreed upon and the actual issue clarified, service was fast."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony Kung",
          "Nb_Reviews": 1,
          "Date": "2022-01-15T01:56:33.000Z",
          "Titre": "7 months since I contacted Secure Data",
          "Contenu": "7 months since I contacted Secure Data, my case still has not been resolved today. I always have to do the follow-up because there doesn't seem to be any urgency to get my case completed. Kyle is the only one there who has been really nice to make sure my questions and concerns were answered, but he's the tech lead who can only do so much."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "321",
          "Nb_Reviews": 2,
          "Date": "2022-03-31T19:36:44.000Z",
          "Titre": "Weak Follow Up",
          "Contenu": "I would have assigned 5 stars, but I was given no help finding the Emails on the secure drive.  They were an especially important part of the recovery process. I still can't find these files after many weeks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vicki searles",
          "Nb_Reviews": 1,
          "Date": "2015-05-19T21:14:24.000Z",
          "Titre": "Replaced about 50% of data on over ridden hard drive",
          "Contenu": "The people I worked with were pleasant.  The tech hours hours were difficult to work within.  I actually had to take time off work three times to review what was pulled off my bad hard drive.\r The techs were pleasant and patient when it took me so long to complete the review."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Behnam Barabadi",
          "Nb_Reviews": 3,
          "Date": "2020-07-28T19:20:56.000Z",
          "Titre": "The price of recovery was way too much…",
          "Contenu": "The price of recovery was way too much for me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adrian C. Browner",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T20:20:18.000Z",
          "Titre": "While I appreciate the responsiveness…",
          "Contenu": "While I appreciate the responsiveness of the person assigned to assist me, I feel that some things regarding the recovery of data, especially with a tablet, should have been made clear up front.  While I do have my information, I have been (so far) unable to access it.  I've had to download programs to my laptop that are clearly meant for people who program. Unfortunately I had to have my laptop had to be wiped clean so I have to try and start again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathy Lavery",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T23:38:13.000Z",
          "Titre": "Glad I Chose Secure Data",
          "Contenu": "Scott was very communicative and patient with me and my questions.  Unfortunately, not all of my lost data could be successfully retrieved, but I have full confidence in Secure Data and their ability to do the best job possible.  They kept me updated throughout the process and took the worry off my shoulders.  I would definitely recommend them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "L Titus",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T04:15:29.000Z",
          "Titre": "Quick, efficient service",
          "Contenu": "SecureDataRecovery was able to retrieve more than a GB of data I thought lost after one of my external hard drives failed.  While the price tag is somewhat steep, it is understandable given the nature of the work and the fact they have to pay for a secure drive to return the data.  I thought their service was quick, efficient, and well worth the cost."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Arthur G Hughes",
          "Nb_Reviews": 3,
          "Date": "2023-03-31T16:23:09.000Z",
          "Titre": "The whole process went smooth with…",
          "Contenu": "The whole process went smooth with quick turn around. The customer service manager I was assigned (Scott McMaken) handeled everything in a very professional manner. The only thing keeping this from a five star review is the price. WOW, data recovery is expensive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Prendergast",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T20:36:51.000Z",
          "Titre": "Your company did what it promised",
          "Contenu": "Your company did what it promised, it recovered most (but not all) of my files, in a timely manner. The four stars instead of five has to do with the incredibly complicated, encrypted, pass-word protected digital hard drive that required an app to access. In my opinion, 99% unnecessary. An email password to me should have been sufficient."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerry Key",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T14:40:51.000Z",
          "Titre": "Your representative was very helpful in…",
          "Contenu": "Your representative was very helpful in getting my issues resolved.  I had asked if you could provide a possible explanation for what caused the drives to get converted to RAW format and never received a response.  Also, you did not return my old drives initially but did later after I requested them.  I also felt the charges were a little excessive and should have been based on what was recovered rather than the base price I seemed to have been billed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rebecca Potter",
          "Nb_Reviews": 2,
          "Date": "2022-10-04T18:10:59.000Z",
          "Titre": "I am very grateful for the excellent…",
          "Contenu": "I am very grateful for the excellent customer service that I received from Randall and Secure Data Recovery team. They were able to recover all of my data and sent it back to me on a brand new drive. It’s a very expensive process but I am very relieved that they were able to help me!"
        },
        {
          "Note": 4,
          "Lieu": "VN",
          "Pseudo": "Brendon Fox",
          "Nb_Reviews": 2,
          "Date": "2022-08-26T21:14:35.000Z",
          "Titre": "Secure Data Recovery provided great…",
          "Contenu": "Secure Data Recovery provided great customer service and their project management system was pretty transparent.  They were able to recover all of my files. My only issues were that sometimes there were some communication disconnects with my contact person (but others handled my concerns) and that the service seemed very expensive.  Of course, I do not know the costs they incur or what industry benchmarks are, but for those who need data and can't afford it, prospects would be prohibitive."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Vincent Chan",
          "Nb_Reviews": 1,
          "Date": "2022-08-19T20:59:56.000Z",
          "Titre": "A positive experience.",
          "Contenu": "It was expensive, but ultimately something that we really have to do. The most important data files were recovered, some of which was work done over a lifetime. Look at it this way. We always repair the car, even though we know one day it dies. Our own work, should live forever."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "B. Estrada",
          "Nb_Reviews": 2,
          "Date": "2022-04-23T12:38:07.357Z",
          "Titre": "The drivers on my tower broke and I…",
          "Contenu": "The drivers on my tower broke and I lost my pictures, music, and videos from the previous 5 years. I went to two places that claimed everything was lost. Secure Data was able to save the files within 5 days and I received my external hard drive 8 days later"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bo B",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T16:59:40.000Z",
          "Titre": "Able to recover 96%",
          "Contenu": "Able to recover 96%. Not cheap but I appreciate getting my data back."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susannah Frame",
          "Nb_Reviews": 1,
          "Date": "2022-11-26T19:35:02.000Z",
          "Titre": "Patient and persistent",
          "Contenu": "Elliot was patient and persistent in supporting what I needed in recovering a decade of photos and documents! He was able to work with me on payments and the timeline so that it worked for me!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tiffany Gardner",
          "Nb_Reviews": 1,
          "Date": "2022-04-18T18:21:11.000Z",
          "Titre": "The recovery seems to have been…mostly successful",
          "Contenu": "The recovery seems to have been successful, however many of the recovered documents were no longer associated with their previously associated files.  Sadly, we do not have a way of knowing which photographs belong to which case file."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dong Zhao",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T05:18:12.000Z",
          "Titre": "Able to negotiate the price but still…",
          "Contenu": "Able to negotiate the price but still quite a lot file got lost."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AJC",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T21:38:14.000Z",
          "Titre": "It was smooth",
          "Contenu": "It was smooth. My devices weren't working and good amount of my data was restored."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adrian Bucurica",
          "Nb_Reviews": 1,
          "Date": "2022-09-03T02:02:16.000Z",
          "Titre": "Data recovery",
          "Contenu": "Thank you for recovering our data."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2021-12-28T21:12:45.000Z",
          "Titre": "On the whole the service was good",
          "Contenu": "On the whole the service was good. All data (30,000+ pics) were recovered from a dead HDD. Some colors and exposures were off from the originals. But they were not unfixable. Personally it is not a major issue as my intent was to edit and enhance many of the photos anyway. I will say SDR did not fall short of fulfilling their performance guarantee. A fair and honest service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 4,
          "Date": "2022-04-10T19:31:54.000Z",
          "Titre": "Recovering Important Personal Data",
          "Contenu": "A significant amount of important personal data was on a disk that malfunctioned.  The SDRS people were helpful and honest about what we could do and what our chances for recovery were.  They managed the process smoothly and kept us informed of progress."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2022-03-21T18:44:24.000Z",
          "Titre": "Great Service!",
          "Contenu": "Representative \"Val\" did a great job answering questions and facilitating the process, the data recovery was better than expected (99% recovery) and performed within the quoted timeframe, but the cost seemed high (hence the 4/5 stars)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Truesdale",
          "Nb_Reviews": 1,
          "Date": "2020-09-23T21:00:53.000Z",
          "Titre": "Professional Service, Quick Turnaround",
          "Contenu": "Very pleased with our Sedure Data experience. We were able to hand-deliver the faulty drive to a local tech vendor that facilitated shipping of the unit. Within a very short period of time we had heard back from their analysts regarding options for recovering the unit via the account representative we were assigned. This is one of those services you don''t hope to need frequently but if we ever do again this is where we''ll go."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ce",
          "Nb_Reviews": 2,
          "Date": "2022-09-01T20:33:08.000Z",
          "Titre": "They got the job done in a very brief period of time. That said, it was a bit expensive.",
          "Contenu": "They got the job done in a very brief period of time"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2019-10-24T20:11:54.000Z",
          "Titre": "Secure Data Recovery",
          "Contenu": "Secure Data Recovery, was able to save 99.8 % of the data from my damaged hard drive. The work was completed as Jeff promised. however there was a problem with the password on the drive they returned to me....I sent the drive back and they again returned it as promised, this time the password worked. I would do business with them again !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronny Zahavi",
          "Nb_Reviews": 1,
          "Date": "2015-05-20T19:12:27.922Z",
          "Titre": "Great Service - Pricey Though",
          "Contenu": "I had very good experience with Secure Data Recovery. I have chosen the free analysis and it took 2 weeks to get actual status if the data could be saved but bottom line is that the lost data was fully recovered. I have received updates when requested and as said the company was able to get the data. The service is good but very expensive. I have worked with Jeremy who responded to every request quickly and had great customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Villarreal",
          "Nb_Reviews": 1,
          "Date": "2015-05-20T18:56:12.275Z",
          "Titre": "Great Customer Care",
          "Contenu": "To be honest, I didn't know much about Secure Data Recovery,  reading the testimonials was very reassuring.  Jeremy our Customer Service Rep, was very knowledgeable and up front about all the scenarios that could happen with our hard drive.  They were able to recover the data, ghost it to a new drive and also a supplied thumb drive.  Overall we would use Secure Data Recovery again and I would recommend them to anyone.\r Thanks, Mike Villarreal."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tammy",
          "Nb_Reviews": 5,
          "Date": "2020-12-17T14:58:33.000Z",
          "Titre": "The only reason I give only 4 stars is…",
          "Contenu": "The only reason I give only 4 stars is that I didn't go through with the recovery so I don't know how it would've turned out. Otherwise, I give you EXCELLENT on every other aspect from communication to speed! Thank you so much for your service!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Samuel Del Valle",
          "Nb_Reviews": 1,
          "Date": "2020-03-31T12:57:43.000Z",
          "Titre": "The service was very professional",
          "Contenu": "The service was very professional and effective. Need to improve customer service. We weren't able any time during the whole process to reach you by your phone number. And emails some times  were answered three to five days later. But in overall Excellent Job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barbara A. Bell",
          "Nb_Reviews": 1,
          "Date": "2015-07-13T18:51:56.064Z",
          "Titre": "Good experience with Secure Data Recovery and Mitchell Moore",
          "Contenu": "After trying another data recovery company which proved to be quite frustrating, my assistant recommended Secure Data Recovery.  I found Mitchell to be very patient with all my data questions as well being very responsive to all of my emails.  I felt assured that my both my work and personal data files would remain secure.  Mitchell was helpful explaining what went wrong with my drive without making me feel stupid. The recovery was on schedule and within budget.  And they were able to retrieve all of my files!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yelena S",
          "Nb_Reviews": 4,
          "Date": "2021-10-30T03:16:22.000Z",
          "Titre": "Secure Data Recovery (Eric Dvorin) was…",
          "Contenu": "Secure Data Recovery (Eric Dvorin) was very professional and responsive. Although unfortunately they could not recover data that is stored in the HDD, I would recommend them if you have any data recovery issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bryan L",
          "Nb_Reviews": 1,
          "Date": "2015-07-10T18:21:46.813Z",
          "Titre": "Stress free service for a stressful situation",
          "Contenu": "Having been in a terrible bind by not being able to retrieve client files off a drive, I reached out to Secure Data Recovery, and for a very reasonable fee for such a quick turnaround, I was able to recover every single file off the damaged drive. Chris was an awesome rep who alleviated a very stressful event. A small issue with being able to recover the files, but was not at the fault of Secure Data Recovery (I was working with an outdated computer). I will definitely continue using Security Data Recovery if I ever need to."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff S",
          "Nb_Reviews": 3,
          "Date": "2019-08-14T18:17:02.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Though I wasn't able to my drive fixed due to financial reasons, Elijah offered some of the best customer service I have ever come across. Having been in customer service myself, Elijah offered fast replies to my emails and questions. Thanks again Eli!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Denis Blanco",
          "Nb_Reviews": 1,
          "Date": "2017-02-12T20:08:00.546Z",
          "Titre": "too high of a price",
          "Contenu": "I have no complaint about the staff, everything was recovered 100%. The only thing that needs to be emphasized is the following: if a company opens a hard drive for a diagnostic test and you find a cheaper company, you could be charged an extra fee by the next company doing a diagnostic test.After applying the 10 percent Yelp promotion to the case and another small discount for Educational purposes, our final price was $1488.26. This was priced for a 67 GB, a price we cannot refuse due to the fact of our external hard drive contained all the pictures of family whom has passed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Erica Ashby",
          "Nb_Reviews": 1,
          "Date": "2019-10-09T19:39:17.000Z",
          "Titre": "Thanks Jeff!!",
          "Contenu": "I worked with Jeff Hart on the repair of my hard drive. His customer service was above and beyond. He was quick to respond and was very thorough in the process. I appreciate his help and would recommend this service to anyone in need.Erica"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony Winspear",
          "Nb_Reviews": 1,
          "Date": "2015-07-23T16:07:50.309Z",
          "Titre": "Very happy with Service",
          "Contenu": "I used Secure Data due to an unexpected breakdown in my computer and was happy that they were able to recover all my data for me and save me a lot of potential trouble.   I will not hesitate to recommend them to any associates who come across similar problems."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott Zaverl",
          "Nb_Reviews": 1,
          "Date": "2019-09-23T13:18:35.000Z",
          "Titre": "Secure Dara Recovery is a great…",
          "Contenu": "Great service! Secure Dara Recovery is a great service, I had no ptoblems through out the process and they were very good at keeping me updated as the recovery process proceded and made sure I understood the next steps in the process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lael Worsley",
          "Nb_Reviews": 1,
          "Date": "2015-07-26T16:22:54.607Z",
          "Titre": "Got all my pics back",
          "Contenu": "I am so grateful to have my pictures back. It is a very frustrating experience to have years of pictures only stored in one place and then have the device stop working.  The truth is that you feel a little hand cuffed when something is so valuable to you and the only way to get it (something you already had) back is to pay a lot of money.  Comparably, the price is pretty in line with other places that do the same thing. The service and communication was great, and they were able to recover all of my files.  The company was great and I would recommend them to others, they just have to be able to pay for it:/"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AlexLawrence",
          "Nb_Reviews": 6,
          "Date": "2021-02-22T13:31:27.000Z",
          "Titre": "one of the great secured data recovery service",
          "Contenu": "They provide one of the great secured data recovery service. I recover my complete data in one go.Thanks to all their staff is very helpful and supportive. Really glad to find such amazing service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2020-05-29T17:39:35.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, trusted with information recovery, took a little bit longer than projected, about a week or two longer than what was quoted, but I am happy to have the data back, thanks Secure Data."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony A. Kung",
          "Nb_Reviews": 1,
          "Date": "2022-02-09T04:05:06.000Z",
          "Titre": "Follow up",
          "Contenu": "Posted Jan 14, 20227 months since I contacted Secure Data7 months since I contacted Secure Data, my case still has not been resolved today. I always have to do the follow-up because there doesn't seem to be any urgency to get my case completed. Kyle is the only one there who has been really nice to make sure my questions and concerns were answered, but he's the tech lead who can only do so much.Followup Feb 8, 2022Issue has been resolved. Thank you so much to Kyle for being on point to get this done. A suggestion for improvement if I may, from my technical support experience at a Regional Asia Pacific Helpdesk for Kearney ($1.4billion 2019 revenue)? A ticketing management software tool to make sure nothing falls through the cracks. It should have features that may include, but not limited to: point-of-contact info, SLA (Service Level Agreements) management, start-to-end resolution status. Good luck! Thank you, Secure Data Recovery!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cheryl Arthur",
          "Nb_Reviews": 4,
          "Date": "2020-01-15T22:16:37.000Z",
          "Titre": "Great service",
          "Contenu": "Only 4 stars because they were unable to retrieve any data.  Otherwise service was quick, professional, and honest.  That's hard combination to find these days."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael McCracken",
          "Nb_Reviews": 1,
          "Date": "2019-04-26T14:35:12.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. It took a little longer than I expected but they recovered everything off my device. I would recommend Secure Data Services to anyone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2019-11-07T20:55:11.000Z",
          "Titre": "Accessing the data has been a little…",
          "Contenu": "Accessing the data has been a little confusing but other than that it was a super quick and easy process to get my hard drive backed up!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sue Gordimer",
          "Nb_Reviews": 1,
          "Date": "2022-01-02T21:20:08.000Z",
          "Titre": "Great support offered!",
          "Contenu": "Excellent communication.  Very professional and personable.  Thanks for the attempts to retrieve the data."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Will Simonds",
          "Nb_Reviews": 1,
          "Date": "2015-06-30T18:45:10.721Z",
          "Titre": "Good service, many options, flexible.",
          "Contenu": "We had been fortunate to not have needed hdd recovery services until now, so we needed to choose a provider we could trust in short order with no prior experience.  Reviews and certifications were helpful to make the choice. \r Our initial call in for help was good  - the account rep was helpful, clear, and friendly. Sending in the drive was easy. The rep we worked with throughout the process  - Jeremy Provchy - was prompt and courteous and took the time to explain issues as they arose. He was able to be flexible on the fee, and even responded to questions during off hours and weekends.  \r It took a little bit to sort through the remains of the data and figure out how exactly the process for retrieving files worked, but in the end we got back a significant portion of what we needed. \r We chose the option to have the data encrypted for return, and the method is pretty nice.  The drive is enclosed in a well built case and includes a usb key and software. Setup is simple. We can continue to use the drive for encrypted backups."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A P Cueto",
          "Nb_Reviews": 1,
          "Date": "2020-04-10T22:39:56.000Z",
          "Titre": "Chris was very responsive to all of my…",
          "Contenu": "Chris was very responsive to all of my concerns.  I would not hesitate to use their service again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Seth Miller",
          "Nb_Reviews": 1,
          "Date": "2015-09-30T09:41:29.043Z",
          "Titre": "Got all the data, and that's what matters",
          "Contenu": "I had a failed laptop HDD, bitlockered, from a user that was dying.  It would only mount in another computer about one out of every 5 or 6 tries... and then it would ask for the bitlocker key.  After putting it in it would only run for a few minutes and then unmount, so I couldn't get much data off at all.  Then, at one point I tried putting in the key and it told me the key was invalid... but I knew it was the right key.  I think the sectors that held the key on the disk probably got corrupted... I couldn't do anything else, so I sent it so Secure Data Recovery.  \r They ran in to the same issue with the bitlocker key being incorrect... but on a whim I pulled up an OLD bitlocker key from well over a year ago... and apparently that worked!  I have no idea how.  But needless to say, they were able to recover all the data, so it was a success.\r The only improvement I could suggest is that it took quite some time, and updates on the status were not always forthcoming unless requested.  It ended up taking quite a while to get the data back to me, in part because I had to send out a separate hard drive for the recovery to a part of their business in another state... a few weeks, ultimately."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christa P",
          "Nb_Reviews": 1,
          "Date": "2019-07-30T23:21:17.000Z",
          "Titre": "Great customer service and product…",
          "Contenu": "Great customer service and product delivery! 4 stars only because the price is extremely high."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric Haynes",
          "Nb_Reviews": 3,
          "Date": "2022-04-05T12:43:32.000Z",
          "Titre": "The process was easy and timely",
          "Contenu": "The process was easy and timely. I feel it's a bit pricey though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laurie Savoy",
          "Nb_Reviews": 1,
          "Date": "2020-09-28T16:08:30.000Z",
          "Titre": "Dear Secure Data Recovery:",
          "Contenu": "Dear Secure Data Recovery:Thank you SO much for all you did to recover ALL of my data. Elijah was professional, helpful, and affable. He patiently led me through a lot of issues and questions, and I have a feeling I shall be calling back. In terms of suggestions for possible improvement, I think it would be helpful going in to let people know a bit more of what the prices are--I was initially told the baseline fee was $400, so when I found out that the minimum fee I would be paying was over $1,400, there was a bit of a shock. It was absolutely worth it, but a lot of people do not have the means to pay such a high price, and, if they know that going in, they may be better equipped to gauge the value of their data versus the price point. Lastly, and this just may be my issue, but the files are not easily found on the external hard drive. I know that there are 'folders inside of folders inside of folders,' but, after an admittedly quick and cursory examination, I still can't find my files without entering a specific file name. I believe it is going to require a LOT more digging, which I simply do not have the time for right now. Nonetheless, the peace of mind that has been achieved in knowing that ALL my data was recovered is immense, and I cannot thank you enough for the professional and expedient manner in which you handled my case. Special kudos to Eli!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Good to get it back",
          "Nb_Reviews": 2,
          "Date": "2020-07-14T12:27:03.000Z",
          "Titre": "I lost access to a portable hard drive",
          "Contenu": "I lost access to a portable hard drive, and was looking for a place to recover the data. The last time I had to do this was a few years back, but was not impressed with that firm, so I found Secure Data Recovery. The response from the personnel was very good, with quick turn-around time to all communications, and helpful information. They were able to recover all the data, and in a reasonably good timeframe. I had no rush for the data recovery, so I wasn't too concerned about that. The price was average, though -- about the same as other services I've used. One drawback was that Secure Data Recovery did not provide a recovery drive at cost, or even at retail prices. The base service is data recovery and you provide your own recovery drive. Secure Data Recovery will provide a recovery drive, but at significantly more cost than if you get a replacement drive and ship it to them, which is what I did. The reason for the additional cost for a higher-tier recovery plan, according to their website, is because, in addition to the replacement drive, there were additional \"services\". However, none of the extra \"services\" had any value to me at all. So that just made the cost of the drive way too much. But I did ship a replacement drive to them and they transferred the data to it and have shipped it back. So I'd come back if I need to do this again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KSullivan",
          "Nb_Reviews": 1,
          "Date": "2020-08-06T16:34:39.000Z",
          "Titre": "Would recommend",
          "Contenu": "My experience with Secure Data Recovery was easier than expected, obviously I was nervous sending off my phone which held thousands of pictures that I wanted recovered. The original phone had tea spilled on it and it ruined the screen so that I could no longer utilize the phone, but I could tell it was still working since it was making noises. I took the computer components out and attempted to transfer to another phone with a working screen so that I could access and save my data, however that didn't work. So I searched and found Secure Data Recovery. I requested a quote, and my customer service rep, Kurt Pietrick, called and discussed what I wanted. He kept in contact with me and answered questions as I had them throughout the process. I selected the standard service and turn around was less than a month. It was more expensive than I was anticipating, approx $1200, but it was worth it to me as I had years of pictures and videos stored that i had never backed up. A few of the video files where corrupt and I couldn't view them, but overall it was a success! The only downside is that when your data is returned it is on a drive that is accessible only after you download their APP, I typically don't use APPs, so I would have preferred it to be just a password protected drive, but even following the instructions to open the drive was easy. I would use again and suggest to others."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Zev Johnston",
          "Nb_Reviews": 1,
          "Date": "2021-02-16T15:59:12.000Z",
          "Titre": "Great service",
          "Contenu": "Thank you for retrieving all my data from my damaged harddrive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angela Stimpert",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T16:14:30.000Z",
          "Titre": "Thank Goodness for Secure Data Recovery",
          "Contenu": "Thank goodness for Secure Data Recovery! I had a major hard disk crash on my laptop late last year. I was beside myself when my photos from the past four years, as well as other important files, could not be salvaged by my local big-box store tech support. Worse yet, I had not properly backed up anything. Fortunately, I found Secure Data Recovery and eventually got my damaged hard disk out to them in California. I am comfortable with tech stuff to a point, but the account manager handling my case answered all of my questions and concerns and made the process easy, and he was available to answer other questions as they arose. We had a slight glitch when I was emailed someone else's recovery report, but the account manager straightened it out and the process continued smoothly. On my end, the only thing I would have changed would be to eliminate the drop-off aspect of the process and mail the disk directly. In retrospect, I instinctively knew how to properly package the damaged drive for mailing off to Secure Data Recovery and probably would have saved myself a 45-minute drive to the suggested drop-off location. Otherwise, Secure Data Recovery saved my photos and files, all within their estimated project time. I even got telephone assistance with the encrypted hard drive containing my recovered files. Secure Data Recovery is not inexpensive, but for me, the price was worth it because had I not used their services, I would have lost a considerable chunk of precious photo memories. They do offer a few pricing options for dealing with a technical problem, so that was quite helpful. Thanks to everyone at Secure Data Recovery for your technical expertise, courteous service, and truth in advertising. Hopefully, I will not go through a hard disk crash again (ever), but if I do, I know who I'm going to call."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Guy Volz",
          "Nb_Reviews": 3,
          "Date": "2021-12-24T01:37:42.000Z",
          "Titre": "Fast service although it still hurts to…",
          "Contenu": "Fast service although it still hurts to pay so much"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CM",
          "Nb_Reviews": 1,
          "Date": "2019-05-03T04:25:14.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "While I hope to not need their services again, if I do, Secure Data Recovery will be the place I turn to and I would highly recommend them to others. Frederick Wright kept me up to date on the status of my hard drive recovery. I explained to Dr. Wright that I''m currently on night shift, he was very understanding and kept me informed by through email and still made me feel like I was his only customer.Out of 50k+ files, they were only unable to recover four and they provided me the names of those files. Even the return shipping through FedEx was frustration free (I typically have problems with FedEx when a signature is required).I knocked off half a star due to the way the recovered data was provided to me. Because the cable for the secure hard drive was short, I used my usb extender. The drive would unlock for about fifteen seconds and would not show up in the file manager, then would re-lock. After about thirty minutes and me starting to get frustrated, I plugged the drive directly into the computer and had no further issues. I have been unable to get the app that unlocks the drive to work without allowing access to and enabling my location. Now that I have all my data back on my computer, I will be wiping the secure drive and it will became a rather expensive paper weight. The recovered data did include some financial information that I am very happy to have back, and I''m glad that the data was secured so that that if something happened during shipping, I''m protected. Now that being said, I am sure that if I had spoken with Dr. Wright on the phone, the whole issue would probably have not existed.In summary, awesome customer service, I would use them again, but I would discuss how the data was returned a little more."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kristin Myers",
          "Nb_Reviews": 2,
          "Date": "2020-10-09T15:52:25.000Z",
          "Titre": "Very pricey",
          "Contenu": "Very pricey. Wish you offered a payment plan."
        },
        {
          "Note": 4,
          "Lieu": "UY",
          "Pseudo": "Gonzalo E.",
          "Nb_Reviews": 1,
          "Date": "2019-10-11T16:09:04.000Z",
          "Titre": "Good service",
          "Contenu": "Good service. Might take longer than expected."
        },
        {
          "Note": 4,
          "Lieu": "BD",
          "Pseudo": "Shayema Sultana",
          "Nb_Reviews": 4,
          "Date": "2018-05-09T03:58:24.000Z",
          "Titre": "It's very nice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Tomsic",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T00:09:21.000Z",
          "Titre": "Elliot ROCKS!",
          "Contenu": "Elliot made the entire [stressful] process as seamless and painless as possible. From my first inquiry through to follow-up when the data was returned, he was absolutely awesome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura Charles",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T04:04:12.000Z",
          "Titre": "Had a great experience",
          "Contenu": "Had a great experience. Secure data helped save my reputation by recovering necessary files for my client. They also worked with my budget."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SJ",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T00:51:32.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Full recovery, great customer service, Scott was great to work with!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie Manuel",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T23:13:50.000Z",
          "Titre": "I had a great experience with Secure…",
          "Contenu": "I had a great experience with Secure Data Recovery! My hard drive was corrupt, with many valuable files on it. They were able to save almost everything, put it all on a brand new hard drive and get it back to me in about 2 weeks times. Eric Dvorin was so helpful and kept me informed the whole way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paige",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T04:33:49.000Z",
          "Titre": "Results far exceeded my expectations",
          "Contenu": "I went in with low expectations that none or very little of my data would be recovered. Jonathan and team managed to recover almost all of my precious memories on a dropped hard drive with a short turnaround time. I couldn't be more happier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Teri German",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T14:44:11.000Z",
          "Titre": "My Go-To for Data Recovery",
          "Contenu": "Working with Secure Data Recovery was a true pleasure. I discussed my needs and they got back to me quickly, and the amount of time it took to get a fresh external hard drive back was quicker than they promised. I hope to not need the services in the future, but if required this will be my go-to company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Blake Peterson",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T02:41:15.000Z",
          "Titre": "Daniel is a STAR",
          "Contenu": "Everything went great! Very smooth process and Daniel was great to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Corri Sandwick",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T20:07:39.000Z",
          "Titre": "My portable drive failed suddenly",
          "Contenu": "My portable drive failed suddenly, and unfortunately was not backed up properly.  Secure Data Recovery Services was able to recover all of my data, thankfully.  I spoke to Elliot on the phone and dropped off my device for an initial evaluation. He was very clear about the process, the costs and the timeline.  Throughout the process he answered questions for me quickly and patiently! Though I hope to not find myself in the same situation again, I would highly recommend the service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Josh Storm",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T14:10:07.000Z",
          "Titre": "The customer service was very helpful",
          "Contenu": "The customer service was very accommodating. As a student I had a tight budget and the team was able to work around that to help me out. Everyone on the team showed compassion and kindness."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thu Trang Le",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T17:53:36.000Z",
          "Titre": "Quick, efficient and polite workers",
          "Contenu": "I had a fantastic experience with Secure Data company. Their data retrieval was incredibly quick and efficient, and they offered a lot of encouragement throughout the process. I was in a tight spot with vital data, and they acted swiftly to get it back to me. Their clear communication and positive attitude made a world of difference. I highly recommend Secure Data for their outstanding service and support. They turned a potentially disastrous situation into a success story!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JJ",
          "Nb_Reviews": 3,
          "Date": "2023-09-21T01:06:40.000Z",
          "Titre": "Valiant Effort",
          "Contenu": "I was in a particularly difficult situation with a damaged platter-- a really messed up external hard drive. SDR was able to get many of my files recovered, despite losing others. Jonathan Nguyen kept me informed of the process and what to expect. He was helpful and responsive. Overall, it was a valiant effort and I appreciate the files I was able to get back."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fack Zauch",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T16:19:09.000Z",
          "Titre": "Legit if you need your data back",
          "Contenu": "Legit if you need your data back Wasn't cheap lol (go figure) but for what I paid it would cost someone else 10x -20x to recover all of the projects that I would have lost they managed to recover everything when all of the other recovery spots local to me we unable to so for that I'm grateful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica C",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T15:53:13.000Z",
          "Titre": "LifeSaver!",
          "Contenu": "I absolutely cannot say enough wonderful things about Secure Data Recovery!  Being a photographer, sports and all, not to mention my very own priceless memories, I was completely stressing when my external hard drive decided to go berserk.  My clients rely on me to deliver their images quickly and having reliable storage is a priority.  From a business standpoint, image recovery was a necessity.  From the get-go, my questions were answered and the process was explained thoroughly.  I was able to send my WD Passport quickly and received a diagnostic update within a couple days.  Mind you, shipping and allowing the experts to diagnose my hard drive was free--no harm in trying!  Elliot Fisher provided outstanding service.  He understood my dilemma and the apprehension that tagged along.  He kept communication open; answering emails/calls in a timely manner, and never hesitating to call me directly with updates.  The entire process was very professional--contracts to keep you covered.  After the process had begun and I was updated with my recovery status, I was one hundred percent at ease with the entire situation.  I actually thought, this is gonna be okay--whew!  Secure Data Recovery retrieved my images from my failed hard drive, approximately 1.7tbs.  Talk about relief!  I cannot thank Secure Data Recovery enough.To all my fellow photographers out there, in South Carolina and elsewhere, Secure Data Recovery is a lifesaver.Jessica CarpenterLMLDSouth Carolina"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leah Gavitz",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T21:21:27.000Z",
          "Titre": "Working Secure Data Recovery was super…",
          "Contenu": "Working Secure Data Recovery was super easy. Jake was attentive and helpful from start to finish. They were able to accommodate my organizations needs. Only 16 files were lost from our badly damaged drive out of the thousands of files we could have never seen again. I hope I never have to call them again, but if we lost another hard drive they would be the ones I call."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jon",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T01:46:38.000Z",
          "Titre": "The service provided by Elliot was…",
          "Contenu": "The service provided by Elliot was outstanding. There was a little confusion and weirdness concerning the cost of services, and we are still at the point wherein I havent received the data back (so maybe this is premature) but overall, things went quite well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lenore Fraga",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T00:34:43.000Z",
          "Titre": "Quick response, fair price and great communication",
          "Contenu": "I knew better but I'm not very tech savvy. My files weren't property backed up so when my drive crashed, I found that I couldn't access ANY files.  Knowing I had sensitive data in many of those files, I needed a company that was professional, but I knew that meant a cost that I probably couldn't afford.  Fortunately, I talked to the rep. at Secure Data.  He was great; professional, kind and understanding.  He worked with me to make get a fair and affordable price, answered my questions quickly and they completed the work faster than expected.  Virtually all my files were recovered.  I highly recommend calling them and talking to them.  They were extremely helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Billy Payne",
          "Nb_Reviews": 2,
          "Date": "2023-07-13T19:56:39.000Z",
          "Titre": "Great Service",
          "Contenu": "I was super fortunate to find Secure Data Recovery Services to assist with a corrupted solid state drive.  I was in danger of losing many years of outlook emails. I was assigned Jacob Medina as my account rep.  He did a great job of explaining the process and put me at ease that they could help.  In a few weeks I received my lost files back - what a blessing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George C.",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T20:33:24.000Z",
          "Titre": "Great Experience and Successful Data Recovery",
          "Contenu": "Customer service and technical support was excellent.  Data recovery process and options were thoroughly explained and periodic reports provided on data recovery progress.  I was provided with a complete breakdown of recovery results before providing authorization for completion of work and incurring charges.  All communications were with a single representative who knew all of the disk problem details from my initial inquiry, all the way to shipment of the new disk drive with all of the recovered data.  Very pleased with the results and glad that I contacted SecureDataRecovery.com."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Shay Hancock",
          "Nb_Reviews": 3,
          "Date": "2023-07-24T22:06:19.000Z",
          "Titre": "What a Relief!",
          "Contenu": "Elliott Fisher and the folks at Secure Data Recovery provided their services as advertised, on a time frame that exceeded expectations!  True to their name, they were able to Recover and Secure the Data I feared had been lost.  It isn’t inexpensive but miracles rarely are."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathryn M",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T17:00:35.000Z",
          "Titre": "SecureDataRecovery restored Everthing!",
          "Contenu": "SecureDataRecovery was able to restore ALL of my business & personal data from my WD MyBook External HD.  From the very start Elliot Fisher explained the process and kept me updated of the status.  In less than (2) weeks I had a fully restored BU of my data. Excellent Company - Excellent Customer Service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen N.",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T17:18:12.000Z",
          "Titre": "Timothy R. and SDR team",
          "Contenu": "Timothy and the team at Secure Data Recovery were very professional, responsive, and patient. The hard-drive failure and potential loss of photos and files was very stressful for me and they explained the process and the answered my questions about the data recovery. Timothy responded directly and the team was easy to work with overall. I would recommend Secure Data Recovery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al Carroll",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T16:59:14.000Z",
          "Titre": "What I appreciate about SecureDataRecovery was timely feedback.",
          "Contenu": "What I appreciate about SecureDataRecovery was feedback throughout the process and in the end the data it need recovered.  We often forget how important something is until it is lost.  You recovered important data that would have been impossible to regained."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel S",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T02:29:31.000Z",
          "Titre": "Great company!",
          "Contenu": "Recently my WD My Book stopped working and I was truly devastated and unaware of what fixing it would entail.  I reached out to Secure Data Recovery and a few other companies.  Jonathan from Secure Data Recovery was one of the first to get back to me.  He explained the process and offered his support in this very stressful situation.  He and his colleagues were all SO super helpful from start to finish and they were very quick to answer my questions.  This was heads and tails above what I was seeing from other companies, which is what made me choose Secure Data Recovery to do this work for me.  I am really pleased with the results and cannot thank Jonathan and his team enough for their care and assistance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff D.",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T22:29:16.000Z",
          "Titre": "Critical Data Recovery",
          "Contenu": "Secure Data Recovery was able to successfully extract critical files from a failed hard drive. The customer service was excellent (kudos to Scott) – clear explanations of the process and great communications from start to finish. If need arises again, would not think of using anyone else."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "O.J.",
          "Nb_Reviews": 2,
          "Date": "2022-08-18T17:12:09.000Z",
          "Titre": "Lifesavers for a lifetime of memories.",
          "Contenu": "We had a hard drive with years of important creative work that didn't have a backup alongside videos and photos that were extremely sentimental. One poorly unplugged moment caused the entire drive to seize. We breathed a sigh of relief when SDR was able to recover all the files. Worth every penny! The folks that work there were also very easy to work with and comunicate with. Val was attentive at every step of the recovery process. It was a positive experience from start to finish and I highly recommend their services for all your data recovery needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Skelly",
          "Nb_Reviews": 2,
          "Date": "2023-02-18T22:34:35.000Z",
          "Titre": "Successful data recovery",
          "Contenu": "Scott was very helpful explaining the process and the different options they offer.He kept me updated via email or phone call about the progress until the time the drive was shipped back to me.His instructions for accessing the drive were also correct and easy to understand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff B",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T02:24:01.000Z",
          "Titre": "I lost my data from my external drive…",
          "Contenu": "I lost my data from my external drive and I couldn't find a way to obtain my lost information. I found Secure Data Recovery via online search and they appeared to be a reputable company specializing in recovering data from external drives. The service rep was very helpful and walked me through every step of the process.  He had followed up with me multiple times and after a few simple steps, Secure Data was able to recover my lost information and 100% of my data was successfully recovered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd Clifford",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T19:57:05.000Z",
          "Titre": "The SDRS team successfully recovered my…",
          "Contenu": "The SDRS team successfully recovered my data drive after a raided NAS catastrophic failure.  The Team communicated frequently on the process.  The team recovered 100% of my data."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Kettner",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T23:01:23.000Z",
          "Titre": "Excellent service and communication.",
          "Contenu": "I was kept informed as to the status of data recovery from my hard drive. The information recovered was sent as a list of files that I able to review. Impressed and relieved with the data that was presented. I will use and recommend Secure Data Recovery in the future. Thanks for the services received."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kay Klaus",
          "Nb_Reviews": 2,
          "Date": "2022-10-18T20:10:41.000Z",
          "Titre": "Wonderful Service",
          "Contenu": "Secure Data Recovery Services was absolutely amazing to work with. I am a photographer and my external hard drive failed with photos I needed on it. I had checked with multiple places to see who could help me and Secure Data Recovery came to my rescue. They worked with me on cost, timing and were able to successfully recover all of my images for me! So very thankful for them and their team and would recommend them to everyone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trisha J",
          "Nb_Reviews": 2,
          "Date": "2023-07-13T23:52:49.000Z",
          "Titre": "When I knocked a full glass of water…",
          "Contenu": "When I knocked a full glass of water onto my computer I just couldn’t believe it!  Fortunately I found Scot at Secure Data Recovery in Portland and he took me firmly in hand and made me feel everything would be OK. He was wonderful and got me to a full recovery. If this happens to you, you need a Scot in your life. Thank you Scot."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Camille Radke",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T01:39:12.000Z",
          "Titre": "The communication with SDRS was…outstanding!",
          "Contenu": "The communication with SDRS was fantastic!!  Jonathan let me know step by step what they could do for me and received my permission every step of the way.  They recovered all my files from my failed thumb drive.  So grateful for that as I had photos of my deceased son on it...just so happy they recovered all my files."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JJ",
          "Nb_Reviews": 2,
          "Date": "2023-02-01T18:50:38.000Z",
          "Titre": "Got the job done right!",
          "Contenu": "Got the job done right!Secure Data Recovery is a solid company. One of the main reason for this statement are their people. This review is all about Scott McMacken and his great service and attention to detail.He was prompt in communication and got my dead drive''s data out in fantastic time. He went above and beyond to help me get my new physical drive as I was traveling for work and needed it shipped to a different location. It showed up on time and in great shape.I would recommend working with Scott and SDR anytime!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheng Chang",
          "Nb_Reviews": 3,
          "Date": "2022-12-04T14:58:41.000Z",
          "Titre": "Real dependable SSD recovery and understandable customer service",
          "Contenu": "My SSD in the laptop broke down due to some overheat. I turned to a couple of disk recovery companies, and securedata is the only one that received my case- maybe they are only one that is willing to tackle a solid state drive recovery. I heard SSD breakdown is hard to be fixed. In the end, they recovered 30-70% of our data (haven't verified all but a lot of key data were recovered), which is very, very impressive. Also, when I mentioned a couple of times that my budget is really unaffordable for the high price, they applied a slight discount, and allow me to pay over 10 payments. I am very grateful for their service, and is planning for them to receive my next broken drive to be fixed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol Macaulay",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T02:10:44.000Z",
          "Titre": "Dead computer coughs up data",
          "Contenu": "My computer decided to just not wake up one day. All preliminary attempts to revive it failed,  and I was afraid I'd lose irreplaceable documents. This company came to the rescue. I am so relieved to have the musical compositions, family videos, etc. etc. that I'd feared were lost."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex Zichettello",
          "Nb_Reviews": 1,
          "Date": "2022-10-16T18:39:16.000Z",
          "Titre": "Excellent work",
          "Contenu": "Excellent work. Secure Data Recovery successfully recovered my external hard drive data when I thought the data may be gone for good. Eric Dvorin guided me all along the way and was able to answer all of my questions. He was super responsive and supportive. I recommend this service to anyone in need of data recovery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cory Goble",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T19:04:16.000Z",
          "Titre": "Great customer service",
          "Contenu": "I rarely leave reviews, but I felt one was necessary this time. Secure Data Recovery was able to repair our external hard drive that had stopped working; it included numerous pictures from our wedding, first five years of marriage, work files backup, and more. Just as important as the repair itself, Scott was always available and helpful each step of the way with what I believe was the best customer service I have ever had with a company. We are truly appreciative and highly recommend this company to anyone in a similar situation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shaquaja Washington",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T22:35:57.000Z",
          "Titre": "External Hard Drive",
          "Contenu": "Eric was very helpful in seeing that I was helped quickly while still understanding the importance of materials on my hard drive. The turnaround time was really fast and they managed to save everything on my drive before it was too late. If you find yourself in this position with clicking sounds coming from your drive, act quickly. The longer you wait, the more data you may lose!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Kruljac",
          "Nb_Reviews": 2,
          "Date": "2022-08-21T21:47:24.000Z",
          "Titre": "USB Critical Data Recovery",
          "Contenu": "Had critical data stored on a USB that would not work.  Sent it to SecureDataRecovery to get the information retrieved.  Received most of the data although some        was lost and some I still need to rename and put in correct files.  Although more money than I had expected, the lost data was crucial to recover.  I appreciate the updates and support of Eric Dvorin, my Account Manager."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sylvia Sauer Trustee",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T00:43:02.000Z",
          "Titre": "Trust Dara Recovery",
          "Contenu": "I chose this company to retrieve data recovery.  I needed to find personal information that may be held within the hard drives relating to a trust, I have authority over as Successor Trustee of this trust.Secure Data  Recovery Technicians was successful in doing just that .I 'm very satisfied with the results  this company produced.  . It was a pleasure working with the technicians."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelly H",
          "Nb_Reviews": 2,
          "Date": "2022-08-24T19:33:18.000Z",
          "Titre": "Secure Data Recovery, trustworthy, professional",
          "Contenu": "Secure Data Recovery was timely and accurate in diagnosing my lost data issue. Precious, once-in-a-lifetime, photos were on a corrupted flash drive. Communication was quick and concise. I felt very comfortable sending my damaged storage device off for recovery. I was treated as though I was just as important as a high-paying corporate client. They recovered my lost data (photos) and sent to me on a secure USB drive.  Payment plans are fair and very helpful. Would highly recommend Secure Date Recovery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Teddy",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T23:28:00.000Z",
          "Titre": "Great Experience",
          "Contenu": "Secure Data Recovery was able to recover 97% of my 1 Terabyte External Hard Drive.  I thought the data was lost forever and left Hard Drive in a box in my closet for 5 years.  I was a bit skeptical at sending it out through the mail at first but I thought I'd give them a shot and they performed.  They were able to recover 97% of the data and transferred it to a secure hard drive before mailing it back.  Great Experience and Great Communication throughout! Thanks Secure Data Recovery...  Thumbs Up!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Schock",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T20:28:36.000Z",
          "Titre": "External hard drive failed",
          "Contenu": "When my external hard drive failed, I felt my world fell apart with personal information potentially lost.  My IT director recommended me to Secure Data Recovery and the team was excellent in addressing my questions, doubts, and worry.  They were able to fully recover my hard drive and my world was back to normal again.  Thank you Eric Dvorin for all your help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rowe",
          "Nb_Reviews": 4,
          "Date": "2023-04-17T01:46:05.000Z",
          "Titre": "Scott did a great job of my options in…",
          "Contenu": "Scott did a great job of my options in terms of cost.  The information was retrieved and saved successfully on my flash drive. Was able to upload onto upgraded version of quickbooks.  Service was efficient and done with quickness….👍🏼"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glenn Smith",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T15:21:10.000Z",
          "Titre": "Exceptional",
          "Contenu": "The entire process of retrieving all of the data on my external hard drive was a breeze. From the initial correspondence with Scott (my representative) to the receiving of the retrieved data to my home, it was a smooth and uncomplicated service. If I have any other situations similar to what I had to deal with in terms of lost data, I will without a doubt use the services of Secure Data Recovery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kate B.",
          "Nb_Reviews": 2,
          "Date": "2022-08-23T19:31:46.000Z",
          "Titre": "Recommend Secure Data Recovery",
          "Contenu": "The team (especially Jonathan) at Secure Data Recovery Services saved my butt and got all of my data back after I broke my flashdrive. They stayed in touch throughout the whole process, worked with me around my needs, and were quick and professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy Mark",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T21:18:39.000Z",
          "Titre": "Jonathan Nguyen and SDR experience",
          "Contenu": "After I lost my External HD used as a backup, I was in a panic.  From my first call to SDR and when I spoke with Jonathan Nguyen, I was calm.  The professional way he and SDR handled the recovery process was first-rate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fishel Brach",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T19:31:23.000Z",
          "Titre": "Great experience",
          "Contenu": "The customer service agent was very communicatve and the data recovery was much faster then told"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie S.",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T18:28:54.000Z",
          "Titre": "Photo recovery",
          "Contenu": "Had a really great experience! Eric was extremely helpful and knowledgeable and helped me get the data off of my broken laptop. Very timely and I’m so thankful. I now have photos of my kids that I may have lost. Would definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Moore",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T21:30:19.000Z",
          "Titre": "Amazing job guys.",
          "Contenu": "Randall Persons was very helpful and sympathetic to my situation.  All of our family Pitchers was lost.  Irreplaceable memories!  thanks to Data recovery and the grate staff we now have all of our memory's back.  Its been a easy experience and we was extremely satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kiran Deep",
          "Nb_Reviews": 2,
          "Date": "2022-08-25T21:58:06.000Z",
          "Titre": "My experience with Secure Data Recovery…",
          "Contenu": "My experience with Secure Data Recovery was excellent. Jake and the team were super responsive. Communication was fast. I like emails more than phone calls, they were great with emails. If nothing was clear, it was super easy to call them and clarify things. I would highly recommend them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Wood",
          "Nb_Reviews": 1,
          "Date": "2022-08-31T22:39:35.000Z",
          "Titre": "Secure Data Recovery recovered 93% of…",
          "Contenu": "Secure Data Recovery recovered 93% of our damaged external hard drive.  Jonathan did a great job of keeping us in the loop with each step in the process.  The customer panel was easy to navigate and pay invoices.  5 stars."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "warren white",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T02:15:31.000Z",
          "Titre": "A Lifesaver!!",
          "Contenu": "My iPhone locked due to not having enough space to do a backup to my computer.  Apple could not help but Secure Data Recovery unlocked the phone gaining me access to all the pictures and videos that I was told would be lost forever.  Was definitely worth the $ to get these back.  Would recommend their services to anyone!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thalia",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T15:25:33.000Z",
          "Titre": "Great service!",
          "Contenu": "Great experience from beginning to end. The staff was very helpful in explaining the process. The turn around time was relatively quick. They were able to recover most of my data and photos that I thought would be lost forever."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marquis Austin",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T18:26:34.000Z",
          "Titre": "May be expensive but if your data is priceless SecureDataRecovery is your choice",
          "Contenu": "Needed their services for recovery. Treated with patience respect care & professionalism.  Speedy shipping to them from you & back to you which they provide via a printable label. Can be expensive depending on your needs. Fast turnaround & good experience overall. I would definitely recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elias Veneris",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T15:14:01.000Z",
          "Titre": "Don't Go Anywhere Else!",
          "Contenu": "Don't Go Anywhere Else!! It was an extremely quick and efficient process in retrieving my information from my broken external hard drive. Highly recommend Secure Date Recovery!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rudy",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T03:55:03.000Z",
          "Titre": "SDR recovered 90% of my data",
          "Contenu": "SDR recovered 90% of my data, over 2T of graphics files, animations, game development files, and archives of personal and work related documents. They’re great. Jake, my contact at SDR was particularly thoughtful and kept me updated on the progress of the work. I recommend using SDR."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rose Mourdoukoutas",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T17:59:50.000Z",
          "Titre": "Excellent Customer Service- Thank you Scott",
          "Contenu": "Scott McMacken was ALWAYS available to answer any questions and or concerns. He followed up in writing as well as a personalized call- It was nice to speak to a Human!!I would recommend Scott McMacken and his team to all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Cole",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T14:08:46.000Z",
          "Titre": "Vital and necessary for me to continue Business",
          "Contenu": "This service was vital to keeping my business running after a fatal hard drive malfunction.  The cost of recovery outweighed the cost of the re entry of data.. It was a no brainer. We recovered 100% of the data we needed.  Communication was fabulous through the process.  I hope I never have to do it again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yeahhyun Cook",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T18:32:41.000Z",
          "Titre": "I am VERY happy with the level of…",
          "Contenu": "I am VERY happy with the level of ownership and customer-obsession Scott (M.) has shown in handling my data recovery case. Due to personal reasons, I had to expedite the process and Scott''s timely communications and customer-service really helped me feel comfortable going through the process. He is highly articulate, clear with instructions and supportive. If you are in need of getting data recovery service (especially if you are in a tight timeline!), connect with Scott at Secure Data Recovery - you will be in good hands."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel V.",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T19:12:44.000Z",
          "Titre": "Personal, efficient, responsive!",
          "Contenu": "SecureData Recovery made it very easy to get a quote and my data recovered. My representative, Jacob M. was very helpful and extremely responsive in his communication. I’m pleased with my data recovery and would recommend their services!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marti Dubose",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T05:26:21.000Z",
          "Titre": "Great communication",
          "Contenu": "Great communication! Very responsive and easy to work with from start to finish. Will definitely use them again as the need arises."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronda Flynn",
          "Nb_Reviews": 2,
          "Date": "2022-08-25T20:21:35.000Z",
          "Titre": "I was in a complete and utter panic…",
          "Contenu": "I was in a complete and utter panic when my external hard drive fell to the floor and my computer wouldn’t read it. But I found Secure Data Recovery online and they not only were able to successfully retrieve my data, they did it super fast!! Thank you so very much!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "meredith c",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T22:55:37.000Z",
          "Titre": "External Hard Drive Recovery",
          "Contenu": "I had a great experience with Secure Data Recovery. My external hard drive crashed and went to a big box chain for help… they said there was nothing recoverable. After a little research I found Secure Data Recovery and was able to ship the hard drive out the next day. I received prompt updates regarding my case from my rep, Timothy Rutan. He answered emails and phone calls quickly and helped walk me through the process. ALL of my files were recovered! Yes, it is pricey, but great piece of mind knowing I have all of my files back!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sharon Burke",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T18:48:00.000Z",
          "Titre": "People were very up front",
          "Contenu": "People were very up front. Kept me informed of progress and were very efficient at their job. I am very pleased to have all my documentation, family pictures and videos back. These are things you cannot replace. Thank you so much for the time and effort Daniel put into our memories."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rogers M.",
          "Nb_Reviews": 3,
          "Date": "2022-08-18T18:58:37.000Z",
          "Titre": "Awesome, Transparent, Quick Turn",
          "Contenu": "I was referred to Secure Data Recovery Services by a local provider who did not have a \"clean room\" operation to inspect my external storage media.I was very pleased with the quick response by Eric Dvorin prior to the initial assessment.  What was truly astounding that I received confirmation from Eric of full data recovery in 5 days of Secure Data receiving my media.  I was kept appraised throughout the entire process and recovered data being sent back!!!  Customer communications is essential...Secure Data & Eric have this mastered!!!!If I ever have other issues (hope not)  Secure Data will be the 1st call!!!-Stanley M."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timi Z.",
          "Nb_Reviews": 1,
          "Date": "2022-10-10T21:54:25.000Z",
          "Titre": "Data recovery",
          "Contenu": "This company was very helpful in retrieving my data off an old external hard drive. Customer service was fast in responding to questions I had. In addition, a discount was also negotiated and honored. The device was sent and received in very secure packages. Great job!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Esther Sury Gancfried",
          "Nb_Reviews": 1,
          "Date": "2022-08-31T23:37:32.000Z",
          "Titre": "THE BEST",
          "Contenu": "secure data is absolutely the best out there! they have the best skills and most amazing costumer service. They work quickly and efficiently and always update you with details about your case! I would definitely recommend this place to all!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phuong Nicholson",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T16:39:27.000Z",
          "Titre": "I found the service excellent",
          "Contenu": "I found the service excellent, the technician who took care of my hard drive was super nice and polite. Most files were restored from my ruin HDD. I really appreciated and highly recommended Secure Data Recovery to any individual or entity who wish to recover lost data from a bad disk"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Renee Huff",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T18:13:24.000Z",
          "Titre": "Can't Recommend Enough!!!! Don't hesitate, use SDR!",
          "Contenu": "Scott really helped make my experience great. He calmed my anxiety and assured me that SDR helps people all the time with data recovery. Thank you so much!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lewis G",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T04:19:15.000Z",
          "Titre": "Full Mac Recovery",
          "Contenu": "Back in April 2022, my Macbook pro would not stop restarting and In order for it to be fixed my computer had to be wipe clean. I had no back up or anything. Everybody was charging me so much money until I found Secure Data Recovery. They worked with me and I was able to get a full recovery of all my data. And to be honest, when I received my computer back from them. It started to work fine with no issues. I never even had to wipe it. Apple couldn't even figure out what was going wrong with it. I appreciate ya'll so much. I probably wouldn't even be Deejaying right now if it weren't for Secure Data Recovery so Thank you so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pamela A Miller",
          "Nb_Reviews": 3,
          "Date": "2022-08-18T16:50:06.000Z",
          "Titre": "scott was very helpful",
          "Contenu": "scott was very helpful. we were just sick when our hard drive stopped working. it had over ten years of grandkid pictures travel pictures and other family pictures. Secure Data was able to recover the pictures with great success. we now have a backup to this hard drive. Thank you Secure Data. i would highly recommend this very professional company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Francella B",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T00:37:39.000Z",
          "Titre": "Honest company",
          "Contenu": "Eric is wonderful to work with! Everyone in the company is very helpful with getting my questions answered. Although we did not recover 100% of my lost/damage items , I am thankful for the items that are recovered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Boyett",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T03:53:13.000Z",
          "Titre": "The Best!",
          "Contenu": "Smooth,easy, FAST!Highly recommend!! External HD was completely non responsive. SDR was able to recover 99.5% of my data! Amazing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nolan",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T18:30:33.000Z",
          "Titre": "The folks at Secure Data Recovery were…",
          "Contenu": "The folks at Secure Data Recovery were extremely helpful, providing fast service and responses. They recovered all of the data on my corrupted drive and returned it to me in a timely manner. Cannot thank them enough!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Grace",
          "Nb_Reviews": 3,
          "Date": "2022-09-05T20:38:13.000Z",
          "Titre": "Very professional from beginning to…",
          "Contenu": "Very professional from beginning to end!  Will definitely keep them in mind if ever in need of these types of services.  Great communication as well.  Many thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Rose",
          "Nb_Reviews": 1,
          "Date": "2022-10-01T02:51:26.000Z",
          "Titre": "Exceptional service",
          "Contenu": "I was recommended to Secure Data and from they answered the phone they were on point. I did not need to call any where else, as they worked to find a package that fit my budget and the turn around time was far less than what was agreed. They retrieved all my data and they kept me informed all the way. I am recommending Secure Data to anyone who needs their type of service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon",
          "Nb_Reviews": 2,
          "Date": "2022-09-02T18:58:59.000Z",
          "Titre": "Ironically...",
          "Contenu": "SDR - IF YOU ARE GOING TO POST THIS REVIEW IN ANY WAY PLEASE UNDERSTAND YOU ARE NOT AUTHORIZED TO USE MY NAME OR EMAIL ADDRESS OR OTHER PERSONAL IDENTIFYING INFORMATION.  THANK YOU!  I am a sole practitioner lawyer.  Ironically, I was in the process of \"cleaning\" my database in preparation for an upgrade to a cloud-based case management program when my computer CRASHED!  I was downright distraught! An IT friend told me about data recovery providers and I found SDR.  They were so informing, professional, responsive, and recovered ALL of my data (as far as I can tell)!  They were almost twice as expensive as the other companies I checked with, but their excellent handling of my case from the get-go caused me to think they would handle the data recovery as well.  I am so grateful for their excellent work!by  \"Relieved in Rancho\""
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt Kayne",
          "Nb_Reviews": 2,
          "Date": "2023-01-25T21:52:50.000Z",
          "Titre": "Great Data Recovery company",
          "Contenu": "Great Data Recovery company!  We got our hard drive data back faster than expected and with excellent results.  Thank you Scott for all the help and great communication!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ann Telly",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T11:17:52.000Z",
          "Titre": "Saved Years of Research",
          "Contenu": "As a researcher, I was horrified when overnight, two of the hard drives containing a lot of important research data on ALS had stopped working—the primary and the backup at the same time. Ouch! Unfortunately, as a college student and funding my own research, of course my college wouldn’t have any access to data recovery and certainly wouldn’t help for the cost.As panicked as I was, I found contact with Randall at this business and they walked me through the steps. I was skeptical at times because of all the conflicting things I’d read about data recovery. However, they answered all of my questions. They worked with me to figure out the best method for the issue my hard drive was having, and they were very accommodating.Now I know better. I’ll make sure to replace my HDDs every few years. A very expensive mistake, but we are one step closer to figuring out how to treat ALS! =) If ever this issue is to happen again, I won’t hesitate to go back to this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bonnie Fuller",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T01:45:44.000Z",
          "Titre": "Awesome Experience!",
          "Contenu": "My husband and I  reached out to you guys after he lost data for his work computer.  Jonathan was our customer service tech and he and everyone else we spoke to were very helpful. They were able to recover about 99% of his data. SecureData worked with our budget and we couldn’t be more pleased.  Would highly recommend to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TL Greenville, SC",
          "Nb_Reviews": 1,
          "Date": "2022-09-03T00:29:13.000Z",
          "Titre": "Fast service 100% recovery of a 4 GB…",
          "Contenu": "Fast service 100% recovery of a 4 GB drive that simply quit. Was supposed to take 2 weeks, I had my data back in 5 days from initial contact. Friendly and available to communicate whenever I had a question."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Abhay Salukhe",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T17:15:54.000Z",
          "Titre": "World Class Service",
          "Contenu": "My son is a PhD student and during a crucial stage during his research his six months old Mac computer would not turn on. His data was not backed up which meant that his was at risk of losing six months of critical research work. I reached out to Secure Data Recovery Services based on Google reviews. They were extremely professional from the get-go. Jacob Medina was the dedicated representative assigned to me. Whatever I can say about Jacob would not be enough. Jacob was very patient with me (inspire of me being a \"pest\") explaining me the data recovery process and the status of my data recovery. He very well understood how nervous I was about the outcome, but he kept me well informed at every stage. If there is any example of going \"above and beyond\" customer service, its Jacob. He shared his direct line as well as his cell number. He spoke to my son directly and helped him get his data back. Words cannot express my gratitude for Jacob.If you ever have a data recovery situation, I will highly recommend Secure Data Recovery Services and although I am sure everyone is an all-star there I would ask for Jacob if possible!!Way to go Secure Data Recovery Services you have set the bar very high for customer service. You're the best in business!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Heiman",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T16:02:32.000Z",
          "Titre": "I was saved from great peril",
          "Contenu": "I was saved from great peril. The 7TB on the drive that were almost lost would have meant awful pain; all that and in the middle of Christmas holidays to boot. The cost for recovery was better than all the other places I could find. I chose the option for the long slow recovery process because of the price. The drive arrived a week later with it looking all good & fine; even the new drive is correctly formatted for mac. I am Happy & Grateful for this Christmas Miracle!!!Thank You Scott- Paul"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Taggesell",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T18:18:45.000Z",
          "Titre": "SecureDataRecovery, We Would Recommend Them!",
          "Contenu": "SecureDataRecovery was very informative and responsive in handling the recovery of our information from our \"crashed\" hard drive.Their reply emails were very timely.We were able to upload the information recovered from the storage flash drive they sent us, recovering data from our bookkeepiing clients.While their service seems expensive, it is apparently within the normal costs for this service.We would recommend them to anyone who needs to recover data."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jill Hartley",
          "Nb_Reviews": 2,
          "Date": "2022-12-30T01:30:01.000Z",
          "Titre": "Jonathan Nguyen from Secure Data saves the day",
          "Contenu": "I'm so sorry this review is so late but last Fall Jonathan at Secure Data in LA was a total lifesaver.After a disastrous loss of data, he was magically able to restore all of my data."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Koch",
          "Nb_Reviews": 1,
          "Date": "2022-08-26T03:26:09.000Z",
          "Titre": "Excellent service and results",
          "Contenu": "My cell phone battery swelled up and then fried my phone with all my pictures and files. Secure Data Recovery came very highly recommended. They recovered all my files and pictures. I will use them if I need files recovered from any hard drive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CHERYL STARR",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T01:44:22.000Z",
          "Titre": "Great service and great results",
          "Contenu": "Great service and great results. Eric was well informed and helpful throughout the entire process. The service was a little pricey but in the end well worth it . Very pleased with the results."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam Miller",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T17:29:42.000Z",
          "Titre": "Scot was very attentive and sensitive…",
          "Contenu": "Scot was very attentive and sensitive to our data needs. He carefully explained every step. He went above and beyond our expectations."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jesse O'Brien",
          "Nb_Reviews": 1,
          "Date": "2022-10-09T21:43:33.000Z",
          "Titre": "Great results",
          "Contenu": "I had two people attempt to save my hard drive and fail. If your data is important do not hesitate to use SecureDataRecovery my data was shipped back exactly as promised.  10/10"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathleen Hays",
          "Nb_Reviews": 1,
          "Date": "2022-08-18T21:40:24.000Z",
          "Titre": "Eric Dvorin is tops with me",
          "Contenu": "Eric Dvorin is tops with me!  I couldn't have asked for a better service representative or experience.  I was terrified that the data would be lost forever. Eric remained in consistent contact with me, advising me of the process & relieving my fears.  This is the representative & company to choose for data recovery!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NC....",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T18:42:32.000Z",
          "Titre": "Saved by Secure Data.....Twice!",
          "Contenu": "This is the second time I have used Secure Data Recovery.  Each recovery has been worth it.  They have been able to recover all of my pictures from a SIM card.  I can't explain why I have such bad luck with my SIM cards but Secure Data Recovery has saved me both times."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Dreyer",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T22:51:12.000Z",
          "Titre": "Secure data recovery managed to recover…",
          "Contenu": "Secure data recovery managed to recover 100% of my videos and photos, 441 GB worth of professional basketball highlights even though the hard drive was physically damaged.  It only took about a week!  Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "IT Admin - 30 years",
          "Nb_Reviews": 2,
          "Date": "2023-02-13T16:31:48.000Z",
          "Titre": "No second chances.",
          "Contenu": "What can I say? 100% across the board. I have reached out to secure data three times to assist with recovering from catastrophic hard drive failure for my clients. Every time they came through with flying colors. All three times were servers, two times were raid 5 with SQL data and the other time was an SSD with VMs. The data on these drives is the lifeblood of my clients.There's quite a bit of tension in the air with my clients during that time. Going through IVR hell or waiting for emails just add to everyone's frustration. From the first call, through the stages of discovery and ultimately retrieval, Scott was always available by phone and email and expeditiously and accurately answered any questions and concerns my client had.Secure data did manage to retrieve all data necessary to help me rebuild three clients data infrastructure. When the first failure happened a few years ago, I called a few different places. Secure data was one of them. I knew I wasn't going to get a second chance with the data or this client(or my reputation). My gut instinct(and 20 years working with IT vendors) told me to go with Secure Data and I'm glad I did."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AG",
          "Nb_Reviews": 3,
          "Date": "2023-08-08T23:45:02.000Z",
          "Titre": "The customer service is amazing",
          "Contenu": "The customer service is amazing! I was called within minutes of placing my inquiry and every question I had was answered same day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shaun Aragaki",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T14:42:01.000Z",
          "Titre": "Great service",
          "Contenu": "My representative, Scott, kept me updated the whole time and provided excellent customer service. This company worked with me to get my files recovered which I am very thankful for."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ishkab",
          "Nb_Reviews": 2,
          "Date": "2022-08-20T22:17:44.000Z",
          "Titre": "Very worthwhile Recovery Services",
          "Contenu": "My 8 yr old Seagate external 1 GB drive finally died. I though it was just a corrupted header and attempted to manually access it myself, but no success.I contacted Jonathan N. at Secure Data and explained what I believed was wrong.  He asked specific questions regarding the drive which I answered.  Thankfully, he did not seem to be patronizing as some tech support agents are when asking questions and questioning my responses.  He was brief, professional and seemed to be understanding.When I asked him approximately how much it would cost, he did dance around a bit, saying it depended on the drive, the symptoms and the underlying cause.  He provided an email w/ a link to their web page and their available recovery packages, terms & conditions as well as pricing for the recovery packages.  While I did not expect low prices, I wasn't quite prepared for the actual prices.  To be fair, they did have an option to decline service after diagnosing for \"S&H fee\", of $28.00; small price to pay to know if your data is recoverable or not, esp if you decide to decline the service.Successful data recovery, excellent tech support & customer service.  Would definitely use service again if needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "IAN KRAVITZ",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T21:50:46.000Z",
          "Titre": "Saved my stories",
          "Contenu": "In May 2022, my Mac hard drive gave up. I couldn't boot up or access files. I'm an amateur writer and my stories were on there! I faced transcribing 18 stories, and rewriting 3. Plus other files I needed. Once I had my Mac fixed, with a new SSD drive and it was now working, I needed my files back!Secure Data Recovery was excellent, working with me as I had to get through a few bottlenecks. I wound up making payment through Amscot money orders, which was readily accepted.By my figures, they recovered 92% of all my files, including all the files that I really needed.This is a service that most of us hope they don't have to use, but I for one, am glad that they do. I would definitely recommend this service. Thank you Secure Data Services!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "cs",
          "Nb_Reviews": 15,
          "Date": "2023-10-16T21:50:40.000Z",
          "Titre": "MOST DEFINITELY!!",
          "Contenu": "I can't speak highly enough about this company and its staff.  Extremely remarkable.  They do what they say they are going to do - kindly and quickly.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim H",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T03:34:48.000Z",
          "Titre": "Photo Hard Drive recovery",
          "Contenu": "Secure Data was able to restore a huge hard drive I have with thousands of photographs on it. I would be happy to recommend them for hard drive recovery."
        }
      ]
    }
  ]
}