{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "seedtime.us",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Natalie Higby",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T23:36:50.000Z",
          "Titre": "It’s hard to use, glitchy, and doesn’t work as advertised",
          "Contenu": "It’s hard to use, all the seed types from the store aren’t available on the app. I regret my purchase."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T17:04:55.000Z",
          "Titre": "They offer no telephone support",
          "Contenu": "They offer no telephone support.  No refunds after 30 days First I was charged 59.00. Then I was charged 109.00.   I tried to cancel the only communication that I can find is an invoice  and I was billed on my credit card.    I called customer service. No one is answering the telephone so sent another email y cancel.    I have been told it is past 30 days and they will not issue a refund.  That is so convient.  .   They do not answer the telephone. And after 30 days they do not issue a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kelly Long",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T05:34:58.000Z",
          "Titre": "Unable to Access Videos",
          "Contenu": "I signed up for the sessions, after the 1st session, I had a death in the family, totally unexpected.  Had to go out of town and when I returned, evidently the time had lapsed for me to review them so I didn't get to learn much.  I did upgrade my membership which I thought gave me access but evidently not.  I would like to speak with someone to help walk me through access to the videos."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T23:44:17.000Z",
          "Titre": "I have not been able to access…",
          "Contenu": "I have not been able to access anything.Is there something I am missing in the way of accessing what I have already paid for? Please let me know, thanks!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Keith",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T16:04:12.000Z",
          "Titre": "4th out of 4",
          "Contenu": "Ordered from 4 seed vendors on the same day, same time. New York, Missouri, Utah have all arrived as of yesterday… waiting to hear from you all"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jayne Rogers",
          "Nb_Reviews": 4,
          "Date": "2023-02-16T16:35:26.000Z",
          "Titre": "Charged me full price for one of their…",
          "Contenu": "Charged me full price for one of their plans when the website clearly shows a reduced price. Email and text have gone unanswered. They are quick to charge your credit card."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MF",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T17:56:46.000Z",
          "Titre": "Subscription Disapointment",
          "Contenu": "I bought a subscription for the first time after using the platform for free for about 1 year. The payment request was $49 but then I  saw another $89 was going to be charged on my card. Payment was confusing & benefits were confusing- I had loads of questions about the limitations and pop-ups I was still getting when using seed time. I wrote an email requesting clarifications but the email I received did not help. I wished I had gotten a call or offered a phone number to speak with someone. After this, I may cancel my subscription...not sure the benefits I am getting from it. So disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T17:58:52.000Z",
          "Titre": "Seems like the program is in an early…",
          "Contenu": "Seems like the program is in an early development stage. I had expected a more robust product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Merle Langston & Russ Kelly",
          "Nb_Reviews": 6,
          "Date": "2023-04-30T17:15:39.000Z",
          "Titre": "Good at asking for money",
          "Contenu": "These folks are very good at asking for money and far less good at delivering on time. Commitments they make to paid subscribers are not always what they appear to be offering."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michaela",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T01:49:53.000Z",
          "Titre": "Access to educational materials",
          "Contenu": "I reached out with a concern regarding accessibility of educational material and the response was \"you did  not get an Elite membership\".  I responded back to the customer service person and have not received a response.  Here is my response to the initial contact from the customer service rep:Hi Hannah,I appreciate your quick response, however I have to tell you I am disappointed to learn now after I purchased the “Unlimited Lifetime subscription” that there are in fact “limits” to what I have access to.  During the online session I attended on 2/26 Paul said that we have access to the educational resources under the education tab - as a high school agriculture teacher and flower farmer THIS was perhaps the thing I was looking most forward to accessing.  I’m disappointed and frustrated, feel misled and quite honestly this is one of the reasons I don’t typically sign up for programs like Seed Time.  I hope that we can come to a resolution or I may be inquiring in how to cancel my subscription.Thank you,Michaela"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T13:51:15.000Z",
          "Titre": "When I paid for an upgrade I was able…",
          "Contenu": "When I paid for an upgrade I was able to us customize features once. When I tried to use them again the site told me I needed to upgrade. I list 27.00 plus I'm signed up to pay 13.00 a month. Not worth it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brenda",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T23:08:32.000Z",
          "Titre": "Help, I can't log in!",
          "Contenu": "I signed up for this and $17 for cheat sheets but it won't let me log in. I'm not sure what to do. Any ideas anyone?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carla",
          "Nb_Reviews": 2,
          "Date": "2022-03-02T20:39:53.000Z",
          "Titre": "Can't find your app.",
          "Contenu": "I like your program.   Finding it on my phone is another story.  I want to be able to pull it up quickly when I need to plan something.  If I google seedtime it shows a financial planning guru.  Not what I want.  How do I pull up your program?"
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Robert Baeyens",
          "Nb_Reviews": 5,
          "Date": "2023-12-03T21:38:47.000Z",
          "Titre": "109$/year (unlimited plans)  is very…",
          "Contenu": "109$/year (unlimited plans)  is very expensive for the core of the program= calendar, tasks, lay-out, journal (situation dec 2023) about seedlings only. It would be helpfull if one notes also at the latest when the upgrades will happen (seed inventory, seed records; seed analytics. Tasks are also limited: one cann't create another sort of taskfilter...+ one cann't print a montly task list ..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T16:18:50.000Z",
          "Titre": "Good information",
          "Contenu": "Good information. Too long, too wordy. Terrible time. September is harvest time. I was only able to listen to two sessions. Disappointed I couldn’t listen to more."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AJ",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T04:09:43.000Z",
          "Titre": "Disappointed / time wasted",
          "Contenu": "I enjoyed the individual Seedtime & guest personalities.  I was rather disappointed at how light the actual gardening information was. Winter gardening is a huge challenge for cold climates and with the exception of Eliot Coleman minimal detail was offered up.  I feel like way to much time was spent on the individual guests backgrounds during intro.  The guests were on for so short a time span it was almost worthless.  You mentioned early on that ginger would be discussed later in the week.  That never happened.  People turn in to these things to get real solid information.  I took time last year to watch a gardening series titled Grow Your Own Vegetables that offered up real useable gardening advice & techniques. I tuned into Seedtime series hoping to up my game and was quite honestly completely disappointed.  However, the gardening advise portion aside, the calendar+ Seedtime has produced is far superior to anything I have come across.  Useable for both home gardener & larger farming operations.  Kudos to the thought & execution you have put into that product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kim in Oregon, IL",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T05:05:16.000Z",
          "Titre": "The software is good so far",
          "Contenu": "The software is good so far - a bit primitive but better than anything I've found so far and if financing is found before current operational costs cripple the development/growth of the program, it has great potential.  There's so much that could/would enhance the software, it's mind boggling.The three day web cast wasn't bad but it wasn't great either.  The structure was too free form in regard to what I had hoped it would be - but like the software I think it will be more informative and structured as time goes on."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Megan",
          "Nb_Reviews": 1,
          "Date": "2022-08-15T16:37:06.000Z",
          "Titre": "Good - still buggy.",
          "Contenu": "Overall, really great tools here. The task list is very confusing for me still. Even after watching the video, I still don't understand how to use it effectively and that was one of the main reasons I bought Seedtime.The other thing that's not great is that it takes me at least three tries to get photos to save in journal entries and I just don't have time to keep retrying to upload photos, so that needs to be fixed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donna Lussier",
          "Nb_Reviews": 1,
          "Date": "2023-01-29T20:12:42.000Z",
          "Titre": "Not enough for my needs",
          "Contenu": "Need layouts, pics/icons of plants.No easy way to transfer an herb over to another garden. Need places to add more info:  ie. a place for the company you bought it from, a place to enter days seedlings emerged, ideal temperature, spacing, whether it needs full sun or not.  You only have crops, nothing for flowers, shrubs, and trees.  So not sure I will be using this program consistently."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JC",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T19:43:43.000Z",
          "Titre": "The program does the basics",
          "Contenu": "The program does the basics, calendar is handles the needs for general visibility into upcoming tasks. Tasklist seems to handle tasks, uncompleted tasks rolling forward and completed tasks. I would like to see and expansive plant encyclopedia with info on transplanting, direct seeding and potted plants that won't go into the ground. I would also like to see nutrition handling. When and what to fertize with an adaptive AI that asks questions and guides you forward with relevant suggestions based on responses to questions. Better training videos to help users take full advantage of the application."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T05:04:17.000Z",
          "Titre": "Be prepared for the upselling",
          "Contenu": "I like the basic program, from watching the introductory video and from just playing a bit with it.  It is easy to add a plant and see how to use the main features.  What was annoying was all the upselling that goes on before you even get your account set up.  The intro is that it's free and always will be.  No credit card needed.  But once you start to set up the account the upselling begins.  Buy this to get that feature.  Pay for lifetime access to this feature for only X dollars.  At one level I understand this.  But at another it just feels like a small con.  Not as bad as Elon Musk happily taking $15k from you on the promise of full self driving mode, but a little like that.  Too bad one can't get started on the program before one is bombarded with all the things you could buy to make your experience even better.  Keep in mind that I essentially haven't had any experience yet.  Can't I have at least one day, maybe even one week, before you try to convert a free Beta test into a revenue source?  I mean really, just give me a day."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sharon Baker",
          "Nb_Reviews": 1,
          "Date": "2022-08-14T16:56:51.000Z",
          "Titre": "I have high hopes for Seedtime",
          "Contenu": "I have high hopes for Seedtime. I believe it will be a really big help. Right now it feels confusing and also when I went to put in a new vegetable zucchini, I saw that they don’t have any zucchini. Bummer! But then navigating around the site was confusing to me. It might be that I’m old or it might be that it is confusing, not sure"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Will Billmeyer",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T23:54:59.000Z",
          "Titre": "More Good Than Bad, Could Use Some Improvements",
          "Contenu": "So far Seedtime has been more helpful than disappointing. I generally struggle each year when it comes to planning out my garden and when to do what so this has been perfect for that!My major complaint is that there are very few crops to choose from and making your own (which is almost necessary) is locked behind a pay wall.It's a little pricey to upgrade, but I understand that hst right now they need support. I would much rather donate (and honestly probably would have ended up donating more than what I'll pay to use if for a couple of months) than have a yearly subscription, which just doesn't seem like a sound choice for something you don't use for about half the year.My other frustration is that when making custom crops you are required to put in *all* of the information (such as days until maturity or when to transplant) immediately, which often takes a little research. It would be better if I could enter in more info later and just have the factors that require those bits of info limited until then.One of the reasons this is most frustrating is because this is *why* I would want to use Seedtime. I don't know when do to certain things and often information is more related to what the average temperature is than how many days until something is ready to transplant. If they could somehow add average temperatures to that algorithm, that would be wonderful and honestly bump the whole program up a tier above all the other spreadsheets and books I use to sort out my planting schedule.An additional feature that it could potentially benefit from is the ability to map out and visually plan your garden. That alone might be enough to encourage me to start using it earlier in the year than I did. I do see a lot of potential in this program but right now I don't see myself using it enough to warrant continual subscription. I may stay on just to support them, but right now it just lacks the ease-of-use that would make it better than other similar methods of tracking crops."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stacy",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T16:16:49.000Z",
          "Titre": "App is not worth the $ Buying seeds is great.",
          "Contenu": "I don't like the lack of crops I can add to the calendar. I purchased the cheaper plan and couldn't list most of my seeds. I plan to cancel."
        },
        {
          "Note": 3,
          "Lieu": "NG",
          "Pseudo": "Samuel Nelson",
          "Nb_Reviews": 2,
          "Date": "2023-11-05T23:32:59.000Z",
          "Titre": "Nice 👍",
          "Contenu": "Nice 👍But don't you think it's for lazy people??"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sharon Giunta",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T17:30:59.000Z",
          "Titre": "Wish it was easier to figure out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "shelley",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:36:02.000Z",
          "Titre": "could not get into my account and had…",
          "Contenu": "could not get into my account and had trouble getting a response from customer service.  finally i got a reply and she was great she found my account and got me all set up"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vinny",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T17:34:31.000Z",
          "Titre": "Looking Forward",
          "Contenu": "Really like it so far. Seems like it would help me plan and execute thins in a timely manner and delegate appropriate tasks. I am looking forward in the increase of crop varieties to such as herbs, flowers, and unique vegetables. Also, being able to write on the layout. freeform should also be a great addition. Adding a google screen shot as a separate layer would be a lot faster in setting up a custom layout of beds."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Smo Man",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T05:39:07.000Z",
          "Titre": "I’m still learning how to move around…",
          "Contenu": "I’m still learning how to move around in the app so far. See a few more we could use in the app. Like being able to add plants that are bought by big box stores and nurseries. Also under “TASK” having a task to water, fertilize etc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T20:18:20.000Z",
          "Titre": "Awesome app! Just add some more produce/vegetables",
          "Contenu": "Awesome app! Just add some more produce/vegetables and flowers, make it the wikipedia of how to plan and harvest thousands of items"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charmaine Miller",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T04:39:32.000Z",
          "Titre": "My garden plan has come to life",
          "Contenu": "My garden plan has come to life. I appreciate the learning experience with emphasis on keeping records which I need practice on. Again Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ester",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T17:00:13.000Z",
          "Titre": "Great tool!",
          "Contenu": "Seedtime is a great tool to help gardeners plan their vegetable and herb gardens. Overall, the program with the recorded webinars has taught me a lot. My only complaint is the 'salesiness' of the activities, buy now, buy more, if you want lifetime access, add another amount, etc etc. It made me feel that the main business was really getting subscriptions rather than helping gardeners."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Doug K",
          "Nb_Reviews": 2,
          "Date": "2023-09-10T19:12:40.000Z",
          "Titre": "On it's way to wonderful",
          "Contenu": "Four on the way to five. This recent start-up attempts to take much of the work out of planning for growing vegetables in larger home gardens and market gardens. You enter what you know: variety, your planting zone, when you want the harvest, etc., and the browser-based application fills in the rest, including seeding and transplanting dates and succession plantings to maintain an extended harvest. The new layout function currently lacks for tools, but It's getting better. The company has grand plans for added functionality, but Seedtime already saves me a lot of time in planning the garden year over other applications I have used."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peggie",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T04:11:43.000Z",
          "Titre": "I have just started using the seed time…",
          "Contenu": "I have just started using the seed time calendar. I like the seed starting/transplant schedules. It can be very overwhelming to a beginning gardener or small space gardener. I am using the plan for Winter gardening to try to grow greens thru to early Spring in zone 8b, NW Oregon. The information given with your selections as well as the advanced features and even customizing is great! The Garden planner and its interactions with the calendar I look forward to using though creating would be a headache as I use various ways to grow. Raised beds, in ground, pots, among my flower beds etc. Give it a try and see if you like it too!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frances Smith",
          "Nb_Reviews": 2,
          "Date": "2023-08-08T20:59:39.000Z",
          "Titre": "Well worth the investment",
          "Contenu": "There is some degree of a learning curve to get things set up. You have to be able to understand gardening terminology in respects to the specs for your seeds. Now that I have moved back home to a familiar growing environment, I can now concentrate on developing a plan using Seedtime to help track timeframes for planting for seedlings and sow direct vegetables. I will be able to create layouts for other planting areas around the house that are not vegetables. I used to struggle keeping track of varieties, when to start indoors, direct sow items, crop rotation and replanting for longer harvests. With Seedtime and a layout I will be more prepared for each year. Now to find the time to start setting everything up for next spring and grow from there."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Regina Cady",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T20:56:35.000Z",
          "Titre": "Seedtime has proven to be an invaluable resource.invaluable…",
          "Contenu": "Seedtime has proven to be an invaluable resource so far! They have taken all those tedious tasks we gardeners know have to be done but don't have the time or sometimes even the full knowledge  of what's actually needed, and made it easy! Well, easier, ha! Their passion is infectious and the programs are well thought out. Questions are responded to quickly and knowledgeably.  I look forward to their future ideas!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RB in MA",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T15:18:48.000Z",
          "Titre": "A garden tool for project managers!",
          "Contenu": "As someone who uses project management methodology in my professional life, Seedtime is a tool that speaks my language! I love having a tool that encompass everything I want as a gardener. Integrating calendars and tasks woth my garden library is a dream. And now that new features are being introduced,  such as the plot layout, it finally gets the last of my info off paper and into my hands. I really appreciate that i can walk the garden with phone/tablet in hand and check off my tasks, post updates to the journal, and confirm that I planted in the right place. I've used the free version for a while, but finally bought an unlimited subscription because the product brings real value to my life."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T17:26:39.000Z",
          "Titre": "The best garden planner ever !",
          "Contenu": "I love this program and can sit down and plan out my gardening and green house tasks in short order. what used to take days and many times getting side tracked into other aspects of gardening and just getting overwhelmed and not completing the plan. Making changes is a snap and is easy to add new crops. I look forward to future upgrades and working out the bugs,and the garden view upgrade coming  soon"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rob McClaine",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T18:27:39.000Z",
          "Titre": "Seed time is great, but with a few growing pains. I would still recommend.",
          "Contenu": "Seed time is great and seems to be advancing on some of its improvement goals. The only reason I don’t give 5 stars is, during the sales pitch it seemed like some of the advanced features were already available. Some things are still in development, but it seems like a good growing business, so I am willing to give them my membership $$ to assist the growth process. Hopefully the early adopters are treated well long into the future for that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Claire Geistfeld",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T04:01:57.000Z",
          "Titre": "Well-organized presentations",
          "Contenu": "Well-organized presentations, with a lot of useful information. Excellent guest speakers. The Dysingers are passionate about their projects, but within each presentation did tend to be repetitive. The replays don't show the chat, which was a useful part of each session, and they often referred to notes in the chat. Unfortunate, if you missed the live viewing!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roger Crawford",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T16:56:12.000Z",
          "Titre": "So far its been a pleasant experience",
          "Contenu": "So far its been a pleasant experience. Like the functionality of the calendar and am looking forward to the additional functions that'll be added soon. Really like the sorting function as it can layout tasks in a timeline fashion which allows better planning. I would like to be able to create a task (such as hardening off plants)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amylynn",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T21:21:11.000Z",
          "Titre": "Awesome Gardening Tool. . .",
          "Contenu": "I love this gardening organizing software that you created.  The email that was suppose to reach someone didn't and I had to go to Facebook to get someone to respond. As a business owner, that isn't the best policy.  That is why I am only giving you 4 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Catawba Farms",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T16:27:23.000Z",
          "Titre": "The concept is solid, and worth it.  Needs some updating.",
          "Contenu": "The concept is solid.  Some of the user friendly interface features are missing to batch control tasks.  There are some glitchy things like if you close out a task from 2022 it brings the category forward to show on the current year's calendar.  (which is annoying). Love the pre-populated crops. Please add more, and ADD flowers!  Manually entering 100s of flowers is not feasible.  Using shortcuts to get by until that is more robust.  Excited for layout.  We are currently using a spreadsheet we created to map out the plots that autocounts number of plants based on color coding and spacing criteria.  Would be fantastic if this had same feature in the coming layout tool feature so its all in one place.Ability to add a thumbnail image in each crop would be cool.  Not critical though.Bottom line. We use it and would recommend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert M.",
          "Nb_Reviews": 1,
          "Date": "2022-08-19T03:08:11.000Z",
          "Titre": "The Winter Garden Challenge and SeedTime",
          "Contenu": "I participated in the Winter Garden Challenge.  The presentation was very informative, but not very polished.  If they were presenting from an outline, they certainly didn't practice.  They did admit that this year (2022) was the first year for this presentation.  Their software does work and very customizable, less so at the free level, but still good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathryn Renshaw",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T17:49:50.000Z",
          "Titre": "Overall I find this software very…",
          "Contenu": "Overall I find this software very helpful. I do find that I have to use other to help me out, since I am still learning. But from what I understand they are trying to update the software to incorporate the features that I use with another software into theirs. So, I am excited to see what the future brings with them and hopefully just get down to one!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sc",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T23:02:43.000Z",
          "Titre": "Seeding scheduling is the most helpful.",
          "Contenu": "I  love being able to organize the garden seeding, planting, transplanting, and garden beds all in one place without having to lookup when to start seeding every year.  There are a few things that still need work, like being able to see what seeds will be planted where better, and making the mapping more interactive to use, but overall, I'm finding the app quite helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bethany",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T19:22:36.000Z",
          "Titre": "I love my garden section",
          "Contenu": "I love my garden section. Love the organization that puts everything together. I am still new at this. Not sure how to enter herbs to have them show up. Would love love if there was an app for iPhone and iPad. Not having limits my garden planning. I would love to not have so many plans other places. I want all to be in one place."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NANCY SOTO",
          "Nb_Reviews": 2,
          "Date": "2023-03-03T03:16:36.000Z",
          "Titre": "I like how easy it is to add my crops…",
          "Contenu": "I like how easy it is to add my crops and flowers to the calender and have a complete visual schedule of what needs to be seeded and when. I enjoy the task bar to keep track what was completed. I just started using it so I am hoping it will be as helpful for me as I anticipate  but so far so good. Just by playing around with it I have found things like being able to schedule secession planting ect. I have however noticed there were some crops and flowers missing from the list like strawberries and Holly hocks. However, this is very a minor issue in my opinion. I look forward to learning how to use all the functions of this wonderful tool."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 2,
          "Date": "2022-10-28T15:24:17.000Z",
          "Titre": "I have really just started using…",
          "Contenu": "I have really just started using Seedtime but like the flexibility of moving dates and planning. Better then the spreadsheets I was using. When they get the layout tool going it will make my drawing out my garden obsolete and planning much easier."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thom & Bev Walsh",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T04:55:07.000Z",
          "Titre": "Excellent information",
          "Contenu": "Excellent information.  Good guys who really want to help their fellow gardeners i think.  Could be a little more organized, but really, you are doing a wonderful job and I for one, cannot thank you enough for all you are doing for this community.  Of course I do wish your paid subscription(s) was way more affordable.  It really doesn't sound like you are in this \"for the money\", so a low nominal charge to everyone, would seem to me to have been a better way to go, and in the end, have generated the same amount of funds.  But it looks like you are trapped into the costs now as some people have dropped hundreds of dollars already.  But, I do appreciate your willingness to keep improving on the free products.  (Also, next time you have a 3 day event, give the BIG prize away on the last day, so one of the die hards gets it instead of possible someone who just stopped in for a min. or two never to return......)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tiana",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T04:02:36.000Z",
          "Titre": "Lots of good information given in…",
          "Contenu": "Lots of good information given in concise format.  Would like to have a more instructional step by step how-to section for those of us who need the \"For Dummies\" version."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "M.J.T.",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T15:38:44.000Z",
          "Titre": "I honestly haven't gotten around to…",
          "Contenu": "I honestly haven't gotten around to trying it out yet. Not quite there yet but I couldn't pass up on the lifetime membership! I almost certain that we will enjoy it though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sheri",
          "Nb_Reviews": 3,
          "Date": "2023-03-26T18:36:57.000Z",
          "Titre": "Good calendar- Needs garden design feature",
          "Contenu": "I really enjoy the schedule. It has been very helpful. I REALLY, REALLY, would like to see herbs in the plant options. I would also love to have a garden design option. I know that is a big ask but it would be awesome to be able to put my plants into a design and then be able to visually see the succession planting and transitions from Spring to Summer to Fall crops. That option would absolutely make this app TOP NOTCH!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "randall hermanson",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T02:10:16.000Z",
          "Titre": "since December i have been using this…",
          "Contenu": "since December i have been using this site for my garden planning. i like the review i get at many educational videos. i only wish for some of the programs that might be offered in the future. i am waiting patiently"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "linda salter",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T18:07:16.000Z",
          "Titre": "Wonderful time saver",
          "Contenu": "I was really excited about the add a crop feature, but after adding 6 crops it won't allow me to add more. I want to add flowers because I grow them in with my vegies and some are edible. So while this program is going to save me a lot of time, I still have to make up a planting chart. I only got Seedtime in January so there hasn't been a lot of actual use yet. I love being able to start each day by opening the program and seeing what I have to do in or for my garden on that day. Certainly beats the paper charts I have always made. Please think about adding flowers-an important part of most gardens. I'm in zone 9."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "S. HEadle",
          "Nb_Reviews": 3,
          "Date": "2022-08-29T16:16:22.000Z",
          "Titre": "Great program",
          "Contenu": "Takes a little time to learn how to work the program but it certainly is worth the time. Program is comprehensive in knowing when to start all your gardening tasks. Easier to use on a computer than IPad. Love the program and once all your crops are loaded makes a very useful timeline."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adam King",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T16:06:04.000Z",
          "Titre": "Good Garden Planner that is easy to use.",
          "Contenu": "Well laid out planner. Easy to understand. Wish it had some kind of notification system for when tasks come due and/or integration with Google Calendar."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christine",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T18:40:38.000Z",
          "Titre": "Making our journey so much easier"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer Markestad",
          "Nb_Reviews": 3,
          "Date": "2022-12-16T05:00:17.000Z",
          "Titre": "I really like the calendar and the…",
          "Contenu": "I really like the calendar and the ability to create succession planting easily.  So excited to be able to connect seeding to a specific location and vertical layer in my garden.  I could plant tomatoes in space A shrub layer and marigolds in space A herbaceous layer."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Melissa",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T22:04:44.000Z",
          "Titre": "This app has promise",
          "Contenu": "This app has promise. The layout feature could be improved by unlinking it from the timeline to just use space to plan plant volumes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Don Cadwell",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T04:55:48.000Z",
          "Titre": "the app is going great",
          "Contenu": "the app is going great. i am loving the ability to keep a journal and create a weekly task. do wish to be able to create a custom weekly task, but not a hug deal. also with there were dates to the next update to the system. saw the tab for what is coming next but no date to go with it. but being able to get all my seeds onto a organized calender is great, and be able to make many calenders is good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ashley Andrews",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T16:25:06.000Z",
          "Titre": "Great! I would love perennial support!!!",
          "Contenu": "I would love to see implementation of perennial plant care such as fruit trees, raspberries, blueberry bushes. It could include things like ideal pruning time, fertilizing time, harvest time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike J",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T19:05:25.000Z",
          "Titre": "Great support",
          "Contenu": "I like the support reaching out to me. Even though I've not had to use it the correspondence has answered questions I would have had. The training videos a very helpful. I love the ghant style layout for tasks. I can look into the future and see what tasks are due by day/week/month. I also love the journal. I can track why I did something. I can also track the progress of the crops. However, I was under the impression that the layout feature was already built in. I would love a visual. Doesn't have to be fancy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Borton",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T16:57:19.000Z",
          "Titre": "Use consistently entered data for crops",
          "Contenu": "The only input I have at this time is that certain advanced crop data should be carried forward when adding crops. An example of this is the Spring/Summer vs. Fall/Winter time period. It is July and all of my inputs are for the Fall/Winter garden. Yet I have to change this in the advanced settings for every crop entered."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cynthia Rollins",
          "Nb_Reviews": 2,
          "Date": "2023-03-07T23:48:59.000Z",
          "Titre": "All my tasks at a glance",
          "Contenu": "I love being able to look and see what tasks are due.  I wish I could remove a task, such as seeding, from just one crop.  There are several crops that I buy starts for, so I'd like to have that option.  I'd love to have a garden layout guide as well.  I'm still getting used to everything on the site, but it's great, so far!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 2,
          "Date": "2023-09-17T23:44:10.000Z",
          "Titre": "The organization is great",
          "Contenu": "The organization is great Seed times Trans plant times i love that Would like companion plant groups"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dena",
          "Nb_Reviews": 2,
          "Date": "2022-12-16T04:59:01.000Z",
          "Titre": "Having Paul actually show us how to do…",
          "Contenu": "Having Paul actually show us how to do various tasks. This is an outstanding opportunity for all kinds of gardeninf"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy Araway",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T00:18:12.000Z",
          "Titre": "Really useful sw tool",
          "Contenu": "Really useful sw tool, features being expanded based on real customer feedback.  Love these guys!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dena",
          "Nb_Reviews": 2,
          "Date": "2022-08-19T03:06:14.000Z",
          "Titre": "This is a very useful tool for all level gardeners.",
          "Contenu": "This is a very useful tool for beginning and advanced gardeners. I would like more levels for payment however this is a good beginning."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Todd Davis",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T17:03:46.000Z",
          "Titre": "I didn't realize I needed a garden…",
          "Contenu": "I didn't realize I needed a garden planner like this. I was depending on my garden layouts, but seedtime helps me establish my gardening priorities throughout the year with the added benefit of a journaling feature."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary Ellen Osterhout",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T04:40:11.000Z",
          "Titre": "Very clear instructions and tbe program…",
          "Contenu": "Very clear instructions and the program is very easy to use. Most importantly, it's going to save me so much time!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Blair McLean",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T19:10:09.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good. I have my plants added. I love the scheduling. When to prep, when to plant, when to cultivate. I expect that to be very helpful and when to expect harvest. great time markers to success."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 4,
          "Date": "2022-12-25T19:51:03.000Z",
          "Titre": "I really like this app",
          "Contenu": "I really like this app. I have all of my next year’s garden seeds on the app and I know when to see and when to plant. I wish they would just tell us the price up front instead of having all the add ons."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Samantha Olson",
          "Nb_Reviews": 2,
          "Date": "2022-12-18T19:41:57.000Z",
          "Titre": "No Flower or Herbs recognized in system",
          "Contenu": "I like the program as a whole. I just wish there were more plants recognized in the system Like herbs, flowers etc."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "KL",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T16:26:32.000Z",
          "Titre": "So Valuable",
          "Contenu": "This is working out to be a very valuable tool for me! keeping track of my crops has always been hard for me. This makes it so easy!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vincent",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T15:25:39.000Z",
          "Titre": "Extending the Growing Season",
          "Contenu": "You did an excellent job lining up guests presenters."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ann",
          "Nb_Reviews": 4,
          "Date": "2023-07-21T03:58:02.000Z",
          "Titre": "Winter gardening challenge",
          "Contenu": "This was informative, I like the cheat sheets and planting charts. The guests were good also. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jolly Hobbit",
          "Nb_Reviews": 2,
          "Date": "2023-03-27T23:25:36.000Z",
          "Titre": "Great App",
          "Contenu": "We use this site daily to keep track of the seeds we start, what needs to be done in the gardens."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debbie",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T17:28:24.000Z",
          "Titre": "The company greatly improved the…",
          "Contenu": "The company greatly improved the calendar view"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "From dentist to farmer",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T01:51:08.000Z",
          "Titre": "I think the soft ware has great potential I would recommend more live webinars to teach people more about it I learned a lot from the webinar that you did with Jill and Nate",
          "Contenu": "I think the soft ware has great potential"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom Luscombe",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T15:44:46.000Z",
          "Titre": "Great way to organize",
          "Contenu": "Excellent way to organize your plantings from seeding to harvest."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Teresa Walker Walker",
          "Nb_Reviews": 2,
          "Date": "2023-01-04T18:01:17.000Z",
          "Titre": "I would love if herbs were included",
          "Contenu": "I would love if herbs were included.  And maybe a place to map out the garden beds."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cary Mandeville",
          "Nb_Reviews": 1,
          "Date": "2022-02-09T14:20:53.000Z",
          "Titre": "Seedtime a great garden planner",
          "Contenu": "I joined Seedtime a couple of weeks ago and have been planning my garden with it. It is amazing in many ways. There are tips to help you with each phase of your gardening choosing varieties doing seed blocks cultivating and harvesting. One thing I believe that will be the most useful is the Task list dated by work for what needs to be done next in the garden. Paul one of the principles seems very excited and puts great energy into making this the best garden planner ever."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pam Brown",
          "Nb_Reviews": 1,
          "Date": "2021-11-27T16:10:56.000Z",
          "Titre": "It is an honor to be a part of…",
          "Contenu": "It is an honor to be a part of Seedtime. Gardeners helping fellow gardeners with experienced farmers as mentors. I have used other gardening apps, taken many gardening and farming courses, and was a member of the Washington State University Extension Master Gardener Program, Pierce County before moving to Oregon to start a farm. Always, there are things to learn. The calendar is a tremendous boost to my schedule management."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Lorraine C L Fenn",
          "Nb_Reviews": 1,
          "Date": "2021-11-30T16:06:22.000Z",
          "Titre": "The best gardening software ever!",
          "Contenu": "This is an excellent program. It has inspired me to make small changes that reaped great rewards! I garden in raised beds outdoors from spring through the fall, then indoors over the winter. There are videos and other resources to search through to resolve any problem you might have. If you can’t find an answer there, Paul will answer your question simply, obviously very knowledgeable and even make recommendations for products that will help you. He’s very smart and fast to respond."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Good Steward",
          "Nb_Reviews": 1,
          "Date": "2022-01-23T15:01:27.000Z",
          "Titre": "I turned weeks of planning into days of planning.",
          "Contenu": "Seed Time is, so far, the answer to my planning struggles. The interface is very easy to use and manage my multiple gardens with multiple beds through the many successive plantings. The journal has great potential for record keeping and team management in addition to just keeping notes that be filtered allowing me to correlate notes on specific  cultivars or tasks. Customer service is top notch! I get responses to my chat questions very quickly and they have an amazing system for product improvement. What was taking me weeks with my old system of planning, only took me a couple of days with Seed Time!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Talya Ann De Young",
          "Nb_Reviews": 1,
          "Date": "2022-05-01T15:26:48.000Z",
          "Titre": "I would really like it if there was a notes option",
          "Contenu": "I would really like it if there was a way to add notes to each entry. I like that I can add a custom label to each one but it would be really nice to be able to jot down a few notes about each plant."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 3,
          "Date": "2022-03-02T02:54:38.000Z",
          "Titre": "Seedtime is great",
          "Contenu": "Seedtime is great.  Four stars only because it is still a work in progress.  So far, every upgrade has added new and better features. Thanks to the Seedtime Team."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ret Talbot",
          "Nb_Reviews": 1,
          "Date": "2022-03-15T15:55:12.000Z",
          "Titre": "Just Starting Out but Impressed",
          "Contenu": "This is our first year using SeedTime, and we've been impressed with how it has helped with planning."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephanie Essary",
          "Nb_Reviews": 2,
          "Date": "2022-12-16T04:55:14.000Z",
          "Titre": "so much helpful information",
          "Contenu": "so much information, so many resources, and informative presentations"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Manon Frappier",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T04:37:50.000Z",
          "Titre": "Just love it"
        },
        {
          "Note": 4,
          "Lieu": "FI",
          "Pseudo": "Timothy Fubert",
          "Nb_Reviews": 3,
          "Date": "2022-05-25T14:33:58.000Z",
          "Titre": "Ordering here is very easy and…",
          "Contenu": "Ordering here is very easy and convenient. I recommend it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Derrek Westbie",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T21:04:04.000Z",
          "Titre": "I absolutely love this app",
          "Contenu": "I absolutely love this app. Yes, it has some growing to do (Pun intended), but the base structure of the calendar is absolutely incredible. Saved me so much time planning next years garden. They still need to add labels so you don't have to try and hover over every section to see whats being planted in that location. I would have given 6 stars if the option was there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wanderment Farms",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T16:56:18.000Z",
          "Titre": "Very quick to respond and help me out…",
          "Contenu": "Very quick to respond and help me out with my issues getting started on the program. It’s a really robust planning structure. I’m excited to use it for my market garden this year"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shelby",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:06:31.000Z",
          "Titre": "We have a huge school garden and…",
          "Contenu": "We have a huge school garden and Seedtime is what we've been needing! We are excited to see how well our spring garden does now that we have a planting schedule!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T00:12:11.000Z",
          "Titre": "What a time saver!",
          "Contenu": "Seedtime is an amazing platform! It gives me so much confidence and peace to have the seed/transplant/harvest timelines completely mapped out for my chosen crops. I upgraded to be able to create a garden layout too. This is so helpful to visually see how much space each plant needs and maximize the yield in my raised garden beds."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Morse",
          "Nb_Reviews": 3,
          "Date": "2023-12-02T05:24:28.000Z",
          "Titre": "I struggled with the sign up process…",
          "Contenu": "I struggled with the sign up process (likely user error) and each time I emailed Seedtime, I received an immediate reply with support. I also asked a couple of questions about the system and again, right back to me. Now, if they could just help me locate my green thumb…"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarina Pierce",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:42:51.000Z",
          "Titre": "Best investment for busy gardeners !",
          "Contenu": "This has been the greatest time saver already !!! I’m so so blessed to have been able to go beyond the free version but even the free version was amazing as well ! I have annoyed all 9 of my kids by showing them everything the program does and what all I can do and plan etc. lol they will one day appreciate it as much as I do ! Thank you for putting in so much hard work on this to save the rest of us so much on our end !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy Pettigrew",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T17:48:31.000Z",
          "Titre": "I am just getting started and exploring…",
          "Contenu": "I am just getting started and exploring what it can do. I wish there was a notation for what beneficials and companions work with each plant category since I am building my first vegetable garden and want to use natural methods as much as possible. I like the bed creation and trying to figure out how to create several beds throughout the yard that can be seen as a master plan."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Byers",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T17:56:46.000Z",
          "Titre": "So easy to use and detailed growing information",
          "Contenu": "I really am loving this software and it is going to make things easier as I am planning my garden for 2024. I love that it shows exactly when I should start seeds indoors, direct sow and harvest according to my growing zone. I will definitely be recommending this to my other growing friends and family. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T18:08:45.000Z",
          "Titre": "Seedtime is a must have app for…",
          "Contenu": "Seedtime is a must have app for gardeners.  I normally wouldn't spend money on apps, but after watching how easy it is and hearing about further development I chose to get in on the lifetime access while it was available.  Both my husband and I agree it is a worthwhile investment for our new 3 year old little homestead.  It makes it so I can see at a glance what we need to be working on this week, or any week of the year.  Can't wait for next grow season"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T14:21:18.000Z",
          "Titre": "You NEED this!!",
          "Contenu": "This is the tool I’ve been looking for!! Everything is in one place. Fast and easy. Anybody can use this!! Best Gardner tool!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T00:31:11.000Z",
          "Titre": "I just received your seeds in the mail",
          "Contenu": "I just received your seeds in the mail. I can't say much yet, but it was fast service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlotte",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T08:04:27.000Z",
          "Titre": "I especially appreciated seeing the…",
          "Contenu": "I especially appreciated seeing the variety of plans based upon varying garden sizes and the ability to interact with each night’s guests. The last guest provided the most relevant tips for all garden sizes in general. I look forward to reading his new book."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T18:05:12.000Z",
          "Titre": "Another Seedtime Win",
          "Contenu": "Lots of good information.  I especially appreciated when Edwin asked to have things repeated that simply went too fast for those of us not completely familiar with the software.  I did miss Luke, though.  Hope he is well."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Catherine",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T06:04:45.000Z",
          "Titre": "The Seedtime calendar is great",
          "Contenu": "The Seedtime calendar is great. Although the free version does not have an extensive list of vegetables or perennials, it does have enough to get started. Once you enter the vegetable and your frost dates, the program automatically plots the seeding, transplanting and harvesting time. It is vastly better then plotting yourself manually from the seed package."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenda Earle",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T04:48:54.000Z",
          "Titre": "Even the free account is great!",
          "Contenu": "I have only had a free account, but their planning calendar is wonderful.  Simple to use, well thought out, great layout.  Looking forward to digging into the additional features that come with a paid account"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald Sleitweiler",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T20:31:38.000Z",
          "Titre": "The Seedtime system is amazing.",
          "Contenu": "I have watched several Seedtime seminars.  The guest speakers always bring something special to the event, and the way Paul shows how you can tie in the seedtime system is truly amazing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T08:25:14.000Z",
          "Titre": "Everything I need in one place!",
          "Contenu": "I'm a new gardener and I need help with knowing what to do when. And I really want to know how to have nonstop ripe vegetables! I've been doing a lot of research but when it comes right down to it, I haven't learned how to keep good records of what I planted where and when it will be ready to harvest. So plants come up and I don't know if it's a weed or something I planted. Clearly I just need a great deal of help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T04:40:41.000Z",
          "Titre": "Worth it!",
          "Contenu": "Learning material is worth a subscription alone.  If you can catch one of their seminars and get a lifetime, do it!  They won't offer them forever.  Tools are great and their vision is awesome!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T04:02:41.000Z",
          "Titre": "The software is great and easy to use",
          "Contenu": "The software is great and easy to use. Also I received an excellent reply including 'how to' video specifically for a question i asked in the Seedtime Facebook community"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shannon Sikes",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T16:28:52.000Z",
          "Titre": "This is an excellent program",
          "Contenu": "This is an excellent program! The free version is excellent and the paid additions are worth every penny."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathryn  green",
          "Nb_Reviews": 4,
          "Date": "2023-11-10T05:25:55.000Z",
          "Titre": "This has been so helpful",
          "Contenu": "This has been so helpful. I have attended all of the webinars that have been offered. Not only do they offer gardening advice and suggestions, but along the way, I am learning how to maximize my use of the Seedtime app. This is truly a gift!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roseann",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T04:40:22.000Z",
          "Titre": "Great Program!",
          "Contenu": "Best program I have ever used to keep myself on target as well as get other information about plant health, soil amendment, etc...well worth it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joni",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T15:16:37.000Z",
          "Titre": "What a gift from above! You need this in your life.",
          "Contenu": "What a gift from above! The coordination of thought and function to create a continual harvest is daunting. The world moves so fast and furious that having tools at our disposal means we CAN make this happen. You 'see' us and we appreciate the continual tweaks and enhancements that actually leave us time to do the work and not just plan! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S. DALTON",
          "Nb_Reviews": 4,
          "Date": "2023-08-25T16:56:21.000Z",
          "Titre": "Very Fast Shipping & Germination",
          "Contenu": "On August 20, I planted Giant Winter Spinach, Seychelles Pole Beans, and Mammoth Melting Snow Peas, & they’ve already sprouted! I expect the Bull’s Blood Beets & Evergreen Bunching Onions to do fine based on how well the others are doing. Will start Mirlo Butter Lettuce & Space Spinach as a succession planting soon."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T00:39:57.000Z",
          "Titre": "As a newcomer and beginner to growing…",
          "Contenu": "As a newcomer and beginner to growing healthy food this program you have created is the best I've come across on all aspects. I wish I would've heard about this before joining the Market Gardener Master Class. Keep doing what you're doing and I'm looking forward to seeing where God leads you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T15:17:29.000Z",
          "Titre": "Ease of use, for tech savvy challenged, saves time, informative workshops",
          "Contenu": "I started with the Winter Garden Challenge. So glad I did! Paul and his dad had different guests at each workshop that gave valuable information on different topics. Up to that point I didn't know I could do a winter garden in the northern part of the country! I signed up for a free Seedtime account and was blown away at the ease of use! Especially for someone who is tech savvy challenged! I used it over summer and it saved me sooo much time and the videos taught me alot! Unfortunately I could only have a free account at that time. But that was ok because I was shocked at what you are getting at the free level!! I'm finally able to get a unlimited lifetime membership! I really wanted the garden plan! Also it's evolving and getting tweaked that in a couple of years it's going to have everything that you ever wanted or needed in an app!! It's only offered so many times a year so don't hesitate! Seedtime is worth every penny for what it is now and what it will be! Plus the additional workshops Paul and his dad do now and will do in the future are invaluable! Get an unlimited lifetime membership! You won't be disappointed!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T16:23:42.000Z",
          "Titre": "This program saves so much time and…",
          "Contenu": "This program saves so much time and energy, one can accomplish the tasks needing done in the time it used to take to get the paperwork out"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RJ from NC",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T00:24:20.000Z",
          "Titre": "Let's go year round!",
          "Contenu": "Good speakers at the sessions. I am now challenged to be a year round veggie gardener on a small scale. I'm ordering row cover material to cover two rows that are 30 feet each.Excited to start using all the advances in the Garden Planner to schedule tasks and take notes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald Sleitweiler",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T04:39:52.000Z",
          "Titre": "The introductory classes have been…",
          "Contenu": "The introductory classes have been educational. But also the invites for friends and family hav3 h3lped open more conversation at get together, like Sunday dinners."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harold Curtis",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T04:06:53.000Z",
          "Titre": "Seedtime: Outstanding!",
          "Contenu": "Seedtime is an outstanding product that continues to improve as it continues to develop. I currently only have an extremely small, garden plot, but I hope to greatly expand once I retire. Regardless, when I ran across Seedtime a while back, I bought into it as a way of supporting its development. The free version is enough to wet any gardener's appetite, and the paid version is simply incredible! Give it a try!I just finished Seedtime's \"Winter Gardening Challenge\" series. Inspirational! So many people with so much knowledge and experience giving of their time to help the rest of us better reach our goals. THANKS YOU!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Thorla",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T00:58:23.000Z",
          "Titre": "Seedtime beats PS5",
          "Contenu": "I just heard of Seedtime last week, but within 7 days, I was convinced to spend my hard-saved PS5 console fund on a Lifetime Unlimited account to support the continued development of this amazing project.  I started winter gardening last year by the seat of my pants.  This is absolutely going to 150% help me to be more efficient and amp up my winter garden game.  Not to mention what it will do to help me contain my spring and summer chaos, and keeping better records.  Playstation can wait.  :)  Looking forward to seeing what comes next."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Essy",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T04:06:30.000Z",
          "Titre": "Gardening made Easier",
          "Contenu": "If you want to make your gardening life 100X more efficient INVEST TODAY! I've paid for the program. Jill Ragan from Whispering Willow Farms promoted this on her channel. I've used it for a week and its already worth the investment. The how-to videos are amazing, answering my questions without even needing to use the chat. The help search feature is extremely helpful as well. Even the free version is an excellent investment of your time with so many useful tools. This program has blessed me immensely as it gives me time back with my family."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria P.",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T02:40:10.000Z",
          "Titre": "A Gardening Necessity!",
          "Contenu": "This has everything a gardener could possibly want, whether you are experienced or brand new. It's easy to use and navigate and help is always at hand. Love the educational aspect because you can never possibly know too much about gardening. Will work from any location and I couldn't be happier with this product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lana",
          "Nb_Reviews": 2,
          "Date": "2023-09-03T15:37:23.000Z",
          "Titre": "I LOVE Seedtime",
          "Contenu": "I LOVE Seedtime, especially the Calendar and Notes! I was unable to use Seedtime as I wanted this spring and summer, 2023, due to the death of a close family member. But I plan to plant a fall garden and use the calendar for that project.What I would like to see new in Seedtime is added functionality for using a greenhouse during summer and early winter months. I live in 5b and want to try gardening as early as possible in the spring and as late as possible in the fall/winter months. I want to use the calendar to help with that endeavor."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Zimmerli",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T03:58:57.000Z",
          "Titre": "Very Informative",
          "Contenu": "Very Informative. Great for those who want to be able to learn how to garden and provide for themselves and their family and friends. I've enjoyed their easy-to-use planner and through the Winter Growing Challenge, they have given me the motivation to go and get back out into my family's garden and start growing food for us to eat again. I'd Highly recommend this to anyone who is wanting to have a a successful garden and be able to enjoy fresh fruits and veggies all throughout the year."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy W.",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T19:08:41.000Z",
          "Titre": "Does everything but plant the seeds for you!",
          "Contenu": "Even though I am a highly organized person, I have struggled for several years to organize my gardening schedule. SeedTime has finally been the solution that works. It helps calculate and schedule all the tasks that I need to think about including succession planting, harvesting, fertilizing... it does everything but plant the seeds for you! I highly recommend you give it a try."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol M",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T19:04:59.000Z",
          "Titre": "Master Gardener finds SEEDTIME an invaluable tool",
          "Contenu": "I’ve been gardening all my life; I’m a master gardener and still find SEEDTIME so very useful. It eliminates the guess work: what I need to be doing and when. I’m confident that I’m right on schedule in terms of seed starting, bed preparation, transplanting out etc. With no stress that I’m too early or too late, gardening is now a relaxing fun experience again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim Alexander",
          "Nb_Reviews": 3,
          "Date": "2023-09-14T19:59:07.000Z",
          "Titre": "Difficulty managing garden tasks",
          "Contenu": "I’ve had difficulty managing garden tasks. Seeing my gardening plan in the seedtime calendar helps me understand why I have felt overwhelmed and why my vegetable productivity has been low. I’m very optimistic that improvement is coming soon thanks to what I’ve recently learned through seedtime."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheryl",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T20:29:23.000Z",
          "Titre": "Winter Garden Challenge 2023",
          "Contenu": "I participated in the Winter Garden Challenge 2023 and I learned a lot about what I could grow and how to do it in Zone 6a right into the winter.  They spent a lot of time going over everything and brought in excellent presenters and then spent an incredible amount of time answering questions.  I also participated in the VIP sessions and they were useful, too, especially if you had a specific question you wanted answered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kate",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T04:01:04.000Z",
          "Titre": "Learned SO much!!!",
          "Contenu": "Really amazing experience learning about winter gardening!!!  I am a novice to gardening and this course has not only helped me learn about winter gardening, but SO many helpful gardening tips in general.  I feel like I now have the tools I need to be a legit gardener and grow food for my family not only in summer, but all year long!!!  THANK YOU!!!  Also SeedTime is a truly amazing platform and I am super excited to use it and feel like I know what I'm doing :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken Ashton",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T12:58:33.000Z",
          "Titre": "Sold on the SeedTime Calendar...",
          "Contenu": "The SeedTime Calendar is an absolute amazing tool. No matter what experience level you have at farming this tool will save you time, headaches and make you so much more efficient at completing your gardening tasks. It is a powerful tool that, now that I have used it, I could not and would not do without it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shavon",
          "Nb_Reviews": 2,
          "Date": "2023-07-21T04:01:10.000Z",
          "Titre": "Big or small grower, you need this!",
          "Contenu": "First, you can tell this team puts so much time, energy and work into making the life of a farmer obtainable. Great platform of resources, knowledge and support. Instead of daydreaming they help you make it a reality. I look forward to using the tools given to GROW for my family, friends and community."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brittany",
          "Nb_Reviews": 3,
          "Date": "2023-07-30T16:07:47.000Z",
          "Titre": "Absolutely love the ease of this…",
          "Contenu": "Absolutely love the ease of this program! I have always struggled with mapping out plants in the garden. This has made days of sitting and researching/planning/sketching into hours. It’s also fun to nerd out and see all of the possibilities that Seedtime helps you create in your garden!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexandra Guglielmo",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T20:20:43.000Z",
          "Titre": "Useful growing information for all growers",
          "Contenu": "This is more a review of the valuable information Seedtime provides to its users, as I am not very app-oriented. But the winter garden challenge they just wrapped up was super helpful in directing me to resources I need for the next gardening season, as well as providing lots of time-tested wisdom from a handful of growers. Thank you for the wonderful free resources and keep up the good work! I look forward to seeing what y'all come up with in the future, and to purchasing from the Seedtime and/or Farmers Friend store. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Walton",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T02:33:50.000Z",
          "Titre": "An amazing and dependable tool",
          "Contenu": "This is an amazing and dependable tool. It makes planning your garden fast and enjoyable. I haven't run into an bugs, and they keep releasing improvements and new features. I just signed up for the annual subscription because I believe it's worth it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SB",
          "Nb_Reviews": 2,
          "Date": "2023-07-25T01:13:59.000Z",
          "Titre": "Great VIP package",
          "Contenu": "I had the free opportunity to try out the VIP package for 30-days. I must say that while I do like the layout portion it does need a bit more tweaking to it (which is probably already on the \"to do\" list at Seedtime). I was hoping that I could add text to the shapes instead of just renaming the shape (unless I just totally missed where that option is). All in all, I love it!As my 30-day VIP trial is nearing it's end, I unfortunately will not be continuing as a VIP member of Seedtime as I am unable to afford the yearly subscription. I will still remain as a free member and continue to utilize the planting planner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Catherine Zurcher",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T17:15:05.000Z",
          "Titre": "I was lost on how to start... they gave me a direction",
          "Contenu": "I'm a first time backyard gardener with a family of 6. I wanted to start transitioning to eating fresh vegetables. But, I had absolutely no clue where to begin. Seedtime made it so easy to customize what I wanted to grow. Then all I had to do was follow their directions of when to seed, how long to cultivate, and I'm looking forward to the harvest."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Golden Pond Gardens",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T14:54:48.000Z",
          "Titre": "Happy In Louisiana",
          "Contenu": "It is really helping me to become more organized. The initial set up is a bit tedious, but what isn't in gardening. Love, love love the schedule. We need to have something than can track our own seed inventory so we can automatically tell when it is time to re-order seeds. I say 4.5 stars and I want it added that I am very hard to make happy, very knick picky, very."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anne",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T13:44:14.000Z",
          "Titre": "Happy Flower Farmer",
          "Contenu": "I fell in love with Seedtime the minute I found them. Being a small scale flower farmer with a part time job it's hard to find the time to sit down with a calendar and figure out when to start seeds. Seedtime made it simple. I ended up getting the lifetime membership because I wanted more than one calendar, and to be able to put any type of flower I wanted on my calendar. It's simple to use, and they even have a place with frequently asked questions to help when something is a little confusing. Which I have used. I am definitely sharing Seedtime with my flower farming friends, because we could all benefit from this company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicola",
          "Nb_Reviews": 3,
          "Date": "2023-05-11T18:48:25.000Z",
          "Titre": "I am DELIGHTED with ALL Seedtime offers…",
          "Contenu": "I am DELIGHTED with ALL Seedtime offers; attention to detail, an easy-to-use structure that supports and optimizes my full garden management - WOW. This is the part of gardening that weighed me down and would fall short each year ~ \"when to sow seeds, when to plant, where to plant, logging for crop rotation, tracking times and dates, mapping my garden, task lists based on my timing and zones, and the list goes on\" ~  now with Seedtime it is taken care of. I am beyond grateful, I feel so partnered in my garden and opportunity for greater success. Thank you Seedtime."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff and Sheri Simmons",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T05:11:11.000Z",
          "Titre": "Informative",
          "Contenu": "Very informative and the fact that you CC (Closed Caption the video on YouTube was a great plus)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet Marsh",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T02:00:31.000Z",
          "Titre": "Gardening Magic!",
          "Contenu": "Seedtime is a game changer. No matter your level of gardening experience this is a must have. I can plan out my whole year of plants within an hour. The newest addition, layout allows you to easily rotate your plants between beds and see how your garden progressing throughout the year. 100% worth every penny. I use it daily!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dana Larsen",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T04:38:50.000Z",
          "Titre": "Helps me grow more food in my beds!",
          "Contenu": "This program keeps me on track in the garden and even allows me to keep picture references in the program."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roxy",
          "Nb_Reviews": 4,
          "Date": "2023-07-21T03:57:57.000Z",
          "Titre": "The SeedTime app is incredible",
          "Contenu": "The SeedTime app is incredible.  It helps me with every aspect of my gardening, from choosing plants, to seeding, transplanting, harvesting, planning, and growing through all seasons.  They've given a lot of  thought to this program.  I was doing everything with an Excel sheet, which was a lot of work.  SeedTime just cut my work from days to a few hours.  Thank you SeedTime!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Simply Sonshine Juliette Sasek",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T04:01:22.000Z",
          "Titre": "An awesome and extensive resource!",
          "Contenu": "This is an awesome resource for tracking and keeping records of my garden. I love the new layout resource for the paid members and having the seed store and other resources all together so I don’t have to run all over creation finding most of what I need. The calendar helps me remember, most of the time. I say most of the time because I have to remember to log on first lol. Also, whenever I’ve had problems, I can just contact them. They are pretty busy but always get back to me eventually and get it solved. Also, I’m so excited for upcoming updates that are in the pipeline and looking forward to being able to use those. Thanks Paul and Edwin and all the team and everyone else who has contributed to this beautiful program and learning experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mellie Smith",
          "Nb_Reviews": 2,
          "Date": "2023-04-05T03:55:43.000Z",
          "Titre": "This company is doing EVERYTHING right",
          "Contenu": "This company is doing EVERYTHING right!  Seedtime is amazingly well designed and thought out and coded.  It works!  And it is chock full of really helpful information as well and turning the most tedious part of garden planning into something really FUN!   The Seedtime People respond quickly to questions and are all really friendly and knowledgeable.  I highly recommend them to anyone who wants to grow their own food (and flowers) and do it well!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Penny Scarlett Jamison",
          "Nb_Reviews": 2,
          "Date": "2023-07-21T03:57:28.000Z",
          "Titre": "I am a beginner gardener looking to be self-sustaining",
          "Contenu": "I have been with seedtime for a couple years now and each time I have learned more and more. This will be my first time at the winter garden. I am getting all the information I need to get my totes, and planters set up to grow veggies that I planted my self for eating during the winter months. I will always be attending the sessions they have and will eventually be getting the unlimited lifetime account.  Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandy Smith",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T04:45:47.000Z",
          "Titre": "Revolutionary Ideas for a Life long Gardener",
          "Contenu": "I have always enjoyed gardening, but the Seedtime webinar provided revolutionary ideas to me.  At age 81, I need to be able to make to the most out of any effort, and I think my land, my time and effort is going to be much better utilized because of what I have heard and learned through this program.  Its been so enjoyable to hear enthusiastic people share gardening experiences, techniques and encouragement!  Thank you for opening this program to everyone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julia Vun Kannon",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T03:52:17.000Z",
          "Titre": "Creative and lovely gardening innovators",
          "Contenu": "Their product is very creative and innovative in the gardening space. A tracker/calendar/layout maker/journal all in one? And with more features to come! They run lovely webinars about their product and service. They are very responsive to the community, have many ways to engage, and are lovely people. They are very engaged in providing updates on development of their product and other new items."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RUTH M",
          "Nb_Reviews": 2,
          "Date": "2023-08-11T03:59:47.000Z",
          "Titre": "Growing A Winter Garden",
          "Contenu": "I had no idea you could grow a garden in the winter in Nebraska, but I feel challenged, yet confident that I can do a winter garden starting this year!  Seedtime's FREE webinar on winter gardening was fascinating and useful information every night of the series!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly Pearson",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T03:58:07.000Z",
          "Titre": "Winter Gardening Challenge",
          "Contenu": "This was my first experience with Seedtime. The Winter Gardening Challenge was amazing!! I'm still in the process of building my raised garden beds, but I am so excited to be able to use the abundance of knowledge that was poured out this week. Can't wait to see it in action!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Perry (Snap Shot)",
          "Nb_Reviews": 19,
          "Date": "2023-04-21T17:11:18.000Z",
          "Titre": "I joined free Seedtime about a year ago and now joined the full club!",
          "Contenu": "I joined Seedtime about a year ago on their free membership and very pleased with the planting, growth and harvesting calendar. I was getting ready and even purchased seed to get into this years growing season. I attended the free classes being offered about the products and their uses and was very impressed enough to join the ultimate package and I hope it covers everything now and added in the future. So far very impressed with everything and looking forward to the best garden in the neighborhood and sharing the excess with those in need. I know you will be blown away with everything Seedtime has to offer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 2,
          "Date": "2023-04-28T03:49:33.000Z",
          "Titre": "Great tool for gardeners!",
          "Contenu": "What a fantastic solution for anyone that is gardening.  This helps with planning, succession planting, ordering seeds, etc.  The master course is worth it too.  So much good info!  Get a lifetime sub if you find them available.  They are not always available, so snag one while you can."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenya Kingsbury",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T04:23:46.000Z",
          "Titre": "Taking Gardening to the next level",
          "Contenu": "I think this is an AMAZING product!  I started trying to calculate 'days to maturity', 'when to plant', etc manually on a spreadsheet and what a chore!  With Seedtime, I had everything entered and set for the season in just a couple of hours.  We're also doing succession planting of peas which are going very well.The next thing is planning our winter garden for the first time.  It's going beautifully and already have 3 trays of vegs ready to transplant.  I don't think we could have done a fraction of this without SEEDTIME helping with the where and when for the planting.  Very well worth the money!!  Thanks Paul and team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jen B",
          "Nb_Reviews": 2,
          "Date": "2023-09-22T11:19:38.000Z",
          "Titre": "Love this tool!!",
          "Contenu": "This was my first year using a garden planner and companion planting. Best harvest EVER! And the least amount of pest issues I've ever had! Very easy to use, definitely recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica Smith",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T04:39:16.000Z",
          "Titre": "Seedtime is helpful",
          "Contenu": "These are people who really care about their customers and actually supporting the dreams."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jen",
          "Nb_Reviews": 4,
          "Date": "2023-05-25T15:32:11.000Z",
          "Titre": "Great garden planning tool!",
          "Contenu": "I've been really enjoying this platform for helping me plan my garden. I wish I'd had it for this year, but I'm excited that I'll be able to use it for planning next year to stay on top of all the things I want to grow. I can't wait to see how this evolves over time. Anything that helps people grow food at home is a great tool for fighting the effects of our industrialized food system."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "June Holt",
          "Nb_Reviews": 2,
          "Date": "2023-04-28T05:10:17.000Z",
          "Titre": "fantastic garden/farm planning calendar of all time.",
          "Contenu": "I'm new to this program, only been using it  a very short time, but I love it already! it's a well rounded garden/farm planning calendar  with the ability to create your own crop category, crop variety it helps to know when to prep your beds/plots, when to start seed,  transplant or direct seed, days to maturity, harvest times, secession planting, along with first/last frost data integrated and so much more they say they have their sights set on creating an entire suite of garden/farm planning tools that will all seamlessly work together. I'm excited and blessed to use it. they just launched the ability to layout your garden/farm visually.  It's like a fine wine that gets so much better with time. Thank you Seedtime for a fantastic garden/farm planning calendar of all time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TROY M",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T15:51:43.000Z",
          "Titre": "I think the winter gardening challenge…",
          "Contenu": "I think the winter gardening challenge was informative. We gleaned a lot from the speakers. It would have been nice to get more of the questions answered. We asked several, but no one responded to any of them. I realize there were a lot of people online, but if there is some way the questions be addressed that would be nice.As far as the Seedtime is concerned, I think the software is great and I am excited to dig more into it. It is very detailed, so it requires some sit down time to learn it well. Hopefully, we will take some time soon to get on the nitty gritties figured out. The video clips are helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather Rosati",
          "Nb_Reviews": 2,
          "Date": "2023-04-28T03:52:02.000Z",
          "Titre": "Involved, thoughtful and efficient!",
          "Contenu": "I love how involved and thoughtful these guys are! Their product is fantastic, absolutely made with gardeners hobby and pro in mind! They have a real vision for their future product, it is wonderful to be along for the ride and reap the benefits of this program and everything they have to offer! Excellent webinars, great customer service, and a serious commitment to us gardeners. Thank you seedtime crew!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynett Peugh Falkner",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T04:03:51.000Z",
          "Titre": "The winter gardening course was packed full of valuable information.",
          "Contenu": "The winter gardening course was AMAZING! I absorbed an extreme amount of knowledge within a matter of days. I feel that I am ready to start my fall/winter crops now. While I am waiting on my tunnels to be built, I can watch the recorded live sessions. I will recommend Seedtime to all of my friends - even if they do not garden!! Thank you Paul & Dad Edwin!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charleen",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T16:09:43.000Z",
          "Titre": "Prompt response to questions within 24…",
          "Contenu": "Prompt response to questions within 24 to 48 hours.  Very helpful with how to guidance.  Continuing to work to improve an already great garden planner web app."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robin",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T16:44:35.000Z",
          "Titre": "Love the passion behind this family",
          "Contenu": "Love the passion behind this family. This isnt just a software program, it is a movement!This has taken so much confusion out of the garden planning conundrum, and is just the beginning of so much more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LaDonna Kirk Slate",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T17:17:07.000Z",
          "Titre": "Seedtime has taken the hard work out of planning my garden",
          "Contenu": "Seedtime has taken the hard work out of planning my garden. I just plug in the plants i want to grow and seedtime does the rest. It lets me know exactly when I need to be starting my seeds for transplanting or when to direct sow those seeds that will go right into the soil. It also lets me know when to transplant and it even tells me when those crops should be ready to harvest based on my growing zone. For someone like me who loves to garden but has lots of responsibilities that are not garden related this is a game changer. There is no more guesswork as to when to do a task, seedtime has it all laid out for me. Thank you Paul and Edwin for making it possible to grow the best garden ever without all the stress of wondering what i should have done differently."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T18:41:53.000Z",
          "Titre": "Great information all around.",
          "Contenu": "I really enjoyed hearing from all your guests and seeing a demonstration of SeedTime."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T22:42:18.000Z",
          "Titre": "It’s a lot",
          "Contenu": "I loved the information even though some of it was over my head. I appreciate the replays and slides. That really help to take good notes. I love the website. I am struggling though. I’m a new gardener. So trying manage my struggling garden and plan for fall and winter along with life has been difficult. Some days I think Im taking on too much but I really want to grow more food. The challenge has also encouraged me to take some calculated risks and not to take failures personal. To not quit but keep going."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah Martinez",
          "Nb_Reviews": 3,
          "Date": "2023-07-21T04:07:53.000Z",
          "Titre": "What an excellent experience!!!",
          "Contenu": "SeedTime app. I am still learning how to use the app but I find it highly impressive and lightyears beyond functional. So far, I'm learning to simplify my entries. It's obvious the motivation behind its development was love for humanity and appreciation for God's bounty-in-waiting. Having access to the help desk is a tremendous assist. Webinar. Every encounter with these master gardeners and farmers has increased my confidence and knowledge base. Thank you, Seed Time, for pooling this wisdom of incalculable value and creating a friendly and encouraging classroom."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "VICKIE",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T04:07:15.000Z",
          "Titre": "Seedtime rocks",
          "Contenu": "I love the communication that this company delivers.   They are responsive to emails and messaging with speed and consideration. Their product including the new layout plan are outstanding and very useful. I've been with them since their Kickstarter days and their lifetime plan is truly that. Thank you Seedtime."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Barker",
          "Nb_Reviews": 5,
          "Date": "2023-04-05T16:15:10.000Z",
          "Titre": "Outlook & Journals vs Seedtime.... No Comparison!",
          "Contenu": "I have used Outlook to put dates on my calendar for indoor seeding and direct planning of my vegetables each year as well as journals.  This is somewhat impersonal and annoying but Seedtime has made this not only more compact in one place but includes so many helpful tips and ideas.  Learning this software is so simple and fun and it is more like downloading a new game you can't stop playing!  The product support is outstanding and they respond quickly to all requests as well as things you would like to see in the future.  This is a must have even if you are a beginner and you will learn so much using Seedtime."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "joann coffland",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T03:59:57.000Z",
          "Titre": "Seedtime is so amazing",
          "Contenu": "All the information we received during this challenge was amazing.  The Seedtime program has helped me get my garden planned and ready for fall produce and even ready for next years garden."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Justselling Stuff",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T15:25:57.000Z",
          "Titre": "LOVE this program.  Confidence builder",
          "Contenu": "Having the schedule of seeding times and bed prep times as well as the transplanting schedule really makes it easy for me to feel confident to plant by seed.  I tend to buy starts because I haven’t had a good seedling start to any of my planting years.   Our gardens are huge so it’s been very helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy B",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T15:22:08.000Z",
          "Titre": "Loving Seedtime!",
          "Contenu": "I have just begun using the program and so far I am loving it. I am a new gardener in zone 6b. I used to live in SoCal where gardening could basically be accomplished year round ( not successful at all) but not here. The site let’s me know exactly when to start seeds, prepare the beds, cultivate and harvest, along with succession planting WITH EACH AND EVERY CROP!! I am also loving the “Classroom” videos. When I have had a question about using the program, all I have to do is ask and I get an answer quickly. They are so helpful at Seedtime! I am beginning to believe that for once I am going to be able to grow my own vegetables!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T15:48:56.000Z",
          "Titre": "Loved Winter Gardening webinar",
          "Contenu": "I LOVED your winter gardening webinar...I learned so much! The orders I've placed have been simple and arrived in due time. I'm looking forward to our future dealings!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KristinJ",
          "Nb_Reviews": 2,
          "Date": "2023-07-25T15:35:20.000Z",
          "Titre": "Like trying to drink from a firehose",
          "Contenu": "I am a kind of new to gardening and the winter garden challenge was just amazing. It was like trying to drink from a firehouse because everything was helpful!! I’m overwhelmed at the planning and coordination of leading experts who took their time to share their passion with us. I’m excited to say I’m all in for this winter garden and beyond! I’ve even reached out to our local co-op to get info on our particular zone. Hoping to have a garden full of greens and who knew strawberries can be planted in a winter garden? I’m thinking I feel brave enough to give it a try! Thank you Seedtime for helping me find a new passion!! Blessings to you all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alicia Kraemer",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T04:46:13.000Z",
          "Titre": "Such an incredible garden resource!",
          "Contenu": "Seedtime is hands down the greatest tool to help you plan and implement every aspect of your garden. I wish I had this years ago!  Thank you Seedtime!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah Spollett",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T03:51:39.000Z",
          "Titre": "I'm a beginner gardener",
          "Contenu": "I'm a beginner gardener, and was getting overwhelmed by keeping track of planting dates and garden tasks. I set out to look for an app that would help me keep myself organized, and Seedtime is exactly what I was looking for! It has made the process foolproof for me"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "clifford foley",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T04:34:36.000Z",
          "Titre": "Great presentation",
          "Contenu": "Great presentation! The demonstration of how the program works will provide me great statistical insights to best times to plant seeds or seedlings, best layout for optimal growth, historical crop rotation, flowering times for my honey bees and pollination times for each plant species; birds eye view of my home, garden, and orchard layout.... the skies the limit with what you can do with this app. I look forward to using this and I look forward to the future additions that will be added to further the experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "wayne schwiegerath",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T04:41:10.000Z",
          "Titre": "Enjoy seedtime",
          "Contenu": "Love seedtime, finally able to track my garden. just moved from Fla to NC and using seedtime to help me learn this new garden."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken Madland",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T12:24:08.000Z",
          "Titre": "Thank you Seedtime!",
          "Contenu": "As someone with a large garden I have found Seedtime to be very useful in planning and executing my garden. I look forward to all the planned updates especially support for perennial crops. If you ever have any issues the team at Seedtime is quick to respond to any questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rhonda",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T23:47:13.000Z",
          "Titre": "I love the whole \"Planting Calendar\"",
          "Contenu": "I love the whole \"Planting Calendar\".  It reminds me to do things.  It also has great video's.  I was looking at one today about tasks.  I've just been checking them off, but didn't realize I could enter the exact date, even if it was in the past. Great info!  Also, I misunderstood a detail regarding the \"layout\" option and they granted me the option anyway.  This is a great company and I've referred it to many of my gardening friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol C",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T03:58:58.000Z",
          "Titre": "Just did the winter garden challenge",
          "Contenu": "Just did the winter garden challenge. I probably won't use this year, but the wealth of information I received will transfer to next year's garden and may lead to a winter garden. Enjoyed all of the extra speakers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy  Page",
          "Nb_Reviews": 2,
          "Date": "2023-07-27T15:30:23.000Z",
          "Titre": "I can’t say enough!",
          "Contenu": "Seedtime and all involved are a wonderful, wholesome, faithful group of people. Their resources are so helpful and all encompassing.  It’s a one stop, thorough experience. I highly recommend it to all gardeners, beginners to experts!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Teela Scaff",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T17:32:51.000Z",
          "Titre": "Everything in one place! Mind saver…",
          "Contenu": "I absolutely love being able to plan and map out my garden, know what time I need to do each step (prep beds, plant, cultivate, harvest) everything in one simple FUN place. I can sit and play on it for hours at a time! Thank you seedtime!!! No more going between apps or drawing it out on paper. You're a true mind saver!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura from Pahrump",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T17:31:58.000Z",
          "Titre": "The patience they all had with…",
          "Contenu": "The patience they all had with answering (what is probably to them obscure questions) was phenomenal.  Repeating themselves for us all, responding to email and chat questions, and staying so positive in both voice and print ... awesome!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna Lee",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T03:54:57.000Z",
          "Titre": "Great product and great tutorial",
          "Contenu": "Great presentation showcasing all of the current attributes of the Seedtime program AND most importantly all of the additions coming soon to Seedtime. Good product now. Allows you to see what, when and how you need to start your gardening adventure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "glenna davis",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T04:00:46.000Z",
          "Titre": "This company is the Best",
          "Contenu": "Helping us small home growers fully understand the mechanics and thought processes leading into growing food. Speaking and showing all of us without making us feel ignorant or hopeless. Absolutely love this company and all who participated in teaching us and sharing their wisdom and knowledge."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sunni",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T15:23:56.000Z",
          "Titre": "Great software!!!",
          "Contenu": "Great software!  This is such an amazing program to keep all of your gardening chores and plans organized in one place."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathryn  green",
          "Nb_Reviews": 4,
          "Date": "2023-07-21T03:57:08.000Z",
          "Titre": "fantastic webinar- my second with them",
          "Contenu": "fantastic webinar- my second with them. Seedtime has transitioned my growing from paper and pencil to digital and has made keeping up with tasks and data much more efficient!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T15:24:39.000Z",
          "Titre": "Simple and easy!",
          "Contenu": "It is so hard for me to keep track of my seeds and when to start them indoors. This app makes it SO much easier! Based on my location it guides when to seed, when to direct seed as well as transplant and harvest. I can lay out my calendar and keep better track of my garden. Loving it!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicole",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T16:01:04.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "The staff returned my emails quickly when I had questions about seedtime. It's an awesome program and I can't wait to plan my cool weather vegetable garden....I plan to use it for my flower beds as well !!! It's an excellent tool and a must have for any gardener....thank you Seedtime for all of your hard work !!!"
        }
      ]
    }
  ]
}