{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "selltechs.co.uk",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mike Martin",
          "Nb_Reviews": 2,
          "Date": "2023-08-12T18:07:34.000Z",
          "Titre": "Terrible misleading company!",
          "Contenu": "I sold my Apple Watch Ultra online to Selltechs, it was collected from my house, when Royal Mail tried to deliver it it was refused and returned to sender without explanation, I’ve now received an empty envelope back with the contents missing, after speaking to Royal Mail it seems it was only insured for £150 for an item that cost me £819 and after finally getting through to Sell Techs they tell me it was only £100 which is a total lie. I’m severely out of pocket and there’s nothing I can do, After speaking to them once more and asking what they intended to do about it they replied take it up with Royal Mail and don’t phone this number again, avoid this company at all costs! I do have the original box with the serial number so will be reporting the theft to the police."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Cameron",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T14:03:43.000Z",
          "Titre": "Faulty but when I got them back they weren’t",
          "Contenu": "I sent my AirPod pros to them along with extra ear tips. When my AirPods got there I was told they were faulty and that I’d have to pay to get my items back. I knew they weren’t faulty as I tested them myself before sending them out and upon receiving my AirPods back…. Surprise surprise they aren’t faulty and work perfectly fine. Not only that, they also didn’t send the extra ear tips back and they stole the ear tips that were on my AirPods. The customer service was horrific, it was like I was talking to a rude friend rather than an actual business. I will update my review if they send my items back that they stole."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Rozzalin (Rozz) White",
          "Nb_Reviews": 2,
          "Date": "2023-06-07T16:07:14.000Z",
          "Titre": "It is important to keep in mind…",
          "Contenu": "It is important to keep in mind SellTechs recycle, therefore offering to buy your late model iPad Pro is a may not be in your favour and a waste of time and expense on both sides. If you are looking to sell a late model, in my case an iPad Pro 1st gen, consider battery health of your item, if you have used it well and the chances it is below the 80% needed to resell then Selltechs will not be for you. Mine was 69% and therefore deemed faulty. Other resellers will replace the battery for a compatible one, these retail at about £15 so not expensive, the issue is taking them apart which is why I did not do it myself. I thought Selltechs would do this, otherwise why have an option to buy such a late model? It is in otherwise great condition and works well. But no, I had to pay for its return. Please do not use this company if you have an older model. Communication was not great, it still says pending on my account even though I have it back. I had to chase them after it being delivered, those that state they got a quick response are very lucky, I heard nothing for 6 days and only got a response when I chased them twice."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mandie Knightley",
          "Nb_Reviews": 2,
          "Date": "2022-07-19T17:38:22.000Z",
          "Titre": "Appalling",
          "Contenu": "Appalling, told me my iPods were fake & then wanted me to pay to get them back - plus gave me some false information regarding my serial number! When I refused I was told that the costs would be on my credit file!! I should also add I have proof from Apple coverage checker that the item is not fake. Reporting to trading standards as a massive con artist company"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "James Griffith",
          "Nb_Reviews": 1,
          "Date": "2022-03-28T20:36:38.000Z",
          "Titre": "Not very tech savvy. Zero customer service",
          "Contenu": "I wouldn't bother if I were you. They had my laptop for a week and couldn't get it set up. I offered to help as I knew what the issue was then they blocked my number and stopped responding to my emails. I asked for them to send it back to me. After days of silence I asked as per their own policy to send it to me but they wouldn't pay for postage contrary to their own t&Cs. When i recieved it the problem was their Internet wasn't stable so I set it up myself and sold to another company with no issues..The guy who answers the phone is probably the rudest person I have ever spoken to. A quick Google of the company shows a string of failed businesses. So beware.Use these people if you want incompetence, zero communication and anxiety.I can't respond to their response directly. Feel free to contact me using the order ID1330046494"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ry",
          "Nb_Reviews": 2,
          "Date": "2020-12-22T07:18:55.000Z",
          "Titre": "Waste of time",
          "Contenu": "The person I spoke to on the phone was rude and impatient, hanging up on me while I searched for the order number... took me ten seconds.Said I had an issue with the iPad which was never there. Paid almost £9 to get it back.Sent my item to a different company who paid me the same day they received it."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Hayley Jayne Potts",
          "Nb_Reviews": 3,
          "Date": "2020-05-04T08:43:36.000Z",
          "Titre": "Scam Scam Scam Scam Scam Scam",
          "Contenu": "Scam Scam Scam Scam Scam Scam ! Don’t trust them,!! I sent a perfectly good iPhone 6s and received photos of a different phone and then requested a return in which they expect you to pay for..... and then advise if you get the wrong phone to report it to the police ! I will be doing so!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Caroline",
          "Nb_Reviews": 4,
          "Date": "2021-10-22T15:24:39.000Z",
          "Titre": "Con artists who will not pay for your…",
          "Contenu": "Con artists who will not pay for your product and then refuse to return it.Do not ever useUpdate on reply:I am awaiting to hear from their legal team on this issue. This is also not a fake account, I was just logged into my girlfriends account."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2021-07-02T21:21:30.000Z",
          "Titre": "DO NOT USE This company",
          "Contenu": "DO NOT USE. Disgusting company. Nothing wrong with my IPAD I sent them. They said there was. Offered £100 less than their website. The same also happened  to 3 friends. They have no intention of paying what you see online. I have asked 4 times for my iPad to be returned. It says returns are free on their website, but they are forcing me to pay for and send them a label to post it back to me. They are the most corrupt dishonest business I have ever dealt with. They ignore emails and phone calls too. DO NOT USE. They need to be shut down. I am reporting them to “ Trading standards “"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Emma",
          "Nb_Reviews": 9,
          "Date": "2022-03-31T12:58:38.000Z",
          "Titre": "Misleading information on website",
          "Contenu": "Misleading information on website. Rude customer service. Would not send back to me unless I paid them too. Have reported to trading standards."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Muhammad Sheikh",
          "Nb_Reviews": 5,
          "Date": "2021-10-04T19:51:25.000Z",
          "Titre": "BAD!!!!!!!!!!!!!!!!!!!!",
          "Contenu": "stop the cap, I requested to sell my air pods pro and i haven't received the sending parcel."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Simon  Harris",
          "Nb_Reviews": 4,
          "Date": "2021-09-28T02:47:59.000Z",
          "Titre": "Never got the money"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 4,
          "Date": "2023-11-14T14:49:51.000Z",
          "Titre": "Good service at the end but not enough…",
          "Contenu": "Good service at the end but not enough communication during transaction"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ian Gregory",
          "Nb_Reviews": 7,
          "Date": "2023-07-16T20:32:24.000Z",
          "Titre": "Communication",
          "Contenu": "Overall the service they gave was what they quoted.The only negative was there was no  communication from selltechs not even a email saying they had received goodsThey did pay what the quoted by midnight but again no communication they were going to do this"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Peter",
          "Nb_Reviews": 7,
          "Date": "2023-09-06T18:21:14.000Z",
          "Titre": "Quick sale",
          "Contenu": "QuickStraight forward"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-14T17:03:24.000Z",
          "Titre": "Generally good overall",
          "Contenu": "Generally good overall, and I got the money as promised. Some of the initial communication is clunky - I had requested a label be sent in the post and an email confirmed my 'sales pack' was on its way (whatever that meant). However nothing turned up and a subsequent email contradicted the earlier one and it was clear that a label was not coming. In the end I just used the supplied QR code at the post-office and they printed the label. Still had to buy a jiffy bag to put my items in though. The long and short of it is, just print off the label yourself or get the PO to do it via the QR code and you'll be fine."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Sam Edis",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T22:54:44.000Z",
          "Titre": "Did what they said, wasnt the 220 they quoted on the website but I'm not surprised this phone was busted lmfao",
          "Contenu": "Honestly, I sent an iPhone 11 pro max in with no hope of getting anything as this thing looked like it had been in a three year relationship with Chris Brown.... Honestly it looked like it'd been eaten and excreted by Optimus Prime after a dirty session with the Autobots.... Broken was an understatement, obliterated would've been closer to the actual state of this thing. I think if i tried to sell it through Facebook market place I'd have got decked by whoever turned up to buy it...Got offered £35, probably gonna go gamble it, they buy phones and they pay you, legit company, hopefully you can salvage something from thing, pretty sure there was a video of my ex gf jerking me in a mediocre fashion on there. cheers for the 35 bucks lads"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Simon Hebdon",
          "Nb_Reviews": 12,
          "Date": "2020-12-09T10:02:52.000Z",
          "Titre": "The best price offered, slightly slower",
          "Contenu": "I checked a few of these kind of companies and Selltechs offered the best price. It took a day or two extra (partly because Royal Mail were slow) but Selltechs received my parcel on the Monday and the money was in my account on Weds morning. Communications were a little slow hence the lack of 5 stars but im pretty pleased with the service."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "MRS YVONNE FINELLI",
          "Nb_Reviews": 4,
          "Date": "2023-04-26T19:57:34.000Z",
          "Titre": "On a previous order It was agreed to…",
          "Contenu": "On a previous order It was agreed to have postage requirements to me and received nothing. I sent 2 emails and never received any reply"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Kenny Drummond",
          "Nb_Reviews": 5,
          "Date": "2022-06-01T14:46:13.000Z",
          "Titre": "Easy process to sell my iPod",
          "Contenu": "Easy process to sell my iPod . Only issue was that my payment preference wasn’t available."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Donna Rabett",
          "Nb_Reviews": 5,
          "Date": "2023-01-10T15:00:38.000Z",
          "Titre": "Good company",
          "Contenu": "A good company to deal with, had my doubts but they came good.  Any queries they came back and said to call, happy with the whole experience."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Amanda",
          "Nb_Reviews": 7,
          "Date": "2022-12-02T09:40:58.000Z",
          "Titre": "Sent iPod air max in very good…",
          "Contenu": "Sent iPod air max in very good condition they said they weren’t and reduced the amount they would pay for them I wasn’t happy with that amount so asked for them to be returned which they haven’t so I haven’t had the money or had the item sent back to me so this company had stolen from me I tried calling them they answered my call and I told them the problem and they hang up on me and then blocked my number I am just going to email them and if I don’t have a reply within 24hrs I will be reporting them to the police for theftI received an email reply within a few hours asking me to call them which I did this time I didn’t have any problem getting through to them they explained that they hadn’t blocked me and had no way of blocking numbers and that there most have been some connection problem so I expect I was wrong about them blocking me. Anyway we managed to come to an agreement over price for my item and they have agreed to have my payment in my bank by this evening so now happy that we have managed to sort this misunderstanding"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Cathy alban jones",
          "Nb_Reviews": 10,
          "Date": "2022-07-29T12:47:55.000Z",
          "Titre": "Quick payment however no communication…",
          "Contenu": "Quick payment however no communication to say they had received the item or were processing it - have used other sites before this and expected to receive an email at least saying they had received and were looking at the item - can’t fault payment speed though"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Bel W",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T21:05:25.000Z",
          "Titre": "Easy, straightforward process - swift turnaround",
          "Contenu": "It was easy to find our products on the website and add them to the basket.  Prices quoted were comparable or better than other services available on the web.  Straightforward to print the label and take package to the post office and subsequently track the delivery to Sell Techs.  We received an email at 13:20 on 5th December stating \"Your account will be credited by midnight after payment has been completed\"; in actual fact payment was visible in our bank account at 10am on 5th December, so before this email was even sent to us. In terms of any improvements, would be good for Sell Techs to send emails confirming when payments have been made, then customers would have a clear idea when to review bank accounts.Service was swift, order confirmed 30th Nov at 16:43 - package sent, delivered, goods checked and payment received within 4 - 5 days including a weekend.Well done and thank you Sell Techs, we will be telling our friends and family how good the service was."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Victoria Ledinskaya",
          "Nb_Reviews": 8,
          "Date": "2023-12-06T12:47:46.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service, from start to finish. The account was credited very quickly after the product had been sent. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Zeenia",
          "Nb_Reviews": 18,
          "Date": "2023-11-30T14:00:22.000Z",
          "Titre": "First time using Sell Techs and was a…",
          "Contenu": "First time using Sell Techs and was a bit apprehensive. It couldn’t have gone smoother! Payment received within 5 days of sending the item and no hassles whatsoever. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Victoria Ledinskaya",
          "Nb_Reviews": 8,
          "Date": "2023-11-28T23:06:36.000Z",
          "Titre": "Smooth",
          "Contenu": "The whole experience was very smooth and everything worked as described. I got my refund immediately after the product was received by Selltechs."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Quango13",
          "Nb_Reviews": 18,
          "Date": "2023-11-24T19:26:43.000Z",
          "Titre": "Good trade in and very organised and…",
          "Contenu": "Good trade in and very organised and helpful people. Did exactly as they said they would and transferred payment very promptly.Would definitely use this company again."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mrs Davies",
          "Nb_Reviews": 4,
          "Date": "2023-11-15T16:20:34.000Z",
          "Titre": "Great service",
          "Contenu": "Great service! Sold a pair of AirPods, postage all sorted, dropped into post office Saturday morning, the money was in my account Monday night!! Absolute no- brainer, well done Selltechs"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Elisabeth",
          "Nb_Reviews": 8,
          "Date": "2023-11-23T16:45:19.000Z",
          "Titre": "Very positive approach and amazing that…",
          "Contenu": "Very positive approach and amazing that iPad was collected from my home without extra cost or hassle!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Nuala McKinlay",
          "Nb_Reviews": 20,
          "Date": "2023-12-07T15:33:47.000Z",
          "Titre": "Excellent service and super fast…",
          "Contenu": "Excellent service and super fast payment. Would highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sarah Cotton",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T10:31:37.000Z",
          "Titre": "I would recommend Selltechs to…",
          "Contenu": "I would recommend Selltechs to everyone, they do what they say. It's simple and effective. I am so pleased that I was able to sell my tech at a very good price without any problems. Would use them again."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr M Sutton",
          "Nb_Reviews": 17,
          "Date": "2023-11-18T16:20:11.000Z",
          "Titre": "Excellent service",
          "Contenu": "Despite delays by Royal Mail, once the iPad was received, it was processed the same day. It didn’t arrive at seltec till after 14.00. The money was in my bank account by 22.10. Could not have asked for better service. Will use again: o2 said it had no value and we buy any phone reneged on price for iPhone SE"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Chris",
          "Nb_Reviews": 10,
          "Date": "2023-10-19T08:41:02.000Z",
          "Titre": "It does as it says on the tin",
          "Contenu": "Good website. Easy to use the service. Cash was credited my account very promptly. Only thing to note is that when going to Royal Mail website to print the return label the company name is \"Sell Techs\" Missing the space means that Royal Mail does not recognize the company."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Chris",
          "Nb_Reviews": 10,
          "Date": "2023-11-20T08:17:57.000Z",
          "Titre": "Does what it says on the tin",
          "Contenu": "This company \"does what it says on the tin\". They were the highest bidder and service was perfect. Money arrived in my account the day they received my phone. This is 2nd time I have used Sell Techs. Really easy."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Consumer",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T15:26:42.000Z",
          "Titre": "Always a trusted company they do what…",
          "Contenu": "Always a trusted company they do what they say. The money is in my bank account. I would trust Sell Tech to always for used electronics. I have no problem writing a recommendation about this company"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John Beaumont",
          "Nb_Reviews": 9,
          "Date": "2023-11-17T18:27:59.000Z",
          "Titre": "Sell tech always do what they say they…",
          "Contenu": "Sell tech always do what they say they pay money for old electronic equipment"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mabel",
          "Nb_Reviews": 7,
          "Date": "2023-10-10T20:30:39.000Z",
          "Titre": "It was my first time dealing with…",
          "Contenu": "It was my first time dealing with Selltech, honestly l was pleased with the service sold my old phone with no issues, payment was received next day when they were satisfied with everything. Keep the good work thank you."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kelvin",
          "Nb_Reviews": 31,
          "Date": "2023-12-05T17:11:41.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service, very efficient, all sorted as promised"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T15:31:08.000Z",
          "Titre": "Good experience",
          "Contenu": "Good experience, sent them my Apple Watch and money was in my bank within 48 hours. Would highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Coral Fairbrother",
          "Nb_Reviews": 5,
          "Date": "2023-06-21T10:33:36.000Z",
          "Titre": "The best way to recycle your items",
          "Contenu": "I have recycled many electronic devices over the years but I found that using Selltechs has been the most quickest, easy to use site ever.  The quote they gave me was far more than any other site. Everything from printing label at home to seeing the money in my bank has been the most easy and quickest transaction.  I will definitely be using Selltechs again in the future."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alex Newham",
          "Nb_Reviews": 9,
          "Date": "2023-01-26T11:58:40.000Z",
          "Titre": "Very impressed overall with Selltechs!",
          "Contenu": "Very impressed, I sold my Ipad to them, good price, website process was easy, and Royal Mail 48hr Tracked Freepost Labels were produced very quickly and also sent via email.  After getting the item posted using my own envelope, I had my money in the bank with no issues about 3 days later.  After having regular problems with Mazuma, Envirophone AND Music Magpie, I think I will now stick with Selltechs."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lucie R",
          "Nb_Reviews": 16,
          "Date": "2023-10-04T07:44:11.000Z",
          "Titre": "Easy way to recycle old tech",
          "Contenu": "The website made it simple to determine how much I would receive for my damaged iPad. A prepaid label was provided and the amount was in my account 3 working days after posting it. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Douglas Lamb",
          "Nb_Reviews": 14,
          "Date": "2023-05-14T12:31:51.000Z",
          "Titre": "Promised Payment received within 3 days of initiating sale",
          "Contenu": "Extremely impressed with this company when I received an online quotation on sale of my old iPad.  Upon completing sale (online) received an immediate Royal Mail postage paid 48 hour tracking label and was able to arrange Royal Mail collect my iPad the following day.Two days later the iPad was delivered to SellTechs and, that evening, the agreed/promised sale price was in my bank account.Very fast, top notch service."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Rt",
          "Nb_Reviews": 26,
          "Date": "2023-03-09T14:37:44.000Z",
          "Titre": "Fantastic Service",
          "Contenu": "After having a bad experience with a different firm, I was a bit reluctant to try Sell Tech, but I have nothing but praise for them. They received my item late on a Wednesday afternoon, by 12 o’clock noon the next day, the money for my phone was in my account. Absolutely first rate service from beginning to end. No hassle at all."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lee",
          "Nb_Reviews": 3,
          "Date": "2023-06-21T21:41:47.000Z",
          "Titre": "As easy as 1,2,3",
          "Contenu": "got the quote (good price), got the prepaid posting label some hours later, sent the items, items received within 48 hours, money received 4 hours after that.Simple, painless, and exceeded all of my expectations"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John C",
          "Nb_Reviews": 4,
          "Date": "2021-10-29T10:26:12.000Z",
          "Titre": "Great Service",
          "Contenu": "Selltechs offered a better price than anywhere else and the requested postage label arrived within 48 hours. I dropped the package off at the post office on Tuesday, and payment received overnight for Friday morning. No quibble about the price or condition of the item, unlike other websites I have used before for other gadgets. Great service"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John Beaumont",
          "Nb_Reviews": 9,
          "Date": "2023-09-23T07:43:13.000Z",
          "Titre": "Trusted company selltech do what they say",
          "Contenu": "Sell tech do what they say they pay you for old gadgets They are a trusted company I received the money within 48 hours of submission to Sell tech. I will trust them again if I have an old gadget"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Graham Crisp",
          "Nb_Reviews": 29,
          "Date": "2023-02-02T14:33:51.000Z",
          "Titre": "Great service",
          "Contenu": "Great service and very good amount paid for my ipad and Apple pencil. Simple post free process. Couldn't believe how quickly the payment was made into my PayPal account. Would definitely recommend and use again."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 18,
          "Date": "2023-02-03T02:14:57.000Z",
          "Titre": "Excellent, efficient service.",
          "Contenu": "I was looking to see if I could sell two laptops as we had bought new ones. It took me a little while to work out the model numbers and dates as I didn’t find it easily. Once I found the information I needed I filled out the Selltechs form online. The guys were so helpful about how to send them. Once payment information was given to them, I was paid the same day. I will happily recommend them to family and friends."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kelly  McMillan",
          "Nb_Reviews": 4,
          "Date": "2022-08-31T20:20:20.000Z",
          "Titre": "Easy to sell my iphone",
          "Contenu": "Easy to sort out online. Printed postage label easily. Sent out on Friday and received money quoted online in my PayPal account at 6pm the following Monday,Will definitely use againOnly downside is there is no other communication other than the postage label being sent out"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "seanks",
          "Nb_Reviews": 7,
          "Date": "2023-10-17T18:21:28.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. Price as promised. Fast payment and so easy to arrange collection from home. Would deff use again. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Andrew Johnson",
          "Nb_Reviews": 16,
          "Date": "2023-10-03T17:17:57.000Z",
          "Titre": "Very easy and straight forward to deal…",
          "Contenu": "Very easy and straight forward to deal prompt payment into my account would definitely deal with again in future"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Stephie",
          "Nb_Reviews": 16,
          "Date": "2022-11-18T18:46:04.000Z",
          "Titre": "Excellent turn around",
          "Contenu": "Was first time using this company and after reading the reviews i decided to give them a go and sell my Apple Watch.The returning process was really easy, place order, print label and take to post office which is free.With in 2 day’s of me sending my watch the money was in my account.Was all straight forward and easy to use 👍very happy and would definitely recommend ⭐️⭐️⭐️⭐️⭐️"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-08-04T17:38:58.000Z",
          "Titre": "Good",
          "Contenu": "Good hassle free way of recycling old tech. Speedy email of postage details, and fast payment. I would recommend, and definitely use again."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Waqaar Mirza",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T15:29:21.000Z",
          "Titre": "This was an incredible service",
          "Contenu": "This was an incredible service, fast, and professional, they did what they said, paid the amount they said on the sales site, hours after it was delivered to them, I would recommend to anyone, the best place to sell tech. 10/10"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Anne Flint",
          "Nb_Reviews": 25,
          "Date": "2023-10-17T18:17:15.000Z",
          "Titre": "A pleasure to deal with, just brilliant",
          "Contenu": "Very, efficient and professional service. Instruction clear and precise. Would definately recommend this company and would use them again."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gary James",
          "Nb_Reviews": 7,
          "Date": "2023-08-18T12:47:40.000Z",
          "Titre": "Best price for my iPad on the internet",
          "Contenu": "Was offered a price of £100 for my iPad which was the best price I could find.They sent all the information by email so I could take it to my nearest post office and post free of charge.The day they received it I got paid out that night the originally offer of £100."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John Beaumont",
          "Nb_Reviews": 9,
          "Date": "2022-09-11T08:50:17.000Z",
          "Titre": "I recycled my iPad touch up Selltechs…",
          "Contenu": "I recycled my iPad touch up Selltechs no problem recycling the iPad touch except I put the wrong bank details on recycling form. Sell Techs contacted me to give them my correct bank details no problem the money for my item is in my bank account as promised"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Stacey Tasker",
          "Nb_Reviews": 25,
          "Date": "2021-12-02T07:42:24.000Z",
          "Titre": "Super-efficient and a very fair price :-)",
          "Contenu": "Service was really quick ie the sending of the  label to send the item to them, and the payment (on receipt of the item) was amazingly prompt! Also I thought they would probably reduce the amount, but they didn’t so really pleased as this was more than other companies."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Salwa",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T17:57:39.000Z",
          "Titre": "Very happy with the swift payment and…",
          "Contenu": "Very happy with the swift payment and responsive queries. Send out next day postage for my Iphone 12pro on Friday afternoon and received payment on Saturday evening. Highly recommend this Company."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Nicola Lewis",
          "Nb_Reviews": 8,
          "Date": "2023-01-09T15:20:20.000Z",
          "Titre": "Very easy process, highly recommend the service",
          "Contenu": "Very easy process, the company gives you all the required information when sending in items. Easy to use website to find your device. Quick payment. Would definitely recommend and use again if I have any items to sell."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Allen",
          "Nb_Reviews": 9,
          "Date": "2023-08-05T16:12:00.000Z",
          "Titre": "Faultless service",
          "Contenu": "Got a price for my iPad which was more than other companies. I sent it posted it ,using local post office, on Monday, the money was in my bank account on Thursday. Great service. Can’t fault it."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Roger",
          "Nb_Reviews": 13,
          "Date": "2023-09-12T03:00:41.000Z",
          "Titre": "Excellent and efficient smooth running…",
          "Contenu": "Excellent and efficient smooth running process from start to finish.No problems encountered at all.I would definitely recommend and use again!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tony Tinant",
          "Nb_Reviews": 4,
          "Date": "2023-08-09T22:15:06.000Z",
          "Titre": "Worked exactly as described",
          "Contenu": "Worked exactly as it was described. Royal Mail collect and money as per website offer in my account a couple of days later."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Samantha",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T12:26:41.000Z",
          "Titre": "Definitely use again",
          "Contenu": "Easy to use website. Was able to send my item via my own postage way to obtain a higher insurance for the value of the item. Item was received by them Weds later afternoon and money was in my account at 10:30pm same day. Easy process and would use again. Only thing I would say is that there was no communication to say received my item and all was ok their end. I only knew it was as money arrived."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Keith Buxton",
          "Nb_Reviews": 15,
          "Date": "2023-02-15T18:22:45.000Z",
          "Titre": "No hassle way of selling tech…",
          "Contenu": "No hassle way of selling tech equipment.I received a competitive price for my Apple Air Pods Pro (v1) and this company made it easy to send them with free postage.Would recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "JAMES",
          "Nb_Reviews": 7,
          "Date": "2023-07-18T14:25:10.000Z",
          "Titre": "A first class service.",
          "Contenu": "Best quoted buying price and easy free postage download. Despite delivery relatively late in the day, same payment, as promised. A completely impressive and pleasing experience. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Marcus Ardeman",
          "Nb_Reviews": 14,
          "Date": "2023-07-12T12:44:23.000Z",
          "Titre": "Amazing service",
          "Contenu": "Amazing serviceFound through a Google search.Placed order.Royal Mail arrived following day.Money in the bank within a two daysWould use again"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Consumer",
          "Nb_Reviews": 2,
          "Date": "2023-08-03T16:53:28.000Z",
          "Titre": "Sell Tech",
          "Contenu": "Sell Tech do what they say and pay money for old electronic equipment I would recommend Sell Tech as a trusted company"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2022-09-04T14:59:29.000Z",
          "Titre": "Amazing throughout",
          "Contenu": "Amazing throughout. Emails came through quick. I didn’t remove one item from my iCloud, they text message and emailed me and sorted the same day. The payment came through the next day after confirmation of receipt."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "L M Colquhoun",
          "Nb_Reviews": 15,
          "Date": "2022-10-26T20:40:51.000Z",
          "Titre": "Good price, paid in full. Great!",
          "Contenu": "Offered a decent price for my airpods. Postage was easy and collected from my front door and money was in my account the next day... Was skeptical as I hadn't heard of the company before but the reviews were good so I trusted them.. and im glad I did. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Davis",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T16:37:53.000Z",
          "Titre": "Very Satisfied",
          "Contenu": "Aside from the delay in getting the device to selltech, which was partly due to royalmail’s strike actions, everything went pretty well. I Got paid the same day item was delivered to them."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Stephen jims",
          "Nb_Reviews": 8,
          "Date": "2022-04-29T19:10:41.000Z",
          "Titre": "Didn't want to go to cash converters…",
          "Contenu": "Didn't want to go to cash converters found these guys on internet found them there good give me good price so happy and done fast thanks guys"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Richard Kent",
          "Nb_Reviews": 22,
          "Date": "2023-04-04T19:00:08.000Z",
          "Titre": "Overall a very Quik and easy process",
          "Contenu": "Overall a very Quik and easy process, from the initial online form to the really quick payment directly into my bank and the best price paid."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T15:20:00.000Z",
          "Titre": "Would highly recommend",
          "Contenu": "Would highly recommend! Money was in my bank in two days, really quick service. Initially sent to we buy any phone and they were shocking said they’d pay less than original value so asked for phone sent back."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michael Taylor",
          "Nb_Reviews": 12,
          "Date": "2023-04-29T12:24:55.000Z",
          "Titre": "Everything was dealt with as…",
          "Contenu": "Everything was dealt with as advertised. Absolutely no problems and money was paid into my account when promised. No problems."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Marie Dannatt",
          "Nb_Reviews": 11,
          "Date": "2023-06-08T08:45:15.000Z",
          "Titre": "EXCELLENT  Your quote is honoured",
          "Contenu": "I was a bit dubious at first as previously the quoted amount is dropped.  With you I received the quoted amount within a day of you receiving ipad.  WELL DONE"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Keith Hill",
          "Nb_Reviews": 5,
          "Date": "2021-11-09T13:49:48.000Z",
          "Titre": "Sold my Apple pod on Friday",
          "Contenu": "Sold my Apple pod on Friday, posted it on Saturday. Selltechs received it on Monday at 11:24 and the money was in my bank account by 20:30 on the same day. No hassle, no quibbling, a very happy customer"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ashley Orme",
          "Nb_Reviews": 1,
          "Date": "2022-04-08T11:26:41.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Sent my item Tuesday, got paid for it Friday. Great service, great company to deal with. What more can I say? Great customer service and, experience all round. Will use this company again if I need to sell any tech stuff again. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "JOSHUA",
          "Nb_Reviews": 3,
          "Date": "2023-08-29T16:06:07.000Z",
          "Titre": "U are professional and very…",
          "Contenu": "U are professional and very knowledgeable in what you do. Above all very trustworthy."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Becky OPS YSB",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T11:05:54.000Z",
          "Titre": "First class service",
          "Contenu": "Very impressed from start to finished. Sent my ipad off and received the money back the following day.Would highly recommend this Company."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "JOY",
          "Nb_Reviews": 11,
          "Date": "2023-03-03T15:26:28.000Z",
          "Titre": "The website was very easy to navigate",
          "Contenu": "The website was very easy to navigate. The price offered was honoured by SellTech. They were quick with payment once my Tech had been sent. My iPad had been updated several times and to be offered a price was so good."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "sharon page",
          "Nb_Reviews": 4,
          "Date": "2023-04-19T11:50:12.000Z",
          "Titre": "Great set ice",
          "Contenu": "Great service. Posted item with post office label and received payment promptly. Will definitely recommend and use again"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John Beaumont",
          "Nb_Reviews": 9,
          "Date": "2022-10-18T16:25:13.000Z",
          "Titre": "I recycled my iPhone using Sell Tech…",
          "Contenu": "I recycled my iPhone using Sell Tech and found the whole process easy to use I would recommend this firm they did as they promised"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mosope Adeyinka",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T12:32:52.000Z",
          "Titre": "Amazing!",
          "Contenu": "Fast and efficient work from Sell Techs. I will definitely use them again if I need to - honestly very pleased with their service and response."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sharifuz",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T22:19:10.000Z",
          "Titre": "Very easy to sell and send the item and…",
          "Contenu": "Very easy to sell and send the item and getting payment for the item you sold to them. The price you get from them is very good then anywhere else's. Very happy with the service they provide."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T23:05:44.000Z",
          "Titre": "Straightforward and efficient process",
          "Contenu": "Straightforward instructions on website. Easy to value item and arrange for free postage. Speedy payment."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "CB",
          "Nb_Reviews": 10,
          "Date": "2023-02-21T18:59:43.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. This company did exactly what it said on the tin! Would definitely use again. Many thanks."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T15:37:07.000Z",
          "Titre": "Quick turnaround despite postal…",
          "Contenu": "Quick turnaround despite postal strikes. Gave me the price quoted without any issues. Highly recommended"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John Beaumont",
          "Nb_Reviews": 9,
          "Date": "2022-04-30T13:23:27.000Z",
          "Titre": "I sold my iPad to SellTech and found…",
          "Contenu": "I sold my iPad to SellTech and found the whole thing very easy to use I received the payment within 2 (two) days as promised by their website I recommend SellTech"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Darren",
          "Nb_Reviews": 14,
          "Date": "2023-09-14T11:43:23.000Z",
          "Titre": "Decent price",
          "Contenu": "Decent price, easy to follow instructions. All good in my opinion."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Anup Bansal",
          "Nb_Reviews": 10,
          "Date": "2022-07-01T16:31:34.000Z",
          "Titre": "Simple and easy from start to finish",
          "Contenu": "Simple and easy from start to finish. They kept to their price promise and paid within the timeframe the website states. Would happily do business again"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ash",
          "Nb_Reviews": 10,
          "Date": "2022-08-24T17:23:43.000Z",
          "Titre": "Competitive quote and paid the price…",
          "Contenu": "Competitive quote and paid the price they offered. It was really easy to send the package to them and payment was made the same day the parcel was received."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ian Michie",
          "Nb_Reviews": 31,
          "Date": "2023-11-09T00:32:55.000Z",
          "Titre": "Selling made easy",
          "Contenu": "Easy to check the value of the item and arrange postage."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paul",
          "Nb_Reviews": 4,
          "Date": "2021-12-14T17:22:27.000Z",
          "Titre": "First class service",
          "Contenu": "The offer price for the phone that I was selling was competitive, the online sales process was straightforward, and best of all the agreed sale proceeds arrived in record time. It would be very difficult to improve on the customer experience overall."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "JohnT",
          "Nb_Reviews": 3,
          "Date": "2022-05-06T14:07:11.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. The free postage enabled me to send my device easily and I  received my full quote in the bank as promised. Well done and thank you."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "joelle  van ruth",
          "Nb_Reviews": 5,
          "Date": "2023-03-29T13:45:52.000Z",
          "Titre": "Money came straight away and was the…",
          "Contenu": "Money came straight away and was the amount promised, will definitely use this service again when needed"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Rob",
          "Nb_Reviews": 2,
          "Date": "2022-06-16T19:30:31.000Z",
          "Titre": "Great service",
          "Contenu": "First time I used this company, very impressed with their service, very quick payment.I can 100% recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Andrew Vernals",
          "Nb_Reviews": 16,
          "Date": "2022-12-07T15:04:50.000Z",
          "Titre": "1st class always pay what they say on…",
          "Contenu": "1st class always pay what they say on the same pay as item received would recommend to anyone"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "emma",
          "Nb_Reviews": 5,
          "Date": "2023-10-06T20:16:05.000Z",
          "Titre": "Easy to dispatch and money in paypal…",
          "Contenu": "Easy to dispatch and money in paypal the same day they received it."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Malcolm",
          "Nb_Reviews": 4,
          "Date": "2021-11-04T15:53:14.000Z",
          "Titre": "Very pleased with the price offered for…",
          "Contenu": "Very pleased with the price offered for my Ipad and the service and payment was very efficient and will definitely be using again."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kat",
          "Nb_Reviews": 13,
          "Date": "2022-10-22T12:09:47.000Z",
          "Titre": "Super easy sell and quick",
          "Contenu": "Super easy quote, quick delivery and paid same day as soon as they received the item i was selling!! 100% recommend"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Linsey Holt",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T16:39:06.000Z",
          "Titre": "Customer service was A*",
          "Contenu": "Customer service was A* Money was in my bank quickly, even though a Bank Holiday week held everything up."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kay Brewster",
          "Nb_Reviews": 6,
          "Date": "2022-04-07T10:39:46.000Z",
          "Titre": "I was so impressed with the service…",
          "Contenu": "I was so impressed with the service from start to finish. They even send you a label to send your item back. Definitely recommend"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr  Deakin",
          "Nb_Reviews": 10,
          "Date": "2022-02-18T15:13:35.000Z",
          "Titre": "Straightforward",
          "Contenu": "Straightforward - easy to send old phone to them with pre-paid label & prompt payment into bank"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Margaret Westwood",
          "Nb_Reviews": 5,
          "Date": "2021-11-06T13:33:48.000Z",
          "Titre": "Very prompt service I posted my parcel…",
          "Contenu": "Very prompt service I posted my parcel on Tuesday and the cash refund was in my bank on Friday of the same week Excellent service Thank you"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mahedi Hassan",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T18:17:02.000Z",
          "Titre": "Very fast with the payment",
          "Contenu": "Very fast with the payment. Got it within 1 working day."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Harvey",
          "Nb_Reviews": 8,
          "Date": "2021-11-03T00:08:36.000Z",
          "Titre": "I was very  pleased with sell techs",
          "Contenu": "I was very  pleased with sell techs, they really do pay you on the day they receive your device and you get every penny they promise you!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jean",
          "Nb_Reviews": 42,
          "Date": "2023-09-12T14:23:34.000Z",
          "Titre": "A really efficient company",
          "Contenu": "A really efficient company.  I would certainly use them again."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2022-01-28T14:26:15.000Z",
          "Titre": "Pleased with service",
          "Contenu": "Although the postage for the pre-paid postage package wasn’t paid fully so I had to pay £2 extra to have it delivered I’m still happy with the service and was quick and easy and got the amount advertised, easy way to get rid of a cracked phone ☺️"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Anna",
          "Nb_Reviews": 9,
          "Date": "2023-01-13T08:46:40.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. shipped my earpods and received my payment swiftly. Didn't expect it to be this easy and quick."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "shakespiers",
          "Nb_Reviews": 7,
          "Date": "2023-05-05T12:23:55.000Z",
          "Titre": "Selltechs kept their promise!",
          "Contenu": "My old iPad was received by them yesterday and the money arrived in my account yesterday. Excellent service."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mrs Harrison",
          "Nb_Reviews": 13,
          "Date": "2022-04-08T11:46:39.000Z",
          "Titre": "Very good",
          "Contenu": "Very good, all happened as promised, very quick turn around, I would definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alan T",
          "Nb_Reviews": 18,
          "Date": "2023-05-31T16:37:34.000Z",
          "Titre": "At last a company that do what they say…",
          "Contenu": "At last a company that do what they say they will- faultless and gave a good price for my used iPad"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jamie Moseley",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T17:02:35.000Z",
          "Titre": "5 stars",
          "Contenu": "Would use this company again , fast payment on day of receiving my item"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Anne Flint",
          "Nb_Reviews": 25,
          "Date": "2023-10-17T18:13:03.000Z",
          "Titre": "Just brilliant",
          "Contenu": "Very efficient and professional company. No delays and kept informed. Would definitely recommend the."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-19T22:07:45.000Z",
          "Titre": "Superb service- received exactly what…",
          "Contenu": "Superb service- received exactly what was promised in super quick time! Would totally recommend!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Miss Natalie Palmer-Wilson",
          "Nb_Reviews": 3,
          "Date": "2021-12-13T13:31:12.000Z",
          "Titre": "Quick and efficient company",
          "Contenu": "Quick and efficient company. Used them twice and both times they have sent packages and money within a week."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tara Griffin",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T11:53:55.000Z",
          "Titre": "Great service sent off Monday paid…",
          "Contenu": "Great service sent off Monday paid Wednesday as amount as agreed no issues"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T19:52:02.000Z",
          "Titre": "Quick response to enquiry and fast…",
          "Contenu": "Quick response to enquiry and fast payment of product I sold. Would recommend!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "JL Sarmiento",
          "Nb_Reviews": 104,
          "Date": "2022-12-30T13:40:30.000Z",
          "Titre": "Super fast payout",
          "Contenu": "Excellent service with super fast payout and a very fair price. I will use them again."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Thomas Ramage",
          "Nb_Reviews": 3,
          "Date": "2022-08-24T13:51:03.000Z",
          "Titre": "Excellent service fromSelltechs quicker…",
          "Contenu": "Excellent service fromSelltechs quicker that other sites I’ve used Will certainly use them again"
        }
      ]
    }
  ]
}