{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "serverpartdeals.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Diane Hassebroek",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T18:56:30.000Z",
          "Titre": "This order was a fraudulent order on my…",
          "Contenu": "This order was a fraudulent order on my credit card."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "David S",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T05:51:37.000Z",
          "Titre": "Insane import fees/shipping, careful",
          "Contenu": "*I live in Canada, may vary by country*You think you're getting good deals? Nope, expect to pay at least $100 of importing fees for a SINGLE driveCan't recommend this site, not sure how much these import fees would be for multiple drives but I can't recommend it if you are buying only oneI will refuse the package and request a refund, ain't no way I am paying the same amount for a used drive than a brand new(and more reliable) one0/5"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Rayel",
          "Nb_Reviews": 1,
          "Date": "2021-07-20T13:50:15.000Z",
          "Titre": "Not recommended!!",
          "Contenu": "This company goes by many different names, has fake reviews listed on their homepage (and only ones listed in 2013), and will NOT honor warranties. I ordered many hard drives and, like most people that have a DVR/NAS/SAN, wrote the order number on the hard drive in the even there was an issue. One of the drives was defective from the manufacturer and Serverpartdeals/Server Tech Solutions/ServerTech voided the warranty because it had writing on it. Terrible customer service and not even a member of the Better Business Bureau! I would recommend that you order from someone else. Do not give them any business... you have been warned!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2021-07-20T14:17:50.000Z",
          "Titre": "Avoid this place!",
          "Contenu": "Order several hard drives with a 3 year warranty on Amazon, had a drive go bad within 1 month. Sent the drive for replacement and they will not honor the warranty because I wrote the warranty information on the label. I have not got a response further. I will never do business with this company."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Epsy",
          "Nb_Reviews": 1,
          "Date": "2021-05-10T18:41:11.000Z",
          "Titre": "They cancelled my order because they were impatient to receive funds.",
          "Contenu": "They cancelled my order and the only reason was due to being impatient. Let me explain, I ordered 15 enterprise grade hard drives from them for a chia farming build I was working on, and it totaled around $8300 for the drives alone. For that reason, my bank decided to send an eCheck which takes 6-9 days to process. I explained to the merchant the situation and at first they were okay with it. After a few days I get an email from them saying they are no longer able to wait for payment and have cancelled my order.The problem now becomes that the FUNDS have already left my account 2 days prior to this email being sent to me. The money is now in LIMBO until the final day when it arrives to them, and then they issue me a refund. They were unable to issue me a refund at first because the funds never did arrive. So I had to wait for them to receive the funds even after the cancellation and then I had to wait again... for it to return to my bank account. Yes, I have a credit card, but for large purchases this goes over my cap that I have set on it for security reasons. If anybody knows anything about crypto or farming... timing is of the essence and although the first 6-9 days was my fault for choosing eCheck, they made me wait double time for the money to come back to me before I could use it else where."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Mayo",
          "Nb_Reviews": 1,
          "Date": "2021-04-29T16:03:07.000Z",
          "Titre": "cancelled my order without giving me…",
          "Contenu": "cancelled my order without giving me any chance to correct the issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marvin JENSEN",
          "Nb_Reviews": 1,
          "Date": "2020-09-24T01:26:34.000Z",
          "Titre": "I purchased these 4 drives based upon…",
          "Contenu": "I purchased these 4 drives based upon your specifications stating the drives were 0.40 inch thick. That converted was 10.5 MM. That would fit the enclosure I was trying to fill. The drive is actually 0.59 inch thick which is 15 MM. They won't work. My bad that I didn't go to the manufacture website and confirm the specs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Happy Customer",
          "Nb_Reviews": 2,
          "Date": "2019-01-10T14:34:10.000Z",
          "Titre": "I'll pass on this business",
          "Contenu": "I'll pass on this business. Bad customer service. Wrong items sent. Can't contact directly. No public company information (Google business listing). All of this was based on a single transaction. I received, a Hitachi HDD from 2012 and sold as HGST from recent years. Tried to get a replacement and they offered me a \"credit\" of 36% of purchase price. What a joke.Very unhappy with the experience here and probably won't be going back."
        },
        {
          "Note": 1,
          "Lieu": "DZ",
          "Pseudo": "Gary M Willis",
          "Nb_Reviews": 1,
          "Date": "2020-12-25T22:17:28.000Z",
          "Titre": "Service Sucks"
        },
        {
          "Note": 1,
          "Lieu": "BA",
          "Pseudo": "Perica Dujmovic",
          "Nb_Reviews": 6,
          "Date": "2020-05-21T08:04:12.000Z",
          "Titre": "A very frivolous company",
          "Contenu": "A very frivolous company. I do not recommend entering any business with them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "robert karbe",
          "Nb_Reviews": 1,
          "Date": "2020-02-21T21:52:49.000Z",
          "Titre": "Connector damaged right out of the…",
          "Contenu": "Connector damaged right out of the package.Totally useless."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "yewling chin",
          "Nb_Reviews": 1,
          "Date": "2020-07-03T21:39:41.000Z",
          "Titre": "so bad",
          "Contenu": "so bad，Will not buy anything on this site!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Travis",
          "Nb_Reviews": 1,
          "Date": "2016-01-25T22:53:21.323Z",
          "Titre": "Would not honor price listed on their website",
          "Contenu": "Ordered a NIC which they then canceled saying that it was listed at the wrong price on their page. Instead of honoring it, they canceled my order and offered to sell me the NIC at $425 instead of the $50 they had listed on their page. I ordered from them because they were the cheapest on the particular part. Thanks to this my upgrade project will be behind schedule. That isn't their fault but it's quite the inconvenience. I dislike a company who won't honor their listed prices and feels like a bait and switch. Larger companies are usually required to uphold their listed price, mistake or not and unfortunately this company will not. I will say their team (name removed for privacy) was kind enough to call me to let me know that they have canceled and was kind enough to check to see if they had used parts. But in the end I won't deal with a company who won't uphold the price which they have listed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "janet laylor",
          "Nb_Reviews": 1,
          "Date": "2022-06-07T21:55:01.000Z",
          "Titre": "good products, not often a great deal",
          "Contenu": "In general, ServerPartDeals is a good company, but my last experience was mixed.  I was looking specifically for SAS drives, got the serverparts link, went to it, placed the order and only then realized that my SAS search had been replaced with SATA drives.  On the positive side, i was able to reach a real person to cancel the order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 3,
          "Date": "2020-02-14T00:16:10.000Z",
          "Titre": "Almost cool",
          "Contenu": "I was offered a discount, for bulk. But on the invoice it turned up full price. I got a bad drive and replacement was speedy Florida to Mt in 19hrs... But the server was still down for 9 days total. Would have been better to just not get a dud."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ALEKSEY ZINKOVSKIY",
          "Nb_Reviews": 2,
          "Date": "2020-05-21T12:54:58.000Z",
          "Titre": "Not mentioned that the items are not brand new",
          "Contenu": "In the description, it was not mentioned that the items are not brand new. When checked up both hard drives SMART status it shows multiple power-on resets and many power-on hours as well as spindle motor power-on hours."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ALEKSEY ZINKOVSKIY",
          "Nb_Reviews": 2,
          "Date": "2020-02-13T19:57:32.000Z",
          "Titre": "The HDDs were not brand new",
          "Contenu": "The HDDs were not brand new. One of two has 10 days of work time and another 17 days and dozens of power-up events."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Olivia Taylor",
          "Nb_Reviews": 3,
          "Date": "2023-04-21T18:47:24.000Z",
          "Titre": "my hardware didnt work well so i…",
          "Contenu": "my hardware didnt work well so i ordered another and they shipped not the one I needed and ordered it once again and here i am with my new hardware"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J C",
          "Nb_Reviews": 1,
          "Date": "2022-06-07T23:57:20.000Z",
          "Titre": "Diagnostic report on used drives would be nice",
          "Contenu": "Everything was excellent from ordering online to the product arriving promptly. However a diagnostic report should be included when buying used drives. They are tested anyway to make sure these used drives are still working. The only extra step is to press print."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Burkholder",
          "Nb_Reviews": 1,
          "Date": "2022-05-01T18:43:16.000Z",
          "Titre": "This 16tb drive was very nicely packed…",
          "Contenu": "This 16tb drive was very nicely packed and arrived in working condition. However, the awkwardness of UPS shipping to rural Canadian addresses caused extra expense and delay, since border clearance was not automatic. Received at UPS store in Regina due to this. If there was some better shipping method (preferably choosable at time of order), I would order more from ServerPartdeals."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Wilkinson",
          "Nb_Reviews": 2,
          "Date": "2021-04-02T03:26:17.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "This company is suffering from the marketplace problem of fraudulent payments.  It caused an initial problem with my order, there was a delay in my order and it had to be shipped a second time, however their customer service department made sure that my order was completed properly.  The follow-up from their staff was excellent and the product was as stated in new condition with no issues.  They went out of their way to turn around a difficult situation and I greatly appreciate doing business with them.  I would recommend that if you are looking for something hard to find at great prices, you should look at their in stock items first.  In the world today, it's difficult to find a company that has staff that will personally solve an issue for you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Phil Reyes",
          "Nb_Reviews": 3,
          "Date": "2022-01-15T19:12:18.000Z",
          "Titre": "Delivered quickly",
          "Contenu": "Delivered quickly. Packaging is very good for a hard drive. Looks like new and works well in apfs and ntfs formats. ~230MB Avg. R/WStated to be a brand new drive with 5 year manufactures warranty.Have not confirmed yet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Barker",
          "Nb_Reviews": 1,
          "Date": "2021-08-06T13:25:31.000Z",
          "Titre": "A little slow on shipping",
          "Contenu": "A little slow on shipping, but other than that, fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shawn B",
          "Nb_Reviews": 1,
          "Date": "2020-07-15T16:15:29.000Z",
          "Titre": "Great deals on server drives",
          "Contenu": "Great deals on server drives. Signature should have been required for delivery, especially for the amount in the order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James B.",
          "Nb_Reviews": 1,
          "Date": "2020-06-19T04:40:12.000Z",
          "Titre": "Seagate Exos x10 10tb",
          "Contenu": "I ordered the Seagate Exos x10 10tb drives.5 stars on the service and how fast I received the drives.3 stars on the warranty transparency for the drives.  The site said 3 years on the warranty, but didn't differentiate if provided through the manufacturer or serverpartdeals (more info on this below). Drives:  The drives I received were HPE pulls (as annotated by the HPE sticker on each) and aren't covered under Seagate's warranty (checked on Seagate's warranty verification and showed that they are OEM drives not covered by Seagate). I contacted serverpartdeals inquiring about the warranty and received a prompt response stating that I have a 3 year warranty through serverpartdeals.  In case anyone is interested in S.M.A.R.T data, all drives passed and had low hours ~50 on them and all drives had a manufacture date of around May 2018 (+ or - a month).TL:DR, Excellent price on drives and service, warranty not through Seagate, but through serverpartdeals.  Would totally be 5 stars if the store page was more clear about who provides the warranty and I will buy from Serverpartdeals again in the future."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Martin Novak",
          "Nb_Reviews": 1,
          "Date": "2020-02-13T18:41:09.000Z",
          "Titre": "Great response.",
          "Contenu": "Great response.Only issue is that I never know how much duty I will be charged as I am in Canada."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "vicente cortez",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T18:15:11.000Z",
          "Titre": "Good Deal",
          "Contenu": "Great price for HDD right now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Happy Customer",
          "Nb_Reviews": 2,
          "Date": "2020-07-07T19:47:20.000Z",
          "Titre": "Great price and fast delivery"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Clay A",
          "Nb_Reviews": 4,
          "Date": "2020-04-29T18:47:53.000Z",
          "Titre": "I got my part quickly"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "K.",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T15:59:00.000Z",
          "Titre": "Excellent service, excellent packaging.",
          "Contenu": "Staff was very helpful in answering some questions I had. My order arrived within two days or so, unbelievably fast!Never seen better packaging for HDD's in my life. I will be a returning customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "wk",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T18:31:08.000Z",
          "Titre": "Great price, fast shipping",
          "Contenu": "The hard drives shipped fast, and they've been perfect so far."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Mattias Svensson",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T14:34:52.000Z",
          "Titre": "All good and very satisfied",
          "Contenu": "Fast shipping and packaging. Very well packaged and I’m overall very happy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TRog",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T04:45:59.000Z",
          "Titre": "They were highly recommended",
          "Contenu": "They were highly recommended. I've made two orders now.Best price, fast shipping, very well packed, items work. Haven't had to contact customer support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Zim",
          "Nb_Reviews": 1,
          "Date": "2021-08-17T21:07:47.000Z",
          "Titre": "Western Digital Ultrastar HC550 18TB",
          "Contenu": "Purchased 6 x Western Digital Ultrastar DC HC550 WUH721818ALE6L4 0F38459 18TB 7.2K RPM SATA 6Gb/s 512e 512MB 3.5\" SE Hard DriveDrives arrived in 2 days via FedEx and were packaged exceptionally well in custom hdd foam cutouts. Great prices, factory new hdds, 5-year manufacturer warranty and fast shipping."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "CPowerMav",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T15:43:01.000Z",
          "Titre": "Best prices on high quality hard drives anywhere.",
          "Contenu": "I pretty much only buy drives here now. The MFR recertified WD UltraStar drives I have purchased have had zero issues and I couldn't find comparable prices anywhere even after shipping, duty and currency conversion to Canada. I have purchased 15 drives here over the last 2 yeas and have recommended to colleagues who have also purchased nearly 10 drives all with no complaints. Great service too for all the questions I had related to picking the right drives for my application! Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "flashdrive",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T09:20:04.000Z",
          "Titre": "Repeat customer",
          "Contenu": "I've bought at least half a dozen recertified hard drives from ServerPartDeals over a span of time and they all arrived quickly, well packed, and fully functional (I always run a full disk test before putting them into service and they all passed with flying colors). I highly recommend ServerPartDeals for their great prices and quality recertified hard drives."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MCP",
          "Nb_Reviews": 3,
          "Date": "2023-04-03T22:19:59.000Z",
          "Titre": "Excellent customer service from start…",
          "Contenu": "Excellent customer service from start to finish. The order shipped immediately and was received on the date promised. The recertified items were very well packaged, much better than even new items.UPS had marked delivery to front door when they were actually shipped to an on site Amazon Locker. Serverpartdeals customer help me resolve the issue promptly.Products are working great, and i have no doubt if there were an issue, Serverpartdeals would be there to help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave T",
          "Nb_Reviews": 1,
          "Date": "2021-07-07T17:43:54.000Z",
          "Titre": "6tb hgst hdd",
          "Contenu": "was looking for a new backups disk, serverpartdeals showed up in google shopping results with a lower price than my usual go-to's, tigerdirect and newegg.  Did some research on the part numbers, wd vs hgst, helioseal vs not, etc, to confirm it was actually the right one.  The disk showed up a few days after ordering, packed well, nice inflatable padding in the box.  Mounted fine, passed surface test ok, would definitely check here again the next time I need more storage."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Le",
          "Nb_Reviews": 2,
          "Date": "2022-09-09T03:49:53.000Z",
          "Titre": "packaging and customer service was top notch along with very attractive pricing",
          "Contenu": "I bought 2 14TB exos 16 hard drives and they arrived yesterday. The packaging was great - drives were held firm in place with firm foams. Upon checking the warranty on seagate, I realized their warranty ends 12/31/2026. I was a bit disappointed, so I reached out to customer support and they gave me additional seller warranty until 08/31/2027. The prices were great, and with their effort to keep customers happy, I am very happy and impressed. Will definitely consider buying more from serverpartdeals in the near and long term future."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Adam Connor",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T01:15:02.000Z",
          "Titre": "2 business days to Australia",
          "Contenu": "Ordered on Friday afternoon, arrived on Tuesday lunch time- to Australia. Outstanding.Drives showing 0 hours and 0 issues so potentially reset by seller or factory, but more than 50% already in use and no issues so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Garrett Sparks",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T23:27:52.000Z",
          "Titre": "Awesome vendor",
          "Contenu": "High quality packaging for shipping, shipping is fast, and all drives I have received have had no problems. Very helpful and responsive support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T23:51:50.000Z",
          "Titre": "Great Shipping",
          "Contenu": "The website is easy to navigate to get the parts you need. The way the parts were shipped and how they were packed seemed very proper for a hard drive. It was very protected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ian Corrigan",
          "Nb_Reviews": 2,
          "Date": "2023-09-02T20:10:18.000Z",
          "Titre": "Serverpartdeals simply the best",
          "Contenu": "Serverpartdeals has amazing customer service that responds quickly to any queries. Super helpful and amazing prices and selection. I buy all my hard drives from them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mvnathan",
          "Nb_Reviews": 1,
          "Date": "2021-06-12T18:06:39.000Z",
          "Titre": "Good deals on enterprise hard drives",
          "Contenu": "Bought a bunch of manufacturer recertified SAS drives at an excellent price. Server Part Deals shipped them out promptly with really great packaging. All drives were in good working condition. No complaints whatsoever; won't hesitate to buy from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T18:16:30.000Z",
          "Titre": "Great Seller.",
          "Contenu": "This company is great.  I've purchased 2 refurbished 14 TB drives from them so far and these were the best packaged drives I've ever seen.  Drives arrived 3 days after my order.  One of my drives didn't work at first, and I messaged them about it.  They very quickly replied and I had an RMA number within an hour of my first message.  I then discovered I had gotten a bit of cellophane on the SATA connector and the drive was fine after all.  I would recommend these folks to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John H",
          "Nb_Reviews": 2,
          "Date": "2022-06-01T17:19:29.000Z",
          "Titre": "refurb 18 TB segate exos drive",
          "Contenu": "good drive, well packaged, quick delivery,some reviews indicate the exos series may be loud, I found this drive to quiet, copied over 11 TB over to this drive, no problems, crystaldisk indicated 2 turn on and 24 hours on this drive when I received it, I think the factory may have reset the bios, who knows?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Henry Lanouette",
          "Nb_Reviews": 6,
          "Date": "2023-10-02T19:57:12.000Z",
          "Titre": "Fast shipping & Secure packaging",
          "Contenu": "Fast shipping. rugged and protective packaging. Great Deal.  Package came faster than I expected- about 2-3 days from CA to MA!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christ",
          "Nb_Reviews": 2,
          "Date": "2023-01-02T23:34:39.000Z",
          "Titre": "I bought a Manufacturer Recertified…",
          "Contenu": "I bought a Manufacturer Recertified Exos x18 16TB hard drive, and it came within three days of ordering it. Packaging for the hard drive was the best I've seen compared to any other major online retailer. So far, the drive works as intended, and I have had no issues thus far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick H.",
          "Nb_Reviews": 2,
          "Date": "2022-07-10T21:07:25.000Z",
          "Titre": "Great price, great product, timely and cost effective delivery….What more could you want!?",
          "Contenu": "This is the second time I have purchased from Serverpartdeals.  Previously purchased 2 WD HC550 Ultrastar 6 TB HD for a desktop raid.  Perfect execution of order and delivery!  This time purchased the WD HC 550 Ultrastar 18 TB HD for Data.  Quietest drive I have ever had.  Can’t hear unless you put your ear to the Vantec External Case. Great price, great product, timely and cost effective delivery….What more could you want!?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Miller",
          "Nb_Reviews": 1,
          "Date": "2021-07-20T15:50:58.000Z",
          "Titre": "The choices I had…",
          "Contenu": "The choices I had for an enterprise grade drive replacement were outstanding. When I inadvertently ordered the wrong drive, their customer service saved the day from my own screwup.  I truly enjoyed doing business with them.  I would highly recommend serverpartdeals."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig Dolnick",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T23:16:35.000Z",
          "Titre": "Everything A+ from beginning to end of process.",
          "Contenu": "-- Ships within 24 hours.-- Packed so professionally, it is almost a shame to undo it to get to the drives.-- During the hurricane flooding, the box was shipped inside a watertight plastic bag.-- Every drive works, with no excessive noises or excessive vibrations (well, still in the process of setting up some drives -- but all previously set-up drives have no issues), and this is for their renewed drives.-- Competitive pricing.-- Staff replies, promptly, to e-mailed questions.  And they actually answer your questions (there is a difference between a reply and an answer).I have not had the occasion to need a warranty replacement.  So I cannot vouch for that service aspect.  But I suspect it would be on par with the rest of their services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Taylor",
          "Nb_Reviews": 1,
          "Date": "2021-04-30T18:06:31.000Z",
          "Titre": "First time order. WILL order from them again.",
          "Contenu": "I've never purchased re-certified drives, and never heard of Serverpartdeals before they showed up in a search for Segate Exos x10s.  The deal was so good that I decided to give it a shot, against my better judgement, frankly.I'm glad I did. Everything has gone flawlessly:- Top notch automated communication about the status of my order.- Fast shipping built into the (good) price of the drives.- Units arrived packed beautifully.- Units were exactly what I ordered and expected.- Drives are humming away in my NAS without issue.I took a chance, and it worked!  I'm not interested in buying drives anywhere else."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Ringheimer",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T19:11:47.000Z",
          "Titre": "Solid delivery",
          "Contenu": "The hard drive I ordered arrived quickly and in perfect condition. The drive itself as so well-protected against shock damage that I think I could have thrown it down the stairs without risk of damage to it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Schaeffer",
          "Nb_Reviews": 1,
          "Date": "2021-08-23T21:25:17.000Z",
          "Titre": "Getting the right drive for my system",
          "Contenu": "I ordered the wrong drive for my system without talking to a knowledgeable sales person. After contacting Serverpartdeals, I was able to return the wrong drive received a full credit and was shipped the correct drive and am very happy with the service I received. I enjoyed dealing with professional, knowledgeable, people who got me exactly what I needed.Thanks for you help, I will look forward to using your services in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Auston Kleczka",
          "Nb_Reviews": 1,
          "Date": "2021-08-05T18:02:43.000Z",
          "Titre": "10/10 I will be using you again",
          "Contenu": "10/10 I will be using you again. Fast fulfillment, though I wish you had options other than fedex for shipping. You don’t play games with your inventory and in this day and age that is a massive win for people who need data storage on a schedule."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wester Wilson",
          "Nb_Reviews": 2,
          "Date": "2021-07-07T16:48:46.000Z",
          "Titre": "This company ROCKS!",
          "Contenu": "These guys or company ABSOLUTELY rock! They exceeded my expectations in EVERY category! Price was excellent, packaging was superb, shipping was lightning fast, product was as described! I simply wish they'd offered a more diversified range of technology products (mobos, graphic cards, etc.) allowing me additional purchase options.  The bottom line is that I'm extremely happy with my purchase and I highly recommend Serverpartdeals to anyone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Wyatt",
          "Nb_Reviews": 1,
          "Date": "2021-05-10T22:37:47.000Z",
          "Titre": "1st Time Buyer at ServerPartsDeals…",
          "Contenu": "This was my first experience with Serverpartdeals.Great price, Fast service, Exceptionally well packaged. Free ship option.Very nice web interface with all the popular purchasing options - Credit, Paypal, Amazon.I will surely be back."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 1,
          "Date": "2021-09-07T21:04:56.000Z",
          "Titre": "18 TB HGST works just like perfectly.",
          "Contenu": "My 18 TB HGST was excellently packaged, and well protected. Drive has only been working for a week, but it has worked flawlessly.Another perfect delivery from Server Part Deals.Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David K Tsang",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T22:11:32.000Z",
          "Titre": "Shipment is superb",
          "Contenu": "Shipment is superb, clear message of tracking #, fast 2-day shipping and live tracking of the shipment. Package is well wrapped and clean.Drive is refurbished as almost new conditions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron Y",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T04:39:31.000Z",
          "Titre": "Great shopping experience",
          "Contenu": "The shopping experience was great, found the item I wanted to get and the checkout process was straightforward. Great prices for hard drives, and the shipping was quick. Packaging was amazing, the hard drive was packed in and secured. Hard drive is working perfectly, ran SMART tests on it and it passed. Am happy with my experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd",
          "Nb_Reviews": 1,
          "Date": "2021-04-18T17:53:17.000Z",
          "Titre": "So far, so good!",
          "Contenu": "So far, so good.  I've purchased a handful of harddrives over the past few years from ServerPartsDeals.  Their service and response and has been exemplary.  I've had no problems so far with the various drives (Hitachi/HGST/WD 10TB 7200rpm) which are running 24/7 in a couple of NAS'.  Their prices are decent and they've always seemed to have the drives in stock, when I go looking for some more.  Thanks, ServerPartsDeals!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T17:00:27.000Z",
          "Titre": "Serverpartsdeals has fully supported my…",
          "Contenu": "Serverpartsdeals has fully supported my questions and returns. They have offered me a priority replacement while the failed unit was returned so my data was not at risk."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Review D",
          "Nb_Reviews": 20,
          "Date": "2022-11-16T21:34:34.000Z",
          "Titre": "My second purchase, and the first time refurb drives",
          "Contenu": "My second purchase from ServerPartsDeals in two years, and first time buying seller refurbished drives. The first time I bought new drives and the OEM warranty was as fresh as it can be (beating a certain famous photo and video shop whose same drives had 8 months of warranty already gone). This time I got seller refurbished with no OEM warranty, meaning I have to trust the seller to take care on the off chance a drive dies. This is a whole new level of trust! The drives arrived well packed, as the last time, and the free shipping is ultra fast (on par if not beating my favorite red and green NY photo and video store). The refurb drives all have precisely 72 hours on the clock and vacuum sealed in anti-static bags. SMART data indicates no issues, and I'm running extended tests that will take a couple days. I will be sure to update this review if there are any issues. So far 2 out of 2 happy purchases of multiple drives."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Meis",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T19:59:40.000Z",
          "Titre": "Got what I ordered!",
          "Contenu": "Got a nice deal on refurbs, happy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex P",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T16:23:12.000Z",
          "Titre": "Great site",
          "Contenu": "Great site with amazing prices. They ship items very fast with very secure packing.I unfortunately got a bad drive, but they got that resolved very fast and got another drive shipped out ASAP. 10/10 would recommend this site for all HDs"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesse",
          "Nb_Reviews": 1,
          "Date": "2022-01-09T15:29:39.000Z",
          "Titre": "Consistent!",
          "Contenu": "The Serverpartsdeals team continues to be the best support for storage products with orders shipping out and being delivered as advertised, usually faster. Their staff is also very responsive to email and questions. Will continue to keep my business."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Robyn",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T00:44:31.000Z",
          "Titre": "Ordered from australia to be sent to a…",
          "Contenu": "Ordered from australia to be sent to a US address to be picked up and brought back to australia20TB for $344 US, to get a 20TB in australia is $1000 AUDCheap as compared to buying from australian shopsSuperfast delivery, pretty much overnight.Will buy from again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LLov",
          "Nb_Reviews": 6,
          "Date": "2023-02-03T15:51:19.000Z",
          "Titre": "Quick Response and turnaround",
          "Contenu": "They were quick to respond via chat and email to my defective hard drive issue. There is no advanced replacement, but I was not expecting one.  They had shipped me out a new drive the day after it my return was received."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vincent Zebraitis",
          "Nb_Reviews": 4,
          "Date": "2022-05-08T19:04:13.000Z",
          "Titre": "Would do business again - reputable company!",
          "Contenu": "While I would have liked the price to be lower (and who wouldn't, really), I found that ServerPartsDeals had a reasonable price for the items that I wanted, shipped promptly, and the items (three manufacturer recertified hard drives) came EXTREMELY well packed.  Add to that a two-year manufacturer warranty, and you have a great experience overall."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T15:30:19.000Z",
          "Titre": "Highly Recommend",
          "Contenu": "I've ordered about a dozen drives from ServerPartDeals. The prices even on new drives are the best around and it's always 2-day shipping. I've also purchased some recertified drives and haven't had a problem. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MGambone",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T20:14:43.000Z",
          "Titre": "Internal drives",
          "Contenu": "I spent hours looking for affordable SSD and HDD drives for our multiple PCs.  Most vendors don't have the high capacity drives we need.  Serverpartdeals was the only one with the drives we need but most of all, the lowest price among them.  I don't know how they do it when others have twice or more than twice the price of what they have.  The service is also very commendable.  They respond on time and are very helpful with making sure we got the orders right.  Makes my job easier!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim D",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T00:10:29.000Z",
          "Titre": "Zero complaints",
          "Contenu": "Zero complaints, drive arrived very quickly - even over Xmas Holliday weekend.Drive was shipped EXTREMELY securely, and looks to be brand new.Found my spot for drives from now on."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T21:42:39.000Z",
          "Titre": "All 10 drives were perfectly packed",
          "Contenu": "All 10 drives were perfectly packed, shipped and delivered quickly and without any drama. The entire transaction was handled very professionally.I know who to go to for hard drives in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 2,
          "Date": "2022-12-06T09:41:47.000Z",
          "Titre": "Looking Good",
          "Contenu": "Purchased two refurbished Seagate 18tb drives. They appear to be in good health and was $100 less than retail. Shipping was quick and packed secure. I plan to do more business with this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 2,
          "Date": "2023-07-31T17:19:38.000Z",
          "Titre": "Price and support were great",
          "Contenu": "It was very easy to see what I was getting and to order it. It came with notices about the drive cut off and included tape to resolve the issue. Drives have worked perfectly. Very happy with the deal and the service. Will look here first when I need something else."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig Hoffman",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T19:25:15.000Z",
          "Titre": "Purchasing, customer service, and RMA's are flawless.",
          "Contenu": "Every transaction that I've had with them has been fantastic.  Prices are competitive, shipping is fast, and communication is great.  The RMA process is equal to the buying process.  It's trivial to do, communication is excellent, and shipping is fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2021-11-13T17:45:24.000Z",
          "Titre": "16 TB HDD",
          "Contenu": "I received my hdd as described.  Shipment was fast! Received in 2 days.  I highly recommend those reading this review to trust this company.  I will definitely be buying from them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al Susinskas",
          "Nb_Reviews": 3,
          "Date": "2023-07-31T16:32:56.000Z",
          "Titre": "Excellent shopping experience",
          "Contenu": "Prices were great along with the warranty.  Shipping was fast, the items were received in perfect condition.  I'm glad I ran across this store and will use them again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TMan",
          "Nb_Reviews": 1,
          "Date": "2022-06-05T15:48:03.000Z",
          "Titre": "Wow!",
          "Contenu": "Wow, great price and lightning fast shipping! I had never purchased from this retailer before and was hesitant because I had never heard of them. I’ll definitely use them in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Brantley",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T16:03:23.000Z",
          "Titre": "This company knows how to ship hard…",
          "Contenu": "This company knows how to ship hard drives and I’ve had zero issues with my purchases so far and all drives have pre cleared with no errors. I’ll definitely be back here for more!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "linuxonly",
          "Nb_Reviews": 1,
          "Date": "2022-08-03T05:02:45.000Z",
          "Titre": "Drive works as expected. Good price",
          "Contenu": "Clear and accurate description. Drive works. Only thing that can be improved is to indicate clearly that although the drive is MANUFACTURER refurbished, the warranty is provided by the seller and not the manufacturer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chad R",
          "Nb_Reviews": 1,
          "Date": "2022-05-31T07:19:13.000Z",
          "Titre": "The best way to buy drives",
          "Contenu": "The best way to buy drives. Fast shipping and they really pack their drives well, not only in the antistatic bag but also with packing materials that keep the drives in place with no movement. Prices are good as well. This is the third drive I've bought from here and and I will probably only buy drives from ServerPartDeals from now on"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CPD",
          "Nb_Reviews": 1,
          "Date": "2022-12-31T03:30:31.000Z",
          "Titre": "Packaging Impressive, Among Other Traits",
          "Contenu": "Great pricing and selection, easy to navigate website, quick shipping, and maybe the most important, excellent packaging. I have yet to receive a DOA hard drive from Server Part Deals."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kurtis M",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T22:47:04.000Z",
          "Titre": "Another Satisfied Customer",
          "Contenu": "Drives were shipped within one business day and arrived in airpack bubble shipping in perfect condition. I validate the sectors on the drives and they all validated. Will purchase from ServicePartDeals again."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Gautam P.",
          "Nb_Reviews": 1,
          "Date": "2022-03-02T23:16:29.000Z",
          "Titre": "Excellent service all around",
          "Contenu": "Excellent service all around, great price, fast shipping, expert help. Top notch. Would not hesitate to do business again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paulo",
          "Nb_Reviews": 1,
          "Date": "2021-08-12T19:48:20.000Z",
          "Titre": "The drive was packaged really well",
          "Contenu": "The drive was packaged really well! Definitely appreciated. The shipping option showed fedex but it’s actually UPS. Little strange but ok."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T15:43:26.000Z",
          "Titre": "Best price on the market as well are…",
          "Contenu": "Best price on the market as well are wonderful and protective packaging. Will be back for my next drive purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Free",
          "Nb_Reviews": 1,
          "Date": "2021-03-06T22:46:17.000Z",
          "Titre": "Your site is off putting but you are reliable",
          "Contenu": "Was honestly weary of your site as most reviews were almost non existent but I got my product and it is genuine so I'm very pleased"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Riser",
          "Nb_Reviews": 2,
          "Date": "2022-11-10T05:48:28.000Z",
          "Titre": "excellent service",
          "Contenu": "excellent service! i have bought from them 3 time before. always fast shipping. i have not problem when buying hard drives from this seller"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mister",
          "Nb_Reviews": 2,
          "Date": "2023-01-28T06:37:28.000Z",
          "Titre": "Purchased 2 12TB hard drives that came…",
          "Contenu": "Purchased 2 12TB hard drives that came with 2 Day shipping and extremely well-packaged. Both drives were a great value and have 2 years of warranty with the seller."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "July Linett",
          "Nb_Reviews": 1,
          "Date": "2022-08-12T15:17:10.000Z",
          "Titre": "Serverpartdeals is remarkably…",
          "Contenu": "Serverpartdeals is remarkably responsive and communicative throughout the purchase process. Emails are sent at every stage and everything is timely. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pete",
          "Nb_Reviews": 2,
          "Date": "2021-08-12T00:33:12.000Z",
          "Titre": "Professional service",
          "Contenu": "In stock, free shipping, quick response, no delays, excuses or attempted substitutions!  Awesome packaging for a delicate HDD. Couldn't ask for better service at a reasonable price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2021-10-21T13:22:19.000Z",
          "Titre": "They bent over backwards to help me",
          "Contenu": "I ordered a drive and it was shipped via UPS. Because of my apartment  building situation, that turned out to be a complete disaster and I sent it back. They then re-shipped the drive via FedEx with no drama and all was good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2021-04-09T20:48:33.000Z",
          "Titre": "Got the drive",
          "Contenu": "Got the drive,  the warranty checked out with seagate, the only thing I would suggest is to send with signature required. FedX let it on my door step. I was gone all day, you never know if a porch  pirate might come buy. Thanks Bob"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Chambers",
          "Nb_Reviews": 2,
          "Date": "2021-04-16T00:26:05.000Z",
          "Titre": "I was very happy with server parts",
          "Contenu": "I was very happy with server parts. My order went out that day and received next day. The drives were well packed and worked immediately when plugged in. I would definitely use server parts again as the need arises"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "YL",
          "Nb_Reviews": 4,
          "Date": "2022-07-07T17:02:16.000Z",
          "Titre": "Good first purchase experience",
          "Contenu": "Drive shipped promptly. Packaging was top notch. Drive passed initial smart test with no errors. I still need to write 0s to it to double check but otherwise satisfied with product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jordan",
          "Nb_Reviews": 2,
          "Date": "2021-06-05T19:46:49.000Z",
          "Titre": "I'm very happy with the price and the…",
          "Contenu": "I'm very happy with the price and the fast shipping. There are a few negative posts that gave me some pause, but the proof is in the pudding and can honestly say that I am very happy my choice of vendor."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hisco IT",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T18:09:02.000Z",
          "Titre": "Perfect first buying experience",
          "Contenu": "Purchased about $3k worth of Harddrives from this company.  Products were as described, well packaged, and quickly shipped."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Kirk",
          "Nb_Reviews": 2,
          "Date": "2022-03-02T00:12:26.000Z",
          "Titre": "Packaging Above and Beyond",
          "Contenu": "Was most impressed by the care and detail paid to packaging the HDD. It was rock solid and I cannot imagine anything could have happened to damage the product. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 6,
          "Date": "2021-10-01T03:13:02.000Z",
          "Titre": "Wasting no time got my HDDs to me…",
          "Contenu": "Wasting no time got my HDDs to me quickly.  Packaging was excellent and the drives were up to date  with all of their warranty intact.Solid outfit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oleg",
          "Nb_Reviews": 2,
          "Date": "2022-08-03T19:33:11.000Z",
          "Titre": "Best place to buy hard drives",
          "Contenu": "Best prices, fast shipping, and on top of that it was easy to chat with an actual human before placing an order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carra Bussa",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T02:17:27.000Z",
          "Titre": "Fast shipping and good packaging",
          "Contenu": "Fast shipping and good packaging so no damage during shipping.  I wish Amazon would always be so careful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BWK",
          "Nb_Reviews": 2,
          "Date": "2021-10-13T22:21:10.000Z",
          "Titre": "I order hard drives over and over again…",
          "Contenu": "I order hard drives over and over again from ServerPartDeals.  Very reliable source on getting hard drives at a great price.  Love the 2 day shipping.  Better than Amazon.  Keep it coming!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Streifthau",
          "Nb_Reviews": 1,
          "Date": "2022-06-07T13:21:06.000Z",
          "Titre": "Very happy with my experience from…",
          "Contenu": "Very happy with my experience from ordering, shipping, packaging and the actual disk condition itself.  Every disk purchased checked out and is function very well."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Pavel",
          "Nb_Reviews": 2,
          "Date": "2021-06-08T21:08:59.000Z",
          "Titre": "One of the best deals for HDDs",
          "Contenu": "Fast and helpful service! Easy to use website and fast support.Totally recommended as happy owner of new HDDs!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2022-04-15T16:10:23.000Z",
          "Titre": "Excellent Distributor for HDDs, Honours Warranty",
          "Contenu": "Purchased several WD HC320 datacenter HDDs from Serverpartdeals through Amazon US in 2020 for a respectable price, individual HDDs came in correct WD official box with plastic 'GeoSprings' & sealed ESD bag (I've had issues with official Amazon Commercial Services shipping bare drives in poorly padded envelopes resulting in damage). HDDs worked perfectly however unfortunately one of them failed after after a year and a bit of use (5 year warranty). Contacted Serverpartdeals support with details and was able to RMA the drive for a replacement, replacement HDD was shipped quickly upon receipt of the old drive, again well packed and the correct model replacement, works great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "me",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T07:23:12.000Z",
          "Titre": "Everything done right",
          "Contenu": "Fast shipping, *EXCELLENT* packaging. This is my second order, and I see many more in my future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2022-01-10T21:19:57.000Z",
          "Titre": "Shipped the same day",
          "Contenu": "Shipped the same day. Arrived in two days. As always packaged very well. Quick response to a question. Great company to fufill your Hard Drive needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Gero II",
          "Nb_Reviews": 3,
          "Date": "2022-10-04T17:38:48.000Z",
          "Titre": "Quick and well packed",
          "Contenu": "drives arrived quickly, well packed, and were able to be quickly racked and prepped for use. Next round of replacement drives will be coming from here."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TUAN NGUYEN",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T17:37:55.000Z",
          "Titre": "14TB WD internal drive",
          "Contenu": "Shipping is fast. Item is in good condition with a reasonable price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Daniels",
          "Nb_Reviews": 1,
          "Date": "2021-06-06T19:06:32.000Z",
          "Titre": "Nothing to report",
          "Contenu": "Nothing to report.  Which is the way we like it.  Drive arrived in a timely fashion, formatted just fine and is whirring away.  No problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Avareth Taika",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T04:33:53.000Z",
          "Titre": "Good prices",
          "Contenu": "Good prices, fast shipping, no issues at any point. How every transaction should be!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2022-02-01T22:09:30.000Z",
          "Titre": "Best place to buy hard drives of quality and price.",
          "Contenu": "I have bought New hard drives many times from this site and the quality is too notch.  The packing is done very well to protect the hard drives.  And the shipping is always very fast.  I will always shop here first.  Very pleased costumer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trey Glaze",
          "Nb_Reviews": 2,
          "Date": "2022-04-04T20:43:37.000Z",
          "Titre": "Excellent product excellent price it…",
          "Contenu": "Excellent product excellent price it came fast and it worked Straight Out of the Box thank you so much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John-Paul",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T03:50:17.000Z",
          "Titre": "No fuss",
          "Contenu": "No fuss. No muss. Easy checkout, fast delivery, and product as expected. Can’t go wrong."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joel V.",
          "Nb_Reviews": 2,
          "Date": "2021-11-04T20:59:04.000Z",
          "Titre": "Great prices",
          "Contenu": "Great prices, excellent packaging and Always my go too. A+!! Plan on ordering more soon"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Sherwood",
          "Nb_Reviews": 4,
          "Date": "2023-07-31T16:04:52.000Z",
          "Titre": "Great service across the board",
          "Contenu": "Great price, rapid shipping, well packed, product as promised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg Hayden",
          "Nb_Reviews": 3,
          "Date": "2023-11-01T18:20:50.000Z",
          "Titre": "Great Prices and fast delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lurker",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T21:22:25.000Z",
          "Titre": "Best place to buy Hard Drives at the…",
          "Contenu": "Best place to buy Hard Drives at the lowest price w/ manufacture warranty."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Christopher",
          "Nb_Reviews": 2,
          "Date": "2022-01-16T00:22:22.000Z",
          "Titre": "Best hard drive supplier",
          "Contenu": "Quick shipping, 2 day free delivery, best hard drive packing in the industry."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Martin Sidorenko",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T19:53:08.000Z",
          "Titre": "Got item as described in proper…",
          "Contenu": "Got item as described in proper packaging. Delivery was fairly fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Morgan",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T00:55:43.000Z",
          "Titre": "Shipped fast",
          "Contenu": "Shipped fast. Product was as advertised. It was well packed."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Nelson Wright",
          "Nb_Reviews": 1,
          "Date": "2021-04-28T19:20:31.000Z",
          "Titre": "Doesn't get any better",
          "Contenu": "Excellent pricing, great web site, fast and free shipping, over-the-top packaging. Expectations met or exceeded in every respect."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kerry",
          "Nb_Reviews": 3,
          "Date": "2021-03-11T15:34:43.000Z",
          "Titre": "ordered two drives to go to my PO Box",
          "Contenu": "ordered two drives to go to my PO Box, received them in a timely manner with no problems. can't ask for anything more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wayne Ludwig",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T00:01:52.000Z",
          "Titre": "Fast and well packed shipping",
          "Contenu": "Fast and well packed shipping.  Drives tested with no errors in extended smart test."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-03-01T23:25:41.000Z",
          "Titre": "Easy quick shipping",
          "Contenu": "Easy quick shipping.  Great prices and product as described.  You really couldn't ask for anything more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2022-10-07T05:03:57.000Z",
          "Titre": "Wow, the packaging",
          "Contenu": "So far, so good.   Drives, packaged absolutely amazing.  Good deal, and all working."
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Uxorious",
          "Nb_Reviews": 4,
          "Date": "2021-09-01T16:19:25.000Z",
          "Titre": "Highly recommended",
          "Contenu": "Quick shipping, good prices, drives brand new and packed really well.Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ptwang",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T20:30:14.000Z",
          "Titre": "Great price",
          "Contenu": "Great price. Fast shipping and item arrived in perfect condition."
        }
      ]
    }
  ]
}