{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "servify.tech",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fabian Guzman",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T03:31:42.000Z",
          "Titre": "Haven't received my money!!!",
          "Contenu": "I have a Z Fold 4 and use Servify because is my Insurance, they mentioned that $ 990 was going to be held because that's what the device is worth. I sent my damaged phone in November 29 and till this day I haven't received my money. They took my money out and received it again and they took it out once again but never got it back. Take screen shots from Servify from every transaction it's made you'll save yourself lot's of headaches."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike G",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T11:13:10.000Z",
          "Titre": "Tomorrow will be 14 days since i shipped my phone",
          "Contenu": "Tomorrow will be 14 days since I shipped my phone , the fact that Samsung doesn’t have parts available is the 1st issue and then they use snail mail for the free shipping 7 days later it made it to Texas . I had to purchase a prepaid phone for basic communication while traveling in case of an incident or family emergency.  Hopefully the Texas place has parts which the walk-in locations in my area didn’t ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul Jackson",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T21:22:45.000Z",
          "Titre": "I have been waiting for more than a…",
          "Contenu": "I have been waiting for more than a week for phone replacement. For a week the unprofessional customer personnel keel lying that they will deliver the following day. 24 hour replacement turning a week and still  counting still waiting. Probably I will never received the phone. Don't trust samsung.  It's all good until you need a service from them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lance Vanderborg",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T03:06:15.000Z",
          "Titre": "My experience with Samsung care plus has been horrible",
          "Contenu": "My customer service experience has been awful. I lost my phone and they required my to verify my identity by sending me a text to my lost phone. I had to purchase a Sim card and barrow my friends phone so I could verify my identity. It took me 3 days to get all of this done and many calls to servify. If was a nightmare and not worth it. Plus after all of that my phone turned up and the locked me out and refused to unlock it so I could recover my data. I removed Samsung care plus from my account because of this nightmare experience. I recommend using a tempered glass screen protector and calling it a day."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tiffany B",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T23:37:15.000Z",
          "Titre": "Not a good first experience",
          "Contenu": "Called and filed my claim the day before I went for a repair. Wasn't notified until I called back while at the store to get it repaired that there was a problem and was told to wait 24 hours. Multiple calls (about 15) and 3-4 days later they finally just canceled that claim and did a new one so I could get my phone fixed. The whole time I was never given any info and only told I had to wait 24 hours over and over."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T19:46:30.000Z",
          "Titre": "Terrible Customer Service and Quality Control",
          "Contenu": "I purchased additional damage coverage from OnePlus when I purchased the phone new. I accidentally closed the phone in a car door in July of 2023. The damage consisted of broken back glass and a bend to the frame of the phone. I will save you the saga of the nonsense but this is now the third time Servify is asking me to ship them my phone. It has been nearly five months without a resolution. Responses have been slow and the damage has not been properly taken care of. Buyer be ware."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wong Bruce",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T03:40:00.000Z",
          "Titre": "2 weeks to clear up my claim and get it…",
          "Contenu": "2 weeks to clear up my claim and get it to the service center. No compensation for the delay and no communication when the issue was fixed. I had to continually call and find out what was going on.Once the service center received the the claim it only took them 90 minutes to fix the device and they were great."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T22:17:46.000Z",
          "Titre": "Absolute horrible experience",
          "Contenu": "Absolute horrible experience. Little to no communication with the device taking 2 months to repair and me having to reach out almost every day in order to push this through. I paid 2 months of useless Samsung care along with “accidental damage” fee with no reported or documented reason as to why. The company should be ashamed of itself for charging their customers without reason and taking so long. I still haven’t even recieved an apology email or any communication and has made me a lifelong supporter of any brand that isn’t Samsung. I will be seeing legal action as well with how I was treated and charged without any rhyme or reason. Disgusted by the service provided and this is not how customer care should be handled. I’m just happy I never have to deal with this company or service ever again because even if my device has issues, I’d gladly rather throw it in the trash then to send it to you people once more."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "V Keegan",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T21:09:38.000Z",
          "Titre": "What didn't go wrong",
          "Contenu": "What didn't go wrong? I purchased my phone direct from Samsung with the Samsung Care+ protection. When my screen on my phone broke, I was first sent to a store that couldn't fix my phone. Then I was told I would have to mail it in and be without a phone for 10-12 business days. When I was finally given another location to go to, the servicer told me I needed a claim from Samsung or I would have to pay out of pocket. Call back again because no one had given me this info. When I get to store, their computer is down and I need to transfer my claim to another location. Get to next location, claim hasn't been transferred - after calling yet again, being transferred to multiple people, I was disconnected. At this point, the store manager took pity on me and called Samsung for me. He was told that my Samsung Care+ policy had been cancelled and I didn't have coverage, despite the fact that the claim had just been issued less than 2 hours prior. Finally after several transfers we were able to get the claim sent to the correct store. After a dozen phone calls and driving to 3 separate locations, I was finally able to get my repair done. Never again. I switched to Motorola and got my insurance through my phone provider, so if this happens again, they will overnight me a new phone. Problem solved."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nette",
          "Nb_Reviews": 4,
          "Date": "2023-11-23T15:34:33.000Z",
          "Titre": "This was the worst experience!",
          "Contenu": "My screen cracked, and I went to file the claim online. The Servify site said i didn't have protection on my device, which is insane because the payment comes out automatically every month. Every time I called, I got a different reason why I was having a problem. First, it was check with Samsung Financing, which I did. They could clearly see all of my payments, as could Samsung Care. 2-3 days was the time frame for the issue to be resolved. After 1 week, I was informed I could send my phone in to be fixed, which would take 10 business days, and there wasn't a guarantee I'd receive a loaner phone, so I didn't do that. I called at least 20 times for updates, because no one reached out as promised. 2 weeks have gone by at this point, and I randomly checked the site.The system error was fixed, but of course, no one let me know. I got my phone fixed the following day. I didn't hear from anyone about the update until a week after getting it fixed. I did not have any issues when the company was Assurion. Servify is terrible. They didn't even offer to cover the cost of repair after this ordeal."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "OMANDI MARTINEZ",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T11:50:35.000Z",
          "Titre": "I waited to long to get my replacement",
          "Contenu": "I waited to long to get my replacement, the customer service is out the country is to hard to understand or speak with them, very frustrating  process."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul Jackson",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T09:08:03.000Z",
          "Titre": "Lies",
          "Contenu": "Lies, bad customer service, everything about them is pathetic.  I will never buy any Samsung device."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T12:25:57.000Z",
          "Titre": "Terrible Experience",
          "Contenu": "Terrible service. I paid $159 for the insurance plan and I filed 3 separate claims and none were successful. Representatives had terrible communication skills and not only did I end up paying an additional $160 but my claim was delayed an additional 48 hours. Every step was unpleasant and unprofessional.They literally have one service and they failed miserably at it.After they replied to this review I sent a letter to their support email and they replied with a copy-paste portion of their terms and service. No help was provided."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gabriel Seal",
          "Nb_Reviews": 4,
          "Date": "2023-10-04T15:07:54.000Z",
          "Titre": "They've had my device since the 7th of…",
          "Contenu": "They've had my device since the 7th of last month, I was told that they \"didn't have parts\", so they offered an \"advanced exchange\" if I paid $1.00. I of course obliged and paid the invoice, only to be charged $990.00 instead. I have initiated a consumer complaint with the Federal Trade Commission, the Washington Attorney General, and have initiated a chargeback for all pertinent charges. These individuals are absolutely disgusting and extremely egregious, they're clearly taking advantage of people."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "christopher gutierrez",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T19:33:51.000Z",
          "Titre": "Cradle of idiocy",
          "Contenu": "Cradle of idiocy. I never want to deal with India again. I File a claim twice and they have technical issues won't pay the store to fix my device and can't seem to correct the issue. You can never get a hold of a manager or supervisor even with a ticket number it's total lunacy.Edit: You give Samsung a bad reputation and a bad name do them a favor and cancel the contract you have with them. You're a terrible company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christopher Hamilton",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T20:01:18.000Z",
          "Titre": "worst thing was to change insurance company. Servify",
          "Contenu": "Love Samsung but the worst thing was to change insurance company. Servify sadly can barely understand them speaking plus its like speaking to a robot. Over 2 weeks my phone fell and es bleeding pixels. The link for the payment is giving a processing error and after mentioning tones of times they keep sending the same link as if they dont understand what i was saying. Even by email i sended screen shot and its the same result."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Debbie Bingham",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T14:29:17.000Z",
          "Titre": "For 3 days kept being put on hold",
          "Contenu": "For 3 days kept being put on hold, then cut off after being on phone on hold for 4 or 5 hours with different people just decided to send phone back to Samsung to see if they could fix it. The service center said it needs replacing and Samsung wants to try to, 919-369-3095"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "iam that Iam",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T20:08:20.000Z",
          "Titre": "NIGHTMARE",
          "Contenu": "Took a week of going back and forward with Asurion/UbreakIfix and Servify to get a simple screen repaired because of a green line.  Their repair numbers will not match.  Ended up just sending the phone back to Servify.  Samsung has lost my trust by switching to this company for insurance."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jasonlic",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T12:06:45.000Z",
          "Titre": "This company is a scam",
          "Contenu": "Avoid, their service is horrible, I'm leaving Samsung because of this private insurance company is connected with Samsung Care+ and it is a nightmare experience.Edit: my previous screen fix claim is still open from Dec.2022 which I paid and fixed so case should have closed by long ago. Now my Flip4 screen cracked again (do not buy fold/filp phones they crack too often) but I can't claim to start fix for a week until previous case is closed, I've asked close claim Ref#: LAQANGCHVBxx no one cares to responding my multiple email I sent. And 6mo ago fist experience with them was nothing better either.Servify is a scam company avoid! If Samsung continues to use Servify more people will leave to Apple."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gabe H",
          "Nb_Reviews": 11,
          "Date": "2023-11-13T16:53:35.000Z",
          "Titre": "Incredibly slow and inconvenient.",
          "Contenu": "Edit: 11/13/2023: I still HAVE NOT been refunded the $990.00 I was overcharged, their \"Compliance Officer\", Rachel Koch, lied in a statement to the Washington Attorney General's Office as well, about how much I was actually charged, she also lied about the status of my refund. This place is absolutely AWFUL, do NOT do business with them.I was initially invoiced for $1.00 for a \"security deposit\" per Ankit Rathod over e-mail, in fact, it was mentioned several times through various e-mails that I'd only be charged $1.00. I was instead charged $990.00, which overdrafted my account and today I received a device that's locked to T-Mobile, the device I sent in for initial repair was unlocked. Additionally, the device has less storage than the device I sent in for repair. This place is an absolute dumpster fire.I've gone ahead and \"kindly\" reported them to the Washington state Attorney General's office for their disgusting and egregious behavior. They're clearly taking advantage of consumers and hold absolutely no regard for your device, experience, or money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kyle S",
          "Nb_Reviews": 2,
          "Date": "2023-03-24T20:14:56.000Z",
          "Titre": "SERVIFY IS A SCAM",
          "Contenu": "I cannot express this enough: DO NOT PURCHASE SAMSUNG CARE+. Multiple promises for expedited care and refund for deductibles have gone unfulfilled. They only reply to emails once per day and the phone support team has incredibly long wait times and are absolutely useless. I am so close to leaving Samsung forever just because of how poor this experience has been.*UPDATE AFTER BUSINESS RESPONSE: No resolution or refunds have been provided to me. Promises have been made and unfulfilled several times. I have finally cancelled my coverage and will work hard to get the refunds I rightfully deserve."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jamie hills",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T14:23:06.000Z",
          "Titre": "Spent 24 hrs waiting due to Servify poor communication.",
          "Contenu": "Spend 24 hrs to get my phone back. Ufix repaired the screen in 15min but due to poor communication between Servify and Samsung the part couldn't be scanned out.  Servify also have poor communication when calling to submit a claim and unfortunately my phone's not listed in the drop box to submit the claim online.Follow-up- No need to DM you now! I've already experienced the inconvenience! When it's all said and done Servify have poor communication with Samsung and it's huge disappointment as a customer. I'm hoping Samsung understands this partnership is going to cost them to lose customer!"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "shamik gupta bhaya",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T10:53:37.000Z",
          "Titre": "From India",
          "Contenu": "From India. Terrible experience from Servify through which I purchased extended warranty for Motorola Edge 20. Their service is very poor in India , I have been waiting for last 10 days for my phone to reach the authorized service centre."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kris Petroczi",
          "Nb_Reviews": 4,
          "Date": "2021-08-17T18:48:28.000Z",
          "Titre": "I purchased a Norton device protection…",
          "Contenu": "I purchased a Norton device protection plan which is managed by Servify. The app promises an easy upload process and quick reimbursement. Today is week 3.After dozens of calls and emails the claim is yet to be settled...I would not recommend neither one (norton device care or servify). Some credit cards have the screen protection plan included in their benefits."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Timothy",
          "Nb_Reviews": 2,
          "Date": "2022-10-08T01:18:33.000Z",
          "Titre": "Samsung care plus sucks",
          "Contenu": "Kept emailing them on when they will ship the device but was told 48 hours but then got an email telling me to take it to the repair center instead. I decided to do that so I cancel the request and put another one in but was charged 99 dollars again hopefully I get the phone fixed and a refund. I will be canceling this service afterwards and going with akko instead."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Jayendra Tiwari",
          "Nb_Reviews": 4,
          "Date": "2022-03-31T10:52:29.000Z",
          "Titre": "useless & pathetic process - so much delay in service. scam! scam!",
          "Contenu": "I sent my mobile for repair and due to their pathetic and useless process it took 3 days to pick up and they have only one service center in entire Mumbai, thane, Navi Mumbai and I think overall Maharashtraand they took 2 days to make an estimate of cost, total 5 days wasted and after that, they said it will take 7 days to repair. total 12 days and then mobile delivery will take 2-3 days so assume 15 working days it's a horrible experience and u will get nothing and I believe it's a scam company. even after 2 months, u will get nothing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 2,
          "Date": "2021-09-07T17:19:00.000Z",
          "Titre": "Service takes way too long",
          "Contenu": "Service takes way too long and there is no actual communication in the meantime. I filed a report and over a week later there is zero update. I just get automated emails saying \"sorry for the delay, we are checking the request with the internal team\"."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "floyd spriggins",
          "Nb_Reviews": 3,
          "Date": "2023-07-14T22:43:53.000Z",
          "Titre": "Filed a claim for my phone online and…",
          "Contenu": "Filed a claim for my phone online and after 3 days decided to call them. They said they were waiting for documents they never requested. After numerous calls and lies they finally approved my claim a week later and now im still waiting for the next step. Assurion would have had my phone fixed the same or next day. Servify is trash and Samsung should  ditch them.Update: My phone screen has been repaired. I filed my claim on June 5th and It was repaired on June 11th. 6 days when asurion would have had it approved and fixed no more than 2 days. I had to also take off from work to drop it off which was inconvenient when I could have scheduled Sunday when I was off.In addition they also flagged this review and calling me a liar when I have documentation to prove my claim. This is unacceptable Servify. Your company never requested documentation from me until I called and it took 3 days to review my documentation. In addition your customer service lied and said verification would only take 24 hours until I was told no one could do it on the weekend. 6 days for a screen repair is unacceptable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cameron Hartley",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T02:11:26.000Z",
          "Titre": "They do not want to work with you. Avoid them",
          "Contenu": "I need to make bullet points 1. Received my package on Aug 3rd for repairment -> needed parts (this is ok)2. notified me that they received the parts on Aug 4th 3. After 1 week, I send an email asking what happened to my phone and get no actual confirmation back 4. After 10 business days (and few emails later) I still do not receive any information from them 5. I call them and they dismiss my questions AND tell me that they never got my repairment parts 6. They do not fix the website to show any change and do not respond to any of my emails7. After calling them one final time on 09/02, they say that my phone has been repaired and will be shipped out 8. They mess up on my shipping address which was confirmed in the beginning. So my UPS delivery is further delayed Overall, my phone was taken by them for about 6 entire weeks with minimal updates and minimal communication. They do not want to work with you. Avoid them"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Martin Lehtio",
          "Nb_Reviews": 2,
          "Date": "2023-08-23T20:24:12.000Z",
          "Titre": "Getting my phone repaired by Samsung…",
          "Contenu": "Getting my phone repaired by Samsung Care Plus was an incredible Pain in the REAR END.  Put through endless steps with poor communication and poor systems for submitting information that they already have was awful and created a FIVE Day lag in the time to get my claim approved, even though I already had confirmation of my Samsung Care Plus activation via email.  The Asurion UBREAKIFIX location was terrific but is encumbered by poor Samsung Processes.  Eventually, my phone was fixed, and all is good now except for the HUGE Inconvenience and the amount of personal time it required."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Juan Herruzo",
          "Nb_Reviews": 1,
          "Date": "2021-02-19T10:18:20.000Z",
          "Titre": "One and a half months of waiting and still nothing.",
          "Contenu": "Needed a whole phone replacement since it broke down in mid to final of december, been contacting servify since then but fisrtly they told me that I wasn't even insured with them, and then after more than 20 days of telling them that Oneplus confirmed me that I was insurenced with them they told me to wait, and I amd still waiting for an outcome.Edit: And they doubled down telling me that they don't insurance my phone. The first days of Oneplus 8 Pro being sold they insurance was covered by Servify,  not Allianz. OnePlus confirmed me that my insurance is with you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TimO",
          "Nb_Reviews": 2,
          "Date": "2020-12-06T17:29:57.000Z",
          "Titre": "Stay away from OnePlus phones and Servigy",
          "Contenu": "This is the support/accidental damage portion for OnePlus.  It is literally a scam.  They ask for proof of purchase and you send it to them and they say they can't help you because you didn't supply a proof of purchase.  I supplied them with the contract from their website and all of the receipts I received.  Stay away from OnePlus and Servify!!"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Ashwini Janardhan",
          "Nb_Reviews": 1,
          "Date": "2020-12-31T06:14:37.000Z",
          "Titre": "Bad experience",
          "Contenu": "Bad experience, Initially they told it would take 2 to 3 days now its been more than 20 days i haven't received my phone back, They tell that we want on parts, A galaxy note parts are not available it looks silly. Its a long process to get back the phone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sharaya Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T12:42:58.000Z",
          "Titre": "Don't waste your money",
          "Contenu": "This has been the worst customer experience I've had in years. I dropped my Samsung Galaxy S20 FE 5G on the ground on 4/27/2023. I called and made a claim, and went to UBreakIFix on 4/28 just to be told there was a system error and he could not complete my repair. I called Servify Care while at the UBreakIFix, they tried another claim, and once again it was unsuccessful. I was told that the ticket was escalated and that I needed to wait two hours and call back to determine a solution. I called back and was told the issue had been fixed and to take it back to UBreakIFix today, 4/29/2023. I went back to UBreakIFix and they did not have the part in stock. I called back to Servify and they told me it is my fault because my phone is outdated and that I could either mail my phone in for repair or pay more to have my phone replaced. They took no responsibility for my time, effort, or gas wasted going back and forth 15 miles 4x, and I will as such never purchase a Samsung phone again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris Pennington",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T00:47:12.000Z",
          "Titre": "Trash, Do Not Buy, Go With Akko!.. Trust Me!",
          "Contenu": "Ok, Story time.. First occurrence of trying to replace my phone, my IMEI didn't get updated in their system (internal failure) .. I was with a broken phone, unusable, for 6 weeks of calling daily, getting pushed off, and being told countless times I would receive a call back within x amount of time.. I would give a day extra, and call, to be told I would be called, no supervisor is available to help, etc.. This cycle continued for 6 weeks.. Finally I got my claim going, 2 weeks later I get my new phone..Second occurrence, not even 90 days after my replacement of my Galaxy z Fold 4 I start noticing dead pixels in the screen.. I call, try to start a claim, again being told I will get a call back in x amount of time.. I am sure we know how this turns out.. This time for 11 days I go through the BS.. Then on day 12 I get an update that my phone is beyond the 90 mark.. Keep in mind, 12 days I've been working to get replaced, day 12 they tell me I am 3 days past my 90 mark, (calls started 9 days before warranty expired).. This \"service\" is absolute trash, stay away!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Aron Teacher",
          "Nb_Reviews": 1,
          "Date": "2020-10-07T19:06:59.000Z",
          "Titre": "What a shocking service.",
          "Contenu": "What a shocking service.It has taken more than one month to have a Oneplus collected for repair.I don't even know whether the repair will be any good.Finally after a month of delays and being ignored, a brand ambassador has reached out and is trying to be helpful but he has no real decision making ability, nor influence nor power to actually resolve the problem.So, if you have a replacement phone to use for the year it takes to have your original phone repaired it might not matter; but if not, avoid this horrible service provider.I cannot think why Oneplus would partner with such a inefficient company.UPDATEAs below, Servify have indeed credited my account. It took 70 days and numerous emails but I have some kind of resolution. Again, I cannot tell you if the repair service that they offer is any good but I commend and thank the brand ambassador and the VP who worked to have this resolved."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Sugameli",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T12:58:06.000Z",
          "Titre": "They have not replied to a single email…at least not before I made this review",
          "Contenu": "They have not replied to a single email (it's been almost 2 weeks since I sent my original email) and after I exchanged my device on their website, I ended up getting a phone with a broken microphone (it didn't work AT ALL). The fact that the support people on the phone don't even have the number for the logistics team and they have to wait for responses as well is actually absurd. What a horribly run scummy company.Edit: they did end up reply, seemingly only because I posted this review of them. While they claim to have called me multiple times, I never received a single call from them. I had to do all of my interactions over email. They were very helpful once they did reply, but it only seems like they were due to the fact that they want me to change this review. They flagged this review because they believe it was untruthful. It seems they didn't expect me to show the proof of how long it actually took me to get a response from them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J B",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T05:07:57.000Z",
          "Titre": "Servify has horrible wait times and worst support",
          "Contenu": "I have a ticket submitted and have paid the deductible. I took it to a phone repair shop. They stated they need the ticket redone as there is a common/known issue with the ticket submission issues from Samsung currently. I called Servify to resolve this. Man who took my call says there is nothing he can do for me and that there are other people on hold he must help. That's it. No support, no escalation, no further review. His only reply is go back and tell them to fix my phone. How on earth does that make sense? There is an issue somewhere and no one is willing to drive into it. I pay for the care plus monthly and have already paid my deductible. What am I paying for? I wish I could speak with someone who is aware of how to resolve matters. I can't get a hold of anyone by phone without waiting for 1+ hrs and having to call multiple times due to calls being dropped. This is the worst experience I have had with companies being so uninformed. The only person who suffers is us (the customer)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Guillermo Bolaños",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T01:50:22.000Z",
          "Titre": "Won't validate my plan on my device",
          "Contenu": "Had the coverage since we both our Galaxy Note20 Ultra, my wife phone had to be replaced once and it was fine, they send the replacement and I sent hers back, now it happened again and I've been trying to file a claim since last Thursday, the first person said there were no devices under my account, I verify the IMEI and she said that's not it, that the phone appears under someone else, so I told her that phone was a replacement, seems they didn't update it on the system, she said she couldn't transfer the plan, so maybe I should stop paying it... I called back and got someone else, asked me to email a picture of the prime showing the About info, and I did she confirmed the got it and said should be updated in a few hours and I should be able to file online... nothing happened I called back and they said maybe wait till the next day, I did tried all day Friday nothing, then they said give it till Monday... tried again today and nothing, then finally when I said I wanted a supervisor they said they needed proof of the replacement from over a year ago.. I actually still had the emails, so I send the proof... told me that they got it and wait a few hours for the update... nothing... I can't even get my claim started, I don't know what else to do."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Julien Gandelin",
          "Nb_Reviews": 1,
          "Date": "2020-09-09T00:55:12.000Z",
          "Titre": "False advertising",
          "Contenu": "I recently purchased a OnePlus 8 Pro, and on the official website oneplus.com there was the ability to purchase an additional coverage of 24 months. Given the price of the phone I purchased this coverage from Servify. I was surprised to see that a couple of days later this purchased was refunded without any notice or explanation. Then I decided to connect my coverage into the OnePlus Care app just to make sure I was still covered. The app kept saying \"already reedeemed\".Once contacted, after 3 weeks and multiple emails, Servify told me that their coverage was actually not covering Canadian people, that's why I was refunded. They did not offer any workaround, and now that I purchased this phone more than 30 days ago I have zero solution to purchase extra insurance for my phone.At the end of the day, I am not lawyer but I think this is called false advertising, and this does not look good at all from a legal perspective."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fade Scape",
          "Nb_Reviews": 1,
          "Date": "2020-10-20T15:54:34.000Z",
          "Titre": "Like many others have said",
          "Contenu": "Like many others have said, I received an email after many delays telling me they do not have the parts and I have to pay for the repair and request a reimbursement from them. This is a horrible service and possibly a scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "steven nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T21:17:47.000Z",
          "Titre": "Trash company",
          "Contenu": "Trash company doesn't even allow me to file a claim because they claim I haven't paid for my insurance but I have receipts saying I have and Samsung also confirms that I do"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jonathan Jones",
          "Nb_Reviews": 2,
          "Date": "2020-11-11T01:55:45.000Z",
          "Titre": "Don't waste your money on this…",
          "Contenu": "Don't waste your money on this Insurance, they make it so inconvenient and even to get to the processing portion of it took me over a month, when they asked me to send my phone in. I asked how long they would have it and they said they didn't know. I wished I would have saved the almost $200 dollars I spent to insure my phone...YOU HAVE BEEN WARNED!"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Saurabh Chaurishia",
          "Nb_Reviews": 1,
          "Date": "2022-09-15T10:50:47.000Z",
          "Titre": "Fraudsters who only provide vague excuses for not covering warranties",
          "Contenu": "Pls provide detailed reason of declining the repair under the \"Samsung Care+ Plan \" which is availed by me for any such unexpected issue.The subjected mobile Samsung galaxy M51, was working fine till 13th Sept 2022. Only issue was it was not charging with the provided charger. The mobile used to be covered with screen guard and back cover and never exposed to any liquid ( Though M51 is claimed as dust proof and water resistant). Last time it was serviced/ repaired by Samsung Authorised service center \"Sukh shyam associate\" at Jaipur (Raj.) for the \"same issue\" a year back and it was repaired under warranty only. Post which, now I have encountered the same issue of \"not charging\" again. It was never opened /serviced/ repaired by anyone otherwise.Felt cheated  and duped by the vague reason you have communicated to me on phone yesterday, that \" it's damaged due to water and few parts are missing from it\" and not at all convinced.Reiterating, my mobile was working perfectly fine before handing over to your pickup partner, only it's not charging with the charger provided.If I have known of such malpractices by Samsung for forging few thousands from the customers on account of extended warranty, would never purchase your so called \"Care+ plan\" or any product of Samsung for that matter.Have handed over my mobile in spotless condition and having snaps, taken before handing over to your pickup partner."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Justin Richardson",
          "Nb_Reviews": 2,
          "Date": "2021-04-26T22:48:21.000Z",
          "Titre": "Scam!!",
          "Contenu": "This company will claim act of god: \"Fortuitous event\" to not pay out your claims. Complete scam, do not buy their warranty!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Drake",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T20:00:31.000Z",
          "Titre": "Servify is Horrible",
          "Contenu": "* update as you can see servify said they were \"looking into it\" and then back to crickets. In the mean time they have flagged my report on trustpilot because they are saying it s false or makes negative statements?!?! Just shows what a sham of a company they truly are. NO ONE SHOULD INSURE ANYTHING WITH THIS SCAM OF A COMPANY!I have had my galaxy s22 ultra for well over a year. Bought it directly from Samsung and decided to go w their insurance that they offered via servify. Fast forward 1 year and I try to file a claim w servify because I accidentally dropped my phone and it landed screen side down and broke. First time I called servify I was transferred around to four different people and we definitely had a language barrier. The final guy I spoke to said that samsung had not sent them any money for my insurance so they could not help me until the money is received. Said he put in a request since system showed I had a policy and to call back in 10 days. Call 2 nearly the same occurrence,  passed around said money transfer was pending from samsung and call back in 10 days. When I began to question their companies bs policy the call mysteriously was dropped. Call number 3 spoke to 5 different people who were of no help and absolutely useless at their job. Finally a \"manager\" got on who  gave me same bs as last 2 calls but then proferred up a work order number for me to use when I call back in, you guessed it, 10 more days!!! After he gave me the work number he thanked me and hung up before I could reply. Call 4 I speak w 6 different reps who were all clueless and just doing their obvious job to frustrate the customer and get them off the phone without covering any claim. I would ask for a manager but NONE were ever available. After wasting almost 3 more hours on the phone w obvious con artists I hung up and logged in to cancel my insurance on the samsung website. The next day I got notice of my request ro cancel along w another text from servify telling me my coverage was being canceled for non payment! What the actual F?? I love samsung and all their products they have but DO NOT EVER SEEK COVERAGE FOR ANYTHING VIA SERVIFY. They are cheats and scam artists and I am very disappointed that samsung would associate w such a low class company! And my phone screen is still AFU. SERVIFY IS HORRIBLE!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vincent Gilbert-Manion",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T18:44:43.000Z",
          "Titre": "Hassle after Hassle",
          "Contenu": "I recently tried to open a claim on two devices I had from accidental damage. When opening the claim it only provided the option for a device replacement. In order for them to process that they needed to place a $953.99 hold for each device on my payment method. I, at the time, didn't have the option for that with my credit limit or available cash on hand. I reached out to support on three different occasions, the first time I was on hold for over a hour with no response. I decided then to email them in which I finally got a response three days later. I finally got ahold of someone on the second time calling on the second day of no response to my email in which I was told there was nothing they could since that was the only option provided when opening a claim and they couldnt waive it. I had to resort to getting a temporary line of credit with a impact on my credit score to simply get my devices fixed. Once getting the funds available for a temporary hold, I come to find out that when they ship the devices it is for weekday delivery only. I could understand if this was going to a business but to a residential address. This doesn't really work for low income or limited income consumers. This doesnt work for someone that needs their devices quickly if you open the claim on Fridays or the Weekend. Between this and the other hassles I have had before including never receiving a refund for my claim that wasn't processed even with numerous emails I couldn't recommend this to anyone, get the insurance from your provider. I wish I could say it was better.Update:After going through and getting the line of credit I did end up getting my devices replaced. Still haven't had my other portion of this review addressed nor am I overly satisfied with the process. Still would not recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "stonks",
          "Nb_Reviews": 3,
          "Date": "2021-01-27T21:49:58.000Z",
          "Titre": "Terrible company and shady practices",
          "Contenu": "Terrible company and shady practices. They only do wire transfers which aren't secure (where is the customer portal?), they lie to you, they never read your emails, they do not answer questions, they need pins/passwords and wont even give a short answer as to why (just to check and see if it works maybe, but nah nothing, ignored) or to completely wipe your device before sending it in, there's no grantee you will get your device back, many people have issues with their devices they previously had no issues with once they get them back. With me I haven't even sent them my device because its been a nightmare. They didn't file my claim for a long time and I had to file it a couple times for it to work, then they just ignored all my questions, I get a random money wire request when they said it would be $29-49 deductible and it would be determined one at the facility (obviously not), it has been over a month and they are demeaning, they ignore all my concerns, cant answer any questions, I paid for a service I did not want, but tried to use them and give them the benefit of the doubt; now they are trying to cheat me and not guarantee I will get my device back for a simple repair. Why? I would be worried about your personal information with this company. I will take my L and $ elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dj",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T17:17:58.000Z",
          "Titre": "Awful service.",
          "Contenu": "Awful service.. hold times are extremely long. Email was not responded to. Finally get through and they tell me they will get back to me in 24 hours. They even send me an email saying this. It has been 3 days, no call and no reply to that email..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marcelino Saiz",
          "Nb_Reviews": 3,
          "Date": "2023-05-09T12:44:33.000Z",
          "Titre": "the worst  DO NOT BUY",
          "Contenu": "servify.tech provides the worst possible customer service EVER - DO NOT BUY!!!!Our phone got stolen, so I called to file a claim and here is a recap of the terrible service!!DAY 1Went to the Samsung Care + website and attempted to file a claim, account information not recognized, so I called the support telephone number. I explained the situation to three different people and then got disconnected. Total time 16 mins.Agents spoke with a terrible accident and the connection was spotty at best.Agents attitude was very unpleasant.Called again, after 15 mins, I was told that the policy is with servify.tech.Called servify.tech - I was rudely informed that the claimed had to be filed via the website.Submitted the claimed with the police report.2 Days LaterCalled servify.tech - I was rudely informed that the claim takes 3-5 business days to process. 18 minute call.4 Days LaterNo new updatesCalled servify.tech - It took the agent 19 minutes to find out that it's still in process. i was told that it would be \"A LITTLE TIME\" to process. Explained the the agent that I was told it would be 3-5 business days for processing, so the agent raised the issue with their manager.I requested a call back from the manager - but first I had to explain that they could not call me back at the telephone number of the stolen phone, alternate number provided.I will not hold my breath for the call back.Day 9no call backno updates to the claimno replacement phoneDay 14it wasn't until I emailed several of the co-owners, via LinkedIn, that finally something got done.Day 17FedEx is suppose to deliver the replacement phone today."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Justin Richardson",
          "Nb_Reviews": 2,
          "Date": "2021-04-11T02:43:35.000Z",
          "Titre": "This company is a SCAM",
          "Contenu": "November 2019 purchased a 1 year extended warranty for a phone.Supposed to cover electrical malfunctions and extend manufacturers warranty. Phone started smoking while being charged by the manufacturers charger.Reported issue to Servify for warranty coverage. This company has tried to twist every line in their contract not to pay out a warranty claim, they quoted:(Fortuitous events; including, but not limited to : environmental conditions, exposure to weather conditions or perils of nature; collapse, explosion or collision of or with another object; fire, any kind of precipitation, lightning, dirt/sand, smoke, nuclear radiation, radioactive contamination, riot, war or hostile action are not covered')So the phone starting to smoke inside a vehicle, not exposed to any elements being charged by a OEM charger is a Fortuitous event apparently. This company is a scam!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Salvador Batlle",
          "Nb_Reviews": 2,
          "Date": "2023-07-21T19:55:43.000Z",
          "Titre": "Asurion's Failed Phone Repair: Forced Costly Replacement",
          "Contenu": "I feel compelled to share my recent harrowing experience with Asurion, which turned out to be an absolute disaster. Instead of fixing my phone as promised, their incompetence and negligence led to an expensive replacement that cost me far more than it should have.Initially, I approached Asurion with the hope that they would repair my phone efficiently and at a reasonable cost. However, my hopes were quickly dashed as the repair process dragged on without any progress. Despite numerous assurances, they failed to address the issues with my phone properly.Weeks passed with no sign of my phone being repaired, and every time I reached out for updates, I received vague responses that left me more frustrated. The lack of transparency regarding the status of my repair was beyond infuriating, and it became evident that they were not making any genuine efforts to fix my device.As the situation worsened, it became apparent that Asurion's promise of a swift resolution was nothing but empty words. I had already invested time and patience into waiting for a repair that seemed never-ending, only to be left with a malfunctioning phone.Finally, I reached my breaking point and decided to demand a resolution. Instead of fixing my phone, Asurion suggested a replacement, which would cost me even more money than what I initially paid for their repair service. This additional expense was completely unjustified, considering it was their incompetence that led to this situation in the first place.In the end, I was left with no choice but to pay for the replacement. Asurion's failure to fulfill their promise of repairing my phone left me with an unnecessary financial burden, adding insult to injury.My encounter with Asurion has been nothing short of a nightmare. Their inability to carry out a simple repair resulted in additional expenses and a significant waste of my time and energy. I strongly advise everyone to think twice before trusting Asurion with their valuable devices, as their empty assurances and incompetence can lead to disastrous consequences."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "James Bennett",
          "Nb_Reviews": 1,
          "Date": "2021-07-26T13:14:57.000Z",
          "Titre": "Don't Waste Your Time and Money",
          "Contenu": "Terrible service, did not repair the phone properly, and sent me back a phone with half the internal storage of the one I sent them!Update 0:I'm going to post the email correspondence here. The only changes I make will be to censor personal info and remove any links included in the emails.Update 1 (2020/07/20) Email to Servify:Hi, I am following up on a review I left on Trust Pilot.This is the email account that should be registered with Servify. Last year, I submitted a warranty claim with Servify for my 256 GB One Plus 6. There were 3 hardware issues:The back glass was broken.The lens cover was broken.The main camera was damaged.After a month of waiting, I finally got my phone back and only 1 and 2 were resolved. The camera was still damaged. I tried to resolve this with Servify at the time, but they were not willing to help me and I was tired of dealing with it so I relented.However, I just realized that they sent back a 128 GB One Plus 6!  This is hugely frustrating, and I am livid that I did not notice earlier. I did not consider it to even be an option.I realize that you likely have some 90 day policy, but I implore you to make an exception. This kind of mistake is exceptional, and should be unacceptable to a company with any level of quality control. Warm regards,JamesUpdate 2: (2021/07/26) Several replies from Servify I had intended to paste all the replies in here, but things have gotten messsy. Servify started replying to my original complaint email, which I made before posting this review. At this point, Servify is willing to replace the 128GB board with a 256GB board. I am inquiring about them also fixing the camera that they ignored last time I sent it to them. Admittedly, I am nervous to send the phone off to them. Last time it took a month to get the phone back, and obviously it didn't come back in the state I had hoped. We'll see what happens this time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cole Free",
          "Nb_Reviews": 1,
          "Date": "2020-10-27T19:38:15.000Z",
          "Titre": "DO NOT BUY THEIR INSURANCE!!!!!!",
          "Contenu": "absolutely horrid experience! absolutely must avoid this company. so for about a month I have been trying to get my one plus 7 pro repaired. between taking multiple days to respond to my emails they finally hit me with this.\"Hi Cole,​Greetings from Servify!Thank you for your patience.We tried contacting you on (my not working phone), unfortunately, we could not connect through.​As per the update received from our team, unfortunately as of now, we do not have the parts to repair your device and we are unsure of the arrival time. Hence, in order to avoid any delays, we would request you to kindly raise a chargeable request through OnePlus to have your device repaired and we shall have the repair amount reimbursed back to you minus the amount of your mandatory deductible under the contract.You may reach out to experts from OnePlus through https://supp*rt.oneplus.comWe request you to kindly let us know your response to this alternative.Should you have any additional questions/comments please feel free to write back to us at u5_support@s*rvify.tech or call us on 1833 313 3331.Thanks,AakashTeam Servify.\"personally I have never heard of a company telling a customer to pay out of pocket and then send them an invoice. I might as well be begging them to screw me over. I'm thoroughly disappointed in oneplus for offering service from this company and as much as I love my one plus phone this situation is enough for me to never buy their products again as they cant do anything about this either even though I spent 2-300 dollars on the insurance through them. I am even more disappointed in them offering this service after reading the various reviews on here and BBB. Save your money and don't buy this insurance, hell don't even buy the one plus phone, just go and buy a phone through your carriers retailer and get their insurance cause at least they will take care of you. one plus what kind of sick joke is this whole situation.-Update 1: servify has reached out to me and appears to be trying to resolve the situation. I will update back periodically with what has happened.-Update 2: they had me send the phone out to their service center in ohio-Update 3: 10/25 they called me to let me know they did not have parts availability and they would be replacing my phone. no only are they doing this but they are replacing my 1+ 7pro with an 8 pro. will update again when I receive the new phone.Update 4: on the 25th I paid the deductible, I would have assumed that this meant they would have shipped out the phone next day. I also emailed them back that it had been paid. today is the 27th and I finally got a response back, which has me rather perturbed that it took 2 days to get even a response back. not to mention that they still have not shipped out the phone. I have lowered the rating back to one star. as the email states\"Hi Cole,Greetings from Servify!Thank you for your response.Please be informed, we have forwarded your request to the relevant team to look into it. Once we get an update, we shall update you accordingly.Should you have any additional questions/comments please feel free to write back to us at us_support*servify.tech or call us on 1833 31E 3331.Regards,AakashTeam Servify\"I would have expected things to have gone much smoother with them considering the insurance has cost me 300 to begin with and now another 100 for deductible. I am extremely disappointed in this company in that it takes them extremely long for anything to happen. I will update again when I finally get tracking on the phone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Abraham Weinberg",
          "Nb_Reviews": 1,
          "Date": "2020-09-18T04:37:13.000Z",
          "Titre": "They refuse coverage",
          "Contenu": "They refuse coverage. Worthless policy."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Victor  Bribiesca",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T15:47:47.000Z",
          "Titre": "At least have my replacement",
          "Contenu": "First problem when i did the claim took 8 hrs for the claim to be accepted.Second there is not an option to choose a cell phone color ( my original was a exclusive lime green from Samsung) Third it took almost 2 weeks for the cell phone to arrive, luckily I have 2 old phones that I can use"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Hashan Peiris",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T03:16:05.000Z",
          "Titre": "Basically everything the others have said. Do not use Servify!",
          "Contenu": "Everything the others have said. I purchased a Samsung S23 Ultra the day it came out, as I have been every other year. I have dealt with Samsung Customer Service on issues like screen replacements in other countries (UAE, SL, etc.), and everywhere else, it is a 2-day service even for cracked screen repairs. So, with the same expectations, I sent mine for repairs to Servify, this time while residing in the US. Boy, could I have been more wrong about my expectations! The device was delivered to them within 3 days, but there was absolutely no update on the portal for three weeks. It took 4 weeks to get a reply to my email inquiries. A phone call revealed that it was being held for a new chassis (which is understandable; it had only been a week since the phone was released), and a month and a half later was sent back with the chassis and the screen fixed but with the same VERY visible scratch on the wide-angle lens cover which blurs some images at certain angles.Now they want me to send it again for repairs which I have to pay $99 again. Guess who won't be buying any insurance that has anything to do with scammy companies like this? I plan on writing to Samsung CS so they know better than to work with these third-party services."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Norkham Syavong",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T04:08:57.000Z",
          "Titre": "I don't like it",
          "Contenu": "I don't like it. Because it taking so long to fix my phone and service is not helpful."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ERIC",
          "Nb_Reviews": 4,
          "Date": "2020-09-25T15:14:31.000Z",
          "Titre": "5 min repair took them over 1 month to repair.",
          "Contenu": "PLEASE FOR ANYONE THAT IS INQUIRING ABOUT THEIR SERVICED DON'T BUY THEIR PRODUCT. FIND A LOCAL PLACE, THIS IS NOT WORTH IT. HAD TO RESCHEDULE TRIP DUE TO THEM LYING ABOUT WHEN I WOULD GET MY PHONE.I originally purchase the warranty for my Oneplus 6t directly from the Oneplus website back in 2018. My phone took a fall recently that shattered the back glass, so I gave them a call they guided me threw the steps necessary to ship them my phone, getting back with me within the day. I have an email stating that they will contact me when my phone arrived, good thing I'm able to track the package with UPS, the phone arrived at their facility Tue 08/11. Since I did not hear from them I reached to them on 8/15 they responded, the same day \"We would like to notify you that your device has reached our service facility and the same is under repair. We would like to confirm if the passcodes or lock pattern were removed from the device? In case, if you have not, kindly help us with the same as it will help us diagnose the device.\" - Mahesh Negi Then they kept asking me for my unlocking code for \"Diagnostics\". Then on 8/21 I get an email stating \"Apologies for the delay. Unfortunately, as we check, there has been a delay due to the unavailability of the required parts. We shall update you once we receive them and the device has been repaired.\" - Mahesh NegiThis made no sense to me because on 8/15 it was getting repaired already. On 8/24 I email them I stating that I want my phone back by 9/25/2020, I did not get a response, so I call them on 8/25 asking for them to ship my phone back ASAP even if it's not fixed, the rep. tell me to give him 2 days to resolve this. I tell him I don't mind waiting I just need my phone back by the 5th of September. On the 8/27 I get an email \"The repair is currently under progress and it should be repaired shortly. We shall update you shortly.\" -Mahesh Negi my phone is \"currently\" being repaired again. Finally, on 8/29 they send me an email that repairs are done and ready to be shipped, I correct the shipping address because of course my address isn't even there, and they send me a bill. On 8/30 they send me the same email from the day before, so I tell them that I will pay them when I get my phone back. On 9/1 They email me \"Unfortunately, it would not be possible for us to ship the device until the payment of the deductible is processed.\" -Mahesh Negi So now they are holding my phone hostage unless I pay them first. Which under normal circumstances, I would not mind but when they keep me uninformed, keep my phone over 21 days, outright lie to me about the status of my phone, and only reach out to me to collect a payment, that's too many red flags. I have responded to them saying that I will give the ransom but they will have to guarantee delivery of my phone by 9/5/2020.  I called them and they said that they would get it to me by the 5th if I paid. So while in the phone with Aakash Sunil Upadhyay (same person that told me my phone would arrive by Sat 5th of sep). After I paid they ignored the fact that I was leaving the country on the 6th and they got it delivered on the 8th of Sep. Almost like they waited on purpose so that it would arrive extra late.I gave then an extra star for the refund of the deductible."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Group Aprise",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T22:39:28.000Z",
          "Titre": "Samsung Warranty passed the buck to Servify",
          "Contenu": "The repair facility, uBreakiFix, did a very good job with the repair.  Through no fault of their own, the process was confused by Samsung warranty and Servify.  For some reason I had to intervene because a warranty repair still required Servify involvement simply because the phone had coverage.  In my opinion, Samsung should have managed the entire transaction under its own roof as a warranty issue."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Waldhelm Waldhelm",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T20:32:03.000Z",
          "Titre": "Was able to get what we needed but the…",
          "Contenu": "Was able to get what we needed but the person was hard to understand.  Had to call three times for help"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gautam Ramchandani",
          "Nb_Reviews": 4,
          "Date": "2023-12-01T14:59:02.000Z",
          "Titre": "They sent me a defective replacement z…",
          "Contenu": "They sent me a defective replacement z fold4"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve W",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T13:16:11.000Z",
          "Titre": "Communication Difficult",
          "Contenu": "I had a warranty issue to replace my phone. The claim website was ambiguous for my situation so I felt I needed to call/chat. Knowing where to call was also not made clear. I wasted time first by unknowingly chatting with Samsung directly. Then with Asurion, who sold my plan to Servify. Finally Servify was a nightmare on the phone, specifically just trying to clarify my mailing address, which I found out the next day the person didn't update. All of this added 3 more days to get a replacement. The actual replacement went fine, but the communication was unnecessarily stressful and a huge waste of time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dominic R",
          "Nb_Reviews": 2,
          "Date": "2023-10-06T20:43:31.000Z",
          "Titre": "Mediocre at best. Servify doesn't seem to care about the actual repair experience...",
          "Contenu": "Mmmm. Where do I start. So I have a Galaxy Z Flip 5, which is relatively new and after about 12 days of having it, it had a very tiny LCD defect in the middle of the internal screen. Samsung said I could return it, but I wouldn't be able to replicate the pre-order deal, if I re-ordered. Luckily I had the insurance, and filed a claim, but the local store, uBreakiFix, didn't have the \"color\" for my screen replacement yet (they later explained to me they had to replace the entire housing of the phone, hence why the color needed to match).Anyway, I called the store a few times and was still waiting on the color. I decided to email servify to see if I could just change the repair facility and send it to Samsung instead. They sent me this boilerplate email in reponse, I don't even think they read the email, that helped with nothing and basically I had to recreate the entire ticket from scratch.At this point I was kind of ticked, and sending it to Samsung would have been 10 business days+ without the phone. Eventually I decided to wait and a week or so and they finally had the color. I dropped it off after lunch and it was fixed same day and picked up before the store closed for the day.uBreakiFix gets 5 stars because this wasn't their fault. Servify I hesitate to give more than 3 stars, because the experience was kind of garbage for a ”premium” insurance experience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin Zhu",
          "Nb_Reviews": 2,
          "Date": "2020-10-21T21:12:39.000Z",
          "Titre": "Claim accepted, but needlessly difficult",
          "Contenu": "Difficult experience.  Bought a oneplus 6 with accidental coverage. Filed an accidental water damage claim and had to call and email daily for a week to get any update on my claim, each time being told \"tomorrow\" (last few calls I was told there was a \"global email outage problem\" for them). After a week I was fed up and wrote reviews on here, BBB, facebook, and google.  Got a reply on all sites and the next day my claim was approved.  Was able to mail out my phone the next day and got it back in a week with a complete part replacement (excluding back shell). Happy with the repair but their responsiveness could be much better"
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Sudhir Baranwal",
          "Nb_Reviews": 1,
          "Date": "2022-05-19T13:29:30.000Z",
          "Titre": "Bad experience",
          "Contenu": "Bad experience - so much delay in service.I sent my samsung tab for repair and due to their worst and useless process it took 2 days to pickup from my address and another 2 days to deliver to Samsung service center \"QDigi Services Raj Nagar, Ghaziabad\". The Tab has been repaired on Monday i.e. on 16th May 2022 but still I am waiting for the delivery. Servify guy did not pick the Tab from the service center and deliver to my address.The servify guy (don't know his name) mobile number - 8130510203. Samsung service center is saying that no one came here from Servify to pick the Tab. And Servify guy is saying, they did not get pick up request.As a customer, I should not to bother about the process. This should be smooth from both sides, Samsung Service Center and Servify.Finally, I got my Tab today after so much follow up with Samsung Service Center and esclating the issue. Few feedback to Servify team :-1. Please improve customer care contact. It's quite pathetic. I could log my issue after waiting more than 20mins. 2. Please make the process smooth. I had to call multiple times to Samsung Service Center and Servify Guy just to pick up the Tab and deliver to me.All well that ends well. Thanks to Servify Team who took care my case and resolved in short time period after esclation. Hope for smooth process in future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Van Beveren Gabriela",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T15:02:31.000Z",
          "Titre": "It's great until it's not",
          "Contenu": "The process was quick although I will say, the online portion was not user friendly. It was unclear what the hold up was during the initial process. had to call and speak to representative who couldn't help me get past that one page. That delayed things and was very frustrating to me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sczublewski Aileen",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T16:19:52.000Z",
          "Titre": "Good job",
          "Contenu": "Took a minute for the part needed to arrive, but everyone was courteous, respectful & helpful. Job completed to our satisfaction."
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "Сергей Бокуть",
          "Nb_Reviews": 3,
          "Date": "2023-04-26T14:21:59.000Z",
          "Titre": "I replaced screen on my Galaxy s23…",
          "Contenu": "I replaced screen on my Galaxy s23 using Samsung care plus. It took 12 days and the result is nice .  4 stars because : 1) waiting time is a little bit long for simple screen replacement 2) I switched my phone to maintenance mode (special mode for repair, in which all private data are hidden) and ask them to not remove my data, but returned phone was with clean system . It's nice, that I did backup"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sherry Green",
          "Nb_Reviews": 2,
          "Date": "2023-05-15T19:39:48.000Z",
          "Titre": "I had a great experience both times…",
          "Contenu": "I had a great experience both times that I've had to use my Samsung Care+. I dropped my phone once and cracked the back. I was able to submit my claim through Samsung Care+, set up my appointment with UBreakiFix and was able to get it replaced the same day. I, unfortunately dropped my phone again, and this time I cracked my front screen. Once again, I was able to submit my claim through Samsung Care+ with UBreakiFix and was able to get it replaced the same day because they had the part in stock. I haven't had any bad experiences and the money I paid for my Samsung Care+ was worth it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T22:46:12.000Z",
          "Titre": "Pretty straightforward."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michel",
          "Nb_Reviews": 1,
          "Date": "2021-04-19T03:27:23.000Z",
          "Titre": "Great customer support",
          "Contenu": "Was facing an issue while logging into the app, as it used to be stuck at the home screen. But the executive got in touch and fixed the issue. Happy with the support."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark E",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T23:37:53.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service!  Feel like a brand new phone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chanie Feldman-Levin",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T20:07:19.000Z",
          "Titre": "Andrew was amazing",
          "Contenu": "Andrew was amazingHe was so helpful and patient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "itsa777",
          "Nb_Reviews": 5,
          "Date": "2023-12-20T13:24:33.000Z",
          "Titre": "Fast service and the parts were readily…",
          "Contenu": "Fast service and the parts were readily available."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rische Ulli",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T14:52:49.000Z",
          "Titre": "What a wonderful surprise!?!",
          "Contenu": "What a wonderful surprise!?!      Wow! I spoke with a super friendly agent about an issue with my phone. She steered me in the right direction and handled my request for a replacement phone in a timely manner. Excellent!     100% satisfied customer. 5 thumbs up!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samuel",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T04:11:55.000Z",
          "Titre": "Broken screen replaced, and other issues fixed",
          "Contenu": "I had my screen cracked at work, so I used my $29 Samsung Care+ claim and sent my phone into them. It took about two weeks, give or take a couple of days, but I got my exact phone back and they even put protective film over the metal body! It looked brand new and was so fun to basically have a brand new phone. PLOT TWIST: They replaced two camera modules that were malfunctioning! I had problems with the 10x camera but thought it was software. Nope. It was hardware issue and they fixed it at no extra cost! I was surprised and extremely pleased with the quality of work they did! My screen was fixed, and my camera issue was fixed as a bonus!!! Other than the length of time I had to borrow an iPhone SE as a replacement (that drove me crazy with the iPhone keyboard) there were no complaints. The service was rendered correctly and above my original request. Well done!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:32:10.000Z",
          "Titre": "The exchange provess was done…",
          "Contenu": "The exchange provess was done flawlessly. It was quick and easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miguel Garcia",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T18:15:32.000Z",
          "Titre": "Fast understanding and caring I call…",
          "Contenu": "Fast understanding and caring I called with Situation happening to my phone. They told me my options gave me a price and the rest was history. The person that I was speaking with  was very understandable of my situation.He  Made the whole process very easy and fast my phone was replaced in a short time and now life moves on, thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hans Lee",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T00:10:09.000Z",
          "Titre": "Really happy with Samsung Care + service",
          "Contenu": "It was excellent to program to keep the same level of condition of my phone from any unexpected damages. My three-month phone god a severe damage on the main screen by falling object and was replaced with a like brand new product next day of the service request via an overnight service for delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beshears Wanda",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T09:22:02.000Z",
          "Titre": "I'm still without a phone",
          "Contenu": "I'm still without a phoneMy phone is not working still cannot make phone calls and text messages.. I've already made two trips to the you break it I fix it place and then I called Samsung and they haven't responded. I've been paying insurance My phone is paid for I don't understand why they will not send me a phone and let me send mine back to them"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin W.",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T23:47:49.000Z",
          "Titre": "The process was very fast and easy!",
          "Contenu": "The process was very fast and easy. When I called in, there was barely any wait time. I got the order number I needed to complete my warranty fix to the store and it was transferred while I was still on the phone with the technician. Great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mr. Smith",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T22:20:45.000Z",
          "Titre": "Awesome service, made it feel personal",
          "Contenu": "The person I spoke to kind and knowledgeable. The speed was just awesome on when I was going to receive my replacement phone it showed up a day early. I personally highly recommend them"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cynthia Kelly",
          "Nb_Reviews": 5,
          "Date": "2023-11-04T04:13:44.000Z",
          "Titre": "Great service and extra help",
          "Contenu": "The tech was able to replace my phone screen within a couple of hours, so I didn't have to give it up for very long.  When I went to pick it up, he also gave me some much-needed help on my new Samsung watch without any extra charge.  I really appreciate his expertise and willingness to help me become functional again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T. Hall",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T16:36:22.000Z",
          "Titre": "Fast and Proffessional",
          "Contenu": "Great crew that provided fast repair and excellent customer service. They saved me a lot of headaches. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Efrain/Ambriz",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T16:47:46.000Z",
          "Titre": "Servify is great and easy to use",
          "Contenu": "Servify is great. It is the actual repair place that needs to hire more techs. The repair claim and scheduling was very easy and fast. The actual repair time was crazy. Especially just for a screen rapair."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerald",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T16:19:32.000Z",
          "Titre": "it was easy to do no effort on my part"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DeeDee",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T03:40:05.000Z",
          "Titre": "Very knowledgeable",
          "Contenu": "Very knowledgeable,  professional  fast and easy service. I was able to get my phone replaced  the same  day without having to wait."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brown Tanganyika",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T08:57:27.000Z",
          "Titre": "Awesome experience!!",
          "Contenu": "Ubreakifix was a great experience compared to sending your phone off for repair. They greeted me at the door (great customer service). Explained my options per my insurance (great communication). This was a simple efficient and effective process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RM",
          "Nb_Reviews": 5,
          "Date": "2023-11-22T19:26:25.000Z",
          "Titre": "Used with samsung care",
          "Contenu": "Used with samsung care, the phone was fixed nicely and fast for the screen repair even tho it was more of very deep scratches. Got it fixed at a ubreakifix location"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bluecam",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T18:24:40.000Z",
          "Titre": "Servify was extremely responsive…",
          "Contenu": "Servify was extremely responsive and provided a replacement phone within a day. Everything was easy to accomplish online without any hassle. I would say this is the best device protection out there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "René A. Medina",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T12:20:49.000Z",
          "Titre": "Servify made it easy to get my phone…",
          "Contenu": "Servify made it easy to get my phone repaired within a business day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don Davis",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T23:12:32.000Z",
          "Titre": "Outstanding Customer Service",
          "Contenu": "Broken cellphone.  Servify rep helped me id the best solution.  New phone arrived on schedule and old phone was credited immediately after receipt.  Service first rate, responsive, courteous and professional.  I highly recommend Servify."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ramsey Graham",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T16:31:20.000Z",
          "Titre": "My replacement phone arrived the next…",
          "Contenu": "My replacement phone arrived the next business day, and everything went very smooth"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LaTasha Nicholson",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T20:25:37.000Z",
          "Titre": "Reasonable fee for repairs",
          "Contenu": "I appreciate the amount of screen repairs allowed for $29, I'm never one to crack my screen but within 2 weeks I had 2 accidents i'm embarrassed about. But thanks to Samsung Care + I wasn't charged an arm and a leg for repair. Thank you Samsung."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Noble",
          "Nb_Reviews": 3,
          "Date": "2023-10-07T01:19:08.000Z",
          "Titre": "Samsung at The Americana Mall…",
          "Contenu": "Samsung at The Americana Mall (Glendale) and the mail-in service, both did a great job taking care of my replacement phone.  Very happy to have my Flip restored and working again."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "DGB",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T11:40:27.000Z",
          "Titre": "My iPhone 13 pro max got completely…",
          "Contenu": "My iPhone 13 pro max got completely drenched, thanks to this never ending rain. Life came to a standstill. one visit to the service centre made the dead phone alive. Thank god I had bought protection plan which at that time i felt was unnecessary. Little did I know that  accidents can happen anytime anywhere and to anyone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arvah Rana",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T14:38:03.000Z",
          "Titre": "The experience was simple and easy",
          "Contenu": "The experience was simple and easy. Made having a warranty worth it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken W",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T07:36:03.000Z",
          "Titre": "Wifi died on fold 3 and samsung care fixed it",
          "Contenu": "My wifi would not turn on. I was able to schedule the service request online and select an authorized repair shop near me. I took it to ubreakifix and they replaced the inside screen which fixed it. I was without my phone for only half a day and no cost to repair. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Villalobos Jocelyn",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T14:56:12.000Z",
          "Titre": "Quick, easy and helpful",
          "Contenu": "They helped me replace my phone and I have had no issues at all with my new phone. Process was quick and easy. It took less than three days to get my new phone back."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Aloupis",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T02:56:40.000Z",
          "Titre": "Seamless and VERY satisfied",
          "Contenu": "The entire transaction from start to finish was seamless. I made the phone call to initiate my claim at 9am on Saturday 9/23 and by 6pm the same day, my phone was fixed (as good as new)."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Amin Shaikh",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T09:39:23.000Z",
          "Titre": "I recently bought a new vivo V27 phone",
          "Contenu": "I recently bought a new vivo V27 phone. I wasn't aware that there was a plan called vivo v shield by servify that covers fully damaged repair costs which vivo doesn't. Also appreciate the store guy who suggested me this."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chase Choi",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T20:49:42.000Z",
          "Titre": "The next day shipping was incredible…",
          "Contenu": "The next day shipping was incredible and the customer service answered all of my questions"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C. Gent",
          "Nb_Reviews": 13,
          "Date": "2023-12-01T15:03:49.000Z",
          "Titre": "Broke my screen again, but Samsung's tech saved the day",
          "Contenu": "My device was repaired earlier than promised and as has been my previous experience with repairs at the Samsung location, the repairs were done with original factory parts by skilled techs to restore my phone to as close to original specifications as possible after I unfortunately broke my screen again..."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Joe Dias",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T12:38:38.000Z",
          "Titre": "great experience with my realme phone",
          "Contenu": "Recently purchased a realme phone and then sales guy told me about realme care, which I liked since it protects me from high repair costs, esp since we have an energetic toddler and 2 dogs in the house. Needless to say, within a month of buying the device and the plan, I needed to use it - but the whole thing was pretty easy. Fully digital stuff, no hidden charges. 10/10 will recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlie Reckenberg",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T19:36:27.000Z",
          "Titre": "Service Review",
          "Contenu": "Did a great job to rectify issue in a timely manner"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Saloni Vyas",
          "Nb_Reviews": 1,
          "Date": "2022-07-02T15:23:15.000Z",
          "Titre": "Today i am purchasing new i phone 13…",
          "Contenu": "Today i am purchasing new i phone 13 accord store rajapark, Jaipur and meet servify person mr amit sharma we are best exchange value provided very good farewell person tysm amit ji splcl thnks mr Nitin Amin. I am very happy 😊"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phira Chey",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T05:15:12.000Z",
          "Titre": "Everything was amazing",
          "Contenu": "Everything was amazing. Very fast service and response. I have raved to so many people about Servify. Thank you so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roy Smith",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T13:46:39.000Z",
          "Titre": "The transaction waGreat transaction s easy and flawless",
          "Contenu": "The transaction was easy and flawless. I am truly impressed with the team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clifford Goniea",
          "Nb_Reviews": 3,
          "Date": "2023-11-22T23:41:41.000Z",
          "Titre": "Prompt response",
          "Contenu": "Prompt response. Quality service. Easy to use. Worth the premiums and the co-pay."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy Atterberry",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T01:02:17.000Z",
          "Titre": "I appreciate that my needs were taken care of to a high degree",
          "Contenu": "I appreciate that my needs were taken seriously and I felt like an urgency was put on solving my problem.  The Servify team repaired my phone and got it back to me quickly.  Their customer service is outstanding."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlie Cheng",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T20:12:00.000Z",
          "Titre": "Great service beginning to end.",
          "Contenu": "It's simple to file a claim. I was notified thru each step of the shipping, receiving, repair process. The repair work was excellent. Device was better then when I sent it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "floyd spriggins",
          "Nb_Reviews": 3,
          "Date": "2023-07-25T01:24:42.000Z",
          "Titre": "So this is my second time dealing with…",
          "Contenu": "So this is my second time dealing with Servify for another cracked screen and after my first horrible experience I can truthfully say that Servify made up for it this time. My screen cracked again so I brought it to the repair technician and she gave me Servify direct number. I spoke to Akash ( Great Servify Representative)and he had me taken care of in 10 minutes. My phone was repaired right on the spot and it took a little over an hour. I will retract my first review of Servify and will say that they are not trash and the best for Samsung phone owners. The pricing cant be beat and if you call the direct number they will take care of you instantly. And whoever recommended Akko below are out of their mind. That company are true scam artist and cheap for a reason. Thank you Servify. I will give credit where credit is due."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Gadget Geek",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T01:46:40.000Z",
          "Titre": "My iWatch was saved, thanks to Servify",
          "Contenu": "My prized possession, my iWatch broke in an accident. Thanks to Servify, once the issue was raised, it got picked up the very next day from my home and the repair was done without much hassles. The customer service team was very responsive and kept me updated on the status. This was my first experience with Servify and I highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth Heaton",
          "Nb_Reviews": 5,
          "Date": "2023-11-03T21:34:18.000Z",
          "Titre": "Servify is great!",
          "Contenu": "Servify made receiving my replacement phone and returning my broken device easy, quick and efficient. Their staff are courteous, competent, and committed to serving their customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zack Guerin",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T18:19:22.000Z",
          "Titre": "Tech was helpful and fast at resolving…",
          "Contenu": "Tech was helpful and fast at resolving the issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Soni Deepanshu",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T11:41:17.000Z",
          "Titre": "Got the replacement within 2 days…",
          "Contenu": "Got the replacement within 2 days turnaround time. 5 stars"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Walton Marvin",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T12:18:36.000Z",
          "Titre": "Screen Replacement",
          "Contenu": "They handled my issue swiftly and efficiently"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elmer Daclan",
          "Nb_Reviews": 2,
          "Date": "2023-10-20T19:35:53.000Z",
          "Titre": "Really worried about my broken phone",
          "Contenu": "Really worried about my broken phone, and servify helps me this, easy and fast transactions..thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlos Mauricio Jacome",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T17:00:31.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. Fast and easy."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Syed Asif",
          "Nb_Reviews": 1,
          "Date": "2022-04-04T12:46:54.000Z",
          "Titre": "Phone Repaired and Received",
          "Contenu": "LJKAWVTAPVWX is the reference ID. My claim has reached Servify through Samsung Care Plus plan, they are verifying my documents from 5 days. I have raised a claim on 22nd March for my S22 ultra. While purchasing the Samsung Care Plan, the Samsung team told me that the care plan will be served by a very reputed company \"Servify\" and they are very good at their work and very fast and customer focused, but now I am so very disappointed. When the Samsung team is trying to reach them to enquire about the delay in verification, Servify is not replying to them. When I try to reach Servify team, they ask me to approach Samsung. If Servify doesn't update Samsung, what will they do? Either Samsung should change the vendor or Servify should improve, otherwise we (customers) will have to suffer. It's a lesson for everyone to learn from me. Now what am I supposed to do? I'm really upset after paying 10k for the plan and 1.25 lakhs for my phone, I am not getting any satisfactory response either from Samsung or Servify"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Chaudrue",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T15:27:25.000Z",
          "Titre": "Efficiency",
          "Contenu": "Efficiency, attention to detail, and no hold time!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Sandip Dasgupta",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T07:43:13.000Z",
          "Titre": "I was not expecting that my product…",
          "Contenu": "I was not expecting that my product would be replaced, the wait was a little long but servify dealt it with great compassion and professionalism"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AB",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T16:12:37.000Z",
          "Titre": "Highly recommend their service",
          "Contenu": "Highly recommend their service! Needed repairs and the team provided excellent Samsung Care + service! Everything was done as promised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Volk",
          "Nb_Reviews": 7,
          "Date": "2023-11-23T16:34:27.000Z",
          "Titre": "Restored my phone to new condition !"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Kiran Rathore",
          "Nb_Reviews": 1,
          "Date": "2022-06-18T17:09:49.000Z",
          "Titre": "Today I am visiting croma vasali nagar…",
          "Contenu": "Today I am visiting croma vasali nagar i am satisfied exchsnge value from servify tysm amit ji and croma jeetendra ji special thanks nitin amin very veryyyyy good great service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex Del Orbe",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T17:23:08.000Z",
          "Titre": "Great actitud",
          "Contenu": "Great services actitud. Excellent repair service.Wonderful costumer services"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Drewniak",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T11:52:52.000Z",
          "Titre": "Well done all together"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elice Roy",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T16:34:43.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Was thrilled at how fast they shipped out my replacement device. Thank you so much!"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Martina Rizzo",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T16:24:37.000Z",
          "Titre": "I lost my Samsung S23",
          "Contenu": "I lost my Samsung S23, filed a claim, and received the replacement device the next day as promised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cari Donatell",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T22:48:54.000Z",
          "Titre": "quick and easy",
          "Contenu": "Swap was quick and easy and I was able to keep most everything from my old phone."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Satish Gudari",
          "Nb_Reviews": 1,
          "Date": "2022-10-13T08:32:44.000Z",
          "Titre": "Today I i am purchasing new iPhone…",
          "Contenu": "Today I i am purchasing new iPhone 14plus and exchange devices servify. Very good service mr amit Sharma"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DONALD",
          "Nb_Reviews": 3,
          "Date": "2023-09-14T21:06:41.000Z",
          "Titre": "Samsung prompt automated return …",
          "Contenu": "Samsung prompt automated return  service for warrenty was fast and efficient.  Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janneritza Polanco",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T16:55:32.000Z",
          "Titre": "Speedy and great service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Duane",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T20:30:13.000Z",
          "Titre": "Took care of claim quickly and helpful…",
          "Contenu": "Took care of claim quickly and helpful to find a local area for repair."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicone",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T17:17:54.000Z",
          "Titre": "It was fast",
          "Contenu": "It was fast. Every support was really appreciated"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Quintero April",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T03:44:52.000Z",
          "Titre": "So helpful",
          "Contenu": "So helpful, Did not have part un stockRep searched all over to get partRepair was perfect, like new"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MattH",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T22:14:59.000Z",
          "Titre": "All good!",
          "Contenu": "No issues, everything went smoothly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Osvaldo L",
          "Nb_Reviews": 3,
          "Date": "2023-03-10T23:42:40.000Z",
          "Titre": "Servify reliable company.",
          "Contenu": "Ok, really servify did a very good job, listening my complaint, really I don't expect the refund, but they did it, they are very professional and they care about their customers, very good servify."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Aastha Arora",
          "Nb_Reviews": 1,
          "Date": "2022-03-24T09:49:00.000Z",
          "Titre": "Extremely fast and great service",
          "Contenu": "Extremely fast and great service. Got the best deal possible. Would definitely recommend to others"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "woo seung kwan",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T12:57:40.000Z",
          "Titre": "Service was great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "V Prew",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T13:47:33.000Z",
          "Titre": "Great communication and quick response",
          "Contenu": "Great communication and quick response. It couldn't have been easier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cabrejas Liranza Harold",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T11:41:32.000Z",
          "Titre": "Good service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dear Customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T22:12:44.000Z",
          "Titre": "Very friendly accommodating and honest."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R. Lam",
          "Nb_Reviews": 4,
          "Date": "2023-08-05T01:44:10.000Z",
          "Titre": "Service was extremely easy to deal…",
          "Contenu": "Service was extremely easy to deal without any issue!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erin Schumacher",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T22:37:07.000Z",
          "Titre": "Great experience!",
          "Contenu": "It was so easy to get my phone fixed, and the tech was so friendly! Samsung Care user for life!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Lopez",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T19:51:09.000Z",
          "Titre": "Good service",
          "Contenu": "Good service, I received my new phone on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Henry Michael",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T16:21:32.000Z",
          "Titre": "The associates prompt respons and…",
          "Contenu": "The associates prompt respons and professionalism."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KDang",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T21:17:14.000Z",
          "Titre": "The service was quick."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TM",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T15:46:11.000Z",
          "Titre": "The repair was speedy and well done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger Petty",
          "Nb_Reviews": 3,
          "Date": "2023-10-19T14:00:30.000Z",
          "Titre": "Fast and easy with no BS",
          "Contenu": "Fast and easy with no BS! Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mathew Milan",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T13:16:32.000Z",
          "Titre": "Loved your agents",
          "Contenu": "Loved your agents. Very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mvega",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T15:31:35.000Z",
          "Titre": "Tremendous service",
          "Contenu": "Tremendous service, simple, fast and reliable..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ROBERTS WADE",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T04:00:40.000Z",
          "Titre": "Quick",
          "Contenu": "Quick, efficient assistance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Horton",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T14:59:05.000Z",
          "Titre": "M.A.G.I.C.--- Made A Great Impression on this Customer!",
          "Contenu": "No hassle, fast turnaround and excellent customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sherman Rhonda",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T17:50:03.000Z",
          "Titre": "Very smooth ride and everything was on…",
          "Contenu": "Very smooth ride and everything was on time."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "#NAAM?",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T12:19:47.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service, fast and very transparant. Journey was seemless."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amador Carlos",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T15:28:21.000Z",
          "Titre": "They took care of the issue right away"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mr. Smith",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T02:51:03.000Z",
          "Titre": "Service was fast Awesome",
          "Contenu": "Service was fast, no hassle"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ahmad Ismael",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T14:59:12.000Z",
          "Titre": "Very professional",
          "Contenu": "Very professional. Punctual. Good communication"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Venu Gopal",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T23:15:08.000Z",
          "Titre": "responce was good and quick"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Polly Agee",
          "Nb_Reviews": 2,
          "Date": "2023-07-21T23:44:49.000Z",
          "Titre": "amazing and fast highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raymond Do",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T08:50:03.000Z",
          "Titre": "Easy to use and very fast service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Giovani",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T10:12:33.000Z",
          "Titre": "Fast and professional",
          "Contenu": "Fast and friendly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pencho Rachev",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T22:36:04.000Z",
          "Titre": "Quality and speedy service",
          "Contenu": "Fast, professional and quality service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Drewniak",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T20:34:33.000Z",
          "Titre": "easy and without stress",
          "Contenu": "Easy and stress free"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eduardo Mardeni Chami",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T20:28:45.000Z",
          "Titre": "Excellent and fast"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicole diaz",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T14:30:18.000Z",
          "Titre": "It was Good stuff"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alvin Caples",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T00:48:08.000Z",
          "Titre": "Everything was great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R. Lam",
          "Nb_Reviews": 4,
          "Date": "2023-10-26T17:10:32.000Z",
          "Titre": "Easy to use highly recommend",
          "Contenu": "Easy to use!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "E. Coleman",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T23:31:28.000Z",
          "Titre": "Excellent experience and customer…",
          "Contenu": "Excellent experience and customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "McBride James",
          "Nb_Reviews": 2,
          "Date": "2023-10-22T03:25:02.000Z",
          "Titre": "Fast effective"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danielle Horton",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T20:22:06.000Z",
          "Titre": "It was quick and easy."
        }
      ]
    }
  ]
}