{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "setmore.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T10:52:31.000Z",
          "Titre": "The slowest customer service ever",
          "Contenu": "The slowest customer service ever. Had to wait 40 minutes to get a hello. I was getting a useless \"I would love to help\", and \"let me check\" every 5 minutes after that but never got an actual help. A complete waste of my time. They do not care about the customer experience at all."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Hamid Raza",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T07:46:06.000Z",
          "Titre": "Absolutely horrendous customer service",
          "Contenu": "Absolutely horrendous customer service. Product has a few glitches and shortcomings, but each time you talk to their CS team, be braced to have a headache. Average response time in live chat is 30 mins... per message!!! That too without providing any actual support. I'd say even automated bots would provide more help than their actual support team. Unprofessional, useless and 3rd grade. Better move to Calendly."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Ryan Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T01:16:15.000Z",
          "Titre": "Worst Support I have ever dealt with",
          "Contenu": "Worst Support I have ever dealt with. After being hacked, charged twice and giving sufficient evidence, telling them at least four times as to what happened, Support kept telling me \"the team is looking into it\". After 5 days, I'm still getting that same response and nothing more. My excess charge committed by someone else, they have failed to refund me and have failed to restore my data which was wiped. Absolutely terrible company to deal with."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Business Owners",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T02:47:34.000Z",
          "Titre": "A lot of glitches, unreliable and untrustworthy",
          "Contenu": "I wrote a review before and the Setmore team pleaded with me to take it down and gave me credit, so I did. But once again I’m having issues. My business can’t operate at the moment because i rely on setmore to take appointments from my clients. There is yet another glitch, and setmore software is not working. PLEASE BE VERY CAREFUL BEFORE USING THIS COMPANY, IT WILL SLOW YOUR BUSINESS DOWN AND POSSIBLY LOSE YOU SOME MONEY. this is the third time this has happened, SETMORE IS VERY UNTRUSTWORTHY AND UNRELIABLE. I do not recommend! I will be positing this to as many platforms as possible, i would not want anyone to go through this nightmare. A lot of their reviews are fake and false apparently. Use simplybook.me, honeybook, connecteam, or when I work, way more reliable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "HeyMrs King",
          "Nb_Reviews": 1,
          "Date": "2022-10-08T23:06:40.000Z",
          "Titre": "Honestly this it’s crazy that some can…",
          "Contenu": "Honestly this it’s crazy that some can use a site like this to advertise themselves as being professional and advertise their work only to scam ppl out their money!!! I set a hair appointment with someone thru here and stated there was a deposit to book appointment I was scammed out money. Her site here should definitely be taken down! Wish I was able to add photos of the conversation here to expose her"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-10-21T12:19:21.000Z",
          "Titre": "DO NOT USE THIS APP",
          "Contenu": "DO NOT USE THIS APP. THERE ARE WAY MORE APPS AND BETTER CUSTOMER SERVICE (BEULAH). THEY ARE LETTING A PERSON/BUSINESS WHO IS SCAMMING PEOPLE OUT OF MONEY FOR DEPOSITS. THIS \"BUSINESS\" TAKES THE DEPOSIT THEN SENDS VICTIM TO LOCAL SALONS WHERE THEY DO NOT WORK OR LICENSED TO RUN A BUSINESS OR PERFORM SERVICES. I CONTACTED SETMORE TO DISABLE Hair Diva/ Jada Taylor's account and that will not. I have sent the victims information and the proof of their interaction with the so called Hair Diva. She's using my business as the scapegoat. She has never and will never work at my salon. Shame on you SETMORE. I will report this information to the Better Business Bureau and the FCC"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pissed off",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T01:59:32.000Z",
          "Titre": "Setmore is Horrible they deleted all my…",
          "Contenu": "Setmore is Horrible they deleted all my staff and disrupted my business and would not bring back all my staffing unless I paid them extra. I was then told each person was each $24 a month and that’s false advertising because it says $9 a person for their pro monthly subscription."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephanie Idene Sakata",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T23:59:03.000Z",
          "Titre": "I wish I could leave ZERO stars!",
          "Contenu": "I wish I could leave ZERO stars!! This company is the WORST. I no longer have access to email that I set up my account with so I cannot log in to remove my credit card. They continue to charge it EVERY month and although I gave them my card number, my phone number, my name.....all that were set up on the account by ME, they refuse to stop charging the card each month. They are nothing short of common theives. I will NEVER do business with them again or reccomend them to anyone."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "David Guest",
          "Nb_Reviews": 5,
          "Date": "2022-11-29T13:51:15.000Z",
          "Titre": "Setmore has a novel way of dealing with…",
          "Contenu": "Setmore has a novel way of dealing with complaints - they dont have a formal complaints procedure - no way of making a complaint = no complaints. As this is now the second time that I have potentially lost money due to setmore's technical issues (this time due to them changing my currency and location) i'm getting rather tired of the whole thing. I stick with setmore due to the price and the fact that its embedded in my infrastructure, but its now gettting to the point where im activily looking for alternatives. Its a shame because it could be a pretty good system but the setmore problems are actively costing me money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Porche",
          "Nb_Reviews": 3,
          "Date": "2021-10-23T01:26:47.000Z",
          "Titre": "It is server space ? or other tech problems.  Just be candid with me.",
          "Contenu": "I have had setmore ever since we started our business. The help chat is always responsive but starting this summer my shop's reviews get limited to the last 2.5 months. My marketing links to the set more reviews where I boost we earned 300+ 5 star reviews. The setmore team fixed this but then it went back to 2.5 months, fixed it temporary again it goes back to the last 2 months. every other time I look its working then not working."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Suraj Lobo",
          "Nb_Reviews": 1,
          "Date": "2021-09-15T19:30:28.000Z",
          "Titre": "It's broken",
          "Contenu": "For weeks now, the system has had a glitch where it deletes the addresses of our clients. For the first few weeks, there was a denial it was even on the side of Setmore. Finally last week, they admitted it was an issue and that they were going to make a fix and let us know by Monday. I had to reach out Tuesday and still nothing. The lack of follow up or follow through is incredibly disappointing.  It's a tough time for everyone to be sure, but we can't keep using this service the way it is."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Rod McLean",
          "Nb_Reviews": 1,
          "Date": "2021-05-16T05:23:10.000Z",
          "Titre": "Very poor service",
          "Contenu": "Setmores doesn't always send out appointment reminders. This has been costly for us at times with missed clients. Whenever I have asked Setmores why this has happened there has been no help provided, no information provided... And, then I get a message askeing me how Setmores can be of further help!!! Appalling service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terrell",
          "Nb_Reviews": 1,
          "Date": "2021-05-26T15:58:01.000Z",
          "Titre": "Final word try another company first!",
          "Contenu": "I have had issues from day one and still continue to have them with no resolution and trust me i would leave this company if i was not so invested and had time to fully set up another calendar app. Dont get me wrong this would be the best on the market IF the service worked as it said and the customer service had some power to do things but its just wait ... wait ... and then after that wait again never mind  my company is losing money due to setmore issues..Final word try another company first!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Grace",
          "Nb_Reviews": 1,
          "Date": "2021-04-09T12:34:43.000Z",
          "Titre": "Don’t like anymore",
          "Contenu": "First year was great, now it’s glitching and it’s letting me book on top of other appointments which it never used to do. It doesn’t let me book repeat clients out for the whole year and just recently it’s only sending out reminders to some people. When I ask for help, no seems to know the answers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg Peck",
          "Nb_Reviews": 1,
          "Date": "2021-05-14T16:53:41.000Z",
          "Titre": "Disappointed",
          "Contenu": "I’m sure with today’s technology you can come up with a way or already know the way that you could get text messages out to our customers with one blast to all of them. It’s been along time since I’ve asked for this. No excuses I know it’s out there I found it online myself"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mickey",
          "Nb_Reviews": 1,
          "Date": "2021-05-07T12:39:59.000Z",
          "Titre": "The absolute worst",
          "Contenu": "The absolute worst!   My employees had their schedules wiped out.  We each called numerous times for help.  I probably called 10 times.  No one know was able to fix it over about a 2 week period.  I finally had to go with another place.  HUGE waste of time!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 3,
          "Date": "2021-04-01T11:18:26.000Z",
          "Titre": "Could only answer http for any…",
          "Contenu": "Could only answer http for any question.  We are losing money because google says we are booked for 5 days when we are not. Our customers are going somewhere else. I might have to find another company for my appointment needs."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "HH",
          "Nb_Reviews": 2,
          "Date": "2021-05-18T11:31:36.000Z",
          "Titre": "Just too many features missing",
          "Contenu": "Just too many features missing from this system. My clients can’t even see the price of their appointments and they cannot reply to their confirmation text (which is also a very basic confusing text)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Perry",
          "Nb_Reviews": 1,
          "Date": "2021-09-02T19:44:02.000Z",
          "Titre": "I have over 5k contacts and unable to…",
          "Contenu": "I have over 5k contacts and unable to export any of the data . I would never tell anyone to use service . Also no one speaks good clear English at customer support"
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "Ashraf Adel",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T18:48:22.000Z",
          "Titre": "it's took to many days to solve the…",
          "Contenu": "it's took to many days to solve the issue that is why iam not happy otherwise the customer service is very helpful"
        },
        {
          "Note": 1,
          "Lieu": "IO",
          "Pseudo": "floss knight",
          "Nb_Reviews": 33,
          "Date": "2022-08-06T16:10:12.000Z",
          "Titre": "Terrible CS Terrible Software Dev",
          "Contenu": "Terrible CS Terrible Software Dev.  No one ever gets back to you.  No account manager.  We spend thousands with them.  I really would avoid this company and I really question the amount of the 5 star reviews. We have been customers of Setmore for over 6 years spending access of £25,000 +I have continually written to you and requested a call with an account manager because of the numerous problems we have faced that have created many costly problems for us. I demand a call with a senior manager on Monday 4 pm UK time to address our questions and support us.I was promised that I would get a callback and NOTHING How do I book a zoom meeting with a senior manager to discuss functionality Development and your planned up-and-coming features?we have been customers of setmore for years and want an account managerwe are thinking of leaving Setmore because of the terrible support and lack of account management no one gets back to me and arranges a call we will take our £7500 + annual business somewhere else.  You have taken thousands from us with terrible service.We have questions regarding the functionality which requires a phone call with our team to try to address if not we will move our business elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Goldy",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T15:41:48.000Z",
          "Titre": "I call and call asking for certain…",
          "Contenu": "I call and call asking for certain settings that rarely ever happens. Tired of having to call in these should be issues i can fix"
        },
        {
          "Note": 1,
          "Lieu": "JM",
          "Pseudo": "Janice",
          "Nb_Reviews": 1,
          "Date": "2021-05-14T12:38:41.000Z",
          "Titre": "My opinion",
          "Contenu": "Thank you for creating this precise app it suits my daily appointments schedule perfectly.Highly recommend 👍🏻"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Tuyet",
          "Nb_Reviews": 1,
          "Date": "2021-05-10T22:36:57.000Z",
          "Titre": "This app always frozen",
          "Contenu": "This app always frozen . My clients cant book appointment event time slot is available. Also. They cant pay deposit"
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Miki Lim",
          "Nb_Reviews": 1,
          "Date": "2021-08-17T23:06:43.000Z",
          "Titre": "My review of Setmore went from 5/5 to…",
          "Contenu": "My review of Setmore went from 5/5 to 0/5 with the new update on 18 Aug 2021.The point of Setmore is it allows my clients to book my calendar in their time zones without a million emails to negotiate a time across time zones.After the new update, they hid the time zone drop down underneath the calendar, which means on desktop many people would have to scroll to see more times available in the calendar, more products available in the product menu and to see the time zone drop down menu. The only point of setmore was that they could see: all products, all time options in the calendar and the drop down for time zones, all on the one page without scrolling.They said it was for accessibility etc. but only 90 year olds need 200 size font on their desktop, but even 90 year olds after this new update, wouldn't find the time zone drop down menu hidden underneath the calendar anyway because they wouldn't know how to scroll.The product solved a problem we were having and then shortly after, essentially removed the function that was assisting us. Don't fix things that aren't broken, the new update broke Setmore. I'm quite upset to wake up to this because I am waiting for the avalanche of client emails asking about time zones when previously this website fixed that issue for us.I miss the old version terribly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Liliane Daves",
          "Nb_Reviews": 1,
          "Date": "2021-04-15T16:51:31.000Z",
          "Titre": "Quality of the website is not good",
          "Contenu": "Quality of the website is not good , problems happen all the time ..."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Bec",
          "Nb_Reviews": 2,
          "Date": "2021-05-14T01:03:03.000Z",
          "Titre": "consistently mis-interpret my needs and…",
          "Contenu": "consistently mis-interpret my needs and have not fixed issues"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andreea",
          "Nb_Reviews": 1,
          "Date": "2021-05-13T15:59:42.000Z",
          "Titre": "Missing lots of stuff",
          "Contenu": "Missing lots of stuff Not updated"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eirik Somerville",
          "Nb_Reviews": 1,
          "Date": "2021-04-29T16:25:20.000Z",
          "Titre": "Love SetMore's support but don't bother using them if you're trying to use their API",
          "Contenu": "This review won't apply to everyone. We used SetMore's booking page as an iframe on our website over the last 6 months. Our business revenue grew by 40 to 50% during this time.After a few months of using SetMore as an iframe on our website we tried building our own custom front end with SetMore's booking API. The switch to a custom front end didn't work out due to the limitations of their API listed below. We then switched to Timekit which has it's own set of issues.I love the customer support on SetMore. They answer right away and solve your issue in a relatively quick manner, but there are a few minor UX bugs that make no sense. Backend Notes (for the SetMore team): - Their API has no way of linking customers and appointments together (shared customer ID) when using the API - You can't export a list of customers from the API with all appointments - When a customer clicks on an appointment and gets to the checkout page the backend registers the booking as confirmed. This makes using a tool like Zapier to send booking confirmations useless because all clients will receive an email right after they reach the checkout page. - There sometimes can be syncing errors between your Google calendar and the SetMore copy of you calendar after you make a lot of changes to your Google calendarUX Notes: - SetMore was updating it's booking page so it looks a lot cleaner and their were bugs during this switch to the new booking page - The customer reporting view is really nice because it distinguishes revenue confirmed as earned (post appointment) vs. pending revenue - The calendar view for each resource you have is awesome. You can view all the appointments for each resource in one place - They make use of several sub tabs which don't directionally make that much sense for a user - There are two places to export your historical appointment data one of which has less data than the other (would recommend consolidating it) - Allow your users to set the booking constraints on a resource level and not on a service level. Ex: John needs a 24hrs notice and Sue needs a 48hrs notice for bookings.  - There aren't that many good analytics (visits by page, etc) in the SetMore admin page. In order to get reporting on your traffic flow through the SetMore booking process you have to use Google analytics to get that.  - I also wish they would allow Hotjar so we could see the users interaction with the booking page. Although we wouldn't be able to change much on the booking page."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Philip Wagster",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T10:40:30.000Z",
          "Titre": "Excellent service"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "julie growcott",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T17:16:12.000Z",
          "Titre": "Been using setmore for several years…",
          "Contenu": "Been using setmore for several years now but I absolutely hate the upgrade.   The appointment times are not so easy to see and I can't see when staff are available or breaks now.   Would not recommend unless some changes are made.Edit in response to your reply - I have spoken to your help chat several times, I have since had yet more problems and clients unable to book appointments.  I was told by one advisor it was a known problem, but then another advisor didn't know anything about it and couldn't report unless I had a screen shot to show my clients were having 5 SMS reminders for each appointment."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "B.",
          "Nb_Reviews": 1,
          "Date": "2021-05-21T12:13:28.000Z",
          "Titre": "Is good, but could be better",
          "Contenu": "Setmore to me is an easy to use program but is limited to how you can book reoccurring appointments. Due to the fact that my business has reoccurring bookings every fortnight, setmore do not allow me to complete this action and this means I need to manually manage my fortnightly bookings. The only advantage is that it sends off reminder emails to my clients for their booked appointments.. this is just one less thing I don't have to do... so good in that respect. But if setmore had more options available to make repeated bookings, this app would be super."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ken",
          "Nb_Reviews": 1,
          "Date": "2021-05-20T20:05:45.000Z",
          "Titre": "The software works OK but has bugs",
          "Contenu": "The software works OK but has bugs. When I report bugs, I get blown off with no resolution. This has happened 3-4 times. The latest problem is that it always comes up in 2018 when I log in. It used to come up in todays date. It has occasionally lost an appointment."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Daniel Adler",
          "Nb_Reviews": 1,
          "Date": "2021-03-25T19:34:37.000Z",
          "Titre": "Good tool for what it's worth",
          "Contenu": "Good tool for what it's worth. My big issue is they continue to update their tool which is great. However every time there's an update, it messes up other elements so it's almost like we take two steps forward and 50 steps backwards after every update. When I provide this feedback I'm told it's on the development list that development list is ongoing which is fair, but as a paying subscriber I want it to work with the same functionality that was there prior to any updates. Why should a paying customer be limited on what they're used to just because the app development team has not done proper regression testing to ensure that all previous functionality is still there."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Ruth",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T16:54:18.000Z",
          "Titre": "Not as versatile as I expected",
          "Contenu": "I've been using this system for 2 weeks. I'm really pleased that my customers can book online now, but I have already found 2 situations that might make me look elsewhere.Firstly, there is one type of appointment that I only want clients to book at a specific time. Unfortunately, the paid for, single version can't support this. If I use the free version I can get around it, but I want text reminders, so I have to pay.Secondly, I want clients to make an appointment....that's it. At the moment they can leave me a message, I don't want that. It's not optional, which I think it should be.Hopefully someone will read this and improve things, then next time I can leave a glowing review."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2021-05-14T16:37:13.000Z",
          "Titre": "I’m torn on this.",
          "Contenu": "I’m torn on this. I live the app but have had trouble fir the last two months with the app on my iPad. I have spoken to the team multiple times but the problems are still not fixed. Very frustrating."
        },
        {
          "Note": 2,
          "Lieu": "AE",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2021-05-07T11:02:44.000Z",
          "Titre": "As the app is ok they are improvements…",
          "Contenu": "As the app is ok they are improvements that I have brought to the attention off the team and nothing has been done.Lately the app keeps kicking members off login out and loading issues"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2021-05-14T18:14:57.000Z",
          "Titre": "Good tool for what it's worth",
          "Contenu": "Good tool for what it's worth. My big issue is they continue to update their tool which is great. However every time there's an update, it messes up other elements so it's almost like we take two steps forward and 50 steps backwards after every update. When I provide this feedback I'm told it's on the development list that development list is ongoing which is fair, but as a paying subscriber I want it to work with the same functionality that was there prior to any updates. Why should a paying customer be limited on what they're used to just because the app development team has not done proper regression testing to ensure that all previous functionality is still there. Once writing this review they contacted me to email them, so I did and no reply from them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gabriel",
          "Nb_Reviews": 1,
          "Date": "2021-05-20T16:10:09.000Z",
          "Titre": "We get double booked for appointments…",
          "Contenu": "We get double booked for appointments all the time using Setmore. Tried getting this matter addressed on multiple occasions but no solutions as of yet."
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "The Ammara Beautique",
          "Nb_Reviews": 1,
          "Date": "2021-05-29T08:29:23.000Z",
          "Titre": "There alot of things cant be use & at…",
          "Contenu": "There alot of things cant be use & at time we are very unsure. When refer to admin, they always take a very long time to response"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Advanced Spinal Care",
          "Nb_Reviews": 1,
          "Date": "2021-04-12T18:52:13.000Z",
          "Titre": "We have many dropped appointments",
          "Contenu": "We have many dropped appointments, for about 2 years we have been trying to get to the bottom of this. We have gone so far to double our upload and quadruple our download speeds internet-wise. We have had our IT team come and clear computers rebuilding programs by reinstalling from ground up. I am the only one to schedule. I have to go through this dialog every time there is an issue. We have appointments I have deleted that pop back up. We have new appointments I schedule either single or individual programs that will go missing. I have reported these all along.Our internet speeds will be maxed but the program will load slow... the slower it loads changes the more it seems that days appointments are messed up. The calendar that navigates day or week will load over arrows I have screen shot this 10+ times and sent it to the tech team. I get told to reload my program and so I do and it continues to be an issue. I only log in from the log in portal, and I continue to have these issues."
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "Pro Dental",
          "Nb_Reviews": 1,
          "Date": "2021-04-17T15:16:10.000Z",
          "Titre": "Good for simple usage, not complex.",
          "Contenu": "Once so many people access the Schedule, we can not have different log ins in order to track and audit each operator."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Nat",
          "Nb_Reviews": 1,
          "Date": "2021-05-08T14:50:42.000Z",
          "Titre": "Lot of service interruptions",
          "Contenu": "Lot of service interruptions, bugs, payment issues and limited features. I will not recommend Setmore for calendar."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Afia",
          "Nb_Reviews": 2,
          "Date": "2021-05-28T12:26:07.000Z",
          "Titre": "Lots of improvements necessary",
          "Contenu": "It doesn’t integrate well and isn’t as customizable as I would like. I am in the beauty business."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "Consular Tokyo",
          "Nb_Reviews": 1,
          "Date": "2021-04-19T01:20:34.000Z",
          "Titre": "Not much functions we can use",
          "Contenu": "Not much functions we can use. For example, unable to share the calendar with out outlook."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jill",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T21:46:58.000Z",
          "Titre": "Setmore customer service has limitations",
          "Contenu": "Setmore has a brief landing page that you can customize-it advertises it as a website-but I wouldn't quite go that far. I spent a lot of time dialing it in and really liked the free zoom like feature and just clicking on the link. Michelle spent a lot of time on chat helping me, but it was time consuming. I definitely feel that online chat strives to be helpful but because of the language barrier -it is incredibly time consuming because I often explain things over and over. My last interactions with Siddhartha and Michelle never got rectified and I tried to speak to someone in the US by calling and emailing, no luck. They were very certain they would contact me soon and its been 3 weeks. I can see using a free product can be troubling without US support of any kind, so I think I will jump to something I pay for (and get more service). As a FREE service it is 5 stars, because I spent so much time setting it up and have to bail because I cannot get help, 3 stars."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vincent",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T03:53:41.000Z",
          "Titre": "New user",
          "Contenu": "I just started using this so not much I can say.  Support has been great in helping explain things, set-up is pretty straight forward,  integration to the website was simple. We'll see how it works in real time but testing would suggest that it will be fine."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Abiethebarber",
          "Nb_Reviews": 1,
          "Date": "2021-05-22T03:30:31.000Z",
          "Titre": "The main function I dislike",
          "Contenu": "The main function I dislike, you can't block out more then one day at a time. Make some function that I would pick a time and what days you want. Like if i wanna block out a week straight, I would have to go to each day and block it out. If you would make times and dates to block out at one time this app would be perfect. And maybe if a client wants to pay up front they can."
        },
        {
          "Note": 3,
          "Lieu": "SA",
          "Pseudo": "Elite",
          "Nb_Reviews": 1,
          "Date": "2021-05-16T15:39:31.000Z",
          "Titre": "Unreliable reminder messages",
          "Contenu": "The schedule design is a little confusing. Time is indicated in very small font and not big enough to see. Also it doesn't show a preview of the appointment details before you confirm it which forces me to book appointments then cancel them edit information. Finally, which is the worse point is the appointment reminder messages, they are not reliable. They do not always get to the costumer as expected."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Adrian Conn",
          "Nb_Reviews": 4,
          "Date": "2021-05-14T12:29:14.000Z",
          "Titre": "Good Basic Diary.",
          "Contenu": "Been using Setmore for over 4 years now to manage our clinical diaries. It does the basics for us (we use the free version).Main problem is that it's\" glitchy\". Pages freeze quite often and have to be reloaded and occasionally all the bookings disappear which usually requires an \"online chat\" with Setmore who usually sort out the problem.Would probably look elsewhere if I was paying for the product."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2021-04-21T14:01:26.000Z",
          "Titre": "Great application...some limitations...",
          "Contenu": "This is a great application and easy user interface. However, I have been making several strong suggestions from my self and on behalf of at least 15 other users of Setmore. None of our recommendations have been put into play. It’s been a few years and still not one of our several recommendations have been put into effect. I believe there needs to be more action in terms of listening to what the customers need. Thank you."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Emma-Jane Maxwell",
          "Nb_Reviews": 6,
          "Date": "2021-05-08T07:55:38.000Z",
          "Titre": "Setmore have been very efficient in…",
          "Contenu": "Setmore have been very efficient in getting back to me on live chats, very good. However my customers often book 5 or 6 appointments in advance and the booking system does not allow this easily. I have also had a few issues woth customers cancelling appointments and setmore does not automatically issue a refund.  So this is why I have only given 3 stars."
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "R A",
          "Nb_Reviews": 1,
          "Date": "2021-04-15T14:38:34.000Z",
          "Titre": "Good service but they don’t listen",
          "Contenu": "Good service but never even one of my requests or suggestions been added.But they can answer questions very good about the existing service but don’t expect them to take any of your suggestions or requests seriously other than “promising” that they would “ relay“ it to the developing team.But I’d recommend them as a service.l sometimes they have problems and buga"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Tania Yorgey",
          "Nb_Reviews": 13,
          "Date": "2021-05-26T20:57:14.000Z",
          "Titre": "Excellent back end use",
          "Contenu": "I have been using Setmore for the last few years and love the simplicity of the backend setup. Very easy to use, update and mange. The front end is a little less easier to use for clients as they miss the last button 'create' when booking. Because I have a separate payment section I am able to see that payment has been made but no booking created. Because the 'create' button has been missed, they leave the booking before actually confirming an appointment."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Massage Therapy",
          "Nb_Reviews": 1,
          "Date": "2021-05-06T20:34:41.000Z",
          "Titre": "Service is Okay",
          "Contenu": "Overall service is pretty good. They are kind of hard to work with if there is a system issue, its easier to just live with it. The auto merging of profiles is incredibly annoying contrary to popular belief. We have a lot of patients with one email for their family (kids are still young and don't have one or a family member will book for another family member and use the same email). This causes us to have three people merged into one account. It gets messy."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Anastasia",
          "Nb_Reviews": 1,
          "Date": "2021-05-28T18:48:10.000Z",
          "Titre": "Has a ton of functionality, but...",
          "Contenu": "The platform has a ton of functionality even in the free version, but there are a few things it could do better. For example, once an appointment is in your calendar (or the calendar of the person who made the appointment), it cannot be edited. This is problematic especially on the free version, because you cannot integrate w/ Zoom, so the Zoom link must be sent and added to your/their calendar separately. Another huge downfall: the paid version will not sync with more than one calendar."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fred M. Gilbert",
          "Nb_Reviews": 2,
          "Date": "2021-03-31T15:24:33.000Z",
          "Titre": "Please read!!",
          "Contenu": "I think setmore is great, but also needs to add something more for no show customers not just a blanket policy, yes continue to have a setup for payment but for no show customers there needs to be more of a targeted system and they know that they are targeted when it comes to no shows, because this hurts small businesses in a big way"
        },
        {
          "Note": 3,
          "Lieu": "EE",
          "Pseudo": "M&amp;uuml;&amp;uuml;rsepp",
          "Nb_Reviews": 1,
          "Date": "2021-04-27T11:18:52.000Z",
          "Titre": "Neutral",
          "Contenu": "Positive: automatic reminders to customers phone and email. Easy to schedule/reschedule, cancel.Negative: no possibility to differentiate appointments in different towns or rooms (for example when my appointments on Fridays take place in another town). No possibility to open or edit working hours/breaks from certain date (for example when I need to change my working days and hours from the next months). Doesn't calculate the booking slots correctly in case I add lunch brake."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amber",
          "Nb_Reviews": 2,
          "Date": "2021-04-13T16:13:47.000Z",
          "Titre": "Love this platform for the most part!!",
          "Contenu": "Love this platform for the most part. Few things I would like to see: The sync-up between mobile devices and your computer. When changes are made I dont see them on one of the two devices until later or at all. Additionally, if I end up traveling into a different time zone, this platform should convert the times or label what time zone I or the person making the appointment was in, when the appointment was made. For someone who travels a lot this is a big irritant of mine."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "CM",
          "Nb_Reviews": 1,
          "Date": "2021-06-03T13:30:24.000Z",
          "Titre": "Happy to be using Setmore however some improvements will be great!",
          "Contenu": "I'm pleased and happy to use Setmore.However, a few things that would make it better for my business:1. In confirmation emails to clients the price should be stated/included.2. When I delete old events after they are complete. All attendees get notification unnecessarily - the event is long over so they should not receive any notification emails when I delete/clean out events.3. When I make an amendment/update notes in a clients appointment and de-select \"send notification\" - it still sends it."
        },
        {
          "Note": 3,
          "Lieu": "AR",
          "Pseudo": "Setmore",
          "Nb_Reviews": 1,
          "Date": "2021-04-02T19:01:44.000Z",
          "Titre": "There is not Spanish customer service…",
          "Contenu": "There is not Spanish customer service and plenty of my issues or doubts about the service I haven’t got a clear answer or resolution.My country only speak Spanish (Argentina), I even seleted Spanish language but, even this review have been sent to me in English, it’s sounds like you don’t really customize this preference (by language) for your clients.Also I had two kind of services and I would love that I can set my appointments with separate schedule but this is not available at all.Thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "The RELLIS Academic Alliance",
          "Nb_Reviews": 1,
          "Date": "2021-05-13T15:36:03.000Z",
          "Titre": "Setmore has been good to us for the most part…",
          "Contenu": "Setmore has been good to us for the most part. We recently experienced some technical issues that seem to have resolved themselves on their own. We were experiencing phantom cancellations of appointments (appointments cancelled on their own, not by a staff member/customer) as well as calendar syncing issues. We trust Setmore very much here at the RELLIS Academic Alliance to not have issues like this moving forward since they have been resolved. Thank you for everything y'all do to make our institution successful!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tanesha",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T21:56:54.000Z",
          "Titre": "I like the site but as a business owner…",
          "Contenu": "I like the site but as a business owner I feel it doesn't offer enough. I would like to offer services and products to sell, along with using payment software such as sezzle,after pay, etc. I'm currently looking to expand my business and feel like I can't using the setmore software"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "C Stapleton",
          "Nb_Reviews": 2,
          "Date": "2021-05-20T13:16:38.000Z",
          "Titre": "The employees i have been in constant…",
          "Contenu": "The employees i have been in constant communication with are prompt and courteous for the most part.  We are a construction related business and cover a large area.  We go to the client, the client doesn't come to us.  If they would just listen to my needs, things would be much better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aches. S.",
          "Nb_Reviews": 1,
          "Date": "2021-05-28T13:32:28.000Z",
          "Titre": "There are major flaws in the code.",
          "Contenu": "There are major flaws in the code that make it so that when you select a time for an event or appointment, the next menu displays a different time to then be further edited and saved. I dont understand which string of numbers is being referenced but it's pulling thr wrong value. Gmail take 24 hours to sync with 1 way. When you call their staff, they say that's only the 1st time you sync, then it's instantaneous like other apps would be. ... nope. Turns out that it does take 8 to 24 hours to sync up appointments to your Google calendar."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Martin Bazuin",
          "Nb_Reviews": 2,
          "Date": "2021-03-04T16:57:54.000Z",
          "Titre": "Probably the best software there is for…",
          "Contenu": "Probably the best software there is for english customers. However, inspite the software is multi-language it is not possible to change the date-format to European Date format (dd-mm-YYYY) in the confirmation emails. This is a big deal breaker and should be part of future updates because it is not good for a business to send out confirmation emails which are translated 99% correct but the date and time format is only in english date-format. That doesn't look good and should be addressed with a high priority in my opinion."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chad",
          "Nb_Reviews": 1,
          "Date": "2021-05-28T15:45:31.000Z",
          "Titre": "You can’t add separation time to one…",
          "Contenu": "You can’t add separation time to one client to the next, it have the option to do it but every time I put it to a 45min gap it doesn’t work clients still book back to back, it doesn’t give me time to make it on time to the next client if the times are right on top of each other!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "All Ways",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T15:36:38.000Z",
          "Titre": "Add when booked to the appointment info",
          "Contenu": "Thankful for this app but really needs a better way to track when the appointments were booked. Having to scroll back through the activity feed takes a while sometimes. You should be able to see this info with the rest of the appointment info. That's all."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AC",
          "Nb_Reviews": 2,
          "Date": "2021-05-21T16:37:05.000Z",
          "Titre": "In general I love this app but there…",
          "Contenu": "In general I love this app but there are many times that all of my appointments disappear and I’m not able to schedule people because I don’t know what’s actually open. I have tried logging out and logging back in and that doesn’t help. Eventually it seems to fix itself but it’s very frustrating when I’m standing there with a client and I cannot reschedule them. There used to be a comment section under customer names and now there is only a notes section. Sometimes I find all of their notes under notes and other times I find it only under one specific appointment date. That could definitely be streamlined"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Tammy",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T06:43:20.000Z",
          "Titre": "Still a lot of issues appointments…",
          "Contenu": "Still a lot of issues appointments being directed at certain times and then appearing on different days massive problem at the beginning of the Year with the clocks going forward never had this issue before but it was a major With Us opening back up"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Doris",
          "Nb_Reviews": 2,
          "Date": "2021-04-19T23:59:21.000Z",
          "Titre": "I will give 5 start for customer…",
          "Contenu": "I will give 5 start for customer service. 5 start how easy to use the app. 3 start for my clients convenience they can book multiple classes at once they can't repeat classes also they can't paid in one transaction for multiple classes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aleesa",
          "Nb_Reviews": 1,
          "Date": "2021-05-26T20:01:03.000Z",
          "Titre": "I love set more I just hate how I can’t…",
          "Contenu": "I love set more I just hate how I can’t charge a portion deposit it’s only saying the client would have to pay full price before the service an I think that’s so stupid other than that I love it an I love how it tells me my weekly income!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T03:41:28.000Z",
          "Titre": "Joshua was helpful but I find setmore…",
          "Contenu": "Joshua was helpful but I find setmore still difficult to navigate.  It's not user friendly from my purposes."
        },
        {
          "Note": 3,
          "Lieu": "ID",
          "Pseudo": "Eko",
          "Nb_Reviews": 1,
          "Date": "2021-05-29T11:23:53.000Z",
          "Titre": "Hi Setmore this is Eko",
          "Contenu": "Hi Setmore, I would like to thank you for your free services. To be honest, there are still several deficiencies, such as Phone No and Email validation, but probably it is already being done the best it can.Your friend,Eko Sapto"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Susan Friesen",
          "Nb_Reviews": 1,
          "Date": "2021-03-19T20:37:36.000Z",
          "Titre": "It certainly provides some of the…",
          "Contenu": "It certainly provides some of the basics but more advanced features aren't available. Things such as adding an extra day or two or three hours to the schedule on one particular day. The method to do so at this point is too cumbersome."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Katie",
          "Nb_Reviews": 1,
          "Date": "2021-04-15T16:43:46.000Z",
          "Titre": "I really enjoy using Setmore, but...",
          "Contenu": "I really enjoy using Setmore. I would say that It would be greatly helpful to most of us continuing to work during the pandemic if the auto reminder texts and emails allowed for more alpha characters. That way we could include the patient covid screening information within the reminder for the appointment. As a Health Care Provider I would also recommend that you offer online charting for patient files like other programs do. Most clinics are moving in the direction of online record keeping and It would be wonderful if that was all included in your platform. Otherwise keep up the great work! I find the program easy to use, and my patients love the online booking tool.Thanks!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Angie Seymour",
          "Nb_Reviews": 3,
          "Date": "2021-03-24T12:47:10.000Z",
          "Titre": "Difficult to use calendar",
          "Contenu": "Difficult to use calendar.  Also, my clients are being sent reminder texts in the middle of the night according to a few of them.  This isn't a good time to remind them as it wakes them up."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "tina Mayer",
          "Nb_Reviews": 1,
          "Date": "2021-05-04T14:52:44.000Z",
          "Titre": "It would be nice to be able to look at…",
          "Contenu": "It would be nice to be able to look at client information by  State, City and Zip code it is such a basic programming and the fact that this platform doesn't have is just really dumb."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alicia",
          "Nb_Reviews": 1,
          "Date": "2021-04-07T20:31:51.000Z",
          "Titre": "I like the program",
          "Contenu": "I like the program. However it freezes up a little more than I would like. I wish that I could do more than one recurring appointment at the same time slot. It would expedite my scheduling."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Monique Klein",
          "Nb_Reviews": 1,
          "Date": "2021-05-26T17:22:20.000Z",
          "Titre": "The response back from Setmore when…",
          "Contenu": "The response back from Setmore when having an issue I fantastic, they are helpful and fast. At times the app can be glitchy and has to be reloaded. When the app opens, it doesn't automatically go to the current date, it opens to the day you started the app, which is annoying. I would also find it helpful, if you could set a limit to the amount if Apts you would want in a day, and the app would automatically not allow anymore bookings. This would be helpful for people who do physical work, and only want so many Apts in a day without having to babysit the app. Also, when going into the app activities, it always has to be refreshed, the new info doesn't automatically load. If these issues were addressed, I would give the app 5 stars, and would consider getting the pro version."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brandi",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T20:38:35.000Z",
          "Titre": "I’m hving problems with my correct…",
          "Contenu": "I’m hving problems with my correct times being shown and my schedules times changing no matter if I change it. And I called to tlk to a representative but didn’t hve any proper help"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Columbus LMT",
          "Nb_Reviews": 1,
          "Date": "2021-05-20T19:51:59.000Z",
          "Titre": "Good - could use some enhancements",
          "Contenu": "I like the ability, but people need to be able to choose more than one service and pre-adding tip would also be helpful. Massage book has a feature where you can pre-add tip."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T19:54:22.000Z",
          "Titre": "App is good for the cost",
          "Contenu": "App is good for the cost. My widget doesn't always show my upcoming appointments and sometimes I don't get a notification of an upcoming appointment."
        },
        {
          "Note": 3,
          "Lieu": "HR",
          "Pseudo": "ReciR d.o.o.",
          "Nb_Reviews": 1,
          "Date": "2021-04-23T14:27:17.000Z",
          "Titre": "too often bugs happen",
          "Contenu": "too often bugs happen. A bad solution for multiple users, everyone can see the financial part even though they shouldn't. You need to work on the details."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paticia",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T05:31:26.000Z",
          "Titre": "Changes and glitches too much",
          "Contenu": "Changes and glitches too much! Also doesn't provide everything I need as a salon owner. This will probably be my last year with Setmore."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Lydia Downstreet",
          "Nb_Reviews": 1,
          "Date": "2021-05-18T12:50:32.000Z",
          "Titre": "We use Setmore to manage classes and…",
          "Contenu": "We use Setmore to manage classes and private appointments. For private appointments it's very strong but there are many gaps in usability for class bookings. The interface has a learning curve. Also their functions aren't distinct for the two: classes seem an add-on that hasn't had the bugs worked out entirely yet. For example, a private appointment can pay with Paypal, but a class attendee can't. Or another example is that we can't separate the booking window: We'd like a 48-hour blackout period on private appointments but allow class booking up until 1 hour before classes. In the software this isn't separable. On the positive note, uptime is great, we have only had 1 small interruption during a beta test we agreed to participate in, and the support team is very knowledgeable, friendly and accessible, and work with us to answer support questions. Unfortunately often the answer is \"this feature is not available yet.\" Hopefully those are being worked on."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 14,
          "Date": "2022-08-30T21:50:15.000Z",
          "Titre": "Updated: better experience since",
          "Contenu": "Update: Rosan’s supervisor called me back and solved the issue by verifying my account in other ways. I gave them feedback on my issue and they did apologize and fix it. I have since updated my review. They will need to do more in future to get the five stars but I’m since in the account and so far so good.—-After using setmore for my beauty launch I was happy with the service. Tech wise, great. Soon after I get locked out of my account and can’t reset my password for some odd reason. I call customer service and they say that since my email which is firstname.lastname doesn’t match the account (which doesn’t have the period) (e.g. on gmail they interchange with or without the email (it is the SAME account) they cannot let me access my account or send a reset code to my account. I’ve asked Roshan several times to speak with a customer service representative. I’ve asked to talk to a manager and nothing. Can’t access it due to gdpr issues. Annoying as I’ll have to start from scratch connect it to my card, and the works. Terrible customer service with no solution. There are others ways to verify the account and I’ve show them screenshots of my email receiving the passcode reset emails and still nothing. Still waiting for my account to be reset and now need to do a bunch of work (already drowning in work from multiple small businesses) to reinstate this and lost business for people not being able to book."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T10:12:49.000Z",
          "Titre": "Would be helpful to have a monthly view…",
          "Contenu": "Would be helpful to have a monthly view and to be able to search across entire schedule for an appt via name or email or phone"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jh",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T16:18:41.000Z",
          "Titre": "Hard to schedule staff for one day…",
          "Contenu": "Hard to schedule staff for one day shift .Hard to see how old patients areAnd hard to see patient history of booking"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "OT",
          "Nb_Reviews": 3,
          "Date": "2021-05-14T12:36:26.000Z",
          "Titre": "I would like for a couple of more…",
          "Contenu": "I would like for a couple of more features to be unlocked, like being able to schedule for 2 oe 3 weeks in advance."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Teresa Schmidt",
          "Nb_Reviews": 1,
          "Date": "2021-04-22T18:57:35.000Z",
          "Titre": "I am recently having trouble with…",
          "Contenu": "I am recently having trouble with Setmore on my MackBook. It often won't load or show me my client information."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dietrich Gooding",
          "Nb_Reviews": 2,
          "Date": "2021-05-14T14:14:33.000Z",
          "Titre": "Overall I enjoy using Setmore because…",
          "Contenu": "Overall I enjoy using Setmore because it’s pretty user friendly. There are a few minor features that could use improving such as being able to email receipts at end of any transaction and breaking down the details of a transaction including tips etc. Again, it is minor and isn’t a deal breaker in my continuing to use the app. I do have one major gripe... I had an issue when I integrated my google calendar to Setmore and called customer service for assistance only to get several representatives with a strong accents. This barrier made it difficult to understand one another as I had to spell the name of my company and spell my email address out 3 or 4 times when the rep was unable to pull my account up using my phone number. Three representatives, multiple transfers, and 30 mins later of missed callbacks later was very frustrating. I felt that things could have been smoother if my phone number automatically prompted my account.Update: Thanks for your reply Julia. The issue has already been resolved. It could have been resolved more quickly and more efficiently if my phone number automatically prompted my account."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Terry",
          "Nb_Reviews": 1,
          "Date": "2021-05-24T23:12:30.000Z",
          "Titre": "If the platform just had the ability to…",
          "Contenu": "If the platform just had the ability to receive confirmation messages would make it significantly better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shawn",
          "Nb_Reviews": 1,
          "Date": "2021-05-22T15:46:19.000Z",
          "Titre": "The system is good but you have to log…",
          "Contenu": "The system is good but you have to log in again everytime that it updates.Such a pain in the ass!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ashley",
          "Nb_Reviews": 1,
          "Date": "2021-05-14T15:16:31.000Z",
          "Titre": "My customers are always complaining…",
          "Contenu": "My customers are always complaining about the site. It’s confusing. I will be switching very soon"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul J",
          "Nb_Reviews": 1,
          "Date": "2021-05-06T21:44:01.000Z",
          "Titre": "Need more text characters for text",
          "Contenu": "Need more text characters for text reminders. Appts randomly get deleted when we don’t touch it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mary Fisher",
          "Nb_Reviews": 2,
          "Date": "2021-05-21T12:52:03.000Z",
          "Titre": "Credit card information",
          "Contenu": "There should be an option for a guest to enter credit card information to eliminate no-shows"
        },
        {
          "Note": 3,
          "Lieu": "LK",
          "Pseudo": "GRT Group",
          "Nb_Reviews": 1,
          "Date": "2022-04-21T19:06:21.438Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. Thank you for allowing us to get on line appointments."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Earl kurtz",
          "Nb_Reviews": 1,
          "Date": "2021-04-12T02:31:56.000Z",
          "Titre": "Need further assistance",
          "Contenu": "Need further assistance, we are not capturing enough customer information Please call us"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Renee",
          "Nb_Reviews": 1,
          "Date": "2021-05-07T11:26:43.000Z",
          "Titre": "It would be nice if the free version…",
          "Contenu": "It would be nice if the free version offered text reminders instead of email reminders."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maurice Mr",
          "Nb_Reviews": 1,
          "Date": "2021-04-22T15:59:39.000Z",
          "Titre": "It needs be easier ways for clients to…",
          "Contenu": "It needs be easier ways for clients to put a card on file when booking an appointment."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AJ",
          "Nb_Reviews": 2,
          "Date": "2021-05-17T17:32:50.000Z",
          "Titre": "Appointments missing from calendar…",
          "Contenu": "Appointments missing from calendar despite repeated attempts to resync. Never solved"
        },
        {
          "Note": 3,
          "Lieu": "FI",
          "Pseudo": "Elina Liimatta",
          "Nb_Reviews": 1,
          "Date": "2021-05-14T12:55:56.000Z",
          "Titre": "It would be good if i could deside…",
          "Contenu": "It would be good if i could deside working hours on the calender daily not weekly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kati",
          "Nb_Reviews": 2,
          "Date": "2021-05-18T16:59:50.000Z",
          "Titre": "Would really like a book now button on…",
          "Contenu": "Would really like a book now button on Google other then that it’s been great"
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Gloria",
          "Nb_Reviews": 1,
          "Date": "2021-05-21T11:44:24.000Z",
          "Titre": "Wish reminders on google and outlook…",
          "Contenu": "Wish reminders on google and outlook weren’t so expensive."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Jameela Van Eijck",
          "Nb_Reviews": 1,
          "Date": "2021-04-15T14:02:05.000Z",
          "Titre": "You system works well but needs to be…",
          "Contenu": "You system works well but needs to be more user friendly"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "jem",
          "Nb_Reviews": 2,
          "Date": "2021-05-20T12:10:03.000Z",
          "Titre": "Very slow with payouts and seem to be…",
          "Contenu": "Very slow with payouts and seem to be getting worse"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2021-04-06T00:30:56.000Z",
          "Titre": "The software does what it is supposed…",
          "Contenu": "The software does what it is supposed to, and we're happy with that. Customers are also appreciative that we are online now, too! There are some little things that we've run into that is really holding it back from being top notch in our opinion. 1.) The mini calendar (to select the day) sometimes will glitch and move itself over to the side of the window, hiding half of it which does not allow us to click on a particular day. It does this repeatedly until we select a different 'tab' (like settings) then going back to the calendar - essentially \"resetting\" it. Sometimes it does this multiple times in a row. We are using the desktop app, by the way. 2.) There are some inefficiencies with the flow of booking an appointment. We pick a time and search for a customer; however, if there is no customer found, then what I'd like is the phone number we searched to automatically be copied into the phone number field in the new customer profile (right now it copies it into the 'name' field.) So, we have to cut the phone number from the name field, then paste it into the phone number field manually.3.)  The \"Provide Multiple Services\" feature needs work. We run a nail salon, and it would be really nice to be able to select feature services depending on the first service chosen. For example: if a customer books an acrylic nail appointment, I'd like to only offer/show additional services that compliment it (like a pedicure or a wax.) Instead, all of the salon's services are shown; and I don't think a customer would book two services for their hands when only one is needed. Additionally, not all services are shown, so it seems to be kind of all over the place and random on which ones actually get shown to the customer. We had to sadly turn this feature off. These are kind of minor gripes, but when it comes to a busy salon where customers are coming in and out, and the phone is ringing to book appointments many times per day, these inefficiencies really start to pile up in the mind. Additionally it's much tougher to train employees on the workarounds. Again, the software is complimenting our business well, but it could be improved."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "pseudo213",
          "Nb_Reviews": 3,
          "Date": "2021-04-15T16:00:07.000Z",
          "Titre": "No french translate..."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Craig",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T01:01:16.000Z",
          "Titre": "Very informative",
          "Contenu": "Very informative! It is a lot of information to digest and I did find it slightly overwhelming, but Anutham was patient and his very best to address all my questions/concerns."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer R",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T03:57:57.000Z",
          "Titre": "Responsive.",
          "Contenu": "I was surprised that within minutes of signing up I received a call from a Setmore representative (Anutham Chakravarthy) to help me set up my page.  He went through it step by step and answered questions as we went."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lovett Clark",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T00:45:24.000Z",
          "Titre": "It was extremely fast",
          "Contenu": "It was extremely fast. Over all It was explained and if he took more time, I would understand more better. We was interrupted by another caller two times and the focus wasn’t on me anymore. It was more rushed after the other caller name David intervened. My caller however was a nice person. Just need more help with my set up for this."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "I like it other than that.",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T04:39:43.000Z",
          "Titre": "I am not all the way satisfied with the…",
          "Contenu": "I am not all the way satisfied with the payment set up on there. I wish it was a way to let the customer pay upfront without charging them until the cleaning is done. I don’t like to give refunds etc. And I want to delete some of the messages in the messenger side. It’s reviewing everything I do. I don’t like that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shakeyla Kimble",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T06:59:52.000Z",
          "Titre": "Quickly answered the phone understood…",
          "Contenu": "Quickly answered the phone understood the issue I was having . Provided screen share and other options to help me understand how to maneuver thru instructions and everything. Was friendly and patient. spoke calm even tho I keep repeating information more than twice."
        },
        {
          "Note": 4,
          "Lieu": "BB",
          "Pseudo": "BDF",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T21:33:19.000Z",
          "Titre": "Willingness to provide information that…",
          "Contenu": "Willingness to provide information that was accurate and useable.  The call started late though so he was a little fast."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T00:50:56.000Z",
          "Titre": "readily available to help",
          "Contenu": "readily available to help, with a real person!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T21:25:47.000Z",
          "Titre": "Customers Service was very good.",
          "Contenu": "Customers Service was very good., but we were never able to share screens.  It does not seem easy to connect with zoom."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shannon",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T23:36:37.000Z",
          "Titre": "We really appreciate Tarun being…",
          "Contenu": "We really appreciate Tarun being patient and answering all of our questions. We are planning to use Setmore a bit differently than intended, so we presented some challenging scenarios."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T21:04:11.000Z",
          "Titre": "The customer service was helpful",
          "Contenu": "The customer service was helpful, but unfortunately I didn't realize that I needed a few more features to sell my sessions and classes they way I needed."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Christopher",
          "Nb_Reviews": 2,
          "Date": "2021-05-27T19:17:52.000Z",
          "Titre": "Multiple treatments but ONE email 📧",
          "Contenu": "My waxing studio runs smoothly by the use of this app ,it’s super convenient and very efficient. I do feel that there is room for improvement, example ; when a client books a treatment giving them the option to choose multiple treatments but receiving one email (reminders included)for it would help so much rather that having to choose treatments individually and receiving emails individually."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "jskconsulting",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T20:38:49.000Z",
          "Titre": "The service is excellent in total",
          "Contenu": "The service is excellent in total. The only thing I hope to improve is the Teleport addon, which we face an issue not allowing to enter multiple participants. It is not working with some participants. Besides, it is much better if you add input fields allowing longer sentences (currently up to 250 characters, but it is too short to my customers, so we need to email them to ask further)."
        },
        {
          "Note": 4,
          "Lieu": "BO",
          "Pseudo": "jaime",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T10:46:47.000Z",
          "Titre": "it is a grate aplication and it would…",
          "Contenu": "it is a grate aplication and it would be even more useful if it was possible to block agendas for all persons with only one step on a holiday for example. As far as i could see, you can only do that one by one right now. Also it would be grate that it is possible to book two events at the same time for selected workers. Right now you can only aply it to all or to nobody."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Simon",
          "Nb_Reviews": 1,
          "Date": "2021-05-18T10:06:14.000Z",
          "Titre": "I have found the program easy to use",
          "Contenu": "I have found the program easy to use.  I have been working through how to use it best in my business.  I like the simplicity of it. One thing I think could be improved is that I get an email notification every time I put something into the schedule and also when I change the schedule. This then puts a lot of emails into my inbox. There may already be a way of turning that off but I haven’t had much luck in working it all out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary Kay Crutchfield",
          "Nb_Reviews": 2,
          "Date": "2021-05-04T15:23:16.000Z",
          "Titre": "I love everything.I vote 🗳 for multiple services",
          "Contenu": "I love everything. My customers do too. Only thing I would change is my ability to add multiple services. Like if someone books a haircut and then the next day says can we add a blow dry. I should be able to touch a button and add another service or the day I book or I can go down the list of services and touch all the things the customer wants done and then book the appt which has multiple services."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rebecca Foster",
          "Nb_Reviews": 5,
          "Date": "2021-05-21T13:11:45.000Z",
          "Titre": "Setmore is quite easy to set up and…",
          "Contenu": "Setmore is quite easy to set up and use. There are a few integrations still needed such as being able to use the Square gift cards when setting an appointment, as I am still awaiting that integration after several years of usage, but for the most part, that is the only issue. Customer service is on in minutes when direct chatting, and they help in any way they can."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 5,
          "Date": "2021-04-23T13:39:22.000Z",
          "Titre": "I really like using Setmore",
          "Contenu": "I really like using Setmore. I find it easy to set up and navigate. It is easy to change things too. But I do wish there were a way to block someone from making an appointment with this app. And I would like it if the time slots could be increased in size so I can read them easier and also add comments in each time slot. Overall, I would recommend this to anyone seeking an appointment setting app."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "JL",
          "Nb_Reviews": 6,
          "Date": "2021-05-14T08:36:04.000Z",
          "Titre": "Really good system for my appointments!",
          "Contenu": "Really good system for my appointments. (I am an Eye Doctor), just missing Spanish complete translation (now is a mix of English and Spanish, difficult to be understood, worse than my English, ha, ha). When this funcionality will be implemented I will give 5 stars and will pay for premium subscription (that will includde SMS reminders that I can not have now)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Toby Broadfield",
          "Nb_Reviews": 1,
          "Date": "2021-04-14T14:28:04.000Z",
          "Titre": "Really good, but could easily be GREAT!",
          "Contenu": "The app is really good, let me start out by saying that.  But a couple of key features would make it worth a 5 star rating and beyond!  1) A global search feature from the dashboard.  Type in a key word(s) and it would search Customers, Services and Notes.  2) Allow staff to schedule more than one Service for an appointment.  Both of these would be a game changer and immensely helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aikido",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T17:41:32.000Z",
          "Titre": "Setmore has been a pleasure to use!!",
          "Contenu": "Setmore has been a pleasure to use. It has allowed me to automate much of my daily tasks. I look forward to a more seemless checkout process where all the services booked during a client visit are combined into 1 total to checkout easier & more effectively. I would like to see a dedicated deposit option. Looking forward to future updates. 😊"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Meg",
          "Nb_Reviews": 1,
          "Date": "2021-04-27T04:06:10.000Z",
          "Titre": "Over all using setmore this last year…",
          "Contenu": "Over all using setmore this last year has worked well for me.  I love the option for automatic reminders and know that it has significantly reduced the amount of no show appointments. I would like there to be a feature that would total my monthly income. That would be helpful. If the phone app could be more capable like the desktop version that would be great, as the app is what I have access to more often than not."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Clinicians Fam Health",
          "Nb_Reviews": 1,
          "Date": "2021-04-13T11:15:48.000Z",
          "Titre": "Great scheduling app",
          "Contenu": "Great scheduling app, have been using it for a few years. I'd give it a 5 star, except it has one major flaw. When setting an appointment the viewing window is so small its difficult to.see which appointment you're choosing. Have brought this issue to Setmore's attention, but it seems they're not interested in addressing or fixing this issue. Overall, great app."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MoneyWorks Financial",
          "Nb_Reviews": 1,
          "Date": "2021-04-15T13:29:18.000Z",
          "Titre": "Love Setmore. Great for running 3 businesses as an Entrepreneur w/ integration tools to increase my productivity for my small team!",
          "Contenu": "Love Setmore. Great for running 3 businesses as an Entrepreneur w/ integration tools to increase my productivity for my small team!Love the integration with Answer Connect, Zoom, Mailchimp to integrate with my CRM seamlessly. Some improvements I would love to see.....Would love to be able to invite multiple customers to the same appointment with SMS and email reminders."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T15:51:41.000Z",
          "Titre": "Not perfect, but effective",
          "Contenu": "There could be improvements made to creating custom items for scheduling (such as adding enhancements to a session without adding time, etc), and it it frustrating that you can add a card-reading account but can’t save card information (I require card info for cancellation policies but do not allow prepaying). However the Google calendar sync if very useful, and it allows me to let clients schedule their own appointments when I am unavailable to book them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "South Jersey Window Tinting",
          "Nb_Reviews": 1,
          "Date": "2021-04-08T12:04:34.000Z",
          "Titre": "Great Service But Reminders Could Use Some Work",
          "Contenu": "So far Setmore has offered us a lot of what we are looking for. The reason we gave Setmore 4/5 stars would be because the text message reminder to clients isn't as customizable as we'd like. We offer different services like in-home installations as well as installations at our shop. Since there is only one template for text reminders a lot of our clients get confused because we have our shop's address in the confirmation text."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Giulia",
          "Nb_Reviews": 1,
          "Date": "2021-05-20T15:34:36.000Z",
          "Titre": "Great app",
          "Contenu": "The app is very convenient and easy to use, it simplifies the booking on both ends. The only suggestion I have for the designers is to make it possible to create multiple bookings in the same day, back to back, automatically removing service preset buffers for the same client on the same appt day, from both ends, user and client's."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "C OConnor",
          "Nb_Reviews": 1,
          "Date": "2021-04-14T13:59:56.000Z",
          "Titre": "Great for Scheduling Needs",
          "Contenu": "I began using Setmore when I shifted to an answering service to assist with my phones and scheduling in the office. Setmore is easy to use and has numerous features that allow for remote scheduling, client interaction, and even self-service. While their technical support/customer service can be a bit frustrating to deal with when you have something you are looking for or running into issues, overall, I'm pleased with the program and continue to use."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ross",
          "Nb_Reviews": 1,
          "Date": "2021-05-17T11:37:08.000Z",
          "Titre": "Stick with the free version",
          "Contenu": "I use the free version of the appointment system. It’s very easy to navigate around. A few things that could be improved but on the whole it’s pretty decent. I did pay for the extra benefits but the reminder service was an absolute pain. Wouldn’t send the reminders for the service before the cut if a client had one. Resulted in clients showing up late. I cancelled this straightaway after trying to sort it with setmore directly. Stick with the free version In my opinion."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ruff Cuts",
          "Nb_Reviews": 2,
          "Date": "2021-05-20T12:28:33.000Z",
          "Titre": "We need more space for booking…",
          "Contenu": "We need more space for booking policies, or whatever you call the box that clients have to OK prior to booking appointmentsFor reviews we should be able to toggle something so that only new clients are being asked to reviewI have had nothing but clients saying good things about Setmore. I have referred many groomers to use it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leigha",
          "Nb_Reviews": 2,
          "Date": "2021-05-21T18:46:24.000Z",
          "Titre": "Setmore is a fantastic way to organize…",
          "Contenu": "Setmore is a fantastic way to organize bookings!  I like the format of the calendar, being able to easily block off times, change working hours, set vacations, etc.  The only reason I gave it 4 stars is that I wish I could set up repeating appointments without having to pay... but I suppose you get what you pay for, as they say."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nicki Moody",
          "Nb_Reviews": 1,
          "Date": "2021-04-22T16:07:34.000Z",
          "Titre": "setmore was great for my beginner…",
          "Contenu": "setmore was great for my beginner business.  I eventually \"outgrew\" the service opting for a service more geared towards my profession with more customizable options. I would have liked setmore to have an option to customize when texts were sent.  i often has requests from clients to send a text 15 mins before appt vs 24 hrs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NP",
          "Nb_Reviews": 1,
          "Date": "2021-04-07T16:11:31.000Z",
          "Titre": "Great for starting out... but as we grow \"Meh\"",
          "Contenu": "Updates are too infrequent.  Client Note section is not truly helpful as is just a box to type in.  Wish it had more of a \"treatment note\" feel.  I would love 2-way confirmations that clients could msg directly to.  There are no reports available to segment clients into ages, dates of visit, average treatment cost, etc.  I wish the scheduler were more robust and allowed us to allocate resource rooms or specific services on only certain days/times."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "MSA Immigration Australia",
          "Nb_Reviews": 1,
          "Date": "2021-05-26T00:17:25.000Z",
          "Titre": "Teleport meeting room issue",
          "Contenu": "Everything worked well regarding the appointment booking, but we've had clients who complained about not being able to connect to the meeting room via teleport link. Most complains said that they connect to the same link as the team but the room is empty despite a member of MSA Immigration is already waiting in the room."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rachel Haymer",
          "Nb_Reviews": 2,
          "Date": "2021-04-06T16:20:08.000Z",
          "Titre": "Dependable product",
          "Contenu": "The good news is that Setmore has been dependable for me for many years and I do trust it to keep my scheduling in line. The reason I have only given 4 stars is that there are many features I would like to see - like the ability to link secondary emails for schedule blocking - auto importing of contacts into Mailchimp - more options for my clients on their end - the ability to put different signatures in for different types of appointments... the list goes on"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2021-04-12T16:39:40.000Z",
          "Titre": "It has a few bugs we want fixed and…",
          "Contenu": "It has a few bugs we want fixed and some things we wish could be added but nobody at Setmore can fix things or change/add things and there is no place to suggest this, so it is frustrating and seems like nobody cares about us.  But otherwise Setmore is pretty good.  Lots of little things we don't like but it's good enough for now."
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "NORRSAX",
          "Nb_Reviews": 1,
          "Date": "2021-05-21T21:12:50.000Z",
          "Titre": "Very good. Nice! 👍 Very good. Nice! 👍 Very good. Nice! 👍",
          "Contenu": "Very good. Nice! 👍Very good. Nice! 👍Very good. Nice! 👍Very good. Nice! 👍Very good. Nice! 👍Very good. Nice! 👍Very good. Nice! 👍Very good. Nice! 👍Very good. Nice! 👍Very good. Nice! 👍Very good. Nice! 👍Very good. Nice! 👍"
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "F Chin",
          "Nb_Reviews": 1,
          "Date": "2021-04-13T13:20:30.000Z",
          "Titre": "An easy to use and effective tool for appointments",
          "Contenu": "Setmore has been a very useful and easy to use tool for scheduling my appointments, here in Singapore.  Technical support has been responsive and questions were answered consistently. There were a few occasions of missed sms reminders to clients in the earlier years when I used the App, but has been quite smooth sailing ever since."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Karthik",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T12:36:41.000Z",
          "Titre": "Decent app",
          "Contenu": "Decent app, helps me schedule my tutoring sessions with less hassle. In the dashboard section, it would be good if they can show earnings for past weeks as well - I get to only see the current week earning progress. Also, it would be better to add multiple currencies for tracking students from different geographies."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "MnK NIseko",
          "Nb_Reviews": 1,
          "Date": "2021-05-03T05:58:49.000Z",
          "Titre": "It worked well for what we needed",
          "Contenu": "We are using this for a private shuttle service reservations system.Although it is not made for what we need It worked well for what we wanted.We found one of the only problems was not being able to set a buffer time before a schedule. For Eg. if we need to pickup a customer and it takes us 15min to drive to them, then the reservation time would be the time we leave the main depo. This was sometimes confusing for customers as the reservation time pickup time would be incorrect for them."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Greg Charalambous",
          "Nb_Reviews": 2,
          "Date": "2021-04-13T21:49:22.000Z",
          "Titre": "The booking system is very streamline",
          "Contenu": "The booking system is very streamline, makes it really quick and easy to set and edit appointments, reminders, working hours etc. only issue comes when the app sometimes seems to get buggy and doesn't show certain days or appointments. It it obvious they are appointments set as you cannot book over those times but you can't see what the appointments are or who they are with. apart from this it is a really solid peice of software and Ive used it since Beta stage 5+ years ago"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "HR",
          "Nb_Reviews": 1,
          "Date": "2021-04-27T14:38:48.000Z",
          "Titre": "Setmore has helped us with scheduling…",
          "Contenu": "Setmore has helped us with scheduling the onboarding and training of our new employees.  They have listened to our suggestions to improve their services and are constantly upgrading and making improvements.Only things that would be great to add would be the ability to determine different building locations for trainings as well as different time frames that appointments will be closed based on the day of the week.  (Lead time for Monday would need to close Friday instead of Sunday, etc.)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2021-05-18T23:03:10.000Z",
          "Titre": "I really enjoy the app",
          "Contenu": "I really enjoy the app, and my clients like the ease of use for the web link they use. The biggest thing I see that is missing (and it may be operator error or lack of knowledge) is the ability for clients to be able to cancel or reschedule appointments on their own. Additionally, I have multiple coaches that use the facility. If one of my clients wants to schedule 6 pm on Tuesday, and another coaches client wants the same time slot, the app will allow double booking, although we don't want that."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Katie Lipton",
          "Nb_Reviews": 3,
          "Date": "2021-05-14T12:31:10.000Z",
          "Titre": "Good system and easy to use",
          "Contenu": "Good system and easy to use. Does what I need it too. The only downside is that the packages they offer aren’t explained fully. I opted for the highest package to cover the staff I had plus, I thought, if I wanted to add any at a later date. I did add another staff member and was charged more money. This wasn’t made clear when purchasing the package. It says 4+ but any more than 4 and your charged extra. So technically, the top package is 4 maximum and should be made clearer to potential purchasers more clearly."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ellen",
          "Nb_Reviews": 4,
          "Date": "2021-05-26T12:21:44.000Z",
          "Titre": "4/5 very helpful booking system",
          "Contenu": "My only issue is that clients/patients can book an apt without my approval, and sometimes it can take me by surprise. Its also not essential for them to provide all contact details/address/last name - which is not helpful when running a mobile clinic.Other than that, fantastic booking system!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Zilda",
          "Nb_Reviews": 2,
          "Date": "2021-05-18T13:12:33.000Z",
          "Titre": "I am pretty happy with Setmore and its…",
          "Contenu": "I am pretty happy with Setmore and its functions, if there was one thing i would like to add would be the possibility to send notifications to customers in their preferred language, i have French and English speaking customers and they do comments that it would be nice.Thank you!Zilda Aguiar"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cuts by Durante",
          "Nb_Reviews": 1,
          "Date": "2021-05-18T13:31:21.000Z",
          "Titre": "Only grip I have is when my clients are…",
          "Contenu": "Only grip I have is when my clients are allow to set appointments in time spots that aren't available. I do my appointments on the hour and I'll get ammo 12:15 appointment or a 4:45. Heck even a 6:30. That is an inconvenience to my other clients and myself. Not to mention how bad it throws my day off. I simply reminds my clients my times of operation and reset their appointment time. That's for the good times that heavily out weight the bad... Keep up the good work and looking forward to giving you a 5🌟 review..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "K.S",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T16:20:00.000Z",
          "Titre": "I love this app it’s great",
          "Contenu": "I love this app it makes my life so much easier. The only thing I wish it had was the ability to change your availability in the future. For example, starting June 1st I wanted to change my hours of operation. I had to change my hours of operation forever basically and manually go in and block of the days I couldn’t do starting June 1st. Other than that this app is great I love it so much. I even put my own personal events in it so I don’t book anyone without realizing it. It keeps me very organized with business and with personal life."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Christinas Furry Tales",
          "Nb_Reviews": 1,
          "Date": "2021-04-13T10:02:35.000Z",
          "Titre": "Very happy with the Setmore app",
          "Contenu": "Very happy with the Setmore app. My only problem is that every time the clients want to book they create new accounts. Not sure if it’s a problem for pc users or mobile users but it’s annoying having multiple accounts for same client. If you can rectify this it’s a 5 star booking system for me!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Martin",
          "Nb_Reviews": 2,
          "Date": "2021-05-27T14:14:35.000Z",
          "Titre": "I use this App a lot for scheduling…",
          "Contenu": "I use this App a lot for scheduling work for our team. I don't use it to make the customers aware of our intent since my scheduling can change at any moment due to a variety of reasons. It really works out well to give our installers a heads up on what is going on in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ansara Tax",
          "Nb_Reviews": 2,
          "Date": "2021-04-14T14:00:13.000Z",
          "Titre": "Almost perfect",
          "Contenu": "Almost perfect.  The only thing I would like to add are appointments that only our staff can schedule (but not an 'event')  For instance, I don't want clients to be able to schedule video meetings, only staff.  Otherwise we love it and are so glad we changed from Schedulicity."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alanna",
          "Nb_Reviews": 1,
          "Date": "2021-04-14T15:05:44.000Z",
          "Titre": "This program has some great features…",
          "Contenu": "This program has some great features and makes customizing your appointments and availability easy.But there is a lot they can do to improve the program.  Captcha, to avoid other systems from trying to charge customers to make appointments.  The reporting piece needs to have more options, there is some much great data being captured there is just isn't anyway to pull it out easily.And allowing to have holidays etc easily shared between all staff.  Right now you have to enter holidays for each staff member.  That leaves some room for error."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Drlj",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T13:58:41.000Z",
          "Titre": "I would like to see the option to add a…",
          "Contenu": "I would like to see the option to add a tip feature on the payment screen. My customers like to prepay for everything online.I like the buffer feature, but I don’t like how it shows the customer the extra built in time on the Appointment screen. Overall the app works great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob Rosenthal",
          "Nb_Reviews": 1,
          "Date": "2021-05-26T13:12:17.000Z",
          "Titre": "Useful",
          "Contenu": "While I'm using the free version only, I do find Setmore valuable in helping me schedule appointments with both prospects and clients. It is fairly easy to use on my end. I've had no complaints from anyone scheduling time with me about its usability. Everyone finds it useful and easy to use. The downside to the free version is the lack of integration with other calendar tools like Outlook. To keep Setmore so it shows only available time, with the free version if you do schedule using another calendar as your primary, you do need to manually update Setmore."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrea",
          "Nb_Reviews": 1,
          "Date": "2021-05-29T19:21:25.000Z",
          "Titre": "I love Setmore and have been using it…",
          "Contenu": "I love Setmore and have been using it faithfully for over 6 years but three things would make it the best.1 - The ability to see availability for the entire team on one screen2 - The ability to choose availability for different times for different services.  For instance, we'd like to do Service A on Tuesdays but not Service B we should be able to set a schedule for Service A is open for scheduling but not Service B without having to shut the entire calendar down for that date.3 - Being able to see the team's schedule for more than just the current week."
        },
        {
          "Note": 4,
          "Lieu": "MT",
          "Pseudo": "Beautypoint",
          "Nb_Reviews": 1,
          "Date": "2021-05-28T13:57:20.000Z",
          "Titre": "Am very pleased with the service and I…",
          "Contenu": "Am very pleased with the service and I enjoy to recommend this service to others. The only thing is that sometimes during the day the page freezes up and I have to refresh every so often to be able to continue.Other then that very happy :) keep up with the good work"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kaye",
          "Nb_Reviews": 1,
          "Date": "2021-05-28T22:23:13.000Z",
          "Titre": "Very intuitive & integrative calendar app",
          "Contenu": "Even for the people who are not very tech savvy, someone can easily and quickly set up and manage Setmore. What’s best is Setmore integrates with other applications so you don’t have to go back to the app or web-based version to see if you have appointments. Score!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Seaside Spa",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T13:38:04.000Z",
          "Titre": "Been using Setmore for my Spa business…",
          "Contenu": "Been using Setmore for my Spa business since start up (4 yrs) its great! Daughter uses it now as well for her Tattoo business!I havent figured out though, had to turn off ‘self booking’ when I hired another employee...cant have 2 appt’s in my 1 service room:("
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Bnn",
          "Nb_Reviews": 3,
          "Date": "2021-05-14T13:09:12.000Z",
          "Titre": "Excellent system, except for recent customer payment issues",
          "Contenu": "SetMore is a fabulous system. I have been using it for one and a half years and have been very impressed with how well it works and how quickly the support staff respond. It is very intuitive and wonderful for my one-woman small business. The only reason I have given 4 stars and not 5 is that there has been a recent reoccurring issue in which payment methods for customers have been disconnected from my account. This has been very problematic for me as customers are usually required to pay on booking and with the disconnection I've had problems chasing up people for payment for appointments."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JD",
          "Nb_Reviews": 1,
          "Date": "2021-04-16T04:24:54.000Z",
          "Titre": "I love this program and I’m a happy subscriber.",
          "Contenu": "I love this program and I’m a happy subscriber. Their customer service is great as well. I would like them to incorporate an option to limit the number of appointments per limit of time. Such as 3 per week or 1 per day. Other than that I have no complaints."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-07T17:53:39.000Z",
          "Titre": "Great service and ease of customer use…",
          "Contenu": "Great service and ease of customer use according to my clients.Would like for \"skip this step\" to be more prominent in the customer info area. Would make one less step in booking.That's the only consistent comment I get from my customers."
        },
        {
          "Note": 4,
          "Lieu": "OM",
          "Pseudo": "Amour Al Sharji",
          "Nb_Reviews": 1,
          "Date": "2021-04-08T17:16:49.000Z",
          "Titre": "Sermore is one of the great scheduling…",
          "Contenu": "Sermore is one of the great scheduling platform, very customerized and very easy to use, from my experience for past 4 years +, I find it great platform and I would like to suggest to add Google location tag on customer address it will be much better"
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "Christie Gravani",
          "Nb_Reviews": 2,
          "Date": "2021-04-23T10:41:06.000Z",
          "Titre": "This is a great scheduling app",
          "Contenu": "This is a great scheduling app. Simple and very convenient. There were just a couple of hiccups though - some clients' data lost and took too long to retrieve. Customer service quite helpful and willing to help you along with your problems."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Leane Capitano",
          "Nb_Reviews": 2,
          "Date": "2021-05-14T12:35:36.000Z",
          "Titre": "I would say this booking site is…",
          "Contenu": "I would say this booking site is helpful, however, I did have some issues with texting confirmations some clients would tell me they never received an SMS text and I pay for this service. Besides a few glitches, I think it is a helpful tool."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "remedyonemassage",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T09:43:42.000Z",
          "Titre": "Suggestion",
          "Contenu": "Very happy with most things but could you make an option to drop treatment choices for future online bookings..I tried to disengage all massage options off my booking system but was unable too because I have upcoming massage bookings.."
        },
        {
          "Note": 4,
          "Lieu": "HR",
          "Pseudo": "Darko",
          "Nb_Reviews": 1,
          "Date": "2021-05-17T12:27:38.000Z",
          "Titre": "Great App guys",
          "Contenu": "Great App guys! The few tweaks I would appreciate: allow customer database export to xls and/or csv. Also, allow in the calendar view overview of all technicians daily appointments (not only individual technician daily appointments)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bekah",
          "Nb_Reviews": 1,
          "Date": "2021-05-21T11:23:44.000Z",
          "Titre": "Good ap",
          "Contenu": "I really like the ap, but I wish I could make different prices for different clients. Mine are not always the same. Maybe you can in the paid version?? Being able to include or track miles would be a fantastic edition as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "iris",
          "Nb_Reviews": 1,
          "Date": "2021-05-24T13:36:22.000Z",
          "Titre": "Reflections on few years' use",
          "Contenu": "Been using Setmore for a couple of years now - it is convenient, generally does a good job keeping track of appointments, and runs well on my phone. Positive feedback:Thanks for getting rid of the separate pathway to make slot blockers, so we can use the same button to make any kind of appointment. Suggestions -1) I rarely see the same person twice (niche practice), so it would be nice to be able to bypass entering patient name into Setmore when setting appointment (I put name and phone # into notes).2) My practice is by appointment only, and I only go in some 15-20 hours a week. It would be convenient to be able to set alarms to remind ME to go in to see a patient."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Michal",
          "Nb_Reviews": 1,
          "Date": "2021-05-24T12:28:19.000Z",
          "Titre": "I am very satisfied with the service",
          "Contenu": "I am very satisfied with the service! My only comment is that modifying some features like price of items is not as intuitive or user friendly as I would like, but after a few attempts I am able to create and save changes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph Smith",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T14:22:43.000Z",
          "Titre": "I love this app",
          "Contenu": "I love this app, helps me keep everyone at the office organized. Occasionally it will malfunction and switch the doctors names around but it doesn't affect us that much. We'll continue to use this very helpful app."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ami",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T13:19:12.000Z",
          "Titre": "Works for exactly what I need tbe…",
          "Contenu": "Works for exactly what I need tbe progra. For. Easy and my clients love this option.  Have the odd issue with a setting change with upgrades and such but quick responses from online help to fix and get right back at it."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Roslyn",
          "Nb_Reviews": 1,
          "Date": "2021-05-23T09:55:37.000Z",
          "Titre": "App is good but find it doesn’t cater…",
          "Contenu": "App is good but find it doesn’t cater for 1/2 hr lunch break wants to continue with scheduling 1hr appointments with 1/2 hr sanitation break as rest of day. Working alone I can’t let clients book due to this problem"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sabrina Bankes Fernandez",
          "Nb_Reviews": 2,
          "Date": "2021-04-19T16:37:04.000Z",
          "Titre": "Easy to use",
          "Contenu": "Simple, easy to use, indispensable in my business. The crew can see their appointment and all pertinent notes, including the clients address with GPS directions. Clients are reminded for no additional texting fee."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "AAS",
          "Nb_Reviews": 1,
          "Date": "2021-05-13T11:47:06.000Z",
          "Titre": "It’s a really good app",
          "Contenu": "It’s a really good app, love using it but it desperately needs a searchable ability of the ‘custom description’ area of the bookings. Also an Automotive version where number plates can be inserted and searched!"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Roché",
          "Nb_Reviews": 2,
          "Date": "2021-05-18T18:03:46.000Z",
          "Titre": "This is a brilliant app",
          "Contenu": "This is a brilliant app, the best I have used on the free version, the support is also awesome. There are a few things that could still improve like making multiple service appointments for the same client."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Michelle Keast",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T23:45:34.000Z",
          "Titre": "Great Explanation",
          "Contenu": "Joshua gave a very thorough walk through giving me a good understanding of how I could use it going forward.  Well explained."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Zinger Clausell",
          "Nb_Reviews": 1,
          "Date": "2021-05-21T14:07:49.000Z",
          "Titre": "Setmore Rocks!",
          "Contenu": "I love the convenience aspect of Setmore. It has really helped me to keep my business appointments on time but most importantly allow my clients to book themselves without waiting on me to do it for them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lo",
          "Nb_Reviews": 6,
          "Date": "2021-04-08T16:45:29.000Z",
          "Titre": "Very easy to use",
          "Contenu": "Very easy to use, great for small business.  I wish that the standings (repeat people) would not just stop in a year.  It should not have and end date! But with that said, very easy to use and works great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Serenity Brown",
          "Nb_Reviews": 1,
          "Date": "2021-04-08T12:52:54.000Z",
          "Titre": "Slowly but surely you all are upgrading…",
          "Contenu": "Slowly but surely you all are upgrading !! I stook it out with you all over two years ! I simply need a few more things that you all don’t quite over just yet ! But my clients LOVE the ease of the site !!!"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Jacinta",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T13:47:19.000Z",
          "Titre": "Card payment options not inclusive",
          "Contenu": "I will give 5 stars soon as your card payment options include other countries, feeling un-catered for here in South Africa. Otherwise, an amazing app that has made client bookings a breeze. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T15:00:31.000Z",
          "Titre": "I would give 5 stars but I don't like…",
          "Contenu": "I would give 5 stars but I don't like the fact that I need to refresh it when I pull up the calendar.  I feel that it should automatically open up to todays date.  Instead, it opens up on February of last year every single time. It takes two clicks to get to the current date.  I have to click on the little person icon in the top right corner, then click on refresh from the pop-up.  Also, I wish that I could have more options of customizing the services we provide, for example...I would like to be able to set a specific service to be scheduled from 12:00 AM to 12:00 PM only, and another service from 12 noon on because we only offer some things in the mornings and some in the afternoons.  Other than that I love it and use it daily."
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "ohh_Salvatore",
          "Nb_Reviews": 1,
          "Date": "2021-05-20T17:58:33.000Z",
          "Titre": "Necessary at least",
          "Contenu": "Hi, there is nothing to compare. The developers , the assistance and the project is more than 5+ stars. I would love to see some old interface but its ok not so important. Keep going and THANK YOU!"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Baukje",
          "Nb_Reviews": 1,
          "Date": "2021-05-20T12:21:59.000Z",
          "Titre": "Setmore is very user friendly",
          "Contenu": "Setmore is very user friendly and the service is great. The connection between Google agenda is a bit slow and it's a pity it doesn't work with iDEAL/Mollie Payments. Therefore no 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "nbburn",
          "Nb_Reviews": 3,
          "Date": "2022-01-20T19:52:40.000Z",
          "Titre": "Setmore Demo, Setmore in general",
          "Contenu": "It was just a basic intro to the platform, but it was useful. I got to ask specific questions. Hema was great (5 stars!) and very patient as the sound didn't work on either end at first and waited for me to take care of my doggies.My only complaint was with the platform itself which, though it has a lot of integrations with other systems, it lacks a lot of functionality that I desire like saving CC info for clients, having a class with recurring sessions for the same customers (like a class that is held on Tuesdays at 1pm for four weeks) that the customers only have to sign up for once, or having multiple reminders at different times (like 1 day for an email, and then a text 1 hour before).Still a good platform. Hopefully they'll add lots more functionality to their own app, rather than spending more time on integrations."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Sarah-Jane Griffin",
          "Nb_Reviews": 1,
          "Date": "2021-05-22T17:57:57.000Z",
          "Titre": "Please read ;)",
          "Contenu": "This is a good thing but can be a bit pricy compared to others if you have more than five say six the cost outweighs the need as I have to pay for ten, so it outweighs the need for the expense"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Veronica H.",
          "Nb_Reviews": 2,
          "Date": "2021-05-25T12:22:32.000Z",
          "Titre": "So far so good👍🏽",
          "Contenu": "So far so good, only issue is when a client book an appointment it's locked in for that certain time.  Is there away for a client to change their appointment or cancel there appointment."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2021-05-28T08:24:31.000Z",
          "Titre": "The app itself is awesome",
          "Contenu": "The app itself is awesome. We had a few change requests which took Setmore a lot of time, but in the end, the user experience for our clients is real smooth. And that's what counts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steph",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T11:31:34.000Z",
          "Titre": "It’s a great software! For ANY business!",
          "Contenu": "Still having a few issues where my clients aren’t seeing my correct availability times but other than that I LOVE this Alp it’s increased and has completely changed my fitness business!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julie Ling",
          "Nb_Reviews": 1,
          "Date": "2021-05-07T17:10:34.000Z",
          "Titre": "Overal positive experience",
          "Contenu": "Overall, I've had a positive experience with Setmore from the really user friendly interface to the ease of my clients booking online to the quick help chats. I had noted a few changes to really make the user experience even better ie. for the text reminders, if it can be a 5 digit number instead of a telephone number. My clients dont realize that the text is from an automated system and they respond back to that telephone number. Another example, we received a lot of reviews but it is only available on the setmore platform. We would love to make the reviews visible on yelp and/or google. So once I stopped asking reviews from the clients, this also blocks any potential clients from seeing the existing reviews on setmore. Again, overall very happy but would be happier if consistent improvements were made."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "shauna holley",
          "Nb_Reviews": 1,
          "Date": "2021-04-14T22:45:49.000Z",
          "Titre": "We love the app and its convenience",
          "Contenu": "We love the app and its convenience! however I would love to be able to change my automated text message, send out mass texts with promos and/or message multiple client groups!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Don S",
          "Nb_Reviews": 1,
          "Date": "2021-04-13T13:59:18.000Z",
          "Titre": "Works well most of the time",
          "Contenu": "Works well most of the time.  No software is perfect.  It would be nice if the calling phone number could be imported into Setmore with a single click!  That should be doable!"
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "HL",
          "Nb_Reviews": 1,
          "Date": "2021-05-31T06:45:33.000Z",
          "Titre": "Multiple Locations for Appointments",
          "Contenu": "The system is simple and easy to set up.It would be great if the appointment can be set for more than 1 location. Currently, we can only set appointments for one location."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Bernard Klatt",
          "Nb_Reviews": 1,
          "Date": "2021-05-21T09:02:49.000Z",
          "Titre": "It's not the best fit for how I use it…",
          "Contenu": "It's not the best fit for how I use it - time tracking (documenting what I did after I do the work), but they provide helpful, timely tech support when I needed it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg Anderson",
          "Nb_Reviews": 1,
          "Date": "2021-05-26T13:42:58.000Z",
          "Titre": "Already an Invaluable Tool",
          "Contenu": "I tried the Setmore App after a bit of research on appointment schedulers, as I was about to go into a period of interviewing and working with actors on our upcoming series. The app made the entire process of allowing actors to self-schedule their own appointment times, and then for us to seamlessly hold and record the sessions something easier than a breeze. We remain very happy.The reason for the 4-out-of-5 review is that my one quibble (which is an entirely personal one, but may also apply to others) is the look of the app. It is not visually engaging on either the host or user end, and we are firm believers in visual appeal contributing to user engagement and satisfaction. Better graphics and UI are, in my opinion, called for. If the app looked as good on-screen as it works, I would have sought to find a way to rate it 6-out-of-5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Catherine Dalla",
          "Nb_Reviews": 1,
          "Date": "2021-05-28T04:08:32.000Z",
          "Titre": "Setmore has been a great system for my…",
          "Contenu": "Setmore has been a great system for my students to book individual appointments with me. It's easy to use, and the regular notifications and reminders are helpful. I like that I can customize appointment types for my students to select. However, the visual calendar blocks do not align well with the time slots and sometimes it's hard to click the correct area to get the time I want. I have to correct it in the drop-down menu.The visual part could be improved to be clearer to the eye. It gets a little frustrating, when I use it so often.Also, it would be nice to have the option to block out certain days instead of having to manually block out sections, or change the availability for all Mondays, or Wednesdays, etc. I understand if that's already a premium option and not the free one, but having more schedule options would be nice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2021-05-26T11:56:50.000Z",
          "Titre": "Would be cool to provide a mapping…",
          "Contenu": "Would be cool to provide a mapping service that shows where our customers are based on of course their address. It would also make scheduling eaiser and more efficent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pamela Swanson",
          "Nb_Reviews": 1,
          "Date": "2021-04-15T15:08:47.000Z",
          "Titre": "Setmore does a good job of providing…",
          "Contenu": "Setmore does a good job of providing integrations, which has made my life easier and more efficient when managing my time. I would like to see more options for reporting, e.g., ability to filter and pull data fields that I've created such as Company Name, Payroll Company, Support Representative.  I use the calendar to schedule software training classes where more than one person attends.  It would be nice to include a place where the creator of the appointment can add participants and send them the invitation when they create the appointment with me.  I cannot use the Webinar feature because I teach sensitive information and cannot allow people to join our meetings outside of the organization I am teaching at that time.  If that makes sense.Just a couple notes, but very satisfied with Setmore product. Thank you!Pamela Swanson"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "CAF Pisa",
          "Nb_Reviews": 1,
          "Date": "2021-04-23T15:12:54.000Z",
          "Titre": "The pest will be to have a stard e…",
          "Contenu": "The pest will be to have a stard e expired date for services (our sevices are by season and not during all year). We do use  a lot of escamotages to solve the problem"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nichole Missino",
          "Nb_Reviews": 5,
          "Date": "2021-04-15T14:00:30.000Z",
          "Titre": "It could use a few things",
          "Contenu": "It could use a few things. The ability to block clients from booking who constantly don’t show up, the ability to send mass emails to all the email addresses on file."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandy Joscelyn",
          "Nb_Reviews": 1,
          "Date": "2021-04-14T17:10:35.000Z",
          "Titre": "So far one of the best calendar apps…",
          "Contenu": "So far one of the best calendar apps that works with Facebook and is easy to use. I would give it 5 stars but there is always room for improvements with any products."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "School Administration",
          "Nb_Reviews": 1,
          "Date": "2021-05-18T13:25:40.000Z",
          "Titre": "We love this program - GED program",
          "Contenu": "We love this program! We are a non-profit that lives on three full-time employees and 2 part-time employees. We use our budget to keep our services (offering free high school education to drop-outs and foodbank services to the community) free for all who walk through our doors. While testing is nearing $120 per test this program lets us spend money where it counts and continue to stay organized and give our student body autonomy to schedule as they see fit. There are a few things we could use that would help as time is a premium in our situation blocking a student from being able to schedule after a few No Call No Shows would help with a pop-up of call the center. Also, the texting option that is not free would be a fantastic asset for a group like us. Overall this program is amazing and I know we plan to continue to use what is available as long as possible."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Annie English",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T22:52:22.000Z",
          "Titre": "Setmore provides awesome Live 1:1 product demo",
          "Contenu": "Setting up a preview video call to answer my questions about the Setmore features was just what I needed to know this was the perfect scheduling platform and app for me. Swati answered all my questions pointedly, professionally and in a warm, friendly way. She also demonstrated what we discussed. Actively listened, clearly explained and offered alternatives. I will be able to send 1 link that has the scheduling and payment option all in one. I highly recommend Setmore."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victoria Jimenez",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T23:03:43.000Z",
          "Titre": "Knowledgeable staff",
          "Contenu": "Joshua was very knowledgeable and explained how to use the features for this platform in a simple way. I feel as though I can now confidently use the platform without \"hoping\" I'm doing things correctly. Thank you so much, I can't wait to start booking my mini sessions!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richie White",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T17:57:55.000Z",
          "Titre": "I had a great oboarding experince just…",
          "Contenu": "I had a great oboarding experince just now for the setmore platform. Anutham was the person that guided me today, and I was very happy with his efficiency to get me started and to help me understand what I had available to me. And best of all if I have future questions he gave me a contact to reach him with any further questions that may come up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C. Jordan",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T20:15:37.000Z",
          "Titre": "Just had my onboarding session with…",
          "Contenu": "Just had my onboarding session with Anutham Chakravarthy. He was very thorough and detailed in demonstrating Setmore's features. I appreciate Anutham pausing to answer my questions to ensure I had an understanding before proceeding with the next feature. I recommend all new users to take advantage of the onboarding call before diving in by yourself. The call with Anutham was very beneficial. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Kids Dental Home",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:05:59.000Z",
          "Titre": "Thank you for an incredible…",
          "Contenu": "Thank you for an incredible presentation and experience. Precisely what we need for our kids dental practice!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TheArtInHair",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T22:50:08.000Z",
          "Titre": "Swati was very helpful!",
          "Contenu": "My video call with Swati was very detailed and informative, she went through the possible ways I could intrergrate the setmore booking system across the board on social media and my website as well as payment options. What I love about setmore is that they actually want to provide better booking options for your client even when you aren't a pro member."
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "Oliver Vasilj",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T13:34:45.000Z",
          "Titre": "I was in a video call with Joshua about…",
          "Contenu": "I was in a video call with Joshua about subscription and all the information that I needed was provided and additional advice was given as well. All the best to Joshua and the team."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Christine Porta",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T04:06:23.000Z",
          "Titre": "Very happy with the service and the…",
          "Contenu": "Very happy with the service and the demo. Anutham Chakravarthy has been very helpful and clear in going through all the functions and tools. Thanks a lot. Looking forward to start using the service. :)"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "suman kanwar",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:50:28.000Z",
          "Titre": "It was great talk and exploration",
          "Contenu": "It was great talk and exploration. Great session.Pranav"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sarah",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T21:51:55.000Z",
          "Titre": "Dinesh was extremely helpful and kind",
          "Contenu": "Dinesh was extremely helpful and kind. He helped me understand the nuances of the booking app which were confusing me. His promptness, polite-nature, and knowledge of the app were impressive."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Gorgeous le",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T10:16:00.000Z",
          "Titre": "Salman Abdur",
          "Contenu": "Salman Abdur, was very good at going through every feature thoroughly fast enough that i don't need to waste too much time. On the first round it was all i need to get started. thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T23:53:13.000Z",
          "Titre": "Thank you very much for getting this…",
          "Contenu": "Thank you very much for getting this issue resolved. I really appreciate your dedication and your time and patience in resolving this headache. Great job!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "aaron freeman",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T20:36:20.000Z",
          "Titre": "Great service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hassan",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T07:11:30.000Z",
          "Titre": "10/10 must try again.",
          "Contenu": "10/10 must try again.Now rizzing up all the niqabi"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T04:26:08.000Z",
          "Titre": "Answered my questions exactly and got…",
          "Contenu": "Answered my questions exactly and got me set up perfectly.  Good to go in 15 minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Golliheair",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T19:45:54.000Z",
          "Titre": "Chendur was a delight to speak with",
          "Contenu": "Chendur was a delight to speak with.  He is very knowledgable about his products. I was recommended to Setmore by another practitioner, however, I may require more applications for my practice.  The fact Setmore is inexpensive is remarkable plus no additional app for my client to download to make an appt.  Definitely lots to think about.  No additional fees!  Wow!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Healing wings support",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T13:38:45.000Z",
          "Titre": "Support team are very helpful",
          "Contenu": "Support team are very helpful. I strongly recommend if you are looking for an organisation that helps you build a strong team. Spoke to Joshua today and he was fantastic"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ONELEAF INC",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T02:02:53.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "The customer support is amazing The customer support Lakshya is the best! He is amazing!!! He is super kind sweet. He is not just computer help. He tried to stand same place as me and was thinking about my problem. Very understandable, super professional. I’m so happy to use the Setmore system because of him!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T21:17:23.000Z",
          "Titre": "Grateful to find a scheduling app…",
          "Contenu": "Grateful to find a scheduling app company where i can actually speak with a live person! Anutham was very polite and offered a full review of all the capabilities of the program which was very helpful and answered my questions. The only constructive feedback would be that he does speak very fast but i realize there was a lot of information he needed  to share in only a half hour. He was polite and apologetic and made sure i could follow him. I look forward to trying out there program for my scheduling needs. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Andrea Feldman",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T23:15:09.000Z",
          "Titre": "Great Support!",
          "Contenu": "I am new to the platform and booked a call with support for a tour and some guidance in getting started. Anutham Chakravarthy was my Customer Onboarding Specialist and was an absolute joy to spend this time with. From his warm and welcoming smile to his patience in showing me around, this was one of the best experiences that I have had in trying to find my way around the online booking service/calendar world.Thank you Anutham!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Blue Moon Water",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T16:59:30.000Z",
          "Titre": "Outstanding Service and Support from Swati!",
          "Contenu": "I can't express enough how impressed I am with the level of service provided by Setmore, especially thanks to Swati. From the moment we got in touch, Swati's responsiveness was extraordinary. She reached out to us in record time and demonstrated an exceptional level of professionalism.Swati's knowledge and expertise were invaluable. She not only answered all of our questions with precision, but she did so with a warmth and kindness that made the entire process a pleasure. It's evident that Swati takes immense pride in her work, as she executed her responsibilities with utmost diligence.Overall, thanks to Swati's outstanding efforts, our interaction with Setmore has been nothing short of exceptional. We're incredibly grateful for her assistance and would highly recommend Setmore to anyone in need of top-notch service and support in this field.Kudos to Swati and the Setmore team!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Krishna Ramamurthy",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T06:45:32.000Z",
          "Titre": "Courteous and solution focused services"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lorralafrican Braids",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T01:54:12.000Z",
          "Titre": "Am so very happy to talk to him",
          "Contenu": "Am so very happy to talk to him, he helped me with all my problems on how to make my Setmore app works well. And his not rude💯 his very calm and understandable . Am happy his the one I spoke to because he did really fantastic in all his explanation💯 if there is 10 star I will definitely give him a 10star⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Chidera",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T16:58:18.000Z",
          "Titre": "Best service!",
          "Contenu": "He was very patient and answered all my questions. He explained everything clearly keeping me engaged throughout the process"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "kari bell",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T11:09:56.000Z",
          "Titre": "Tutorial by Anutham…",
          "Contenu": "I  have just started the set up of this scheduling system but I wanted to write a review about Anutham and the option to have a free tutorial before signing up.  Anutham was amazing at answering my questions and hitting all the little nuances to this program.  He is the reason i am signing up and i hope as i grow i can continue to reach out to him to learn more"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T20:04:22.000Z",
          "Titre": "Swati was very informative and sweet",
          "Contenu": "Swati was very informative and sweet. Was able to answer all my questions as well as look up the answers to the ones she didn't know immediately."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Beautish Ng",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T12:01:48.000Z",
          "Titre": "Anutham for setmore is the BEST!",
          "Contenu": "I have been using the setmore app for about a year now and I’m highly impressed with how accountable and user friendly this app is…..I was opportuned to talk to one of the team members, Anutham Chakravathy. Who was very attentive during my live demo and he helped me navigate and create the solutions I needed with my booking page. I can’t thank him and the setmore team enough,  for such great customer service!!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alexandra",
          "Nb_Reviews": 10,
          "Date": "2023-08-14T21:08:17.000Z",
          "Titre": "Great demo!",
          "Contenu": "Salman gave me such a great demo for this app! I’m so surprised at how easy it looks to navigate compared to the other booking systems I’ve viewed. Salman explained everything in such detail for me to see the booking system from my point of view and also the clients point of view, which is very important for me to understand before committing to Setmore. I’m definitely signing up! Thanks again, Alex 😊"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracey Marashlian",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T22:06:25.000Z",
          "Titre": "Setmore customer service",
          "Contenu": "I pay to use Setmore for our personal training appointments and it's been great, up until recently, when I was unable to edit appointment times on the mobile app (critical for our business). I asked for help and Lakshya stuck with it until my issue was solved via their tech team. It took a week but it's now resolved thanks toLaksya's persistence and care."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Jay Patel",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T10:33:13.000Z",
          "Titre": "Awesome experience talking with Salman",
          "Contenu": "Awesome experience talking with Salman, he walked me through everything via zoom call, he cleared all my doubts and questions. Great person."
        },
        {
          "Note": 5,
          "Lieu": "BS",
          "Pseudo": "Colyn",
          "Nb_Reviews": 3,
          "Date": "2023-08-23T12:05:49.000Z",
          "Titre": "Anutham made the experience great",
          "Contenu": "Anutham made the experience great.  This product is a phenomenal appointment scheduling too. It makes it easy to setup and have others setup appointments. I like the ranges and types of appointments, the ability to sync with other calendars, the opportunity to bill and charge if necessary and all persons have to do is scan qr code.   I just love it.  Anutham was just awesome. He knows the product inside and out and was very thorough in his explanations and demonstrations.  He has excellent customer service skills. An asset to your company."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Andrea",
          "Nb_Reviews": 4,
          "Date": "2023-10-19T04:48:35.000Z",
          "Titre": "Easy quick and very clear and practical",
          "Contenu": "Very professional approach and explanation. It was lacking of Info on how a payment with PayPal would work. In fact, due to the choice made by SetMore use of PayPal is notFor free and therefore SetMoreIs not for free as stated. Andrea"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Zilber",
          "Nb_Reviews": 5,
          "Date": "2023-08-28T21:23:33.000Z",
          "Titre": "Top notch booking system",
          "Contenu": "If you are looking for an easy to use and implement booking system on your site, look no further, I have been using Setmore for the past year, and booking has never been simpler. Both my clients and I have full control from the phone, with no hassle at all. The support team is resourceful and helpful, highly recommend it."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Joel",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T22:13:00.000Z",
          "Titre": "Anutham was so nice",
          "Contenu": "Anutham was so nice, explained everything in detail, and we had a great chat together about my needs. Will differently use it and recommend it to every one looking for a very flexible solution for booking. Big plus is it has an API and a Zapier integration which allows you to make an appointment via there. So stunning for programmers to use it in applications or websites."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward Tom",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T00:37:37.000Z",
          "Titre": "Exceptional service with the highest level of patience and professionalism!",
          "Contenu": "My service agent-Lakshya was extremely patient and knowledgeable and answered every question to my complete satisfaction.  He took the time to walk me through each process.  A job well done!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T22:13:43.000Z",
          "Titre": "Anutham Chakravarthy is great!",
          "Contenu": "Anutham Chakravarthy was absolutely fantastic. I was able to get literally every single one of my questions answered with speed and accuracy. Sometimes these \"demos\" take FOREVER and with a CSR who is not knowledgable. Anutham was a perfect example of what a great demo can look like. We got straight down to brass tax and my company's needs. I couldn't be more happy with our time and demo."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T19:23:56.000Z",
          "Titre": "Scheduling Saved!!!",
          "Contenu": "Anutham walked me and the owner through the process of using the Setmore system. Anutham was extremely thorough and we had very few questions! We had our scheduling back up and running before the day was over after unexpectedly losing our scheduling through a different company that morning!!"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "F. Mahfouz",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T20:47:26.000Z",
          "Titre": "A job well done.",
          "Contenu": "I am very pleased with the high level of service and support provided. In addition, the scheduling solution is user-friendly and effectively meets all our needs. Congratulations on a job well done, and please continue to maintain this standard. I want to extend a special thank you to Hema for her exceptional support."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Tanya Bester",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T19:34:47.000Z",
          "Titre": "Thanks for an easy onboarding Anutham.",
          "Contenu": "I had a wonderful, personalised account-setup and onboarding experience with Anutham Chakravarthy. He explained how to use Setmore with practical, friendly and easy-to-understand language and answered questions that I didn't even know I would have and made me feel welcome to reach out with future questions. As a new entrepreneur, it's so comforting to know I have someone ready to assist where I feel lost. I am so excited to use this booking software for my appointments in future. Thank you Anutham."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Umita Kalyan",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T18:58:44.000Z",
          "Titre": "Joshua was patient and knowledgeable",
          "Contenu": "Joshua was patient and knowledgeable, simplifying the complexities of the booking app effortlessly. His guidance was invaluable, turning a daunting learning curve into a seamless and enjoyable experience.  Thank you"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Rennie Clinical Services",
          "Nb_Reviews": 2,
          "Date": "2023-10-05T14:09:32.000Z",
          "Titre": "Don't bother with Jane.app or Owl. Get Setmore",
          "Contenu": "I've worked in the mental health field for 20 years and never encountered an app like Setmore. I've used many and by far Setmore is the BEST for client management. As I am client centred, so are they. Their support team seem to be ready at any moment to answer a question. Don't bother with Jane.app or Owl. Setmore is what you need."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "karl houston",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T01:07:27.000Z",
          "Titre": "Highly recommend",
          "Contenu": "Wow I I'm so happy somebody recommended this to me. I can see this being a game changer for my company. The customer service and attention to detail is definitely something I really admire, this team really does it well. I really encourage you to take them up on the free one-on-one so they can make sure you are using the software to its full potential. Thanks so much."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Natalia Bob",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T10:32:46.000Z",
          "Titre": "Cheddar is a great client expert and…",
          "Contenu": "Cheddar is a great client expert and presented the platform in a very friendly and professional way. I loved his approach and genuine desire to help. Appreciate the free call I had to learn more about Setmore. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristina Tollefson",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T18:42:46.000Z",
          "Titre": "Siddharth was so helpful",
          "Contenu": "Siddharth was so helpful in the help chat.  Provided me a video to explain the answer to my question and followed up with screen shots regarding another question. Hands down the best tech support experience I've ever had.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenna McCabe",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T14:26:42.000Z",
          "Titre": "I couldn't be happier with Setmore",
          "Contenu": "I couldn't be happier with Setmore's free demonstration. My guide, Anutham was extremely knowledgable and took the time to answer all of my questions about how the booking system worked. He was able to answer all of my questions (which were many) and his pleasant personality made the entire experience quite a lot of fun to boot!"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Almawi Limited",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T20:35:26.000Z",
          "Titre": "Joshua was an excellent facilitator",
          "Contenu": "Joshua was an excellent facilitator, he was very patient with us and explained everything in such fine detail. Consequently, we feel confident in our ability to use this program. We are also very sure this is what we need for our business. Thanks again!"
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Kei",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T13:29:35.000Z",
          "Titre": "Prompt service and support",
          "Contenu": "We needed a booking system for services provided by individuals at different places. Despite my poor English skills, I appreciated Joshua's prompt and efficient response, given that his business was just starting up."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Karolyn Boyd",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T02:58:03.000Z",
          "Titre": "Superb platform!",
          "Contenu": "Swati was awesome at showing me all the features!!!"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T18:21:39.000Z",
          "Titre": "Very friendly and professional",
          "Contenu": "Very friendly and professional. 5 stars!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mark",
          "Nb_Reviews": 6,
          "Date": "2023-10-25T13:43:25.000Z",
          "Titre": "Great help on my first call with Tom",
          "Contenu": "Great help on my first call with Tom, he was able to assist in highlighting the right way for the system to work with my business."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T21:14:48.000Z",
          "Titre": "my experience has been great so far",
          "Contenu": "my experience has been great so far. All my questions was answered and Salman was great in clarifying all that the app can offer me"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "April Rose",
          "Nb_Reviews": 4,
          "Date": "2023-09-19T08:51:43.000Z",
          "Titre": "Highly recommended",
          "Contenu": "I have been with Setmore for a while. Not only is their system really easy to set up and use, bit their customer service team is excellent every time. Amazing value for money and highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Robert Welland",
          "Nb_Reviews": 6,
          "Date": "2023-07-17T14:31:40.000Z",
          "Titre": "Joshua was an excellent facilitator",
          "Contenu": "Joshua was an excellent facilitator, he was very patient with us and explained everything in detail. We feel confident in our ability to use this program. We are also very sure this is what we need for our business. Thanks again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AL",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T18:39:22.000Z",
          "Titre": "Professional and Helpful",
          "Contenu": "Mr. Jude was very helpful and professional during our meeting. He explained the steps I needed to take to complete my profile with the Setmore app in a clear and concise way. I look forward to working with Setmore to build my business. Thumbs up to Mr. Jude and Setmore!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ana Parra Okhuysen",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T23:29:14.000Z",
          "Titre": "Anutham Chakravarthy was very helpful",
          "Contenu": "Anutham Chakravarthy was very helpful! Easy to understand all the features he explained. Also fun and pleasant to talk to."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debra Liggon",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T21:49:56.000Z",
          "Titre": "to understand the process and she knew exactly what she was doing excellent work",
          "Contenu": "This young lady knew exactly what she was doing she also had great knowledge as well as patience she deserves a raise, but i failed in one way for to get her name"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Katy",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T19:16:13.000Z",
          "Titre": "Chendur was very helpful in describing…",
          "Contenu": "Chendur was very helpful in describing all the features of Setmore. He answered my specific questions with regard to integrations and scheduling. He also made sure I understood how to use Setmore features that I might require in the future such as mandatory payments."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T18:00:52.000Z",
          "Titre": "Anutham Chakravarthy was very patient…",
          "Contenu": "Anutham Chakravarthy was very patient and honest about what the app could do and could not. I appreciate the honesty to be able to make a choice that will work for me.  I really enjoyed learning more about the software."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "THH",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T19:48:53.000Z",
          "Titre": "Great experience learning more about…",
          "Contenu": "Great experience learning more about Setmore. I was really impressed with what I saw in the demo. Anutham was a great onboarding specialist, and so incredibly knowledgeable!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Alec form Signal Appliances",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T00:34:32.000Z",
          "Titre": "Anutham Chakravarthy did an excellent job.",
          "Contenu": "Anutham Chakravarthy did an excellent presentation. Every question was answered and deep knowledge of the subject was shown. Really appreciate your great work."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Gozin.hypnotherapy",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T21:43:56.000Z",
          "Titre": "Chendur was friendly & welcoming",
          "Contenu": "Chendur was friendly & welcoming. Answered any questions easily"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Louise Allen",
          "Nb_Reviews": 2,
          "Date": "2023-08-03T18:22:37.000Z",
          "Titre": "Excellent and cost effective service…",
          "Contenu": "Excellent and cost effective service with very proactive customer service. Strongly suggest you take up the initial set up 1-2-1 chat with the customer service team as this sorted out small niggles very quickly and had me up and running in no time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heart & Soul Photography",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T19:27:41.000Z",
          "Titre": "Excellent Customer Service for your specific business needs",
          "Contenu": "It was very easy to schedule a one on one meeting with a representative.  Swati was my assigned customer support and she was able to answer all my questions!  I was most impressed with the fact that she first asked my reasoning for choosing Setmore.  That allowed her to be able to walk me through the process for using and customizing the program to my specific needs - not generalizations that I had to decipher later.  It took 26 minutes, but by the end of the video call, my business page was up and ready to accept bookings, process payments, and integrate with social media.  As I am just starting my business and being mindful of the fact this was my first experience with online booking programs, it would have taken me at least an hour to do on my own.  Swati made the process so much easier and also demonstrated how easy it will be to customize my Setmore account as my business grows.I had been researching several similar online booking options, but Setmore (and Swati's) customer service far surpasses the other options!  Using Setmore quickly became the only choice for me."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "simran singh",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T20:10:00.000Z",
          "Titre": "It was a great experience",
          "Contenu": "It was a great experience, learning how to use different features of Setmore through the meeting. Chandur was really helpful, explained all my questions in detail. Thankyou"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lash Ology",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T15:38:24.000Z",
          "Titre": "joshua jude was so very helpful",
          "Contenu": "joshua jude was so very helpful. He answered all my questions and worries, he was very polite and ensured all my concerns were met. I was very satisfied with the video call , he also taught me new things via the app which is great!"
        },
        {
          "Note": 5,
          "Lieu": "IS",
          "Pseudo": "Costa Verde Nuddstofan",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T03:09:06.000Z",
          "Titre": "This App has an amazing great…",
          "Contenu": "This App has an amazing great assistence service. Really good and helpful team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julia",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T21:02:33.000Z",
          "Titre": "Salman was extremely thorough",
          "Contenu": "Salman was extremely thorough, articulate and helpful.  He let me ask any questions I needed.  He was also super lovely and had an intelligent sense of humor."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Kel",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T04:05:49.000Z",
          "Titre": "Thanks Salman",
          "Contenu": "Great introduction to the program. All my questions were answered and the online tour was seamless. I look forward to giving Setmore a go!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SSK",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T00:37:24.000Z",
          "Titre": "Great Calendar...quick interfacing. YEAH!",
          "Contenu": "Setmore was/is attentive as I needed to set-up an appointment  calendar on the fly.Thank you!ps the meeting I had with my first time experience Swati was excellent (as where the people in the chat and phone)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beautiful Images by April",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T19:31:20.000Z",
          "Titre": "Hema was very helpful and patient",
          "Contenu": "Hema was very helpful and patient!  By screen sharing she helped me to properly set up my photography appointments for my event.  She taught me how to correct my hours and was very pleasant to work with."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T17:31:02.000Z",
          "Titre": "Anutham made it very easy to set up my…",
          "Contenu": "Anutham made it very easy to set up my setmore bookings. He went in detail and was able to answer all the questions I had. All while keeping a great energy during the meeting.Great experience overall"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benita",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T19:40:50.000Z",
          "Titre": "Anutham is very knowledgeable and patient.",
          "Contenu": "Anutham is very knowledgeable about the features and benefits of setmore. He was very patient, and he answered all of my question, which I didn't have many be Anutham was very detailed in his presentation of Setmore!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Michael Barkho",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T13:57:52.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "My customer service experience with Setmore was excellent and clearly demonstrated how to use all the tools. The calendar is very user friendly, and I would recommend it to any business. I found Tom to be very patient and helpful with recommending appropriate settings for my business. :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jodi Morris",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T23:11:44.000Z",
          "Titre": "The person helping with the Demo was…",
          "Contenu": "The person helping with the Demo was great, courteous, answered all my questions and was able to show me how to use the product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Avery Gallagher",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T18:35:30.000Z",
          "Titre": "I had a great experience with Hemalatha…",
          "Contenu": "I had a great experience with Hemalatha demoing the product. Setmore is a great partner that helps us schedule services, accept payments, and stay organized with ourselves as well as customers. My one con with the program would be that there isn't the ability to break out one business with multiple locations into different categories by location, unless you're just naming the service by location. It would be amazing if we could easily just have several locations available."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Forever Health Studios",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T23:41:34.000Z",
          "Titre": "Chendur did an amazing job explaining…",
          "Contenu": "Chendur did an amazing job explaining how Setmore works. The system looks brilliant and am excited to use this for my business. Thank you Grant"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Estephanie",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T03:21:33.000Z",
          "Titre": "Anutham was a delight!",
          "Contenu": "Anutham was a delight to conversate with. He kept me engaged and also explained Setmore in an effective way that was easy to understand. Thank you Anutham for the great presentation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Get Faded",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T04:27:34.000Z",
          "Titre": "It was great she help me and guided me…",
          "Contenu": "It was great she help me and guided me to the app and gave me Lots of info"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "ryan",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T18:04:19.000Z",
          "Titre": "Great experience with Anutham Chakravarthy",
          "Contenu": "Great experience Anutham Chakravarthy, walked us through the entire product and was able to answer all our questions thoroughly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shelley",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T19:09:37.000Z",
          "Titre": "Great onboarding experience",
          "Contenu": "Great onboarding experience. Easy to use, set up, and customize to your specific needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ali",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T00:24:32.000Z",
          "Titre": "Competent onboarding",
          "Contenu": "Anutham did a great job walking me through everything and was very clear and thorough. I had several questions at the end and he answered all of them. Thank you so much for your help! I'm looking forward to using Setmore in my business."
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "Kira Jantzen",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T10:19:03.000Z",
          "Titre": "The best online customer service I've ever experienced",
          "Contenu": "I've loved setting up my booking page - it's so simple! At one point I ran into an issue and sent an email. Michelle reached out so quickly - in 1 minute! And my issue was resolved in 21 minutes. Setmore truly provides standout customer service. Thank you again!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Maria",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T19:30:24.000Z",
          "Titre": "Chendur was friendly and efficient",
          "Contenu": "Chendur was friendly and efficient. He described setmore in simple terms,  which I needed as I’m very new to using this kind of system"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T08:07:13.000Z",
          "Titre": "Salman was very helpful and patient..",
          "Contenu": "Salman was very helpful and patient... I like this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathie Explore Exhale Travel",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T18:16:50.000Z",
          "Titre": "Great overview of Setmore",
          "Contenu": "Great overview of SetmoreSo many amazing features.So excited to begin using set more for my business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "maria",
          "Nb_Reviews": 3,
          "Date": "2023-07-13T23:18:39.000Z",
          "Titre": "Anutham is the Best",
          "Contenu": "Anutham was very helpful teaching me all about the app, he went through all of the features that I need to know to start booking all of my appointments. 100 % recommended."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "customer Mandy Bloomer",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T00:38:19.000Z",
          "Titre": "Friendly 😁",
          "Contenu": "Friendly , knowledgeable and understanding of my lack of experience and knowledge in this area. Felt listened too and I ll definitely be contacting you again with the hope of setting up setmore and using it for my business"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T00:22:32.000Z",
          "Titre": "Fabulous information",
          "Contenu": "Fabulous information.  He was able to answer my questions and then highlighted the answers when we got to that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wil Le",
          "Nb_Reviews": 5,
          "Date": "2023-07-26T01:05:11.000Z",
          "Titre": "Anutham was very good with his…",
          "Contenu": "Anutham was very good with his explanation. The plan look very good. Templates for the different industries is what I was hoping to use for setting up the accounts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T05:05:54.000Z",
          "Titre": "Easy Platform, Amazing Business!",
          "Contenu": "They were able to explain the platform in a way that made it simple to understand and provided the excitement for me to get started"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Anubhav Dwivedi",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T19:53:24.000Z",
          "Titre": "First Interaction with Setmore Team",
          "Contenu": "Anutham was really good in explaining the details on how Setmore works .He was able to explain me different services which setmore offers thus enhancing my user experience with it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Michael",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T18:39:14.000Z",
          "Titre": "Joshua from Setmore is one of a kind!",
          "Contenu": "After my experience and one-on-one personal video conference with Joshua one of Setmore's team members I am absolutely convinced that Setmore is the right solution for my business. Not only does the software integrate well with other important vendors and providers but Joshua was instrumental in helping me demystify the process. Great support and great software to go with it!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Karra",
          "Nb_Reviews": 2,
          "Date": "2023-09-04T19:02:05.000Z",
          "Titre": "Swati was fantastic!",
          "Contenu": "Swati was fantastic! She helped me get set up and was always kind and helpful even when I asked loads of questions. Gives me a great impression of Setmore! Thank you Swati:)"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Manuela Soltazzi",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T11:19:55.000Z",
          "Titre": "I’m new to the app but It already seems…",
          "Contenu": "I’m new to the app but It already seems like a big improvement compared to the last one I had. Customer service was very helpful and easy to talk to. Thank you Salman!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jobely bautista",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T01:49:03.000Z",
          "Titre": "Anutham video meeting…",
          "Contenu": "Anutham showed me exactly what I needed to see and was looking for. Very clear instructions and explications.Super great agent!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Camille Foskett",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T13:32:58.000Z",
          "Titre": "Thank you Joshua !",
          "Contenu": "I've just had a meeting video with Joshua and it was great ! He took time to nicely explain me every feature on the app and answered all of my questions ! Couldn't be more satisfied !!!!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Sara Nicoli",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T15:58:19.000Z",
          "Titre": "I had a few doubts about the features…",
          "Contenu": "I had a few doubts about the features and Joshua was really helpful answering my questions and see if the software was the right solution for my business.thank you!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Philip Oechsli",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T14:13:00.000Z",
          "Titre": "Joshua was very helpful with the…",
          "Contenu": "Joshua was very helpful with the onboarding process. I had quite a few questions with my new account but it was all clarified! Many thanks!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Debb Es",
          "Nb_Reviews": 2,
          "Date": "2023-07-16T18:38:13.000Z",
          "Titre": "Anutham is very patient and his way to…",
          "Contenu": "Anutham is very patient and his way to explain makes things easy to understand. 100% recommended.. he’s doing so great .."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ann G",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T19:56:12.000Z",
          "Titre": "Excellent!",
          "Contenu": "Excellent!Swati went through all the features and setup process, which was very helpful. I look forward to setting up our account. :)"
        }
      ]
    }
  ]
}