{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "shopmoment.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T09:08:30.000Z",
          "Titre": "Ordered one of the retro game sticks…",
          "Contenu": "Ordered one of the retro game sticks from them, it didn’t work I emailed them they asked for video evidence before they’d give me any info on returns or sending another out and then they didn’t reply."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Edison Abdiel",
          "Nb_Reviews": 5,
          "Date": "2023-11-28T10:35:43.000Z",
          "Titre": "The lenses aren’t worth the money",
          "Contenu": "The lenses aren’t worth the money. Then, returning them if you’re out of the US is pain. Especially when the customer service is useless"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Borman",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T11:52:19.000Z",
          "Titre": "Be aware: Moment may not deliver.",
          "Contenu": "It is May 2nd 2023. I am still waiting for my order since Dec 7th 2022. I ordered anamorphic lens. They are saying the same as they were saying in February/March: keep waiting shipments are coming, nothing concrete. This is the worst company I ever dealt with. I can only suggest to find better retailed for the stuff you need. They are promising to ship in May, will see I will update this review by the end of May.May 17th update - no news, no shipping from Moment."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Enrico Castagnetti",
          "Nb_Reviews": 2,
          "Date": "2022-12-22T19:32:39.000Z",
          "Titre": "Placed an order on the 19th with the…",
          "Contenu": "Placed an order on the 19th with the promise of shipping it same day and it did not happen. Contacted Customer Service and they said it was scheduled to ship on the 20th. It's the 22nd and no shipping yet. Tried several times to contact customer service over chat and email with no avail. They do not respond to my emails. Order was charged on my credit card the same day. I may need to dispute the charge. I do not recommend doing business with this company."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Disappointed Customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T15:58:26.000Z",
          "Titre": "Delivery Promise a Joke",
          "Contenu": "I order my lenses based on the FEDEX priority delivery in 2 to 4 days.  Its been a week and nothing has even been processed.  This means that my lens will not be available for my trip to Peru in 4 days.  There was no indication at check out that my order would be put on hold.  No notification from Moment.  Very disappointing."
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "Michal Figas",
          "Nb_Reviews": 1,
          "Date": "2022-05-19T18:24:10.000Z",
          "Titre": "Money taken, no shipping",
          "Contenu": "My order no. ab70450 was placed on Sat, it's Thu and it hasn't even been shipped. I've been charged on my credit card, the Support stated there's little they can do and I just need to wait. It's ridiculous, never had an experience with ecommerce like that, no wonder they don't offer PayPal."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wade Duncan",
          "Nb_Reviews": 2,
          "Date": "2022-04-04T12:42:56.000Z",
          "Titre": "Ridiculously Flawed Shipping Policy",
          "Contenu": "I’ve researched lenses for my iPhone, and have read glowing reviews about Moment lenses and auxiliary equipment. So I placed a large order. However, three minor items were on “back order” and “preorder”. Moment immediately charged my credit card the full amount for all the items in my order, but held the entire order until every item became available, which may be months in the future. They’ve  kept my money for over 5 weeks and shipped nothing to me. With no communication from them, they eventually responded to this flawed policy only when I made inquiries. I’m paying interest on the credit card charge for which I have no merchandise, and they are earning interest on my money they are holding for an undetermined amount of time. This is a ludicrous policy. Wade Duncan"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Nathan Fouqueray",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T10:55:09.000Z",
          "Titre": "Website to avoid",
          "Contenu": "No information on my command, no sending of my command and a partial refund of what I paid. I will never again buy something on this website...I bought a lens for my smartphone on this website. I didn't receive any confirmation mail of my command. I thought it was just a little bug of their system. One week later, I decided to sent a mail to have some information for my command. Someone just told me that the command can't be send cause they don't do what I command anymore. Then I ask for a refund but I onely received a part of the amount I paid. Despite I exposed the problem they never wanted to send a complete refund."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Lynda",
          "Nb_Reviews": 3,
          "Date": "2022-08-24T11:58:39.000Z",
          "Titre": "Really disappointing experience",
          "Contenu": "Really disappointing experience - wrong item was shipped and Moment have advised against trying to fix right now due to known fulfilment issues. I am not the first it appears. Apparently they can’t guarantee the correct item will be shipped second time around. Interesting ethical decision to leave the product on their website to keep selling to other unsuspecting customers"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark McMillan",
          "Nb_Reviews": 1,
          "Date": "2022-08-19T02:06:31.000Z",
          "Titre": "Recently made a purchase on their…",
          "Contenu": "Recently made a purchase on their website and was not aware that one of the items in my cart was on back order. I then attempted to contact Moment. No phone number and only email which they state a 12 hour minimum response time. This is not acceptable customer service.  BTW Still waiting for a response from them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "kh",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T22:57:52.000Z",
          "Titre": "HORRIBLE!!!",
          "Contenu": "HORRIBLE!!!! Do not purchase anything from this site. Save your time and money and go to somewhere more reliable. They're impossible to contact and have no idea of any timelines on their products and just tell you a random timeline so that you purchase their products. It's BS!!! Oh also if you return any of their products you have to pay for shipping and they will find a way to charge you a 15% restocking fee if you've ever opened the box. They basically stole money from me. Horrible all around and will never purchase anything from them for as long as I live."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Emire",
          "Nb_Reviews": 4,
          "Date": "2022-12-14T11:45:55.000Z",
          "Titre": "So overall evaluation - not worth it - 0",
          "Contenu": "Don't bother! I spent almost $800 on gear and I got the wrong phone case. I was told that it's indicated on the site if it's compatible, no it's not. Everything came late and some items are still missing. I was told it's my responsibility to follow up on it and I need to send:A picture of the itemized list included in the package.A picture of the shipping packaging (we're looking for damage).A picture of the items that came in the package.So I finally got all the three lenses in my hands, wide, telephoto and macro. The only one that is interesting or worth anything is the macro but you have to use tripod. So overall evaluation - not worth it - 0"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "danish chouhan",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T03:40:15.000Z",
          "Titre": "i order last two weeks ago from…",
          "Contenu": "i order last two weeks ago from australia. order number us af05670. i ordered 3 itmen including fast shipping in 4-5 days.  its almost two week gone and keep messaging to moment. no reply nothing else.  my order is still on hold  while i was purchasing on website. it’s showing on the stock. after i paid 370$. they said sorry its out of stock we are waiting for the stock.  i keep emailing them.  there is no phone number provided no live chat option.  they reply tou one’s week. look like the private company with no sartified the customers. they doesn’t care at alll."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tyler",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T23:44:54.000Z",
          "Titre": "Don’t give this company your money.",
          "Contenu": "I backed one of their products on Kickstarter. The item was fully paid for, I was just waiting for the product to be ready to ship. Several months later I got an email saying it was ready to ship and that I needed to provide shipping details. At this time the company informed me that the amount charged through Kickstarter did not cover all necessary costs (Taxes) and that in order to receive the product I would need to send them more money. When I pushed back and pointed out that the additional amount did not even reflect the correct sales tax rate (it was about 1.5x higher) they stopped responding. I followed up asking for the rate to either be adjusted to match the correct tax rate or provide a refund for the money I had already paid. Again, no response from the company. At this point they have $1,000 of my money that they are refusing to either return to me or ship the agreed upon product unless I pay them additional funds that were never agreed upon. Very shady company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer Ugarte",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T02:27:22.000Z",
          "Titre": "False advertising on their site. The worst customer support experience.",
          "Contenu": "False advertising on their site. I bought a lens and case for my phone. The site states the adapter for the lens is included with the case. The adapter did not come in with the case. It took 4 days of emailing them and one bogus initial response to find out they no longer send the adapter with case, even though their site still says it does. This $5 piece now has to be ordered separately, for $10 in shipping. I just spent almost $200 with them and now this. Oh, and also, the part is backordered. It may sound petty, bit I was too annoyed by their lack of care for their customers altogether. There is no phone number and the people that reply seem to not even care to understand what the issue is. Terrible customer service, just the worse. I sent my purchases back, for which they charged me $10."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Challenger",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T18:02:47.000Z",
          "Titre": "🚫Don’t ever think of buying from those…",
          "Contenu": "🚫Don’t ever think of buying from those scammers people, they are just couple friends running this business with no care at all! The only thing they need is your money!💸I paid $54.17 for phone mount and received it after looong wait, I immediately filed a return before I even saw the item outside the box but they only want to return $33 So they want $21 from me!!! For what ?? And they don’t give you an option to replace!!! 🤣🤣No one answer the chat, no email back, Please if you looking for  hassle free then go to Amazon, they return the wrong item with no Q for free! With one click you get free shipping label! My order #fcb022e"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "APenNameAndThatA",
          "Nb_Reviews": 11,
          "Date": "2023-06-24T05:15:11.000Z",
          "Titre": "Hideous email \"support.\"",
          "Contenu": "I bought a starter pack for the iPhone 12 Pro Max. The \"wide angle\" lens does no fit on the wide angle lens of the iPhone 12 Pro Max, so the \"wide angle\" lens does not help take wide-angle photos. I have asked them about this, and all I get back is one-key text-expander generic answers that don't answer why they sold me the lens as start of a iPhone 12 Pro Max starter pack. I loath this kind of \"customer support\" - no answers, just one-click ---- ----.Reply to the reply: really? The advantage of the wide angle lens is that it is brighter? Really? How many stops? Didn't manage to tell me that before I bought the lens though, did you? Just what I always needed, an unkown amount of more light. Enjoy your review, guys. And, even now, even with the one-star review, the \"support\" can't tell me *how much* extra light I will get.Just checked. It has a narrower field of view but speeds it up by one stop!"
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "Piotrek Dudak",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T12:11:33.000Z",
          "Titre": "SCAM WARNING",
          "Contenu": "If you consider buying anything from the company MOMENT, please read first.Couple months ago I found that I’m shooting a full length feature film this summer. I started prepping, testing various camera-lens combinations. I saw some tests online of the Moment Anamorphic Adapted I felt like it really suits me. Unfortunately nobody in Poland has one (as far as I know at least). So I decided to buy it. I placed the order for two pieces (the film will be shot on two cameras) on their official online store. It was March 21st. The information provided on their site said that for my location, the estimated shipping time is between 5 -7 days. I had packages sent from US before that took less than a week to arrive to Poland, so I was not surprised. After a week I started asking their customer service where the package is and why is there a delay. They kept finding different excuses every time. After about a month, I decided to cancel the order for one of the lenses, as I already knew I couldn’t make it on time to do the proper testing before shooting. I made very clear not to send the refund through Google Pay, as it automatically exchanges USD to PLN, and the fees are huge. Instead I requested the refund to be made on my PayPal, or dollar account in my bank. They refused, and sent it through Google Pay anyway. In the meantime USD decreased a lot in value to PLN, so I lost twice. Yesterday after 63 days of waiting, a lot of money, and sanity lost in the proces I finally received the parcel. This is not about the quality of their product, but the absolut disregard, and disrespectful approach to the client. My goal is to warn everyone from ever buying anything directly from them, as you may likely find yourself in a similar situation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bridget",
          "Nb_Reviews": 1,
          "Date": "2022-04-21T13:42:42.000Z",
          "Titre": "I placed an order early January for a…",
          "Contenu": "I placed an order early January for a camera and film, the camera was on back order until the end of January and the film was available. Once the camera came back in stock the film had sold out. I don’t understand why they do not hold the product for the order in the meantime and instead seem to continue to sell product they don’t have. I kept checking back periodically to see when the film would come back in stock until one day I checked and it wasn’t even on the website anymore… I was never notified that they stopped selling it. I had to contact them myself to get the film switched out to something that would be in stock sooner and I was charged $15 for this. It’s been almost 3 months now and even the both products are sold out again and I have received no update on when I can expect my shipment. Both products are still available for purchase… I don’t understand how this company is getting away with selling inventory they don’t have and probably won’t have for months. Terrible inventory managementUpdate: Per your team’s response I asked for my order to be split and they said this was not possible. So that’s a lie. They then asked me to reorder the items separately and pay double for shipping. TOTAL SCAM OF A BUSINESS. DO NOT ORDER FROM THEM"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Guy Leclerc",
          "Nb_Reviews": 1,
          "Date": "2022-05-14T21:59:13.000Z",
          "Titre": "scam",
          "Contenu": "i bought a PS5 and as soon as they took the money from my Visa..... all you have is robot ignoring you ,,,no way i would advise anyone to buy from those scammers"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mirtha VF",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T16:08:59.000Z",
          "Titre": "I request a financial loan with 788 and…",
          "Contenu": "I request a financial loan with 788 and they didn't approve. Never any company did before. No call , no explanation"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Summer Stafford",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T04:03:26.000Z",
          "Titre": "Unacceptable lack of communication",
          "Contenu": "I have never had such a frustrating experience with a company. My grandmother ordered a tripod from their site in November 2022 with the intention to give it as a Christmas gift. The item ended up being back ordered, so it was not delivered on Christmas, which is understandable. What is unacceptable is the complete lack of communication and customer service in the 5 months since ordering. Both my grandmother and I reached out for a total of 4 times to inquire about the status of the item and/or a refund with no response. Finally, on my 5th attempt to contact the company, I was informed that because the item was not in stock, we should receive a refund in maximum 10 business days. Now, over a month later, we still have yet to receive the refund leading me to reach out again. This entire process has been so frustrating, and I feel guilty for ever suggesting this company to my grandmother as I know it has caused her a lot of stress. After the 4th attempted contact with the moment team, I left a review on the product hoping to help others avoid the same situation. The review was never posted on their website. When I came here to review them, I thought I must have the wrong company due to all the positive reviews. Now I am wondering if these folks are friends, family, or paid reviewers.I generally try to be a kind and patient consumer and give grace to companies, but I am beyond fed up with my experience with Moment. Once they finally issue a refund, I suppose all is forgiven, but I will avoid having to shop here ever again, and will recommend the same to everyone I know."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rebecca G",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T02:27:20.000Z",
          "Titre": "Was supposed to arrive by Father’s Day-…",
          "Contenu": "Was supposed to arrive by Father’s Day- still has not arrived!"
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Rogério Leão",
          "Nb_Reviews": 1,
          "Date": "2022-01-27T17:53:51.000Z",
          "Titre": "I'm very disappointed with Moment",
          "Contenu": "I'm very disappointed with Moment. I've brought some issues in Dec. 1st, last year, with an estimated ship dato for Dec. 26th. They've delayed many times and I just get to know because I've contacted them. My point is IF YOU GUYS DON'T KNOW HOW TO SELL SOMETHING YOU DON'T HAVE IN STOCK, CLOSE THE SHOP."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephen Benjamin",
          "Nb_Reviews": 2,
          "Date": "2021-12-02T12:17:36.000Z",
          "Titre": "Missing shipment",
          "Contenu": "Looks like I’m not alone as there’s another review with the same complaint. I have two orders from moment that show the label was printed but there’s no sign of the actual package making it into the FedEx shipping system from their fulfillment provider. Customer service was less than helpful or understanding. I’ll be returning my items if they actually ever show up and never shopping from them again. I was looking forward to their products for my month long trip."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kathy Ward",
          "Nb_Reviews": 1,
          "Date": "2022-01-28T03:30:08.000Z",
          "Titre": "I have been waiting since October for…",
          "Contenu": "I have been waiting since October for my iPhone 13 Pro case so that I can use the Moment lenses I already purchased a while ago. I still do not have the case or the insert.  This is getting ridiculous. This company sells things they just don't have in stock often. My orders have been delayed before in which I have cancelled.  I really need this product so I can use my darn lenses!! They keep moving it up every month.  How is it that a 5 star review WEBCLIENT got their iPhone 13 Pro case to use with the lenses???  LIE LIE LIE"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hanna J",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T09:19:05.000Z",
          "Titre": "Poor customer service.",
          "Contenu": "Poor customer service.Contact with this company is difficult. They prefer email. Their FB account doesn't list any contact info. I had a problem with my legit purchase. They cancelled my order after it was approved by my bank. They are returning my credit but I feel I waisted my time. They don't care. They think since they returned my money I should be happy and they don't feel they did anything wrong. We don't do any business with you...case closed. Think twice before placing your order with this business."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Duyker",
          "Nb_Reviews": 1,
          "Date": "2022-05-31T01:38:52.000Z",
          "Titre": "terrible returns experience",
          "Contenu": "terrible returns experience and a confusing eCommerce user interface that leads to accidental mis-orders that are very expensive to rectify."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Che Huang",
          "Nb_Reviews": 2,
          "Date": "2021-06-08T17:46:08.000Z",
          "Titre": "False advertising on website and asked to pay return shipping",
          "Contenu": "Purchased a Benro tripod which was advertised in the pictures to be a full-sized tripod, I received a mini tripod and was told that was actually the correct one and the pictures on the website were a mistake. I was offered a refund but was told that I would have to pay return shipping despite the false advertisement on the website."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2021-10-14T04:49:36.000Z",
          "Titre": "I placed an order and they charged my…",
          "Contenu": "I placed an order and they charged my account $104 dollars but after a month there has been ZERO confirmation emails or updates regarding my order. They ignored all of my emails and it has been impossible to contact this company. Do not order from this company that commits fraud"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Glen bernarnd",
          "Nb_Reviews": 3,
          "Date": "2022-01-30T18:53:41.000Z",
          "Titre": "Company Quality is not good",
          "Contenu": "Company Quality is not good. When I received my very late package everything was crumpled and loose, the telephoto lens wasn’t in its box, it came out during transit. Not happy. This is the second time. It looks like they went to Fed Ex, threw it in the bag, and said “good luck”. Most companies would 1. Creat better packaging for their product and 2. Care enough about their product to ensure it reaches their customers home intact. Now “I” have to take my banged up Moment gear and  return it because Moment didn’t care enough to properly package the product. Adorama would have never sent me there product in a fed ex BAG."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "WhiteDev",
          "Nb_Reviews": 4,
          "Date": "2019-03-18T13:25:49.000Z",
          "Titre": "Stay away",
          "Contenu": "Stay away! I have bought 2 different lens + 2 different caseCase has broke after 10 months so I can't connect my lens to my phone anymore. But the wrost thing is that I sent 5 emails to the company for the warranty (they brag that there is a 1 year warranty) and they keep IGNORING my emails. I also wrote them on twitter, NO ANSWERI literally threw 300$ to the garbage! Wrost customer service ever!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jansen Souza",
          "Nb_Reviews": 2,
          "Date": "2021-04-24T01:38:50.000Z",
          "Titre": "Return and exchange policy",
          "Contenu": "Shipping was excellent but, I ordered the wrong product by accident and tried to instantly change it up and they told me I was unable to. Which is really not cool. After returning it now I have to currently wait 2-3 weeks for my refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J Jordan",
          "Nb_Reviews": 1,
          "Date": "2019-11-20T23:57:07.000Z",
          "Titre": "CANCELLED ORDER USING COUPON CODE NO NOTIFICATION",
          "Contenu": "Cancelled my order using coupon code. NEVER notified of cancellation and the reason the cancelled. Invoice said paid and would ship out!!! Cannot connect with a live person, have to communicate through email. Don't sell items then back out! Poor business ethics.This was no mistake read the reviews from others.  Email was checked for supposed notification and to inform of cancellation, none received!  A discount of 15% is not uncommon happens daily,  Clearly not a price error was only 15% off full retail!!!!! 👎 Live Chat was non existent  just like phone number to contact them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nikki",
          "Nb_Reviews": 1,
          "Date": "2019-11-17T09:06:19.000Z",
          "Titre": "Will never shop moment again.",
          "Contenu": "Products take to long to be delivered and when I finally got an email saying my products were being. Shipped, my package arrived with an item missing. When I emailed moment support to tell them that I was missing a phone case from my ordered, they said the phone cases were delayed and wouldn't ship until sometime in Nov. No one every contacted me to let me know about the delay and my invoice even said both items would be shipped.  This leads me to believe moment lied about delays in the iPhone cases to cover up them making an error in my ordered.  Once upon a time moment was a good company, but now they are just crap."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Travis H",
          "Nb_Reviews": 2,
          "Date": "2022-01-31T20:09:01.000Z",
          "Titre": "Complete scam of a company",
          "Contenu": "Complete scam of a company.  Placed an order 11/29/21 for a bundle with 1 item back ordered and would be available in December.  Well they didn’t hold the available items in the bundle and then kept selling everything until other items were then out of stock, so when the first item became available, another was out of stock and it’s now continuing and endless cycle.  Keep in mind I have been fully charged for the entire order 2 months prior with no ship date in sight, since they will not hold items to fulfill the bundles they have sold.  Have spoken with customer service several times and have not received any help of getting my order fulfilled, possibly to split the order of what they currently have left in stock and then have separate orders for the other items.  Meanwhile I’d still be 2 months passed the first delivery date."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barton P",
          "Nb_Reviews": 3,
          "Date": "2021-07-20T14:12:48.000Z",
          "Titre": "Disappointing Company",
          "Contenu": "Ordered 3 iPhone lenses which took two months to ship... ok. Finally received them and got to try them out while visiting Yellowstone National Park. After a few days the Lens mount on the case broke so I ordered two replacements from the website. After 2 weeks I received a notification that FedEx had lost the shipment due to an unreadable barcode and I contacted Moment to try to get a replacement package on the way. I was told by Moment customer support that I would have to wait up to 20 business days for FedEx to finish an investigation into what happened to my package. I’m in Yellowstone NOW and can’t use my expensive lenses because Moment is too cheap to send out a $5 replacement part. In 20 business days my opportunity will be long gone. Bad support from a premium priced brand. Won’t buy from again."
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Raymond Manglo",
          "Nb_Reviews": 2,
          "Date": "2021-01-21T16:02:50.000Z",
          "Titre": "Bad service",
          "Contenu": "Bad service! They told me that they are going to ship my order by late January but when the time came they moved it to March. I would not recommend this to my friends and workmates."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jung Lee",
          "Nb_Reviews": 1,
          "Date": "2019-11-15T19:04:56.000Z",
          "Titre": "They cancel my order and will not honor…",
          "Contenu": "They cancel my order and will not honor the order after taken my money. Used coupon but saying this was internal coupon and called me an abusive coupon user. Worst CSR ever."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Asha Mathews",
          "Nb_Reviews": 1,
          "Date": "2021-02-09T12:46:49.000Z",
          "Titre": "No tracking or delivery support",
          "Contenu": "This company has a great site and looks like it’s a top notch source to get electronics, particularly cameras. However, they don’t provide tracking numbers for any of their shipments. I ordered gifts before Christmas 2020 and none of the items have arrived as of today, February 6th. I’ve reached out their customer service who do not provide helpful information or seem to think it’s their job to give people the items that they paid for. The main reason my items are taking long to be deliberated, according to Moment customer service reps, is because one item was back-ordered which is delaying the entire order. They didn’t even tell me when the one back-ordered item would be back in stock or give me options to deliver the other items. I should also point that there wasn’t an option to deliver these separately when I purchased them so I wasn’t aware that there be an issue."
        },
        {
          "Note": 1,
          "Lieu": "AT",
          "Pseudo": "Mani",
          "Nb_Reviews": 1,
          "Date": "2020-05-08T09:29:12.000Z",
          "Titre": "MOMENT make mistakes that their customers pay for :(",
          "Contenu": "i ordered in august 2018 for over 260$. at first i got the wrong tracking number, i couldn't find the shipment anywhere. then i finally got the right one. but the package never arrived, although the shipping company indicated that the package had arrived long ago. after countless e-mails and phone calls where i tried to find out where my order is and why it didn't arrive, i finally got the message that the order is already on its way back. the reason for this was that MOMENT simply forgot parts of my address.the support wrote me that i should just reorder and that they would not refund the shipping costs, until today they did not even apologize for this - as mentioned, the mistake was MOMENT's fault.so MOMENT made mistakes that i had to pay for. apparently they have a different view of good customer service than i do. i was really looking forward to the lenses, the products seem to be very good. but the service was simply below all expectations. due to my negative experiences i absolutely cannot recommend it. unless you want to pay shipping costs and get nothing for it.too bad."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Steve",
          "Nb_Reviews": 3,
          "Date": "2018-09-05T15:27:59.000Z",
          "Titre": "Awful customer service",
          "Contenu": "The customer service for this company is probably the worst I have ever dealt with!They sent me the counter weight for gimbals but there was no product in the box. After over a week of them ignoring my emails. They asked me to send them pictures which I did. Eventually they agreed to send me the product but several weeks later and they had still not sent it. Again my emails went unread until someone came back, and not bothering to view the email history, started to ask me again what happened. Eventually someone emailed saying that they had put me to the top of the list (bearing in mind I should have had the product weeks earlier) and that I should get an email that day saying it had been dispatched. I got an email but days later it still had not said that it shipped. So I emailed again and they apologised and said that they were out of stock.I'm now over a week after that email and still no indication as to when I will receive my order.Save yourself the trouble and go with another company that will actually give you a straight answer and send you what you order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GOW",
          "Nb_Reviews": 1,
          "Date": "2019-11-14T21:13:36.000Z",
          "Titre": "Placed an order",
          "Contenu": "Placed an order, they took all my personal information, then they canceled an order, saying sorry."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "hayden.k",
          "Nb_Reviews": 2,
          "Date": "2022-01-08T19:19:31.000Z",
          "Titre": "Very unhappy..",
          "Contenu": "Very unhappy... I ordered 25 rolls of Kodak film from Moment in early December for a project I'm doing in February. (5 X 5 packs of portra 400 @ $62.99 a pack) I know that they have been back ordered for quite some time so I left a 6 week buffer which would ensure the film coming before I had to use it. At the end of December I saw that my film had still not shipped so I used the 'Chat' feature on the Moment website and spoke to a specialist. The specialist proceeded to tell me that all Kodak orders had recently been cancelled due to problems with the supplier and that I would be refunded my money. I had to reach out to them to get this information and I had not yet been notified that my film order had been cancelled. The specialist let me know that I was able to re-order the film at the new price ($72.99) and I wouldn't lose my spot in line for shipment. I decided to opt out since the price on these packs has increased by $20 USD over the past year and within 3 weeks my order had increased by $50. The final straw was that since I'm Canadian and was having the film shipped to Canada - when I was refunded by Moment I was refunded at the lower conversion rate from when I ordered the film in early December and lost another $35. So here I am, left with no film for my project and at a loss of $35. Safe to say I will definitely not be ordering from Moment again. I used to love this website but I'd way rather pay a little bit more for my film and support small local camera shops."
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "Lin Daorong",
          "Nb_Reviews": 1,
          "Date": "2019-05-18T15:55:55.000Z",
          "Titre": "Poor shipping partner chosen",
          "Contenu": "Poor shipping partner chosen, I have yet to receive my items after 5 weeks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason Murdock",
          "Nb_Reviews": 1,
          "Date": "2020-04-24T21:20:19.000Z",
          "Titre": "Moment took my money, didn't give me the stuff I ordered",
          "Contenu": "I may never know how good (or bad) the lenses are. I can't even get them to send the gear I ordered. They did take my money though.My order was flagged for fraud, and Moment can't tell me why, claiming Stripe—their credit card processing company—doesn't tell them why. Stripe claims otherwise, and I know because I contacted Stripe directly when Moment stopped communicating with me. My bank says nothing is wrong, the order has processed, the money is in Moment's hands, and yet they are trying to force me to send my private banking information to some random person they call a \"Gear Guide\" via email in order to prove my identity.They have no phone number to call—even though you have to give them yours when you order something—and the random \"Gear Guide\" doesn't have to verify their identity. Who am I sending my bank account info to?So, my gear is in limbo, they have my money, they want me to do things my bank has advised against, there's no way to call them and talk to a real person, and they've already started spamming me with marketing emails to buy more stuff.This company is shady, and I wouldn't recommend doing business with them.UPDATE: Moment canceled my order, accused me of fraudulent intent without any evidence, and accused me of being argumentative and combative for refusing to email sensitive bank account information to them. They also claim they refunded my money (meaning they knew all along that I made the purchase with no fraudulent intent). The $727 they took has yet to find it's way back to my bank account."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Rasmus H",
          "Nb_Reviews": 12,
          "Date": "2020-12-11T15:35:47.000Z",
          "Titre": "Scam",
          "Contenu": "Scam, selling old lenses. Dont buy if you live outside the US"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dirk",
          "Nb_Reviews": 2,
          "Date": "2021-12-02T04:12:41.000Z",
          "Titre": "The Case of the Missing Shipment",
          "Contenu": "I placed an order for several IPhone lenses and a few other items.  I received an email confirming shipment on Monday with two day shipping via Federal Express with expected arrival today (Wednesday).  When the order did not arrive as expected I checked the FedEx Tracking Number and FedEx says they have not received the package.  So I contacted Moment to inform them of the problem (via their chat).  I fully expected them to apologize for the inconvenience and promise to ship a replacement out right away (this is for a gift I need on Saturday and the fact I was going to receive it on Wednesday with a couple of days to spare is why I ordered what I did in the first place).  This is what I got instead. Even after repeatedly pointing out that FedEx says they never received the package and so the package is not in their system, I was told they would file an inquiry with FedEx and there was nothing that could be done until FedEx declared the package “lost”.  Well I seriously doubt FedEx is going to own up to “losing” the package if they say they never received it.So I am left with nothing.  I am confident my credit card company will take care of it since it is clear that I have not received anything.  But I am so disappointed in the level of customer service.  And the total lack of owning the problem, making it right first, and figuring it out with FedEx after satisfying the customer.First time I have ordered from Moment.  Most likely the last if this is any indication of how they deal with problems.  Deny it could be their fault.  Pass it on to someone else.  And then effectively tell the customer they will just have to be patient (while they already have the customer’s money of course) until they can figure it out.  First rule of customer service is take care of the customer first and the rest takes care of itself.  I knew I should have ordered from Amazon.  Thought I would take a chance.  I am not afraid of owning up that I made that mistake."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 3,
          "Date": "2019-09-28T07:19:49.000Z",
          "Titre": "Horrible customer service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 4,
          "Date": "2021-03-17T18:17:17.000Z",
          "Titre": "Shame on me from having to place another order with them directly.",
          "Contenu": "Twice I have ordered from them and twice I have been let down. No matter how the choice of shipping goes, I can’t get a break. At this point my order is lost in the FedEx system and no one can help me. The first order took 45 days for a Black Friday order to arrive by USPS. This time it was a two day FedEx that was set to arrive and it was due 3/1. It is 3/4 as I type this and FedEx seems to be sending the package on the scenic route through California with only two scans saying where it was in 7 days. At this point I doubt I will see the package as it looks like it is headed back to the sender. Maybe I will just get my money back from the credit card since the item was supposed to arrive on 3/1 and I still keep getting text updates on 3/4 now that it will arrive by 8pm on 3/1. Now I need to know what year that will be. I just needed to replace a broken lens clip and buy some more overpriced goods. I had better luck getting their stuff through online marketplaces. But they strategically don’t sell the parts necessary to make the lenses stay on through the easier method that delivers.I really just want what I ordered. I don’t want to take my money back. It solves nothing to not have my order. But no one is giving me any answers that make sense since between where I live and the hubs are the weather has been fine for the time I ordered. Even FedEx only reported a state in the south having any major issue. I have had stuff coming through customs arrive within less time from the time it shipped out the same day as pickup last week.I keep getting surveys about how they are doing and I cannot even give a review for anything done right. They contacted me about the issue and I gave a criticism that was not harsh, it was more of a question on why can’t they make it easier on people with smaller orders to get items deployed faster through other methods they use. I get kind of a snarky answer back. Maybe don’t ask for more info if you didn’t like the original review.**I had reached out two days before this post went up. If anyone was capable of helping, they had already had a chance before telling me the shipping partner had it and they were running behind. They were contacted as well and had no updates as to where this package was. Forgive me if contacting you back on this matter wouldn’t feel like wasting my time again.Update: the order finally arrived after taking a tour of 3 different locations, according to the scans from FedEx it toured Cali for 2 weeks instead of the two business days. Not sure this is worth it for the prices of the gear when there is comparable gear out there without the hassle."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Usman Mir",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T23:42:01.000Z",
          "Titre": "Still waiting for my lens to arrive",
          "Contenu": "Still waiting for my lens to arrive. Ordered on 20th September 2023 and now its 13th November ;("
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KY in NE",
          "Nb_Reviews": 10,
          "Date": "2023-02-19T20:37:13.000Z",
          "Titre": "Shipping Info on Site Wildly Inaccurate",
          "Contenu": "The bag I ordered was perfect for the trip I was taking. Unfortunately shipping was not 3-5 days as stated on their website. I placed my order on a Saturday and according to their website, it should have shipped out on Monday. Instead, it took them a full week to ship my in-stock order and another week for it to arrive since they sent it DHL to USPS. I was already back from my trip by then. Customer Service was completely useless."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DeWitt Eaton",
          "Nb_Reviews": 4,
          "Date": "2022-12-06T01:33:09.000Z",
          "Titre": "The company has a lot of cool stuff",
          "Contenu": "The company has a lot of cool stuff, but delivery is a definite issue that needs to be addressed!  I pre-ordered an item that was later listed “in stock” and shipped on Nov. 15.  It’s December 5 and I have no idea when it will arrive.  This is not the first time this has happened.  Shipping times need a definite overhaul."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Justin Friede",
          "Nb_Reviews": 2,
          "Date": "2021-03-25T20:42:37.000Z",
          "Titre": "Online Store",
          "Contenu": "As a creator, I value the content and innovation that Moment contributes. However, their online store is unreliable and is not a reputable operation. Many of their products are fulfilled by third-party companies and the shipping statements on their website are inaccurate. The customer service rep was just as shocked as I was when my new camera arrived wrapped in a plastic bag with no padding or protection. They have no phone number available and customer service was very impersonal and scripted. Super disappointed with my entire shopping experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 3,
          "Date": "2020-01-15T21:07:34.000Z",
          "Titre": "Didn’t get a real response kinda of…",
          "Contenu": "Didn’t get a real response kinda of meh...seems like I wasted my time in trying to make a product I I like better. Just wish the case I preordered and waited months for met my expectations quality is worse than the PhotoCase which I loved. Guess I will purchase from Nomad from now on. 😢"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Steven Howard",
          "Nb_Reviews": 1,
          "Date": "2019-05-13T18:41:03.000Z",
          "Titre": "Poor follow ups service",
          "Contenu": "Poor follow up serviceOrdered the wrong part. (Order No. d1b249e)Notified within 10 minutes that it was wrong and was told I was too late to change the order.Ordered new part (311-002 iphone photo case Black PU Canvas). Order #7b81a6c. Placed on 2019-02-22.Very unsatisfactory and still unresolved experience in determining whether the refund for the original wrong part has been paid, as no refund has shown up on my credit cards yet I have been told to wait.Very poor clunky service. The matter is still unresolved."
        },
        {
          "Note": 2,
          "Lieu": "DK",
          "Pseudo": "Mikkel Arffmann Andersen",
          "Nb_Reviews": 20,
          "Date": "2021-04-26T13:04:32.000Z",
          "Titre": "exeptionel customer service but unclear price.",
          "Contenu": "Today I completed an order for one product. A total price of $14During the order information, it said $7 in taxes, and $0.0 in shipping. BUT the total price was still only $14. It made me confused, and I thought the taxes and shipping was probably included in the $14Right after payment, I saw that I had been charged $38.11So shipping and taxes were added during payment.It was so unclear!I sent an email immediately, requesting to cancel my order, and they did so within 3 min.It is fast and efficient customer service.And now i have to wait 5-10 days for my refund, for a product that never even left there store."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "David Jimenez",
          "Nb_Reviews": 3,
          "Date": "2021-02-02T02:40:29.000Z",
          "Titre": "Delivery takes more than 2 months!!!",
          "Contenu": "I bought some Moment filters back at the beginning of December and it hasn't arrive yet... Before I ordered same filter different size and and took almost 3 months to arrive."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Dara",
          "Nb_Reviews": 1,
          "Date": "2021-04-12T18:10:43.000Z",
          "Titre": "Poor Customer Service",
          "Contenu": "2 stars for brilliant products, 3 deducted to match their return policy, which also deducts your paid amount with processing fees and non-refundable taxes. In any business a refund would mean that the delivered items in their entirety are being returned to the original owner in exchange for the paid amount, but not here. If you are an international buyer make sure you are 100% fine with your order, since after approx. an hour of submitting no modifications or cancellation will be allowed without additional costs. Before my items were shipped I contacted customer serice and almost begged them to cancel the order to avoid refunding complications, but they said they can't. The customer service was consistently before and after shipment not interested in meeting me half way, only referring to their page and asking if there's anything else they can help with.UPDATE:Thank you for the response. It will greatly help if you would provide me the information, so I can follow-up with the tax authorities. Specifically: 1) Which tax authority received the payment on my behalf 2) Any reference numbers helping to find the payment.Without these information I understandably can't get my payment back. Thank you in advance."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Liam Cottrell",
          "Nb_Reviews": 3,
          "Date": "2019-12-11T19:32:58.000Z",
          "Titre": "Poor customer service",
          "Contenu": "I don’t have any problem with their products, but their customer service is slow to respond  and poor."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T13:52:14.000Z",
          "Titre": "My $1000 order took months. Jury still out on some lenses.",
          "Contenu": "My order, over $1000, took months to arrive in a dozen or so drips and drabs. I worked with to 3 different people along the way, who were generally responsive. Not having a phone number to call and talk to a live person is a real problem. Everything has to be solved over e-mail, often with one or two day delays in each communication. Each time I got a different explanation. Finally I got the drop-in-mount so I can try the lenses I have had sitting around. Instructions are hard to find online despite the link given. I am still testing the lenses. In my first test under overcast skies in the forest I was getting consistent lens flares on both the fisheye and wide lenses. I am going to try again, but I was trying to shoot a natural bridge for which these lenses should be ideal, so more disappointment. My iPhone under the same conditions had no lens flares at all. The Macro has a very shallow depth of field and only focuses when the diffuser is basically touching the object. That is a bit disappointing. Maybe I should have read more closely. The Tele lens seems very good in my early uses. Filters seem high quality, but I have not yet tested the ND filters. First try on the CPL has me wondering. I can't see any difference at all when rotating, as I can on my DSLR. I will try again different circumstances. The lenses do not come with rear caps (really? who does that?), which cost $9.95 each. They come with a double-sided adhesive film which is near impossible to peel off without damaging. They send an extra film, presumably for this reason. Still, I failed to get 2 of 3 adhered properly. Moment sent replacements at no charge. The rear lens cap is the lowest quality item I purchased. It should come pre-assembled and free with the lens."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mr Philip Corlis",
          "Nb_Reviews": 10,
          "Date": "2023-07-18T23:24:27.000Z",
          "Titre": "Two issues concern me",
          "Contenu": "Two issues concern me. 1. Inventory shortages seem to plague the items I’m interested in, and 2. Your focus has shifted away from iPhone Filmmaking as you pivot to being a general supplier of other companies goods. Bags, lenses, filters and other accessories for (mostly) Sony camera gear now seem to be your daily concern. That leaves me far less interested in your company and skeptical of the quality of your iPhone related products."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles Daubert",
          "Nb_Reviews": 2,
          "Date": "2023-07-20T15:33:11.000Z",
          "Titre": "Took too long for product to arrive and…",
          "Contenu": "Took too long for product to arrive and need help on how to use the 58 mm on my iPhone 14"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Spot",
          "Nb_Reviews": 1,
          "Date": "2021-02-18T18:49:11.000Z",
          "Titre": "I can find what I am looking for but...",
          "Contenu": "I can find what I am looking for.  But I know what I am looking for.  I think a better job could be done presenting pieces to the newbie.  I have sent a couple of people with iphones to your site and they 'complain' that they don't understand what to get/what they need."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aaron Christopher LaHaie",
          "Nb_Reviews": 1,
          "Date": "2019-05-13T20:54:51.000Z",
          "Titre": "The cases need a major upgrade",
          "Contenu": "The cases need a major upgrade. If you lock the lens in even slightly the wrong way you’ll instantly shave off the case locking mechanism so your lenses will no longer lock in place. You guys gotta switch it to metal and they’ll be perfect. The lenses are perfect and definitely improve your mobile photography/videography but wow those cases could be improved. A small user error shouldn’t completely make the case unusable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roman",
          "Nb_Reviews": 2,
          "Date": "2020-01-10T21:53:21.000Z",
          "Titre": "Products are usually of very good…",
          "Contenu": "Products are usually of very good quality, lenses are great, the only complaint right now is the latest case for iPhone 11 Pro Max, quality doesn't feel as solid as other cases, lens insert feels weak and doesn't stay in place when attaching or removing a lens, feels like the case was released before thoroughly being tested"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Daniel de Paola",
          "Nb_Reviews": 2,
          "Date": "2019-12-16T17:24:41.000Z",
          "Titre": "The thin photocase is good",
          "Contenu": "The thin photocase is good. If the movable piece where we place the lenses were fixed, it would be great. It fits perfectly with the Osmo 3 because it's not bulky. But when we unscrew the lenses, in most of the times the piece moves together"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Photo Holic",
          "Nb_Reviews": 1,
          "Date": "2019-05-13T19:03:19.000Z",
          "Titre": "Some trouble in your delivery process",
          "Contenu": "Some trouble in your delivery process, I need to ask 2 times via email, before the process of delivery speeded up. The rest of my purchase was fine."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Isaac Rees",
          "Nb_Reviews": 1,
          "Date": "2020-12-23T05:52:06.000Z",
          "Titre": "Late back order.",
          "Contenu": "I ordered a filter in October, they said it was on backorder until December. now I look at the website and it says it won't get here until march next year!(Ps in my original review I accidentally typed March instead on October)Okay final edit, -So I ordered the filter in October-the they were back ordered -they were scheduled to be shipped on the 4th of December (which I was fine with because I wanted it for Christmas)- I saw mid December that they hadn’t shipped- I then messaged and reached out -they ended up shipping on the 18th-which means I won’t get it before ChristmasNow I get that it’s a busy time of year and it’s crazy with carona and everything.but now they are flagging my review and trying to tell me that there was some confusion? On top of that I keep getting email notifications to buy new products?I tried this company for the first time thinking that they are the “new guys on the bock” changing the industry,But I’m just disappointed,I think with time they will be able to compete with the big companies but for now they seem like they are growing to quick to keep up with demand ultimately resulting in a bad customer experience. I might buy in the future but for now I’m sticking with the bigger more established photo/filter companies.I’m changing my review to three stars because of the good experience iv had with their support."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Parthapratim Neog",
          "Nb_Reviews": 1,
          "Date": "2021-01-15T08:38:58.000Z",
          "Titre": "Moment forgot to send customer invoice, shipment stuck in customs.",
          "Contenu": "UPDATE (1 star to 3 star): Moment provided the required document, and my shipment is finally released. I'd still rate this exeprience as a 3 stars because all of these hassels and clearance delays could have been avoided if the required documents were sent with the parcel itself (as required) when they shipped it out.Looking forward to the gear. ---I placed an order(#52b4b9e) on 16th December 2020. My order was supposed to ship on 31st December 2020, then it ended up getting delayed and finally shipped on 7th Jan 2021. Holiday season, loads of orders, understandable!The problem comes when the shipment arrives into my country and gets stuck in customs. The reason being that the commercial invoice was missing. It is the duty of the seller to provide this documentation so that the custom clearance is seamless. I also tried to download the customer invoice from the website and upload, but that was also rejected by customs. I have mailed them (moment) and tweeted them about the problem, but there have been no response or resolution from their part till now. All I want is for them to submit the required documents that they forgot to submit when initiating the shipping. They should atleast have the courtesy to be careful about shipping the delayed orders so that these sort of further delays doesn't happen. I don't know how long this will take, or if I will even get my order.I will update the reivew if and when this is resolved."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2019-09-23T10:06:07.000Z",
          "Titre": "A mixed experience",
          "Contenu": "TLDR; the products are amazing, the shipment carrier is dreadful.-----So far, my experience hasn't been great. I ordered the Filmmaker bundle (Freefly Movie, Counterweights, Anamorphic Lens, and Phone Case) and received a parcel today after a week of waiting that contains ONLY the Movi. Contacted FedEx and they confirmed that that was the only parcel in the shipment.It's nearly the end of the week and I've contacted Moment, and it's been 16 hours and I've received no reply so far. Surely missing 75% of my order is a more pressing issue than this? I was hoping to use my equipment this weekend, but now I'll have to wait at least another week. I'm not impressed.--------UPDATE: the items finally arrived a week later, but not without more issues and inaccurate information (including lies about attempted deliveries) from FedEx. However, the lens and equipment that I received were of pristine quality, and I know I'm going to enjoy using what I've received. Budget filmmaking, here we go.That being said, it's difficult for me to give the company a 5-star rating, because their choice of shipment fulfillment in the UK is dreadful. The sad fact is that I've now chosen to fill out the remainder of my Moment lens collection (Tele and Wide) with used lenses from eBay, rather than have to go through the ordeal with Moment (and more accurately, FedEx) directly. Its a little less reliable, and the selection is much less, but at least I don't have to sit at home and wait for 4 hours for a call from FedEx escalations team, followed by another 3 hours waiting by the front door."
        },
        {
          "Note": 3,
          "Lieu": "AT",
          "Pseudo": "Gehirnverwender",
          "Nb_Reviews": 4,
          "Date": "2021-03-15T10:16:24.000Z",
          "Titre": "High quality products but customer…",
          "Contenu": "High quality products but customer service from hell!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Md Sabbir",
          "Nb_Reviews": 1,
          "Date": "2021-09-02T23:23:04.000Z",
          "Titre": "Vrey Good For Raiting",
          "Contenu": "Very Good For"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeffrey Harris",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T17:15:10.000Z",
          "Titre": "I gave them 4 stars because although I…",
          "Contenu": "I gave them 4 stars because although I did not receive my order probably due to the shipping company, I rated them on their fantastic customer service. Moment was quick to respond to my inquiries and provided an amicable solution to my issues. I will be a return customer because of that aspect. And I love Moment products."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Olivier Simard",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T13:44:07.000Z",
          "Titre": "I received excellent service before…",
          "Contenu": "I received excellent service before purchasing my lenses. I sent several emails to make the right choice and each time I always received an answer adapted to my needs."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Barbara Hagger",
          "Nb_Reviews": 3,
          "Date": "2023-10-13T05:02:17.000Z",
          "Titre": "Great service.",
          "Contenu": "Somehow the things got tangled but finally my forms were found and all was sorted with the usual friendly manner. Can’t wait for my new case and the T series lenses."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "leon",
          "Nb_Reviews": 5,
          "Date": "2023-07-18T23:27:51.000Z",
          "Titre": "I found the delays in delivering the…",
          "Contenu": "I found the delays in delivering the 1.55 anamorphic lens I preordered very frustrating. I was angered when the lens I received was defective. However, the technician who responded to my complaint very quickly identified the problem, gave me a solution to the problem until a replacement screw could arrive and very quickly sent the proper screw which solved the problem. I can only praise the technical support and rate it among the best I have ever received."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "braden",
          "Nb_Reviews": 1,
          "Date": "2022-06-09T12:14:25.000Z",
          "Titre": "maybe the case plastic could do some work, but the team and service is amazing.",
          "Contenu": "4 stars only because the plastic used on the pixel 6 cases seem a bit concerning according to many people online. while mine did break, however, i got amazing help from Shivang Joshi, who immediately prepared a new case for me! very straight forward, patient, and very nice!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "John Maddocks",
          "Nb_Reviews": 4,
          "Date": "2023-07-18T23:52:07.000Z",
          "Titre": "Good, but…",
          "Contenu": "In the past my experience has been exceptional, but my last transaction took a good bit longer than I expected. That being said, the moment lenses are high quality glass and a pleasure to use."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Kelly and Murray Milton",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T19:17:58.000Z",
          "Titre": "iPhone lenses",
          "Contenu": "I needed a set of iPhone lenses for my iPhone 12! Moments had everything I needed! And a deal as well!Everything came in perfect order! All my panicked emails were answered within 12 hours or less! We are leaving for Scotland in a few weeks and I have what I need to take the best pictures I can! And time to learn how to use them! The glass is super clear! I’m super excited and recommend Moments as it was recommended to me! Thanks everyone for a fantastic job!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George Fotinopoulos",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T04:47:44.000Z",
          "Titre": "Order fulfillment took too long.  Responsive customer service",
          "Contenu": "I placed an order around October 27.  Today is December 16 and the order has not been shipped.  I asked them to cancel and refund and they were very quick to assist me.It’s too bad, I was excited for the camera I ordered initially, but after so long I’ve lost interest."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shreeju",
          "Nb_Reviews": 1,
          "Date": "2022-04-18T07:16:22.000Z",
          "Titre": "First case had a crack, received a replacement promptly",
          "Contenu": "First case I received had a crack in a couple months without me dropping my phone, which was very disappointing. However the Moment team was very responsive and sent out a replacement promptly."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Lynda",
          "Nb_Reviews": 3,
          "Date": "2022-08-29T08:28:29.000Z",
          "Titre": "Really happy with new lens",
          "Contenu": "Had some problems with my original order but Moment worked hard to resolve and I received my replacement lens quickly. Really happy with my new lens"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T15:52:05.000Z",
          "Titre": "This is my first time shopping with…",
          "Contenu": "This is my first time shopping with Moment. The online shopping and checking out process is user friendly and clear. I did have some issues with my order as the item was back-stocked. I was aware of this at the time of purchase and processed anyways as the website stated that the item was expected to be available in 1-2 weeks. Unfortunately this was not the case as it was 4+ weeks without stock being replenished. Unfortunately this held up my entire order which was quite frustrating as I needed it prior to a trip I had planned.I made a few efforts to contact someone at the moment team and they were all responsive but none able to provide me with much clarity on the matter or resolution to my order as it would have costed me extra to ship the products separately.  Eventually I reached out again because I hadn’t gotten a response In 5 days from my last email to the company to follow up on my order. I was able to reach a gear guide named Szabolcs who was listened to my situation and worked with me to come up with a resolution. He personally followed up with me after our initial conversation to provide me with updates which was very much appreciated. If I’m being honest my initial experience due to the length of delay and frustration experienced with my first few interactions (because no resolution was provided) was not great, despite everyone being very responsive (aside from that one email). Ultimately, I am very appreciative of the gear guide who was able to support me all the way. I don’t have any comments about the gear or quality of stuff as I have yet to try it out. I am still giving a 4/5 because everyone was responsive and it’s not their fault the item was not available. I would have appreciated if the company was a little more transparent with the length of delay rather than having the website say 1-2 weeks since that clearly was not the case.  Had I not attempted numerous times to follow up, the end outcome would have resulted in me not having my gear before my trip!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "UC A RAIDERLIF",
          "Nb_Reviews": 1,
          "Date": "2022-06-07T10:24:50.000Z",
          "Titre": "Ggreat customer service",
          "Contenu": "Lost thumbscrew on landscape tripod mount so they send one out immediately."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "An Inquirer",
          "Nb_Reviews": 2,
          "Date": "2023-05-23T15:29:57.000Z",
          "Titre": "Photography with a difference.",
          "Contenu": "Our repeated purchases from this company have been a delightful experience thanks to the additional features it offers to our smartphone activities."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Jacinta RIP",
          "Nb_Reviews": 1,
          "Date": "2022-04-20T13:16:42.692Z",
          "Titre": "4 stars :)",
          "Contenu": "amazing response very quick and very helpful"
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Xavier",
          "Nb_Reviews": 1,
          "Date": "2021-09-28T08:29:52.000Z",
          "Titre": "Great product",
          "Contenu": "Moment lens and gear are great! It brings phone photography to another level. Only slight issues for people who are from overseas like me. do consolidate your order. I just bought the case itself as the shipping fees hike due to the pandemic is not worth it to buy online. I still do it anyway cause I cant find a trusted retailer who brings them in. =]"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "fabian wijnekus",
          "Nb_Reviews": 1,
          "Date": "2021-03-03T18:48:06.000Z",
          "Titre": "Walnut iPhone 12…",
          "Contenu": "I recently bought the walnut iPhone 12 Pro max case!! It is just a fantastic and gorgeous looking case! But then a few weeks later they came with the new MagSafe cases. I was a bit bummed about that. I contacted them and they immediately came with a response and a solution. Moments customer service is, like all of there products, extremely good!"
        },
        {
          "Note": 4,
          "Lieu": "UA",
          "Pseudo": "Tom Hollandsworth",
          "Nb_Reviews": 2,
          "Date": "2020-12-08T16:54:52.000Z",
          "Titre": "Commodity quality",
          "Contenu": "Hi, many thanks for the individual approach to the customer, I received my order, looking forward to it.  The product really corresponds to its product evaluation.  The digital camera and wireless headphones pleased me with their quality.  The goods are intact and the packaging for transportation corresponded to the level of professional understanding.  Thanks."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Geo",
          "Nb_Reviews": 1,
          "Date": "2021-02-27T13:32:46.000Z",
          "Titre": "My overall experience was very good",
          "Contenu": "My overall experience was good, ordering items took a bit longer than expected given the current situation with pandemic. With respect to the moment product I find them to perform outstanding, better than anything else I have tried. Built to a high quality standard. I’m very satisfied with the Moment product macro and 52mm lens."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Ricardo Barbosa",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T07:13:15.000Z",
          "Titre": "Perfect for Video - Photo needs improvement",
          "Contenu": "The lens is great. Built quality is 100 outta 10, but drop side is the app for photos. If you shoot RAW it cannot be Desqueezed, not even for (post production) and JPEGs are very low quality. My suggestion is the app to offer an option to desqueeze jpegs from camera roll. This way we can shoot raw, process on lightroom (for example) and then desqueeze the jpg on Moment App. Hope this is helpful.Best regardsRicardo Barbosa"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Leonardo Dicaprio",
          "Nb_Reviews": 3,
          "Date": "2020-09-12T04:58:03.000Z",
          "Titre": "I've been truly impressed by the…",
          "Contenu": "I've been truly impressed by the customer service from Moment. I don't think I've ever seen such responsiveness coupled with a real willingness to go the extra mile for their customers. I really appreciate it.I loved my Moment macro lens, case and remote. The wide angle lens was quite soft. On raising this, Moment took a look and offered to replace it. I couldn't be happier."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Isis Sparta",
          "Nb_Reviews": 1,
          "Date": "2020-10-22T17:44:03.000Z",
          "Titre": "I loved the gear (I bought an iphone7…",
          "Contenu": "I loved the gear (I bought an iphone7 plus used walnut case). However it did not include the metal adaptor for the moment lens to the phone so I wrote to them and they replied to me really quickly and solved the issue. The quality of the gear is good. I would love to buy more things from here. I also own a fisheye lens from moment which is my tool to go whenever i travel. And soon I plan to buy a wide to achieve no distortion in travel photos."
        },
        {
          "Note": 4,
          "Lieu": "BW",
          "Pseudo": "Onalekitso Jason Kenosi",
          "Nb_Reviews": 1,
          "Date": "2020-11-12T07:05:36.000Z",
          "Titre": "Moment is great",
          "Contenu": "Moment customer service is great! Great team, great support and loads of tutorials and purchase guides to help anyone know exactly what does what and how it works before purchasing to make sure you make the right choices for your needs... but there is always room for improvement 😂😂 that's why I gave you 4 stars."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "L_V_",
          "Nb_Reviews": 2,
          "Date": "2020-08-25T10:21:21.000Z",
          "Titre": "Great product, but needs improvement on quality",
          "Contenu": "Bought a Google pixel 3 phone case a few months ago. Really liked the design, the simplicity and material used for it. Unfortunately after a sort amount of time the inner part on the back material for more grip was on the side getting off, which doesn't look good. So i think there needs to be improvement for that.Besides that, great product"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Remco Zwinkels",
          "Nb_Reviews": 2,
          "Date": "2021-01-19T20:39:09.000Z",
          "Titre": "I orders my filter before the holidays…",
          "Contenu": "I orders my filter before the holidays and because of that it took a while to arrive. It is a nice filter with quite a strong effect for a 10 percent version in my opinion. I also tried a tiffin pro mist 1/8 but i found that a bit to subtle.The Quality is good and the service was kind. I would recommend it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Newman",
          "Nb_Reviews": 1,
          "Date": "2021-01-19T18:42:34.000Z",
          "Titre": "Still great, but built-in cameras are getting better",
          "Contenu": "I still recommend Moment, but it is definitely getting harder to do so as the standard iPhone lenses improve every year. The new slim case with the lens add-in feels cheaper than my previous case. The larger, walnut-backed case was top quality and I may switch back to that one. I'm not ready to abandon Moment, but it's not as attractive as it used to be. Right now, the specialty lenses seem to be in the sweet-spot. I use the macro lens, and a filmmaker might get real use out of the panoramic lens."
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "Murphy",
          "Nb_Reviews": 1,
          "Date": "2021-04-02T02:29:37.000Z",
          "Titre": "Moment are great!..but Fedex sucks!",
          "Contenu": "Moment is great!..great with the quality of the lense, items...but I really think they should use other shipping partners than Fedex...It so happens my experienced with the shipping were effing bad!...Fedex doesn’t respect client’s package!..if only I could share the picture of my experienced."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "gilles basset",
          "Nb_Reviews": 1,
          "Date": "2020-01-25T14:08:55.000Z",
          "Titre": "Really like your product,the lenses are…",
          "Contenu": "Really like your product,the lenses are top, but I have several problemswith your phone case, I had 4 cases, and the clip system for lenses isn't really strong, after few months it's breaking ! my last case (a fine photocase for Iphone 11 pro max) breaks after 5 days, the corner on the bottom break in my pocket.... Otherwise the lenses are magics !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maurice Walton",
          "Nb_Reviews": 1,
          "Date": "2019-08-05T19:39:15.000Z",
          "Titre": "My last trip to Euro",
          "Contenu": "My last trip to Euro, with no DSLR, just my Pixel 3a & Moment 58mm lens. I got some amazing shots. Normally a smartphone can't get much detail at a distance.A Moment lens attached makes your smartphone that much closer toa DSLR. However there are things a DSLR will never be. Small, quick to go, and convenient! I honestly can't wait to get some of the other lenses."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jamie Krob",
          "Nb_Reviews": 1,
          "Date": "2019-05-13T22:03:11.000Z",
          "Titre": "The wide angle lens works beautifully but...",
          "Contenu": "The wide angle lens works beautifully for my real estate videography (check out @jamiekrob on IG). I would highly recommend it. I rated 4 stars because the proprietary phone case is low quality and poorly designed. The back fabric started to peel off in a month and the headphone jack cut out is too small to fit my microphone input. The lens itself is a perfect 5-star, the phone case is a failing 2-stars."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Carlos",
          "Nb_Reviews": 4,
          "Date": "2019-05-13T23:05:52.000Z",
          "Titre": "Absolutely love my Moment lenses",
          "Contenu": "Absolutely love my Moment lenses. Together with the moment app, they have transformed my iPhone into a proper camera. If there was one gripe I would say that the lens case I bought was a bit of a letdown. It was small, a little on the cheap plastic side and most surprising, the foam lens cradle was so tight that I really had to force my two lenses into their seats. Which meant I was forcing the plastic zip to close."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Raj Surin",
          "Nb_Reviews": 1,
          "Date": "2020-07-24T17:14:21.000Z",
          "Titre": "I've been sourcing Moment for…",
          "Contenu": "I've been sourcing Moment for Anamorphic lenses for the Iphone ..(as well as the App )..My experience of the lenses is surely and positively good..and along with the Iphone leatherback case that comes with the lens mount..in both cases the delivery (international) was as good as a few days."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Holly",
          "Nb_Reviews": 1,
          "Date": "2020-09-23T22:17:15.000Z",
          "Titre": "Prompt service",
          "Contenu": "Case peeled a little bit so I asked for a refund or exchange through email. Responses were extremely quick and polite and they sent me a replacement within a matter of 2 days. Didn't even have to pay extra for international shipping due to change of address. Would definitely recommend"
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "Virot Eaimought",
          "Nb_Reviews": 1,
          "Date": "2020-11-24T07:04:01.000Z",
          "Titre": "website is quite simple and friendly…",
          "Contenu": "website is quite simple and friendly used, however there are some are which when you filter some parameter, it does not show result accurately. I love the way you put some combo suggestion, this will help new  moment user understand how to buy easily. it would be great if you can increase level of suggestion. And there are some items which I am not sure if I have to buy it or not (like item which required to be used together) for this type, can you make some cautions to warn client before they make purchase to make sure they purchase goods correctly"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Scott Hoffman",
          "Nb_Reviews": 1,
          "Date": "2019-05-13T19:42:54.000Z",
          "Titre": "The lenses are great and cases are nice…",
          "Contenu": "The lenses are great and cases are nice but they need to offer more protection. My s9 plus cracked the back glass in my pocket and when dropped the case will slip off and the phone will hit something. Took a chunk out of the wall in the dentist office. Would be fantastic to have something like an otterbox commuter style case."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "VISIONS",
          "Nb_Reviews": 10,
          "Date": "2021-06-19T23:46:36.000Z",
          "Titre": "Great people; teething problems of development.",
          "Contenu": "I've recently discovered Moment, and bought some Macro stuff for my iPhone 12Pro Max. Customer Service folk here were superb, products excellent, and the only thing which was difficult was that one part was missing from one order, and in another order, product development meant that two pieces didn't marry together very well. However, I got onto Moment Customer Services immediately, and can report that 'Moment' could describe how quickly they respond to my queries :-). Everything was resolved to my satisfaction, and replacement parts shipped internationally within days. truly impressive."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Heiko Luder",
          "Nb_Reviews": 11,
          "Date": "2020-10-17T00:09:56.000Z",
          "Titre": "Great lenses and gear but no U.K. online shop",
          "Contenu": "The items I ordered took about a week to ten days to arrive and carried a hefty surcharge because of there not being a European shop for Moment lenses or stocked on Amazon.co.U.K.I think there are other US brands that are sold in the U.K.that they should emulate or learn from."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Chanakya Kumar",
          "Nb_Reviews": 4,
          "Date": "2020-04-30T12:20:29.000Z",
          "Titre": "I ordered PRVKE 21 Liter Backpack at…",
          "Contenu": "I ordered PRVKE 21 Liter Backpack at Moment and I stayed quite satisfied. I found it useful for my recent photography trips and I am looking forward to using it more throughout the year. Only con is that I wish it had another side pocket so that I can carry both my water bottle and umbrella"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Mia de Jesus",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T04:40:35.000Z",
          "Titre": "Excellent as always",
          "Contenu": "I've been a Moment customer for years. Product quality is always on point, as well as customer service and shipping/handling. Mobile lenses are easy to use and maintain. I have a couple, and also sent friends their photo kits as gifts. One suggestion to the Moment team is to have an option to include a gift note at checkout, especially now that it's not so safe to visit people to hand them gifts personally. I asked about gift notes and gift wrapping via email and was answered promptly (within a day, thanks guys!). No gift note, but my friend got his photo kit gift very fast; good thing I let him know it was from me!"
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Kristoffer",
          "Nb_Reviews": 31,
          "Date": "2020-06-22T22:47:14.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service, products are high quality and the detail is perfect from packaging to the actual product.Missing star is only from a VAT exempt business owner's point of view in DK/EU, as I have to pay VAT with the current webshop's payment model."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "gcomet",
          "Nb_Reviews": 1,
          "Date": "2019-12-20T03:10:25.000Z",
          "Titre": "Exceptionally high quality cases and lenses",
          "Contenu": "Moment's cases and lenses are of exceptionally high quality, even though they might be on the pricey side (the lenses in particular). Only negatives are the lack of options for Google Pixels as compared to iPhones, and PayPal not being an accepted payment method."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan Bailey",
          "Nb_Reviews": 1,
          "Date": "2021-09-09T17:12:14.000Z",
          "Titre": "Unobtrusive and holds the 12 Pro flawlessly",
          "Contenu": "I cannot stand most phone mounts out there. Ugly AF. Moment has a simple, unobtrusive offering that does exactly what you need it to do. Hold your phone. If you're looking for more articulation, this is probably not for you. If you want something that mounts to a car vent easily, isn't f*ugly and keeps the phone where it is even on horrible roads - this is your mount. They make one with charging built in, but I run power off my Pioneer along with the audio feed so that wasn't needed.Dinging 1 star because of the several days late arriving for no valid reason via FedEx which meant I didn't have my mount when I needed it. Having other carriers besides FedEx should be an option due to how awful they've been lately."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Maria Madeline De Hitta",
          "Nb_Reviews": 3,
          "Date": "2020-10-27T03:09:07.000Z",
          "Titre": "Simple But Great",
          "Contenu": "The quality of their phone cases are great! Its simple yet elegant. The colors are nice too. Also it's good that they have Gear Guide on their website that can actually help you decide what to buy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessie",
          "Nb_Reviews": 1,
          "Date": "2020-01-30T20:26:20.000Z",
          "Titre": "Great customer service",
          "Contenu": "I would definitely purchase items from this company again! The returns I made were hassle free and really easy to make on their website. I currently use the 18 wide lens for my cell camera and love it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wilmesherr Music",
          "Nb_Reviews": 1,
          "Date": "2021-03-03T14:43:35.000Z",
          "Titre": "The product description was appealing…",
          "Contenu": "The product description was appealing (the iMo Padded Camera Neck Strap), but I discovered several things about the neck strap that weren't mentioned in the website. When putting it on my camera, I had to take the strap holders apart a little (Panasonic Lumix GX85), and I put the strap on the same way you would put a key on a keychain. It wasn't a big deal, but I wasn't expecting that. Then again, I'm not a seasoned photographer. If I had one note about navigation, it would be helpful to organize products according to price. I understand the desire and need to upsell, and the fact that I had to search the price points manually meant I spent more time on the page itself. I wouldn't mind being able to easily find an economical product solution more quickly."
        },
        {
          "Note": 4,
          "Lieu": "PE",
          "Pseudo": "Any R. Araujo",
          "Nb_Reviews": 1,
          "Date": "2019-05-13T19:07:55.000Z",
          "Titre": "Hey, thank you i hope i can help u!",
          "Contenu": "Hey! I just love moment app and the justice price that i pay vs the service that you offer with the lens! Its amazing :) But something that i noticed and would like to get better are these:1. When I record a half of time the app spends a half of my full battery and don’t give more time with my iphone 8. 2. Probably it happens 30% of time but I don’t know why the app freezes and close up? 3. I would like to chose from a variety of cases :)? And probably more resistance in the part that lens inserts?4. I would like to thank you for attending me quickly the last month when i have a break in my case and you give a chance of warranty :)!I think this is all, thank you for a good client service include my long distance in Perú ;) and the amazing lens that change my life very day!"
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Kris Holm Andersen",
          "Nb_Reviews": 9,
          "Date": "2019-08-29T09:26:30.000Z",
          "Titre": "High quality! Nice finish, but cover is fragile.",
          "Contenu": "It’s very nice products Moment offers!The quality is as high as you would expect from at high end camera company.The lenses feel nice, and look nice. They have a good weight to them.Sometimes I can se the lens surroundings in the picture when I use the Wide lens, but its only sometimes, so maybe its me that’s doing something wrong..There are two problems with the cover.It´s too thick, so my phone heats up very quickly, because it can´t get rid of the heat when making moves.And the attachment to the lens is fragile. If you bump the lens or handle it a little rough, then it can crack. I have done that twice, witch makes it a pretty stupid end expensive product to have.It would have been nice if it was mere rigid.But overall I´m very happy with the products from Moment!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2020-01-22T00:35:42.000Z",
          "Titre": "Excellent Product and Company with One Small Issue",
          "Contenu": "The company Moment and the products are really amazing.  What you can accomplish with their products is really awesome.  It has helped me create films that I thought I couldn't before.  There is one small issue and it's nothing against the company.  When new smart phones come out like new iPhones, the pre-order process is always lengthy.  I truly understand they are working hard to make the best products, but for the past couple of years it has been a case of \"over promise and under deliver\" in terms of pre-order shipping time.  Both in 2018 and 2019 my orders of new cases or lenses have been delayed by at least 2 months.  Again I totally understand that they are trying to make the best product. My only word of caution is that if you're pre-ordering a new product, don't expect the first shipping estimate to be accurate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tyler sinnott",
          "Nb_Reviews": 3,
          "Date": "2019-12-04T02:52:36.000Z",
          "Titre": "My V2 review of Moment",
          "Contenu": "Re-uploading my review since I got their product in, and I'm super happy with the quality. My previous review mentioned how their customer service was below my expectations. The customer service was actually really professional and polite, however I was disappointed by their response that was essentially \"not our problem, read our fine print\". I expected more as a first time customer going out on a limb buying their used gear thinking I was getting a good deal.That being said, the used 15mm fisheye lens I purchased is great, they got it to me super quick which is perfect for my trip to Chicago this week. I feel this is a way more fair review. I'm excited to give this lens a proper test drive out in chicago this week.Strong chance I'll be back to buy more. Their solid products out weighs my interaction with their customer service. I dig it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ross",
          "Nb_Reviews": 1,
          "Date": "2020-01-18T01:06:22.000Z",
          "Titre": "If you’re into mobile photography, Moment is for you.",
          "Contenu": "I have really enjoyed every product I’ve purchased from Moment. The lenses are incredible and the build quality is great. The cases are decent and well built."
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "Ahmad Ridzuan Yeop Aznan",
          "Nb_Reviews": 1,
          "Date": "2020-05-09T04:30:15.000Z",
          "Titre": "Iphoe 11 and moment lens",
          "Contenu": "With this combo will become beast of mobile film making and photography. Angle that couldnt get with smart phone will became ease with moment lensp"
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "ihsan",
          "Nb_Reviews": 1,
          "Date": "2020-07-24T22:51:33.000Z",
          "Titre": "Moment Lenses is the best",
          "Contenu": "Moment Lenses is the best, but the price is very expensive if there is no discount. I hope that moment lenses can provide even greater discounts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 1,
          "Date": "2021-08-01T22:13:38.000Z",
          "Titre": "Mostly positive",
          "Contenu": "Other than a delay in the shipping of my item, which seemed to be a FedEx problem, the staff was very responsive to any issues I had."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Emily Liu May",
          "Nb_Reviews": 1,
          "Date": "2020-01-11T21:56:58.000Z",
          "Titre": "couple of suggestions",
          "Contenu": "Moment lens are kinda heavy. I would love them to be a bit more light. Also the coat on the lens easy to get scratches, more sturdy will be better."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2020-11-30T17:23:35.000Z",
          "Titre": "The bottom right of the case",
          "Contenu": "The bottom right of the case, the seam had bits sticking out. I tried to file it down a bit so it's smoother when I brush up against it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2020-01-02T22:59:56.000Z",
          "Titre": "Great products and great service",
          "Contenu": "I have been very happy with both the lens I purchased and the battery pack case. When I have needed help the customer service has been excellent"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Josh C",
          "Nb_Reviews": 1,
          "Date": "2020-01-09T17:27:24.000Z",
          "Titre": "More clarity on shipping details and estimations",
          "Contenu": "The estimated shipping date on the back-ordered item on December 6th wasn't accurate. I got a notification that my package was getting ready to be shipped by December 6th but it didn't get shipped out until that following Tuesday. Package arrived 8 hours after I left before my international trip so I wasn't able to take the product with me on my trip. While abroad, since I wasn't home, I didn't realize I needed to sign for the package. Not a fault on Moment but I was a little annoyed that I couldn't change the delivery option to just leave it at my apartment without signiture. Package was delievered to a waiting area but since I was not back within 5 business days to pick it up. I had to rush and go across town to luckily pick it up and grab at the shipping center near the airport it before it was sent back to California. Love the Moment products but a little annoyed at the hoops I had to go through to get details about my delivery. Would still order from Moment again. Love the company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Owner",
          "Nb_Reviews": 1,
          "Date": "2020-01-22T14:50:26.000Z",
          "Titre": "I've owner several quality Moment…",
          "Contenu": "I've owner several quality Moment products and when quality failed, customer service stepped in. Reputable brand."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Luis",
          "Nb_Reviews": 1,
          "Date": "2021-01-19T11:53:57.000Z",
          "Titre": "I bought a CineBloom-Filter",
          "Contenu": "I bought a CineBloom-Filter an it is awesome!The shipping took a bit long but thats ok :) I am very patient."
        },
        {
          "Note": 4,
          "Lieu": "UA",
          "Pseudo": "Andrew Micoda",
          "Nb_Reviews": 1,
          "Date": "2020-05-28T06:26:41.000Z",
          "Titre": "Everything was ok except the…",
          "Contenu": "Everything was ok except the international delivery. It took a month for me to receive my order"
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Alex Ngiam",
          "Nb_Reviews": 1,
          "Date": "2020-03-11T14:12:29.000Z",
          "Titre": "Premium build",
          "Contenu": "Premium build, awesome product. While it is costly, I find it's totally worth the price!"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "chema",
          "Nb_Reviews": 8,
          "Date": "2019-05-15T18:06:41.000Z",
          "Titre": "Amazing products",
          "Contenu": "Amazing products! but it would be interesting to be able to save taxes for worldwide buyers."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Raju Nadig",
          "Nb_Reviews": 2,
          "Date": "2020-12-06T19:16:38.000Z",
          "Titre": "You have really cool accessories",
          "Contenu": "You have really cool accessories. I have already picked up some more cool items."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Chelsya Hazarde",
          "Nb_Reviews": 8,
          "Date": "2021-03-05T04:09:23.000Z",
          "Titre": "Their online shop is so easy to…",
          "Contenu": "Their online shop is so easy to navigate that it makes shopping a breeze!"
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "Kitti A. Maxwell",
          "Nb_Reviews": 1,
          "Date": "2021-01-28T22:26:54.000Z",
          "Titre": "great quality and after service but…",
          "Contenu": "great quality and after service but need to be better in delivery period"
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "LOK SANG HO",
          "Nb_Reviews": 1,
          "Date": "2019-11-16T03:38:53.000Z",
          "Titre": "LOVE THE CASE",
          "Contenu": "LOVE THE CASE. Everything is perfect except the fact that it is a bit pricey"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Isaac Gacura",
          "Nb_Reviews": 1,
          "Date": "2019-12-29T20:40:52.000Z",
          "Titre": "Shipping speed is great",
          "Contenu": "Shipping speed is great, well packaged and minimal but effective packaging."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KattlynAm",
          "Nb_Reviews": 6,
          "Date": "2020-11-03T13:42:36.000Z",
          "Titre": "I ran into great photography staff here…",
          "Contenu": "I ran into great photography staff here sold ad very convenient prices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "caden browning",
          "Nb_Reviews": 1,
          "Date": "2021-02-16T03:37:33.000Z",
          "Titre": "They are very helpful and they respond…",
          "Contenu": "They are very helpful and they respond to my emails pretty darn fast."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jack Dodger",
          "Nb_Reviews": 1,
          "Date": "2021-01-04T21:12:08.000Z",
          "Titre": "A review of my Moment mobile experience so far",
          "Contenu": "I've gotten several lenses for my iPhone (macro and telephoto), a case, rear lens caps and a the 2 lens case as well as the ProCamera app.Here is a run down.I LOVE the lenses and the phone case.  The rugged leather case protects from drops, looks great and makes it easy to use the lenses.  The lenses themselves are top notch.  I'd like to see Moment come out with a telephoto lens that has more magnification.ProCamera app; I'm enjoying learning to use it and find it relatively intuitive.  I've never used any kind of manual camera before.I do wish the volume buttons worked as a shutter button.  They will, but they also change the volume at the same time and there is a delay before the picture happens which is hard to manage when hand shooting (v tripod).  There is also the same sort of delay with a remote I purchased.  Since neither of the delays happens in the native camera app I imagine it has to do with programing and what permissions Apple gives out.I also had some bugs but those seem to have resolved with iOS 14.3.Rear Lens caps;  Directions tell me to center the sticky end on the front lens cap.  This doesn't work for the telephoto lens.  There isn't enough slack in the strap.  I'd also like a tab with better purchase so that I can flip the rear lens cap off with one hand.2 lens case;  I find this useful but only use the velcro to secure it to my belt.  The snap closure suggested for use on a belt does not hold at all.All in all I am very happy with the Moment and the lens/case system they have works great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph DiNoto",
          "Nb_Reviews": 2,
          "Date": "2020-03-23T23:38:55.000Z",
          "Titre": "4 stars because the Android app is no…",
          "Contenu": "4 stars because the Android app is no longer supported.Apart from that, it's 5/5 all the way in terms of the hardware and results. The lenses are solid metal and glass, they are sturdy, and produce great images! The case is also very well constructed and I use it even when I'm not out taking photos. The lenses all twist on easily and firmly, with no fear of them falling off or coming lose  even if you turn the phone upside down or sideways. It is SUPER EASY to carry around and takes up virtually no space at all. I can easily fit all three lenses in their little pouches in my pocket and swapping them in and out with one another is simple and quick. This is a great way to take better-than-average photos, quickly and easily, without having to haul lots of gear around or spend tons of money on said gear. Individual lenses review:* 10x macro - BEAUTIFUL close-up shots and when you combine it with the phone's digital zoom you basically have a microscope in your hands! Try shooting the inside of flowers or small insects or moss, it's amazing. * 58mm - Basically a 2x optical zoom with no vignette and virtually zero distortion. Excellent for birdwatching and nature scenery. * Anamorphic 1.33x - Works wonderfully, just make sure you have video software installed on your computer or your phone to \"desqueeze\". On the super-cheap side you can just export your images and multiply length or width (but not both) by 1.33 to de-squeeze and you'll be set to go.Summary: Overall I am very satisfied with this product in all regards, I just with the Moment App was still under development for Android phones."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Barry James Haylor",
          "Nb_Reviews": 1,
          "Date": "2021-04-01T17:11:00.000Z",
          "Titre": "Moment is an excellent company",
          "Contenu": "Moment is an excellent company to buy from"
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "Susana Mason",
          "Nb_Reviews": 26,
          "Date": "2021-09-28T04:25:30.000Z",
          "Titre": "The quality of the photo is astounding"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "VsA serials",
          "Nb_Reviews": 1,
          "Date": "2021-01-18T05:03:30.000Z",
          "Titre": "gret deals",
          "Contenu": "great deals but less website mintence"
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Knud Nissen",
          "Nb_Reviews": 39,
          "Date": "2020-01-07T19:45:58.000Z",
          "Titre": "Useful products",
          "Contenu": "Useful products, reasonable prices."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Luigi Mandraccio",
          "Nb_Reviews": 1,
          "Date": "2021-01-10T18:30:47.000Z",
          "Titre": "All is ok",
          "Contenu": "All is ok, just a bit confused"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Hara",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:55:35.000Z",
          "Titre": "I had a problem viewing a course that I…",
          "Contenu": "I had a problem viewing a course that I purchased.  The support team kept in friendly communication with me while they solved the problem. It’s nice to receive such a personal touch these days!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Emil Starlight",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:19:18.000Z",
          "Titre": "What made my experience great is not…",
          "Contenu": "What made my experience great is not only the quick response, but the fact that they were genuinely helpful in helping me with my issue! I love Moment products and they’ve always given me what I want and the customer service is no different!"
        },
        {
          "Note": 5,
          "Lieu": "KW",
          "Pseudo": "Lina Almutairi",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T22:27:51.000Z",
          "Titre": "Javier gave me full details about my…",
          "Contenu": "Javier gave me full details about my questions, he even replied very fast and it was a pleasure  to be assisted by him thank you moment !"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "matthieu molina",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T10:28:58.000Z",
          "Titre": "Professional Crew",
          "Contenu": "All the crew guys, were really great and professional.They tried to make everything in their power to get my order ready, specifically with items in back orders and they even match Black Friday price as my order was still not shipped.Still waiting for my order to land at my place, but looking forward to shoot with those new products.Thanks again guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melani Grube",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T02:00:28.000Z",
          "Titre": "Amazing Customer Care",
          "Contenu": "I am amazed by the care and speed with which the customer service team responded to my questions (2 of them, in 2 different emails) about lenses, filters and mounts for my phone camera. They answered the questions clearly and in detail and offered me links to blog posts with more information and appropriate products.Now, I feel like an expert myself!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gigi",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T20:11:23.000Z",
          "Titre": "Moment & it’s team rock!",
          "Contenu": "I have had multiple experiences with the Moment team & have always received top notch, friendly service that’s been more than helpful in every case. Their willingness to go above & beyond is not only unique in this day & age, but is one of the primary reasons I love doing business with them. That & the fact that I love the quality of their lenses, well really, of all of their gear I’ve tried. I also find their videos informative, interesting & just plain fun. You can see they are a knowledgeable, experienced & fun loving team who really care about what they do & the customer experience too. Love the enthusiasm & willingness to help in every email I’ve received also. I always feel like a personal friend is helping me even though we’ve never met. Thanks, Team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Kahan",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T07:04:04.000Z",
          "Titre": "Wow, what a great experience!",
          "Contenu": "It’s Friday night. I had a question about an order. I sent an email, and thought maybe I’d hear something on Monday. To my surprise, I got a detailed, friendly response from Rhodora in 5 minutes. I sent a note of thanks, and got another immediate response from her. This is at 9 pm on a Friday night! I’m so accustomed to perfunctory customer service, it’s really startling to get such incredible responsiveness. Thank you Rhodora and Moment!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Swaggerty",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T04:03:46.000Z",
          "Titre": "Costumer service came through",
          "Contenu": "My shipment got stuck in limbo and I reached out to Moment and they were quick and responsive to get to the bottom of the problem. They found that the courier had lost the package and they shipped out a replacement the same day. Shout out to Becca for her responsiveness in email land."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Wing",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T15:11:45.000Z",
          "Titre": "Have had great experiences with the old…",
          "Contenu": "Have had great experiences with the old M series lenses. Evenly just had a great interaction with customer service modifying an order. Timely response, and the person who responded was super kind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Kazuhisa",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T23:53:23.000Z",
          "Titre": "Rhodora is amazing and you aren't paying her enough.",
          "Contenu": "Sent a message last night about an error in shipping address. Rhodora sent a message reply right away and followed up again today to rectify the issue. Excellent customer service and please give this person a raise!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy user!",
          "Nb_Reviews": 6,
          "Date": "2023-12-07T09:35:18.000Z",
          "Titre": "Wonderful service and great product!",
          "Contenu": "I received feedback immediately answering my questions. Everyone responded with answers and solutions. I'm very excited to receive my products to use with my iPhone! Moment receives great product and service reviews. I can see why! I'm extremely satisfied!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DONALD BONKOWSKI",
          "Nb_Reviews": 3,
          "Date": "2023-11-30T12:36:09.000Z",
          "Titre": "Committed and Great Customer Service",
          "Contenu": "I appreciate such great service when it comes to fulfilling orders. I've ordered from Moment a few times over the past couple of years and every time the turn-a-round in shipping has been above all expectations. Today such responsiveness lacks commitment. Moment has proven to be the most committed to their customers and the best in service. Thank you so very much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T17:24:53.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "Although I had to request a refund due to the popularity and delayed shipment of the Fujifilm camera I wanted, the customer service was excellent. I received prompt, informative, and friendly responses to my emails and was able to get a refund without hassle. Hoping to be able to buy from Moment someday."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paul Clark",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T17:56:33.000Z",
          "Titre": "Moment case problem solved.",
          "Contenu": "Had an issue with a case that was delivered, it felt a bit slack around the phone, but was dealt with really fast and the problem was quickly solved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miguel Moneo",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T19:31:01.000Z",
          "Titre": "Great support",
          "Contenu": "Everything was fast and efficient when I had an issue with a course I had previously purchased"
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Rovan",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T13:12:08.000Z",
          "Titre": "Excellent products and customer…",
          "Contenu": "Excellent products and customer service!Had an issue with pre-order items but every concern was addressed and a solution was offered. Very satisified with the swift responses from the entire team. I also ordered more products since it’s so hard to pass on BlackFriday offers."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Revere Thomson",
          "Nb_Reviews": 6,
          "Date": "2023-11-24T16:54:48.000Z",
          "Titre": "It has been interesting to watch Moment…",
          "Contenu": "It has been interesting to watch Moment grow from their first products, add-on lenses for iPhones, to where they are now, a supplier of many photography products, including cell phone cases etc. In the meantime they have continued to upgrade their cell phone lenses to keep up with the changing optics of the phones made by Apple and others. Their service remains exemplary, as do their own-manufactured products. I recently needed to replace an add-on lens mount and they quickly provided this despite it being several years old."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cecil Thornhill",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T22:35:23.000Z",
          "Titre": "Solid service and support",
          "Contenu": "Needed to combine two orders, got fast help, saved some shipping. Moment’s team actually listens and acts (fast). They have great service to match great products!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kate MacGillivary",
          "Nb_Reviews": 3,
          "Date": "2023-11-30T02:51:52.000Z",
          "Titre": "Customer service at Moment is GREAT",
          "Contenu": "Customer service at Moment is GREAT! I kept either goofing up my order or not quite understanding the mechanics of installing the macro 10x lens and drop-in mount and they always responded quickly and prepared w/ links or videos or just by explaining the status of my order."
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "Em Chiu",
          "Nb_Reviews": 4,
          "Date": "2023-12-01T19:30:13.000Z",
          "Titre": "Cassie was super helpful and she was…",
          "Contenu": "Cassie was super helpful and she was able to understand and answer all my questions and assisted me with my additional purchases and changes Thanks for her help again"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "SaM",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T18:42:16.000Z",
          "Titre": "Very friendly and flexible",
          "Contenu": "The online shop of Moment is really custom friendly and very flexible. After a prompt reply, they let me change a pending order. I will definitely come again and shop more often :-)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Buzz Wood",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T23:27:52.000Z",
          "Titre": "First Person Customer Service, Where You Are First!",
          "Contenu": "The attention to detail that is given is impressive and personable.  The entire team seems to know you and what you've ordered and is there to help with any/all challenges or information.  Their customer service seems to have an attitude of giving the customer the \"benefit of the doubt\" in all of their interactions."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Hanisu",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T16:01:56.000Z",
          "Titre": "Amazing.",
          "Contenu": "Amazing.What else can I say, you guys are making products that inspired me to pick up photography as a hobby. Someone who have been gaming for 24 years suddenly picking up photography. That's how crazy amazing you guys are. All those great videos on youtube and content creators should be proud! And it's hard to find a company that creates great products have great customer service as well! Would definitely recommend my friends to buy from Moment.Again, thank you :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike B",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T18:59:43.000Z",
          "Titre": "Rapid response",
          "Contenu": "Rapid response, and nailed the problem (iPhone auto lens choice bs) right away. Solution worked perfectly (did not realize you guys had an excellent camera app, so - bonus)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerald Teano",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T14:43:29.000Z",
          "Titre": "Great Customer Service!",
          "Contenu": "Great Customer Service!Received the wrong item and they quickly fixed the issue."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "James Wright",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T21:51:09.000Z",
          "Titre": "Awesome service",
          "Contenu": "Awesome service. I had lost the stability strap of my Moment Rugged Camera Sling 10L. A pretty critical thing if you ride a bike. They didn't have a replacement for listed sale on their store but after I made contact via email they checked with the warehouse and arranged to have one sent to me. It was fast, efficient and pain-free."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Jacopo Famularo",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T07:38:55.000Z",
          "Titre": "Fast, effective and going for the extra mile",
          "Contenu": "Cassie was incredibly fast with her replies and supported me with my needs. I enjoyed our interactions and she solved my problens"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cody Davis",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T20:41:56.000Z",
          "Titre": "Customer service was very patient",
          "Contenu": "Customer service was very patient, understanding and helpful to resolve my issue. They were quick in replying back and had resolved my issue in a matter of minutes."
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "Cheung Lau",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T05:36:28.000Z",
          "Titre": "Great Customer Services",
          "Contenu": "Great Customer ServicesA great team is here to help and take care of the customer's needs, swiftly respond the inquiries, and provide professional advice to pick up the right product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael slampak",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T15:34:04.000Z",
          "Titre": "Great case, great warranty",
          "Contenu": "Had their iPhone 13 case for a little under 2 years and started to show some breakdown, sent a new one without issue! Great case and great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerry",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T13:23:23.000Z",
          "Titre": "T-Series Trade-in Program and Great Personal Service",
          "Contenu": "I took advantage of the T-Series trade up program to order the new lenses and a case for the iPhone 15 Pro Max.  The team has been extremely helpful in getting the in stock items to me, while we wait on those on back order.  Having been using the first generation lenses for some time, I can't wait to get the new lenses on the new iPhone 15 and see how that combination makes needing a camera even more unnecessary!  Thanks Moment!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Johnny",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T20:07:51.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Very swift response to an email inquiry and extensive information provided outlining everything and more I needed to know, including links to the relevant aspects.Thanks very much!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Rob",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T17:45:27.000Z",
          "Titre": "Stellar Customer Service",
          "Contenu": "Great products and stellar customer service. Reply to email enquiries within hours and always very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan Montes Adame",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T01:50:21.000Z",
          "Titre": "On time and fast!!",
          "Contenu": "Quick response as always cant go wrong!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruno Giordani",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T02:44:10.000Z",
          "Titre": "Knowledgeable staff and fast action",
          "Contenu": "Knowledgeable and fast action.  It was very helpful now that Moment is handling things and their bags are wonderful.  Lots of options for photographers and especially mindful of the need for water resistant products.  All products well thought out and service is great."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kent Murray",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T15:35:36.000Z",
          "Titre": "I love Moment",
          "Contenu": "I love Moment, even though I am in the UK and I'm sure I could buy cheaper phone cases and accessories closer to home.....I really don't care because the quality of their products is worth the minor increase in price & delivery.Not only that but on my most recent order, I made a mistake and ordered a case for the wrong model iPhone.Their support were uber fast in rectifying it for me and I now have the correct case on the way.If you have never owned a Moment phone case....I couldn't recommend them highly enough, same goes for the lenses.Keep up the great work guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ernie Strauss",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T21:54:14.000Z",
          "Titre": "Great products - Great customer service",
          "Contenu": "I have made several purchases from Moment including several of their M series lens and IPhone cases. All have been well made and perform flawlessly. In one case where there was a shipping problem (the carrier - not Moment) they quickly resent the order. It was hassle free. They only needed verification of my mailing address.I heartily recommend both the company and its products."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Neil",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T08:35:35.000Z",
          "Titre": "100% GENEROUS and LIFE-SAVER AGENT",
          "Contenu": "This is what happened to me:I accidentally placed an order worth $198 because my cat tapped my hand. My delivery address was incomplete, and I wasn't really prepared to purchase the lens. I received a notification from my bank that the payment went through. I was quite distressed and immediately reached out to their support service. Fortunately, there was a very generous and life-saving agent named Szabolcs I. who helped me cancel and refund my payment. And voilà! My money was refunded within seconds after he canceled my order. Thank you so much. Hopefully, the next time I have enough funds, I can finally purchase that lens."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trung",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T17:35:56.000Z",
          "Titre": "Timely Response."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fernando F",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T21:34:30.000Z",
          "Titre": "Warranty Claim Submission for iPhone Case",
          "Contenu": "I contacted the Moment support team to submit a claim for one of their products -- an iPhone case. All the Gear Guides that replied were absolutely awesome and prompt on their responses, plus I got fully refunded! Great job Brionne, Szabolcs, and Javier!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T01:13:39.000Z",
          "Titre": "Personal service on excellent products…",
          "Contenu": "Personal service on excellent products from real live people!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T02:18:59.000Z",
          "Titre": "These are solid people",
          "Contenu": "These are solid people! They make great products and they take care of their customers! I ordered a few items one day but not in the same order. I realized I made multiple purchases on the same day and I asked if they could refund some of the shipping and they did! Simple mistake on my part that didn’t have to do anything about but they chose to. That’s great business!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Wayne Pegg",
          "Nb_Reviews": 4,
          "Date": "2023-11-07T11:33:13.000Z",
          "Titre": "Great customer experience.",
          "Contenu": "Sincerely, great customer service. I requested a refund due to a delay within a product line and it was completed within a matter of minutes! Literally minutes. Thanks Moment & thanks to Szabolcs who handled my query. I will definitely use you again in the future at some point."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken in California",
          "Nb_Reviews": 2,
          "Date": "2023-10-31T19:27:49.000Z",
          "Titre": "I loved the idea of Moment even before…",
          "Contenu": "I loved the idea of Moment even before I loved doing business with them even more. I run a small nonprofit (ewg.org) and the Moment vibe and values felt like a fit. Moment products are first rate, and the customer relations are top notch (I'm looking at you Cassie Cruz and Jim Kim!!)."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alex Thomson",
          "Nb_Reviews": 4,
          "Date": "2023-11-24T18:05:03.000Z",
          "Titre": "Great communication and information…",
          "Contenu": "Great communication and information about the products and the shipping to UK.  Very prompt replies to emails.Thank YouAlex Thomson"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Anonimo",
          "Nb_Reviews": 4,
          "Date": "2023-11-17T12:11:50.000Z",
          "Titre": "Support was very responsive and…",
          "Contenu": "Support was very responsive and answered my questions clearly and kindly. I was able to understand what was going on with my order, and to resolve an issue in a straightforward manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ania",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T17:31:51.000Z",
          "Titre": "Lens Issue Resolved",
          "Contenu": "The Moment Team was able to diagnose my lens issue (not really an issue) by providing a simple solution of using their app to better take photos. Problem solved! :)"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Ivon Kelni",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T02:33:11.000Z",
          "Titre": "Wonderful personalised service",
          "Contenu": "Having placed the pre-order for T-Series lens and iPhone 15 covers, I had a series of questions related to multiple promotions, slight delays in my submission that passed the promotion deadline, etc. I am extremely pleased with the prompt responses in multiple email exchanges and the personalised service. Thank goodness none of those were standard bot responses. Thank you, so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Renee Miller",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T04:57:09.000Z",
          "Titre": "Unbelievable Customer Service",
          "Contenu": "Big shoutout to Javier @ Moment!!  I placed a preorder in August and the items started to arrive a few weeks ago.  In the meantime, I ordered a new phone and knew that the cases and drop-in mount wouldn't work.  Javier was quick to respond to my concerns and assisted me with the exchange of my items.  Though I am bummed I have to wait on the last lens, I am very appreciative of great customer service.  It goes a long way.  Can't wait to start using my lenses for all of those nature pics."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Mary Carmen Morales",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T21:46:18.000Z",
          "Titre": "I’m glad that this company I love so…",
          "Contenu": "I’m glad that this company I love so much have a nice costumer service.  Always have great ideas for us members, and those ideas feels down to earth.  I love moment, you guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "leon johnson",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T14:51:07.000Z",
          "Titre": "I ran into difficulties applying for…",
          "Contenu": "I ran into difficulties applying for the Trade-in Program to get credit for my M Series lenses toward the new T Series lenses.  I couldn't figure out how to enter data for all of my M Series lenses.  Support quickly showed me what I needed to do and has given me all of the $$ for which I am eligible toward purchase of new T Series lenses.  It was very pleasant to work with friendly and knowledgeable support providers.  As always, Moment support is top notch!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Rhodes",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T20:23:29.000Z",
          "Titre": "My First Purchase From Moment",
          "Contenu": "Just received my new silver Fujifilm X-T5 w/ 16-80mm R OIS WR lens kit. Just waiting for the battery to fully charge so I can set the camera up.First, I am totally impressed with the packaging of the camera box with heavy bubble wrap, recycled brown paper and security tape seals top/bottom of the shipping box.Second, the X-T5 box is as I was told in a previous email - brand-new and factory-sealed.Going to shop at Moment for any X-mount lenses I'm going to need. Totally impressed with my first purchase from Moment (authorized Fujifilm dealer)."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Arvind",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T13:16:25.000Z",
          "Titre": "Love Moment gear and their team!",
          "Contenu": "Moment products are great, and so is their brand/content. The team is always responsive and willing to help with orders. Longtime fan, using a large collection of their gear."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Hong",
          "Nb_Reviews": 3,
          "Date": "2023-11-14T18:59:03.000Z",
          "Titre": "Moment recognized the issue in the case…",
          "Contenu": "Moment recognized the issue in the case I purchased and refunded me promptly. Also made it easy to handle the return."
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Diego Amézquita",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T01:30:41.000Z",
          "Titre": "Becca was very attentive and responded…",
          "Contenu": "Becca was very attentive and responded very quickly to my request, she made me feel very well taken care of throughout the application."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debra Rubino",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T15:51:25.000Z",
          "Titre": "I don't know how I did this",
          "Contenu": "I don't know how I did this, but I ordered the absolutely wrong lens for what I want to do but thankfully, both Vince Keresnyei and Szabolcs Ignacz got back to me ASAP and told me what gear I needed to accomplish my goals.  They made the whole process easy.  Now I just have to wait patiently for FedEx to deliver my new purchases."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Paolo",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T18:41:29.000Z",
          "Titre": "Beyond expectations.",
          "Contenu": "I think my review is very useful, because my experience with Moment began with a misunderstanding that caused a mix-up during the purchase phase. After just a few days, the company proved to me its correctness even beyond expectations, much beyond. Therefore I would recommend everyone to contact them, because the customer is never left alone. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Dmytro Kovalenko",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T15:19:00.000Z",
          "Titre": "I did not expect to receive a response…",
          "Contenu": "I did not expect to receive a response and solution to my question so quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jared Lipworth",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T16:04:12.000Z",
          "Titre": "Moment Supercase!!",
          "Contenu": "BAD NEWS: My iPhone 13 Pro in its Moment case flew off the hood of my car at 55mph on the highway, skidded across the asphalt, and landed up against the concrete divider!INCREDIBLY GOOD NEWS: My Moment case saved the phone—no damage at all!!Thank you even more for making such an incredible Supercase!!! Worth every penny!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam Tee",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T09:01:30.000Z",
          "Titre": "They respond quickly to emails!",
          "Contenu": "They respond quickly to emails!High quality products with reasonable shipping costs/timeframe. Excited to experiment with their Nd phone filter and fisheye lens ;)I really really like how they offer a lightly used/open box options for some of their offerings (if they can.) Flagship products at a discounted rate, straight from the company! Don't even have to think about searching eBay. They have created a loyal customer out of me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chelsea Stewart",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T07:03:43.000Z",
          "Titre": "Excellence customer service",
          "Contenu": "When you have a product related issue you can always count on Moment to come through and amend the issues! What an amazing company and quality team! Thank you for your product support."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Matt Benfell",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T14:52:50.000Z",
          "Titre": "2L ripstop fanny pack",
          "Contenu": "Firstly the product itself is so good, build quality and general appearance. It’s exactly what I’ve been looking for for my basic day to day bits (phone, EarPods, let’s etc) I also own an x100v and just wanted something I could reach into and generally carry around that isn’t the conventional boring camera bag. This fanny pack ticks all the boxes. We had a slight issue that I had to get sorted and the team helped me resolved that super super quick. Great customer service, I’ll be ordering again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katherine O.",
          "Nb_Reviews": 4,
          "Date": "2023-09-02T20:09:05.000Z",
          "Titre": "Such great customer service",
          "Contenu": "Such great customer service! Prompt, friendly, knowledgeable AND they care about the earth we all live in. In order to lessen their carbon footprint, they asked me not to send back my return and promptly refunded the cost of my product."
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Trixiey",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T12:22:17.000Z",
          "Titre": "Love absolutely everything about…",
          "Contenu": "Love absolutely everything about Moment; the products, excellent customer service, and their courses. They are the best!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rosé",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T23:28:23.000Z",
          "Titre": "Above and beyond service",
          "Contenu": "Moment's customer service reached out to me when I had a compatibility issue with their older model 67mm filter mount on my new iPhone. Since I hadn't had the older filter mount for very long, they were quick to help me replace it with one that matched my phone model. They genuinely wanted to help solve my problem and were incredibly cool about it. Moment has definitely earned my loyalty."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "russ ditusa",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T16:06:49.000Z",
          "Titre": "Exceptional Service",
          "Contenu": "The team at Moment is exceptional! They know their products, offer invaluable insight, and do so in a very friendly and inviting manner.Thank you Team!Russ D."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "ev",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T18:27:54.000Z",
          "Titre": "Help with shipping costs",
          "Contenu": "Ended up placing a couple orders and the moment staff helped me save $$$ on shipping costs by cancelling one and adding to the other. Thanks so much for the assistance. 🙏🏼"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GARY",
          "Nb_Reviews": 4,
          "Date": "2023-07-18T23:02:50.000Z",
          "Titre": "The shopping experience was great,BUT…",
          "Contenu": "The shopping experience was great,BUT not the delivery process. Using DHL is a slow process. My estimate was the 18th of July and I haven't received it yet and according to the tracking results it took awhile before it left GA. It's now in Ohio being passed off to the usps. I would look for another delivery process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Brouwers",
          "Nb_Reviews": 2,
          "Date": "2023-02-27T23:42:05.000Z",
          "Titre": "Open Box purchase risks",
          "Contenu": "Buying Open Box merchandise is not without its risks. DO read the fine print; there are bargains to be found if you don't really need the latest and greatest tech. Buying what turned out to be a defective product, and trying to return it was a bit of a challenge, but the Gear Guides at MOMENT consented to a full and prompt refund with no need to return the defective product! That's Customer Service, and that we keep me coming back."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "arthur gerstein",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T13:49:57.000Z",
          "Titre": "I’ve been shooting images since 1956…",
          "Contenu": "I’ve been shooting images since 1956 when at the age of 5, Mom gave me a Kodak Brownie Bullet.  I’ve used cameras in all formats from 110 to 4x5 view cameras and lots of 35 mm cameras.  In the late 1990s, I started building digital darkrooms and shooting the first digital cameras.  iPhones eventually became seen everywhere and I drooled over better and better camera sensors.  Now, because of Moment, I can shoot pro quality images on my phone!  You should give it a try.  They are relatively inexpensive so if you have an iphone or android phone, why not contact Moment and purchase one lens.   You will start having a lot more fun with your phone."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Daniel Tan",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T11:58:27.000Z",
          "Titre": "Moment's help staff is amazing",
          "Contenu": "I had entered incorrect shipping details but only noticed it after purchasing the items. Contacted help the Moment staff did the corrections immediately - wonderful! He then mentioned that one of the items was not ready for shipping. Always good to know why shipping gets delayed, so I appreciate this information.Finally, instead of waiting for both items to be gathered, both items got shipped separately so I'll get at least one of them on time - again, another plus for Moment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julio DI Benedetto",
          "Nb_Reviews": 3,
          "Date": "2023-04-16T13:25:45.000Z",
          "Titre": "The Moment Support team were quick to…",
          "Contenu": "The Moment Support team were quick to understand and solve my issue which turned out to be my error.  They provide a short film demonstrating the correct way to use the product in question.   This all happened very quickly.  A great company producing quality products and exceptional customer support.Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig Vogel",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T01:43:33.000Z",
          "Titre": "Awesome Customer Service",
          "Contenu": "Thank you again for your reply and FANTASTIC CUSTOMER SUPPORT!Moment sets the standard for how to deliver a superior customer experience.Of course, I wish that the product would have worked better but the prompt replies, knowledge based advice and willingness to \"make things right\" have left me with a very favorable impression.I will turn to your company the next time I have a need for any of your products."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Michael Heydon",
          "Nb_Reviews": 3,
          "Date": "2023-07-23T00:21:46.000Z",
          "Titre": "Szabolcs Ignacz",
          "Contenu": "Szabolcs Ignacz. He’s what made my experiences with Moment stellar! Szabolcs provided such detailed, kind and generous support throughout the first six months of the year. The most amazing support I’ve ever gotten."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Ferrera",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T06:15:21.000Z",
          "Titre": "I ordered a number of mobile filters",
          "Contenu": "I ordered a number of mobile filters. They were delivered promptly, but one of the packages I received was interfered with in transit somehow. A slit was made on the side of the package and the contents were nowhere to be found.I notified Moment as soon as possible. They were very helpful in getting a replacement order sent through. Their customer service was very polite and understanding of the situation. I'm very grateful for them responding during a stressful time."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Michael Heydon",
          "Nb_Reviews": 3,
          "Date": "2022-12-30T03:21:15.000Z",
          "Titre": "Great Gear Guides",
          "Contenu": "What amazing customer support! One Pro Gear Guide named Szabolcs continues to go above and beyond to keep a customer satisfied.I'd encountered some issues with new iPhone 14 Pro Max products. I was losing faith in the possibility of things working with my new device. I was going to forget about using Moment M series lenses and just go with the device's great cameras.Szabolcs reached out and helped me maintain faith in Moment's ability to work with my iPhone. He spent a lot of time and energy over the course of a number of emails and provided detailed and solid assistance.At a very busy time, he cared so much about improving one customer's experience and keeping that customer. And he did keep that customer.They are good people with great products!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Scotty down under",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T12:55:25.000Z",
          "Titre": "I was looking for something better than…",
          "Contenu": "I was looking for something better than run of the mill gear for photography and the team at moment set me straight with some good advice and product.  Can’t wait to test it out on the iPhone 15!"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Margarida Ramos Matias",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T01:48:08.000Z",
          "Titre": "One of the best Support Teams I've had…",
          "Contenu": "One of the best Support Teams I've had the pleasure to deal with, super polite and available, they replied fast, were super friendly and made me feel at ease and safe to clear all my doubts.Best team for sure, and of course amazing high quality products!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M. Finder",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T14:52:25.000Z",
          "Titre": "5 Stars and Beyond",
          "Contenu": "5 Stars is not enough stars to show the true excellence of Moment as a company that not only cares about its customers but also produces top-notch products for our phones.  I recently contacted Moment customer service regarding Moment lenses that I’d purchased in 2017. My Moment representative went well beyond and above to research my issue and present me with options.   I would highly recommend Moment for anyone to confidently deal with them.  Did I mention their lenses are superb as well?!?!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sara Giesbrecht",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T17:46:15.000Z",
          "Titre": "Customer service is over the top!",
          "Contenu": "Customer service is over the top!Even as the business has grown their communication with customers and respect is next to none!  I don’t say that lightly. Excellent business, and excellent people!  Thank you for always being fun and down to earth."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Levy",
          "Nb_Reviews": 2,
          "Date": "2023-03-04T16:56:58.000Z",
          "Titre": "Javier and Szabolcs and the team were…",
          "Contenu": "Javier and Szabolcs and the team were amazing from the get go.  Explaining a story of messing up a small part of an order is embarrassing, but when the team responds that they will do what they can to help, I need to say it just launches your trust into another level.  It shows that a company is willing to invest in you for the future, so why not do the same with them? Thank you for securing my business and excitement for the brand for many days to come."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sara Giesbrecht",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T17:46:15.000Z",
          "Titre": "Customer service is over the top!",
          "Contenu": "Customer service is over the top!Even as the business has grown their communication with customers and respect is next to none!  I don’t say that lightly. Excellent business, and excellent people!  Thank you for always being fun and down to earth."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gabi Incorvaia",
          "Nb_Reviews": 1,
          "Date": "2022-12-25T18:37:10.000Z",
          "Titre": "Great purchase experience.",
          "Contenu": "I by mistake ordered the wrong phone case, the support team was excellent helping me sort things out and get the exchange taken care of. Extremely fast response even during the holidays. Their products are excellent. Great purchase experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katie Holian",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T14:42:02.000Z",
          "Titre": "Javier and Szabolcs, thank you!!",
          "Contenu": "Javier and Szabolcs were super helpful making sure I got the right camera since the FujiFilm x100v is on backorder indefinitely. They worked with me over the past few days and were super helpful. Thank you both!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "COLIN CAMPBELL",
          "Nb_Reviews": 5,
          "Date": "2023-01-07T15:48:57.000Z",
          "Titre": "Excellent product and service",
          "Contenu": "Excellent service. Staff helped me through the online purchase when I couldn't find the item I wanted and despatched it almost immediately. I have always loved the M 58 telephoto lensed the cases that mount it to my iPhone, even when I upgraded my phone. The quality is streets ahead of the competition. And I have tried the competition. Hands down the best phone lens on the market."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "What's not to Hike",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T11:02:14.000Z",
          "Titre": "Can't Fault The Service",
          "Contenu": "I asked for specific information and was given the full answer and recommended mount for my particular phone. I have an older phone so sadly no longer have the filter I was after but the service was first class. Based on my experience, I'll be buying the recommended phone mount."
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Yesid Torres Sid",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T04:36:21.000Z",
          "Titre": "Had an issue with accessing my course and got it resolved in no time",
          "Contenu": "I had an issue with accessing the course. Moment helped me in no time, literally so quickly I wasn't even expecting it. Szabolcs was super helpful, he took care of the whole issue and now I'm back in the course. Thanks, Moment team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T08:36:42.000Z",
          "Titre": "Awesome shopping experience",
          "Contenu": "The website is pretty, clean & straightforward. Moreover the after-sale crew is just fantastic. They answered all my questions and even went over and beyond by recommending more options based on my needs. Great experience overall."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T23:52:20.000Z",
          "Titre": "The Best!",
          "Contenu": "Great products.  Great service.  Great team.  Happy to give five stars without hesitation.  I had one small shipping issue for one item out of the six that I ordered.  Their customer service team was quick to respond (same day), was responsive and resolved the issue quickly.  Would not hesitate to order from them again.  Thank you Moment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "reinton kawamae",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T23:34:45.000Z",
          "Titre": "Fast response and answered my questions…",
          "Contenu": "Fast response and answered my questions with some extra information so I wasn't left wondering."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Or Kribos",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T21:06:24.000Z",
          "Titre": "Great shopping experience!",
          "Contenu": "Great shopping experience, as always! Been a Moment gear user for several years now. The support team was prompt and helpful in answering my questions regarding gear I was undecided about. Love Moment's products. Superb for vlogging!"
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "Chong",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T00:32:48.000Z",
          "Titre": "The quality that you can rely on!",
          "Contenu": "I owned an Anamorphic lens, M Series lens mount, iphone 11 and 14 pro max phone case with drop-in lens mount. Happy with the quality of the product and the optic of the anamorphic lens.However iphone 11 case slightly loose after 1 year, but not affecting the anamorphic lens alignment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T17:56:16.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "I recently got into photography. I think my phone takes pretty good pictures but, I wanted to enhance it’s abilities by adding lenses. I was looking at DSLR cameras but, I’m not one to carry an additional camera with me wherever I go. I do carry my phone everywhere. I found the Moment lenses through web searches for the best phone lenses out there and figured I would try them out. When I ordered, I accidentally ordered a case for the wrong phone. After messaging the staff at Moment about this, they resolved the issue and were able to bundle my order a little better which resulted in a refund of the difference. So far, I couldn’t be happier with my experience with customer service. Now, just have to wait for my order to arrive so I can begin taking better pictures."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Miguel",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T11:34:22.000Z",
          "Titre": "Szabolcs and the Moment team are awesome.",
          "Contenu": "Szabolcs was incredible. Helped me out with my order and in no time. Always super nice, helpful and kind. When a problem happened (out of Moment hands) they immediately find a way to solve it and helped me out. I really appreciate it, and they've got a costumer for life for sure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Salvaggio",
          "Nb_Reviews": 7,
          "Date": "2023-02-19T07:05:52.000Z",
          "Titre": "Ive been a long-time fan and customer…",
          "Contenu": "Ive been a long-time fan and customer of Moment. I just recently had an issue that needed attention and the customer support team was quick responsive and helpful and resolved my problem in a matter of a moment. 👈 see what I did there 😉.Thanks, Ya'll 🤘"
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "bfdur",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T12:23:47.000Z",
          "Titre": "Great service",
          "Contenu": "I have asked some changes to the customer service after placing an order, and the response was surprisingly quick and kind. Great service!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Vicente Gerbasi",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T23:00:12.000Z",
          "Titre": "Excellent and fast customer service",
          "Contenu": "Ordering process was very easy and clear. After placing the order I realized I wanted to exchange one item for another and contacted Moment via their website; it the exchange was done very swiftly by their team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel Waldorf",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T17:05:16.000Z",
          "Titre": "Super helpful and easy to work with",
          "Contenu": "Super helpful and easy to work with. Had questions I didn’t exactly know how to phrase and got great help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eddy Brock",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T06:52:05.000Z",
          "Titre": "Separated my order so in stock items arrive on time",
          "Contenu": "I ordered a new lens and 2 adapter mounts. One of the mounts was back ordered and was going to delay the shipping of the lens and other adapter. I reached out to support staff and asked if they could separate my order so the non back ordered items could get here on time. I got a response email saying they could fulfill me request and truly made my day. 14 out of 10 would recommend the lenses and overall service with moment."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Lukas Stipp",
          "Nb_Reviews": 1,
          "Date": "2022-12-26T03:35:22.000Z",
          "Titre": "Incredible customer service",
          "Contenu": "I was having a problem with the case I received from moment. The lens interface didn’t hold the lens in correctly. I reached out to moment, and received a response within about an hour. They asked for proof of purchase, as well as a video of the faulty part. Upon sending it to them, I received another timely response, saying they would be happy to send me a new part for free, and to expect a tracking number soon. They were very helpful, and this has been one of the best customer service experiences I’ve ever had. Well done moment."
        }
      ]
    }
  ]
}