{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "simplynuc.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Worley",
          "Nb_Reviews": 2,
          "Date": "2023-10-07T15:02:23.000Z",
          "Titre": "late and not what they promised",
          "Contenu": "2 months late and not what i originally ordered"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Blake",
          "Nb_Reviews": 1,
          "Date": "2022-02-22T22:21:52.000Z",
          "Titre": "No Updates. Delivery Delays & Broken Promises",
          "Contenu": "After placing my order I received no update on the status (not one). I had to wait to hear from Fedex that my order was sitting at customs and awaiting payment to clear. I had already prepaid SimplyNUC Duties and Taxes, however 1 month later I am still receiving Payment Due Notifications from Fedex for the amount SimplyNUC has apparently not paid.I was also told repeatedly by the SimplyNUC team that they were sorry for the inconvenience they've caused and would like to help make things right. I still haven't received an update on how they're going to do that."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frustrated Buyer",
          "Nb_Reviews": 1,
          "Date": "2021-11-10T21:51:10.000Z",
          "Titre": "Shipped an incorrect item",
          "Contenu": "Shipped an incorrect item, charged $100 more than other sellers for that incorrect item.  Told me I would have to pay for return shipping.  Did not respond to emails for multiple days.  After multiple emails back and forth they said, as if it were a big deal, that they had been \"authorized to give me a full refund\".  What \"full refund\" actually meant was they would after all pay return shipping. Very generous!  By this time, as I had no idea if they were going to reply at all, I had started using the item, so I could not return it.  So they sold me an incorrect item for $100 more than I would have paid elsewhere, and because of their delays, I am stuck with it."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Virgilio Allado",
          "Nb_Reviews": 2,
          "Date": "2022-01-22T00:28:27.000Z",
          "Titre": "Unit comes with a Mic that doesn't…",
          "Contenu": "Unit comes with a Mic that doesn't work. Also says up to 7.1 audio. Tried updating and reinstalling drivers but that did not resolve the problem. Tried reaching the chat support but it was always busy and I was told to leave my email address and they would get back to me. Nobody ever did."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Luong",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T16:39:34.000Z",
          "Titre": "I bought the NUC12 Extreme and waited 4…",
          "Contenu": "I bought the NUC12 Extreme and waited 4 months later to recieve due to chip shortage (I understand that). However, their USB recovery flash drive does not work when I try to restore it.  I called in and asked for a \"PRODUCT KEY\" to activate it and they refused to give out since I already paid for the Win10 Iot Enterpise 2019 High End version.They gave me an answer that they only have one master key to activate them all and I cannot have it. I only have a key product of which been sticker on the bottom of the system. This key only contains 20 digits instead of a normal one as 25. That is how my PRODUCT KEY does not work for Microsoft activation.They promised to send me another restoration USB flash drive within a week. That is what I am concern about. I paid extra money for a good Windows and I have the right to have a correct product key for legal activation.The Window costs me around $220+, I don't complain about the price at all. What make me uncomfortable is the product key is not given out as I am the owner of it Another thing is their graphic card prices are very high sky rocket. I have bought an exact one as their's and it only cost me $420, instead of nearly $1,500 at the time they have offered. I understand they have to make money but not more than 3x times.The NUC12 EXTREME is great, works very good. I love it for my work environment, I am a CAD/CAM programmer by the way.=====Sept.5th.2022 update====NUC refunded the Windows cost of which I paid for and thank you for that."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Martin",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T21:55:55.000Z",
          "Titre": "The NUC has regularly had issues…",
          "Contenu": "The NUC has regularly had issues operating as a Microsoft Teams room.  We've experienced issues with displays and power/sleep settings."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roman",
          "Nb_Reviews": 2,
          "Date": "2021-11-02T02:16:18.000Z",
          "Titre": "Wasting time",
          "Contenu": ".After long waiting to get quote I just got notification that all requested models were sold out."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lloyd Bond",
          "Nb_Reviews": 1,
          "Date": "2022-02-02T13:53:49.000Z",
          "Titre": "1 Star for dishonest service.",
          "Contenu": "1 Star for dishonest service.I ordered my device (ruby r8) because the website labeled it as \"Now Shipping\" while other devices were labeled \"On Back Order\". I'm actually only in town for a short time. So I ordered the device and paid for rush shipping. The next morning, I get an email that SimplyNUC is very sorry but the lead time is actually 1 week for this device. I guess it's not \"Now Shipping\". So I wait two weeks with no update, and then email them. And now I get a song and dance about how the product wont be shipped until April-June. I'm sorry, that's a hell of a lot different than \"Now Shipping\". And for reference the ASPN50r7 is listed as \"Out of Stock\" and the NUC11TZI7 is listed as \"On Backorder\". This is just completely disingenuous.And do you think I really care for some made up excuse of \"current global chip shortages, severe weather, Chinese New Year, and Covid-19\"? You have severe weather to deal with every year, the Chinese New Year happens every year. The global chip shortage has been happening for two years now. And it doesn't mean you can't ship your products, it means you have less to sell. And Covid 19??? Again, it's been two years, you seriously haven't figured out a safe process yet? I'm sure in that two years, you've got a good sense for how long it takes to ship a device. How ridiculous, all of that constitutes a 2+ month wait on top of the two weeks I already waited for a device that's \"Now Shipping\".Needless to say, I told them to cancel my order and refund my money. Even if I wanted to wait for the device, I couldn't. I'm going to be out of the country in a few weeks. Who knows when I'll be back. That's why I bought a device that said, \"Now Shipping\" instead of one that said, \"Out of Stock\" or \"On Backorder\".Did they cancel the order? Did they refund my money? Did they at least respond to my cancellation and let me know how they plan to fix the situation? No, of course not. But two days later, I start getting automated emails from SimplyNUC's ordering system. I received a FedEX tracking number in one email and a \"Your order is complete\" in another email. Miraculously they had a device to ship to me. So, after 3 weeks I finally get my device. The FedEX shipping was fast. It did take an extra day because of the snow in NYC.I just don't understand the poor service. I wont be doing business with SimplyNUC ever again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aash D",
          "Nb_Reviews": 1,
          "Date": "2020-06-15T22:59:41.000Z",
          "Titre": "Stay away, defective machines with terrible customer service",
          "Contenu": "Ordered 9 PC's from this company, and several of them are defective.  They acknowledged an issue with the application of thermal paste and resent us 4 machines, which still had problems.  Now they are stating the units are rigorously tested and they will not apply a credit for the machines unless they can be resold to others.  We have wasted over a month trying to get this addressed.  Buy from On-logic; we have a couple of their machines and they work without any issues."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joan Baker",
          "Nb_Reviews": 1,
          "Date": "2020-02-04T18:09:31.000Z",
          "Titre": "I would stay away",
          "Contenu": "Bought an item. Couple days later they told me there was a price error and refunded my money. Didn’t get anything for my inconvenience or a discount on the item at the supposed correct price. I missed out on other sales due to buying this item and by the time they told me, the sale was over on the other website. Won’t be doing business with them. Glad I didn’t actually receive a product. Who knows what would happen if they got my money and then I had a product issue and i needed support"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan Lee",
          "Nb_Reviews": 1,
          "Date": "2021-06-09T19:01:12.000Z",
          "Titre": "Company with no ethics",
          "Contenu": "I'm a first time buyer from SimplyNuc, and this first time experience has turned me off from them indefinitely.  I made a preorder of the Phantom Canyon Nuc barebones kit in March.  I kept getting notices that my nuc would be shipped out to me by end of April, then end of May, then early June 2021.  I recently asked their customer service again on the status of my order.  Lo' and behold, I find out from their rep, Matt, that they are purposely putting my order at the back of the line simply because I didn't pay more money for the preinstalled ram and ssd.  This is not only unethical, but a violation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Richardson",
          "Nb_Reviews": 1,
          "Date": "2020-02-20T14:41:07.000Z",
          "Titre": "Shipping charges are criminal",
          "Contenu": "Shipping charges are criminal! I had a specific part that I could only find from them that cost $15 and weighed less than 1 lb. they shipped it from Austin to Dallas by fed ex ground and charged me $19 for shipping on top of the $15 for the part. I will never buy from them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Another customer patiently waiting",
          "Nb_Reviews": 1,
          "Date": "2020-02-17T18:17:09.000Z",
          "Titre": "Items will not arrive after 3.5 months of ordering and paying in full",
          "Contenu": "1 February 2020: Though I did not receive the product yet, I received this feedback form. I hope you are not falsely thinking that you delivered my item! I am still waiting to receive my goods (it has been almost 1 month since I ordered and was promptly charged in full for the items)17 February: I received an update from the vendor saying there will be a SLIGHT delay in delivering my order. They EXPECT to ship my item by LATE APRIL. I have never experienced anything like this before and this is unacceptable. Unfortunately, I cannot downgrade my rating to zero stars but this is a zero stars service as far as I am concerned. I will cancel my order and look elsewhere ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrey Shipuk",
          "Nb_Reviews": 2,
          "Date": "2020-01-07T16:25:48.000Z",
          "Titre": "Horrible communication with customer…",
          "Contenu": "Horrible communication with customer service.It has bin almost a month and I’m still waiting on the product, I’m thinking of canceling and going with different brand, if the issue is not resolved!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Raymond",
          "Nb_Reviews": 1,
          "Date": "2020-07-02T23:23:49.000Z",
          "Titre": "A sloppy, careless outfit",
          "Contenu": "I tried to order a replacement blower for my wife's NUC. Simply NUC's accessories subpage for fans carries only one model and neglects to mention that not all 4x4 NUCs can use it.After wasting money and time because of this, Simply NUC tech support's response was to suggest that I RMA the entire NUC back to Intel, depriving my wife of her work computer for an unknown amount of time.I know Simply NUC could have found multiple sources for the exact fan that fits my wife's NUC, because after I disassembled hers to find the model number it only took me about three minutes with a search engine.These people are careless and sloppy. They don't care about informing their customers and they seem unwilling to put even minimal effort into problem-solving.I am extremely disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2020-06-09T14:08:46.000Z",
          "Titre": "Reseller",
          "Contenu": "We're a reseller, we were told, we can't place our orders online due to the fact Simply Nuc system is not set up to process online orders for tax exempt customers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom F",
          "Nb_Reviews": 1,
          "Date": "2020-07-05T23:48:11.000Z",
          "Titre": "The very worst experience ever…",
          "Contenu": "The very worst experience I have ever had with an online shopping Web site. Online “Chat” is useless and unresponsive. Order input is confusing and did not work the first 3 time I attempted to enter an order.  Account was setup using my email address (I did not do this). If I try to access the account, I do not know the password. When I request a password reset, it never sends it to me. I ordered a very expensive item which was immediately billed to my credit card for the full amount the day that I ordered it (June 15th). When I asked when I will receive my order, I am told it is first come, first serve and you are filling orders from January and February.  Too busy? Your customers can help with that problem. I would cancel my order but figure by the time I receive my refund, I would have received the unit I ordered. I recommend anyone shopping for a NUC, go somewhere else!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leon de Bruin",
          "Nb_Reviews": 1,
          "Date": "2020-01-08T18:11:21.000Z",
          "Titre": "Support well below standard",
          "Contenu": "Support well below standard. They provide and sell units which can be remotely powered on and off and they do not know or support this facility"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jon Presley",
          "Nb_Reviews": 1,
          "Date": "2021-07-27T00:21:51.000Z",
          "Titre": "They sent to the wrong address",
          "Contenu": "They sent to the wrong address, send confirmations to the wrong email address.  I tried to correct them, but they refused."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alain Rouault",
          "Nb_Reviews": 1,
          "Date": "2021-09-09T23:00:29.000Z",
          "Titre": "6 months of delay",
          "Contenu": "6 months of delay, no rebates!!! Even my bank is giving me money when they borrow 6 months of cash!"
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Eduardo",
          "Nb_Reviews": 1,
          "Date": "2018-12-18T05:25:11.000Z",
          "Titre": "Havent sent my item and havent send me…",
          "Contenu": "Havent sent my item and havent send me the refound, this is a scam!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "meni Eliyahu",
          "Nb_Reviews": 2,
          "Date": "2021-04-18T14:49:28.000Z",
          "Titre": "is has been 4 month and still never…",
          "Contenu": "is has been 4 month and still never received my product"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NoCrossBones",
          "Nb_Reviews": 1,
          "Date": "2021-11-18T21:46:58.000Z",
          "Titre": "So far so good."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Davis",
          "Nb_Reviews": 2,
          "Date": "2020-12-17T03:24:33.000Z",
          "Titre": "Way too slow",
          "Contenu": "Too slow on turnaroung time"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kenneth Downes",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T23:40:02.000Z",
          "Titre": "Ordered a computer for a customer…",
          "Contenu": "Ordered a computer for a customer project. Quoted lead time was 3 to 5 days. Day 5 came and went. No news about status. Only response I ever really got was we are working on it and will notify you when it ships. So about 30 days later I was notified it was shipping. It's due to arrive Monday so we will see if it does the intended job. My end customer is ready to cancel my order because of the delay so I'm hoping it actually arrives and is in good shape. If not I stand to be out about $10k in hardware costs and another 20k in lost time on this project."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Adam Zenner",
          "Nb_Reviews": 2,
          "Date": "2022-01-19T19:39:36.000Z",
          "Titre": "Poor Customer Service",
          "Contenu": "Disclaimer first, our company is a small startup, I can understand hesitancy to deal with us as the $$ isn't going to happen fast.  When I requested a sample computer, something I was told they do, my request was rejected.  It was rejected because our company has a P.O. box not a physical building.  Our company was started during Covid, we are completely virtual.  So rather than consider things may be changing in the world, they just denied us.  We had to buy and return, no big we did, but it was odd that customer service was so rigid, especially since we have experience with them (we have bought from them previously).  I then requested the life cycle of the computer that we were interested in (the one we bought and returned), I was told we must sign an NDA to get that kind of information.  I find this odd, you can't tell me how long you will be selling a product without my company signing an NDA.Historically I have worked with SimplyNUC, they were always great... something has changed.  Customer service is not what it used to be.  I used to feel like they wanted to work with anyone, this most recent experience it seems like they have grown past that."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Xavier",
          "Nb_Reviews": 2,
          "Date": "2022-09-29T15:28:10.000Z",
          "Titre": "Expected delivery in July and received…",
          "Contenu": "Expected delivery in July and received items end of September.  Be very skeptical on estimated delivery dates."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 2,
          "Date": "2021-09-24T19:34:58.000Z",
          "Titre": "Inaccurate ETAs and they charge upfront for backorders",
          "Contenu": "SimplyNUC provides inaccurate ETAs, frequently off by months, and they charge immediately even when not shipping for 3-6 months.  In the past they've also canceled orders on me, claiming they couldn't get the part after a multi-month wait when I had no issues turning around and buying from someone else who shipped same day."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Todd Wheeler",
          "Nb_Reviews": 2,
          "Date": "2021-01-17T16:00:35.000Z",
          "Titre": "I asked before I placed the order if…",
          "Contenu": "I asked before I placed the order if yoyo had it in stock.  You said yes.  It then took weeks to ship.  I received the unit without a power cable.  The unit would not power up when I got it.  The power cable on the main board was not on correctly.  The power LED on the unit does not work.  The unit will not run Hyoer V.  That is a pretty big deal.  I contacted support and they where not helpful at all.  This is my first experience with simplynuc.  I have been in IT for more than 30 years.  I was disappointed with the entire experiance."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CJ",
          "Nb_Reviews": 1,
          "Date": "2021-07-04T22:35:51.000Z",
          "Titre": "The customer service was great very late order",
          "Contenu": "The customer service was great they were very quick with responding and very helpful. On the other hand my shipment was shipped more than 6 months later than it said it would be on the site. To be fair it was something I Pre ordered but still 6 months late."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brian Linke - Buyer",
          "Nb_Reviews": 1,
          "Date": "2019-09-19T02:48:29.000Z",
          "Titre": "When I tried to spend over $30,000 on…",
          "Contenu": "When I tried to spend over $30,000 on your site this evening, the credit card number field was grey with a sad face emoticon and wouldn't allow me to complicate the purchase.  I had to call a colleague who finished the order from his desktop.   Frustrating when a website makes spending money difficult - this could cost you business."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ernest Ray Sinclair",
          "Nb_Reviews": 1,
          "Date": "2020-01-27T19:52:34.000Z",
          "Titre": "The computer that was delivered to my…",
          "Contenu": "The computer that was delivered to my friend as a Christmas present has problems.  When she tried to send it to you she needed to pay shipping,  She's taken it to her Geek Squad and they are checking it out.  I think you response was poor."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "HZ",
          "Nb_Reviews": 1,
          "Date": "2018-12-26T07:19:35.000Z",
          "Titre": "Computer I ordered was configured incorrectly",
          "Contenu": "Asked for a computer to install the OS on a SSD and include a backup HDD.  However, after receiving the system and after installing few software application, noticed the OS was installed on HDD.  Returned the system and asked to image the OS with installed software to be used to rebuild the OS on SSD but when I received the system again, the software applications were not installed.  Called and explained the situation but I was told that I needed to contact the software developers companies and ask them to fix the problem that would have cost more than the price of the new software to fix.  Also, was told there was nothing they could do to resolve the issue.  So, I end up purchasing the software again that cost me hundreds of dollars."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "EBL",
          "Nb_Reviews": 1,
          "Date": "2021-07-24T22:38:23.000Z",
          "Titre": "Poor documentation",
          "Contenu": "Poor documentation! Not good for auto startup as set with push button start.Over priced. Mounting is hobby quality. Power supply cords (both In&Out)  short."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gary M",
          "Nb_Reviews": 2,
          "Date": "2020-10-24T00:51:45.000Z",
          "Titre": "Be Aware: You will not receive the SimplyNUC Advertised LiteOn power adapter.",
          "Contenu": "I needed to purchase a replacement power adapter for my NUC8i5BEH, since the original was left 500 miles away, and no way to ship. Decided to purchase from SimplyNUC ONLY BECAUSE they showed the same original LiteOn power adapter that came with my NUC8i5BEH when I purchased it. The total SimplyNUC cost (with shipping) was $100, and I struggled with paying this much when other, much cheaper, options were available on Amazon. I made the decision to spend the extra dollars ONLY BECAUSE SimplyNUC offered the same LiteOn adapter that came with my NUC. Upon receipt, I found that SimplyNUC sent me the Asian Power Devices DA-90J19 power adapter that I could have bought on Amazon for $21.95 with free shipping (Prime). A follow-up with SimplyNuc customer service resulted only in them saying \"Sorry - the picture of the LiteOn power adapter is only for reference - the one you received will work with your NUC\". I have been satisfied with SimplyNUC purchases previously, but I must say that this looks like a bait and switch tactic. I am very disappointed to have paid FIVE TIMES as much in order to receive the correct (as advertised) LiteOn power adapter, only to receive the inferior quality APD adapter that I had decided against, even though it was only $21.95 on Amazon."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2018-12-12T17:17:19.000Z",
          "Titre": "great customer service, but poor product execution",
          "Contenu": "Customer service and presales is amazing service, however I have to put an overall low score as the airserver product is not at a useable performance level. This is something that should have never been released until the many issues have been resolved.Update:  Reseller reached out based on this review asking if I could improve the rating based on the satisfaction of customer service and the fact that they refunded after the product was returned within 7 days of receiving the product.  While I still consider their customer service to be top notch, my experience with the product testing in Nov 2018 was not great. The product way under performed and had a number of issues that was shared.. At the time, they didn't believe any of those issues could be resolved quickly.   Also, at the same time, I didn't think it should have been released with what was experienced.   Based on the reply to this review from SimplyNUC, it sounds like those issues have been resolved in the last month.  That's great to here, but not experiencing that myself it's hard to improve the review as it was originally released with the number of issues that it had before.  At this time, I need to keep the review at 2 stars for the great customer service, with the product being at 0 stars due to the number of issues experienced (at the time of testing) and none of them being able to be resolved at the time with the only option by SimplyNuc to return the product for a refund."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carld",
          "Nb_Reviews": 1,
          "Date": "2018-12-18T22:03:33.000Z",
          "Titre": "Weird experience"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff M.",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T18:42:57.000Z",
          "Titre": "Prompt, but...",
          "Contenu": "Was prompt, but the FedEx delivery person did not buzz the door nor leave sufficient time for me to sign for the package. Now I must go to FedEx facility to pick it up later tonight.  This is a hassle, as I stayed home from work today expressly to pick up the package."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "old goat",
          "Nb_Reviews": 1,
          "Date": "2021-11-19T04:08:22.000Z",
          "Titre": "Good Product, rough ordering process",
          "Contenu": "The order form asked if I wanted to pay more to get next day shipping. I paid it and for the next day shipping still took 2 weeks to ship, that was with next day delivery by FEDEX. I called to find out when it would ship ( I am in the process of moving just over 1,000 miles, so knowing when it ships matters for me to be at the receiving end). They gave vague estimates of 3-4 weeks or maybe more.I made special arrangements for someone to receive the package near the new address and requested a change in the shipping address. You cannot track the shipping address on their website, it stays frozen at original destination after being edited.I have been told the system has arrived at the destination. It will be a couple of weeks before I can pick it up (frustrated) and check it out.I could have had it delivered directly to me if SImplyNUC had accurate shipping estimates."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Airtech Heating",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T15:50:03.000Z",
          "Titre": "Took me to the Canadian website",
          "Contenu": "Took me to the Canadian website.  Disappointed to find I was billed in US$.  Should be more clear when ordering."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff Hatfield",
          "Nb_Reviews": 1,
          "Date": "2021-11-18T15:11:33.000Z",
          "Titre": "The post order experience was confusing",
          "Contenu": "The post order experience was confusing.  When I ordered my system there was no indication of how long it might take to build the system and get it shipped.  Therefore after a week I started to wonder if something was wrong.  So I looked on the web site for a button to click to \"Check Order Status\" or something like that.  There wasn't any.  So the only other option I saw was to log a support ticket, which I did.  I waited for 3 days without a response to the support ticket and figured that must have been the wrong thing to do.  So I just replied to the email SimplyNUC sent confirming my order.  While I was waiting on a response to that, I went to the web site and a chat box popped up asking if I had any questions, so I just asked them about my order and they were very helpful in looking it up and letting me know the normal 7-14 days orders were taking to build.  In the mean time someone answered my support ticket telling me to contact sales.  Also around that time, the sales folks replied to my email.  So, there were at least 3 people involved on the SimplyNUC side not to mention the time I put into finding out that my order was indeed being processed within normal time frames.  All this could have been avoided by simply including a sentence on the order confirmation email about how long to expect the build process to take and how to reach out if there were concerns!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2021-03-19T15:08:00.000Z",
          "Titre": "Loading non-standard OS",
          "Contenu": "I understand that you normally ship products with the OS installed. However, I required an OS that was not on your list. It took me about 2 days, an email to support, and LOTS of searching on Google before I could get an OS loaded. The problem ended up being that Legacy USB needed to be turned on in the BIOS. A lot of this could have been avoided if you had a help guide for loading something other than Ubuntu or Windows."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jacob",
          "Nb_Reviews": 8,
          "Date": "2021-09-29T23:01:38.000Z",
          "Titre": "Purchasing process was smooth, but Shipping needs work.",
          "Contenu": "Purchasing process was smooth and efficient.Shipping process needs work:1) no tracking link in the email, just a tracking number.2) fedex tracking info is totally false (how are they still in business)3) review email arrived before the actual product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "T Corbin",
          "Nb_Reviews": 1,
          "Date": "2021-03-10T19:51:01.000Z",
          "Titre": "Slow Response Time",
          "Contenu": "Put my order in on 2/22/21, but didn't receive it until 3/9/21.  No explanation for the delay and no updates on the status of my order.  Even though I paid extra for 2 day shipping.  When I called the customer service guy was rather nonchalant.  The best I can say is he didn't give me a lame apology or make excuses.  If you have a good reason for a delay in filling an order, then you should quickly and clearly communicate that to the customer, so you don't leave them hanging and wondering what's going on."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2020-02-05T17:58:45.000Z",
          "Titre": "Overall good experience",
          "Contenu": "Overall good experience. But as I was doing a pre-order, an expensive one at that, I'd really like to have some status updates. All I know is it could show up on my door in February or March. If I would get an update or two on where it is in the process (getting them in x date, planning on shipping these dates, etc.) as time goes on, I'd be much more content."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Greg D",
          "Nb_Reviews": 1,
          "Date": "2021-04-17T15:48:16.000Z",
          "Titre": "Expected same maybe next day order…",
          "Contenu": "Expected same maybe next day order processing, it took 3 days. Nowhere does it indicate how long it will take.Product was supposed to come with free 6 month Plex pass offer, I was sent the 4 month offer. My time is too valuable to be chasing down a fix for this mistake."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ragnar Jerriksson",
          "Nb_Reviews": 2,
          "Date": "2021-09-02T19:16:56.000Z",
          "Titre": "I understand the worldwide chip shortage, but...",
          "Contenu": "I looked online and saw the set-up I wanted. The Topaz. I ordered a Topaz i7 with 2 day delivery. A week later I receive an email and phone call stating that the Topaz is not available. I review the suggested alternatives and chose one. I was then contacted again that the second one I wanted (ASPN50r8) was not shipping either. I ended up with a Ruby R8 that was comparable to the Topazi7 and ASPN50r8. However, after Simply NUC was kind enough to offer me a slight discount, I still paid $92 more. I really needed a computer and have not been dissatisfied with the Ruby, but I feel a little slighted; almost like a bait and switch scenario."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jim P",
          "Nb_Reviews": 3,
          "Date": "2020-05-27T20:05:44.000Z",
          "Titre": "One of the critical parts in the…",
          "Contenu": "One of the critical parts in the bracket set was the shoulder screw.Each bracket was to have 2 shoulder screws.In the two packaged brackets I received, only one package had 2 shoulder screws.  The other had only 1 shoulder screw, and an extra standard screw.This makes one bracket unusable.  Not good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jon S.",
          "Nb_Reviews": 1,
          "Date": "2020-11-14T22:07:33.000Z",
          "Titre": "Works as desired, but delivery instructions were ignored.",
          "Contenu": "The package shipped fast and works as desired. However, I specifically asked for it to be hidden behind my garbage cans if I wasn't available to receive the package directly. (My residence is in a high-foot traffic area where porch pirates steal often.) My delivery? Left on my porch in plain site of any passerby and the busy sidewalk it sits next to! I received no knock on my door to ensure I safely got it, and no hiding of the package like I requested. I got lucky this time, but I won't be ordering from a company that doesn't ensure delivery instructions are adhered to."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Zach Schoen",
          "Nb_Reviews": 1,
          "Date": "2021-03-12T15:48:05.000Z",
          "Titre": "Sales email unresponsive",
          "Contenu": "Too early/lucky to weigh in on technical support, but Sales email still unresponsive since I asked on applying coupon code retroactively a few days ago.  Support responded quickly to direct my inquiry to Sales, then after I did that nothing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donald Bennett",
          "Nb_Reviews": 1,
          "Date": "2021-01-24T15:05:40.000Z",
          "Titre": "The Simply NUC website is misleading after the sale",
          "Contenu": "The Simply NUC website is misleading.  My original order was reported available in January.  I proceeded with the purchase (it was January) and the site noted the order was processing.  After 3-4 days to build as promised, I called to learn the item would not be ready for another 4-6 weeks. Note my credit card had been charged.  I changed the order to another similar item but received no link.  A nice lady helped track progress when I called, but her process insight seemed limited.  Overnight shipping was provided, and I learned the unit's led was not available (not mentioned on the site) the price was reduced to the same as my original order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "A Williams",
          "Nb_Reviews": 1,
          "Date": "2021-04-05T15:10:32.000Z",
          "Titre": "It's quite simple to order, but",
          "Contenu": "It's quite simple to order, but what to order is the issue.  Information about each product is difficult to find. Also, there isn't sufficient information about the differences in each product as you attempt to order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Clinton Majors",
          "Nb_Reviews": 1,
          "Date": "2020-04-10T14:19:06.000Z",
          "Titre": "Happy with the product I ordered",
          "Contenu": "Happy with the product I ordered, but the shipping cost wast ridiculous. bought a very small very lightweight fan could have fit in a standard size envelope paid more in shipping than the cost of the product for delivery within the same state."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carl L",
          "Nb_Reviews": 2,
          "Date": "2020-11-27T22:02:56.000Z",
          "Titre": "Slow shipping, average customer service",
          "Contenu": "Slow shipping. Didn’t have the thing I ordered me in stock and “recommended” a machine with much lesser specs. I appreciate the low price but customer service and communication could be better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 1,
          "Date": "2021-08-17T15:35:15.000Z",
          "Titre": "backorder policy",
          "Contenu": "I know that the semiconductor shortage isn't SimplyNUC's fault, but I wish they were a bit more straightforward about their policy on backorders.  They charge your credit card the full amount when you order the product instead of when it ships.  Most online retailers charge when they ship.  At some level, I don't mind their policy, but it would have been nice to know that that was the case upfront.  Perhaps a more reasonable compromise is to charge a nominal reservation fee like $100 or $200 instead of the full price of the product.  It makes me worry that I'm funding SimplyNUC's operations and that they could go bankrupt before my order ships.In the beginning, the Customer Service group would send periodic emails on the status of my backorder, which was nice.  But then the tentative ship date passed and there were no status emails of what was going on, which was concerning.  I ended up sending an email to check on status and they responded promptly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Newton",
          "Nb_Reviews": 1,
          "Date": "2020-10-22T22:44:03.000Z",
          "Titre": "expectation was an immediate shipment…",
          "Contenu": "expectation was an immediate shipment from a pre-configured system.  We needed to go buy a new system from the local best buy to cover out need."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kay S.",
          "Nb_Reviews": 1,
          "Date": "2019-02-04T02:24:54.000Z",
          "Titre": "Shipping costs are very high",
          "Contenu": "Shipping costs are very high, need a cheaper option. Shipping was 3x what I actually paid for the mounting plate I needed."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Kurt",
          "Nb_Reviews": 1,
          "Date": "2022-02-14T22:50:51.000Z",
          "Titre": "Worked very well!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Muhammad Umer Sadiq",
          "Nb_Reviews": 1,
          "Date": "2020-10-28T20:36:27.000Z",
          "Titre": "Shipment took too long to prepare"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T19:46:39.000Z",
          "Titre": "There is a build time that will delay delivery by 1-2 weeks.",
          "Contenu": "Machine setup was easy. All items delivered as promised. Communication was quick and polite. Good company to buy from. I paid for two day delivery but did not know there would be a one to two week delay due to build-up. It would be good to know that as I would have not paid extra to get it here quickly. They should state it clearly the delivery time so you can make a better decision on paying extra for fast delivery. Would have been 5 star otherwise."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven Fulcher",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T22:58:23.000Z",
          "Titre": "A product I could not find elsewhere at…",
          "Contenu": "A product I could not find elsewhere at a reasonable price.  A solid product, less expensive than the competition but more expensive than I wanted to pay; however, my client didn't mind in the least.  Overall, a good experience.  I cannot give five stars at this time because I am waiting on feedback from my client about the product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roger Wygant",
          "Nb_Reviews": 2,
          "Date": "2023-04-20T19:11:51.000Z",
          "Titre": "The tiny NUC replaced a…",
          "Contenu": "The tiny NUC replaced a server-board-based system with a pair of Xeons that I had been running since 2007, probably had a volume of 2 cubic feet.  The new NUC is somewhat faster than the ancient Xeon system, which had been upgraded many times.  The reason I am not giving 5 stars is that audio output initially did not work under Ubuntu/Kubuntu, I had to reconfigure the logical linkages in the audio system.  Also, once in a blue moon, the system will boot to a lockup, although I don't remember that happening since my latest BIOS update.  Good system, overall.  BTW, I've been programming anything programmable since about 1970, estimated to be among 500 most intelligent humans ever to exist."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TOM",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T01:04:31.000Z",
          "Titre": "Easiest set up ever.",
          "Contenu": "First order had a glitch with funds transferal but they resolved it in a timely manner. Second order was placed on a Thursday and it arrived  Monday noon.  Bought a new monitor hooked it up and powered up. Everything came up working. The only configuring I did initially was to put in my network password to have internet.The Ubuntu looks good and is sufficently functional but i will be spending much time configuring to the way I want it. So far it has been  easy and Gome's HELP has been helpful. I'm being spoiled."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Lohatepanont",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T23:17:50.000Z",
          "Titre": "Great Product, but lacking QC",
          "Contenu": "Good customer support and good perfroming product in the end. However, when the product arrived one RAM stick was not well seated and caused boot failure. I fixed it by reseating RAM myself and it booted well after that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jing J",
          "Nb_Reviews": 2,
          "Date": "2023-05-14T02:58:56.000Z",
          "Titre": "A couple minor issues",
          "Contenu": "Overall a good experience but a couple minor issues.First, shipping was initiated twice and the first tracking number was nullified but kept in communication and caused some confusion.Second, My attempts at fresh installation of Win11 repeatedly failed. There's no indication whether the issue was with Windows or the NUC itself. Eventually I did a search and found out there was a well known issue with Intel's latest network chipset and the non-trivial solution involves manual intervention in the Windows installation process, which may not be easy to understand and execute for a common consumer. Maybe a note regarding this in the package would have helped, but then it may scare off some buyers. Anyway, the end-to-end experience was not as smooth as I'd hoped for."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 1,
          "Date": "2021-11-30T19:39:35.000Z",
          "Titre": "The PC arrived fairly quickly",
          "Contenu": "The PC arrived fairly quickly.  I'm vbery happy with the quality of the product.  I would have given 5 stars except for the fact that when I ordered it, the website stated two-day delivery.  In addition you could pay extra for expedited shipping.  Glad I didn't pay for that.  The website should not state two-day when it's not."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Troy Gaisford",
          "Nb_Reviews": 1,
          "Date": "2021-10-26T15:17:35.000Z",
          "Titre": "Company kept me informed with multiple…",
          "Contenu": "Company kept me informed with multiple emails on delivery date with all the supply chain delays. The constant contact put me at ease with the company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-01-12T23:53:40.000Z",
          "Titre": "Great Service",
          "Contenu": "Great service. Emailed me updates on where my product was and when I might receive it. A shame that they no longer offer Device As A Service payments, otherwise I would give them a 5 star review."
        },
        {
          "Note": 4,
          "Lieu": "AR",
          "Pseudo": "Alejandro Perelman",
          "Nb_Reviews": 1,
          "Date": "2022-02-08T00:43:55.000Z",
          "Titre": "All the attention.was very good",
          "Contenu": "All the attention.was very good at every moment.It was not 5* because it shiiped 3 days later than expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Orb of Creation",
          "Nb_Reviews": 1,
          "Date": "2021-10-08T20:49:09.000Z",
          "Titre": "Excellent, but...",
          "Contenu": "Excellent, but some of the motherboard internal cables were disconnected or not ready, and they should have been."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rob J",
          "Nb_Reviews": 1,
          "Date": "2021-10-22T11:36:21.000Z",
          "Titre": "Good despite supply constraints",
          "Contenu": "Supply constraints made things challenging, but they were very accommodating. More proactive communication would have pushed it to 5 stars, but overall it was a good purchasing experience."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Michael Classen",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T05:39:32.000Z",
          "Titre": "Good company and people",
          "Contenu": "Great service i will buy product from them again in future"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 4,
          "Date": "2022-08-10T05:43:59.000Z",
          "Titre": "The service was great until I received…",
          "Contenu": "The service was great until I received my NUC.  The power cord had a euro plug and I had to splice a us cord."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BRYAN NOSEL",
          "Nb_Reviews": 1,
          "Date": "2021-12-11T00:59:40.000Z",
          "Titre": "NUC is awesome",
          "Contenu": "NUC is awesome. Use it for home studio mixing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Darren Mason",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T22:30:08.000Z",
          "Titre": "Fast shipping but survey is a bit…",
          "Contenu": "Fast shipping but survey is a bit spammy.  -1."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Cédric",
          "Nb_Reviews": 1,
          "Date": "2021-08-16T00:37:18.000Z",
          "Titre": "Excellent service, with a grain of salt",
          "Contenu": "Ordered a NUC during the pandemic, so the unit I ordered was back-ordered until the semi-conductor shortage was resolved. This was notified to me immediatly after the unit was ordered. The delivery went smoothly after it, and the packaging was pristine. The unit itself is beautiful and portable as well as very light.I still had to pay the unit price in full at order time, which was a bit of a bummer considering the fact that it was back-ordered."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Manwaring",
          "Nb_Reviews": 1,
          "Date": "2021-06-14T13:18:11.000Z",
          "Titre": "SimplyNuc service was very…",
          "Contenu": "SimplyNuc service was very professional, but I would have appreciated more clarity on the status of my order. My computer was backordered due to the silicon shortage, which is understandable, but they kept pushing back the expected delivery date instead of admitting that the timing was not yet available. Slightly frustrating, but I would definitely order from them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ulysses Acosta",
          "Nb_Reviews": 3,
          "Date": "2021-04-05T04:21:50.000Z",
          "Titre": "Delivered earlier than estimated",
          "Contenu": "Delivered earlier than estimated, however the estimate itself was given later than hoped and not at the time of purchase. All equipment and additional hardware arrived as promised and pre installed; however at the time of purchase there was no barebones option which I would have preferred. The website automatically registered and gave me a username at the time of purchase without alerting me to what the username was, nor did the site give me the option to choose a username."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Oha Bohi",
          "Nb_Reviews": 1,
          "Date": "2020-12-17T23:35:41.000Z",
          "Titre": "Pretty, pretty good",
          "Contenu": "Pretty, pretty good, just wished they had told me upfront that I was pre-ordering a PC. They let me buy it so I thought it was in stock at that time (they were just letting people order it, but they did not have a unit available yet). But I guess I should've been able to guess them having a top seller in stock on Cyber Monday was unlikely. But even still, fast delivery and they packed it with top-end parts. Great and speedy customer support too. Very satisfied."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mitch K.",
          "Nb_Reviews": 2,
          "Date": "2020-05-24T00:22:41.000Z",
          "Titre": "Amazing performance from such a small…",
          "Contenu": "Amazing performance from such a small box!Incredibly straight-forward process to build and order a NUC! Setup was 'simple' and everything worked right out of the box. Hard to believe all of that power can fit into such a small form factor! Things to work on...the piano finish on the top shows every finger print, change to a matt finish. The headphone jack on the front makes connecting speakers fussy."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "John Fuller",
          "Nb_Reviews": 3,
          "Date": "2021-02-13T16:56:55.000Z",
          "Titre": "The build was very easy and easily…",
          "Contenu": "The build was very easy and easily adjusted. The site was confusing as to prices. Having been asked where I was I would have expected that all costs would have been in the currency of my location. The payment not allowing PayPal was a big disappointment and almost caused me to cancel the purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Wang",
          "Nb_Reviews": 1,
          "Date": "2020-12-16T22:10:16.000Z",
          "Titre": "Purchase experience was fine",
          "Contenu": "Purchase experience was fine, expecting delivery today, which was reasonable for type of product.  There was a \"blackout\" after purchase with no email acknowledge of purchase, although credit card transaction was acknowledged by CC issuer.  Had to call in to confirm order was in process.  While waiting for delivery of components to SimplyNUC for final assembly, no acknowledgments, status reports or simply dashboard to confirm order was in process.  This lack of information was mildly anxiety provoking."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marty",
          "Nb_Reviews": 1,
          "Date": "2020-06-18T20:10:30.000Z",
          "Titre": "The customer service was friendly",
          "Contenu": "The customer service was friendly, although the shipping dept. refused to call me back, after 2 statements that they would do so.  Ultimately, the slower shipping time did turn out in my favor, even though I paid for priority overnight shipping, which was ordered friday around 7 pm, the part arrived Wednesday before noon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Hanson",
          "Nb_Reviews": 1,
          "Date": "2021-08-08T13:03:49.000Z",
          "Titre": "My nuc was back ordered for a while",
          "Contenu": "My nuc was back ordered for a while. I'm happy with the overall order. On the web site is is a little hard to see all the starting options due to the many models. I like nucs but do not know all the models out, or comming out soon. If I knew about the better models when I picked mine I would have gotten a better one. It is up to you to know what model you want then pick that number when building your nuc. I think you can see the different nucs, but the navigation could be more cyclical to make sure the user knows if there is a better one available. But overall very satisfied with my purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "robert forshaw",
          "Nb_Reviews": 1,
          "Date": "2019-06-11T21:19:11.000Z",
          "Titre": "I like the product but had to put in…",
          "Contenu": "I like the product but had to put in aftermarket hard drive and RAM since what was available was far more expensive.  After 7 happy years with my old machine it was amazing to see the superior graphics faster response time and it takes up, maybe 5% of the space my old full tower took.  I hope to get another 7 years out of my NUC as well."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Benny",
          "Nb_Reviews": 1,
          "Date": "2018-12-11T05:44:28.000Z",
          "Titre": "No automated email to confirm purchase",
          "Contenu": "No automated email to confirm purchase. Had to send a message to simplynuc after 5 days to get status of order. After which replies from several staff followed, which finally led to an email with shipping tracking number, which is what i really needed. But otherwise the product was in perfect condition and exactly as i ordered. Thank you"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Kyle",
          "Nb_Reviews": 1,
          "Date": "2021-01-09T13:30:28.000Z",
          "Titre": "Website needs update but great service!",
          "Contenu": "Your website needs to be updated. Password reset option is broken (resets access not password. There was a delay waiting for parts but other than that service was great when I called for updates. Also the price is a little high Thank you for everything"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff Townley",
          "Nb_Reviews": 1,
          "Date": "2019-05-15T14:47:19.000Z",
          "Titre": "All and all a very good experience",
          "Contenu": "All and all a very good experience.  My little NUC came with exactly what I expected.  Only thing I would improve is the web site.  It would be nice if the site provided a bit more information about the status of an order as it goes through the life cycle.  Not just an email once it ships."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LUC TRENTESAUX",
          "Nb_Reviews": 1,
          "Date": "2020-12-05T14:27:03.000Z",
          "Titre": "I ordered a NUC 7 on a Monday and…",
          "Contenu": "I ordered a NUC 7 on a Monday and picked overnight shipping as I needed it within a day or two. Unfortunately the PC had to be build to order which I didn't see clearly indicated online.I ended up calling for an update and received an answer right away. The team was able to provide a clear response and delivery estimate which they followed thru on.Overall a good experience. I just wish there was a bit more detail on the order status page with time estimate. Or alternatively a courtesy call/email, especially when rush shipping is picked, to let the customer know that the order is not yet ready to ship."
        },
        {
          "Note": 4,
          "Lieu": "AR",
          "Pseudo": "Bernardo Lanning",
          "Nb_Reviews": 1,
          "Date": "2021-08-15T20:49:52.000Z",
          "Titre": "Not for those in a hurry",
          "Contenu": "It's a good company, with quality products. The shipping time is slow; if you are in a hurry you might have a though time (In my case my nuc took almost 7 days to be shipped). Overall good experience, I will be buying again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paige C",
          "Nb_Reviews": 1,
          "Date": "2018-12-06T16:42:22.000Z",
          "Titre": "Very Satisfied",
          "Contenu": "Overall, I have had a great experience with Simply Nuc! They have been easy to work with and quick to help when dealing with replacements or any hardware issues. Our representative does a great job at reaching out on a frequent base and making sure we are satisfied and all is well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Philip Hess",
          "Nb_Reviews": 1,
          "Date": "2020-09-14T16:24:49.000Z",
          "Titre": "The product is first rate and performs…",
          "Contenu": "The product is first rate and performs as promised.  The only negative aspect of my experience was a delay in shipping the item.  It arrived about a month or more behind schedule and there was little if any contact in advance to advise about the delay."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JEFFERY RICHARDS",
          "Nb_Reviews": 4,
          "Date": "2021-03-20T15:51:37.000Z",
          "Titre": "Would have been 5 stars but the…",
          "Contenu": "Would have been 5 stars but the supplied vesa mounting plate didn't come with any mounting instructions and frankly doesn't appear that it can be mounted to the PC. I have an email in to SimplyNUC asking about this."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "En Sabah Nur",
          "Nb_Reviews": 3,
          "Date": "2021-04-07T23:54:46.000Z",
          "Titre": "There was quite a delay delivering my…",
          "Contenu": "There was quite a delay delivering my NUC, but SimplyNUC team did a great job keeping me updated on the status of the delivery. Very satisfied after receiving my NUC, exactly the specs and quality I ordered!Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 3,
          "Date": "2021-09-25T19:07:19.000Z",
          "Titre": "Good service even if you do run into issues.",
          "Contenu": "Originally I'd planned to buy from GameStop, however they were very uncommunicative about delays and were being supplied by SimplyNuc (SN) so I  decided to purchase directly from SN. In the long run I think that saved me a lot of trouble.SN was clear in it's communications about availability and shipped the product quickly. I did run into a small but important issue with the product and had to send it back for diagnosis/repair. This took a reasonable amount of time and the product was shipped back. Unfortunately, the power supply was missing and I had to request that be sent back as well, which SN did promptly.I believe If I had purchased through Gamestop and had to deal with thier support for my issue things would not have gone smoothly. The support staff at SN are great, knowledgeable, and helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 1,
          "Date": "2021-05-30T05:51:53.000Z",
          "Titre": "Good technical support, one delivery preference miscommunication",
          "Contenu": "I received really good guidance from tech support on early technical questions I had, since I am going to run an unsupported Linux on my Ruby.  All questions were answered promptly and accurately.When it came to shipping, though, I was told that FedEx \"would not take into consideration\" the delivery instructions I tried to give.  But then someone at SimplyNuc *was* able to make an instruction requiring a signature for delivery that I had not (and would not have) requested, which predictably resulted in me missing FedEx by about 30 seconds (I saw the delivery person vanishing down the walkway after I didn't mask and answer in time).  I had to drive to the FedEx hub a few hours later to fetch my \"delivery\" if I wanted to work on it over the long weekend instead of waiting, so ding one star for that snafu.Everything else has been good, Nuc arrived in pristine condition and booted into BIOS immediately, was configured exactly as ordered. :+1:"
        },
        {
          "Note": 4,
          "Lieu": "FI",
          "Pseudo": "Jose Mayorga",
          "Nb_Reviews": 2,
          "Date": "2021-09-17T16:32:37.000Z",
          "Titre": "They shipped the wrong item",
          "Contenu": "They shipped the wrong item, I got in contact with their customer service team and replaced the item without any hassle."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CQ",
          "Nb_Reviews": 2,
          "Date": "2021-06-22T15:28:23.000Z",
          "Titre": "Quick response from customer service",
          "Contenu": "Responded quickly to inquiries on product delays. Would like them to be more proactive on transmitting delays though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Vogel",
          "Nb_Reviews": 1,
          "Date": "2020-09-18T23:58:40.000Z",
          "Titre": "All parts and services were properly…",
          "Contenu": "All parts and services were properly handled. More or less expedient service. I think I’m missing a NUC9 flashlight :("
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom Lawson",
          "Nb_Reviews": 1,
          "Date": "2018-12-06T21:10:36.000Z",
          "Titre": "Good value-add manufacturing partner",
          "Contenu": "Good value-add manufacturing partner for Digium.  Easy to deal with.  Very responsive.  Ships on time.  Good quality."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donn Roberts",
          "Nb_Reviews": 1,
          "Date": "2021-04-17T14:19:20.000Z",
          "Titre": "Arrived in exactly 1 week from order",
          "Contenu": "Arrived in exactly 1 week from order, even though did not ship in the 1-2 business days as advertised."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jon C",
          "Nb_Reviews": 1,
          "Date": "2020-02-25T20:11:47.000Z",
          "Titre": "Machine is great",
          "Contenu": "Machine is great! Had one glitch while ordering that was corrected without intervention!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin Hadap",
          "Nb_Reviews": 2,
          "Date": "2021-08-09T02:03:03.000Z",
          "Titre": "The best of a bad situation",
          "Contenu": "I am a customer of the worst kind, likely.  Ordering a single barebones kit that probably doesn't do much for SimplyNUC's bottom line.  However, instead of complaining about the known supply issues from Intel, I tried to stick with them, as my order was originally placed on 3/10/2021, only to finally ship late 8/6/2021.  I in no way blame SimplyNUC.  I understand that they are not at fault for poor supply and unexpected demand for a niche product.  In fact, if anything, they did update me as expected, telling me when they thought new stock was coming in, updating when the stock did not come as expected, and even provided a free  gift card due to the unreasonable weight.  The staff was always friendly, reasonable, and professional.  LiveChat was also knowledgeable and professional.  Ultimately, when the item did finally come into stock a bit sooner than the last delay suggested, it was shipped overnight for no additional charge.I can't fault SimplyNUC for a supplier issue.  At the same time, since I have many computers and backups/whatever to hold me over, this wasn't a mission critical device.  I can't imagine how out of luck a consumer might be if this was a mission critical upgrade.  So I can't say it was a perfect experience.But SimplyNUC did do what they could, and then some, out of a bad situation.I will likely be ordering the NUC 12 Enthusiast kit from SimplyNUC on release - assuming, of course, that all goes well with the receipt of the Phantom Canyon NUC Enthusiast kit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "connor rauh",
          "Nb_Reviews": 1,
          "Date": "2019-06-27T17:42:06.000Z",
          "Titre": "All was good except 1 of the drives was…",
          "Contenu": "All was good except 1 of the drives was not pre initiated and formatted"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeffrey Queen",
          "Nb_Reviews": 1,
          "Date": "2022-07-10T18:23:42.000Z",
          "Titre": "Shipping delay otherwise good…",
          "Contenu": "Shipping delay otherwise good communication."
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "MS",
          "Nb_Reviews": 1,
          "Date": "2020-01-27T12:40:06.000Z",
          "Titre": "Good user interface on web site",
          "Contenu": "Good user interface on web site.  Never got a receipt."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 2,
          "Date": "2021-03-26T14:41:08.000Z",
          "Titre": "SD card does not work",
          "Contenu": "SD card does not work. Still able to work around."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Pietraszkiewicz",
          "Nb_Reviews": 1,
          "Date": "2019-09-13T23:21:39.000Z",
          "Titre": "Easy to navigate and get me to checkout!"
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "HANIF BIN",
          "Nb_Reviews": 1,
          "Date": "2021-02-02T05:33:38.000Z",
          "Titre": "Straightforward service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Panagiotidis",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T04:48:02.000Z",
          "Titre": "Nancy with SimplyNUC was very helpful, and informative.",
          "Contenu": "Nancy with SimplyNUC was very helpful and informative.  The very specific unit I was interested in was on backorder, I knew that when I began my inquiry.  The reason for the backorder was a manufacturer issue, and not because of SimplyNUC... but I really wanted this particular unit.  Nancy did offer me alternative choices to avoid the backorder delay.  By my choice, I continued with my original order and preference.  Nancy honored my preference and continued with the order. The unit was delivered in the anticipated timeframe and I am very pleased with the my new Intel Rugged Imbedded NUC... it works flawlessly for my specific application.Thank you again Nancy!!Satisfied SimplyNUC Customer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pavel Bacovsky",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T21:23:54.000Z",
          "Titre": "Great and reliable store.",
          "Contenu": "The shopping experience was excellent. Shipping was faster than expected and the store made themselves available if I needed any help (I didn't). Plus, the NUC was packed well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Goodwin",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T01:47:43.000Z",
          "Titre": "Onyx v9",
          "Contenu": "This is a well-designed system!  It exceeded my expectations! The order follow-up communications with Simply NUC were better than any recent online purchase experience, even Amazon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Thibault",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T18:20:51.000Z",
          "Titre": "You can purchase a modest system for home use and you will enjoy the small form factor very much.",
          "Contenu": "I have had a Simply NUC for several years. I am not a buyer or an IT professional. Nonetheless, I have always had a quick and concise response to the various questions I have had about systems and future purchases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Ranalletta",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T15:00:13.000Z",
          "Titre": "Easy to order.  Friendly people.  Fast startup.",
          "Contenu": "Once my web order was sent, the sales assistants kept me up to date on the status of my order.  The unit arrived fully populated with memory and SSD.  It has worked perfectly from startup.  I'm impressed with the quiet operation and smaller form factor.  I priced my Enthusiast at a local micro shop (barebones, with a basket of stuff to install).  SimplyNuc's price with shipping was marginally a bit more but the ease of startup was worth it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "for your order",
          "Nb_Reviews": 5,
          "Date": "2023-11-01T22:34:42.000Z",
          "Titre": "Service like you'll get no where else . . . .",
          "Contenu": "Performing a full reset/restore is always a bit unnerving.  Unanticipated events can occur.  So it's important to have reliable and competent allies to get you over the hurdles.  And as competent and reliable allies, Nancy and Alicia are as good as they get.  I was up and running in barely a day.  Considering some of the experiences I've had with other computer service providers - that is amazing.Great product (my NUC is nearly 5 years old!) and Great Service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Kim",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T21:50:53.000Z",
          "Titre": "SimplyNUC is an excellent Intel NUC…",
          "Contenu": "SimplyNUC is an excellent Intel NUC vendor. Recently, I needed to replace my main work PC that has served me well over the past years. The newly released Intel NUC 13 Extreme Raptor Canyon caught my attention. And, after some search, SimplyNUC appeared to be the best source to purchase my new PC. SimplyNUC communicated well and delivered flawlessly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T00:27:28.000Z",
          "Titre": "Positive Experience from a Company I hadn't heard of before",
          "Contenu": "Had a positive experience.Was looking for a mini-computer, decided on an Intel NUC 13.    SimplyNUC was linked from the Intel Website which is how I found them.   I ordered on a Friday night, received a confirmation on Monday morning, received a detailed email with shipping information Tuesday morning, and received the device itself on Wednesday afternoon.Device was in proper packaging (an Intel branded box) and had everything I was expecting.  Also included a VESA mount which I was not expecting.Normally I don't leave reviews but this is a company thats probably not super big or popular and they asked really politely.  I would absolutely consider this company again if I was looking to buy another mini-pc.   Can't really ask for much more than the way it went."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt McClure",
          "Nb_Reviews": 10,
          "Date": "2023-12-20T15:13:16.000Z",
          "Titre": "Great product and service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GL",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T20:10:45.000Z",
          "Titre": "Love These NUCs",
          "Contenu": "Love these NUC kits (2nd one I've purchased in 4 years).  I use it for productivity (software engineer).  Small footprint, and with kit, can add on quality mem and disk easily.  I don't game, so no opinion there.  Intel's driver support and the build quality are top-notch and super-easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vladimir Krymov",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T23:54:05.000Z",
          "Titre": "The Intel NUC 13 Extreme Kit is the best option I have found",
          "Contenu": "I am a MAC user, but from time to time I need an Intel based PC for work. The Intel NUC 13 Extreme Kit is the best option I have found, it has all the options I need and more. The quality is very high, the noise is almost non-existent, I love this system and I can customize it to my liking without paying for parts that I am going to replace. “Simply NUC” worked great - I received my NUC in 4 business days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jared T.",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T13:47:05.000Z",
          "Titre": "I needed a replacement NUC quickly to…",
          "Contenu": "I needed a replacement NUC quickly to keep a project moving. SimplyNUC helped find one they had in stock and got it out fast. Great customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T06:32:54.000Z",
          "Titre": "A NUC-12 for Roon",
          "Contenu": "I had been looking for a dedicated unit to serve a music stream via Roon. In particular, I wanted an i7 processor with suitable peripherals to accommodate a Roon Optimized Core Kit. After consideration of recommendations from Roon and several outside reviews, I settled on a NUC12WSHi7 to accomplish this with 2.5 GbE LAN, Wi-Fi 6E, and other features for future use.I found that Simply NUC satisfied all my checkboxes while looking at several companies. I have problems with the mobility of my hands, so putting in many of the internals was better left to Simply NUC, who provided  8 GB of memory, 256 GB M.2 SSD, and 1 TB of SATA SSD for a comparable price. The unit was easy to order and arrived within the week. It took 20 minutes to install the Roon OS, and now the NUC has been running on a shelf by itself in the office for a week, managing my music from several sources and providing a bit-stream for my network music player as desired. Occasionally, I log onto the server by its web interface to review the status and look at the log files; however, I have had no problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Zabriskie",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T23:51:30.000Z",
          "Titre": "They told me that there would be a delay, and it worked out great.",
          "Contenu": "They told me that there would be a delay when I placed my order. Abi in the sales dept was terrific and kept me updated on the status.  It did take longer than I expected, but again Abi's regular communication made up for it.  She also explained they needed some last-minute testing on the unit to make sure it was 1000% ready for customers.  I am very happy with the Moonstone computer and the purchase process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Turner",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T18:54:42.000Z",
          "Titre": "Quality Service for a great product",
          "Contenu": "I called to get a better understanding of the different machines available. Got affirmation that what I was looking to get was going to suit my needs perfectly. Got a quote on price and time, price was spot on and time was delivered well under what I was expecting! I now have a reasonably priced rig for gaming and training simple NNs, Couldn't be happier!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darren",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T01:09:00.000Z",
          "Titre": "Great product and service",
          "Contenu": "Replaced an 8 year old mini-tower with an Intel NUC 13 Pro (which is an impressive little machine). Since this was a replacement for an older computer which died abruptly, I am greatly appreciative of SimplyNUC's quick order fulfillment. I had placed my order via chat/email late Friday, it shipped Monday, and was in my hands before noon on Tuesday. Nancy was super helpful answering my questions and assisting with my order. Will definitely buy from SimplyNUC again!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Pawel Wrzesinski",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T17:28:35.000Z",
          "Titre": "Online store easy to navigate and has…",
          "Contenu": "Online store easy to navigate and has all relevant information making the purchase easy and fast . Rachel reached out to me right after order was placed ready to assist with any questions we may have . Order was shipped SAME day which i find it impressive considering other stores can't give you exact date and some tell you wait could be 14 business days . Recommend SimplyNuc 100% and will be back to shop more soon !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Very Old Computer User",
          "Nb_Reviews": 7,
          "Date": "2023-04-18T16:52:21.000Z",
          "Titre": "Definitely a Five Star performance!",
          "Contenu": "What a great experience ordering my computer with Nancy!!  Very easy process with guidance about upgrading critical parts for only a few dollars more. Thank you Nancy!  Also liked the follow-up emails to see how the delivery went (which was very quick) and how the computer was working. Going to really enjoy the computer with a \"real\" video card installed! Definitely a 5 star experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clint L",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T19:59:35.000Z",
          "Titre": "This NUC keeps working",
          "Contenu": "This NUC keeps working. I leave this computer on 24/7, it has no problems, it never breaks. Lots of connectivity.I've installed Windows 10, Ubuntu, Mint, Suse & all worked w/ no issue. I dont have any complaints"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 2,
          "Date": "2023-02-28T22:41:20.000Z",
          "Titre": "Ruby works well. Good customer service.",
          "Contenu": "No issues with my Ruby after about two years. Good customer support. There was a minor hiccup when I ordered with Linux installed, and apparently they didn’t have the image ready or something. But I was planning to wipe the drive myself anyway, so no big deal. They communicated well, changed the order to a different option, and gave free expedited shipping. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andan",
          "Nb_Reviews": 2,
          "Date": "2023-02-07T18:05:03.000Z",
          "Titre": "Had a great experience with SimplyNUC",
          "Contenu": "Had a great experience with SimplyNUC. I ordered during the long, covid-impacted supply chain problems, and SimplyNUC communicated very well about it. As to the product, it’s fabulous. My Panther Canyon model chugs away as my household Linux server doing hw transcodes for Plex, hosting Too Many Minecraft servers etc etc. Great stuff. Great company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffersen Sylvia",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T20:26:27.000Z",
          "Titre": "Intel NUC Extreme Dragon Canyon i9",
          "Contenu": "I worked with Abigail Ince to walk through a few questions, and to select/spec out my new machine.  I ended up choosing the Intel NUC Extreme kit with the Dragon Canyon i9, 64GB of Memory, a 1TB SSD, and the AMD Radeon RX 6600 XT.  This thing is a DREAM to run.  I actually use this for my work as a Cyber-Security Architect, and have it Dual Booted with Windows 10 LTSC 2022, and Kali Linux.  Both OSes, and all my utilities, just flat-out FLY on this machine, and I couldn't be happier.  :-)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Frey",
          "Nb_Reviews": 2,
          "Date": "2022-12-20T18:40:47.000Z",
          "Titre": "Great product and service",
          "Contenu": "Orderd on 12/8, received a call shortly after I placed the order.  Erik probed to find out the usage/purpose of the machine and, without any sales pitch, offered a better solution for my application.  Even with a price adder, I understood his logic, and accepted his advice.  He is the professional after all.The rest is history.  Now the brass at my company will be looking for these Nuc units when we outgrow our HP prodesks.Nevertheless, even with the upgraded options, my unit arrived on the 16th, exactly as ordered, and exactly as described.  What an awesome transaction.Thanks again Erik!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MK",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T21:12:33.000Z",
          "Titre": "SimplyNUC, Nicole, and Nancy",
          "Contenu": "SimplyNUC's sales admin managers are incredible. Nicole McClure and Nancy Bui are a big reason for my purchase – throughout the purchasing process they were patient, knowledgable, enthusiastic about my use case (gaming), and genuinely wanted to provide the best experience and end product. They were super responsive and always friendly. Definitely gave confidence to feel supported and know that I was buying a product with such a high functioning team behind it. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T Kuchta",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T20:56:15.000Z",
          "Titre": "Fanastic Service",
          "Contenu": "The Sales Admin team was fantastic. I needed to adjust the delivery date due and they were able to reverse the shipment, have the computer checked for damage upon return to SimplyNUC, and then deliver on the new date. Great customer service and prompt communication both through email and phone made this change very smooth."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Lu",
          "Nb_Reviews": 2,
          "Date": "2023-01-13T23:44:20.000Z",
          "Titre": "My NUC Phantom Canyon is a great gaming PC",
          "Contenu": "I really enjoy using my Phantom Canyon for gaming. I am always impressed with how much performance can come out of such a small machine. I can use it for gaming, streaming, watching streams, and voice chatting all simultaneously without any performance issues.My one complaint would be around the default \"skull\" motif of the machine. I had to disable both the LED skull and the startup one via the bios, and I think these should be easier to turn off, or more so I think NUC should remove this style of branding all together. It does not make it look more \"tough\" , it kind of comes across as creepy and lame (from my opinion). I believe more people would buy these systems if these were removed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Henry Carlile",
          "Nb_Reviews": 3,
          "Date": "2023-03-16T17:02:02.000Z",
          "Titre": "Prompt Support",
          "Contenu": "I appreciate the prompt response from Simply NUC.  It turned out the problem was my own to solve.  Everything works as it should but for one new problem.  I assume it must be the computer's security features that have disabled the options to copy and paste or take a screen shot of its system specifications. I'm having problems with a flight simulation program, and Steam's technical staff won't help me unless I can reproduce those specs for them.  I've tried typing them and sending them as an attachment.  No go.  I wish Simply NUC and/or Windows would address this, as other users are having the same problem, and none of the solutions I've read online have worked to solve it.  However, I blame Steam's draconian policy most of all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "G Brant Cafferty",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T07:53:34.000Z",
          "Titre": "A very wonderful sales experience!",
          "Contenu": "I am so grateful and impressed with my ordering experience at SimplyNUC, Inc.  Their sales rep, Rachel Vincent, was most helpful in helping me understand their new product the NUC 13 Raptor Canyon, and helping me pre-order and set up this product with the components that would meet my needs. She was most understanding and generous with my smallest requests.  I am looking forward to the time that my product arrives some time in the 1st quarter of 2023."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Paul Hawkins",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T22:49:05.000Z",
          "Titre": "Delivery fine.  Almost SCAMMED!",
          "Contenu": "On Sept 18th  I got a recorded call claiming to be from FedEx.  They knew my tracking number and shipping date and said that FedEx was no longer collecting payments for taxes and duty at the door. They then suggested I press 1 and speak to an agent who would put the outstanding amount on my credit card.  I almost complied until I realized it was a SCAM.  Be careful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 6,
          "Date": "2023-04-05T18:26:18.000Z",
          "Titre": "Fast and Quality customer service",
          "Contenu": "Simply NUC was awesome at getting the computer to us quickly and when we had a problem with a noisy fan on boot up the technician guessed right away what the problem was and walked me through how to fix it.  It was just a loose cable interfering with the fan.  Of course it would have been nice for them to find this problem in QC before it went out the door but at least they made it quick and easy to take care of the problem.  I'm totally happy with the product and their attention to making sure we were happy with the experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony M",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T00:21:30.000Z",
          "Titre": "Helpful customer service",
          "Contenu": "Helpful customer service! Very pleased with the WallStreet Canyon product. Worked first up with the preloaded Windows 10 Pro. I installed additional storage albeit off-board using an enclosure that takes an M2 card an connects via USB3 to the NUC."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J. Peterson",
          "Nb_Reviews": 2,
          "Date": "2023-01-10T23:07:13.000Z",
          "Titre": "Great place to purchase NUC machines.",
          "Contenu": "Latest & Greatest product was delivered ahead of schedule. Good selection of configuration options. Everything was delivered as expected. Phone calls were answered by knowledgeable people. Would definitely shop there again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tonna Powers",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T19:58:31.000Z",
          "Titre": "Hands down best service experience!",
          "Contenu": "The customer service for SimplyNUC was out of this world!  After receiving the product, I needed a few things for my district.  Within minutes of contacting the company, I had answers, solutions and all with kind communication.  Thank you for your impeccable service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 2,
          "Date": "2023-03-17T18:33:54.000Z",
          "Titre": "Extra power source for NUC 11",
          "Contenu": "The product, performance, and delivery were great, and just as advertised!   My only gripe would be the cost of shipping.  The original on-line estimate was $14.00.  When I placed the order, the only option available was 2 day shipping for $34.44.  As this product was intended to be an extra, I didn't need it that quickly and would have preferred having another option and not being forced to pay an extra $20.44 for expedited shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TC",
          "Nb_Reviews": 3,
          "Date": "2023-05-22T20:24:58.000Z",
          "Titre": "SimplyNUC is the best!",
          "Contenu": "I have purchased 7 different NUCs from Simply NUC for my office workstations and they have always been clear in their communication, especially when items have been back ordered and customer service answered any/all questions I had regarding back ordered items.  Shipping has been extremely fast and items show up when they are expected.   I will definitely be buying more of these great little machines from SimplyNUC!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "L. McCoy",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T00:01:58.000Z",
          "Titre": "Bought TWO computers and love them!",
          "Contenu": "I bought a small-footprint PC for my office and loved it so much I bought another one for home.  The sales associate was very attentive, and both computers arrived very promptly after the order. Both computers are plugging away now some three years after purchase. I could not be happier with this company or its products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Curtis Oscarson",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T18:34:43.000Z",
          "Titre": "A genuine partner in PC sourcing.",
          "Contenu": "If you are an IT manager or procurement specialist or really anyone buying computer hardware, this company is the best. They have actual humans that will dig in, understand your concerns and become part of your team as they figure out the best solutions for you. Then they will configure, assemble and deliver to each location that you need. Amazing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd B.",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T03:42:42.000Z",
          "Titre": "NUC 11PAHi7 for astrophotography",
          "Contenu": "I've been running this NUC, specifically for astrophotography, for over a year now and it really has been a great machine from the beginning. My questions were answered quickly and the product shipping was fast. I will order another NUC in the future and when I do, it will be from SimplyNUC. Fantastic support!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Albert",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T19:20:28.000Z",
          "Titre": "Simply The Best",
          "Contenu": "Super friendly, fast, and highly personalized experience. They really tried to find out what I needed, provided great options, and sent it out asap. Definitely buying more units from them very soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken Brownfield",
          "Nb_Reviews": 1,
          "Date": "2022-10-13T22:29:51.000Z",
          "Titre": "Topaz 2 is very nice",
          "Contenu": "Great product, and shipped quite quickly! For Linux, for best results update to the mainline v6 kernel, but everything works great.I do wish that the Simply NUC Configurator would work with Topaz 2; it looks like the new product doesn't have a `dimensions` property which breaks the configurator add-to-cart."
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "Nerd",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T17:41:46.000Z",
          "Titre": "happy owner of multiple NUCs",
          "Contenu": "I have owned at least three different NUCs from SimplyNUC, including a Phantom Canyon, a NUC12TZi5, and a NUC11PAHi5.  The service has been excellent.  When the NUC12TZi5 failed due to a power issue, they replaced it immediately at zero cost to me (except shipping it to them)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben Chatelain",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T19:16:40.000Z",
          "Titre": "Dragon Canyon",
          "Contenu": "I am very pleased with my dragon canyon! I had a little NUC in the past from a less-reliable vendor and had nonstop blue screens from both the memory and SSD. Sent that one back. I was excited about the new dragon canyon model and needed a powerful windows PC for compiling our SDK so I took a chance on getting another NUC but SimplyNUC came through with quality parts!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Corey Kosak",
          "Nb_Reviews": 1,
          "Date": "2022-09-04T06:43:59.000Z",
          "Titre": "Great buying experience with SimplyNUC",
          "Contenu": "I ordered a Dragon NUC preconfigured with all the bells and whistles. SimplyNUC was excellent at communication with me, letting me know about the expected delay due to supply chain issues and offering to work with me for an alternative in case I needed something sooner. But I waited for the Dragon NUC (for me, it arrived about six weeks since I placed the order) and I have been very happy with it! I would do business with them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Healy",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T17:05:41.000Z",
          "Titre": "Fast and prompt service!",
          "Contenu": "SimplyNUC is very knowledgeable about the systems they sell. They are able to find a particular product to fit your needs or even just answer sometimes complex questions about a product either by chat or email. The quality of the end product is always top notch! Thank you and can't wait to get my next upgrade from you guys!"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Edson Kitani",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T01:31:55.000Z",
          "Titre": "Satisfaction with the sales department and negotiation process.",
          "Contenu": "I am really satisfied with the product and, mainly with the negotiation process with Symply NUC. Mr. Freitas was gentle and comprehensive about our bureaucracies here in Brazil. He helped me a lot to accomplish our demands. The product is computationally powerful and will meet our technical requirements in R&D."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed Allaoui",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T03:12:31.000Z",
          "Titre": "Very good experience",
          "Contenu": "Very good experience. The team was able to accommodate my timeline and stayed very responsive throughout the process, keeping me in the loop on the progress via email directly. Highly recommended, product works perfectly too!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Andrew Hansen",
          "Nb_Reviews": 4,
          "Date": "2023-12-06T02:56:22.000Z",
          "Titre": "Got an awesome rig at a great price",
          "Contenu": "Got an awesome rig at a great price. Bery happy with purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T21:42:10.000Z",
          "Titre": "Customer for life",
          "Contenu": "Responded quickly to questions before I placed my final order.  Provided pdates on my order status. NUC arrived earlier than expected and was correctly configured to my requested specs.  The included VESA mount hardware worked flawlessly with my monitor.  I highly recommend SimplyNuc."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "vJoeG",
          "Nb_Reviews": 1,
          "Date": "2022-02-06T15:22:13.000Z",
          "Titre": "First class service and quality product",
          "Contenu": "Nicole was on top of my order from day one and when supplies caused a long wait for the original Topaz I wanted she was right there to offer a comparable model which was delivered within the week and is already deployed in my lab. Only one NIC but not a show stopper. Thanks a million for such first class service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DrivenMP",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T17:19:44.000Z",
          "Titre": "This was a very positive experience…",
          "Contenu": "This was a very positive purchasing experience, we had originally been told that due to the supply issues, there may be up to a week delay on getting my new PC and I received it within 3 days. I was kept up to date on everything and had a very responsive team so much so that my IT staff was even impressed at the level of customer service. Great job SimplyNUC!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Max Holmark",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T00:36:19.000Z",
          "Titre": "Great service and product",
          "Contenu": "I recently purchased the Intel NUC 13 from SimplyNUC. The purchase process is simple and straightforward. Great support, big thanks to Nicole who helped me to link my order to my account that was created after the purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "L R Kalajainen",
          "Nb_Reviews": 2,
          "Date": "2023-01-17T18:08:41.000Z",
          "Titre": "I have two NUC-10s--one with 16 gb Ram…",
          "Contenu": "I have two NUC-10s--one with 16 gb Ram that I bought about four years ago and use for general computing and word processing.  The other with 32Gb Ram for photographic editing, I purchased about two years later.  Couldn't be happier with both.  Both have all the ports I need. Completely trouble-free so far.  Fast, quiet, and small on the desktop.  I love them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Wheat",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T18:37:41.000Z",
          "Titre": "Happy Customer",
          "Contenu": "Could have been faster, but overall, I am happy with the PC. And I expect that most of the delays were out of Simply Nuc's control. I am just getting started with the unit, but it so far is exactly what I wanted."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Paul Fenton",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T03:01:29.000Z",
          "Titre": "Topaz 2 i3 -1215U shipped to Canada",
          "Contenu": "Their website order for a topaz 2 NUC did not work correctly for me (a Canadian customer), but Nicole was quick to notice something was wrong, and went to great lengths to correct the problem. And since that took a couple of days, she gave me a good deal on the Windows 11 (which the original order missed) and upgraded my shipping to overnight. I was very impressed. But even more impressed with the quality and ease of setup of the NUC. I was up and running w 3 UHD monitors in less than 15 minutes! True plug and play. Thank you Nicole for your great help"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathan",
          "Nb_Reviews": 2,
          "Date": "2023-02-03T19:55:53.000Z",
          "Titre": "I bought the porcoolpine i7 to run my…",
          "Contenu": "I bought the porcoolpine i7 to run my mobile monument engraving service and it's exactly what I needed.  Was expecting to recieve it in a week or better but pleasantly surprised to see it ship out next day.  Very happy with my purchase"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Toby",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T20:15:50.000Z",
          "Titre": "SimplyNuc Delivers Quality NUCs",
          "Contenu": "I bought a NUC kit and assembled it myself years ago.  This time around I let SimplyNuc take care of everything and ship me the finished product.   It was the right call.  Not only did they have access to parts that were unobtanium on the retail market, they did a great job with the build, and delivered it on-time.  My new NUC is a beast and I did not miss the time and frustration of building it myself one little bit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pradeep Sekar",
          "Nb_Reviews": 2,
          "Date": "2022-10-26T04:25:52.000Z",
          "Titre": "Five stars to SimplyNUC Products and Service",
          "Contenu": "Five stars to SimplyNUC for a) Shipping my machine super quick when I wrote to their support team b) Have their support team respond instantly when I needed help with installing Windows. The NUC PC is simply superb - and that has become the minimum expectation from them - given their reputation and my prior experience with them a few years ago. Very satisfied - will shop again for their superb products and service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle S.",
          "Nb_Reviews": 1,
          "Date": "2022-12-25T19:49:30.000Z",
          "Titre": "Best customer service of any company…",
          "Contenu": "Best customer service of any company I’ve shopped with in a long time. I don’t think I’ve ever gotten a proactive phone call from an online order to discuss lead times before."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Collin Austin Cox",
          "Nb_Reviews": 2,
          "Date": "2023-02-08T01:51:13.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "I have been building computers since I was a teenager and have reached a point where I don’t have the time or energy anymore for the fiddling. I want to buy it, sit down, use it, and call someone else when there’s a problem. I decided on a prebuilt with a warranty and found my way to the NUC platform due to the size/performance ratio. So far I couldn’t be more pleased. Easy, no effort, no mess. Nancy, my customer service contact, has been wonderful. Super prompt, quick with responses and follow up. Really a great customer service experience and exactly what I was looking for with a prebuilt. Technology customer support is always hit or miss but I feel very confident given my experience so far. Not one regret. The build itself is also great of course, good component choices and it’s nice to not cross check QVL lists and whatnot to assemble a build. Would do it all over again for sure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy Allmon",
          "Nb_Reviews": 2,
          "Date": "2022-02-28T00:48:10.000Z",
          "Titre": "Happy customer",
          "Contenu": "I've been very happy with my purchase of a NUC11TNHI5HL from SimplyNUC.  The website is very organized, and online NUC configuration options plentiful and easy to follow.   In my case the NUC that I originally purchased was on-back order due to the lack of supply these days.  It was easy to contact a sales team member and we worked together to come up with an extremely similar NUC that could be delivered quickly.  They kept me updated via email updates on progress and I received the new machine in 5 days!   I had multiple discussions with the Sales team and they were always professional, helpful and friendly.  And of course the NUC is working great. I'd definitely purchase from SimplyNUC again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Guido",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T22:28:09.000Z",
          "Titre": "SimplyNUC was great to work with",
          "Contenu": "SimplyNUC was great to work with. Their sales staff was knowledgable about the components in their devices and quickly prepared me a quote. Once I paid for it, the device arrived ahead of schedule. It was clearly professionally assembled and worked without issue and as advertised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ANIL MAHADEV",
          "Nb_Reviews": 2,
          "Date": "2022-09-20T00:26:53.000Z",
          "Titre": "First Class Service from the very start to the Sale",
          "Contenu": "An absolute delight!From the very first contact with Charlotte on day 1 till the date I placed my order, I have nothing but great things to say about SimplyNUC's Team.They were patient throughout the process.No pressure sellingThey listen! Again They Listen! to the customer.For me being a bit too much Research oriented.Charlotte was very meticulous from the get-go till the sale. I highly recommend this company! I can't wait to receive my NUC!Give them a shout-out for all your NUC needs!Cheers!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christine",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T18:21:15.000Z",
          "Titre": "Customer service was great",
          "Contenu": "Customer service was great.  They gave me great updates on my order even with supply chain delays.  I can understand delays but communication is key.  The follow-up to make sure I got the product was fantastic to ensure they met my needs. I appreciate the individual attention."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher McCoy",
          "Nb_Reviews": 1,
          "Date": "2022-09-10T00:29:15.000Z",
          "Titre": "Super happy with these folks",
          "Contenu": "Super happy with these folks. Good product. Already ordered once before. Will order again. Supply chain difficulties are still present, but they were wonderful in letting me know an honest time things would be ready to ship."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron R.",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T21:47:56.000Z",
          "Titre": "Would totally recommend",
          "Contenu": "1.  The NUC is great.  Zero issues in first 5 days.2.  I got a real person on the other end of the email who was able to help clear up shipping concerns.  Good follow up as well.3.  Exceeded expectations during the holiday season."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TYLER",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T17:04:06.000Z",
          "Titre": "Had a good conversation with the…",
          "Contenu": "Had a good conversation with the support team before ordering. Wish they provided bulkhead plates for the smaller racks. Product came looking great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Seymour",
          "Nb_Reviews": 1,
          "Date": "2023-02-19T03:47:40.000Z",
          "Titre": "great experience before and after sale",
          "Contenu": "My order was shipped quickly, quicker than the estimate given. Also, I had asked customer service a few questions before ordering, and everyone was very nice and answered my questions. I would definitely order from SimplyNUC again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger N.",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T16:24:44.000Z",
          "Titre": "I love the NUC product",
          "Contenu": "I love the NUC product, and the team was very responsive to inquiries."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron Quiroz",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T21:25:58.000Z",
          "Titre": "They were very straight forward",
          "Contenu": "They were very straight forward. Said it might take  few weeks to get the PC out to me. But had it ready in a few days and overnighted it to me."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Eric Fauque",
          "Nb_Reviews": 2,
          "Date": "2022-12-07T21:58:22.000Z",
          "Titre": "Fast shipping and great customer service",
          "Contenu": "Order was shipped super fast to Canada.Customer service was very helpful in resolving an issue regarding international sales.(At check out, configuration and price was different from what I ordered).Customer service called me before I even had time to call them, and fixed the issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven O'Neal",
          "Nb_Reviews": 1,
          "Date": "2022-07-26T03:01:36.000Z",
          "Titre": "The Ruby has been an exceptional…",
          "Contenu": "The Ruby has been an exceptional platform for running a SIEM for my home lab. It has a 1 Gig NIC which works well for a management port and a 2.5 Gig NIC which works great for a monitor port. Installing the OS was easy as well and it has the resources to handle the traffic I send to it. I would highly recommend building one of these out for any home lab addition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anil Mahadev",
          "Nb_Reviews": 2,
          "Date": "2022-10-17T20:13:15.000Z",
          "Titre": "Serpent Canyon - Excellent Choice - Service - From first call to the final sale!",
          "Contenu": "The Serpent Canyon - My fav NUC! Charlotte from the very first call to the final sale.. We went back and forth! She remained patient and always remained in contact with questions answered.I am pretty stoked.. about my Serpent Canyon! It comes with the latest Intel ARC GPU and I already am creating some excellent 3D models.Overall, so far very happy with the Purchase.I really love my NUC!The folks at SimplyNUC are amazing! You are not just a number! They treat you like Family!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Betty",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T00:20:33.000Z",
          "Titre": "Love the selections and the prices of…",
          "Contenu": "Love the selections and the prices of these Intel NUCs. My old one finally stopped working and Nicole M. (from online chat) was a huge help with my questions. She was able to help me with getting my order processed quickly. My order shipped the next day!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris L",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T22:16:11.000Z",
          "Titre": "Purchased a Phantom Canyon on sale and…",
          "Contenu": "Purchased a Phantom Canyon on sale and couldn't be happier. SimplyNUC's communication was great and provided updates every step of the way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Midford",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T20:05:19.000Z",
          "Titre": "I had no difficulties",
          "Contenu": "I had no difficulties.  I submitted my on-line order, got an email back early the next business day.  They quoted a one week lead time.  A week and a day later I was informed it was shipping and it arrived the next day (though I only paid for 2-day shipping).  It was well packaged, though the inner product box was a little difficult to open"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pawel Wrzesinski",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T17:50:17.000Z",
          "Titre": "Quick turn around time & personal assistance",
          "Contenu": "Quick turn around time for computers - personal follow up from customer service rep and timely updates with fast delivery ! Top Notch"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vili",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T16:42:47.000Z",
          "Titre": "Fantastic Service",
          "Contenu": "Personable employees, fantastic assistance. Cannot recommend them enough for helping me get a reliable and sturdy solution. When an item I ordered ended up being delayed, they assisted in finding a comparable solution within my price range."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony Brenke",
          "Nb_Reviews": 2,
          "Date": "2023-06-03T17:37:31.000Z",
          "Titre": "Love the PC I bought",
          "Contenu": "Love the PC I bought. There are 3 fans on the unit. One of they hits the case someplace. It never runs durring normal operation but it does as startup. I though about diving into it and fixing but it has not been a big enough deal. Pc runs cool and it is not realy an issue."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Joshua Richard",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T01:45:05.000Z",
          "Titre": "Overall great experience",
          "Contenu": "Overall great experience! The shipping was fast and SimplyNUC kept me informed the entire time about my purchase I would highly recommend them for your next NUC"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T22:43:50.000Z",
          "Titre": "Awesome experience!",
          "Contenu": "I had the pleasure of working with Amada. She took the time to answer or show the documentation around the techical questions I had.  I would absolutely do business again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JPAN Townsend",
          "Nb_Reviews": 1,
          "Date": "2022-09-07T21:07:42.000Z",
          "Titre": "Great Service",
          "Contenu": "My experience with the company has been great so far. The website is pretty easy to navigate. The ability to customize my computer was a huge selling point for me. They shipped it when they said they would. The only thing that I will not be able to review is customer service as I have not needed it yet."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Hopkins",
          "Nb_Reviews": 2,
          "Date": "2022-09-29T18:28:46.000Z",
          "Titre": "Nuc Home Base Media Server…",
          "Contenu": "The Nuc Home Base Media Server works well as a Plex server. I have the pro model with 10tb SSD. In one small box I have everything I need, the Plex server a tuner and the Plex DVR. It came with Windows 10 which good in my situation. I got the Plex life time subscription which was around $120, and a Samsung smart tv. So far I would say the Nuc is probably the easiest way to get a home media server up and running."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CGJ",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T17:10:09.000Z",
          "Titre": "Excellent experience with SimplyNuc!",
          "Contenu": "I ordered two new NUCs.  Both systems arrived quickly and on time.  After two months of use, both are functioning well.  Excellent experience with SimplyNuc!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miguel De Rivero",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T17:19:16.000Z",
          "Titre": "Excellent service and good prices with…",
          "Contenu": "Excellent service and good prices with multiple options. I received my NUC much faster than promised. Definitely I will buy again from SimplyNUC."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Anestis",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T19:53:31.000Z",
          "Titre": "The SimplyNUC is SimplyGREAT!",
          "Contenu": "The SimplyNUC web site makes it very easy to configure to your exact specifications.  Then they deliver the product so FAST!  I was very pleased and impressed.  My main PC was failing fast, so I needed to get something a.s.a.p. and SimplyNUC delivered!Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mnre.lears.acchr",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T16:44:56.000Z",
          "Titre": "Amazing boxes, great prices, the best service ever.",
          "Contenu": "I'm a Linux developer who has an unhealthy obsession with refresh rates, especially for someone who looks at text all day.I went into this shopping experience looking for a little box for app development that was capable of driving 2x4K@120Hz, with a powerful processor and 64GB of RAM. NUCs quickly showed up as good options, and SimplyNUC was consistently well-reviewed, so I gave them a shot.I thought my specifications would be a big ask, but SimplyNUC's model browser helped me narrow down their offerings and find a NUC12WSKi5 build that I could customize to be absolutely perfect. It was cheap, it was delivered very quickly (despite their lead-time warnings, it took five days from purchase to doorstep) and it was exactly as advertised.SimplyNUC is amazing. Their listings are comprehensive and accurate; their prices are competitive; and their customizable builds with itemized prices are top-notch. Their customer service is great, too -- I missed the first delivery attempt, and SimplyNUC called to let me know before FedEx did.Will find an excuse to buy again."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Darrell Smith",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T18:18:57.000Z",
          "Titre": "SimplyNuc is Simply the Best!",
          "Contenu": "SimplyNuc gets it done everytime.  I've ordered a dozen machines from them now. I'm grateful for predictable performance and great support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shannon",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T01:58:25.000Z",
          "Titre": "Not only did I get absolutely great…",
          "Contenu": "Not only did I get absolutely great customer service, but the shipping was extremely fast. So happy with my products and will be back for future purchases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T21:13:23.000Z",
          "Titre": "First time buying a NUC",
          "Contenu": "First time buying a NUC and Nancy was super communicative and helped throughout the delivery process!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerall Kahla",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T01:22:30.000Z",
          "Titre": "Great Service",
          "Contenu": "Helpful, supportive staff. It's not a business where you can sell products that are substandard. The service from SimplyNUC is what made things great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T18:42:04.000Z",
          "Titre": "Exceptional product and great service",
          "Contenu": "Exceptional product and great service.  I worked with Kimberly Schiller and she was wonderful answering all of my questions and keeping me informed on my delivery. A++"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Grayson Edge",
          "Nb_Reviews": 2,
          "Date": "2023-09-25T14:00:42.000Z",
          "Titre": "Quickly resolved issue",
          "Contenu": "There was a SATA cable missing from the box. SimplyNUC overnighted the cable. Amazing customer service!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Bill Mustard",
          "Nb_Reviews": 2,
          "Date": "2023-01-17T21:51:38.000Z",
          "Titre": "Fast competent service",
          "Contenu": "The device arrived quickly after my order and everything works as it should.I did have a bit of an kerfuffle with getting it through the border which delayed the arrival by 3 days. Not SimplyNUC's problem though."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lab Rat",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T03:36:11.000Z",
          "Titre": "NUC SPEAKS FOR ITSELF!",
          "Contenu": "I had a great experience with SimplyNUC.  Nancy promptly communicated receipt of order and ETA.  NUC came as ordered/customized in new condition.  Mustafa quickly helped troubleshoot minor technical issue.  Superior and responsive communication throughout.   Thank you SimplyNUC!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Wichlacz",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T18:14:45.000Z",
          "Titre": "Great product",
          "Contenu": "Great productI'm using the product as a small ESXi server for my home lab and it works great.  Real space saver and low power consumption."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Chapman",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T06:52:40.000Z",
          "Titre": "Strongest Recommendation for NUC 13th Gen Raptor Canyon",
          "Contenu": "On February 27, 2023 I installed the third NUC I've bought from SimplyNUC. Previously I'd bought 6th & 11th generation systems. This time I got a NUC13RNGi9, Raptor Canyon, i9-13900K, 64GB DDR5, 1TB & 2TB PCIe Gen 4 M.2 SSDs and an additional 92mm fan with Windows 11 Pro.I work with Strategic Account Manager Matt Boone who always provides me with service way beyond what's required or expected. He's a big part of the reason I've continued to purchase from SimplyNUC. Not only does he not upsell, but at times he even suggests less expensive parts. For example, this time he said that he doesn't feel the Gen 4 SSDs perform such that they justify the higher price (I ordered them anyway).His attention to detail doesn't stop after the sale or even after delivery. He's dedicated to helping the end user (me) work through the problems that seem inevitable with new systems -- usually traceable to Microsoft or Intel. Matt clearly is concerned with having a strong long-term relationship with customers. As far as the product itself, I'm extremely impressed. It runs fast, yet very cool. While typing this review, the 24 cores range from 31°C to 37°C. Even more impressive is the silent operation. I don't know if it's due to the extra fan Matt suggested, but it's extremely rare for me to hear any sound at all even under heavy use -- and it's never loud.I'm using built-in graphics, so I can't comment at all on the graphics performance.The NUC13RNGi9 from SimplyNUC perfectly fits my use case -- heavy Excel use. There's really nothing else I could ask of it. I cannot recommend all three strongly enough: the 13th gen NUC, Simply NUC & Matt Boone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Schneider",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T17:08:08.000Z",
          "Titre": "Great store for NUCs!",
          "Contenu": "I was able to get a recent-released NUC model from SimplyNUC before it available anywhere else. It arrived quickly and was exactly as expected. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dana Richardson",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T18:43:57.000Z",
          "Titre": "This is the second NUC purchased",
          "Contenu": "This is the second NUC purchased from them. Both perform as advertised and are almost invisible!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PMB",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T23:37:09.000Z",
          "Titre": "Customer Service",
          "Contenu": "Abi was always willing to answer all my questions and was patient while I made my decisions about which products to purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Kane",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T23:58:56.000Z",
          "Titre": "Incredibly Friendly and Responsive",
          "Contenu": "Incredibly friendly and responsive, helped me out greatly!"
        }
      ]
    }
  ]
}