{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "simpletexting.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "RB",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T16:56:49.000Z",
          "Titre": "Signed up as a Canadian customer..",
          "Contenu": "Signed up as a Canadian customer..Tested keywords, triggers and nothing worked. support is via chat and is horrible.This product is not as advertised. It sucks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LC",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T21:46:27.000Z",
          "Titre": "This company is terrible",
          "Contenu": "This company is terrible. The customer service is garbage and they do not do what they say they will. I ported a phone number over to simple texting 23+ days ago and have been waiting for the number to be activated but was told it would be done same day, or in some rare cases 4-7 days. My number for messaging has been in limbo since the beginning of August and it has caused me a loss of business and lost money. The customer service does nothing to help and is impossible to get on the phone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Quill",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T23:54:03.000Z",
          "Titre": "Doesn't work with Protonmail",
          "Contenu": "They dont even allow the new Protonmail. Thats like not allowing aol email in 1999. The support cant fix the issue. Protonmail is the newest most secure email and they havent added it yet, simpletexting is behind and its not even \"simple\" at all"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "King Kong",
          "Nb_Reviews": 4,
          "Date": "2022-09-25T18:16:44.000Z",
          "Titre": "Worst Company around its all smokes and…",
          "Contenu": "Worst Company around its all smokes and mirrors the owners hide behind a call center they auto bill monthly they are complete jerks will kick you out after years of service stay far away Simple Texting is a. scam, business and horrible customer service especially ray which is there main guy stay far away"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bradley",
          "Nb_Reviews": 1,
          "Date": "2019-09-18T18:13:51.000Z",
          "Titre": "The mobile app is terrible",
          "Contenu": "The mobile app is terrible. It does not send notifications nor update current messages. The web platform also does not update messages in the “inbox” when viewing the dashboard page. Customer support has been saying for weeks that they are working on it, but nothing has been fixed yet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Project Manager",
          "Nb_Reviews": 1,
          "Date": "2019-09-18T21:27:22.000Z",
          "Titre": "Unforeseen circumstances that haven't…",
          "Contenu": "Unforeseen circumstances that haven't been handled in the most timely manner. We really need more frequent updates while the number is completely down. We also reported a fairly serious bug that we feel is actually their issue, but they blame it on the carriers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rajesh Jethwani",
          "Nb_Reviews": 1,
          "Date": "2021-06-10T14:45:35.000Z",
          "Titre": "Bait and Switch",
          "Contenu": "Seems like a bait and switch. I signed up with a certain number of credits and was never warned about extra charges that will be applied. This was only brought to my attention at the time of the renewal with a large bill. As a non-profit organization, I don't have that kind of money to spend on these services and especially during the Pandemic. So I think the account was overcharged with no warnings and I was not given a fair resolution at the end of term."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Knowles",
          "Nb_Reviews": 1,
          "Date": "2020-06-02T23:27:44.000Z",
          "Titre": "I wasted a lot of time and energy.",
          "Contenu": "I experienced very long waits for help on the chat platform. My specific questions frequently were answered with recommendations to read articles that had nothing to do with the question I posed. Email inquiries yielded no results. I have heard many apologies, explanations about server problems, and more. The upshot of it all is that I have never successfully sent one group text. I moved on to EZtext."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Brand",
          "Nb_Reviews": 1,
          "Date": "2020-04-24T21:53:34.000Z",
          "Titre": "1 star because the communication…",
          "Contenu": "1 star because the communication between customer and your support team was not clear. A first time customer to this type of system needs better understanding of the \"keyword\" \"shortcode\" approval. I canceled within a week of signing up. I signed up with EZ Texting."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shari Criso",
          "Nb_Reviews": 1,
          "Date": "2020-07-01T00:44:53.000Z",
          "Titre": "I am very unhappy with the lack of…",
          "Contenu": "I am very unhappy with the lack of features and functionality for such a high price per text. When I tried to cancel because of the cost, I was offered a 50% discount forever. I think that is shady. So if I didn't try to cancel I would have to pay double? Doesn't really feel fair to customers at all. While I did take your offer, it was only until I could find a better platform which I have. Well be transferring and canceling my account shortly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adenilson Clementino",
          "Nb_Reviews": 1,
          "Date": "2019-09-11T18:30:21.000Z",
          "Titre": "They are too quick to punish their…",
          "Contenu": "They are too quick to punish their customer who is not fully aware about the texting policy. I sent out a message about CBD On my first week. I WANST AWARE IT IS NOT PERMISSION TO SENT IT OUT BC I SALW IT AT MY GYM. Now SimpleTexting just limit my ability to send text. I can only send the basic level with limited amount of words. I wanst even place on probation or anything like. Straight up cut my ability to make new business and grow it."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2021-07-29T20:13:04.000Z",
          "Titre": "FRAUDS!",
          "Contenu": "Be very careful when using this website. They charged my credit card almost 600$ and said i had been a member for years! that is false! They also told me they won't refund.Very unprofessionalWatch who you give your credit card info to."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Connor",
          "Nb_Reviews": 1,
          "Date": "2020-02-10T01:31:08.000Z",
          "Titre": "incredibly bad customer service",
          "Contenu": "incredibly bad customer service. The platform is practically impossible to use without it.. and getting their team to make changes to your account, implement upgrades, or approve campaigns is excruciatingly difficult. Just use someone else."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lakeisha",
          "Nb_Reviews": 1,
          "Date": "2020-02-14T04:41:22.000Z",
          "Titre": "DId not verify the website and the name…",
          "Contenu": "DId not verify the website and the name on the credit card and allowed a scammer to make an account and text 75,000 people pfishing items under our name."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Will Grafton",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T13:50:33.000Z",
          "Titre": "Horrible experience",
          "Contenu": "Complete incompetence when trying to port our number from zipwhip. Think twice about using this service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "YK Customer empowered",
          "Nb_Reviews": 5,
          "Date": "2022-06-16T16:01:29.000Z",
          "Titre": "I canceled the subscription in May",
          "Contenu": "I canceled the subscription in May. Yet I got charged in June and July again. I asked for refund and try to cancel account. No one gets back to me at all. I have no choice but to turn to BBB for help next."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pat Golson",
          "Nb_Reviews": 1,
          "Date": "2020-05-05T12:36:16.000Z",
          "Titre": "We never could send our first and only…",
          "Contenu": "We never could send our first and only text message. It was only going to 32 employees and we never could get it to go. We wasted $25.00."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JJ",
          "Nb_Reviews": 1,
          "Date": "2020-05-06T17:14:50.000Z",
          "Titre": "Seeing virtually no response to the…",
          "Contenu": "Seeing virtually no response to the texts we have going out. Several users reporting not receiving the texts."
        },
        {
          "Note": 1,
          "Lieu": "NG",
          "Pseudo": "Facebook OLP",
          "Nb_Reviews": 1,
          "Date": "2020-06-25T13:28:48.000Z",
          "Titre": "They suck they charged me and canceled…",
          "Contenu": "They suck they charged me and canceled my account without refund smh"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "nicholas richards",
          "Nb_Reviews": 1,
          "Date": "2021-01-29T17:56:48.000Z",
          "Titre": "scam charges your account whenever they…",
          "Contenu": "scam charges your account whenever they feel like...do not use this service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angel",
          "Nb_Reviews": 1,
          "Date": "2019-11-18T23:59:57.000Z",
          "Titre": "They change prices and over balance…",
          "Contenu": "They change prices and over balance fees without notice."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CATHY EWING",
          "Nb_Reviews": 1,
          "Date": "2020-04-13T12:13:44.000Z",
          "Titre": "It only transmitted 46% of my…",
          "Contenu": "It only transmitted 46% of my population for an important text message campaign"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tara",
          "Nb_Reviews": 1,
          "Date": "2019-10-17T14:21:51.000Z",
          "Titre": "i asked for a quote with no response"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dream Weaver Marketing",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T22:45:41.000Z",
          "Titre": "I don't recommend unless you like being monitored continuously.",
          "Contenu": "There are a lot of things potential customers need to know before hiring SimpleTexting. First, set up was not fast for us. The company required business license/EIN number, copy of ID, and business registration which took us a week to get approved and move forward. It was frustrating when we sent our first text and only 2K of our 7K texts were sent. That's because we weren't told that we had to pay more for a \"vetting\" process. Also, if you add your own company URL in the text, it gets flagged for \"monitoring\". Keep in mind this company is on the East Coast. So, if you send a text for an event at 5pm in the evening and it gets stuck in \"monitoring\" because you used a \"flagged\" key text or something, your text won't go out until they get into the office the following day. If you send during their business hours, they can approve in an hour or less. This was a problem for us on many levels! First, our entire list was not aware of an event we were having on our first text. On our second text, it didn't even go out and we missed advertising to our customers about that evening's event all together. From business registration to number registration to cell phone companies limiting the texts we sent to our own customers, it caused our company a lot of grief. The process was not easy and extremely frustrating. Once we thought it was time to go, another delay and another delay. It was always something new. My client is very disappointed that we were flagged and monitored just because we used our own website URL so our guests could click on our calendar of events. WAY too much red tape. That said, we seem to be set up now and ready to go after all that. We just have to make sure our texts go out before 5pm PST so that their \"Monitoring\" system doesn't delay your texts and the Simpletext staff can release the message. Otherwise, forget it. Be sure to archive messages so you're not charged for a text that says, \"Come tonight\" and it sends tomorrow because they are not in the office when you want your text to go out. It's BS. It really is. Spammers have really made doing business difficult. But after a few bad lessons, we just have to get around all the red tape. I wouldn't suggest using this service if you want freedom to send text to your list when you want without being monitored and delayed all the time. They are not even on Yelp or Google reviews. Even testimonials are monitored. :(  I really love the system though. It's easy to operate and the reports are nice. Customer service has really tried to be there, but they can't fix these problems. If you like being \"monitored\" go for it! If you have a big list, be prepared to only have 2K texts go out at once so ask for vetting. We just want to help others avoid the frustrations we encountered. Good luck."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kandy",
          "Nb_Reviews": 1,
          "Date": "2020-06-26T03:49:01.000Z",
          "Titre": "I don't think I've found the service…",
          "Contenu": "I don't think I've found the service that matches our need with Simpletexting. We aren't doing ad campaigns. We are just looking for a way to communicate with neighbors in a way that they could drop out of the group without us having to maintain a text list manually.  But this is so expensive we find ourselves limiting our communication.  We'll keep looking for something to fill our need."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Owners of a clothing boutique",
          "Nb_Reviews": 1,
          "Date": "2020-03-05T20:41:28.000Z",
          "Titre": "We wouldn't recommend based upon our…",
          "Contenu": "We wouldn't recommend based upon our experience as boutique owners. We experienced numerous issues and, of course, right at the moment we were needing to use the service to send out messages.  Do your due diligence before signing up.  We've found a lot better software out there."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2020-01-13T03:30:48.000Z",
          "Titre": "The user journey of the tool needs to be explored",
          "Contenu": "The user journey of the tool needs to be explored to identify pain points in the experience.The tool just doesn't work as well as I would like and there are too many pain points that I don't feel like listing right now."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alex Lopez",
          "Nb_Reviews": 1,
          "Date": "2020-06-05T20:08:20.000Z",
          "Titre": "Still missing quite a few Key features"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Melinda McAlees",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T05:12:33.000Z",
          "Titre": "My messages did not go out"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anon User",
          "Nb_Reviews": 1,
          "Date": "2020-02-24T19:47:00.000Z",
          "Titre": "Lots of bugs to be fixed"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Tim Evans",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T05:43:09.000Z",
          "Titre": "Simpletexting is great but I have two issues.",
          "Contenu": "1.  I find it very frustrating when someone messages me but I can't figure out how to get rid of the red circle above the app.  I fiddle around with the list of responses and still have no clue how to get rid of the red circle above my app which indicates that someone has messaged me.  2. Your price.  it's high!   There is competition out there now!   You need to re-evaluate your cost!  Other than these two complaints, I am happy with the service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Scott Anthony",
          "Nb_Reviews": 1,
          "Date": "2020-07-12T04:06:53.000Z",
          "Titre": "No \"Recurring\" Text??",
          "Contenu": "No \"Recurring\" Text??  I can't believe in the year 2020 there is an APP that does not allow \"Recurring\" Text Messages.  If I want to send a reminder text out every week at the same time, I have to create a whole new Campaign each time?.....ridiculous.  There should be a little check box like Google Calendar has had for 10+ years that allows you too make a text a message \"Recurring\".  Plus the App is a little buggy/clunky.  However, I love the fact that we get unlimited key words"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SE Christensen",
          "Nb_Reviews": 1,
          "Date": "2020-06-22T06:17:25.000Z",
          "Titre": "Wish there a way to tell if u have a…",
          "Contenu": "Wish there a way to tell if u have a landline or cell phone before texting.Customer service chat response should be 10 mins or less.Love how automatic the service is.  Love accessibility via the app."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Diego Campos",
          "Nb_Reviews": 1,
          "Date": "2022-03-19T07:31:23.000Z",
          "Titre": "Bogus no-refund policy; UPDATE",
          "Contenu": "Ordered about $300 of texts. Last minute change meant we didn’t need them anymore. Asked for refund. “We can’t do refunds for orders made more than a week ago.” MFW I ordered 4 days ago. I reply, stating I had ordered 4 days ago. They apologize about their mistake. Still says they cannot offer refund, without an explanation. RIP $300.Update; mere hours after posting this review, I was directly contacted by a SimpleTexting team member. Mr. Brian was very helpful. He basically stated that my interaction should never have happened, he also informed me that my refund was on its way (albeit a month late XD). It was in the bank account the next morning. While I commend Mr. Brian for directly reaching out and taking time out of his day, I also cannot overlook the initial interaction. I also cannot ignore the fact that the situation looks like damage control. Either way, I got what I needed, and I’m changing my review from one star to three stars. Thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lpawlek",
          "Nb_Reviews": 1,
          "Date": "2020-06-15T16:01:00.000Z",
          "Titre": "The group text messages are a bit…",
          "Contenu": "The group text messages are a bit cumbersome and do not allow for adaptions. I would like to send a text without creating a campaign."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Scream Gaming",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T23:16:37.000Z",
          "Titre": "Very user-friendly",
          "Contenu": "Very user-friendly, Excellent App but needs improvement. Someone of my texts get delayed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tracie",
          "Nb_Reviews": 1,
          "Date": "2020-02-24T17:16:37.000Z",
          "Titre": "I enjoy using SimplyTexting but there…",
          "Contenu": "I enjoy using SimplyTexting but there are some aspects that I do wish it had. I will continue to stick with it for the meantime."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Laura Phillips",
          "Nb_Reviews": 1,
          "Date": "2019-09-12T12:02:16.000Z",
          "Titre": "I like it for the most part",
          "Contenu": "I like it for the most part. It doesn't work flawlessly and it can be tricky to figure out at times but when I truly get the hang of it, I know it will be really helpful"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Debra Anderson",
          "Nb_Reviews": 1,
          "Date": "2019-09-12T18:09:55.000Z",
          "Titre": "Better?",
          "Contenu": "I'm not sure what to say that would make it better.  Simple Texting is convenient since I don't have to use the phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dp",
          "Nb_Reviews": 5,
          "Date": "2020-07-10T10:04:37.000Z",
          "Titre": "Could receive more text for the monthly…",
          "Contenu": "Could receive more text for the monthly price.. also needs to be able to upload more formats of contacts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frank Photiadis",
          "Nb_Reviews": 1,
          "Date": "2020-03-18T17:50:48.000Z",
          "Titre": "The system has been down or had some…",
          "Contenu": "The system has been down or had some kind of issue way too much."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Chelsea Oram",
          "Nb_Reviews": 1,
          "Date": "2019-09-11T17:04:53.000Z",
          "Titre": "Your app need ALOT of work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jackie Hannan",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T16:44:31.000Z",
          "Titre": "We have to constantly refresh",
          "Contenu": "We have to constantly refresh, sometimes we miss messages because of this other than that very happy with the service. And they are very prompt to respond to any concerns or issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Courtney Griffin",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T20:50:06.000Z",
          "Titre": "Great Service",
          "Contenu": "They have been great at responding to operational questions, and providing technical support."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maria",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T02:19:59.000Z",
          "Titre": "What I wish SimpleTexting would do in the future",
          "Contenu": "What I like about SimpleTexting is the fact that it is very easy to use. Also, I was able to add my assistant without creating a separate account.  I only use it to communicate with my clients, so I use a quarter or less of my credits a month. I wish I could use it more for marketing and sending automatic replies, etc. but I haven't spent a lot of time learning the different features.  I would suggest having a weekly or monthly webinar for members on how to maximize the use of this app, how to create campaigns, etc. I would rather spend an hour on a webinar than 20 minutes reading about it and then an hour trying to figure out how to do it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aaron",
          "Nb_Reviews": 2,
          "Date": "2019-11-05T18:01:59.000Z",
          "Titre": "Texting through the website works well",
          "Contenu": "Texting through the website works well. No problems. Have had issues with the app (new messages not showing up). Wish each sub account could receive their own notifications of messages received. Our entire company uses the program, so every time we receive an incoming text, only one email address can receive a notification."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maria Dautruche",
          "Nb_Reviews": 1,
          "Date": "2020-07-16T10:48:47.000Z",
          "Titre": "Pleased",
          "Contenu": "So far, so good. Lots of outreach for support from human beings and bots. I did try texted.ly first, and their customer support was ineffective, and I grew frustrated.  Simple Texting was a refreshing and navigable choice for me, given that I have NO prior experience with these platforms."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kareem",
          "Nb_Reviews": 3,
          "Date": "2019-09-11T16:24:07.000Z",
          "Titre": "Simple text helped my business to…",
          "Contenu": "Simple text helped my business to communicate more efficiently with my customers, 90% of my customers reading the text Vs. email only 30% and the only reason I'm giving 4 start because 5% of my good customers not getting the text for some reason and it showed delivered from my end, I tried several times even contacted the carrier support but was nothing they can do about it, they said it's not our fault. hope this issue get addressed and fixed, I'm sure I'm not the only one having this issue. thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 3,
          "Date": "2019-10-09T18:16:22.000Z",
          "Titre": "Enjoyed using the service",
          "Contenu": "Enjoyed using the service. Really enjoyed the responsiveness via the message chat. Got up and going right away. One item to consider, signed up for the trial first, discovered there was a 50 send limit and upgraded in order to send a 400 contact blast in the next 18 hours. Took the $$ right away, fine, but took more than 8 hours and a note to service before the account was upgraded. A certain amount of unnecessary worry, planning and initial execution went into a truly lousy Plan B because your support was offline until after I needed to send the blast. To your service's credit, I received a note back from support prior to the announced hour allowing me to abandon the lousy Plan B and ship all via your service. The upshot? If you take the dough, make it go. Right away. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paula K.",
          "Nb_Reviews": 1,
          "Date": "2020-06-12T22:18:40.000Z",
          "Titre": "Customer service is outstanding!",
          "Contenu": "Have really appreciated this service to be able to serve my customers! Customer service is outstanding! There is a slight delay with notifications that can be a little confusing when working between multiple devices, which is the only reason for a 4 instead of a 5."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "M VanVleet. APRN-CNP, PMHNP-BC",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T22:47:43.000Z",
          "Titre": "It works well, generally",
          "Contenu": "It works well, except that no matter what I've tried after discussions with your people, and reloading the app, I can't get the app to make a sound when I receive a new SMS"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Betty L Gabilanes",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T20:21:46.000Z",
          "Titre": "The program is excellent",
          "Contenu": "The program is excellent.  I have used it for a couple of months only.  I used another company for more than 5 years and I loved it.  The only reason why I don't give them a 5 star is because their texts change from simple texting to MMS and it takes more credits"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Trusted Servant",
          "Nb_Reviews": 1,
          "Date": "2020-04-25T22:40:44.000Z",
          "Titre": "So far, so good!",
          "Contenu": "So far, so good. It is still a little soon to give a thorough evaluation. Easy to use. Easy for others to join the list. I do not like the number of emails that I am getting from the simpletexting team. I appreciate their enthusiasm, but... I am good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Katie M",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T17:54:23.000Z",
          "Titre": "Great for nonprofits",
          "Contenu": "The set-up process can be a little tedious due to having to speak with several departments, but once everything is running, SimpleTexting is fantastic! It's affordable, the interface is very intuitive, and has all the features we need. Would recommend for nonprofits looking to coordinate volunteer teams."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nate",
          "Nb_Reviews": 1,
          "Date": "2020-01-13T22:21:54.000Z",
          "Titre": "This has been a great software so far",
          "Contenu": "This has been a great software so far. I just wish the was more liberty with customizing key words and not running into key words that have already been taken"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2020-06-11T20:49:22.000Z",
          "Titre": "A great tool",
          "Contenu": "A great tool. The pricing gets a little confusing but it’s still an excellent way to reach customers"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lauren",
          "Nb_Reviews": 2,
          "Date": "2019-12-09T21:16:51.000Z",
          "Titre": "Simple & Great Service",
          "Contenu": "This is a great service that doesn't cost very much. I was mostly impressed with their service during the free trial."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ester",
          "Nb_Reviews": 1,
          "Date": "2019-10-12T20:15:50.000Z",
          "Titre": "I would like to have the options of…",
          "Contenu": "I would like to have the options of removing from the contact list if the person opt out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Phillip Blazek",
          "Nb_Reviews": 1,
          "Date": "2019-09-11T16:28:16.000Z",
          "Titre": "Great texting system with a lot of…",
          "Contenu": "Great texting system with a lot of great features and apps. Very expensive"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kelvin McCree",
          "Nb_Reviews": 1,
          "Date": "2020-05-30T15:14:39.000Z",
          "Titre": "We're new to the platform but so far",
          "Contenu": "We're new to the platform but so far, it is worked to our satisfaction."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Human Resources",
          "Nb_Reviews": 1,
          "Date": "2019-09-11T15:18:08.000Z",
          "Titre": "Effective!",
          "Contenu": "Great system if you keep verbiage to a minimum."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Senior Model Consu",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T20:38:51.000Z",
          "Titre": "Make an easy way to delete old texts in…",
          "Contenu": "Make an easy way to delete old texts in bulk."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eddie",
          "Nb_Reviews": 1,
          "Date": "2020-01-21T19:22:27.000Z",
          "Titre": "You guys redeemed yourselves",
          "Contenu": "You guys redeemed yourselves, you’re doing pretty good so far. Keep up the good work. ThankEddie."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Cochran",
          "Nb_Reviews": 2,
          "Date": "2019-12-02T02:59:31.000Z",
          "Titre": "Pricing a little high  otherwise 5 stars"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nitin Bulsara",
          "Nb_Reviews": 1,
          "Date": "2020-05-20T12:58:59.000Z",
          "Titre": "Problem solved",
          "Contenu": "Thank you solving my problem"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marina",
          "Nb_Reviews": 2,
          "Date": "2020-01-22T23:17:03.000Z",
          "Titre": "I understand the company had to follow…",
          "Contenu": "Affordable service, easy to use"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pamela Hart",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T00:56:53.000Z",
          "Titre": "Ease of use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick Winchester",
          "Nb_Reviews": 1,
          "Date": "2020-05-21T16:52:06.000Z",
          "Titre": "great product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amber Canales",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T22:04:11.000Z",
          "Titre": "Intuitive, Helpful, Future-Forward",
          "Contenu": "SimpleTexting has a very intuitive yet powerful UI, making it easy to learn and provide excellent support for our customers who are looking for a quicker resolution to their issues than email can provide. They also have their own fantastic support team that resolves problems quickly, even during peak seasons in live chat, so no waiting around for an answer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica D.",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:52:44.000Z",
          "Titre": "Great customer service and helpful…",
          "Contenu": "Great customer service and helpful guidance in fixing my issue and answering my questions"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ruben",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T22:14:48.000Z",
          "Titre": "Great communication throughout the…",
          "Contenu": "Great communication throughout the implementation and setup of the app as well as fast support when I had questions."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Samy Tagba",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T21:57:55.000Z",
          "Titre": "I had a extremely good experience with…",
          "Contenu": "I had a extremely good experience with simpletexting from my onboarding till getting me account fully set up.Special thanks to Support team that are very reactive to each and every customer request. thanks for this amazing and support work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Leavitt",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T17:41:28.000Z",
          "Titre": "Customer service has been fantastic!",
          "Contenu": "The customer service experience was second to none.  I had quite a few questions and needed a lot of help and John Bugay was incredibly patient and very thorough in making sure that I understood everything that I needed and wanted to know.  He definitely made it so that I can use this service to be more successful, and I am very grateful!  Thank you!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jan Pieterse",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T20:07:54.000Z",
          "Titre": "Why can it not all be this good",
          "Contenu": "After being overcharged and not getting any customer support with Twillio, we wanted to move to TextRequest, there we ran into a bunch of hidden charges, which made us land on simple texting.   With simple texting we had straightforward pricing compared to others, customer service 1,001 times better than with Twillio.  Integration with our Veterinay Practice Management VETport was simple, easy.All the veterinary clinics are happy with the products"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynae",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T00:38:20.000Z",
          "Titre": "They were quick to respond and answered…",
          "Contenu": "They were quick to respond and answered all the questions I had!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria Aumick",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T17:41:56.000Z",
          "Titre": "Simple Texting is very available to help!",
          "Contenu": "Simple Texting is very available to help figure out whatever issues we are having.  The wait time is reasonable and sometimes even fast! You are put with a human as soon as the chat bot does not give you what you need!  I am so appreciative!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Murdock Community",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T20:29:47.000Z",
          "Titre": "You all helped to make our GIVING…",
          "Contenu": "You all helped to make our GIVING TUESDAY successful! I am grateful for the ease of use"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miriam Higley",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T18:18:04.000Z",
          "Titre": "The Best for Nonprofits",
          "Contenu": "This is the best messaging service that I have found for small, nonprofit organizations. We only pay for what we use and they are very transparent about costs and fees. Previous services have surprised us with hidden fees and locked us into months of service, but not Simple Texting. I love that we could use our landline number for texting. Plus, their customer service is personalized and excellent!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Colleen Keupp",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T23:21:41.000Z",
          "Titre": "This was an effective decision for my business",
          "Contenu": "Although at first glance it appeared overwhelming, the support staff was wonderful in going over the simplicity of the usage of it all!  I appreciated how quick and easy it was to connect with the support staff to answer additional questions and walk through additional tools within the program.  10+ out of 10!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Roche",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T02:48:11.000Z",
          "Titre": "Excellent customer service as I was…",
          "Contenu": "Excellent customer service as I was setting up the account.  Always answered questions quickly.  The application was so easy to use and I loved there were no longer term contracts so we only needed to pay for the months we needed.  The discount for non-profits was nice too.  We used it for a four day conference and people loved getting the information quickly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Megan",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T18:27:30.000Z",
          "Titre": "Spencer was extremely helpful",
          "Contenu": "Spencer was extremely helpful in demonstrating the service, providing thorough detail, and always had excellent and timely communication. He never hesitated to answer questions and review information in a way that was user-friendly and easy to understand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 8,
          "Date": "2023-09-14T00:38:45.000Z",
          "Titre": "The team is quick and responsive",
          "Contenu": "The team is quick and responsive. The answers are clear and get me back on track. And the system (services) are clear and help me manage my community.  Love the service, not going anywhere else anytime soon.  Thanks Simple Texting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "O.S.",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T15:33:37.000Z",
          "Titre": "Dig the Live Support",
          "Contenu": "It's nice to be able to call in and speak to a live person. Sometimes questions are hard to formulate in print and I find it much more efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy OConnell",
          "Nb_Reviews": 2,
          "Date": "2023-08-30T17:01:19.000Z",
          "Titre": "SimpleTexting makes it so easy to stay…",
          "Contenu": "SimpleTexting makes it so easy to stay in touch with our brides, which is a big part of our excellent customer service.  The cost is low, and the value it brings pays for itself many times over!  We are very happy we decided to use SimpleTexting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dee",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T15:14:46.000Z",
          "Titre": "It's been a pleasure!",
          "Contenu": "Working with simpletexting.com has been a pleasure from the beginning.  Mt. Lake Christian School was in need of a reasonably priced text message system to help get important announcements to our school families.  The people we worked with were informative and gracious and thoroughly answered all of our questions.  Despite the set up taking longer than we anticipated, the wait was worth it.  We are very pleased to offer this service to our school families as a resource for letting them know what is going on at school."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad",
          "Nb_Reviews": 1,
          "Date": "2019-10-31T14:41:29.000Z",
          "Titre": "Great for our small business",
          "Contenu": "For our small business looking to share quick reminders re: events and updates about severe weather with our employees, Simple Texting fits the bill perfectly.  Our big boxes we wanted checked were cloud storage of contacts, access for multiple administrators, low minimums so our small business wasn't forced to buy way more credits/subscribers than we needed, ease of use and mobile syncing.  Simple Text checked all those boxes and has been working great for us."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Don Paulo",
          "Nb_Reviews": 5,
          "Date": "2021-12-21T05:39:15.000Z",
          "Titre": "I am using SimpleTexting for running…",
          "Contenu": "I am using SimpleTexting for running Bulk SMS campaigns to our list from US and Canada and tool is the most easiest to use and also has a very neat and clean interface.Especially the new responses that we get after running recurring campaign is amazing.Just that we have to use proxy to interact with our US list since the tool is not supported for outside US users.I hope they keep adding more functionality and make the tool even more amazing.So, far we have been able to send approx 48k SMS text and they get good open rate and responses for which we are happy about."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jill",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T20:22:04.000Z",
          "Titre": "Simple and effective",
          "Contenu": "Simple and effective. We have been very happy with this texting platform."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Melissa Centeno",
          "Nb_Reviews": 1,
          "Date": "2022-12-19T07:31:44.000Z",
          "Titre": "Awesome!",
          "Contenu": "We've been using Simple Texting for quite some time now, it has truly helped both our CS and Sales team connect with our customers in such an efficient way. We will continue using the app as a part of our day to day communications with our customers. Fast, efficient, reliable!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Didone",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T17:33:05.000Z",
          "Titre": "You are providing me with a good product and service",
          "Contenu": "You are providing me with a good product and a very good responsive technical support. We are very pleased to work with you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Graham",
          "Nb_Reviews": 2,
          "Date": "2019-10-16T13:14:37.000Z",
          "Titre": "Great Service, Great Product.",
          "Contenu": "This has performed exactly like I needed it to, allowing me to scale up daily contact in my online coaching business without going crazy! Customer service has been prompt and helpful every time I need them and the service has worked perfectly. I hope to see them continue to perfect and tweak the service but it’s been great so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SNAP OUTREACH COORDINATOR",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T21:29:14.000Z",
          "Titre": "GOOD CUSTOMER SERVICE",
          "Contenu": "One of the best options to connect with clients quick. Not to ignore how convenient it is for most of them to feel safe with a more direct connection as long the consent to practice it is granted by the client as well!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AM",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T07:21:55.000Z",
          "Titre": "Great For Organizations of Any Size",
          "Contenu": "Having a subscription to this site makes it so much easier for outreach. Our organization purchased this solely with the purpose of sending out messages but this site allows us to track outreach and has helped us improve our relationships with clients (ie: check ups when invalid numbers, easy to reply system)"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Tony",
          "Nb_Reviews": 2,
          "Date": "2020-10-17T07:20:50.000Z",
          "Titre": "I was not sold..I WAS CONVINCED",
          "Contenu": "I was reviewing your features and had questions. I was contacted by CSR Teddy G. He not only answered my all my question, he was patient, courteous at all times, diligent and knowlegeable. Bottomline Teddy did not sell me me.. Teddy CONVINCED me beyond a doubt you are a fit for my projects without pressure. So I am in.. Give Teddy a raise! :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tanya",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T15:28:40.000Z",
          "Titre": "AWESOME!!!",
          "Contenu": "Ability to make notes with in the text message itself. Ability to save names. Easy to use. Gives you \"proof\" of communications with a guest that you may not have if having/had verbal conversation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Randolph",
          "Nb_Reviews": 1,
          "Date": "2019-10-30T21:26:22.000Z",
          "Titre": "Erin and Jenny have been great to work…",
          "Contenu": "Erin and Jenny have been great to work with on getting things set up. Back end support says a lot about a company's culture with respect to how they deal with customers after the sale. If my first interactions are any indication, you guys are hitting a HOME RUN!! Thanks. John Randolph"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dom Vasquez",
          "Nb_Reviews": 1,
          "Date": "2020-04-30T20:27:25.000Z",
          "Titre": "Perfect for Class Times, Updates and Meeting Links!",
          "Contenu": "I have to text my clients' class times, updates, and meeting links, and I must say this works great. I have no problem importing contacts from my other applications and programs. I am very pleased and I highly recommend Simple Texting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AC",
          "Nb_Reviews": 1,
          "Date": "2020-03-27T19:56:27.000Z",
          "Titre": "SimpleTexting is very easy to use",
          "Contenu": "SimpleTexting is very easy to use.  Anything you need help on there is either a video tutorial you can watch or you can live chat with someone.  It's been a lifesaver to communicate with our subscribers and has lots of fun features so that I can keep my subscribers engaged!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arika",
          "Nb_Reviews": 1,
          "Date": "2020-02-07T16:15:04.000Z",
          "Titre": "Extremely user friendly",
          "Contenu": "Extremely user friendly! Perfect for what we as a massage clinic were looking for! The app options area great feature as well. Continued communication from your company as a whole! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phyllis Shelton",
          "Nb_Reviews": 6,
          "Date": "2023-09-16T22:29:41.000Z",
          "Titre": "SimpleTexting is so easy to use",
          "Contenu": "SimpleTexting is so easy to use. I had two calls with their customer support staff to learn how to use it and they were very responsive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2019-10-11T16:54:40.000Z",
          "Titre": "Excellent program",
          "Contenu": "Excellent program.  I was quickly able to put a message together with a keyword and autoresponders.  In a short period of time, I had many subscribers.  I have used this before and am thankful for the new feature of being able to respond to incoming text messages.  Well done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Clark",
          "Nb_Reviews": 2,
          "Date": "2023-07-18T21:34:24.000Z",
          "Titre": "My experience with using SimpleTexting…",
          "Contenu": "My experience with using SimpleTexting has been wonderful. It helps keep track of all my customers and every time I use it I get more and more customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheena Garner",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T21:51:06.000Z",
          "Titre": "Always a great experience",
          "Contenu": "Always a great experience. Straight-forward, no hassle, easy, reasonably priced, quick and accurate responses on the rare occasions that I have had questions. Gave a great FB review as well!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dean honeycutt",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T15:06:28.000Z",
          "Titre": "Awesome folks, From day one everyone has been…",
          "Contenu": "From day one everyone has been courteous, knowledgeable, and willing to help on all levels."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Clark",
          "Nb_Reviews": 2,
          "Date": "2023-07-20T21:40:07.000Z",
          "Titre": "I love SimpleTexting",
          "Contenu": "I love SimpleTexting. It definitely brings in business every time I use it. Pricing is reasonable and the customer service is top notch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad Doll",
          "Nb_Reviews": 1,
          "Date": "2020-03-31T16:39:32.000Z",
          "Titre": "Simple and logical website layout",
          "Contenu": "Simple and logical website layout.  Ability to attach PDF's is huge so we don't have to worry about character counts on more detailed messages to our workforce!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danielle Anthony",
          "Nb_Reviews": 1,
          "Date": "2020-05-11T13:29:11.000Z",
          "Titre": "The chatbox is incredibly helpful and…",
          "Contenu": "The chatbox is incredibly helpful and customer service gets back to you almost instantly. I talked with Jess and not only did she help me combine two accounts,  she did so with kindness."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Renee",
          "Nb_Reviews": 1,
          "Date": "2020-01-02T21:08:26.000Z",
          "Titre": "Intuitive, Easy, and BEST customer service ever!",
          "Contenu": "SimpleTexting has been fantastic. Not only is the platform intuitive and easy to use, the customer service has been incredible. Jennifer went above and beyond, and figured out an issue I had quickly with poise, professionalism, and kindness. The simple aesthetic and resonable prices brought me in the door, but the customer service had made me a loyal customer! I recommend this platform to anyone who needs an SMS marketing service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Audra",
          "Nb_Reviews": 1,
          "Date": "2020-02-25T00:49:32.000Z",
          "Titre": "Best Way to Send Our Surveys!",
          "Contenu": "Always friendly, helpful and knowledgeable staff.We only need the service once or twice a year and they allow me to just sign up for the time needed instead of a whole year, which is truly helpful. Thanks SimpleTexting!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Hoover",
          "Nb_Reviews": 1,
          "Date": "2020-04-09T14:52:59.000Z",
          "Titre": "Simple Texting allowed us to quickly…",
          "Contenu": "Simple Texting allowed us to quickly and efficiently communicate with our staff during this Coronavirus crisis.  Thanks for building such a great tool!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bettina Woolbright",
          "Nb_Reviews": 1,
          "Date": "2020-04-19T16:06:40.000Z",
          "Titre": "Excellent platform and customer service",
          "Contenu": "Excellent platform and customer serviceIt took a while to find the right provider and SimpleTexting had everything I needed with ease of use.  highly recommended for business text messaging"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon Cantrell",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T21:41:33.000Z",
          "Titre": "Webinars",
          "Contenu": "The webinars are good for getting questions, answered quickly. And to gain knowledge and tips and tricks from a live person."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DeAnna J",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T18:18:32.000Z",
          "Titre": "Great tool!",
          "Contenu": "Easy to use, convenient, quick and can use emoji's :) Employees love the quick communication too! Can use for emergency contact communication and surveys etc.  Love it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Burston Marketing",
          "Nb_Reviews": 1,
          "Date": "2020-02-14T17:01:27.000Z",
          "Titre": "Excellent Customer Service!",
          "Contenu": "Excellent Customer Service!I was very happy with the customer service I received. Jennifer was most helpful in getting my company setup on SimpleTexting.comThanks again!Tom"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danielle Barrett",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T19:23:07.000Z",
          "Titre": "Ease of use",
          "Contenu": "I use this to communicate with our clients on a weekly basis and love it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Meuer",
          "Nb_Reviews": 1,
          "Date": "2020-05-01T00:44:50.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent! Excellent! Excellent!  The platform is straight forward and very user friendly.  The onboarding is very well presented.  The pricing is fair.  Great ROI so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karl D. Susman",
          "Nb_Reviews": 1,
          "Date": "2020-04-17T18:35:16.000Z",
          "Titre": "Use my business line for texting",
          "Contenu": "I wanted something simple, use my business number for texting up and back.  From start to finish, the SAME DAY, these guys made it happen.  And for a totally reasonable price.  I can't recommend them enough."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Owen",
          "Nb_Reviews": 2,
          "Date": "2023-07-17T15:53:54.000Z",
          "Titre": "Everthing's going well",
          "Contenu": "Everthing's going well.  Only complaint was the delay in sending texts pending review, but we've overcome that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Integrated Facility Services Hawaii",
          "Nb_Reviews": 1,
          "Date": "2020-05-08T23:56:38.000Z",
          "Titre": "Awesome Tool for Our Small Business",
          "Contenu": "We signed up for Simple Texting a few weeks ago and it is such a great tool for our Company to send out urgent reminders to everyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clorina Helton",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T21:37:46.000Z",
          "Titre": "SimpleTexting is very effective and…",
          "Contenu": "SimpleTexting is very effective and easy with contacting customers. It helps us tremendously! I hardly ever have issues with the app and recommend it for others!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenise",
          "Nb_Reviews": 1,
          "Date": "2020-01-21T16:20:29.000Z",
          "Titre": "Autoreponders are awesome!",
          "Contenu": "Simple Texting autoresponders are quick and easy to set up, they are making a big difference with my day to day workflows. Autoresponders are saving me a lot of time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lindsay",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T17:26:50.000Z",
          "Titre": "Improve company communication and marketing!",
          "Contenu": "SimpleText has improved communications with our associates 110%! We are also starting to implement SimpleText into our marketing and branding. The platform is so easy to use! Highly recommend, every business or organization can benefit in some way!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philip Roth",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T20:22:07.000Z",
          "Titre": "Good program and good customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2019-12-13T22:55:59.000Z",
          "Titre": "Your staff was amazing helping me get…",
          "Contenu": "Your staff was amazing helping me get my first campaign sent out! I was literally on the phone for 2 hours with Bibs and she was so patient and helpful! Definitely worth the money!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nelly",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T15:30:28.000Z",
          "Titre": "Notifications system",
          "Contenu": "It is great that I am able to receive two types of notifications from simpletexting. It is fairly easy to use and understand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Candice",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T19:51:57.000Z",
          "Titre": "Simple Texting Makes it Easy",
          "Contenu": "Simple Texting makes it easy to receive messages from our customers in whatever manner works for them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ann Rakowiecki",
          "Nb_Reviews": 1,
          "Date": "2020-02-21T22:19:35.000Z",
          "Titre": "Great experience - they know their stuff!",
          "Contenu": "Great experience! SimpleTexting was the easy choice. From the info session with Dibs, to getting set up with Devora and expert help from Teddy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacob Preciado",
          "Nb_Reviews": 1,
          "Date": "2020-06-24T16:44:27.000Z",
          "Titre": "Such a powerful tool",
          "Contenu": "Such a powerful tool. I am a realtor and use this for my open homes. It allows me to capture contact info and meet compliance standards. It was super simple and easy to set up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Hermansen",
          "Nb_Reviews": 1,
          "Date": "2020-05-29T17:10:14.000Z",
          "Titre": "I love SimpleTexting",
          "Contenu": "I love SimpleTexting. It's super easy to do just about anything with the help of Zapier. I have several sites and I use simpletexting for all of them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2020-02-25T16:06:13.000Z",
          "Titre": "Simple Texting really is simple",
          "Contenu": "Simple Texting really is simple. I was able to import a user list from a spreadsheet file and send my first text blast in about 15 minutes. And it's very affordable for a startup or small business to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Lynch",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T00:17:33.000Z",
          "Titre": "Easy to use",
          "Contenu": "This is a really simple system to set up and use compared to others I have tried."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rich Villafana",
          "Nb_Reviews": 1,
          "Date": "2020-06-28T18:10:40.000Z",
          "Titre": "Great platform",
          "Contenu": "Great platform.  The best part is the auto responders, and data collection apps.  so many really cool features that will help us grow our church reach"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katelyn Tabler",
          "Nb_Reviews": 1,
          "Date": "2020-04-02T21:33:51.000Z",
          "Titre": "Simple Texting is so easy to use",
          "Contenu": "Simple Texting is so easy to use! We love it for communication within our Agency. It is also very affordable!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pendleton",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T21:19:16.000Z",
          "Titre": "Simpletexting is easy",
          "Contenu": "Simpletexting has made it easy to send out mass messages to all of our contacts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin McGrath",
          "Nb_Reviews": 4,
          "Date": "2020-04-02T23:36:27.000Z",
          "Titre": "Support has been great so far",
          "Contenu": "Support has been great so far. I like that they give suggestions for success. They do not just wait for customers to ask them questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anita Burns",
          "Nb_Reviews": 3,
          "Date": "2019-09-11T15:36:48.000Z",
          "Titre": "Small Church Communication",
          "Contenu": "This system has been exactly what we needed for a reasonable cost.  It has made our small church communication effective and efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marissa",
          "Nb_Reviews": 1,
          "Date": "2020-02-02T22:14:13.000Z",
          "Titre": "Very easy to use for our dental office…",
          "Contenu": "Very easy to use for our dental office to send text messages and reminders to our patients. A lot of great features as well!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lan B",
          "Nb_Reviews": 2,
          "Date": "2020-01-17T21:09:47.000Z",
          "Titre": "The customer service is knowledgable…",
          "Contenu": "The customer service is knowledgable and helpful. The website is really easy to use. The features are good. They are the best company for the texting service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hattie",
          "Nb_Reviews": 1,
          "Date": "2019-12-04T15:55:17.000Z",
          "Titre": "I choose SimpleTexting over other…",
          "Contenu": "I choose SimpleTexting over other services because of your customer service. Your team's willingness to help and answer questions was amazing and made a huge difference in my decision."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Kinley",
          "Nb_Reviews": 2,
          "Date": "2020-01-05T01:24:40.000Z",
          "Titre": "Outstanding Customer Service!!!!  Excellent Company/Staff",
          "Contenu": "The team at SimpleTexting, notably Teddy Genilla, are extremely helpful, give timely responses, & deliver excellent customer service!  I would highly recommend this online texting service for their outstanding service and platform.  I've been a customer since March 2019 and my clients enjoy receiving periodic text messages from me through this service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim V",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T16:18:24.000Z",
          "Titre": "Easy to add contacts",
          "Contenu": "Easy to add contacts, create messages, preview before sending, and then disseminating.  Messages are delivered within a few minutes or less."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GetKnit Events",
          "Nb_Reviews": 1,
          "Date": "2020-08-26T18:52:02.000Z",
          "Titre": "Wonderful product",
          "Contenu": "Wonderful product.  Great customer service.  Easy to use platform with an intuitive design.  Would suggest their services to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "L. Neys",
          "Nb_Reviews": 1,
          "Date": "2020-07-28T17:05:43.000Z",
          "Titre": "Great experience from start to finish!",
          "Contenu": "The entire process of adopting SimpleTexting was seamless. Our salesperson, Bryan, was incredibly helpful and always willing to answer our questions.  Even after our transition he continues to be a great resource when needed. I would highly recommend SimpleTexting to anyone considering a texting solution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fr. Lorenzo Lebrija",
          "Nb_Reviews": 1,
          "Date": "2019-12-04T18:25:31.000Z",
          "Titre": "Customer service",
          "Contenu": "Customer service They are amazing at customer service. And the user interface is so simple. I just love Simple Texting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Leggett",
          "Nb_Reviews": 1,
          "Date": "2019-09-11T15:12:21.000Z",
          "Titre": "Very easy to use platform",
          "Contenu": "Very easy to use platform. It's a wonderful tool we have added as a service to our customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather",
          "Nb_Reviews": 1,
          "Date": "2020-02-24T14:47:21.000Z",
          "Titre": "Worth every penny for my business",
          "Contenu": "This program was very easy to use and helpful for all my needs. I will continue to use this company for future business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Len",
          "Nb_Reviews": 1,
          "Date": "2020-01-21T17:51:53.000Z",
          "Titre": "Simple to sign up, try and use",
          "Contenu": "Simple to sign up, try and use.  Excellent support, professional and responsive.  Works perfectly for our office."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jessy Gagné",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T20:40:35.000Z",
          "Titre": "Efficiency",
          "Contenu": "Feedback, advices, support, quality, management, the way to explain, professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rhonda Renfro",
          "Nb_Reviews": 1,
          "Date": "2019-09-18T12:54:05.000Z",
          "Titre": "Great program!!!",
          "Contenu": "Great program!!! Really takes the hassle out of texting large audiences.  It's simple but has everything necessary to get the job done well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2019-12-06T19:47:45.000Z",
          "Titre": "Works well",
          "Contenu": "Works as advertised.  Works pretty well with Zapier.  If I had the ability to update a contact in SimpleTexting from Zapier, that would help my application considerably."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Justin Bibby",
          "Nb_Reviews": 2,
          "Date": "2023-02-02T18:44:21.000Z",
          "Titre": "They do an excellent job!",
          "Contenu": "Simple texting gives me all the support I need to send out appointment reminders and other news to customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robin",
          "Nb_Reviews": 1,
          "Date": "2019-10-31T19:37:41.000Z",
          "Titre": "SimpleTexting is exactly that",
          "Contenu": "SimpleTexting is exactly that, simple and easy to use.  They offer tons of support with their product, which is a huge plus!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Lighthouse Dental Centre",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T22:28:51.000Z",
          "Titre": "Fantastic program with excellent…",
          "Contenu": "Fantastic program with excellent communication from all levels of support. If you need software for easy customer relations and automated messages, then give SimpleTexting a try; you will not be disappointed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rhonda",
          "Nb_Reviews": 1,
          "Date": "2020-02-20T21:35:36.000Z",
          "Titre": "I've looked at a lot a texting…",
          "Contenu": "I've looked at a lot a texting platforms but hadn't found one that fit all my needs. Simple Texting does! And it's super easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie Bowden",
          "Nb_Reviews": 1,
          "Date": "2019-09-18T18:50:51.000Z",
          "Titre": "We love this app",
          "Contenu": "We love this app, it helps us get our answers from appraiser and we don't have to call them or email me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon Boley",
          "Nb_Reviews": 1,
          "Date": "2020-04-13T12:39:56.000Z",
          "Titre": "Great customer support and training",
          "Contenu": "Great customer support and training. Simple Texting has taken our non-profit to the next level of communication."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Panhia Her",
          "Nb_Reviews": 1,
          "Date": "2020-07-22T01:02:16.000Z",
          "Titre": "SimpleTexting customer service is…Outstanding",
          "Contenu": "SimpleTexting customer service is outstanding!  A customer agent is always available to help and guide with questions especially Teddy.   Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Passang Sherpa",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T06:23:18.000Z",
          "Titre": "We are able to reach our objective of…",
          "Contenu": "We are able to reach our objective of getting messages out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erica Hood-Vincent",
          "Nb_Reviews": 1,
          "Date": "2019-09-11T15:37:16.000Z",
          "Titre": "Two of My favorite Qualities....",
          "Contenu": "This platform has two of my favorite \"end user\" qualities, Powerful & Simple!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Will Bowcott",
          "Nb_Reviews": 2,
          "Date": "2022-09-02T11:50:40.000Z",
          "Titre": "fair resolution",
          "Contenu": "Had a billing issue.   Company resolved the matter in a fair manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marilyn",
          "Nb_Reviews": 1,
          "Date": "2019-12-09T19:12:12.000Z",
          "Titre": "Great Customer service",
          "Contenu": "The company continually reaches out with aspects of the program nd stays with you until it is implemented."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bernadette Santiago",
          "Nb_Reviews": 1,
          "Date": "2020-07-22T21:30:37.000Z",
          "Titre": "Easy to use and very helpful customer…",
          "Contenu": "Easy to use and very helpful customer service. All at a reasonable price!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith",
          "Nb_Reviews": 1,
          "Date": "2019-11-19T01:04:51.000Z",
          "Titre": "Easy to set up",
          "Contenu": "Easy to set up, first rate tech help.  Couldn't be more pleased.  SimpleTexting does exactly what I need it to do!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lonnie Moore",
          "Nb_Reviews": 1,
          "Date": "2020-07-27T00:25:56.000Z",
          "Titre": "The SimpleTexting team has been great…",
          "Contenu": "The SimpleTexting team has been great to work with! Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristine Ringsrud",
          "Nb_Reviews": 1,
          "Date": "2020-04-06T00:25:05.000Z",
          "Titre": "Customer service is awesome",
          "Contenu": "Customer service is awesome; staff are very pleased with the product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Subway",
          "Nb_Reviews": 1,
          "Date": "2020-02-10T14:19:45.000Z",
          "Titre": "Quick response from the customer…",
          "Contenu": "Quick response from the customer service team when you need help!Thanks again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2019-10-13T22:06:52.000Z",
          "Titre": "I’m a small business",
          "Contenu": "I’m a small business, this platform was exactly what I was looking for."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PCPilot",
          "Nb_Reviews": 6,
          "Date": "2020-10-08T18:05:40.000Z",
          "Titre": "Awesome!",
          "Contenu": "Awesome!Platform is easy to use, support is instant, and best of all great value."
        }
      ]
    }
  ]
}