{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "sims4usa.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ANIL SUKUMARAN",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T19:35:53.000Z",
          "Titre": "No support for the SIM",
          "Contenu": "There is no support as the website support team is not active. Better to get a SIM after travelling to USA"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Nicolay Balogh",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T22:39:56.000Z",
          "Titre": "My order for an eSim was not delivered",
          "Contenu": "My order for an eSim was not delivered! I then sent several messages that were eventually responded to when I no longer needed the eSim and was forced to buy a more expensive SIM from T-mobile. I'm still waiting for my money that was promised to be refunded.I am a very dissatisfied customer.Yours sincerely,N.W. Balogh"
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Ole Henry",
          "Nb_Reviews": 6,
          "Date": "2023-11-27T14:03:30.000Z",
          "Titre": "Failed delivery and failed refund.",
          "Contenu": "I ordered one eSim and one physical Sim. You never delivered any of them. Sims4USA made itself unavailable both by phone and by mail. And you never refunded me. I consider Sim4USA a scam."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Philip J Martin",
          "Nb_Reviews": 14,
          "Date": "2023-10-18T01:29:25.000Z",
          "Titre": "Delivery did not happen on the day they promised.",
          "Contenu": "I placed the order on 7th October 2023. In the FAQ it stated that the delivery address could be added at checkout. There was no delivery address to fill in, only the billing address. Delivery to the billing address should have been on the 10th October, two working days after ordering. It did not arrive and we left to fly to the USA on the 11th October. Communication has been poor - they promised a refund but I have chased this and have received no reply. To top it all, our baggage went missing and so I did not have phone SIM I could use to chase this up. Very disappointed. There is more to the story, all in all an exceedingly frustrating experience."
        },
        {
          "Note": 1,
          "Lieu": "BG",
          "Pseudo": "Moustafa Karassali",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T08:16:03.000Z",
          "Titre": "I did not receive the service I paid…",
          "Contenu": "I did not receive the service I paid for. I am left with the feeling that I have been deceived. I do not recommend it."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Kilian",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T22:35:18.000Z",
          "Titre": "SIM Card arrived to late, no refund",
          "Contenu": "SIM Card arrived 4 days later than announced, so 1 day too late (shipping to germany). No refund til now. Instead i bought a SIM card shortly after arrival in LA."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Terry Laidler",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T03:33:46.000Z",
          "Titre": "didnt work",
          "Contenu": "did not get cell service didnt work at all"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ken Jones",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T08:49:16.000Z",
          "Titre": "SIM not activated",
          "Contenu": "Arrived in USA, SIM cards had not been activated so we could not contact anyone to let them know we had arrived. Tried phone service provider, they said we had no valid SIM cards. Had to make other arrangements, very poor."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jackie",
          "Nb_Reviews": 19,
          "Date": "2022-09-15T17:50:52.000Z",
          "Titre": "Compatibility checker not accurate",
          "Contenu": "I checked that my phone was at least partially compatible for one of these SIM cards using the tool on the companies website. However when it came down to the nitty gritty the SIM card didn't work at all. When I queried as to why it wouldn't work I was told that my phone was completely incompatible. It would be a lot more helpful if the tool on the website to check compatibility was actually accurate. Had I known that the SIM wouldn't work I wouldn't have bought it. On the plus side the company did refund my money."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Graham Cox",
          "Nb_Reviews": 10,
          "Date": "2022-09-07T09:13:47.000Z",
          "Titre": "Very poor",
          "Contenu": "Very poor. Your use of FedX for delivery was not satisfactory. That firm refused to deliver to my address in a substantial Scottish city without surcharge. As a result a few days before my travel I am without a sim."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "David Colwell",
          "Nb_Reviews": 2,
          "Date": "2023-07-15T03:50:09.000Z",
          "Titre": "No Activation. No Plan. Ineffective Support. Ignored Previous Complaints.",
          "Contenu": "I was provided with a SIM, but it could not be activated. Lyra Mobile wanted me to purchase a service plan as if I had not bought a SIM already. There were two hours of additional hassles trying to activate it while navigating in the US without cell service.I was told I could not purchase the plan by phone using a Canadian Credit card. and Directed to a Lyra Mobile in-person provider at a Walmart, but once there the Walmart knew nothjing aboutn this provider. Then I bought a new SIM and plan with a different company, activated in person trouble-free.I reported my troubles to SIMS4USA three separate times and each time the only response was an invitation to provide a GOOD review. I asked for a full refund including delivery costs several times but no mention of a refund was made in response until AFTER I posted the original version of this review. I will revise again if the refund is made.My original review:You have ignored my complaints about non-delivery of service. This us my third time informing you. Without a response to the SUBSTANCE I have already submitted, I will be reporting you as fraud."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Mike K",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T07:20:38.000Z",
          "Titre": "Bad Customer Service- additional shipping costs",
          "Contenu": "Received the simcard really quick. After paying 19usd of shippingcosts I received an extra invoice from Fedex of 10Euro. After sending a mail to Sims4USA they don’t reply. Really bad customer service."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jenny Scott",
          "Nb_Reviews": 3,
          "Date": "2022-10-20T04:34:04.000Z",
          "Titre": "Why did I bother buying this card?",
          "Contenu": "Only just arrived,  haven't made any phonecalls, tried to today and apparently I have run out of  credit.  Not much success in  using data either,  seems to work occasionally."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Soraya Martin",
          "Nb_Reviews": 2,
          "Date": "2022-10-23T20:59:14.000Z",
          "Titre": "I do not recommend it",
          "Contenu": "We have been traveling through the US (New York, Washington DC, Miami, Seattle, San Diego and Los Angeles. We have not had internet in most places. Loading any page was very slow. It was very difficult to use the GPS to move from one place to another…  I do not recommend it."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Glenn Poole",
          "Nb_Reviews": 3,
          "Date": "2022-08-27T03:38:13.000Z",
          "Titre": "Very disappointed",
          "Contenu": "The coverage with this card was less than good.  I had no Internet or phone abilities at the location I was staying.  The activation process was not good do to low signal.  I have since dropped the service and taken a program with AT&T."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "lily",
          "Nb_Reviews": 2,
          "Date": "2022-06-11T17:36:46.000Z",
          "Titre": "don’t waste your time",
          "Contenu": "i’ve spent the last 3 days in tbe usa unable to use the sim card i was sent. no calls, no texts. no data. extremely dissatisfied with this failure of a company. after 3 days of calling the support number and emailing, asking for a refund i now have to go any buy a actual sim card for the rest of my trip. DO NOT WASTE YOUR MONEY ON THIS SCAM WEBSITE. still waiting for email replies almost 4 days later, this is disgusting. their phone number rings and then cuts off and no one contacts you back."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Joe",
          "Nb_Reviews": 3,
          "Date": "2022-05-03T14:48:37.000Z",
          "Titre": "Sim was delivered on time but as the…",
          "Contenu": "Sim was delivered on time but as the import tax was not included on the price i had to pay an extra €7 (including a very large processing fee from fed ex). when in the US i installed the sim and initially it worked but after making 1 phone call the sim stopped working and no matter what i tried (including instructions from the support email) it did not work again. The support email though courteous was of little help, in one email asking me to try an alternative phone! I consider myself reasonable technological savvy but no matter what i tried it would not work, when i asked for a refund i was told that the policy was no refunds. I would not use this service again and with the experience i have had could not recommended it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeff Keen",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T23:32:15.000Z",
          "Titre": "Poor product and service",
          "Contenu": "Lots of reviews on here from people that haven't even tried the product!  I bought an unlimited plan.  It worked perfectly for a few days and then data stopped.  Been without data for 24hrs which is VERY inconvenient when you are holiday.  Resolution via email is VERY slow.  They say they reply within minutes but it is more like 6 hours with messages like \"reboot your phone\".   Not very helpful.  Now they want to pass me off to Lycamobile.  Very unhappy with this product.  After a few days, they offered to switch me to another package.  I agreed but then never heard any more about it.  Eventually had to go to another provider"
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "sarah grunwald",
          "Nb_Reviews": 1,
          "Date": "2022-03-30T15:36:07.000Z",
          "Titre": "Horrible service",
          "Contenu": "Horrible service, can´t make calls, and can´t get online at all, can only use texting and whatsapp. Absolute waste of money."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "BILYANA STOEVA",
          "Nb_Reviews": 1,
          "Date": "2023-02-05T22:59:54.000Z",
          "Titre": "Still waiting for my refund it’s been a…",
          "Contenu": "I bought international plan meaning I can use in UK too but it’s not working that’s why I told them to refund me and they still ignore I paid for services that I didn’t receive refund !"
        },
        {
          "Note": 1,
          "Lieu": "CZ",
          "Pseudo": "AS",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T08:37:52.000Z",
          "Titre": "We did not receive sim cards that were…",
          "Contenu": "We did not receive sim cards that were purchased and paid for in advance."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aitor Daza De Silva",
          "Nb_Reviews": 1,
          "Date": "2022-03-20T10:43:51.000Z",
          "Titre": "Horrible connection",
          "Contenu": "My whole trip the connection was terrible and didn't work mostly all the time. Waste of time and money."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Peter",
          "Nb_Reviews": 7,
          "Date": "2023-05-09T17:00:33.000Z",
          "Titre": "Paid for card",
          "Contenu": "Paid for card. Still awaiting delivery 6 days on."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Daniel Porada",
          "Nb_Reviews": 2,
          "Date": "2023-03-31T16:00:49.000Z",
          "Titre": "poor signal",
          "Contenu": "poor signal, very slow internet, no signal in subway"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "..",
          "Nb_Reviews": 1,
          "Date": "2022-07-04T23:20:20.000Z",
          "Titre": "Data always failing and people could…",
          "Contenu": "Data always failing and people could not hear my voice in phone calls"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jose Lourenco",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T03:07:25.000Z",
          "Titre": "The sim card never arrived till this…",
          "Contenu": "The sim card never arrived till this moment"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan Magee",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T21:03:25.000Z",
          "Titre": "Gave me a Grub Hub old number",
          "Contenu": "Gave me a Grub Hub old number. Hundreds of texts and calls!"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "pat",
          "Nb_Reviews": 1,
          "Date": "2022-04-14T14:49:02.000Z",
          "Titre": "I havent used the sim card yet but when I did it did not work. I am not happy.",
          "Contenu": "I havent used the sim card yet.when I did it does not work.not happy."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "GM",
          "Nb_Reviews": 1,
          "Date": "2022-05-30T14:21:19.000Z",
          "Titre": "The SIM cards did not work in Chicago."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Gordon Lauder",
          "Nb_Reviews": 11,
          "Date": "2022-02-19T15:10:48.000Z",
          "Titre": "Goods did not arrive on day given by…",
          "Contenu": "Goods did not arrive on day given by Courier"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Willem",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T14:52:34.000Z",
          "Titre": "Can not phone Mobile phones outside the USA",
          "Contenu": "Can not phone the majority of our family in the Netherlands as the Simcard does not allow you to call mobile phones without paying extra. Only contacts with a fixed landline can be called. Although this is known by Sim 4 USA it is not communicated as such I rate the service provided by them as low. It would have been great if we would have known this before we purchased the simcard as not many people in the Netherlands have landlines anymore but use smartphones"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pat LeBlanc",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T23:53:11.000Z",
          "Titre": "Took over one week to get cards"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Job",
          "Nb_Reviews": 2,
          "Date": "2022-12-31T23:06:28.000Z",
          "Titre": "I would to use the SIM in a MiFi…",
          "Contenu": "I would to use the SIM in a MiFi router. That didn’t work.I do this in other countries without problems.Please fix this issue for future clients.."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Markus Fiedler",
          "Nb_Reviews": 2,
          "Date": "2022-05-25T18:51:51.000Z",
          "Titre": "The Mail was delayed",
          "Contenu": "The Mail was delayed. I could Not use your SIM Card. Please do not work with FedEx anymore. I was more then disappointed."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Claude Delhez",
          "Nb_Reviews": 3,
          "Date": "2023-10-21T09:03:52.000Z",
          "Titre": "Information",
          "Contenu": "It took several days before any notification, information over my order. Only the last 2 days i've receive info's from fedex over de delivery. Package received 10/20/2023"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Crystal Meakin",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T06:06:00.000Z",
          "Titre": "We experienced a lot of areas within North Dakota where there was some consistent coverage",
          "Contenu": "We experienced a lot of areas within urban cities low bars or no bars and other places with good bars. Especially through Wyoming and Rapid City, ND. It wasn't as bad in Grand Forks, ND. The strength and consistency of the signal should also be noted before purchase. Canadian data signals are definitely more consistent however I understand that it will depend on how the agreements T-Mobile has and where t b E coverage is. We didn't expect coverage through the mountains but we did expect coverage in urban areas and highways with flatter terrain."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kelly",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T00:00:50.000Z",
          "Titre": "Well…/",
          "Contenu": "I don’t know if it’s an agreement you have with T-Mobile or what it is, but for the 4 states we went through, the coverage is so spotty and slow. Simply brutal. I’ve come to appreciate our cellular service in Canada so much more than I have previously."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Roseann",
          "Nb_Reviews": 11,
          "Date": "2023-06-19T07:38:52.000Z",
          "Titre": "Not what I thought",
          "Contenu": "Rhis was purchased for my daughter who is in massachusetts for camp america but it only sends texts to other iphones so me as her mother can't recieve texts so rely on messenger and calls which when at work cannot get die to lack of signal. Contacted on murderous occasions to be told one of these things not what I paid for."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Noé",
          "Nb_Reviews": 4,
          "Date": "2022-11-13T21:36:35.000Z",
          "Titre": "Thank you for your service, but…",
          "Contenu": "We thank you for your service regarding how easy it was to reserve, receive, and activate our card, although a phone number was assigned to us by email without giving us time to chose the area. It was corrected after we called.Regarding the coverage of network, T-Mobile I think, it was often poor or inexistant outside cities."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tim Grant",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T15:36:41.000Z",
          "Titre": "SIMS4USA is a great product; customer service needs improvements",
          "Contenu": "The sim card that was mailed to me did not work.  The H2O Wireless dealer in Oxnard CA confirmed this.  I bought another SIMS4USA card from him, and it worked fine. While in his store, I called SIMS4USA and was told to email a refund request which I did on Feb.16th to the email address I was given. I heard nothing until a week later when I posted a negative review on Trustpilot. On March 9nd, I finally received the refund.  When a SIMS4USA sim card works, it is a great service. But the company needs to improve its customer service."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Roeland Roos",
          "Nb_Reviews": 3,
          "Date": "2022-06-16T14:01:03.000Z",
          "Titre": "I ordered my cards on Sunday and I…",
          "Contenu": "I ordered my cards on Sunday and I received them the following Friday. In between on Wednesday I contacted Sims4USA. After my request I got an confirmation mail mail telling me my cards were being shipped to the Netherlands. I thought I would get them in 3 businessdays.I purchased 2 different cards. I can't distinguish one from the other. So I don't know which one is one and which is the other."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rachel S",
          "Nb_Reviews": 1,
          "Date": "2022-04-30T21:58:14.000Z",
          "Titre": "The SIM arrived in the time scale…",
          "Contenu": "The SIM arrived in the time scale promised and was easy initially to put into the phone and use BUT network coverage was a bit patchy, and I was unable to make calls when I wanted to. Internet coverage was mostly fine"
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "M Dominique Desmettre",
          "Nb_Reviews": 8,
          "Date": "2022-05-10T17:14:27.000Z",
          "Titre": "I RECEIVED THE SIM CARD IN TIME",
          "Contenu": "I RECEIVED THE SIM CARD IN TIME, HAVE NOT USED IT YET, BUT GOT AN ADDITIONAL BILL FROM FEDEX, 1€+6€ HANDLING FEE FOR IMPORT TAXES..."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2022-07-30T13:39:58.000Z",
          "Titre": "i got the sim in a few days…",
          "Contenu": "i got the sim in a few days (Netherlands) , i haven't tried it yet so can't review that .i will after i tried it. Okay been in the US for a week now and the Sim working perfect , no  complaints at all."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mathilde",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T06:49:47.000Z",
          "Titre": "Order and payment for 2 sim cards",
          "Contenu": "Order and payment for 2 sim cards, received only one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Miloslav",
          "Nb_Reviews": 1,
          "Date": "2022-03-08T22:23:14.000Z",
          "Titre": "I had ordered the SIM with Plan for 59$…",
          "Contenu": "I had ordered the SIM with Plan for 59$ . SIM has been delivered. In that moment I just did realize what the mobile network was from.  a completely different plan was marked on the label and even though my phone works with it, the sim is not detected, it is not possible to find out which plan is activated and so on.  my email questioning to the seller is not a response.  I'm a little sorry I didn't go to the shop for SIM and let them settings there professional."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Timo S",
          "Nb_Reviews": 1,
          "Date": "2022-03-14T19:11:53.000Z",
          "Titre": "do not forget local duties & taxes",
          "Contenu": "do not forget local duties & taxesFAQ is not clear about local cost. For Germany an additional EUR 10,- to be added, as FedEx is paying duties & taxes in advance and adds a surcharge."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marius",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T21:44:18.000Z",
          "Titre": "One SIM card package was opened upon…",
          "Contenu": "One SIM card package was opened upon arrive, on this number we received scam calls and messages 24/7 which made the card pretty much unusable"
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "THEODOROS GKARDIAKOS",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T03:17:47.000Z",
          "Titre": "Ordered Sim",
          "Contenu": "Not received my order on due date , as told due to Thanksgiving delivery company malfunction.The activation was immediate after a Whatsapp conference. The company's explanation was immediate and adequate. Since the activation, no problems occured, and the international calls were in order.I am leaving US in two days, the sim card will be deactivated, but will positively reactivate on my next trip to the US in May"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Andrea",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T01:09:33.000Z",
          "Titre": "Delivery not respected but problem solved",
          "Contenu": "It was a good communication with the customer service, they were friendly and kind"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "James Robert Mason",
          "Nb_Reviews": 4,
          "Date": "2023-11-25T00:06:40.000Z",
          "Titre": "Very good experience",
          "Contenu": "Very good experience. Add to web page shipping address block in case it is different from billing address."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Bas van Genugten",
          "Nb_Reviews": 4,
          "Date": "2023-08-09T18:26:14.000Z",
          "Titre": "Fast and quick delivery",
          "Contenu": "Fast and quick delivery. For European customers: keep in mind that you will have to pay a separate (small) import duty as well.The coverage of T-Mobile wasn't great in the US. As expected, it works fine when you're in the big cities but when you're out in the desert or national parks, you're often without coverage. Don't know if the other providers are any better though, the US is after all a very big country."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Giuseppe Vanacore",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T09:43:08.000Z",
          "Titre": "eSim provided on time and easy…",
          "Contenu": "eSim provided on time and easy configuration. I found just a delay to be in touch thru email with SIMS 4 USA"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Lin",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T22:25:30.000Z",
          "Titre": "Great experience for a the first timer!",
          "Contenu": "I was truly impressed with how the representative handled my shipping situation so quickly. I feel relieved that I will have phone service the instant I land. Being able to communicate with my family is paramount when you’re travelling alone from so far away. Thanks Veboo."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Alex",
          "Nb_Reviews": 2,
          "Date": "2023-06-20T23:40:46.000Z",
          "Titre": "Had to chase for sim but their customer service fixed it instantly",
          "Contenu": "Had to chase for sim, although I think that was likely because of time zone differences and that I wanted it to start the same day. As soon as I reached out they sorted my order and I had the sim plan in minutes. The e-sim basically installed itself to my phone and it was working straight away. Would happily recommend!"
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Alan Porter",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T22:56:49.000Z",
          "Titre": "Very obliging and handy service",
          "Contenu": "Very obliging and handy service.  I'm looking forward to using the product next month. I might suggest sending an invoice and the alotted phone number with the sim card so that customers can let their friends and family know ahead of time. Otherwise great job."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Koning",
          "Nb_Reviews": 21,
          "Date": "2022-07-04T12:40:35.000Z",
          "Titre": "So far, so good.",
          "Contenu": "Ordered an unlimited USA simcard and it was shipped immediately and it arrived after 4 days in the Netherlands. Customs charged 9 euro's. I received an email from Sims4USA to verify the card number so they could activate the sim card on the day that I need it. Haven't arrived in the USA yet, but I have high hope it will be activated as soon as I am in LA"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Martin Lüscher",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T21:00:04.000Z",
          "Titre": "Very friendly",
          "Contenu": "Activation request of the SIM Card via Mail. Afterwards no problems at all so far. Very friendly contact. Thank you Travis."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alessio Centazzo",
          "Nb_Reviews": 2,
          "Date": "2023-02-22T17:20:49.000Z",
          "Titre": "Very smooth process",
          "Contenu": "Very smooth process, convenient delivery and timely attivati in of the simcard.I would add the option to keep same number/simcard if the user buys a monthly plan every 3/6 months"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "CHRIS HAW",
          "Nb_Reviews": 7,
          "Date": "2022-05-15T21:21:34.000Z",
          "Titre": "Great service eventually",
          "Contenu": "Although I stated that my travel day was the 12th when we landed in Dallas unfortunately the sims when activated had no credit even though each sim had cost $33 so we had no way of contacting our friends to advise what time we would be ready to be collected from the airport. I will say though after we found a Wi-Fi service we could connect to Sims5USA sorted the activation pretty much straight away."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Renske",
          "Nb_Reviews": 3,
          "Date": "2022-06-01T12:12:42.000Z",
          "Titre": "Delivered on time",
          "Contenu": "Delivered on time, it took me, being from another country, 12 times to call the customer service before everything worked. I did not have a zip code in the usa and i wanted to keep my own number, which was not possible. It works fine now, but it took too much time to get setteled."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Andrew Sheppard",
          "Nb_Reviews": 3,
          "Date": "2022-04-12T16:06:18.000Z",
          "Titre": "Product arrived on time",
          "Contenu": "Product arrived on time. Had a email to say it had been posted. So great customer service. Maybe A little instruction note inside package. But all info on website anyway. All good"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Joel",
          "Nb_Reviews": 6,
          "Date": "2022-10-28T07:42:05.000Z",
          "Titre": "Normally great",
          "Contenu": "Normally great! service, except this time FedEx was supposed to deliver my SIM card in France and it is still stuck ‘in transit’.  And I’m leaving for the US today-Oct 28, 2022."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Myers",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T00:44:10.000Z",
          "Titre": "Sims arrived fast",
          "Contenu": "Sims arrived fast. Had all the data I needed while driving in the USA. Good coverage from Canada to Florida. Did have trouble calling my daughters who were with me, with their own sims. Not sure why. Probably user error. Lol."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Shari B",
          "Nb_Reviews": 6,
          "Date": "2022-06-24T14:08:26.000Z",
          "Titre": "I had an interesting situation…",
          "Contenu": "I had an interesting situation and needed 3 different SIM cards for 2 phones (total 6 cards).  I picked the plans I wanted and gave the dates for each one.  The only problem was... when I received all 6 SIM cards, they were in a FedEx envelope (with no paper or anything) and I could not tell them apart.  On the same day I received the cards I wrote the company asking how I would know which card was which.  Not long after I sent that email, I received an email with the code on each SIM, the start date and the amount I bought the SIM card for (the plan I chose).  I am happy.  I am looking forward to this going smoothly!"
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Kathleen Mcdonagh",
          "Nb_Reviews": 2,
          "Date": "2022-09-12T13:30:30.000Z",
          "Titre": "Good experience",
          "Contenu": "Received card before I left which was overseas in Ireland. ( However I did have to pay extra due to customs fee which is not Sim 4 USA fault they were not sure). With that I was very please. I did receive my number before I left and told my family so they would have the number. However they did not put it in ( which they will do next time) because my Sim number came up a different name and sometimes I had to text and then call so they would know it was me. I was not worried about having enough data and use my card to call back many times. I send an email upon arriving because I could not make a call and a response was send right away and I had no issues after that. Being able to use What's App was great with no worries of where I was.  I would get a card again the next time I travel to the states."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Niall J",
          "Nb_Reviews": 2,
          "Date": "2022-05-03T06:59:08.000Z",
          "Titre": "SIM arrived on time and Lycamobile…",
          "Contenu": "SIM arrived on time and Lycamobile network available in most locations...SIM number received a few calls from unsolicited callers...but otherwise good..."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Thor",
          "Nb_Reviews": 3,
          "Date": "2022-08-14T06:38:53.000Z",
          "Titre": "Absolutely great",
          "Contenu": "Absolutely great. The only thing I'd wish is to get the mobile number not at activation date. Just a few days before."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Sean Connor",
          "Nb_Reviews": 1,
          "Date": "2022-07-10T12:58:33.000Z",
          "Titre": "Quick",
          "Contenu": "Very quick postage out to me etc. Although I cannot give a proper review till I actually get to the USA and see it working etc"
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Ted Kyriacou",
          "Nb_Reviews": 15,
          "Date": "2023-05-03T19:14:11.000Z",
          "Titre": "No connection on date ordered",
          "Contenu": "No connection on date ordered. Company apologised for delay and upgraded my subscription. No problem since."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Margaret A Torrance",
          "Nb_Reviews": 3,
          "Date": "2023-04-04T03:18:07.000Z",
          "Titre": "Customer Service Solved my Challenge",
          "Contenu": "I had some initial difficulties getting my phone set up, but when the issue was brought to the company's attention, it quickly rectified the issue."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Jörg Hoffmann",
          "Nb_Reviews": 1,
          "Date": "2022-10-13T22:38:51.000Z",
          "Titre": "I received the SIM card within two days…",
          "Contenu": "I received the SIM card within two days - amazing. Can not tell anything about the service in UA yet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Murali Pillai",
          "Nb_Reviews": 2,
          "Date": "2022-05-14T21:55:59.000Z",
          "Titre": "Happy with the customer service…",
          "Contenu": "Happy with the customer service provided. The response to queries was quick and helpful. Overall, pleased with the product. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Arnold van Wetten",
          "Nb_Reviews": 2,
          "Date": "2023-08-10T01:28:55.000Z",
          "Titre": "Great , usa4sim good, subscription @ tmobile poor.",
          "Contenu": "Great , however tmobile is weak, h2o a lot better, 4 less money."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 7,
          "Date": "2023-03-14T08:08:37.000Z",
          "Titre": "Good delivery",
          "Contenu": "we ordered the sim cards. They turned up in four working days. We have not tried them yet but we were happy with the delivery."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peter Persson",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T23:50:31.000Z",
          "Titre": "It was easy to order in advance of my…",
          "Contenu": "It was easy to order in advance of my trip. The sim card was sent to my hotel and was up and running in seconds."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "R. Kruijff",
          "Nb_Reviews": 1,
          "Date": "2022-04-20T10:30:03.081Z",
          "Titre": "After ordering super fast send to the…",
          "Contenu": "After ordering super fast send to the Netherlands. Within 3 days received!👍"
        },
        {
          "Note": 4,
          "Lieu": "BG",
          "Pseudo": "Vladislava Katelieva",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T18:09:11.000Z",
          "Titre": "The communication was slightly…",
          "Contenu": "The communication was slightly difficult at the beginning but then I got responded and the sim worked properly."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Vincent",
          "Nb_Reviews": 6,
          "Date": "2022-04-29T21:15:00.000Z",
          "Titre": "Product brilliant",
          "Contenu": "Product brilliant. Instructions etc. a little sketchy. Will use again."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "roy lawrance",
          "Nb_Reviews": 9,
          "Date": "2022-05-09T01:51:43.000Z",
          "Titre": "It works easier than described"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susan Engel",
          "Nb_Reviews": 2,
          "Date": "2022-03-10T22:23:48.000Z",
          "Titre": "• Delivery was quick and uncomplicated.",
          "Contenu": "• Delivery was quick and uncomplicated.• Setup was easy enough.• Only drawback was that someone else had the same number. Got a slew of wrong numbers and text messages.Nevertheless, I would come back"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Jeroen Cosijnse",
          "Nb_Reviews": 1,
          "Date": "2022-07-16T22:36:53.000Z",
          "Titre": "Great service"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "QUOC KHANH  NGUYEN",
          "Nb_Reviews": 7,
          "Date": "2022-03-21T21:05:42.000Z",
          "Titre": "Fast delivery",
          "Contenu": "Respect the delivery time"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "FB",
          "Nb_Reviews": 1,
          "Date": "2022-05-07T06:46:01.000Z",
          "Titre": "Everything ok"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "daniel frances",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:48:45.000Z",
          "Titre": "Sent me an esim card",
          "Contenu": "Sent me an esim card, to allow me to use the service sooner."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Chris De Jong",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T18:09:36.000Z",
          "Titre": "Despite ordering a few days before…",
          "Contenu": "Despite ordering a few days before depart the sim card was delivered in time. Good job!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John",
          "Nb_Reviews": 3,
          "Date": "2023-10-11T20:12:56.000Z",
          "Titre": "New US sim",
          "Contenu": "The sim I ordered arrived as promised via Fed Ex.It started operating on the day I requested although in the UK we are 5 hours in advance of New York so it started working in the afternoon/evening.A very efficient service."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Robrecht VanderGrift",
          "Nb_Reviews": 2,
          "Date": "2023-09-22T21:59:51.000Z",
          "Titre": "Sims 4 USA…",
          "Contenu": "Our first experience with a pre paid simcard, when travelling thru USA. This company works with T-Mobile sim cards. We bought the 12GB calls and text. On our 2 sim phone we added the card. Worked perfectly, and you are able to keep your original sim with NO roaming, and the second Sims 4 USA as the internet connector. Allows you to use Google Maps for Sat Navigation too. At the moment of installing the pre paid Sim, its mobile number pops up. Their support desk replies with 8 working hrs. As we had some troubles in National Parks. Turned out to be a blank in covering. None of the big networks performed their. Parks Wifi was powered by Starlink, we found out later. Long story short. For us the perfect solution to be connected during travelling California: SIMS 4 USA. Rob"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T21:10:27.000Z",
          "Titre": "Very good service",
          "Contenu": "Very good serviceWanted to stay longer and wanted to prolong plan via provider - not possible because they didn’t accept a foreign credit card…..(tried Visa and Mastercard)Contacted SIMS 4 USA. Easy and fast prolongation accomplished (special thanks to Veboo 🙏)"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Daniel",
          "Nb_Reviews": 2,
          "Date": "2023-05-07T15:23:03.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "I had some slight issues trying to connect when I arrived in the US, but 1 email and a phoncall from Travis later it was working perfect.I'm able to use mobile data/Internet plus make calls and texts within US. Just what I wanted.The customer service was excellent.I am on vacation from Ireland and I use an unlocked android which works perfect with the sim card.Thank you Travis and the team at Sims4USA."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Mr clancy",
          "Nb_Reviews": 11,
          "Date": "2022-05-11T13:51:01.000Z",
          "Titre": "Excellent service",
          "Contenu": "Bought a $33 15gb package before travelling from Ireland and had it activated the day before we arrived in New York. I literally swapped out my sim and it worked straight away without any issues or set up. Never failed once. Would highly recommend without hesitation.FYI I did just receive a duty and tax bill from FedEx for €7.19 but still wirth the purchase."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Ellen mary Murphy",
          "Nb_Reviews": 12,
          "Date": "2023-07-18T09:18:12.000Z",
          "Titre": "Hassle free SIM whilst travelling in the US.",
          "Contenu": "Fast , efficient and transparent service . I ordered my US SIM card online and it was delivered via courier to my home address in Ireland within a week . I inserted my new sim whilst on my flight to the US and upon arrival it worked like a dream , a great service and company to deal with."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "LUKE HUCKLE",
          "Nb_Reviews": 3,
          "Date": "2022-11-03T11:40:42.000Z",
          "Titre": "Fast delivery, great customer service, strong signal",
          "Contenu": "The SIM card arrived very quickly after ordering, and was perfect for us (being Brits heading to America). The signal was strong, it worked in our UK unlocked phone no problem, and was absolutely ideal for us whilst on holiday. We shall definitely be getting a SIM card through SIMS 4 USA again."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Manus Cornelius",
          "Nb_Reviews": 25,
          "Date": "2023-09-05T12:29:12.000Z",
          "Titre": "The service was excellent",
          "Contenu": "The service was excellent. The eSim was sent to me and when I clicked on the link, it added the sim automatically. When I arrived in New York and switched it on, it worked immediately with good Internet speeds."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Donna McAllister",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T15:56:54.000Z",
          "Titre": "Very fast delivery",
          "Contenu": "Very fast delivery, albeit from Amazon, lol.  The price in Canada quite high compared to USA.Haven’t used their services yet, but expect no problems, as I know others that have.Edit - May 13, 2023Changed SIM card and the connection was seamless. All activities work as expected."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Customer Peter",
          "Nb_Reviews": 6,
          "Date": "2022-05-10T16:03:08.000Z",
          "Titre": "Absolutely brilliant",
          "Contenu": "Absolutely brilliant! Bought the... Unlimited Nationwide Talk & Text & Unlimited Data with 18GB at up to 4G/5G speed for myself & my wife. Sims arrived in 3 days - activated them 3 days before leaving for the USA to make sure & they both worked as soon as we landed.Data was fantastic - especially as I needed it for google maps. Thought it might run out but no problems.Would definitely use again!!"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Mary",
          "Nb_Reviews": 4,
          "Date": "2022-12-08T04:30:38.000Z",
          "Titre": "Absolutely Fabulous",
          "Contenu": "I contacted Sims4USA to ensure I could ring Irish land lines and mobile numbers.  The response was immediate and made my decision easy to purchase the sim.  The sim was waiting for me in Miami at my hotel when I arrived.  The company had the card activated and everything was very smooth.  The next time we visit the USA we will get 2 x sims - one for my husband and I as he also thought it excellent value for money."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Jonas",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T21:27:38.000Z",
          "Titre": "Issues fast resolved",
          "Contenu": "My girlfriend bought a SIM for her USA stay. There were some complications with the activations which were resolved within minutes with the help of Travis.Would recommend again :)"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Caitriona  O donnell",
          "Nb_Reviews": 3,
          "Date": "2022-06-03T20:40:18.000Z",
          "Titre": "Highly recommend",
          "Contenu": "Highly recommend, I paid twice by accident, they double checked with me by email, refunded me straight away and my sims were in Ireland in 2 days!There was a E6 customs charge but I was expecting some kind of charge with FedEx. Brilliant Service and looking out for their customers!Thank you 🇮🇪"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred Vivier",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T17:05:31.000Z",
          "Titre": "Bought 2 SIM cards for a 1 month…",
          "Contenu": "Bought 2 SIM cards for a 1 month vacation in Florida. 1 card was activated on March 12 and worked smooth and easy. Tried to activate 2nd card March 17 but did not work. Called the tech support and spoke with Ali who quickly solved the problem. Will use for all international travel. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Oliver Reiser",
          "Nb_Reviews": 5,
          "Date": "2022-04-02T20:48:26.000Z",
          "Titre": "Very fast delivery",
          "Contenu": "Very fast delivery, activation happened on the date we indicated, and the SIM Cards worked immediately on both of our iPhone (iPhone X and iPhone Xs dual sim) without any problems. Data is fast, voice quality perfect. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "J White",
          "Nb_Reviews": 8,
          "Date": "2022-06-08T09:45:47.000Z",
          "Titre": "Couldn't have been easier to use",
          "Contenu": "Couldn't have been easier to use. Simply swap sims and away you go. Did have an issue sending SMS messages but Whatsapp covered that. Availability of Wifi/4G in the USA was surprisingly low in places (with many blackspots) but that's a different issue."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Cormac Forkan",
          "Nb_Reviews": 1,
          "Date": "2022-06-04T22:54:33.000Z",
          "Titre": "A fantastic service from beginning to end",
          "Contenu": "A fantastic service from beginning to end. From once I inserted the sim into my phone upon arrival at the airport, I was able to make calls nationally and internationally, check emails, browse the web and use google maps. I would recommend SIMS 4 USA for your trip to the US."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Sandra Bom",
          "Nb_Reviews": 3,
          "Date": "2022-07-11T09:59:46.000Z",
          "Titre": "Fast delivery, works as promised",
          "Contenu": "Very pleased with their service and the sim works as promised. Shortly before our trip we found out the flight was changed and we would arrive a day early. I wrote them an email if it was possible to change the activation date. They responded within the hour that it was done. Although I was a bit sceptic, they kept word and the sim worked on arriving in USA. We use it only as a hotspot for wifi and not for texting and calling, and chose unlimited data. Perfect to have our own wifi hotspot while traveling and not having to rely on free wifi from hotels/restaurants."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Con",
          "Nb_Reviews": 13,
          "Date": "2023-10-04T01:02:42.000Z",
          "Titre": "Great service.",
          "Contenu": "Sim was delivered on time as promised. It activated when inserted and the level of service was as promised. I would recommend the product."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Tony Devoy",
          "Nb_Reviews": 3,
          "Date": "2022-06-16T14:37:28.000Z",
          "Titre": "Issue resolved",
          "Contenu": "My issue with SIMS 4 USA has been resolved, many thanks! More up-front and obvious information would have averted the issue but to be fair it was sorted within 24 hours. I look forward to having coverage in the US soon and hope it works as seamlessly as advertised."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John",
          "Nb_Reviews": 11,
          "Date": "2022-04-14T15:15:12.000Z",
          "Titre": "Great buying experience",
          "Contenu": "I preface this by saying I haven’t used this Card in the states yet but the buying process was really easy and the guys at Sims4usa were really helpful.The sim arrived within 3 days as promised, the price was great so as long as it works I’ll be very happy!"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "peter gerrits",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T01:50:21.000Z",
          "Titre": "substitute sim",
          "Contenu": "I ordered a sim,had it sent to my daughter in LA who then sent it to me in Portugal.it remained stuck in the Portuguese mailsysteem for so long i flew to the usa without it.i contacted Sid if it was possible to have a substitute sim sent to my hotel in SF.and sure enough in 24 hrs i got it.unparallelled customer service. The sim worked like a dream,the dataplan worked perfect for 2 weeks of Waze driving thru CA,and all that because of Sid's sense of customer service.Briliant!!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Satisfied Customer",
          "Nb_Reviews": 3,
          "Date": "2022-05-14T00:11:39.000Z",
          "Titre": "Excellent!",
          "Contenu": "Found Sims4USA on line and took a chance.... Turned out great website, great customer service , very reasonable prices and the simcard activated immediately when I arrived in the country on the appointed date.Very happy I found you!Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Daniel",
          "Nb_Reviews": 8,
          "Date": "2022-03-20T22:38:47.000Z",
          "Titre": "Top customer service chat",
          "Contenu": "Top customer service chat. Very happy with the service and signal while I was in America fir two weeks , I'll do the same again everytime I go to America (I'm from Europe) best I'll do next time is giving the address of the hotel to be no delays with customs."
        },
        {
          "Note": 5,
          "Lieu": "UZ",
          "Pseudo": "SBGALAN",
          "Nb_Reviews": 4,
          "Date": "2022-08-26T08:38:30.000Z",
          "Titre": "Great service. Advisable if you are travelling to USA",
          "Contenu": "Great service. Coverage was pretty límited in Missouri and some parts of West Kentucky, where we had to reboot the smartphone from time to to time to recover coverage. The rest great. I would advice everybody to get one SIM4USA when preparing their tripa to USA"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Gianfranco",
          "Nb_Reviews": 3,
          "Date": "2022-07-08T16:03:55.000Z",
          "Titre": "At the moment I am satisfied with the…",
          "Contenu": "At the moment I am satisfied with the support that was provided to me when purchasing the SIM CARD for the United States. I hope that the signal coverage is also adequate, but I can only confirm this after my return to Italy."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Dhr. A. Kooi",
          "Nb_Reviews": 7,
          "Date": "2022-08-17T23:49:40.000Z",
          "Titre": "Perfect solution when you go to the USA",
          "Contenu": "I bought the $59 plan with unlimited data (and calling & texting) as I wanted to use it as hotspot for our family of 5 during a 14 day vacation in the USA. The simcard worked exactly as expected.  The card was send quickly to my home address and the communication was quick, clear and professional.  I used an extra phone as hotspot and that worked perfectly. The simcard was activated the day we arrived so before leaving the airport the five of us online. The provider is Lyca. I did not know them but coverage was good almost everywhere.  We where in Texas and California. I have no experience in other areas of the USA.Everything went flawlessly so kudos to Sims4usa. I can only recommend to also purchase if you plan to go to the USA."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "TriniVJ",
          "Nb_Reviews": 2,
          "Date": "2023-07-21T14:30:18.000Z",
          "Titre": "Excellent service!!!",
          "Contenu": "Got my eSIM before I travelled and it was active as soon as I landed. Data and voice coverage in NYC was excellent!!Needed this for work and also to send pics to all my friends and family.Will use this service again!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "A",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T03:26:54.000Z",
          "Titre": "Received exceptional customer service",
          "Contenu": "Received exceptional customer service. I had forgotten my sim in the U.K. during my trip to US. They went above and beyond to rectify my mistake and had me shipped out a new SIM card and delivered the same day. Amazing company!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Steven",
          "Nb_Reviews": 30,
          "Date": "2022-06-09T13:29:58.000Z",
          "Titre": "Excellent product",
          "Contenu": "I was a bit worried that the sim wouldn't be delivered to my home address on time for my holiday but I needn't have panicked. It came a few days before we left as promised. When we arrived in USA I inserted the sim into my phone and it registered straight away no hassle. I have used the card for unlimited data over 4 weeks in U.S. and made calls to UK and internally within the states with no problems. I also received calls both from UK and U.S. numbers. No extra costs on top and great value no problem coverage in all areas visited.I would recommend this product and use again on my next visit to the states."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Iwens",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T09:09:20.000Z",
          "Titre": "we buy this en within a week it was…",
          "Contenu": "we buy this en within a week it was arived in belgium for the vacation in usa in november"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Noemí Melul",
          "Nb_Reviews": 1,
          "Date": "2022-04-23T17:23:07.364Z",
          "Titre": "Exactly what was announced! Great experience",
          "Contenu": "Got the sim in Tel Aviv 3 days after ordering it and by the time I put it in my phone on my arrival to the USA it worked immediately! Didn't need to do anything to activate it and had no problems at all"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Maria Giretto",
          "Nb_Reviews": 1,
          "Date": "2022-06-27T13:14:09.000Z",
          "Titre": "Just like Apple - it worked!",
          "Contenu": "the card just worked, I had great coverage, and was able to use the phone as a hotspot for my other/multiple devices concurrently.Definitely took away any headache on overseas roaming charges."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 4,
          "Date": "2022-05-07T20:55:41.000Z",
          "Titre": "this is great very fast delivery to the…",
          "Contenu": "this is great very fast delivery to the UK, when we arrived in Florida put the sim in and away it went, this is now a must if you have a hire car and want to travel around a bit, a one month sim is just right, I will be using SIMS 4 USA again.Thanks"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Stephen",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T20:14:59.000Z",
          "Titre": "Travis helped me figure out a problem and Service was fast",
          "Contenu": "Service was fast, received my sim card in 1 day, and even though I made a mistake with the order Travis was able to sort out my problem and help me resolve the problem.  Thanks Travis."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Lee",
          "Nb_Reviews": 2,
          "Date": "2022-11-20T01:15:40.000Z",
          "Titre": "SiMS initially had an issue but it was remedied fairly quickly.",
          "Contenu": "We landed in Miami, tried to activate our SIMs per the instructions and get a message that says we don't have enough money on our plans and need to top up.  This should not be the case since I already paid for two unlimited plans.UPDATE.  I was able to reach them and there was a server issue. They promptly remedied our issue and we are good to go now. They even upgraded our plan since there was a delay with our activation."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Lukas Stark",
          "Nb_Reviews": 1,
          "Date": "2022-07-14T17:31:28.000Z",
          "Titre": "Friendly customer service",
          "Contenu": "Friendly customer service. The prepaid card came a few days after order. I didnt test the prepaid card yet because i will go to the USA in a few weeks but until now i am fully satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arianna Trudu",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T23:18:51.000Z",
          "Titre": "Highly recommended",
          "Contenu": "My experience with this company has been absolutely amazing, they have a very responsive and efficient customer service, I'd recommend it to anyone traveling to the USA. The sim works exactly how it is supposed to, you just insert it in your phone and it starts working. No further action required. It made my arrival to the USA so smooth and easy since I absolutely needed Google Maps to get around as soon as I left the airport! I'd suggest the company to broaden maybe the offers since it's available only the monthly one, however it's quite expensive if you are staying for a shorter period of time. I stayed only for 2 weeks and I had to pay the monthly charge :/ that's the only \"downside\", but the connection works fast and it's reliable, so it's highly recommended regardless. I'd definitely use this service again."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Catherine May",
          "Nb_Reviews": 3,
          "Date": "2023-07-16T00:14:23.000Z",
          "Titre": "Great to be able to have an actual sim…",
          "Contenu": "Great to be able to have an actual sim before you travel however you have to remember delivery charges and customs charges on top of your base price"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Abootje Holland",
          "Nb_Reviews": 3,
          "Date": "2023-03-21T20:40:48.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, great advice. Quick delivery from the US to the Netherlands (within 3 days). Questions? They respond very quick and help you anyway possible. Very happy !!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Olivia Needham",
          "Nb_Reviews": 1,
          "Date": "2022-06-21T01:31:20.000Z",
          "Titre": "The sims work 100% allow more than 3 days",
          "Contenu": "The sims work 100%, I had to pay additional taxes in Ireland which caused delay. Allow more than 3 working days. I’d say minimum 7 working days with customs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vanessa",
          "Nb_Reviews": 1,
          "Date": "2022-06-06T02:55:40.000Z",
          "Titre": "I have a OnePlus 6 and worked",
          "Contenu": "I have a OnePlus 6. Once I arrived in the USA I added the sim card into my phone. After a few minutes (faster than I thought tbh!) it started working perfectly. No stress at all. The annoying part is that I could not easily get the cell number. Looked online some numbers that you can call to receive the phone number but I didn't get it. Therefore, I sent a msg to sims4usa and they quickly replied with simcard number.  :)"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Paulo Veiga",
          "Nb_Reviews": 1,
          "Date": "2022-07-04T22:25:19.000Z",
          "Titre": "It works quite well",
          "Contenu": "It was quite fast to arrive. Less then 3 work days. It was activated exactly when requested and it is working perfectly and as described.Support on request was quick and easy"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Gordon MacLean",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T06:22:00.000Z",
          "Titre": "ESIM was used when I could not get SIM card shipped in time",
          "Contenu": "When the company knew I could not have a SIM card delivered before I left for the usa, the did an ESIM activation after I provided them with the IMEI and ESIM numbers they needed. The day I landed in the USA my phone was working and I was provided with a usa phone number. Great work. All good"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Daniel Grossrieder",
          "Nb_Reviews": 2,
          "Date": "2022-12-19T22:18:50.000Z",
          "Titre": "Easy and fast ordering process.",
          "Contenu": "Easy and fast ordering process.Excellent client service and fast mailing.One comment though: should be displayed by when the sim card can arrive at an international address before order is submitted. However, I sent an email to client service, received an answer with options within 2 hours by email and a solution could be agreed and implemented immediately."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Richard Connor",
          "Nb_Reviews": 7,
          "Date": "2022-05-09T11:53:32.000Z",
          "Titre": "Delivery and Activerung went well.",
          "Contenu": "Delivery time: about 4 days. (to Germany).Fed-ex delivery without any problems.The card activation here in Germany seemed to work ok  I have not received my telephone ☎️ number yet but am hoping, at the very latest, I will receive that number when we arrive in the US.More Review when I have a chance to use the card, when on vacation in the USA.Update: 15.05.2022- Received my activation notification+Telephone number per email today.👍Continued on 09.05.2022:We have been in the US (Virginia and North Carolina) now for one week.We had Data and could make and receive calls immediately after we disembarked the aircraft. Something very important to remember! If you have a double Sim in your phone, don't just switch from one card to the other on your phone . You must deactivate the one you are not using, as long as you are not using it. Do this already in the aircraft. Failure to do this could result in expensive roaming charges and defeat the purpose of this card. Netz was ok except in the mountains (sporadic) and some remote places. In general, thumbs up 👍"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Con",
          "Nb_Reviews": 13,
          "Date": "2022-09-18T02:05:26.000Z",
          "Titre": "Excellent service",
          "Contenu": "Sim arrived on time, very fast delivery. It activated just when required and has been in use for over a week already. Great coverage. Very satisfied with the service"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Katherine Baldry",
          "Nb_Reviews": 13,
          "Date": "2022-07-19T08:20:39.000Z",
          "Titre": "Really helpful",
          "Contenu": "Really helpful. I asked lots of questions which were no trouble. It’s a lycamobile SIM card but being able to get it to uk for my son before his trip was a bonus. Would definitely recommend"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Stolt Perseverance",
          "Nb_Reviews": 1,
          "Date": "2022-10-23T21:22:18.000Z",
          "Titre": "Ordered 11 SIM cards for ships crew",
          "Contenu": "Ordered 11 SIM cards for ships crew and all arrived safely via the ships agent in New York and all working good, no issues whatsoever."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "F. O'Boyle",
          "Nb_Reviews": 1,
          "Date": "2022-05-26T13:21:19.000Z",
          "Titre": "Perfect",
          "Contenu": "Simple process, all we had to do was insert the new SIM cards. Worked flawlessly from the moment we landed. Would recommend to anyone visiting the US."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Matu",
          "Nb_Reviews": 30,
          "Date": "2022-04-21T17:47:06.165Z",
          "Titre": "Very easy ordering",
          "Contenu": "Very easy ordering, swift delivery and good price, Hope everything goes ok once it is activated on the 30th April. So far excellent."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "John Denny",
          "Nb_Reviews": 12,
          "Date": "2022-06-17T15:09:53.000Z",
          "Titre": "Great ongoing service",
          "Contenu": "I travelling to the US again later this month having been there in April. Sid helped with the sim renewal very efficiently - great service - Thanks."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Claudio",
          "Nb_Reviews": 5,
          "Date": "2022-10-03T08:12:55.000Z",
          "Titre": "SIM worked fine at first switch on",
          "Contenu": "SIM started to work at first witch on as expected.Phone number was delivered up to request to customer service.Very helpful."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Toni McGregor",
          "Nb_Reviews": 2,
          "Date": "2023-01-31T03:43:54.000Z",
          "Titre": "Very easy to use.",
          "Contenu": "Very easy to use.SIM card arrived overnight.Customer service when I contacted them were great…fast response and answered my question."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Thomas L",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T16:25:06.000Z",
          "Titre": "Very happy",
          "Contenu": "Very happy with the speedy delivery of the SIM card and with the speedy response to emails too. The SIM worked really well for our trip to the US and I'd recommend these guys and will use again for our next trip."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Mirjam",
          "Nb_Reviews": 4,
          "Date": "2023-06-02T03:13:40.000Z",
          "Titre": "Our simcard was not compatible without…",
          "Contenu": "Our simcard was not compatible without our phone but Veboo helped us and got us a refund. Very positieve about the service."
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Peter Gerrits",
          "Nb_Reviews": 4,
          "Date": "2022-11-02T00:15:52.000Z",
          "Titre": "Fantastic customer service",
          "Contenu": "i ordered a sim card for my dad to visit the usa, got stuck in the portuguese CTT for about 4 weeks (!!!). upon arrival in the usa my dad asked if a substitute sim could be sent to his hotel...in 2 days it was there and worked absolutely great. without it he wouldnt have been able to do all he did"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Zayn Niki Sorabjee",
          "Nb_Reviews": 4,
          "Date": "2023-03-20T12:46:18.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. They answered all my questions prior to buying it on live chat, fairly promptly too. The Sim didn't work when I first put it in but it was a simple case of me having to turn my phone off and on and then it did. Again was helped by the live chat agent with that. Would highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Maedbo",
          "Nb_Reviews": 23,
          "Date": "2022-05-20T00:06:53.000Z",
          "Titre": "First time I used SIMS4USA was…",
          "Contenu": "First time I used SIMS4USA was delighted with service, arrived in Europe to my home on time. Service was activated remotely as request and kicked in perfectly when I landed in USA.  Big thanks guys! great value."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T06:33:05.000Z",
          "Titre": "Good prompt communication",
          "Contenu": "Good prompt communication. Follow up for activation was secure. SIM card is working well. I will use you again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CMB",
          "Nb_Reviews": 3,
          "Date": "2022-05-20T02:09:31.000Z",
          "Titre": "This is the first time I got a prepaid…",
          "Contenu": "This is the first time I got a prepaid card to use while in the States and the experience has been great. Sid Dee was a great help in trying to contact me and activating the SIM card for me. Thank you Sid for your help!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Alain Beliveau",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T02:38:49.000Z",
          "Titre": "I am impressed with the fast delivery…",
          "Contenu": "I am impressed with the fast delivery service. I would not hesitate to use your services again."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Jason Ryan",
          "Nb_Reviews": 5,
          "Date": "2022-06-21T02:30:44.000Z",
          "Titre": "Brilliant service",
          "Contenu": "Brilliant service! Responses lightening fast to any questions I had. Can't recommend highly enough!Jason - Sydney"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "die Pendler",
          "Nb_Reviews": 6,
          "Date": "2022-03-20T22:40:08.000Z",
          "Titre": "Until today",
          "Contenu": "Until today, after days usage we are happy. No problems at all.Easy and uncoplicated start.2 German users"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dirk Mentzer",
          "Nb_Reviews": 3,
          "Date": "2022-05-05T14:51:53.000Z",
          "Titre": "All fine",
          "Contenu": "Everything works like promoted.Although some issues with the delivery (due to FedEx problems) the service and the plug and play was excellent, fully recommended to use."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Declan Ronayne",
          "Nb_Reviews": 3,
          "Date": "2023-03-19T18:35:51.000Z",
          "Titre": "Sorted !",
          "Contenu": "A test of a company is when something g goes wrong. Got a two month sim from these guys but tbe phone provider cut us off after a month. No phone !! Crisis !!! One mail to Travis and sorted out in 10 minutes. Impressive. Well done"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Derry Browne",
          "Nb_Reviews": 2,
          "Date": "2022-04-25T22:37:39.540Z",
          "Titre": "Quick and easy set up",
          "Contenu": "Quick and easy set up. Much cheaper and less time consuming than trying to buy SIM when in the US. Did exactly as promised. Recommend it"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "J Kinsella",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T10:58:54.000Z",
          "Titre": "Satisfied customer",
          "Contenu": "Satisfied customerFast efficient service for delivery of SIM. Hope connection works as well when we come to use it."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "richard leblanc",
          "Nb_Reviews": 2,
          "Date": "2023-03-12T00:56:22.000Z",
          "Titre": "Everything work has planned,no need to…",
          "Contenu": "Everything work has planned,no need to activated sim 4 usa do it for you,disregard the info on sim card"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Suzanne Prosser",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T03:01:34.000Z",
          "Titre": "Excellent service & product",
          "Contenu": "The service was great as I had an issue  with activation but they were very quick to resolve it via email.  Very pleased!  Would order again"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Terence",
          "Nb_Reviews": 71,
          "Date": "2022-05-16T12:09:02.000Z",
          "Titre": "Excellent Service",
          "Contenu": "SIMS 4 USA stuck to their promise and shipped the SIM to me in the UK in a couple of days and I had it well before my trip to the US.The SIM activated with no trouble on arrival in the US.The SIM did everything it said on the tin. It was excellent and I wil be ordering again for my next trip to the US."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Alfred Kooi",
          "Nb_Reviews": 10,
          "Date": "2022-06-10T20:46:19.000Z",
          "Titre": "Fast and professional",
          "Contenu": "I could not test The sim card yet but I assume that will be ok. The customer service was very quick, friendly and professional."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John",
          "Nb_Reviews": 11,
          "Date": "2023-05-17T15:28:19.000Z",
          "Titre": "Easy to use service",
          "Contenu": "Easy to use service. No problems.Card delivered in time promised. Worked as soon as I put it in my phone. Hopefully all will continue to work for the next three weeks."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "patrick higgins",
          "Nb_Reviews": 3,
          "Date": "2022-09-16T00:01:50.000Z",
          "Titre": "Delivered on time",
          "Contenu": "Sims were delivered to our USA address in 2 days and are waiting for us on our arrival .Excellent service"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Steven Jacobson",
          "Nb_Reviews": 48,
          "Date": "2022-07-13T23:41:53.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. Very quick delivery. Activated as soon as switched on, in US, and worked great during the vacation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Geraldine Dallas",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T20:16:17.000Z",
          "Titre": "Quick delivery. Great service",
          "Contenu": "Quick delivery. Inserted in phone and it worked straightaway. Saved me a fortune on roaming charges."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "George ogol",
          "Nb_Reviews": 1,
          "Date": "2022-07-26T04:50:27.000Z",
          "Titre": "Very happy with your services",
          "Contenu": "Very happy with your services. Simcard arrived in a record time, had someone updating me throughought. Keep up the good work"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Steve Mott",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T23:33:22.000Z",
          "Titre": "Good value",
          "Contenu": "Good value, fast delivery's"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Happy",
          "Nb_Reviews": 20,
          "Date": "2022-05-20T13:44:44.000Z",
          "Titre": "5* worked on landing in the US",
          "Contenu": "Switched my phone on landing in BostonWithin a minute or two, got a text welcome to USA, then a E mail with my number, 5*Can't fault the service"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "customer",
          "Nb_Reviews": 6,
          "Date": "2022-05-17T12:14:08.000Z",
          "Titre": "Perfect and easy to use",
          "Contenu": "Ordered these and got them delivered to Ireland. Prompt service. Easy to set up and very handy to have a working phone before travelling to the USA"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FrC",
          "Nb_Reviews": 1,
          "Date": "2022-05-09T23:27:03.000Z",
          "Titre": "Sim ordered online",
          "Contenu": "Sim ordered online, it came in few days. Once in US I put it in the phone and worked perfectly. Nothing to do with the sim itself, but make sure your phone is ok with US frequencies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Simon Butterfield",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T04:07:26.000Z",
          "Titre": "Phone not unlocked.",
          "Contenu": "Slight problem with my phone not being unlocked. But other than my error, great service."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Jan",
          "Nb_Reviews": 4,
          "Date": "2022-06-12T11:45:34.000Z",
          "Titre": "Very fast delivery",
          "Contenu": "Very fast delivery. Worked as described soon as  phone turned on it was active..Takes the hassle of buying one on arrival"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Michelle",
          "Nb_Reviews": 3,
          "Date": "2023-07-25T17:25:03.000Z",
          "Titre": "Perfect solution",
          "Contenu": "Everything works perfectly and the service was good too. I'm happy to have a solution for when I'm in the States and need a mobile phone."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Manda",
          "Nb_Reviews": 5,
          "Date": "2022-08-03T23:47:10.000Z",
          "Titre": "Great respons",
          "Contenu": "You answered all my questions swiftly and solved my problems.Fast delivery too. We have not tried the product yet - but if it works - it will be fabulous. Such a great idea. Thankyou so much!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Terence",
          "Nb_Reviews": 71,
          "Date": "2022-06-05T18:37:39.000Z",
          "Titre": "Excellent service",
          "Contenu": "Great options to choose from, easy ordering, speedy delivery to UK and great performance of the SIM. Super customer service"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David Jones",
          "Nb_Reviews": 33,
          "Date": "2022-11-21T20:25:58.000Z",
          "Titre": "We used the company last year and were…",
          "Contenu": "We used the company last year and were impressed with the service and with the ease of using the SIM.  This is why we are using them again."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Colin Michael Hague",
          "Nb_Reviews": 14,
          "Date": "2022-06-15T11:34:59.000Z",
          "Titre": "Very good service",
          "Contenu": "Very good service, answered all my questions, into day 8 with the sims and they are working fine."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D. Meyer",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T17:50:08.000Z",
          "Titre": "It went exactly as they advertised",
          "Contenu": "It went exactly as they advertised. Fantastic. Will do again next time!"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Karen Cummins",
          "Nb_Reviews": 8,
          "Date": "2022-06-20T15:23:54.000Z",
          "Titre": "Purchasing the sim card was very easy…",
          "Contenu": "Purchasing the sim card was very easy and using it was even easier. Would definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "gian",
          "Nb_Reviews": 4,
          "Date": "2022-03-25T15:09:30.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent. Asked to deliver to the hotel in NY and the fedex was there on time.Just insert the sim and go."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martha Kroncke",
          "Nb_Reviews": 2,
          "Date": "2022-10-19T02:03:14.000Z",
          "Titre": "I like it",
          "Contenu": "Works just fine. Got Fedexed to my home in Spain, I loaded the sim into my phone  before landing in the US and after a week seems fine. Great value for money."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "steve T2T",
          "Nb_Reviews": 8,
          "Date": "2022-08-30T23:55:26.000Z",
          "Titre": "Excellent experience",
          "Contenu": "Excellent experience, fast delivery to UK and great communication via email for any queries I sent their way Will definitely USA again!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Jos",
          "Nb_Reviews": 5,
          "Date": "2022-06-12T18:52:52.000Z",
          "Titre": "Quick delivery",
          "Contenu": "Quick delivery. We can give a review about how the sim works after arriving in the US."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 7,
          "Date": "2022-04-03T17:20:19.000Z",
          "Titre": "It is working well",
          "Contenu": "It is working well.  I would like to renew for another month.  How can I do this using the same number?"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "andrew mcmanus",
          "Nb_Reviews": 3,
          "Date": "2022-05-07T01:41:27.000Z",
          "Titre": "II ordered my sim from Spain",
          "Contenu": "II ordered my sim from Spain, to be delivered to my hotel in L.A., it was waiting for me at the hotel.I put it in , with the aid of the tool to extract the sim holder.Followed the instructions and everything worked fine"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Stephen Elward",
          "Nb_Reviews": 1,
          "Date": "2022-07-26T23:16:40.000Z",
          "Titre": "Purchased the cards for use in the…",
          "Contenu": "Purchased the cards for use in the stated while on holiday .. not going to be there till 6th Aug.  Will update then. Tks"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Catherine",
          "Nb_Reviews": 7,
          "Date": "2022-08-31T15:08:20.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service.  Sim delivered on time. Works perfectly. Thank you!!"
        }
      ]
    }
  ]
}