{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "softwarediscountusa.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott P",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T00:42:16.000Z",
          "Titre": "Purchased software - license code support abysmal",
          "Contenu": "Purchased software, still waiting for valid license code.  No way to contact support or get menaingful nswers"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DAVID NANNENGA",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T14:24:48.000Z",
          "Titre": "Ordered qb pro 2023 3 user for instant…",
          "Contenu": "Ordered qb pro 2023 3 user for instant download. Order status went to pending review. No way to call them just a support ticket. I ended up cancelling and getting directly from Intuit"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "L Fang",
          "Nb_Reviews": 2,
          "Date": "2023-08-05T11:14:04.000Z",
          "Titre": "Do not buy here",
          "Contenu": "I bought the product wanted to work on my tax immediately. Somehow the software license key needs to be manually “reviewed” by somebody and it took several hours. I ended up paid extra and bought the software from elsewhere. When I requested for refund, they asked for proof - which should all be in their customer service chat history. Totally a waste of my time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Dean",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T02:58:42.000Z",
          "Titre": "Never again. License code scam?",
          "Contenu": "The 2022 TurboTax license they sold me would not work. Two days after asking them for help, and receiving no specific information, I suspect SoftwareDiscountUSA sold the same codes too many times.  If so, that seems like a criminal fraud.  I will ask my credit card bank to claw back my payment, because I need to go buy TurboTax again, somewhere else! (My 2021 purchase was okay.)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "deontay jones",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T03:01:23.000Z",
          "Titre": "I WASNT ABLE TO USE IT 24HOUR LATER…",
          "Contenu": "I WASNT ABLE TO USE IT 24HOUR LATER AFTER MY PURCHASE. TAKE ME HOURS BEFORE I GET MY ACTIVATION CODE."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sameer",
          "Nb_Reviews": 3,
          "Date": "2023-04-14T19:17:36.000Z",
          "Titre": "Activation code received was resold?",
          "Contenu": "While I had a good experience last year, this year was the opposite. The TurboTax code that I received after my purchase did not work and TurboTax rep told me that it had been used up already. I don’t understand this could have happened as I did not share it with anyone. And I had used only on one computer. Only explanation I could come up with is that it was some sold/provided to other customers by software discount USA I had to waste 3 hours talking to TurboTax who then did a onetime exception to help me out."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jerry  Dupuy",
          "Nb_Reviews": 4,
          "Date": "2023-01-01T05:46:25.000Z",
          "Titre": "I paid for TurboTax 2022 ($ 90)... for NOTHING.",
          "Contenu": "I paid for TurboTax 2022 ($ 90).  My PC uses Windows 8.1.  It wasn't until I finally tried to install the software that I found out that TurboTax 2022 does NOT run on a PC that uses Windows 8.1, but requires Windows 10.  In addition, one cannot upgrade to Windows 10 unless you pay additional $ for a license to upgrade.  I find that this should have been made known to potential purchasers of your product, as this is not even remotely transparent in your marketing.  Would not surprise me if a Class Action lawsuit might be in order here.  SIGNED, A DISGRUNTLED CPA."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jay Urbanczyk",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T18:33:31.000Z",
          "Titre": "Bought TurboTax Premier for 5 computers…",
          "Contenu": "Bought TurboTax Premier for 5 computers without any hitches. When I went to download second copy for my son I found that this company sold my 4 other license to other customers. When I called to complain they gave me a new license, but I bet they sold the other senescence to other people Very disreputable company but I got the 2 downloads I needed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "wendy plum",
          "Nb_Reviews": 2,
          "Date": "2022-11-17T01:29:22.000Z",
          "Titre": "nobody home!",
          "Contenu": "turbo tax is good.  The advert offers multiple fed returns and one state return.  Four attempts to contact Software Discount  support with a plea to permit a second computer installation were ignored.  Do not buyif you need more than one computer installation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen Mabry",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T17:36:29.000Z",
          "Titre": "Fraud",
          "Contenu": "I purchased the product in February. By the time I got ready to do my taxes the activation code did not work and no help from \"Customer Support\".  Message received \"All available activations for that code have been used. Error code: 603\"  I didn't use 1 activation let alone 5 activations.  What a ripoff!!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jack Samuel",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T16:45:28.000Z",
          "Titre": "Like other users",
          "Contenu": "Like other users, the Turbotax business that I bought worked for the first few weeks after I purchased it, however, when I went back in last week, it asked me again for the installation codes.  When I inputed the codes, it said that all 5 were already used.  This is the only computer that I have installed the program.  I called Turbotax and they said it was clear that the seller sold the same product several times.  I put in a complaint to Software Discount USA and received no reply.  I will have to purchase the program again directly from Turbotax to complete my return."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Steuart",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T21:51:56.000Z",
          "Titre": "License Activation Key did not work",
          "Contenu": "License Activation Key did not work.  Still can not use software.  Can not get any customer service representative to answer emails or get a support phone number.The service is lousy.  Please contact me at john.d.steuart AT gmail.com and copy kirston.graves AT gmail.com.  I want this resolved or my money back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carlos Giménez",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T18:25:29.000Z",
          "Titre": "Fraudulent Numbers at SoftwareDiscountUSA",
          "Contenu": "Like the previous user, the 2022 TurboTax license they sold me would not work. After asking them twice for help, and receiving no specific information, I suspect SoftwareDiscountUSA sold the same codes too many times. It is a criminal fraud. PLEASE report if you've have the same experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Bielejeski",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T23:51:24.000Z",
          "Titre": "My order is stuck in \"Processing\" and I…",
          "Contenu": "My order is stuck in \"Processing\" and I am unable to download my software or get a license. I sent to reports for this and have not received a reply. This is the second order for which this has happened to me. I am considering not using you in the future."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "brenda bodine",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T03:21:47.000Z",
          "Titre": "No one answered my question",
          "Contenu": "No one answered my question. Have a mac 10.14.6 and just wanted Outlook 2016. When I used the steps, it wouldn't download \"Error message need 10.14 or above.\" So shot them an email as to what the issue was. No response. My IT guy then told me based on his research, Mac no longer accepted Outlook other than 365. So lost my $115 for nothing. Didn't realize I needed to research that one of their products would not work on my Mac."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ron May",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T18:31:30.000Z",
          "Titre": "I did not get the activation code yet",
          "Contenu": "I did not get the activation code yet, so I'm surprised youwould send the survey first."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marc Parsons",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T22:22:11.000Z",
          "Titre": "Thieves? ...or just inept!",
          "Contenu": "I don’t know if these people are thieves or just remarkably inept, but I will never deal with them again.I purchased Turbo Tax Home and Business 2022 for Mac on the 13th:1: Not a huge deal, but never received the receipt they said they would send.2: The sent me a link to download Turbo Tax for Windows instead of the Mac version.I filled out the first ticket with that issue, which they responded to in a timely manner by creating a new account for me, but they failed to provide a new link for the Mac version of the software.On the 14th, I filled out another ticket - they sent me a link for the Mac version - FOR THE YEAR 2020!Filled out a third ticket (they do not respond to “replies” to existing tickets) - they sent me the standard “We have received you request...” at 4:30, but have heard nothing else - and it is currently the 15th - 4:03.Hopefully, I can get my bank to cancel this purchase.AVOID AT ALL COST!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "eugenio bernal",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T15:56:50.000Z",
          "Titre": "i could not download my purchased…",
          "Contenu": "i could not download my purchased software"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "First Last",
          "Nb_Reviews": 2,
          "Date": "2023-01-01T18:55:50.000Z",
          "Titre": "I was fine with the purchase",
          "Contenu": "I was fine with the purchase. I found it overly-controlling, distasteful and downright offensive that you would send the following note with the part about \"you are welcome to wait with writing your review until your package or service arrives.\" Do you even have the critical comprehension skills to put that in writing? Who are you to think that you are to give your permission; assuming that someone would even want to give a review? What you wrote shows your bad attitude!  Your not special! Your not entitled! Your attitude shows through your words and it's very disrespectful towards your customers! Yes, we do notice! You were better off not saying anything since you obviously don't have the good manners, good breeding nor socially acceptable skills to address your customers respectfully and with humility!Please note: This email is sent automatically, so you may have received this review invitation before the arrival of your package or service. In this case, you are welcome to wait with writing your review until your package or service arrives."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Castle",
          "Nb_Reviews": 2,
          "Date": "2022-11-11T00:40:45.000Z",
          "Titre": "CHEATING VETERANS",
          "Contenu": "I've received email offers for this company for a month or two. Then yesterday I received a review saying they are giving a special discount for veterans. I searched for this \"new\" price for the Basic Turbotax software and the veteran's price was $35.99. I then went back and looked at the previous email that I've received from this company and the same product was being offered for $35.99 in all the previous offers. I'm shocked and disgusted that this company is taking advantage of veterans in this manner. I want all veterans to know that they are crooks and lying. I complained directly to them and they responded with some song & dance that it was the distributors that set the prices and wasn't their fault. Buy your softward somewhere else!!! Later I received a communication from this company telling me the asked for a copy of my DD214. I never received such a request. I have 13 of those documents to cover all 35 years of my service. They all have my SS# on them. Therefore I won’t send them to anyone. A request to see my retired ID card would be reasonable since it can’t lead to ID theft. I also resent this company who in their response to me called me a liar. I think that alone displays their care for veterans."
        },
        {
          "Note": 1,
          "Lieu": "SA",
          "Pseudo": "amani alqahtani",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T11:31:55.000Z",
          "Titre": "The license u sent me are not active !",
          "Contenu": "The license u sent me are not active !I can not use them?! “Some of the charecters can not appear in this product key” this is the error I got once I add this license (S26361-F2567-D620))"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sal Grasso",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T23:12:49.000Z",
          "Titre": "I bought turbo tax from you but the 16…",
          "Contenu": "I bought turbo tax from you but the 16 digit license code you gave me had been used by 5 other people so I could not activate turbo tax. I would like you to refund my money. Order number 87425 amount $71.99"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Arrieta",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T17:43:12.000Z",
          "Titre": "I ask a simple question to keep using…",
          "Contenu": "I ask a simple question to keep using the primary download, and support  never answered, so I have to purchase another license to finnish my taxes."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Nader",
          "Nb_Reviews": 2,
          "Date": "2023-03-04T23:59:45.000Z",
          "Titre": "The site was great",
          "Contenu": "The site was great, but the Turbotax software was useless. It cannot be used for expats tax return."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T23:35:59.000Z",
          "Titre": "Shiesty Promotion",
          "Contenu": "Your solicitation email advertised a discount price but once I bought on the website there was no discount.  Shiesty promotion untrustworthy vendor"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Not Happy",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T16:30:24.000Z",
          "Titre": "Activation code has been used  Turbotax 2022",
          "Contenu": "Purchase Turbotax 2022.  The activation code has been used.  Support does not respond to my request for a valid activation code."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-02-03T00:39:12.000Z",
          "Titre": "Wrong advertised price.",
          "Contenu": "The discount price is not real. He said at the check out the code will be there but there is none.  It's too late they already charged me.  you can keep my 3 dollars.  You're welcome."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Phillip Correll",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T23:12:55.000Z",
          "Titre": "No license available",
          "Contenu": "Why would you sell any software without having a license to use the software?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J Caudillo",
          "Nb_Reviews": 3,
          "Date": "2023-04-18T02:07:30.000Z",
          "Titre": "Illegal software",
          "Contenu": "This company sells software and reuses the activation codes, so if you don't install and use immediately and code gets reuse before you do you will have an invalid install and unusable software."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "WAYNE DIXON",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T23:11:34.000Z",
          "Titre": "activation code does not work",
          "Contenu": "activation code does not work. Contacted Softwarediscountusa.com and they closed the ticket but activation code still not working."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ron kerr",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T17:25:23.000Z",
          "Titre": "I tried to do the upload",
          "Contenu": "I tried to do the upload, but to no avail.  It indicated \"under review\".  I still do not have my product.  Please help."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "HGallagher",
          "Nb_Reviews": 2,
          "Date": "2022-10-11T07:17:25.000Z",
          "Titre": "I have used SoftwareDiscount USA.com but never again",
          "Contenu": "I have used SoftwareDiscount USA.com for Turbo tax in 2020 and 2021. In both years I activated the program with no issues but going back in to the TT program 4 months later I received an activation message and using the license code I kept getting errors that the license was used more than 5 times (error code 360) After hours on the phone  with Intruit  they issued me a new license."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tess Burningham",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T20:14:28.000Z",
          "Titre": "Terrible Automated customer service",
          "Contenu": "The auto customer service is terrible. First off, who takes 48 hours to provide a digital download link? They canceled my order for no reason. I contacted them to reverse it and they “closed” my ticket. Still cancelled. Gave them a second chance and they still wouldn’t put my order through. I ended up buying via Walmart online and got my link within minutes."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "john sewell",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T12:37:25.000Z",
          "Titre": "2021 taxreturn",
          "Contenu": "The 2021 Intuit Turbo tax return software purchased from you would not allow a certain number to be placed in the return. I called SDUSA and was told that was an Intuit problem and to seek relief through them. They declined to fix my problem or supply me with a refund so I had to purchase a different tax return package. It's he first problem I had with you guys but when I had it you let me down."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "harold banister",
          "Nb_Reviews": 2,
          "Date": "2023-01-18T15:50:54.000Z",
          "Titre": "My experence",
          "Contenu": "I never received my Turbo Tax program."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 2,
          "Date": "2022-09-27T01:35:26.000Z",
          "Titre": "Rude Customer Service",
          "Contenu": "Extremely rude customer service and profit taking attitude. For example, for current year TurboTax for business they lower the price to be competitive among their competitors. But if a customer tries to buy past year's TurboTax, they will charge twice and thrice the price, because there are not competitors selling past years TurboTax software. When the customer asks about this extremely high profit taking, then they respond very rude.My experience is not exactly on 9/27/2021. But some date approximately around that date, as I don't remember the exact date of this experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leo Mun",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T06:02:49.000Z",
          "Titre": "download and install was good   it did…",
          "Contenu": "download and install was good   it did not cler up the problem of  updating  windows 10 so it was not as touted. aq useful review is what you got not something you can wave under peoples noses to  increase your reputation.  Your software wants to take over my computer.  I will decide how it is run not you. I feel it was not what I bought."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Yuri Shtil",
          "Nb_Reviews": 2,
          "Date": "2022-09-13T03:13:57.000Z",
          "Titre": "Totally crooked company",
          "Contenu": "Totally crooked company, gives the same software license to multiple users, when my license was rejected because of multiple installation they simply gave me a different code that wasn’t used that much.When I called TurboTax support they refused to help since this crooks were not an authorized distributor Shame"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Apple Dude",
          "Nb_Reviews": 2,
          "Date": "2022-09-13T02:02:39.000Z",
          "Titre": "I bought TurboTax software which allows…",
          "Contenu": "I bought TurboTax software which allows 5 installations. When I tried to install on second computer it told me that all licenses been used. When I contacted customer service they said by default they enable one and then if needed more you have to chat customer service and get new key which doesn’t make sense. By default same key should work for 5 installations. Customer service told me that this because company wants to make more money by allowing only once installation. False marketing. Never buy or recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nina Campfield",
          "Nb_Reviews": 3,
          "Date": "2022-11-02T19:56:13.000Z",
          "Titre": "The download file folder was named MAC…",
          "Contenu": "The download file folder was named MAC and it took me 20 minutes via chat to find out that the Windows file was inside it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carol",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T17:30:36.000Z",
          "Titre": "This would be a five if they delivered…",
          "Contenu": "This would be a five if they delivered the product, but an hour after purchase all I am seeing is pending review.   When/if the product arrives maybe ask again, but meantime I don't know how anyone could give a positive rating."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "George Santowski",
          "Nb_Reviews": 2,
          "Date": "2022-09-13T02:37:56.000Z",
          "Titre": "Fraudulent Software",
          "Contenu": "Back during filing season, I purchased turbo tax from you.  After downloading the software I started preparing my tax return.  I had to stop while I waited for additional tax documents to arrive.  When I tried to get back into the program I was requested to re-enter my authorization code for the program.  The authorization code , after several attempts said it was used by to many tax returns and would not allow me to finish.  You must have sold the same program with the authorization code to several other individuals.  My credit card refunded me my purchase with no questions asked. They must know you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eugene",
          "Nb_Reviews": 1,
          "Date": "2022-09-15T04:22:22.000Z",
          "Titre": "Short Changed",
          "Contenu": "Download of Turbo Tax stated that it could be loaded on a total of 5 computers.It only loaded on one.Attempts to load onto a second computer resulted in a message saying all uses of the program KEY were already exhausted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Crystal",
          "Nb_Reviews": 2,
          "Date": "2022-03-20T21:00:33.000Z",
          "Titre": "Facebook plug-in for customer verification just lost them a long-time customer.",
          "Contenu": "I have purchased from this company many times before.  I have always had a 5 star experience until today.  Now, the site seems to require verification via facebook - which is buggy naturally as it's programmed by inept programmers! Now, I can't make a purchase on the Software Discount USA site because they've paid facebook to screw up their customer experience.  Had to go buy my software from Amazon for more money, but less frustration.  Sorry to have to end this relationship."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jesus Santos",
          "Nb_Reviews": 2,
          "Date": "2023-06-14T00:47:32.000Z",
          "Titre": "I am not able to use Turbo",
          "Contenu": "I am not able to use Turbo tax 2022. Could not trouble shoot the issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dissatisfied",
          "Nb_Reviews": 1,
          "Date": "2021-08-27T14:38:17.000Z",
          "Titre": "I ordered an MS Visio 2019 download",
          "Contenu": "I ordered an MS Visio 2019 download.  SoftwareDiscountsUSA was unresponsive for a week.  When they finally did respond, they tried to deliver a product different from the one I had bought.I have three times requested a refund on product, and so far they will not even acknowledge my request.Stay away from these folks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Neal",
          "Nb_Reviews": 1,
          "Date": "2021-04-03T15:49:27.000Z",
          "Titre": "I downloaded Turbotax and after putting…",
          "Contenu": "I downloaded Turbotax and after putting in the license key is states ALL AVAILABLE ACTICATIONS FOR THAT CODE HAVE BEEN USED. ERROR CODE 603.It seems like they are reselling the same licence codes. I have tried to reach them for support, but they have No phone or chat line and I get a message they will get back to me in 24 hours. The whole point of downloading software is to use it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dennis Prendeville",
          "Nb_Reviews": 2,
          "Date": "2021-08-12T02:12:21.000Z",
          "Titre": "Just bought turbo tax 2020 from you",
          "Contenu": "Just bought turbo tax 2020 from you. The activation does not work. It says \"all activation codes have been used. Error 603.\"Your chat says expect response within 24 hours. I want a refund immediately since this is unacceptable. I will buy it elsewhere and dispute the charge if necessary."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg Perkins",
          "Nb_Reviews": 1,
          "Date": "2020-11-24T02:27:55.000Z",
          "Titre": "Issuing same license keys to multiple customers",
          "Contenu": "Purchased 2020 version of TurboTax premier and installed it.  The first time you run it you're required to supply the license key softwarediscountUSA provided.  Upon doing that, I'm informed the key has already been activated the maximum 5 times!  Unable to reach anyone at SoftwarediscountUSA.  I've submitted a request for CC company to reverse the charges.*** Update - was able to make contact with the company and a refund has been issued. ***"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ml",
          "Nb_Reviews": 2,
          "Date": "2021-01-15T23:09:34.000Z",
          "Titre": "Their website crashed",
          "Contenu": "Bought the 2020 Turbo Tax for Windows and after attempting to download it I find it out their website is down. I waited a day and still cannot access the program I bought. Looking for a phone number to contact them.Update:Thank you for responding so promptly.  The connection is still giving an Error 522 \"Host Error\" message.  Attempted to go on the link provided by the email and straight to the main website.  Thank you for looking into this and hope it can be fixed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dave Furlong",
          "Nb_Reviews": 1,
          "Date": "2020-05-10T02:59:13.000Z",
          "Titre": "Rip off!",
          "Contenu": "Rip off!!  I bought a full version of TurboTax Home & Office.  It's supposed to come with 5 installs.  It installed fine the first time.  When I tried to install it on a different computer a couple months later, I got a message that my serial number had already been used 5 times.  These rip-off artists sold my same serial number to 4 other people.  Better to spend the few extra bucks and get a real version elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kolleen Wooten",
          "Nb_Reviews": 1,
          "Date": "2020-04-02T20:05:08.000Z",
          "Titre": "Received previously used software key that disabled installation",
          "Contenu": "Received software with a key that had already been used and it was after SoftwareDiscountUSA's support hours, so I bought the TurboTax software elsewhere as I was under a deadline. After I sent them an email, they did send a new key, but I never used it since I had already purchased the software from another site and installed it so I get the taxes done. I asked for a refund and got no response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Sheridan",
          "Nb_Reviews": 1,
          "Date": "2020-03-30T17:10:12.000Z",
          "Titre": "I left a message and no one returned my…",
          "Contenu": "I left a message and no one returned my call nor was I given a refund which I requested as I was sold a copy of Turbo tax that only allowed me access once.  When I logged in the 2nd time, it gave me an error message saying that all 5 licenses were already used on this so it gave me the distinct impression this was a bootleg copy.  I am very unhappy and I am still awaiting a refund.  Please reply ASAP."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 3,
          "Date": "2021-01-21T22:35:04.000Z",
          "Titre": "I ordered the product with the back up…",
          "Contenu": "I ordered the product with the back up disc and on my newest credit card bill I saw that you have already charged me and received payment for 2019 Tax program but That is all that I have received so far is a receipt of payment. The items that I ordered and paid for have not yet been received by me. Tom Perry"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Weiss",
          "Nb_Reviews": 1,
          "Date": "2021-02-11T12:48:12.000Z",
          "Titre": "I ordered TurboTax on 1-2-2021 to…",
          "Contenu": "I ordered TurboTax on 1-2-2021 to prepare tax returns for 2020.  I logged on to the system on 2-8-2021 to start the process.  After downloading the software, which was supposed to allow me 5 tax returns, the message came on that all 5 has already been used.   I entered the chat and explained the problem.  I received a response that I would be receiving a response shortly.  It is now 3 days passed with no response.  I'd either like my money back or reinstate the software so that I can get my 5 tax returns."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terri Bueltman",
          "Nb_Reviews": 3,
          "Date": "2020-03-28T14:10:49.000Z",
          "Titre": "Very unpleasant experience",
          "Contenu": "I downloaded TurboTax 2019 & then could not use it. I immediately wrote to your support & requested a refund since I couldn’t use the software as it was incompatible with my operating system. The response I received from your company was less than supportive. This was a waste of my money & time and I’m not about to recommend or use your company in the future."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nina Campfield",
          "Nb_Reviews": 3,
          "Date": "2020-05-24T21:21:21.000Z",
          "Titre": "The price for Turbo Tax Business was…",
          "Contenu": "The price for Turbo Tax Business was very good -- I guess too good.  Although the description stated that 1 state return was included, it was not.  SoftwareDiscountUSA tech support sent me information on how to download the state software, but it did not work.  When I called Turbo Tax, they informed me that the Business software did not include a state."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Avery Sinkoff",
          "Nb_Reviews": 1,
          "Date": "2020-04-03T22:08:24.000Z",
          "Titre": "The customer service was of no help in…",
          "Contenu": "The customer service was of no help in resolving my issue of not having a License for a new computer.  I was supplied a difference license which did not work.  Customer service stopped communicating and closed the trouble report.  Per TurboTax each license is good for five computers.  I assume Software Discount USA is selling the licenses to different buyers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan Phillips",
          "Nb_Reviews": 1,
          "Date": "2020-08-20T22:03:33.000Z",
          "Titre": "I purchased Office  and the  Software…",
          "Contenu": "I purchased Office  and Software Discount and had to 1 star them here to get  a valid link or email response. They did respond to the 1 star in less than 20 minutes and sent a link. The Product Key was already registered when I tried to activate it. They sent me replacement with 48 hours. Works great now.  Normally I would change the rating to a 4 however  their emails spent time aggressively complaining  over email being a perfect method of contact than addressing the issue"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "W REILLY",
          "Nb_Reviews": 2,
          "Date": "2020-04-03T22:54:42.000Z",
          "Titre": "1 star: Bad, 0 stars: Unacceptable!",
          "Contenu": "The fact that there was a problem with the software that I downloaded was not what forced me to give the poorest rating. I understand, software sometimes has glitches. Where you earned the low rating was with the response to the problem. There was barely a response and certainly no resolution. I was left to repurchase the software elsewhere. Very disappointing. I would have given a zero rating if it were an option. 1 star: Bad, 0 stars: Unacceptable!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2020-11-27T22:15:12.000Z",
          "Titre": "TurboTax:rejected activation codes",
          "Contenu": "I had ordered TurboTax. Activation code failed to work on the download. TurboTax said code had previously been used.  Company sent me another activation code and TurboTax rejected that as well saying it had previously been used.  I tried to contact SoftwareDiscounts but they stopped responding to emails. They did not provide a telephone number on their web site for customer service.I contacted my credit card company and had the $59 charge rejected.Not sure why company stopped helping or responding to emails."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Richmond  who could",
          "Nb_Reviews": 1,
          "Date": "2021-01-03T18:31:02.000Z",
          "Titre": "Your software locked up my Windowa 10…",
          "Contenu": "Your software locked up my Windowa 10 system.I can't access the TURBOTAX download file even though thecompleted file shows inmy file manager.You suckevery year it's another pile of bricks I have to climb over inorder to use the TURBOTAX. no help from TURBOTAX.POINT  MADE....."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chuck Duncan",
          "Nb_Reviews": 3,
          "Date": "2021-02-04T15:57:22.000Z",
          "Titre": "Where's my order?",
          "Contenu": "Where's my order?I ordered the software, paid for it successfully, and received an email confirmation.  So where is my order?  Tried to contact the web site again, but the connection keeps getting closed!I will wait awhile before contacting the bank to file a complaint with them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CK",
          "Nb_Reviews": 1,
          "Date": "2021-04-07T23:20:18.000Z",
          "Titre": "I LEARND MY LESSION THE HARD WAY",
          "Contenu": "I LEARND MY LESSION THE HARD WAY. My wife spend hours to prepare our tax return and she could not launch the app again because the original product key no longer working. This is unacceptable. Going forward, I will not buy any software from this company. As far as I know, the product key (license number) should only key in once and it should never ask again for the product key. This is so frustrating, I will buy from TurboTax directly in the future. What a wasted of time. PS. You may think you would saved $30. Please think again with all the time you wasted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas Godfrey",
          "Nb_Reviews": 2,
          "Date": "2021-03-04T16:57:40.000Z",
          "Titre": "You took the money for my order",
          "Contenu": "You took the money for my order, then blocked me from getting to your website to download the software.I would never give someone the documents you wanted over the internet. I have no information from my bank that the money was returned. Amazon processed my order without drama."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul Quick",
          "Nb_Reviews": 1,
          "Date": "2020-04-04T01:33:04.000Z",
          "Titre": "TurboTax premier with only one use!",
          "Contenu": "I purchased a copy of TurboTax premier that was supposed to have five uses.  I used it just fine, but two weeks later my son tried to use it, but he got an error code that said all of the  available uses were used up.  I believe that the License Number had been sold to multiple buyers.  I felt that I had been cheated."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deborah Sommer",
          "Nb_Reviews": 3,
          "Date": "2022-09-13T04:32:05.000Z",
          "Titre": "I paid for the software sand downloaded…",
          "Contenu": "I paid for the software sand downloaded it, but couldn’t use it, so I had to go back to my TurboTax site online and use theirs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2020-10-14T04:01:14.000Z",
          "Titre": "I was unable to file electronically",
          "Contenu": "I was unable to file electronically.   Also, when I tried to load this on a new laptop, I found that that it had been loaded on 5 machines.  Intuit provides a licence that the owner can load on 5 machines, but this seems to be a copy that someone sold to 4 or 5 different people instead."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott George",
          "Nb_Reviews": 1,
          "Date": "2020-05-15T21:27:23.000Z",
          "Titre": "No Product Code",
          "Contenu": "I created account & purchased TurboTax Home & Office. Order Number: 26617 (May 13, 2020). Downloaded software, but it requires the 14-character product code to operate.YOU DID NOT SEND PRODUCT CODE! I have emailed and tried chat for many hours, with no response.Please send code."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom Duggan",
          "Nb_Reviews": 1,
          "Date": "2020-11-30T19:31:57.000Z",
          "Titre": "Customer service is non-existent",
          "Contenu": "I ordered MS Office, installed and worked just fine. Subsequently tried for an hour to follow up with customer service- they said they'd call me back, didn't; repeatedly ended chat windows without assisting me (effectively \"hanging up on me). Just terrible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "R Kleven",
          "Nb_Reviews": 1,
          "Date": "2020-10-06T22:58:43.000Z",
          "Titre": "I've been ripped off.",
          "Contenu": "I ordered the wrong type of Turbo tax.  As a single member LLC owner I discovered that I needed Home and Business not Business.  Your website will not acknowledge my request for a refund so that I can order H & B.  I tried to order H&B without the refund, but your site will not  accept my orderbecause it does not recognise my passwowrd and will not send a password reset email.  I tried your chat support to no avail.  Text read:  support wait 5 minutes.  I've been waiting 20 and at this point I think I've been rippped off to the tune of $160!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mel Amato",
          "Nb_Reviews": 1,
          "Date": "2020-11-15T01:46:46.000Z",
          "Titre": "Software Would Not Activate - (3) Tries with (3) KEY Codes",
          "Contenu": "Vendor issued 3 different software activation KEY codes & none of them worked. They did not phone me to fix the activation problem but only sent emails and chat messages which were all delayed by 10 to 15 minutes. I have used the TurboTax software for over 30 years with each year's license being purchased directly from Intuit, the software publisher, or from a well known retail reseller like Best Buy, Office Depot or Amazon. I have never had such software activation problems prior to this purchase.After reading the vendor's reply I can only say thanks for the no hassle, quick refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonathan Landsman",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T16:25:30.000Z",
          "Titre": "I ordered and dowloaded TurboTax 2019…",
          "Contenu": "I ordered and dowloaded TurboTax 2019 Home and Business on October 9. Activation code worked. Today, I was again prompted to enter the activation code, and when I did, the code would no longer work. Two days before taxes due and I have no working software."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Judy Beane",
          "Nb_Reviews": 1,
          "Date": "2020-03-27T21:53:24.000Z",
          "Titre": "The software downloaded but I could not…",
          "Contenu": "The software downloaded but I could not get it to recognize that I had purchased it through your company.  I tried several times to contact you and got no response.  I ended up paying for the software - AGAIN - through TurboTax.  I will never purchase from you again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Willard Salter",
          "Nb_Reviews": 2,
          "Date": "2020-05-07T21:32:03.000Z",
          "Titre": "I have not been able to down load the…",
          "Contenu": "I have not been able to down load the software. Nor was I able to access my account When I finally got access to my account the download button was not displayed. Additional attempts to get the status of my order indicated order was in process, for 2 days?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kenneth Banister",
          "Nb_Reviews": 1,
          "Date": "2020-04-04T02:36:17.000Z",
          "Titre": "horribly frustrating",
          "Contenu": "horribly frustrating!  Downloaded software was defective...worked thru your people trying to fix it...NO SUCCESS!  Requested refund as had to buy the tax package elsewhere and had to get tax returns filed...get no response from you about refund request!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amanli",
          "Nb_Reviews": 1,
          "Date": "2021-03-24T14:01:26.000Z",
          "Titre": "The site mentioned is NOT an authorized…",
          "Contenu": "The site mentioned is NOT an authorized reseller or provider of TurboTax software.  By purchasing and using software from an unauthorized seller, you may be exposing yourself to risks such as viruses, malware, and/or identity theft."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ronald",
          "Nb_Reviews": 3,
          "Date": "2022-09-27T02:07:44.000Z",
          "Titre": "The code was expired and I had to…",
          "Contenu": "The code was expired and I had to purchase software in another placing, paying twice for one product"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NS",
          "Nb_Reviews": 1,
          "Date": "2020-03-27T22:41:11.000Z",
          "Titre": "Software purchased from them was not…",
          "Contenu": "Software purchased from them was not usable. The company did not respond to calls or emails.I read your response. However, you still have not responded to 2 emails sent to your company.I purchase TurboTax software and was not able to use it since the code provide was invalid. You can check your inbox and will find my emails.It is really interesting to you see you respond to this review but not respond to my request to resolve my issue.My email is ns847@s..., very easy to find. You can issue credit and I will remove this review.Until them, my position stands: I will never do business with them and will not recommend this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony Vela",
          "Nb_Reviews": 1,
          "Date": "2020-04-04T03:00:17.000Z",
          "Titre": "I ordered 2019 Turbo tax",
          "Contenu": "I ordered 2019 Turbo tax, paid and never received. My subsequent email's were undeliverable. My last resort was to contact my credit card company to reverce the charges, because there is no avenue of communication. Shame on you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DG",
          "Nb_Reviews": 1,
          "Date": "2020-03-27T23:30:45.000Z",
          "Titre": "code provided didn’t work - pirated software?",
          "Contenu": "When the code provided didn’t work, I googled, and suspected not authorized. They couldn’t prove that they were an authorized vendor of turbo tax software - which to me means they aren’t. They gave me a refund after I filed claim."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adrian Diaz",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T08:08:13.000Z",
          "Titre": "Your system sucks",
          "Contenu": "Your system sucks.  I was charged three times and still can’t download my program."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michele",
          "Nb_Reviews": 1,
          "Date": "2021-01-18T15:30:49.000Z",
          "Titre": "You sent a code that doesn't work",
          "Contenu": "You sent a code that doesn't work. I asked for a refund multiple times or a new code. No response. My credit card company is disputing your charge for a faulty product. Don't try to buy software here!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Victoria McD",
          "Nb_Reviews": 14,
          "Date": "2020-06-09T21:56:36.000Z",
          "Titre": "I paid for a turbotax deluxe form but…",
          "Contenu": "I paid for a turbotax deluxe form but am`unable to find it.It should have popped up immediately after I submitted mycredit card numbers.Should I call credit card company and cancel my order?Victoria McDonald"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Raymond Yu",
          "Nb_Reviews": 1,
          "Date": "2020-03-29T18:58:39.000Z",
          "Titre": "I downloaded the TurboTax 2019 and…",
          "Contenu": "I downloaded the TurboTax 2019 and supposed can be installed to 5 PCs.  But when I tried to installed to my second PC, it rejected the activation and said all available activation for that code have been used."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sudesh Irukulla",
          "Nb_Reviews": 1,
          "Date": "2021-08-11T04:07:04.000Z",
          "Titre": "The activation key code DOESN'T WORK",
          "Contenu": "The activation key code that was provided to me doesn't work to activate the software install. I tried to reach out to support via phone, chat, and email but there is no support."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rami Gayam",
          "Nb_Reviews": 1,
          "Date": "2020-04-04T03:06:03.000Z",
          "Titre": "Very poor customer service",
          "Contenu": "Very poor customer service. I have email them few times but didn’t receive any response. I tried to call many times and it always says I need to submit a query via email. Horrible customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "bill bender",
          "Nb_Reviews": 2,
          "Date": "2020-03-28T11:57:19.000Z",
          "Titre": "Poor communication protocol...",
          "Contenu": "Poor communication protocol.... I ordered the wrong software and didn't use it and tried to send it back and get a credit and I have to fight through my credit card company to rectify it...."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jl",
          "Nb_Reviews": 1,
          "Date": "2020-09-15T17:37:35.000Z",
          "Titre": "I never received the product.",
          "Contenu": "I never received the product. **You replied to my review by saying that you emailed the code to me on Sep 5th, but the only email I received that day was the email to submit a review."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Douglas Stuckey",
          "Nb_Reviews": 1,
          "Date": "2020-04-15T02:51:33.000Z",
          "Titre": "This software is supposed to have a…",
          "Contenu": "This software is supposed to have a license for 5 devices. The access code given worked for only 1 PC. Then when it crashed I could not re-activate on the same pc. Stay away from here!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lamin Kinteh Darboe",
          "Nb_Reviews": 1,
          "Date": "2020-05-18T00:01:56.000Z",
          "Titre": "I was sold a used product number which…",
          "Contenu": "I was sold a used product number which somebody already did 5 State submissions. I have lost my $61 purchase without any resolution. I will buy any product from that company again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "norman bennett",
          "Nb_Reviews": 1,
          "Date": "2020-12-05T02:05:35.000Z",
          "Titre": "Can't access code",
          "Contenu": "Can't access code.  The log in asks for a log in code in the following format:  xxxx xxxx xxxx xxxx That format is not available.  Is there a telephone number I can call?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Breitzmann",
          "Nb_Reviews": 1,
          "Date": "2020-04-13T01:53:10.000Z",
          "Titre": "BAD code!",
          "Contenu": "This software is supposed to be loadable om several computers.  The access code given works for only ONE!  I want this on my desktop and my laptop!  I think that you cheated me!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Ghobrial",
          "Nb_Reviews": 1,
          "Date": "2020-07-24T03:52:20.000Z",
          "Titre": "I got charged 3 times for the TurboTax…",
          "Contenu": "I got charged 3 times for the TurboTax CD. I tried to reach out to you and I left a voice message, but no one called me back. If you please can call me at +1 (817) 305-3724"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paula Saunier",
          "Nb_Reviews": 1,
          "Date": "2020-04-07T00:23:59.000Z",
          "Titre": "I don’t know what my code is",
          "Contenu": "I don’t know what my code is. I can’t find the right support email to ask. Keeps saying the email can’t be sent. If someone doesn’t help me I am going to cancel the payment."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Olson",
          "Nb_Reviews": 2,
          "Date": "2020-03-28T09:53:21.000Z",
          "Titre": "Had to repurchase directly from…",
          "Contenu": "Had to repurchase directly from mnfr.......would not recognize or honor my tax returns filing or fees from software purchase from here. Will never purchase from here again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Blair",
          "Nb_Reviews": 1,
          "Date": "2021-01-14T21:20:41.000Z",
          "Titre": "Ordered Turbotax Deluxe in mid Dec",
          "Contenu": "Ordered Turbotax Deluxe in mid Dec, but didn't read info closely enough to realize it was download only. Attempted to download, but activation license code did not work. Tried online support and new password was sent. That didn't work either. Received email that first order was closed and another account opened and to click on URL. I did that and noticed \"not secure\" which made me uncomfortable. Shortly after, received privacy alert from my computer security system. I immediately stopped further download, informed tech support, uninstalled what I had installed, and requested full refund. I have sent 3 emails with no response. Will never use SoftwareDiscountUSA again. Spend a few $ more and buy from Office Depot or another retail store.   Update 1/14/21:  After above review, I did get a reply from SoftwareDiscountUSA and a full refund, which I appreciate. Thank you"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kenneth Ruszkiewicz",
          "Nb_Reviews": 1,
          "Date": "2020-08-12T11:05:35.000Z",
          "Titre": "Downloaded but will not install and…",
          "Contenu": "Downloaded but will not install and they will not answer my texts now all i want to do is get a refund since i will need to go to a cpa to have my taxes done."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony Arrowsmith",
          "Nb_Reviews": 1,
          "Date": "2020-06-20T20:52:36.000Z",
          "Titre": "Downloaded the software.",
          "Contenu": "Downloaded the software..     It won't take the udpdates...   Won't download the state..   Won't download forms I need...    TOTALLY USELESS !!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JULIAN MESA",
          "Nb_Reviews": 1,
          "Date": "2020-06-26T22:35:25.000Z",
          "Titre": "I tried multiple times to install",
          "Contenu": "I tried multiple times to install.  The Chat person does not respond timely.  Now it says it will respond within 3 hours.!!!!Horrible installation support."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "stephen tang",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T21:52:17.000Z",
          "Titre": "This costs more than standard versions…",
          "Contenu": "This costs more than standard versions (Amazon, Costco, etc.).  (1) Standard versions can be installed on 5 different devices. (2) Except this year, the software code was invalid mist using."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Terry Quinn",
          "Nb_Reviews": 2,
          "Date": "2023-02-02T22:13:46.000Z",
          "Titre": "I wanted to buy TurboTax Premier",
          "Contenu": "I wanted to buy TurboTax Premier.  It has been a long time since I tried to buy a product online as bad as SoftwareDiscountUSA.com  (and I do a lot of those).  Trying to understand your screens.  Terminology for something like a discount word . . . which was not consistently called the same thing by different descriptions.  Screens were not organized and laid out like other on-line purchases.  Instructions within the screens are difficult understanding.  And the help screen was slow to start and the person at the other end did not seem to understand my language."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Harvey Wiener",
          "Nb_Reviews": 3,
          "Date": "2022-11-03T20:16:19.000Z",
          "Titre": "Where is my license?",
          "Contenu": "Very quick on delivery of order....but 3 hrs after delivery, I am still waiting for license key....."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stanley King",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T01:31:56.000Z",
          "Titre": "Took A Long Time to Get Key",
          "Contenu": "The time that it took to get my software key was not expected."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Susan P",
          "Nb_Reviews": 2,
          "Date": "2022-10-10T21:35:38.000Z",
          "Titre": "Licenses \"out of stock\"",
          "Contenu": "I purchased Microsoft 365 Personal - License / Download Only, order # 81028. It seemed to go through, but the license key was missing from the confirmation email, and not long after that the transaction was cancelled in response to a support ticket WHICH I DID NOT SUBMIT. When I contacted support I was informed that licenses were \"out of stock\". Nothing in the emails I received told me why the purchase was voided or how to purchase the software successfully. If the software can't be currently purchased that should be clearly indicated ON THE PRODUCT PAGE on the website, it should not be possible to try to purchase it until licenses are available, and email to the client should be clear about what is going on."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2022-11-02T16:03:30.000Z",
          "Titre": "Be careful if you want to use on up to 5 computers",
          "Contenu": "Software good, but when I tried to load on second computer I got a message saying license was already used 5 times."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Hal",
          "Nb_Reviews": 4,
          "Date": "2022-09-13T02:20:56.000Z",
          "Titre": "Software download did not work",
          "Contenu": "I ordered a software package but the download function did not work at all.   After several failed attempts, they refunded my money with no explanations about what happened or why there was an issue."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Getting Too Old!",
          "Nb_Reviews": 2,
          "Date": "2021-04-18T19:38:07.000Z",
          "Titre": "Corrupted Software Waisted Many Hours of My Time",
          "Contenu": "The purchase process for the tax software was great.  However, after entering all my tax information, an error message stated the file was corrupt.  My PC is new and had used the vendor's software the previous year.  Per the vendor they were unable to capture the data that I saved using the proper formats that were required.  They forced me to re-install Windows 10 even though it had the latest updates. The only solution was for the vendor to provide another copy of the software and have me re-enter all my data (BUMMER)."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2020-06-26T17:48:09.000Z",
          "Titre": "Bought TurboTax Home and Business back…",
          "Contenu": "Bought TurboTax Home and Business back in April. I installed it and started doing my taxes. Went back to doing them for the 2nd time late June and was prompted to re-enter my key. Said that it was used too many times. I only installed it once on the very same computer I was using. Called TurboTax and they said the key has been used 5 times already. Hmmm, something stinky in fish town. I think I will buy somewhere else for now on."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nathaniel Case",
          "Nb_Reviews": 1,
          "Date": "2020-03-27T22:01:53.000Z",
          "Titre": "They're reselling the product copy I bought.",
          "Contenu": "Three times I tried using the code numbers they sent, and three times they were \"all in use.\" This vendor is reselling the same number to multiple people. This is not what I believed I was paying for. They were responsive in sending me a replacement number each time, but still... it's kind of sleazy practice and almost certainly against the terms of the licence from Intuit."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Walter",
          "Nb_Reviews": 2,
          "Date": "2020-10-25T19:40:00.000Z",
          "Titre": "Bogus Activation Code",
          "Contenu": "Everything was great, the price for TurboTax Home and Business 2019 was excellent, but product downloaded with an invalid activation code. I was able to correct this with a service representative, but it never should have happened. You would have gotten a 5-Star rating except for that enormous detail."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Elizabeth Boecher",
          "Nb_Reviews": 2,
          "Date": "2020-03-28T01:34:08.000Z",
          "Titre": "The struggle is real",
          "Contenu": "I purchased early to get a discount. My \"access\" expired on Feb which resulted in 2 lengthy chats to get resolved. Then it was the wrong year (why would I buy 2018 again?). Another chat. Then I needed the license number. Another chat. My relationship with technology can be tenuous but this was obscene."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jim Ch",
          "Nb_Reviews": 1,
          "Date": "2021-03-27T14:19:13.000Z",
          "Titre": "I have a suspicion they are selling a TurboTax activation code to more than one customer",
          "Contenu": "I have a suspicion they are selling TurboTax activation codes to more than one customer. I purchase it about 3 months ago and have been using it on only one computer. Suddenly I got a rejection when trying to open my Turbotax that I needed to enter my activation code. When I did it was rejected with a notice that my activation code had been used on more than 5 computers. I own only one and entered the original activation code only once. I contacted this company by online chat and within 5 seconds they gave me a new activation code. No questions asked. I find this highly suspicious."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Schwartz",
          "Nb_Reviews": 1,
          "Date": "2020-03-28T20:40:19.000Z",
          "Titre": "These stars are provisional",
          "Contenu": "These stars are provisional, because I have an ongoing issue with the lack of support  downloading  a product I have ordered.  This may be because of the current Corona Virus problem, but I feel that my problem can be solved with a short phone call --- which is not now possible --- if it ever was."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tom Karpinecz",
          "Nb_Reviews": 1,
          "Date": "2021-02-13T22:51:45.000Z",
          "Titre": "Turbo tax includes 5 federal e-files.",
          "Contenu": "Turbo tax includes 5 federal e-files.I need to use this on multiple computers in my family to complete these 5 returns.I can't activate it , only allows 2 computers"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Khwaja Ahmed",
          "Nb_Reviews": 2,
          "Date": "2020-03-28T02:52:37.000Z",
          "Titre": "I had trouble after installing TurboTax…",
          "Contenu": "I had trouble after installing TurboTax and reached out to customer service for giving me another download option with a key. But never received a response. Poor customer service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sabiha Bholat",
          "Nb_Reviews": 3,
          "Date": "2020-04-04T01:04:27.000Z",
          "Titre": "please don't sell tax software- no I am…",
          "Contenu": "please don't sell tax software- no I am not being sarcastic, its just that it is very serious busniess better left to big busniesses. please. thank you and god bless."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lawrence Dolan",
          "Nb_Reviews": 3,
          "Date": "2020-03-28T04:17:23.000Z",
          "Titre": "Value for money kept the rating low",
          "Contenu": "Value for money kept the rating low. Turbo tax are selling 5  packages for just a little more."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Elizabeth Boecher",
          "Nb_Reviews": 2,
          "Date": "2021-02-07T19:27:11.000Z",
          "Titre": "Again this year cannot find my license…",
          "Contenu": "Again this year cannot find my license code to start. Will have to call."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Meyer",
          "Nb_Reviews": 1,
          "Date": "2020-03-28T05:15:38.000Z",
          "Titre": "Had to get an access code 4 times in…",
          "Contenu": "Had to get an access code 4 times in order use the product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kyle Robar",
          "Nb_Reviews": 1,
          "Date": "2021-04-19T15:22:45.000Z",
          "Titre": "price was good",
          "Contenu": "price was good, but sold my phone number to spammers"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "G. L.",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T05:55:40.000Z",
          "Titre": "Good experience, bad result",
          "Contenu": "I liked the ease if downloading the product, because I needed the item right away. That being said, after purchasing and downloading the software, I then discovered that the efile feature couldn't be used at this time, which defeated the main reason for purchasing the software."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Me Buyer",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T04:57:41.000Z",
          "Titre": "Problems - were fixed the next day",
          "Contenu": "After purchase download did not work at all .I have received four confirmations with different order numbers.The next day this was fixed, and I have received a download link.Appears like a trustworthy merchant, with a software system which is not great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Freed",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T22:34:18.000Z",
          "Titre": "It took a few days to fix the overall…",
          "Contenu": "It took a few days to fix the overall problem, I believe phone support would have saved time.The last issue was fixed overnight at that raises them to 4 stars"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ROY VALLANCE",
          "Nb_Reviews": 2,
          "Date": "2022-12-22T02:54:47.000Z",
          "Titre": "Initial purchase problem: Dec1, '22…",
          "Contenu": "I had a problem with my initial purchase.  I received no confirmation of the purchase nor the activation key.  The initial purchase was Dec. 1, for $39.99.  When I contacted Software Discount USA email they finally closed the ticket, but never credited my credit card (...####) despite a second email.  The chat service is not a replacement for a person.  I asked for a phone number, but it was ignored.  I will dispute the initial charge with my credit card company if no credit is given by the time I get my bill.  Thank you.  Roy V."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PEB",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T21:04:22.000Z",
          "Titre": "it was all good to a point!",
          "Contenu": "it was all good, order was acknowledged, Download instructions were sent, then I tried to download and install.  The download instructions were terrible.  I have been using PCs since the first ones.  My partner who is also very experienced tried and neither of us could get the program to download and install.  Finally magically it worked for her.  We have no idea what finally worked.   I understand in today's world you have to guard against Piracy but this was ridiculous!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Hoy",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T21:06:36.000Z",
          "Titre": "The download did not work because the…",
          "Contenu": "The download did not work because the system said \"pending\", although the page with my activation keys said the \"order review has been completed\".  I am still waiting after 15 minutes and more."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas Bruno",
          "Nb_Reviews": 2,
          "Date": "2023-02-01T18:40:23.000Z",
          "Titre": "Great price",
          "Contenu": "Great price, but I had a very difficult time paying during the month of January of 2023. Date of experience is approximate."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SHERYL S",
          "Nb_Reviews": 2,
          "Date": "2022-12-15T22:19:22.000Z",
          "Titre": "It is not working",
          "Contenu": "It is not working.  Please refund my money!  it did not give me an option to save.Refund received within minutes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "APandaBear",
          "Nb_Reviews": 5,
          "Date": "2022-09-27T01:45:13.000Z",
          "Titre": "Problem with License",
          "Contenu": "I purchased an upgrade to my Quicken program.  I had difficulty in getting the license number when I had a problem loading my data.  It took several days before it could get corrected.  I can't remember who did it... you or Quicken."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "David Raghubir",
          "Nb_Reviews": 2,
          "Date": "2022-09-27T03:20:42.000Z",
          "Titre": "GOOD DAY",
          "Contenu": "GOOD DAY.  I KEEP ORDEING THIS PROGRAM AND I KEEP GETTING MY PASSWORD CODE FOR THE PROGRAM WIPE OUT AND CANNOT ACCESS THE SYSTEMT AND HAVE TO KEEP CONTACTING SUPORT TO GET A NEW ACCESS TO TURBO TAX."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sidney B",
          "Nb_Reviews": 2,
          "Date": "2022-09-16T14:30:48.000Z",
          "Titre": "Had difficulty downloading product",
          "Contenu": "Had difficulty downloading product. Had problems installing product. Had problems activating product. It took five calls to get through to talk with someone. It was several days before the issues were resolved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Chang",
          "Nb_Reviews": 2,
          "Date": "2022-09-27T06:49:39.000Z",
          "Titre": "Bad Activation Code",
          "Contenu": "The Activation Code provided was used: no downloads available.  However, a new code was provided in response to my complaint.  Otherwise it would have been 5 stars"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ralph",
          "Nb_Reviews": 2,
          "Date": "2022-09-27T02:43:11.000Z",
          "Titre": "Tried to update TurboTax 2021",
          "Contenu": "Tried to update TurboTax 2021, would not allow my pass key to re-open TT, said pass code already used. Hope it allows file transfers for 2022."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bruce Muller",
          "Nb_Reviews": 2,
          "Date": "2021-02-17T14:22:18.000Z",
          "Titre": "Purchased TurboTax Home & Busness +…",
          "Contenu": "Purchased TurboTax Home & Busness + State.  It worked fine for 2 months and then asked me re-enter the license code.  The license purchased was supposed to be for 5 computers, but I received a message that all activations had been used for that code.  I only installed it on a single computer.  I used their chat function and was given a new code and assurance that it would not be an issue again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "N Ray Kalyan",
          "Nb_Reviews": 1,
          "Date": "2020-09-24T21:00:45.000Z",
          "Titre": "Disclosure misleading",
          "Contenu": "Bought turbo tax business software presumably at discounted price as opposed to directly from Intuit.com. makers of turbo tax. Turns out, the info that this discounted software doesn't include state tax software and additional balance amount had to be paid again and again for state software, esp.   if you had more than one business. Totally caught me by surprise. Won't deal with this again. Sorry."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "oscar garcia",
          "Nb_Reviews": 2,
          "Date": "2020-09-08T17:42:48.000Z",
          "Titre": "several problems purchasing and invalid license",
          "Contenu": "I had several problems purchasing the products. I kept getting timeouts and an error about setting the shipping information for a download purchase .After I was able to complete the order, the license I received is no longer valid. I am unable to activate the product. The team quickly addressed this problem by sending me a new key. I was able to start using the software."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Willis White",
          "Nb_Reviews": 1,
          "Date": "2020-10-21T17:31:08.000Z",
          "Titre": "Order was Amazon Prime with two day…",
          "Contenu": "Order was Amazon Prime with two day shipping.  Was supposed to arrive on Saturday, OCT. 17th.   Arrived on Tuesday, October 20.  Would not have been a problem except I was told it would arrive on OCT. 17th so I expected it that day and changed my plans to be at home when it was supposed to arrive.  Never did get a definitive date until day of arrival (USPS said it was to be delivered in a daily email they send me in the early am with that day's mail)."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ken Winiecki",
          "Nb_Reviews": 2,
          "Date": "2021-01-02T16:59:44.000Z",
          "Titre": "I lost one account/software I…",
          "Contenu": "I lost one account/software I purchased.  Website did not open account on my first purchase, and my stupid computer updated and rebooted.  I lost my key, and have no account to log into to reclaim.  I signed up again to purchase again and this time all went as expected.  I am upset I lost the first software I purchased."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DINA CHEEK",
          "Nb_Reviews": 2,
          "Date": "2020-03-28T19:35:16.000Z",
          "Titre": "I love your pricing and availability",
          "Contenu": "I love your pricing and availability.  This year, however,  I had to contact you and then Intuit directly for new Product ID numbers.   All of the assigned numbers either only worked for one install, which only allowed me to open the program a couple of times, or didnt work at all.   I'm not sure if this was a problem with the way you get/issue those numbers or if it was an Intuit problem.  But, it caused a lot of chaos on my end.  I plan on checking more on this, and hopefully it was just an Intuit glitch, because I really like purchasing my products cheaper from you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "v j Robinett",
          "Nb_Reviews": 1,
          "Date": "2020-03-28T03:09:59.000Z",
          "Titre": "you were $9 cheaper than any other…but really no bargin!",
          "Contenu": "you were $9 cheaper than any other merchant.  I really expected you to be cheaper than you were.  I only file a trust return once a year and it take son three minutes to plug the figures in, still it cost $100 which is very high for only one simple return"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel Kunesh",
          "Nb_Reviews": 2,
          "Date": "2021-01-04T19:25:31.000Z",
          "Titre": "Price good but",
          "Contenu": "Price good, download seems to have worked but your web page needs a lot of work. I had to enter my credit card info 4 times using the discount before I succeeded. With your unreasonably long and complex password, it was quite cumbersome."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2022-09-13T19:14:33.000Z",
          "Titre": "trouble getting the 5-Turbotax submissions",
          "Contenu": "Several times, I have had trouble with using the Turbotax serial number to get the FIVE Federal tax allowances."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ken Cook",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T19:12:22.000Z",
          "Titre": "Taxes are taxes!",
          "Contenu": "I had no trouble with the down, even though my computer is very old and the download went OK."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jonathan Spencer",
          "Nb_Reviews": 6,
          "Date": "2020-09-07T17:47:32.000Z",
          "Titre": "I think this purchase was a bit dodgy…",
          "Contenu": "I think this purchase was a bit dodgy because the software stopped recognizing my activation code and the vendor issued a new one - I've been using TurboTax for decades and never experienced that before."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul S",
          "Nb_Reviews": 2,
          "Date": "2020-04-09T20:08:48.000Z",
          "Titre": "Just needed a 100% clean detection before install.",
          "Contenu": "Update: Thanks for the refund. I'll give you the benefit of the doubt, that it could be a false positive. It comes down to 100% confidence for me.From your link below: \" Speaking as a developer myself, if you want to have folks have full confidence in your software, it's best to have a clean detection, not a workaround to disable security precautions. \"------------------------- Older reviewDid a scan of the TurboTax Business software downloaded with virustotal.com it found adware and a Trojan. Their support stop talking to me once I pointed that out.I've requested a refund. (I have the emails of that request)I recommend you scan the software you downloaded before you do your taxes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James McAndrews",
          "Nb_Reviews": 2,
          "Date": "2020-03-27T22:14:29.000Z",
          "Titre": "Not very helpfull if you have questions",
          "Contenu": "I needed to talk to a real person on some issues I was having and could never get through with a telephone call  Wound up using the \"chat\" option and did not receive any helpful information.  The issue was that I purchased two units by mistake and asked for a refund for the one. I could not use the second unit as software would only allow one unit to be downloaded on my computer (chat room person never mentioned this).  Never heard back from Software Discount on a refund after a number of request.  Just received my credit card billing and was charged for only one unit on this billing cycle, Hope that next billing cycle does not include a second billing.  It would have been nice if Software Discount had replied to my request and not left me in limbo."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sander Smith",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T14:06:25.000Z",
          "Titre": "At times intuit software licenses would…",
          "Contenu": "At times intuit software licenses would not work, had to call and get new licenses number."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Sproul",
          "Nb_Reviews": 5,
          "Date": "2020-03-28T00:26:07.000Z",
          "Titre": "Could Go Higher...",
          "Contenu": "I'd go up to 4 or maybe even 5 stars - IF they hadn't kept sending me the same email for a discount on TurboTax AFTER I'd already purchsed same from them...."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roma",
          "Nb_Reviews": 1,
          "Date": "2021-03-18T02:48:19.000Z",
          "Titre": "3 stars",
          "Contenu": "I give 3 stars because I could only use 1 federal download with 1 e-return while the description said there were 5 e-files. Rest all waa smooth & easy!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Keith Esmail",
          "Nb_Reviews": 2,
          "Date": "2022-10-02T01:43:12.000Z",
          "Titre": "Could not get a new download after my…",
          "Contenu": "Could not get a new download after my computer crashed"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Douglas Ward",
          "Nb_Reviews": 4,
          "Date": "2020-03-27T23:55:12.000Z",
          "Titre": "Had to contact support several times to…",
          "Contenu": "Had to contact support several times to resolve an issue with TurboTax. Problem was resolved but it took a week."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Hannah",
          "Nb_Reviews": 1,
          "Date": "2022-02-14T21:40:55.000Z",
          "Titre": "I’m very pleased",
          "Contenu": "I’m very pleased. Fits perfectly. Easy to install."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wayne Rowe",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T00:48:15.000Z",
          "Titre": "The pricing is very competitive with…",
          "Contenu": "The pricing is very competitive with another supplier. I had a bit of an issue with my last order regarding the download, contacted support and they were able to get the issue resolved in a timely fashion so that I was able to file my tax returns on time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeffrey Nimz",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T23:46:51.000Z",
          "Titre": "all good better price",
          "Contenu": "got software immediately and at better price"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "WILLIAM Ferguson Sr",
          "Nb_Reviews": 2,
          "Date": "2023-01-04T21:21:01.000Z",
          "Titre": "Software availability and download ease",
          "Contenu": "Availability of software and is ease of download is very important but price is always a consideration. Turbo tax  has increased $10 from last year which on a % basis is about 17%. Then I have to go shopping to other vendors and outlets."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Craig Endicott",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T06:22:44.000Z",
          "Titre": "The Chat option was nice for questions…",
          "Contenu": "The Chat option was nice for questions when some procedures were not obvious.It would have been nice to get the licensing key sooner, rather than having to come back to do the installation later."
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "Carlos Cunha",
          "Nb_Reviews": 3,
          "Date": "2023-01-01T10:53:46.000Z",
          "Titre": "All went smoothly with purchase",
          "Contenu": "All went smoothly with purchase. Just confusion when came to download because pc-mac are on the same download. I had chosen pc when purchasing and thought somehow I ended up with mac. Live chat helper informed me it was all one download."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jack Roosa",
          "Nb_Reviews": 2,
          "Date": "2023-04-01T22:40:05.000Z",
          "Titre": "I've been a customer of yours for 4…",
          "Contenu": "I've been a customer of yours for 4 years for Turbo Tax.  The prices are good, but this last time it was hard to get the discount on my order and it took a day to get an answer to the problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DWAIN FANSLER",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T20:54:05.000Z",
          "Titre": "good service",
          "Contenu": "I had an issue with my own mistake by ordering the wrong year on a program. They fixed the problem in a very professional manner"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anna  Nguyen",
          "Nb_Reviews": 3,
          "Date": "2022-11-03T01:23:09.000Z",
          "Titre": "Great Vendor",
          "Contenu": "I bought software from SoftwareDiscountUSA.com for several. It works great at good price"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Reed Haslam",
          "Nb_Reviews": 3,
          "Date": "2022-11-16T19:12:26.000Z",
          "Titre": "Turbo Tax always a Good Deal",
          "Contenu": "I've purchased Turbo Tax from SoftwareDiscountUSA for 3 years now. Each time a good experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Feldstein",
          "Nb_Reviews": 5,
          "Date": "2022-11-02T23:19:43.000Z",
          "Titre": "A little less straight-forward than I…",
          "Contenu": "A little less straight-forward than I liked to download TurboTax2022 but still OK."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Martin Hersrud",
          "Nb_Reviews": 2,
          "Date": "2022-11-04T00:22:19.000Z",
          "Titre": "easy to order from …",
          "Contenu": "I ordered from them last year and it went smoothly.  Had a little trouble logging in this year, but got it figured out.  The price was great.  Never had any issues installing last year and don't expect any this year."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dwight Myers",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T19:43:33.000Z",
          "Titre": "Least expensive Seller",
          "Contenu": "Least expensive seller makes it attractive.  Alternative payments would add value to site..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "C.S.",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T00:02:15.000Z",
          "Titre": "Easy Checkout with No Additional Sell PopUps",
          "Contenu": "SoftwareDiscountUSA.com had the program that I needed and I was able to purchase it with ease. I did not have many pop ups of pushing additional product at me as I was trying to check out. Check out was easy breezy. Will definitely keep SoftwareDiscountUSA.com in mind when I am looking for my next software needs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald Reeves",
          "Nb_Reviews": 2,
          "Date": "2022-11-02T13:16:54.000Z",
          "Titre": "Very easy to download",
          "Contenu": "Very easy to download. Question what the cost will be yo purchase additional state software and file additional state returns after the first free one. Who gets the money we pay to file them?"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "BieneMaja",
          "Nb_Reviews": 3,
          "Date": "2022-10-30T13:27:55.000Z",
          "Titre": "Issues with software license key - great customer service",
          "Contenu": "Downloaded tax software purchased Nov 2021 for installation today. License key provided by softwarediscountUSA was seemingly correct, but apparently already used 5x (not by me!) and no longer valid. Had to repurchase software at significantly higher price today to make deadlines…Update: Increasing rating from 2 to 4 stars...Upon receiving my email, customer service immediately re-issued a valid license key, cancelled my re-purchase and initiated a full refund. Still annoying but very nice  CS recovery! Thank You."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LoveStoneArts",
          "Nb_Reviews": 4,
          "Date": "2022-09-13T02:19:06.000Z",
          "Titre": "I always save on my tax preparation…",
          "Contenu": "I always save on my tax preparation software with SoftwareDiscountUSA. This year was seamless. Last year I was locked out and prevented from filing electronically on tax day but I think it was the tax filing function of Intuit and that there was no Intuit technical assistance available. I have needed download assistance from SoftwareDiscountUSA in the past and they were able to help me promptly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barb Thomas",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T16:10:53.000Z",
          "Titre": "Pricing and quick answer to my question"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Howard",
          "Nb_Reviews": 7,
          "Date": "2022-11-02T17:00:11.000Z",
          "Titre": "Price seems to be best available",
          "Contenu": "Price seems to be best available.  Download is quick.  License takes a while before it is available."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry L. TIlton",
          "Nb_Reviews": 2,
          "Date": "2022-11-02T17:42:40.000Z",
          "Titre": "Some difficulty but have used this…",
          "Contenu": "Some difficulty but have used this company before....downloading keys etc makes it more complicated"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Hollands",
          "Nb_Reviews": 2,
          "Date": "2021-03-17T21:53:32.000Z",
          "Titre": "Third year in a row forSoftware Discount USA",
          "Contenu": "I have used Software Discount USA for three years, this is the first year it did not go smoothly. I was given the wrong authentication key which they cleared up very quickly; and the 2020 TurboTax would not allow me to log into my TurboTax account - it acted as a stand alone product. Perhaps that was TurboTax’s doing. Otherwise it was great and Software Discount USA delivered as promised."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 2,
          "Date": "2021-03-02T18:19:47.000Z",
          "Titre": "Download and Installation Problems",
          "Contenu": "I had trouble checking out and downloading.  The program did not want to download after I paid, but some how managed the download.  Then I had difficulties installing on my computer.  Computer did not seem to want to install.  I was able to overcome the difficulty by repeatedly hitting he execute commands.  Eventually, I was able to complete installation."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick Chandler",
          "Nb_Reviews": 3,
          "Date": "2020-09-05T19:05:49.000Z",
          "Titre": "Great price, product works fine.",
          "Contenu": "Overall, got what I wanted at a great price, but didn't receive the email containing product code until the next day. After contacting them the next morning, I was directed to go to the receipt email and there would be a button to start downloading. There was no button, but in a separate email from them, they provided the code. Everything else went smooth, and product works great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Markus",
          "Nb_Reviews": 19,
          "Date": "2020-09-07T23:45:48.000Z",
          "Titre": "Looked like scam, but support was helpful and solved the issue",
          "Contenu": "Paid $99 for the \"turbotax business 2019\" and got a download link and activation code, but when I wanted to use the code, TurboTax said \"All available activations for that code have been used. Error code: 603\"Reached out to their support and they were helpful and responded quite fast with a new licence key, which worked. Still a bit in doubt if they just tried to scam me or if they really had internal issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Dutky",
          "Nb_Reviews": 2,
          "Date": "2021-03-05T04:34:30.000Z",
          "Titre": "It was unclear to me how to download my…",
          "Contenu": "It was unclear to me how to download my software from the email purchase confirmation I received.  Scrolling to the bottom of the page per directions didn't help.  Clicking the \"detailed invoice\" link worked, but that was a guess on my part.  Otherwise, all is well, and working as expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cindy Lee",
          "Nb_Reviews": 2,
          "Date": "2021-01-04T18:37:07.000Z",
          "Titre": "This is the second year I purchased…",
          "Contenu": "This is the second year I purchased turbo tax with your firm.  Year one the download took several tries before it worked.  This year I ordered 2020 but didn't pay attention to the cart when I purchased it and when I went to download it, I noticed that 2019 was downloaded.  I spoke to someone named Oliver on chat and he advised me to order the 2020 (again) and he would refund the 2019.  I did it the second time and it worked.  I feel I was treated right with the remedy.  Thank you to Oliver."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JOHN",
          "Nb_Reviews": 6,
          "Date": "2020-03-27T23:35:03.000Z",
          "Titre": "Worked Out Well.  Software Discount was quick to respond.",
          "Contenu": "Worked well.  The email said \"Activation 1\", so I guess it was for only one computer.  The first activation code I got had already been used up, but Software Discount quickly gave me another one that worked.  I was satisfied since I had only one computer to put it on.  I would have selected 5 stars if the first activation code had worked."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Doug S",
          "Nb_Reviews": 3,
          "Date": "2020-12-01T19:34:47.000Z",
          "Titre": "Shopping and checkout were easy",
          "Contenu": "Shopping and checkout were easy, but I'm not sure if my credit information is stored onsite or not (I usually delete me card after each order completes, for security). Download and installation were fine (as expected, windows installation required reboot and OS reconfiguration after reboot)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "harold banister",
          "Nb_Reviews": 2,
          "Date": "2021-01-03T02:34:22.000Z",
          "Titre": "kkkkk",
          "Contenu": "Maybe this was my ault but I had problems dowloading. I came back to my computer later and pulled the program up and the download went fine. I amnow ready for 2020 tax return for probably at least 20 yeaars using Turbotax. Mostly in the past I bought disks Harold Banister"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry Olson",
          "Nb_Reviews": 2,
          "Date": "2020-04-13T21:15:26.000Z",
          "Titre": "Initial key issues, but quickly resolved",
          "Contenu": "Initially the keys that were supplied at the time of my order and download of TurboTax software were invalid and unusable.  However, this was quickly resolved through an e-mail correspondence and new keys were then sent to me.  TurboTax software worked as expected.Final results, very satisfied."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RICHARD PAUL",
          "Nb_Reviews": 1,
          "Date": "2020-07-03T00:41:47.000Z",
          "Titre": "TurboTax business for trust returns…",
          "Contenu": "TurboTax business for trust returns worked fine on my Windows 7 computer even though Turbo Tax says they don’t support Windows 7 anymore.Need a quick response to decide on whether to use this company. Since I have never used them before I wanted to talk to a live person but they have shut down their telephone response due to COVID-19. Took a little while to get responses on the chat line but eventually answered my questions. They are legit.Downloading, Installing and opening the software went well. Wish they had a PayPal option for payment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Seaskyguy",
          "Nb_Reviews": 1,
          "Date": "2020-11-11T23:13:55.000Z",
          "Titre": "No email receipt/license info",
          "Contenu": "Overall web site was fine but I haven’t gotten an email receipt (receipts are required by the IRS) or an email I can save with license/other info I can put in a folder to help me remember where I bought the software and where/how to download it again in the future"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Silver Spring, MD",
          "Nb_Reviews": 1,
          "Date": "2021-03-18T18:48:33.000Z",
          "Titre": "Some trouble but excellent customer support",
          "Contenu": "The installation process wasn't as smooth as I would have hoped.  I had problems installing the software on a laptop running win 8.1.  I finally got the software to install.  I tried to install it on a desktop running win 10.1 and I got an error message that all downloads had been used ( 5 program downloads were what I was told came with the software ).  Customer support quickly sent another key to me.  I would have given this a 3, but there was excellent customer support, so I gave it a 4.  Due to the excellent support I would recommend this site to anyone.  I only wish you carried more than Microsoft and intuit products."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Willie RYAN",
          "Nb_Reviews": 2,
          "Date": "2020-05-22T09:10:57.000Z",
          "Titre": "Best discount - once you get to the finish line.",
          "Contenu": "Best discount for just what we need.Then, after 6 hours of work, I logged off, and can never get back in my first and only activation!I do need more than that discount. May be I should just spend the 15 extra bucks with a store version, because I cannot complete this return, and now have to waste extra time working the issue with this company, then rebuilding my numbers elsewhere.Update: 05/22Store took care of version authentication issue; my tax was filed without further drama.  I should be fair, sometimes hiccups happen, but store did not leave me hanging but resolved it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry Jones",
          "Nb_Reviews": 2,
          "Date": "2021-04-10T00:24:41.000Z",
          "Titre": "Bought Turbo Tax",
          "Contenu": "I have used SoftwareDiscountUSA several times to buy Turbo Tax....the prices are great and the download worked.....Buying the product on the website is a bit confusing, the website is a little \"wonky\" but it got the job done....."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Barrett",
          "Nb_Reviews": 2,
          "Date": "2020-06-29T13:50:36.000Z",
          "Titre": "Once I made payment the license code…",
          "Contenu": "Once I made payment the license code was displayed in the browser; however, I never received an email with the code.I did eventually receive the email and have saved if for the future. I will definately purchase software from this company again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric F",
          "Nb_Reviews": 9,
          "Date": "2022-09-27T01:33:03.000Z",
          "Titre": "Got a great price",
          "Contenu": "Got a great price, however i had to contact customer support for another code. It got situated though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A Stautz",
          "Nb_Reviews": 3,
          "Date": "2020-07-13T18:11:22.000Z",
          "Titre": "A Rocky Start but a Smooth Finish",
          "Contenu": "TurboTax software purchase and download were easy. Install was easy, but when I tried to open the program my computer could not find it, or simple would not open it. I had to uninstall the software, download it and install it again. The program ran fine after the second install. I'm not very tech savy, so I was a little nervous about removing the software...I was thinking that if I uninstalled it from my computer I would have to purchase the product again (a new license), but that was not the case; the original license worked fine for the second download and I was able to use the software and complete my taxes without any issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph Taylor",
          "Nb_Reviews": 1,
          "Date": "2021-04-10T11:33:04.000Z",
          "Titre": "Your email offer promised a 10%…",
          "Contenu": "Your email offer promised a 10% discount on the $54.00 price, for a net cost of $48.60.  You charged my credit card $53.99.  Please refund the $5.39 difference with a credit card adjustment.Thank you: refund received."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ms. AUDREY OWEN",
          "Nb_Reviews": 3,
          "Date": "2021-07-16T21:33:00.000Z",
          "Titre": "The product and the price are fine. The was a processing glitch.",
          "Contenu": "The product and the price are fine.  However, there was a software problem with providing my activation code.  It was solved relatively quickly after a couple of emails, but got me worried about the process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Julian",
          "Nb_Reviews": 1,
          "Date": "2022-10-16T22:12:40.000Z",
          "Titre": "Purchase",
          "Contenu": "The purchase required me to create an account, I would have not had to do that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris K",
          "Nb_Reviews": 1,
          "Date": "2020-09-27T06:20:52.000Z",
          "Titre": "Problem  with license resolve quickly",
          "Contenu": "I had a problem with. The license number but got it resolved almost immediately through chat - at 9 pm on a Saturday night.  I was sort of in shock there was someone there to answer my inquiry let alone get my problem solved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Percy L Jones Sr",
          "Nb_Reviews": 2,
          "Date": "2023-09-17T14:18:33.000Z",
          "Titre": "inexpensisive &customder Service Was…",
          "Contenu": "inexpensisive &customder Service Was Great!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lori Griego",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T22:23:42.000Z",
          "Titre": "With the exception of a time delay…",
          "Contenu": "With the exception of a time delay (sometimes) in processing license numbers, my experience has been great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry from Arizona",
          "Nb_Reviews": 1,
          "Date": "2020-12-28T01:12:02.000Z",
          "Titre": "Good Purchase.",
          "Contenu": "The transaction went fairly quick including the downloading of the files.  However, the instructions to install the software on my computer were vague, and it took me several attempts until I was successful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julian Karpoff",
          "Nb_Reviews": 2,
          "Date": "2022-09-27T02:24:11.000Z",
          "Titre": "TurboTax is pretty good",
          "Contenu": "TurboTax is pretty good, but it is not perfect.  It left me with some mistakes to override."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carol C",
          "Nb_Reviews": 1,
          "Date": "2020-08-24T13:20:18.000Z",
          "Titre": "I received the program download…",
          "Contenu": "I received the program download immediately after entering my payment.  The program proceeded to download, but them asked for a license number.  My invoice said \"awaiting license\".  I sent a email to Software Discount asking for the license number.  It took them 6 hours to respond with the number.  I was very relieved to finally receive the license number as it was the first time I had dealt with this company and was not sure of their reliability.  I also initiated a chat but canceled it after no response for 3 hours.  I don't think this option should be offered if no one is available to chat.  In the end the product works well, but I think the company should let the customer know if there will be a wait for the license number."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carla Green",
          "Nb_Reviews": 5,
          "Date": "2020-11-07T14:41:10.000Z",
          "Titre": "Had issues at first with installing the…",
          "Contenu": "Had issues at first with installing the program because of my malware program but was able to work through those issues and download the program. After that, no issues and it works great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda Williams",
          "Nb_Reviews": 1,
          "Date": "2021-02-05T04:05:01.000Z",
          "Titre": "Download Issue - Server Problem",
          "Contenu": "Unfortunately the download button kept giving a message that download couldn't complete - server problem.  After a quick Chat a download link was provided which worked just fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "amaz",
          "Nb_Reviews": 4,
          "Date": "2020-03-28T15:42:51.000Z",
          "Titre": "Product was just as promised...",
          "Contenu": "Product was just as promised.  Would have given 5 stars if the license key didn't fail after 5 uses.  But this was probably a limitation of TurboTax software and not SoftwareDiscountUSA"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike from PA",
          "Nb_Reviews": 3,
          "Date": "2023-01-02T15:33:36.000Z",
          "Titre": "lowest price I found for same product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "rental owner",
          "Nb_Reviews": 3,
          "Date": "2020-03-27T23:03:31.000Z",
          "Titre": "I’ve used this site for couple of years…",
          "Contenu": "I’ve used this site for couple of years to purchase tax softwares.  Prices are the lowest.    This year is first time that the code was wrong.   I’ll probably purchase from this sight."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RICH BILLION",
          "Nb_Reviews": 3,
          "Date": "2020-07-10T12:22:01.000Z",
          "Titre": "Good price but slow support",
          "Contenu": "Ordered Turbo Tax software download.  They charged me and sent the download promptly but copy license no. was bad.  Took more than two hours to get new license n. that worked."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ELOY WILSON",
          "Nb_Reviews": 1,
          "Date": "2020-04-03T23:15:46.000Z",
          "Titre": "Very good service",
          "Contenu": "Very good service. Good price. immediate download. Software was complete and worked perfectly. My only possible issue is the limited information prior to purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ANGELINA",
          "Nb_Reviews": 1,
          "Date": "2021-07-21T05:52:16.000Z",
          "Titre": "Great service but took over 30 minutes…",
          "Contenu": "Great service but took over 30 minutes of wait time for the questions to be answered. Previously I have spent much less time waiting than this time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas Olsen",
          "Nb_Reviews": 1,
          "Date": "2021-01-03T17:22:11.000Z",
          "Titre": "Software download looks fine so far",
          "Contenu": "Software download looks fine so far. This website is a bit clunky and quirky for order processing, but I made it work in the end. Pricing is very fair."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna Blackledge",
          "Nb_Reviews": 1,
          "Date": "2021-03-31T14:12:11.000Z",
          "Titre": "Great Customer Response",
          "Contenu": "After all the problems I had, you made good on each and everyone of them and I completed my taxes lickety, split.  I will definitely recommend you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Wittmann",
          "Nb_Reviews": 1,
          "Date": "2020-03-27T23:27:45.000Z",
          "Titre": "License Key issue",
          "Contenu": "The first license key failed to work and I had to contact customer support for a second one. The representative resolved my case quickly to my satisfaction."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "spiros Blentzas",
          "Nb_Reviews": 1,
          "Date": "2021-04-02T02:38:42.000Z",
          "Titre": "OWENER",
          "Contenu": "Great site and very easy downloaded the program with out any problem .....I always will buy here from now on !!!! Thanks for your Service Spiros"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Prasan",
          "Nb_Reviews": 3,
          "Date": "2020-03-27T23:05:44.000Z",
          "Titre": "Firstly I had some downloading problems…",
          "Contenu": "Firstly I had some downloading problems with the Turbotax Deluxe. However later the technician was able to resolve the issue. Thanks for that.Prasan."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 3,
          "Date": "2020-12-15T16:17:18.000Z",
          "Titre": "Easy buying experience",
          "Contenu": "Easy buying experience. Except the cost of Turbo Tax Home & Office edition, was higher than I usually pay. $69.99  Still better than others."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 2,
          "Date": "2021-04-25T16:29:10.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service.  I entered my concern in the chatbox and it was addressed and solved right away.  I couldn't ask for more."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen White",
          "Nb_Reviews": 2,
          "Date": "2020-03-28T00:52:28.000Z",
          "Titre": "TurboTax worked expected; a few installation problems",
          "Contenu": "TurboTax worked as it was supposed to.  I did have some problems with the installation, however, but the chat support was fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "W Hubbard",
          "Nb_Reviews": 2,
          "Date": "2020-09-25T18:26:33.000Z",
          "Titre": "Service was good",
          "Contenu": "Service was good, even though the product did not work / install on my computer properly. Gave me an instant refund though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "H.E.Donist",
          "Nb_Reviews": 1,
          "Date": "2020-07-01T22:13:30.000Z",
          "Titre": "A little confusing",
          "Contenu": "A little confusing; but this is the third supplier I've tried this afternoon, and the first with which I was successful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 1,
          "Date": "2020-05-03T16:30:55.000Z",
          "Titre": "Good Service",
          "Contenu": "Initially did not receive software activation code with purchase but was provided within 24 hours of initial purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry Jones",
          "Nb_Reviews": 2,
          "Date": "2020-03-27T21:54:58.000Z",
          "Titre": "Overall",
          "Contenu": "Overall, good experience.....difficulties with installing the license on a second PC, but it was finally resolved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Milan Botica",
          "Nb_Reviews": 2,
          "Date": "2021-02-03T18:32:37.000Z",
          "Titre": "Second year using SD-USA - LOVE IT!",
          "Contenu": "Second year using SD-USA.  Love the convenience, the price and the user experience.  HIghly Recommended :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Voegele",
          "Nb_Reviews": 2,
          "Date": "2020-03-28T23:51:46.000Z",
          "Titre": "Bought TurboTax",
          "Contenu": "Bought TurboTax. SoftwareDiscount had rather obscure directions for uploading it. But finally got it working."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerry B",
          "Nb_Reviews": 1,
          "Date": "2021-03-04T01:04:43.000Z",
          "Titre": "Would be nice to have a guest checkout",
          "Contenu": "Would be nice to have a guest checkout, but other than that the site was very easy to use and navigate"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angel Oakley",
          "Nb_Reviews": 1,
          "Date": "2021-04-10T22:18:03.000Z",
          "Titre": "Emailed product keys quickly.",
          "Contenu": "Received the keys quickly, but was not clear where to get the download link for the software."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Grant",
          "Nb_Reviews": 1,
          "Date": "2020-12-01T15:43:45.000Z",
          "Titre": "Disappointing Site",
          "Contenu": "I found the process of purchasing TurboTax via your site to be crude and difficult to follow."
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "BG",
          "Nb_Reviews": 1,
          "Date": "2020-03-29T08:27:28.000Z",
          "Titre": "I had a problem with the access code…",
          "Contenu": "I had a problem with the access code but it was solved quickly with a request ticket"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AnnMarie Phelps",
          "Nb_Reviews": 1,
          "Date": "2021-04-09T19:01:38.000Z",
          "Titre": "The only that didn’t work was the…",
          "Contenu": "The only that didn’t work was the texting feature to get a code. I had to call."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 4,
          "Date": "2021-02-09T15:36:05.000Z",
          "Titre": "Had to log in multiple times to get the…",
          "Contenu": "Had to log in multiple times to get the system to work and purchase the software"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob in Mi",
          "Nb_Reviews": 2,
          "Date": "2020-11-11T19:46:32.000Z",
          "Titre": "Just awaiting product activation code…",
          "Contenu": "Just awaiting product activation code for full satisfaction. Easy process so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenneth Matz",
          "Nb_Reviews": 1,
          "Date": "2020-03-28T23:50:43.000Z",
          "Titre": "This is standard software but I was…",
          "Contenu": "This is standard software but I was very happy with the trouble free download"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lien-Cheng Chang",
          "Nb_Reviews": 2,
          "Date": "2020-03-28T04:43:15.000Z",
          "Titre": "it would be better if it could be cheaper.",
          "Contenu": "The price is a bit expensive, and it would be better if it could be cheaper."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Minh Nguyen",
          "Nb_Reviews": 1,
          "Date": "2021-04-08T20:12:10.000Z",
          "Titre": "SoftwareDiscountUSA has a good price…",
          "Contenu": "SoftwareDiscountUSA has a good price for Turbo Tax. It is easy to order"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ROBERT KAYSER",
          "Nb_Reviews": 1,
          "Date": "2020-03-28T13:28:58.000Z",
          "Titre": "The software works great",
          "Contenu": "The software works great, and it was much cheaper than the other vendors."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "lora chuffo",
          "Nb_Reviews": 1,
          "Date": "2020-06-21T02:10:55.000Z",
          "Titre": "Download failed",
          "Contenu": "Download failed. Could not restart.  Needed a refund.  Refund initiated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adger Dodson",
          "Nb_Reviews": 3,
          "Date": "2020-05-07T12:27:30.000Z",
          "Titre": "Had a few issues I had to call a tax…",
          "Contenu": "Had a few issues I had to call a tax personal to fine out Answers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Weiner",
          "Nb_Reviews": 3,
          "Date": "2021-08-18T21:22:31.000Z",
          "Titre": "The software didn't pick up the info…",
          "Contenu": "The software didn't pick up the info from last year."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "leonard chmielewski",
          "Nb_Reviews": 1,
          "Date": "2020-06-09T16:56:27.000Z",
          "Titre": "So far it was eazy",
          "Contenu": "So far it was eazy. now for the down load and doing the Taxes"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Nicholson",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T05:36:45.000Z",
          "Titre": "Very good product"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jonathan Botzler",
          "Nb_Reviews": 1,
          "Date": "2020-04-04T12:52:59.000Z",
          "Titre": "My license key stopped working and was…",
          "Contenu": "My license key stopped working and was quickly resolved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fred Arthurs",
          "Nb_Reviews": 1,
          "Date": "2020-05-01T16:54:00.000Z",
          "Titre": "No problem downloading and get up and…",
          "Contenu": "No problem downloading and get up and running.Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Jensen",
          "Nb_Reviews": 2,
          "Date": "2020-04-04T12:56:26.000Z",
          "Titre": "Software was good",
          "Contenu": "Software was good, but had trouble with license."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marion",
          "Nb_Reviews": 2,
          "Date": "2020-03-28T18:39:25.000Z",
          "Titre": "Great price",
          "Contenu": "Great price; a little confusing to download..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bubba",
          "Nb_Reviews": 1,
          "Date": "2020-07-21T20:19:27.000Z",
          "Titre": "Good",
          "Contenu": "This is not great to have to write a review"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Altenhain",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T05:38:45.000Z",
          "Titre": "Good experiance"
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "George Ayoub",
          "Nb_Reviews": 3,
          "Date": "2020-06-05T17:17:08.000Z",
          "Titre": "Delivered when needed",
          "Contenu": "Delivered when needed.  That is positive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew Tavianini",
          "Nb_Reviews": 4,
          "Date": "2021-08-23T01:46:40.000Z",
          "Titre": "Fast Service and quality product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Les",
          "Nb_Reviews": 2,
          "Date": "2020-12-01T23:30:16.000Z",
          "Titre": "happy so far",
          "Contenu": "happy so far, download worked fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Stork",
          "Nb_Reviews": 1,
          "Date": "2020-03-28T18:08:23.000Z",
          "Titre": "was a good deal and a easy purchase"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George Kinney",
          "Nb_Reviews": 1,
          "Date": "2020-12-01T02:53:22.000Z",
          "Titre": "Priced",
          "Contenu": "Priced, delivered as promised"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 4,
          "Date": "2020-03-28T01:18:23.000Z",
          "Titre": "Great price for the program"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2020-04-03T22:38:29.000Z",
          "Titre": "Good to Go",
          "Contenu": "Got what I asked for..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2020-04-04T15:56:53.000Z",
          "Titre": "Seamless transaction."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marian Cardone",
          "Nb_Reviews": 1,
          "Date": "2021-04-12T01:20:27.000Z",
          "Titre": "Loved the savings!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Grickis",
          "Nb_Reviews": 5,
          "Date": "2020-07-10T11:08:23.000Z",
          "Titre": "No Problems",
          "Contenu": "No Problems with it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria Robida",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T04:36:20.000Z",
          "Titre": "From placing the order to receiving the…",
          "Contenu": "From placing the order to receiving the download it all went smoothly. This us my second time placing an order and both times were good. I will be purchasing again next year. Reliable company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Mohr",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T23:33:28.000Z",
          "Titre": "Great price, great customer service",
          "Contenu": "Accidentally ordered the wrong software. Software Discount credited the purchase so I could purchase the correct one - even though the mistake was clearly my fault. Great customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hal Burch",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T01:34:32.000Z",
          "Titre": "SD USA did great!",
          "Contenu": "SD USA did great. Had a little trouble getting software to work correctly and the chat response was quick and got me going the right direction. Very satisfied with service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gail",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T21:07:10.000Z",
          "Titre": "Great online site that is easy to use",
          "Contenu": "Great online site that is easy to use.  Awesome prices as well.  Customer service was also great and very quickly resolved my issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-05T22:40:00.000Z",
          "Titre": "Although the unbeatable price made me…",
          "Contenu": "Although the unbeatable price made me nervous (\"too good to be true\"?) the transaction was completely legit and painless. The required \"license key\" was right there on the download page, download occurred instantaneously, installed & ran software - every aspect was flawless.  I'll be back!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kjovi",
          "Nb_Reviews": 2,
          "Date": "2023-10-25T16:27:40.000Z",
          "Titre": "best value and great delivery of product.  consistent for several years",
          "Contenu": "I have used this company each year for tax software and the delivery of the software is perfect and the cost is less than others.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jen Carreiro",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T05:00:50.000Z",
          "Titre": "No complaints here!",
          "Contenu": "No complaints here!  I placed my order, received my authorization code, downloaded the product and began using it.  No issues using it from the beginning to end.  And in past experience, the customer service has been excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cherie Jones",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T18:24:21.000Z",
          "Titre": "Downloaded the software without any…",
          "Contenu": "Downloaded the software without any issues. Liked the discount code you sent to me as returning customer. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Heisey",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T02:07:05.000Z",
          "Titre": "Customer First Service",
          "Contenu": "I made an error and ordered the wrong software.   You all were very prompt and courteous in helping to resolve the problem.    You are the best and I continue to be a dedicated customer!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Junier H.",
          "Nb_Reviews": 3,
          "Date": "2023-09-17T02:29:56.000Z",
          "Titre": "Great prices, great service.",
          "Contenu": "I have been buying from software discount for a few years for the great prices. This year, I had an issue with a license # late at night and I was able to solve it through the live chat feature within minutes. Great service!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stacie  L George",
          "Nb_Reviews": 2,
          "Date": "2023-04-16T22:03:25.000Z",
          "Titre": "I was shopping online for TurboTax…",
          "Contenu": "I was shopping online for TurboTax software and came across SoftwareDiscountUSA.  I wasn’t sure if they were a reputable company but when I did more research, I came across many positive reviews.  Their price was lower than anyone else so it was hard to believe but I decided to try it out.  My experience was positive from start to finish.  It was easy to purchase online and download the software.  The program worked perfectly and I will now purchase my tax software here in the future.  For anyone like me who hasn’t heard of this company, they are trustworthy and the experience was flawless."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Dirienzo",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T01:35:36.000Z",
          "Titre": "Fast and easy",
          "Contenu": "Fast and easy, immediate access to download! The way it's supposed to be!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Pendragon",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T21:09:51.000Z",
          "Titre": "Best price on turbo tax.",
          "Contenu": "Best price on turbo tax.. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Silver",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T20:29:52.000Z",
          "Titre": "Great prices and easy website-Repeat Customer",
          "Contenu": "Always a fast, easy and affordable experience with SoftwareDiscountUSA.Great prices, fast software activation and easy ability to find older purchases/downloads from the website"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LUCY DUFOE",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T20:58:34.000Z",
          "Titre": "Fast.  Easy.  Affordable.",
          "Contenu": "Fast.  Easy process.  Affordable.  Customer service was great especially last year when I accidentally clicked on the wrong product.  They were quick to exchange it for the correct one and processed the refund right away.  I will purchase again in the future.  I will also recommend to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Software Customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T15:07:11.000Z",
          "Titre": "Reliable Company, Easy to Use Website",
          "Contenu": "Easy to use website; easier then their competitor's websites.  Ease of ordering & prompt software availability.  I do think their products, like TurboTax have to start providing ALL forms States give them, otherwise it is a huge waste of $ & time for the customer.  Although that's not SoftwareDiscountUSA's fault, their vendors must provide usable software.  When I told SoftwareDiscountUSA that I wasn't provide most of the tax forms I needed, they promptly refunded. So, very good experience, and I would definitely buy more software from SoftwareDiscountUSA. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "US customer",
          "Nb_Reviews": 3,
          "Date": "2023-04-18T15:46:59.000Z",
          "Titre": "Always offers a lower price for Turbo…",
          "Contenu": "Always offers a lower price for Turbo Tax download during tax time, when everyone else jacks up the price.  Transaction was seamless and reliable.  Hope to visit you next year!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tammy Provence",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T21:32:52.000Z",
          "Titre": "Long Term Customer",
          "Contenu": "I've been buying Turbo Tax from this company for years...always a good experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Huang",
          "Nb_Reviews": 1,
          "Date": "2023-01-02T04:43:55.000Z",
          "Titre": "Reasonable price",
          "Contenu": "Reasonable price, easy to be downloaded and installed. If you have the account with the website, you can always keep your purchase record there. More important, you can have the key id for installation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce in COS",
          "Nb_Reviews": 1,
          "Date": "2023-01-02T07:35:34.000Z",
          "Titre": "Easy find, quick purchase, continuing as a happy repeat customer",
          "Contenu": "I found the software that I was looking for quite easily.  The cost was about half of retail.  A coupon code that SoftwareDicountUSA emailed to me worked just fine for a \"sale\" price.  The checkout process was quick and simple.  I had a question after my software download was completed, and I wrote/emailed my question late on a Saturday night, and I had a response on Sunday ... quite refreshing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MANSOOR ALI",
          "Nb_Reviews": 2,
          "Date": "2023-10-25T01:20:38.000Z",
          "Titre": "Saved $$$",
          "Contenu": "Saved money without compromising anything"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Furgencio Herrera",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T07:39:52.000Z",
          "Titre": "They have not only been great with the…",
          "Contenu": "They have not only been great with the software selection but their support team have been superb with great turnaround time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Schaefer",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T20:28:27.000Z",
          "Titre": "Great support!",
          "Contenu": "Easy to purchase, the 10% discount helped save money. Had issue opening download but the tech support at Software DiscountUSA helped through chat and I was able to successfully install."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Levy",
          "Nb_Reviews": 4,
          "Date": "2023-04-03T19:45:32.000Z",
          "Titre": "Found Turbotax for $30 less",
          "Contenu": "Found Turbotax for $30 less than any other store. Instant download with working license. This is my second year buying from them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy Duerr",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T23:02:14.000Z",
          "Titre": "When I call them and ask for help when…",
          "Contenu": "When I call them and ask for help when I lost a key they help me out I was able to keep going and get my taxes done but that was last year so I just bought again this year from them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PS",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T02:58:29.000Z",
          "Titre": "Good price",
          "Contenu": "Good price. Easy to download and activate."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Vaillant Gicqueau",
          "Nb_Reviews": 2,
          "Date": "2023-04-15T20:44:59.000Z",
          "Titre": "I got the best price for TurboTax…",
          "Contenu": "I got the best price for TurboTax desktop. First, they sent me a boggy activation code but their customer service quickly fixed the problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rverrogue",
          "Nb_Reviews": 2,
          "Date": "2023-02-04T05:33:55.000Z",
          "Titre": "I’ve bought from Software Discount USA…",
          "Contenu": "I’ve bought from Software Discount USA previously and had a great experience so I decided to go the same route this year as well.  Excellent service and product delivered promptly and as expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 2,
          "Date": "2023-03-02T05:50:29.000Z",
          "Titre": "Easy process",
          "Contenu": "The ease of accessing the site and paying for the download. The download came immediately and the instructions were very clear on how to load the file.This is the 3rd year I have used Software Discount USA."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Wood",
          "Nb_Reviews": 2,
          "Date": "2023-02-06T02:47:13.000Z",
          "Titre": "The Best tax software at the Best price.",
          "Contenu": "I got the TurboTax software I use every year at a discounted price. It was fast and easy to download and install on my iMac. The instructions were simple to follow. My return has been sent to TurboTax already. This is the third year I bought it from SoftwareDiscountUSA.com . I will buy it from here every year and tell my friends to do the same.  Thank You"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce Brothers",
          "Nb_Reviews": 2,
          "Date": "2023-01-02T17:42:24.000Z",
          "Titre": "Have purchased TurboTax this way for…",
          "Contenu": "Have purchased TurboTax this way for the last three years and am happy with SoftwareDiscount. The process of purchasing, downloading, installing, to the point of inputting information took 40-minutes. No issues at all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "janie",
          "Nb_Reviews": 3,
          "Date": "2023-02-22T05:54:53.000Z",
          "Titre": "Reminders for a discount..  please!",
          "Contenu": "Reminders for a discount..  YES please!  Such good values and great customer service and support.   Software Discount is my go to for my Turbo Tax purchase!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JR",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T22:39:01.000Z",
          "Titre": "Ordering software was easy",
          "Contenu": "Ordering software was easy, quick, and effective.  Prices were great also, which is why I was a returning customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce D",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T03:55:19.000Z",
          "Titre": "Excellent support",
          "Contenu": "The purchase was very simple and the site easy to navigate. During the install I had an issue but SoftwareDiscountUSA replied to my issue quickly and resolved the problem with no questions asked."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EDWARD CAMPBELL",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T20:24:25.000Z",
          "Titre": "this is the best deal on the internet",
          "Contenu": "this is the best deal on the internet, download makes it available immediately.  I purchased from Software Discount for the last three years, and will continue, in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott I (NC)",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T15:15:51.000Z",
          "Titre": "Always Dependable!",
          "Contenu": "Great prices, huge software inventory, reliable, easy downloads, responsive customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David R",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T16:44:40.000Z",
          "Titre": "Easy ordering",
          "Contenu": "Easy ordering, easy delivery, good price.  When I need software (Intuit, Microsoft, whatever) I go here!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tamara H",
          "Nb_Reviews": 8,
          "Date": "2023-04-05T18:09:35.000Z",
          "Titre": "My experience with SotwareDiscountUSA…",
          "Contenu": "My experience with SotwareDiscountUSA for several software needs has always been great.  Had a customer service need one time, and helped me through.  Trustworthy and use often!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynn Brooks",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T20:18:25.000Z",
          "Titre": "Been getting my Turbo Tax software from…Softwarediscountusa",
          "Contenu": "Been getting my Turbo Tax software from you for some time now and plan to continue for my future years, as long as they last, and you continue to provide the best prices and download services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "shawn smith",
          "Nb_Reviews": 2,
          "Date": "2023-04-01T00:25:51.000Z",
          "Titre": "Download was fine! Cheapest dl out..",
          "Contenu": "Download was fine. Quick n easy. Filed same day. Also included filing fees force file. Best n cheapest out there get it b4 the 31st though or discount won't apply. Used last year too. Never had any issues"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Khosro Nourollahi",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T20:14:46.000Z",
          "Titre": "Date of purchase: 04/02/2023",
          "Contenu": "Date of purchase: 4/2/2023The purchasing process was very easy to complete. The website is user friendly and instructions are easy to follow."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph T Bienias",
          "Nb_Reviews": 9,
          "Date": "2023-01-05T19:50:31.000Z",
          "Titre": "TurboTax 2022 Deluxe Download",
          "Contenu": "TurboTax 2022 Deluxe Download. Best Price on web. Delivery within 1 min after completing purchased. No problem downloading, works fine. Would recommend to family and friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "thomas Hage",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T23:04:07.000Z",
          "Titre": "Have purchased many times over the…",
          "Contenu": "Have purchased many times over the years from them and have had no problems at all and the best price will continue in the future"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-07-19T14:31:22.000Z",
          "Titre": "Smooth order process",
          "Contenu": "Smooth order process. Promptly received confirmation email with all info need to download and install"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CATHERINE SMITH",
          "Nb_Reviews": 5,
          "Date": "2023-04-16T19:32:14.000Z",
          "Titre": "Easy to use",
          "Contenu": "Quick, easy download, purchase screen provides the key so can copy and paste it in, plus sent via email. Third year to use them in a row, I am a happy return customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2023-04-13T16:40:51.000Z",
          "Titre": "Instantly received the software and key…",
          "Contenu": "Instantly received the software and key and it all worked. This is probably the third time using softwarediscountusa.com"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John B",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T02:15:03.000Z",
          "Titre": "This Company is great",
          "Contenu": "This Company is great.  I ordered something by mistake and they corrected it right away."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A. J. Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T19:15:27.000Z",
          "Titre": "Quick and convenient service",
          "Contenu": "Quick service, immediate product availability, and I could download the product at my convenience.  They also provide instructions for setting up the programs on your system that are very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Penny",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T02:41:34.000Z",
          "Titre": "Great Experience",
          "Contenu": "Quick delivery and the price was great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T19:14:59.000Z",
          "Titre": "Had an issue with the activation key…resolved quickly.",
          "Contenu": "Had an issue with the activation key and they resolved it quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "L G Lugo",
          "Nb_Reviews": 2,
          "Date": "2023-01-04T18:30:40.000Z",
          "Titre": "Better than walking into a store and many other sites",
          "Contenu": "The selection was good, the prices were very competitive. The process to purchase, complete and download was very easy. Very pleased with results"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Miller",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T19:42:22.000Z",
          "Titre": "Great deals with no problems",
          "Contenu": "I was looking to buy TurboTax for a cheap price and when I saw this deal I waisted no time buying it and the download was quick with no issues I do recommend SD USA"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandy P",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T22:02:24.000Z",
          "Titre": "Super Helpful!",
          "Contenu": "They did great! I bought the wrong software by mistake and they gladly refunded me the cost so I could purchase the correct software."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CTD",
          "Nb_Reviews": 2,
          "Date": "2023-09-03T17:06:01.000Z",
          "Titre": "Great price",
          "Contenu": "Great price! Easy instructions to follow for download. Quick transaction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 2,
          "Date": "2022-12-19T15:55:11.000Z",
          "Titre": "Speed and ease",
          "Contenu": "Speed, ease of ordering, accessibility of customer service rep.Of course, a really good price didn’t hurt."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sudhir Shah",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T14:47:04.000Z",
          "Titre": "I have been using TurboTax for over 2…",
          "Contenu": "I have been using TurboTax for over 2 decades and have found it very user friendly and never had any issues using it. Keep up the good work! Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samuel Randall",
          "Nb_Reviews": 2,
          "Date": "2023-02-02T17:47:06.000Z",
          "Titre": "SoftwareDiscountUSA is a great resource…",
          "Contenu": "SoftwareDiscountUSA is a great resource for tax software, etc. Customer service is fantastic when I needed to redownload the software in the past. Great prices and quick delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dennish",
          "Nb_Reviews": 2,
          "Date": "2023-03-29T20:28:28.000Z",
          "Titre": "The only place to buy TurboTax",
          "Contenu": "I have purchased TurboTax business and personal for several years.  The prices are great and the customer service is exceptional.  Recently, I had a small issue with activation and they resolved it super fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Mitchell",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T15:26:21.000Z",
          "Titre": "Easy process to download Intuit…",
          "Contenu": "Easy process to download Intuit software.  Great price.  Lowest cost I have ever paid for the TurboTax."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Everett",
          "Nb_Reviews": 2,
          "Date": "2023-10-13T04:12:24.000Z",
          "Titre": "easy download and great results"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "p z",
          "Nb_Reviews": 3,
          "Date": "2023-03-01T12:15:40.000Z",
          "Titre": "Have been a customer for many years",
          "Contenu": "Have been a customer for many years, Never had any issues with your software or service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Micky McMack",
          "Nb_Reviews": 3,
          "Date": "2023-09-26T21:27:51.000Z",
          "Titre": "Excellent value & product",
          "Contenu": "Excellent value & product. Repeat customer -- I keep coming back!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2023-04-05T04:07:58.000Z",
          "Titre": "Cheapest price for Turbo Tax software",
          "Contenu": "Cheapest price for Turbo Tax software, better than Amazon, Best Buy, etc.  Check out was fast and easy and I was able to download in a matter of minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 5,
          "Date": "2023-03-03T05:20:36.000Z",
          "Titre": "Quick",
          "Contenu": "Quick, flawless delivery, though starting the download was a bit confusing. Needed to log off."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 3,
          "Date": "2023-02-06T15:53:11.000Z",
          "Titre": "Truthful listing of products to sell",
          "Contenu": "Truthful listing of products to sell.  Good directions for download and installation.  All worked great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "angela C",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T23:18:19.000Z",
          "Titre": "Best price",
          "Contenu": "Best price, easy to use and very reliable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jean",
          "Nb_Reviews": 2,
          "Date": "2023-03-17T00:53:07.000Z",
          "Titre": "I mistakenly ordered the wrong product",
          "Contenu": "I mistakenly ordered the wrong product.  They rectified the situation without argument or delay."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Verizon Customer",
          "Nb_Reviews": 2,
          "Date": "2023-01-02T23:46:31.000Z",
          "Titre": "Met Expectations",
          "Contenu": "My Order was processed Quickly and Accurately.  The Downloaded Software installed correctly and the License Key worked properly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laurie Weller",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T17:50:16.000Z",
          "Titre": "I bought a software that I forgot I…",
          "Contenu": "I bought a software that I forgot I already purchased. They made it easy to get my money back"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Magill",
          "Nb_Reviews": 4,
          "Date": "2023-01-04T17:41:47.000Z",
          "Titre": "Good pricing",
          "Contenu": "Good pricing, quick response to my order, and the order was fulfilled within minutes, if not seconds."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WhiteEagle",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T04:22:50.000Z",
          "Titre": "They keep you informed",
          "Contenu": "They keep you informed, provide you with good information about their products and specials."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa",
          "Nb_Reviews": 3,
          "Date": "2023-02-02T02:59:59.000Z",
          "Titre": "Great prices and Customer Service",
          "Contenu": "Best place to buy software. Great customer service, even when closed, you will get a response."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LWL",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T19:55:05.000Z",
          "Titre": "Fast service",
          "Contenu": "Fast service. Good instructions for download. I have used them for many years for TurboTax."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kris",
          "Nb_Reviews": 2,
          "Date": "2023-03-29T03:00:52.000Z",
          "Titre": "Repeat customer and this is probably my…",
          "Contenu": "Repeat customer and this is probably my 4 or 5th year of tax software purchase"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Waters",
          "Nb_Reviews": 8,
          "Date": "2023-01-04T18:58:43.000Z",
          "Titre": "Always the source for the lowest price…",
          "Contenu": "Always the source for the lowest price on software.  Purchase process is quick, efficient and easy.  Customer support is always knowledgeable, responsive and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashish Patel",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T23:11:07.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience, easy to navigate your site, checkout process is simple.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Quynh Le",
          "Nb_Reviews": 2,
          "Date": "2023-10-04T09:26:52.000Z",
          "Titre": "Prompt response to help question"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D STEINBRUECK",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T18:39:39.000Z",
          "Titre": "Quick, easy, reliable.",
          "Contenu": "Have purchased multiple titles, multiple years. Product downloads are quick, easy and reliable. Have recommended SoftwareDiscountUSA.com, to many friends and associates."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reina V",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T02:24:49.000Z",
          "Titre": "Every year I buy the software we this…",
          "Contenu": "Every year I buy the software we this company, i don have complain, 100% recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Marple",
          "Nb_Reviews": 2,
          "Date": "2023-01-18T22:19:22.000Z",
          "Titre": "Very convenient and simple to use",
          "Contenu": "Very convenient and simple to use. Best price I found on the software. So nice being able to download and install."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ShaShaokay",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T08:09:36.000Z",
          "Titre": "Great prices",
          "Contenu": "My friend told me about this site and I’m happy about the affordable software and variety."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Walter Morgan",
          "Nb_Reviews": 2,
          "Date": "2023-01-15T04:34:17.000Z",
          "Titre": "No problems!",
          "Contenu": "Legitimate software. I bought 2 Turbo Tx versions and have no difficulties with either."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Becker",
          "Nb_Reviews": 4,
          "Date": "2023-01-14T17:50:34.000Z",
          "Titre": "Turbotax Software",
          "Contenu": "Easy to order and download on line. No issues in installing and using software"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ohio man",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T07:58:56.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. No issues to download the software and proper instructions for download. Key provided in instruction to run the software after installation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 4,
          "Date": "2023-01-01T17:53:32.000Z",
          "Titre": "Great discount off the regular price",
          "Contenu": "Great discount off the regular price!  Better than Amazon or Walmart"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 4,
          "Date": "2023-02-02T00:22:34.000Z",
          "Titre": "information",
          "Contenu": "information, easy setup. However said should be $54 but ended up $60"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arshad",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T08:47:25.000Z",
          "Titre": "Great value",
          "Contenu": "Very easy and smooth process for selection and ordering TurboTax, which was far below the cost at other retailers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T00:28:54.000Z",
          "Titre": "I've used SoftwareDiscountUSA now for…",
          "Contenu": "I've used SoftwareDiscountUSA now for several years and found them to be outstanding for my tax software!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danni Lu",
          "Nb_Reviews": 2,
          "Date": "2023-07-18T03:40:00.000Z",
          "Titre": "Very good price and easy to use",
          "Contenu": "Very good price and easy to use. It's the best web I could find for buying the software (download only)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peggy Waters",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T17:03:49.000Z",
          "Titre": "Easy download and fast service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Frost",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T09:05:51.000Z",
          "Titre": "Least expensive on the tne instant…",
          "Contenu": "Least expensive on the ne instant download worked greatThank You"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Bonadeo",
          "Nb_Reviews": 4,
          "Date": "2023-09-20T07:42:17.000Z",
          "Titre": "Easy, fast, reliable at a good price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David L",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T14:21:58.000Z",
          "Titre": "Third year I’ve used SD and it was very…",
          "Contenu": "Third year I’ve used SD and it was very easy to understand and navigate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Mohr",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T23:29:32.000Z",
          "Titre": "Great price",
          "Contenu": "Great price, easy process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Leonard",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T17:44:36.000Z",
          "Titre": "Great price on software",
          "Contenu": "Great price on software.  Worked flawlessly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Priscilla Chang",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T21:20:15.000Z",
          "Titre": "It was a quick and easy purchase",
          "Contenu": "It was a quick and easy purchase. The software downloaded with no problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lester",
          "Nb_Reviews": 3,
          "Date": "2023-02-01T19:38:29.000Z",
          "Titre": "Great Experience",
          "Contenu": "Website was very easy to navigate and I was able to obtain my purchase effortlessly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valerie E",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T18:55:07.000Z",
          "Titre": "Arrived quickly as an easy download…",
          "Contenu": "Arrived quickly as an easy download process"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ray Tahmasebi",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T05:57:35.000Z",
          "Titre": "Great service with easy to use for…",
          "Contenu": "Great service with easy to use for online software purchasing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Vatterott",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T22:58:41.000Z",
          "Titre": "TurboTax activation.",
          "Contenu": "TurboTax activation.Support team was quick at sending a new activation code when the original failed to work. Much appreciated"
        }
      ]
    }
  ]
}