{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "softwarepin.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Merilyn Artman",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T03:13:57.000Z",
          "Titre": "I can't get the software I bought t open",
          "Contenu": "I can't get the software I bought to work. The price was great but the experience was not."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Gambach",
          "Nb_Reviews": 2,
          "Date": "2023-05-21T17:23:55.000Z",
          "Titre": "Would not refund software that could…",
          "Contenu": "Would not refund software that could not activate"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wayne L RIDDER",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T16:14:52.000Z",
          "Titre": "Key is wrong for my region!!",
          "Contenu": "software downloaded, but now when using the key, it says wrong key for your region. Whatt can I do."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JIM ISBELL & JANE DEL RE",
          "Nb_Reviews": 3,
          "Date": "2023-03-19T17:33:28.000Z",
          "Titre": "Dishonest, poor support",
          "Contenu": "Here is my brief email exchange. It speaks for itself. If I could leave 0 stars, I would. Crooks. Wed, Mar 15, 12:20 PM (4 days ago)to supportI purchased a license for MS Office 2016 from you a couple of years ago. Recently, I needed to repair my MS Office installation, and it disappeared from my computer!  I still have the card from you, so I logged onto your site with unique code and received a product key again. I tried to use that to download and reinstall. MS office and MS says the key is not recognized.Unique Code: 498-229Product key I received from you:  NVVCR-69DGR-83JDJ-P8WRF-Q9M3PPlease help me to access/reinstall my rightfully purchased product.Kind Regards,My Name removed for privacysupportThu, Mar 16, 8:17 AM (3 days ago)to meHi , The office pro plus 2016 you puchased is for 1 time activation only. You can't reuse the same product key to reactivate the software or transfer it to another computer. See the products bewlo, you have purchased the first one. There were 2 links here that lead to new product purchases. Links are not allowed in the review here.SoftwarePin"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roger W. Koteen",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T13:55:25.000Z",
          "Titre": "Couldn't activate the software",
          "Contenu": "Couldn't activate the software. Contacted you for help and as yet have no response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CORNELIUS SAMOEI",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T04:32:04.000Z",
          "Titre": "I WAS NOT ABLE TO INSTALL ONE OF THE…",
          "Contenu": "I WAS NOT ABLE TO INSTALL ONE OF THE SOFTWARE THAT I BOUGHT FROM YOU. EXPIRED. NO ASSISTANCE"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LISA",
          "Nb_Reviews": 2,
          "Date": "2023-01-06T03:09:41.000Z",
          "Titre": "NO DELIVERY OF MICROSOFT SUITE YET, VERY DISSATISFIED!",
          "Contenu": "I paid for Microsoft Suite. I still haven't received a pin # to gain acess to Microsoft Suite."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephen Hatch",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T23:13:16.000Z",
          "Titre": "Have not been able to download",
          "Contenu": "Have not been able to download. Need the disc. If not refund my money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "George Beauchamp",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T23:26:25.000Z",
          "Titre": "I have not been able to get to install"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Newton",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T02:27:23.000Z",
          "Titre": "It took 3 keys to get a working license…",
          "Contenu": "It took 3 keys to get a working license key."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Hell Purchase",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T20:40:00.000Z",
          "Titre": "Purchase From HELL!!!!  Instructions very confusing and had an…",
          "Contenu": "Instructions very confusing and had an extremely, unbelievably experience in uploading the software!!! Unbelievable of an experience!!!! At one point, the wrong software,  “365”, was installed and I had to uninstall.  And it took a few more attempts before finally getting the software loaded!!!  I DO NOT BELIEVE THAT I HAVE EVER HAD AN EXPERIENCE THAT HORRIBLE AND THAT FRUSTRATING!!!!  I definitely will never go through that again!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "dallasnarc",
          "Nb_Reviews": 4,
          "Date": "2022-11-26T12:29:49.000Z",
          "Titre": "MS Outlook does not respond correctly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ludwell Lake",
          "Nb_Reviews": 2,
          "Date": "2023-03-21T02:44:14.000Z",
          "Titre": "Product key would not work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fred Baumann",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T16:31:41.000Z",
          "Titre": "I encountered problems with downloading…",
          "Contenu": "I encountered problems with downloading the program on a new PC spending many frustrating hours trying to load. However, the tech advisor did provide enough direction via chat to help me resolve."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gus/ Militar",
          "Nb_Reviews": 2,
          "Date": "2023-05-05T01:08:37.000Z",
          "Titre": "Price too high compared to mashables"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 4,
          "Date": "2022-12-05T06:03:22.000Z",
          "Titre": "The listing on Amazon was not self…",
          "Contenu": "The listing on Amazon was not self explanatory. I had to cancel my order and then reorder directly through software pin. So thst was a bit annoying but once I got it right the download and installation were easy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Doreen Messina",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T07:30:55.000Z",
          "Titre": "Very difficult to get working",
          "Contenu": "Very difficult to get working. Support was good, but even their directions left out steps to understand what to do. I wouldn’t buy again from you without a tech support phone line."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Walter",
          "Nb_Reviews": 3,
          "Date": "2023-05-30T03:23:25.000Z",
          "Titre": "Good site, bad partner",
          "Contenu": "I found the SoftwarePin site fairly easy to use. There was lots of help text to guide the first-time user. However, there is some sort of relationship between this site and Microsoft. Because of this the download was more difficult than it should have been -- the download site ran me around in circles for quite awhile before I was able to obtain the software that I ordered."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles Rivenburgh",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T01:31:26.000Z",
          "Titre": "Had problem with insulation which could…",
          "Contenu": "Had problem with insulation which could have been prevented, if instructions were better. The problem was Microsoft automatically downloads their office applications including their office suite. I was clicking on their icons instead of the icons that came with your download. But your software guy was able to solve the problem really quickly, and everything seem to be working now"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DAVID E FEREIRA",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T17:44:14.000Z",
          "Titre": "I got the software thru my email and…",
          "Contenu": "I got the software thru my email and followed the directions but could not get it to install. You can’t talk to anybody on the phone only thru email at their convenience. Finally on the 3rd day a chat was setup and finally got it installed. It works great but the interaction with the company can definitely use some work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fred",
          "Nb_Reviews": 2,
          "Date": "2023-04-22T18:51:11.000Z",
          "Titre": "Good DownloadIt was an easy purchase and the…",
          "Contenu": "It was an easy purchase and the download was smooth with no problems. The installation was a bit confusing because it said I was loading Office 365 when I bought Office 2021, but it actually loaded Office 2021. Activation worked very well and all the office programs were activated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jim",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T02:39:25.000Z",
          "Titre": "so far I am happy with the experience",
          "Contenu": "so far I am happy with the experience, but I did load  Office to a computer I don't normally use with Office.  So, I will soon find out how easy it will be to transfer it to the computer that will normally be using it...  That will be the test.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bertha G. Evans",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T13:06:02.000Z",
          "Titre": "The turn around response to my email …",
          "Contenu": "The turn around response to my email was quick.  I only had 1 day to use my softwarePin.Maybe they could let the customer know that the pin only last for 14 days. This information would be very important and should be included in their instructions.Had i not sent them an email I would have lost my $99. Not a good thing !!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "WPG",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T15:40:48.000Z",
          "Titre": "Fast delivery",
          "Contenu": "I received the software immediately after purchasing. Software was easy to load. I'm still getting familiar & learning to use the different programs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T22:35:00.000Z",
          "Titre": "Good customer service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald",
          "Nb_Reviews": 6,
          "Date": "2023-05-06T15:52:58.000Z",
          "Titre": "After having trouble with the first…",
          "Contenu": "After having trouble with the first attempt at downloading my software, your support people worked with me to resolve my initial problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "V Burns",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T04:18:41.000Z",
          "Titre": "software download…",
          "Contenu": "The pur have and software download process was easy"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe ENRG",
          "Nb_Reviews": 2,
          "Date": "2022-12-06T07:49:17.000Z",
          "Titre": "Had problem running the installer",
          "Contenu": "Had problem running the installer.  The help I received was great.  Now everything working."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jemmott",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T03:37:58.000Z",
          "Titre": "Good move.",
          "Contenu": "Peace of mind ordering.  Order came as advertised."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Herbert Gatewood",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T21:48:55.000Z",
          "Titre": "easy installation",
          "Contenu": "The download and installation was very easy"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Timothy Spruill",
          "Nb_Reviews": 2,
          "Date": "2023-04-27T13:05:57.000Z",
          "Titre": "Good price for the product",
          "Contenu": "Good price for the product.  Lower than others."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dion Newhouse Lodge Secretary",
          "Nb_Reviews": 2,
          "Date": "2023-05-13T20:57:26.000Z",
          "Titre": "The low price was the driving factor."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randy Humphrey",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T05:44:10.000Z",
          "Titre": "The download went relatively smooth."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "nette",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T22:52:34.000Z",
          "Titre": "Customer service was professional and…",
          "Contenu": "Customer service was professional and helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Channel",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T18:02:59.000Z",
          "Titre": "Above & Beyond Customer Service!!!",
          "Contenu": "Software works and was delivered quickly. I had an issue with a company selling me the wrong cpmputers and I had already installed one license to a computer, had to wipe the computer and send all 5 PC's back to vendor. SoftwarePin was understanding and sent me a license to replace the one wasted by this others companies dishonesty. They did not have to and I am extremely appreciative."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Przywara",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T20:42:24.000Z",
          "Titre": "Good, Good, Good",
          "Contenu": "Good Products, Good Service, Good Support, Prompt communications"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Nadeau",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T22:51:50.000Z",
          "Titre": "Fast Response",
          "Contenu": "I had an issue with the original product key. I emailed customer support, and they got back to me quickly with a replacement product key."
        },
        {
          "Note": 5,
          "Lieu": "IR",
          "Pseudo": "Amirsasan Gorgzadeh",
          "Nb_Reviews": 4,
          "Date": "2023-11-02T13:13:58.000Z",
          "Titre": "Actually it is good but has minor bugs",
          "Contenu": "Actually it is good but has minor bugs, overally i give it 5 star because of perfect support team"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony Cannone",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T03:46:59.000Z",
          "Titre": "This is the ONLY Software vender that…I recently engaged in",
          "Contenu": "This is the ONLY Software vender that over my past 30 years of PC experience, including building desktop for resale that THEY responded PROMPTLY, less then 4 hours with a solution to an issue I couldn't resolve...I'm an old WIn 3.11 guy where this type of support was not available.   Great Company, Great Support, Right Answers!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William H",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T02:29:44.000Z",
          "Titre": "Customer service and Honesty",
          "Contenu": "The folks at softwarepin.com were there to answer my questions and walk me through every step of the down load to insure I had done it correctly and the software was working properly.Before buying the software they explained why my old version of the software would not load and even had me verify it on line with my own search, while they patiently waited.  They also didn't try and sell me the mist expensive, only just what I needed to do my work.Would highly recommend them to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2023-08-22T05:18:41.000Z",
          "Titre": "The Real Deal",
          "Contenu": "SoftwarePin's discont offers are not a scam or gimmick.  They're legit!  My comapny has purchased four licences for software. Each licence has activated the software without any problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Benson",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T16:04:40.000Z",
          "Titre": "I had purchased MS Office from…Software Pin",
          "Contenu": "I had purchased MS Office from Softwarepin in 2016.  That laptop crashed and I called your support team to see if the software license was only good for that laptop or not. Unfortunately I needed to purchase a new license. The support team was very helpful and I purchase a new license from you. Installation and activation went smoothly. I greatly appreciate good support. Thanks Jeff"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott K",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T21:26:32.000Z",
          "Titre": "easy to find what i need and order it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leena Peters",
          "Nb_Reviews": 3,
          "Date": "2023-07-01T19:47:32.000Z",
          "Titre": "Great experience! Give them a chance. It’s great! …",
          "Contenu": "Everything went well down loading this so 64 bit version after I was able to erase the one I was renting that was 32 bit and there were Spanish and French versions in there that I had a heckuva time erasing I don’t know what the problem was but finally it’s over, and I have downloaded all your stuff and thank you so much. It’s great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CG H",
          "Nb_Reviews": 2,
          "Date": "2023-04-07T21:12:26.000Z",
          "Titre": "SoftwarePin is legit. Everything went smoothly.",
          "Contenu": "Easy to choose what I wanted, which was Office 2016 to install on Windows 11. Their software choices were clearly labeled as to which versions of Windows the software could be downloaded onto. I purchased the one I wanted, using Amazon Pay, and an email arrived within seconds with my product key. I hit a roadblock because I don't have a Microsoft account but SoftwarePin sent me a workaround. At that point I was able to download, install and activate my purchase smoothly and quickly. Very happy with SoftwarePin. They're legit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marjo Hennessey",
          "Nb_Reviews": 2,
          "Date": "2023-05-01T21:23:26.000Z",
          "Titre": "Very pleased purchaser!",
          "Contenu": "I've ordered software from SoftwarePin on two different occasions. Both time I was very pleased with the service. Shortly after placing the orders, I received an email with detailed instructions for downloading. Worked great both times."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul D",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T21:09:29.000Z",
          "Titre": "I was very apprehensive about this…",
          "Contenu": "I was very apprehensive about this purchase because it seemed too good to be true.  I did some research and it seemed to be a legitimate seller with good reviews, so I decided to buy it.  The install and activation was easy and I am able to open and use all of the applications included.  Very happy with this purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laurie",
          "Nb_Reviews": 3,
          "Date": "2023-08-18T01:24:54.000Z",
          "Titre": "SoftwarePin has grea prices!",
          "Contenu": "SoftwarePin has a great price on their products!  And thank you for the discount after my 1st purchase.  Downloading is quick and easy.  I had no problems installing and using the product (Office 365).Thanks SoftwarePin!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Johnson",
          "Nb_Reviews": 2,
          "Date": "2023-10-07T04:12:41.000Z",
          "Titre": "Well Done",
          "Contenu": "Bought a product and it downloaded perfectly. Had a minor issue with product key, but they responded right away and solved the problem, Well done."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "djw",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T01:40:13.000Z",
          "Titre": "I am what you would call computer…",
          "Contenu": "I am what you would call computer challenged.  I had lots of problems installing Microsoft Office but they gave me suggestions and helped me through the computer ordeal.  If I ever need another computer program I will go to SoftwarePin, they are great!!"
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "Carol H",
          "Nb_Reviews": 2,
          "Date": "2023-05-23T15:08:29.000Z",
          "Titre": "Easy, seemless purchase",
          "Contenu": "I waited 3 months before giving a review because sometimes issues arise later. I ordered, I received as promised, I’ve had no problems at all. First class experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Mc",
          "Nb_Reviews": 5,
          "Date": "2023-05-29T19:45:17.000Z",
          "Titre": "I am really happy with this purchase",
          "Contenu": "I am really happy with this purchase of Office 2021.  I was using Windows 11 on a new computer and wasn’t sure how to install it properly. I contacted customer service by email, and they got back to me right away and explained how to install it.  It works fine now!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "uhgrad_",
          "Nb_Reviews": 2,
          "Date": "2023-08-16T18:10:49.000Z",
          "Titre": "Great Deal",
          "Contenu": "Easy software purchase, the activations are smooth and the prices are great.  The single time I had an activation issue I was provided with a new key immediately.  I highly recommend SoftwarePin."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul P. Driscoll",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T17:32:45.000Z",
          "Titre": "Great Company",
          "Contenu": "The transaction was smooth.  Getting assistance because Windows 10 is the second worst OS in the world, was very easy.  The agent who assisted was very knowledgeable.  All in all, SoftwarePin is awesome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-04-22T16:07:06.000Z",
          "Titre": "The process was very easy",
          "Contenu": "The process was very easy.  More importantly they reached out to me checking to see if there were any issues.  When I identified a problem the responded very quickly with clear information that resolved the issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tanner",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T08:00:31.000Z",
          "Titre": "Great experience!",
          "Contenu": "Great experience with this company and their products. Great customer support. Would buy from again for sure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward Knight",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T07:47:04.000Z",
          "Titre": "The download was simple",
          "Contenu": "The download was simple, the instructions were easy to follow, and I had one question that was quickly addressed. It all worked well, and the entire process only took moments. Would definitely look to you for further software needs"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 2,
          "Date": "2023-06-03T20:01:56.000Z",
          "Titre": "My purchase experience was excellent",
          "Contenu": "My purchase experience was excellent.  I must say I had some trepidation at first when ordering.  But, all worked out very well indeed.  I will use SoftwarePin again and would recommend to others"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "terri ernissee",
          "Nb_Reviews": 5,
          "Date": "2023-04-08T16:58:44.000Z",
          "Titre": "PURCHASE AND INSTALL WERE EASY PEASY",
          "Contenu": "I asked an initial question about Office 2021 via chat and the rep was very helpful. Once I purchased, everything worked great. I was so surprised at how easy it was to purchase, download and install my new software. I was also surprised that in updating from 2010 to 2021, every folder and email in my Outlook transferred. What a life saver this was. Thank you SoftwarePin!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T Bern.",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T04:32:18.000Z",
          "Titre": "Great price...All seems to be working…",
          "Contenu": "Great price...All seems to be working fine.   Immediately received the Code via E-Mail along with detailed instructions for downloading and installation.  All Good so far!!  Easy Transaction!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elise",
          "Nb_Reviews": 2,
          "Date": "2023-02-15T03:14:08.000Z",
          "Titre": "This was a great buy and experience",
          "Contenu": "This was a great buy and experience.  The price was better than other \"discounts\" that I came across.  The software was easily downloaded and I haven't had any problems.  I would definitely purchase from Software Pin again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcus Galante",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T16:45:35.000Z",
          "Titre": "Great support service!",
          "Contenu": "I was having allot of trouble with Outlook.  I had bought and paid for it before, once from Microsoft 2010 and then last year by another company at a very cheap price.  I was having problems with it as usual when Microsoft took over the computer and \"fixed\" it.  All they did was ruin all my office programs.  I found you and decided to take a chance.  The download was easy and install perfect.  However, I was still having problems with the bloated and impossible Outlook.  I got a message from support from Jeremiah.  He was excellent.  He spent allot of time taking control of the computer and managed, with difficulty thanks to the ridiculous set up by Microsoft, to fix everything.  He was fantastic and I am grateful for the fine service and the help and time he gave me.  Thanks for making it all work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Louisa Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T20:54:23.000Z",
          "Titre": "The software is exactly what I wanted",
          "Contenu": "The software is exactly what I wanted, and it downloaded quickly.  I did come up to one problem which was the Outlook that was being replaced was from 2003.  Yes, 20 yo software, but it worked great with no unnecessary bells and whistles.  But my server was upgrading so I needed to get a new Outlook.  I looked to see which year was the best, and 2021 was my choice.  When I got to the replacement, an original 2003 install CD was required, and I had it.  I just didn't have a CD player on my laptop.  Short story is that we did find our USB CD player, and the install was happy.  I highly recommend the Office 2021."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Kirk Douglas",
          "Nb_Reviews": 4,
          "Date": "2023-03-09T20:32:24.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "They honored a complaint and managed it immediately (within 24 hours or less) and apologized for their error. I'm impressed. Their product was well priced and \"it was what they said it was\" a rare quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RICARDO PALACIO",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T14:31:50.000Z",
          "Titre": "Excellent service and pricing",
          "Contenu": "Easy transaction. Fast service and competitive pricing pricing was a deal maker for me. I never heard of you before. Now that i do, i will always recommend your site to my inner circle. Bravo!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Lawson",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T08:17:55.000Z",
          "Titre": "I'm always skeptical about deals too good to be true",
          "Contenu": "I am somewhat skeptical when I see a deal that is just too good to be true.  Before I heard of SoftwarePin I had bought a subscription to Microsoft 365 Home.  I hated it.  I cancelled my subscription and started looking for the 2021 version of Office.  That's when I found SoftwarePin.  I bought the 2021 version of Office for my wife's laptop.  The installation went good and everything worked.  Once I was happy with that I bought 2 more copies and a copy for my MacBook.  Everything works great.  I could not be more happy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GV",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T04:34:01.000Z",
          "Titre": "Excellent price",
          "Contenu": "Excellent price. The link to my software was sent immediately. The link directed me to the official Microsoft website and I was able to download the software without any issues. It was a perfect transaction. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adriana Erthal",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T20:21:18.000Z",
          "Titre": "Reliable company",
          "Contenu": "I had a great experience purchasing the Microsoft  Office from this company. I made the payment and not even 3 minutes later I received an email with instructions to download it. Thank you. I recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JG",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T20:22:16.000Z",
          "Titre": "The software was exactly what I needed",
          "Contenu": "The software was exactly what I needed, easy to install and working great. I am trying to avoid a yearly fee to Microsoft, and SoftwarePin provides a great alternative."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ngoc Lam Bui",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T02:33:04.000Z",
          "Titre": "I received the product key and download…",
          "Contenu": "I received the product key and download instructions within a few minutes after a purchase went through. The installation and license key activation was smooth and quick. The license is legitimate and recognized by Microsoft, the price is very reasonable. All of the applications work as intended without any problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J Seid",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T02:19:20.000Z",
          "Titre": "Wonderful service",
          "Contenu": "Thank you so much for your responsiveness. I was unable to fix an installation issue on my own, but your staff was very patient, kind, and effective. I really appreciated the help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Wise",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T21:07:51.000Z",
          "Titre": "They stick with you until it's up and running",
          "Contenu": "I had some issues getting my newly installed Outlook to recognize my email client, so your Customer Service jumped online with me and fixed it on the spot. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom S.",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T20:27:54.000Z",
          "Titre": "Best price for MS Office 2021",
          "Contenu": "The price was much better than any other online store and the purchase process as very easy.  Software downloaded, installed and registered without trouble."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Bodimer",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T02:13:30.000Z",
          "Titre": "Softwarepin delivered exactly what they…",
          "Contenu": "Softwarepin delivered exactly what they promised. I had issues with installation, my fault, but softwarepin walked me through it and I walk away a happy camper"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MJS",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T22:54:09.000Z",
          "Titre": "Easy to buy and install",
          "Contenu": "Easy to buy and install.  Second purchase from SoftwarePin."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BECKY",
          "Nb_Reviews": 2,
          "Date": "2023-06-14T00:07:26.000Z",
          "Titre": "Everything went easy and smooth",
          "Contenu": "Product was easy to order online and to download. When I had trouble activating it the online chat help did remote access and activated it within 5 minutes.  Fantastic!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laurie",
          "Nb_Reviews": 3,
          "Date": "2023-04-25T04:19:19.000Z",
          "Titre": "Office Professional 2021 purchase",
          "Contenu": "Good price and electronic delivery worked great!  Installation worked with just a bit of trouble (it was hard to find where to type in the key number!)  Thanks SoftwarePin!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "butler of indiana",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T20:47:12.000Z",
          "Titre": "the price is right and the software…",
          "Contenu": "the price is right and the software works perfectly even with microsofts limitations.  Now if you could get greedy adobe to cooperate"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T15:55:02.000Z",
          "Titre": "Super easy process",
          "Contenu": "Super easy process, super fast.  I received the download instructions and VALID Product Code in seconds after purchasing. At a fair price too.  Thanks!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KK",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T09:07:44.000Z",
          "Titre": "Excellent Experience",
          "Contenu": "Received the product keys via email promptly after payment.  They provided detailed instructions for retrieving and loading the software.  No issues activating the software using the product keys.  Very satisfying."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 3,
          "Date": "2023-09-07T15:41:06.000Z",
          "Titre": "I needed an office suite",
          "Contenu": "I needed an office suite - the price was affordable - the delivery was fast and everything worked out well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Nakamoto",
          "Nb_Reviews": 3,
          "Date": "2023-05-25T21:32:20.000Z",
          "Titre": "Straightforward",
          "Contenu": "You make it easy to figure out which software package is needed.  It has gotten quite confusing with Microsoft and I appreciate your service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joan Didzbalis",
          "Nb_Reviews": 5,
          "Date": "2023-06-18T20:38:21.000Z",
          "Titre": "A problem solved with professionalism!!",
          "Contenu": "Had a problem and was set up with a chat and a very skillfully, patiently and friendly SoftwarePin customer service rep solved it!!Great communication with the company!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Winter",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T23:57:43.000Z",
          "Titre": "Software download and installation went…",
          "Contenu": "Software download and installation went smoothly without any problems!  Price is great and everything works!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A Ward",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T09:38:44.000Z",
          "Titre": "The instructions for the download of…",
          "Contenu": "The instructions for the download of Office Pro Plus were excellent and works as described. I am well pleased the software and with the easy installation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SV",
          "Nb_Reviews": 3,
          "Date": "2023-04-27T14:40:46.000Z",
          "Titre": "Got an office 2021 professional plus …",
          "Contenu": "Got an office 2021 professional plus  at a fairly decent price and love to see it’s a genuine license. No issues activating them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Masami Sakita",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T07:36:47.000Z",
          "Titre": "I downloaded Microsoft Word 2021",
          "Contenu": "I downloaded Microsoft Word 2021. I had difficulty installing it to my computer. But the person at SoftwarePin helped me, and I could install it to my computer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antonio",
          "Nb_Reviews": 4,
          "Date": "2023-10-01T17:52:44.000Z",
          "Titre": "Buying and downloading Office software…",
          "Contenu": "Buying and downloading Office software has never been so easy.Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Montesi",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T02:43:21.000Z",
          "Titre": "Quick Response to Question",
          "Contenu": "I was actually ok with handling it myself but had one question to make sure I was proceeding properly and they confirmed that I was. The question was answered quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sonny Bowman",
          "Nb_Reviews": 3,
          "Date": "2023-07-24T23:13:20.000Z",
          "Titre": "Great prices & options",
          "Contenu": "Great prices, excellent service. Love the option to be able to transfer the software to a new computer when replacing the computer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Graziano",
          "Nb_Reviews": 2,
          "Date": "2023-05-18T14:50:57.000Z",
          "Titre": "I was so pleased to be able to find a…",
          "Contenu": "I was so pleased to be able to find a version of Office that did not require a subscription.  The price was reasonable and the service/support excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Tankersley",
          "Nb_Reviews": 2,
          "Date": "2023-05-09T18:52:07.000Z",
          "Titre": "I was just glad to be able to find…",
          "Contenu": "I was just glad to be able to find older versions of MS Word and Excel that did not involve the cloud like Office 365 does."
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "Tara Holness",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T17:18:32.000Z",
          "Titre": "5 Star Experience",
          "Contenu": "Hassle free purchase and the install instructions were easy to follow. Once install was complete, Office worked flawlessly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ANTHONE",
          "Nb_Reviews": 2,
          "Date": "2023-06-21T01:47:10.000Z",
          "Titre": "I found the version of Office I need…",
          "Contenu": "I found the version of Office I need for a great price. The process of purchasing and installing was very simple. I will look for Software Pin the next time I need something."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edwin Cruz",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T01:38:32.000Z",
          "Titre": "My shop was quickly",
          "Contenu": "My shop was quickly, I installed the software immediately.   No problem, I will recommend very much your store.   Thank you are the best."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerry from Cary",
          "Nb_Reviews": 3,
          "Date": "2023-02-11T20:29:01.000Z",
          "Titre": "Two thumbs up.",
          "Contenu": "I was skeptical but I went with their Trusted rating. I got what I needed at a very fair price. The order process was easy to follow. I was very satisfied with the results. I would order from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tawny Faber",
          "Nb_Reviews": 2,
          "Date": "2023-05-13T23:16:51.000Z",
          "Titre": "I couldn't get it to download properly",
          "Contenu": "I couldn't get it to download properly.  Chatted with customer service and he got into my laptop and did it!! Very happy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug W",
          "Nb_Reviews": 4,
          "Date": "2023-03-06T18:59:52.000Z",
          "Titre": "Secure",
          "Contenu": "Secure, easy, fast and excellent price.It's where I'm going for software now.Thanks Softwarepin!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles velasquez",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T03:51:15.000Z",
          "Titre": "Download issuesI",
          "Contenu": "I was provided with a number of links that I hope will resolve my issues.  The links have numerous suggestions and I am trying to check them out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Rose",
          "Nb_Reviews": 2,
          "Date": "2023-02-07T22:36:52.000Z",
          "Titre": "Download and install went well",
          "Contenu": "Download and install went well despite my lack of technical expertise. The price was worth it. Highly recommend!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yvonne",
          "Nb_Reviews": 2,
          "Date": "2023-02-20T20:38:54.000Z",
          "Titre": "Thank you for making this a \"no…",
          "Contenu": "Thank you for making this a \"no brainer\" purchase! Clicked, paid, opened the email, downloaded, inserted code and I was off and running! Thanks again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Rose",
          "Nb_Reviews": 2,
          "Date": "2023-08-09T23:06:28.000Z",
          "Titre": "Easy software solutions.",
          "Contenu": "This was one of the easiest purchase, download, and installing of software I have ever done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reginald",
          "Nb_Reviews": 4,
          "Date": "2023-03-07T02:22:12.000Z",
          "Titre": "Processing was so simple to the order",
          "Contenu": "Process was so simple to the order, payment was incredibly easy and the download was a snap couldn’t be more pleased"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Croasdale",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T23:15:02.000Z",
          "Titre": "Mt 10 yr old laptop died and we needed…",
          "Contenu": "Mt 10 yr old laptop died and we needed one for home use. You had the best price through Amazon for the Microsoft Office program and it was perfect for what we needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis Bejarano",
          "Nb_Reviews": 1,
          "Date": "2023-02-05T19:42:11.000Z",
          "Titre": "Nothing but Excellent",
          "Contenu": "I'm an old guy ... not so geeky at all.  I needed lots of help and patience in the download process.  The SP guys were happy to help.  The online chat with Bill was very, very efficient and remedied all my troubles in minutes.Great job ... highly recommended.Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terrance W Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T15:46:16.000Z",
          "Titre": "Good value",
          "Contenu": "Good value. Ease of purchase. Important things are the key was authentic and recognized by MS"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PATRICK McDONALD SR",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T01:30:39.000Z",
          "Titre": "Outstanding Service",
          "Contenu": "Outstanding Service! Quick product delivery. Good instructions for implementing the software were on the point! Thanks! Patrick"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T16:57:13.000Z",
          "Titre": "Used them for years",
          "Contenu": "I have bought almost a hundred copies of office for my organization.  The copies all authenticate,  are delivered quickly, easy to install and the price is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JW",
          "Nb_Reviews": 5,
          "Date": "2023-01-27T06:06:22.000Z",
          "Titre": "Great Option!",
          "Contenu": "Got my program key right away and I'm so glad I didn't have to purchase MS Office 365 every year!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Quinlan",
          "Nb_Reviews": 5,
          "Date": "2023-04-12T12:59:52.000Z",
          "Titre": "Good company",
          "Contenu": "I was able to successfully install and register my purchase without any hitches.  Good company to deal with !"
        },
        {
          "Note": 5,
          "Lieu": "PA",
          "Pseudo": "RB",
          "Nb_Reviews": 2,
          "Date": "2023-05-10T17:31:17.000Z",
          "Titre": "Fast",
          "Contenu": "Fast, efficient.  Extra safety feeling as payment was done through Amazon Pay"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Zurat",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T14:51:31.000Z",
          "Titre": "There directions made downloading the…",
          "Contenu": "There directions made downloading the software simple. I was up and running in no time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Binkerd",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T23:36:59.000Z",
          "Titre": "What a great resource",
          "Contenu": "What a great resource.  Finally, a way to purchase Microsoft software licenses at a reasonable price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory Deitz",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T01:27:16.000Z",
          "Titre": "This was great",
          "Contenu": "This was great. Download went well and it installed without a problem.  I am very pleased and have had no issues.  i would recommend this to everyone and already have."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "First Christian Church",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T18:33:54.000Z",
          "Titre": "everything worked seamlessly",
          "Contenu": "everything worked seamlessly!  Have bought and downloaded 5 in 2 months on work computers.  Had trouble with one, which was my fault, but they helped me fix it over the phone ands were so helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2023-07-23T16:00:44.000Z",
          "Titre": "No problems, everything worked",
          "Contenu": "Easy to order. Got what I needed immediately. Installed easily. No complaints."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Africanus Garga-Richardson",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T16:00:07.000Z",
          "Titre": "Service was very efficient and seamless to follow. I wish I had known about you earlier...."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet Gentry",
          "Nb_Reviews": 2,
          "Date": "2023-03-13T17:19:02.000Z",
          "Titre": "My experience was flawless",
          "Contenu": "My experience was flawless.  I plan to look at SoftwarePin for all my clients software needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trey McFarland",
          "Nb_Reviews": 2,
          "Date": "2023-02-20T20:16:12.000Z",
          "Titre": "Computer issue solved",
          "Contenu": "I had an issue with the new computer I purchased and they helped me get the software installed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Minner",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T22:21:53.000Z",
          "Titre": "Download was simple",
          "Contenu": "Download was simple.  Just follow the easy to understand instruction, and you’re good to go.  Well worth the money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reyes",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T04:31:58.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, great price, with great support that walked me through the whole process—awesome!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug W",
          "Nb_Reviews": 4,
          "Date": "2023-03-01T00:12:00.000Z",
          "Titre": "Software directly from Microsoft",
          "Contenu": "Easy to download directly from Microsoft. Very secure and fast. Thank you SoftwarePin!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Fiksdale",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T16:49:17.000Z",
          "Titre": "It seemed to be hassle free on ordering…",
          "Contenu": "It seemed to be hassle free on ordering the product.I haven't received the product yet but will let you know when I receive the product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GUTCH",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T21:29:00.000Z",
          "Titre": "Online chat was great and were able…",
          "Contenu": "the online chat was great and were able to help me purchase 2019 Viso with no issues  thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antonio",
          "Nb_Reviews": 4,
          "Date": "2023-08-15T12:21:06.000Z",
          "Titre": "Quality products with good pricing",
          "Contenu": "You make it very easy to purchase, download and install the software."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sonny Bowman",
          "Nb_Reviews": 3,
          "Date": "2023-10-11T01:22:38.000Z",
          "Titre": "Great Experience!",
          "Contenu": "Great prices, quick service, and fast/friendly support when needed!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allan D Breedlove",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T03:39:57.000Z",
          "Titre": "Download was easy and programs work no…",
          "Contenu": "Download was easy and programs work no problem.  Would buy again.  Purchase with Amazon account."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "chirathat theerathada",
          "Nb_Reviews": 2,
          "Date": "2023-05-24T16:46:26.000Z",
          "Titre": "very good place",
          "Contenu": "the received item was as described had no problem installing and using the software"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A Wicks",
          "Nb_Reviews": 3,
          "Date": "2023-02-18T00:33:27.000Z",
          "Titre": "Very smooth transaction",
          "Contenu": "Very smooth transaction.  Received software and product keys as promised.  Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Perchalski",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T01:01:29.000Z",
          "Titre": "Easy to order",
          "Contenu": "Easy to order, quick download, installation instructions were clear and concise. And the price was perfect."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Madeleine",
          "Nb_Reviews": 4,
          "Date": "2023-03-15T15:27:49.000Z",
          "Titre": "Very prompt response",
          "Contenu": "Great customer service.  Needed replacement key and they had one to me in a very short amount of time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerald",
          "Nb_Reviews": 2,
          "Date": "2023-03-05T19:35:48.000Z",
          "Titre": "Legitimate product. Working key. Microsoft registered.",
          "Contenu": "The product installed properly and registered on the Microsoft website. Works perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leon McKinzie",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T00:25:30.000Z",
          "Titre": "I am astounded",
          "Contenu": "I am astounded!  Initially, I thought that it was a come on.  I've used the applications and they are genuine."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Veronica Guzman",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T21:54:41.000Z",
          "Titre": "I did not have any issues and was able…",
          "Contenu": "I did not have any issues and was able to install program with no problems. Thank you,Veronica"
        }
      ]
    }
  ]
}