{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "sortly.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T23:20:36.000Z",
          "Titre": "Check what they charge you. Theyll scam you",
          "Contenu": "I signed up for the ultra plan. 1428 a year. Right on the billing date they charged me 2748. They said based on my inputs they voluntarily upgraded me to a custom plan to acommadate future usage based on their projection of my usage. No notification, no warning, no permission. They just charged me. I was below the threshold of my plan by a large margin. Had to fight for my money back. Warning"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T20:42:17.000Z",
          "Titre": "0 Communication/Response",
          "Contenu": "No communication between tickets, as soon as you are sold the program, the responses slow down to a halt. we have open items from several weeks that have had no response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charlie Mattouk, Charlie's Deli, LLC",
          "Nb_Reviews": 2,
          "Date": "2022-02-17T16:32:16.000Z",
          "Titre": "from great to not great.",
          "Contenu": "After shortly redid their dashboard, we lost our ability to count our inventory correctly. Now depending on data exports and imports, there is a lot of things that don't get transferred and it's a total mess. It was great at first, but now it's a total disaster"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T19:10:17.000Z",
          "Titre": "couldnt hate this more",
          "Contenu": "couldnt hate this more. Its impossible for me to get you to cancel my account and stop chargning me  terrible scam m"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2021-02-18T09:18:39.000Z",
          "Titre": "Lost over 50% of my sales data using…",
          "Contenu": "Lost over 50% of my sales data using this app, lost all record for cost price and actual sales of items, foolishly trusted it, unreliable avoid this app"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Denise",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T17:28:31.000Z",
          "Titre": "It does not hold my entire inventory",
          "Contenu": "It does not hold my entire inventory. Help to resolve the problem was not addressed"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2022-03-07T18:31:33.000Z",
          "Titre": "I have sent a few emails asking this…",
          "Contenu": "I have sent a few emails asking this business to stop trying to charge my credit card yet they keep trying!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lynda Gilpin",
          "Nb_Reviews": 2,
          "Date": "2022-02-09T23:57:19.000Z",
          "Titre": "They charged me a ton of money and I…",
          "Contenu": "They charged me a ton of money and I canceled account they did not refund the money.  The software was missing key features"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 3,
          "Date": "2022-09-29T19:30:04.000Z",
          "Titre": "There isn't any support that comes with…",
          "Contenu": "There isn't any support that comes with this i.e. helping you set up preferences etc."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "bert",
          "Nb_Reviews": 1,
          "Date": "2022-03-10T01:41:52.000Z",
          "Titre": "There is little or no guidance once…",
          "Contenu": "There is little or no guidance once it’s purchased on how to use it or what to do with it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Phillip Bosnick",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T03:13:59.000Z",
          "Titre": "There have been 0 QoL updates since i…",
          "Contenu": "There have been 0 QoL updates since i began using this app over a year ago"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gashapon Toys",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T18:43:39.000Z",
          "Titre": "It's just a terrible system",
          "Contenu": "It's just a terrible system. Too many reason to write out."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Osvaldo",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T19:46:32.000Z",
          "Titre": "Need support assistance"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "DAVEY",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T20:09:43.000Z",
          "Titre": "NO XERO INTERGRATION"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 1,
          "Date": "2022-03-08T21:53:48.000Z",
          "Titre": "It's a real problem sending emails and waiting for answers when you have an immediate need",
          "Contenu": "It's a real problem in sending emails back and forth to troubleshoot a ticket, sortly.com needs a chat-box service and an accelerated resolution system for unique cases. We recently subscribed, but today we just got denied using the app. And we scheduled appraisers to come in today to do a physical count and now the app is telling us the credit card has expired, and it has not!!! We started our subscription a week ago and we got charged again today for same monthly subscription."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tom Deno",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T19:43:15.000Z",
          "Titre": "I have been told since summer of 2020…",
          "Contenu": "I have been told since summer of 2020 that Sortly would soon be able to fully integrate with Square and Quickbooks. As of today this still hasn't happened - i keep being told \"a few more months\". It's ridiculous that I am paying over $1500 a year for software that does not integrate with two of the most popular systems used by retailers.  Also the system does not sync in real time, which is a huge problem when more than one employee is using the app"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KSA",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T18:55:54.000Z",
          "Titre": "Disappointing",
          "Contenu": "The app works part of the time, the website works some of the time - sorting, searching, and filtering work when the stars all align - otherwise searching works terribly. There are features that I need to make Sortly work for my specific type of business. I’ve been told that even though I pay for a premium subscription, my business’s specific needs are not something they are willing to address. It’s a great idea in theory, it just needs further development and more reliability to be a great tool."
        },
        {
          "Note": 2,
          "Lieu": "TN",
          "Pseudo": "Fares Belghith",
          "Nb_Reviews": 1,
          "Date": "2022-01-19T17:23:43.000Z",
          "Titre": "Fails to provide the basics",
          "Contenu": "Unfortunately for something as strategic as inventory management too many parts are missing: - Ability to mass upload- Cycle count tracking- Connection to CMS- Tracking of changes and workflow automation / forcing"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrew Short",
          "Nb_Reviews": 2,
          "Date": "2020-04-24T19:53:38.000Z",
          "Titre": "Poorly developed software with not enough real world experience",
          "Contenu": "Poorly developed software... its like they have never organized anything themselves and were sitting around silicon valley dreaming up the next subscription service. Duplicate created if an import fails means you spend more time fixing than doing. Printing is a pain as you want to optimize printing to a sheet, but have to make work around to do this.  Im looking for a phone based barcode scanner and use the software with  our brother printer.... more effective and free.Also rubs me the wrong way to not extend a 50% discount to existing customers. Just basic business. Bye bye"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Patrick McClean",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T19:08:17.000Z",
          "Titre": "Notification alerts are very hit and…",
          "Contenu": "Notification alerts are very hit and miss at best.I would like notifications to be cleared once minimum quantities are reached unlike currently staying on as very confusing"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Susan Fearon",
          "Nb_Reviews": 1,
          "Date": "2019-08-29T12:02:34.000Z",
          "Titre": "Beware...support is horrible and lacks basic features & logic",
          "Contenu": "This program is lacking in a lot of areas.  I seriously have to wonder if the people writing it have ever managed inventory.  There's just no logic to some of it.  On the surface, it's great and easy to use, but behind the scenes in terms of true functionality and management, it's frustrating.  My biggest complaint though is the lack of support.  You have to send an email and then wait for an answer which is usually more questions because they never understand your question.  If they understood inventory, they would understand the question.  I truly don't think it's worth the headache."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rebecca",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T13:55:39.000Z",
          "Titre": "Reports need a HUGE upgrade!",
          "Contenu": "The reports do not offer an easy way to track our inventory movement.  I wish the reports were able to be better customized by each field.  I wish you could customize the report to run on the specific activity type instead of the general topic.  I have the Ultra plan and we are only allowed to save 3 custom reports?!  Very disappointed in the reporting system."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Garan Keeler",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T21:02:47.000Z",
          "Titre": "Product has big holes in core…",
          "Contenu": "Product has big holes in core functionality.  Items can be moved between different locations / folders, but a change to an item in one folder (like a price or description update) doesn't affect the same item in other folders.  So updating items properties is horrific.  Otherwise its an easy way to count items if you don't want to use Google Sheets."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "mauro",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T20:46:03.000Z",
          "Titre": "The application is great but to…",
          "Contenu": "The application is great but to expensive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stanb",
          "Nb_Reviews": 2,
          "Date": "2022-08-24T05:55:23.000Z",
          "Titre": "The software is clunky",
          "Contenu": "Whether using the app on an Apple device or a laptop/computer, the options should be the same, and they are not.  \"Checked\" is one example.   Secondly, the \"Checked\" functionality does not work on Apple devices.   When items are \"checked\" sometime the status is correctly displayed, other times it is not.Third, the backup function is woefully inadequate.   The developers should make this their top priority."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Jarvis Robins",
          "Nb_Reviews": 1,
          "Date": "2022-03-22T03:57:27.000Z",
          "Titre": "Program works well",
          "Contenu": "Program works well Not very suited for small business as the packages only allows for a few users and jumps highly on priceWe have multiple vans to stocktake and the users on use the program a few times a month and the higher packages are unaffordable for small business"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Justin Orazio",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T19:38:11.000Z",
          "Titre": "They do not offer the option for load lists",
          "Contenu": "They do not offer the option for load lists, which most construction companies need. When I reached out to them they were very kind but made it clear they do not offer a load list option nor will they in the future. Even though we were paying for the highest tier they said they could not build it out or offer the option to us. We are leaving Sortly because of this."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Daniel Urdaneta",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T21:10:23.000Z",
          "Titre": "Sortly works fine but is slow",
          "Contenu": "Sortly works fine, the only problem we found is that on many occasions the pages load very slowly. When we do a search, for example, we have to wait a long time in seconds before it shows the results. And the same goes for other system options. If the developers could improve the loading speed, Sortly would be great!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephanie Shadwick",
          "Nb_Reviews": 1,
          "Date": "2022-02-16T02:30:53.000Z",
          "Titre": "Need more lable size options",
          "Contenu": "I'm very happy with Shortly, we primarily use it for our business. The only issue I have is the limitation of lable sizes. I'd prefer there be 4x6 as I use those on my personal containers."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2022-03-12T11:45:10.000Z",
          "Titre": "Great App but needs Few additional features.",
          "Contenu": "It’s easy simple to use. One feature that I would like to see if the product price to be available to high level or management level user. At the moment price is visible to all groups. It will also good to see intervention with MYOB or Zero for mid range user."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "jeff",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T21:52:26.000Z",
          "Titre": "Getting too expensive",
          "Contenu": "It’s a great app, but I’m starting to feel like they are trying to get every penny out of me.I’ve been with them for years and the price is just keep going up.Eventually, I will be looking for a new app"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Vern",
          "Nb_Reviews": 1,
          "Date": "2018-08-31T17:21:44.000Z",
          "Titre": "So so",
          "Contenu": "I would say it’s average. The app generates duplicate items and the counts are not accurate across multiple devices. Support is not overly helpful."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Rhoda Gifts",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T22:36:45.000Z",
          "Titre": "IT IS A GREAT APP",
          "Contenu": "IT IS A GREAT APP. HOWEVER, WISH IT HAD THE OPTION FOR MULTIPLE CURRENCIES WHEN BUSINESSES ARE OPERATING IN DIFFERENT COUNTRIES - FOR STOCK PRICING."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "K Y",
          "Nb_Reviews": 1,
          "Date": "2022-01-24T22:20:07.000Z",
          "Titre": "Sortly does a fine job for how the…",
          "Contenu": "Sortly does a fine job for how the program is set up. It would be nice if there was a way to track purchasing, and usage of items."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kathy Lynn Perez",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T18:56:07.000Z",
          "Titre": "Need to be able to do barcordes on…",
          "Contenu": "Need to be able to do barcordes on smaller tags.  Is that possible?"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Brock",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T11:57:10.000Z",
          "Titre": "It is really good",
          "Contenu": "It is really good, we use it as a small Not For Profit organisation to track and manage uniforms & equipment for our youth group. The only issue is we can't add more users to the account, we are a volunteer organisation and job share, but can't afford the higher level licenses. We have had to share an account which is not ideal. That considered provided the price point we are very happy with the product."
        },
        {
          "Note": 4,
          "Lieu": "VU",
          "Pseudo": "AHC",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T23:46:14.000Z",
          "Titre": "Why sortly is perfect for any type of business",
          "Contenu": "Sortly provides a much easier way to keep track of all items under your control. It provides a much easier way to track because of the user-friendly interface which is pictures plus information. Pictures makes it easier to identify and specify items which is an improvement to inventory management."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T20:40:01.000Z",
          "Titre": "Great program with few downsides",
          "Contenu": "The software/ website is really solid. The customer service is also amazing. The only down side it on the accounting side. We use it for tracking a large amount of SKU's. The program tracks all of the movement with custom UPC's. You can also link other upc's to the items as well."
        },
        {
          "Note": 4,
          "Lieu": "HU",
          "Pseudo": "TTT",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T21:51:46.000Z",
          "Titre": "The app is excellent",
          "Contenu": "The app is excellent, I use it for private purpose to have it always handy what are my stocks from detergents etc. I would appreciate a scalable plan. I could pay a few dollars for the app to lift the 100 item limit. This is the only limitation in the free version I really face. However, plans are only available targetting business use cases: way too expensive for private usage."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "N. Jensen",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T18:39:18.000Z",
          "Titre": "The app is great and so much easier to…",
          "Contenu": "The app is great and so much easier to use than other inventory control apps I've tried. But I think the price is too high for small businesses that don't have a high sales volume. My manufacturing business has lots of parts to keep track of but isn't high volume sales. I can't justify the price, so will continue to use the free version until I can find something that works for my business."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RODOLFO",
          "Nb_Reviews": 1,
          "Date": "2018-08-29T19:17:43.000Z",
          "Titre": "Great but need a few more features.",
          "Contenu": "Over all its simple to use. It should work equally as well on laptop with the same features but its work in progress at this point i hear. Still learning How to use it but the label creating process should allow you to personalize for your business by allowing you to add your logo instead of the basic shapes. Also when taking inventory it should allow you to subtract what wasn't scanned at location to see the difference in inventory and charge that amount. like it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Barrett",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T18:34:09.000Z",
          "Titre": "Non-Profit Managing Pet Food for Distribution",
          "Contenu": "Sortly has been a great find. What I hadn't foreseen was how many brands and types of dog and cat food there are. Populating the database is ongoing.I use Sortly to help me both have an idea of inventory and to measure outgoing donations of food. My biggest complaint is that tracking pet food type and volume is a help, but including value of items in a report would be especially helpful."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Kath",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T09:30:23.000Z",
          "Titre": "Great support",
          "Contenu": "Great support, when asking specifics about my account."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ross Troiano",
          "Nb_Reviews": 2,
          "Date": "2022-01-18T18:45:44.000Z",
          "Titre": "We have been using Sortly for a few…",
          "Contenu": "We have been using Sortly for a few years now and been overall happy with the program. I do get complaints from some of our people who do not use it as often. They end up searching for things and can not find them, it is usually because of the search choices that Sortly gives a person that can sometimes confuse a person."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tara Nabors",
          "Nb_Reviews": 1,
          "Date": "2022-02-16T15:22:18.000Z",
          "Titre": "Convenient documentation",
          "Contenu": "A convenient way to document and keep track of inventory.  The ability to use the mobile app is fantastic when you're constantly moving around.  The only thing that would make it perfect for me is the ability to document the history of an item."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Nemeth",
          "Nb_Reviews": 1,
          "Date": "2022-01-19T15:19:27.000Z",
          "Titre": "Love it the system...not the pricing",
          "Contenu": "Love the system, but I don't like the pricing plans. They are so limiting, that I would consider another option. I don't mind paying a la carte for licenses above and beyond my plan, but if I go above 9 licenses I take a large, large jump in pricing to \"enterprise\". That seems like a joke. It really limits what I can do and how I can use it for my business. Seems like your pricing plan hasn't evolved as your platform has grown. For example, my scheduling/timecard company just has a flat, pay per user fee (Deputy - look them up). No questions from me on their pricing and it lets me decide what is right for my business. Feel free to contact me for more, I'd like to discuss this."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MEND",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T18:35:28.000Z",
          "Titre": "One thing keeping it from 5 stars.",
          "Contenu": "Sortly works great for keeping track of our inventory.  One aspect I wish were available is the ability to hide items in reports when the quantity is 0. When we sent out reports to our clients, we only want them to see what we have in stock, and not what items are NOT available."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 8,
          "Date": "2022-02-15T19:18:55.000Z",
          "Titre": "The program works pretty good for us",
          "Contenu": "The program works pretty good for us it would be better for us if there were some slightly different features. We are a manufacturer and we have to use the program almost in reverse of what is designed for we have adapted and have overcome."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary Ellen Pearcy",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T15:05:06.000Z",
          "Titre": "Sortly is a good system for my small at…",
          "Contenu": "Sortly is a good system for my small at home business.  I like the simplicity of it.  My areas of concern are reporting.  It seams that there is significant lag time for data to hit reporting."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Paddy",
          "Nb_Reviews": 1,
          "Date": "2022-06-30T01:50:28.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, easy to sort & upload, great tool for Logistics, with a few mods could be used for transport CCC compliance."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gina",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T03:50:54.000Z",
          "Titre": "It is easy to use",
          "Contenu": "XXXXXYYYYY"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "EAW Security",
          "Nb_Reviews": 1,
          "Date": "2022-01-20T15:49:35.000Z",
          "Titre": "Sortly for Inventory",
          "Contenu": "Sortly works great for keeping track of Inventory.  Scans barcodes."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "miguel",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T21:06:07.000Z",
          "Titre": "great but can be better",
          "Contenu": "Everything's its great but its missing more users restrictions."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Theodore Dobrer",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T18:33:43.000Z",
          "Titre": "System is easy to work with",
          "Contenu": "System is easy to work with. Sometimes it is crushing, but it takes a second to go back"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen Loza",
          "Nb_Reviews": 1,
          "Date": "2022-02-16T15:20:16.000Z",
          "Titre": "I wish the app had a spot for “sold…",
          "Contenu": "I wish the app had a spot for “sold price” so it can add up your profit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T01:19:25.000Z",
          "Titre": "Really Awesome!",
          "Contenu": "I love using Sortly - it has helped me organize my small warehouse quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hayden",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T22:38:20.000Z",
          "Titre": "Attentive Staff",
          "Contenu": "We have been using Sortly as the inventory management solution for one of our departments for over a year now and the biggest stand-out to us has been the willingness and attentiveness of the Sortly team. Always able to meet when needed and they come prepared with answers or the people with the answers!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christine",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T18:08:50.000Z",
          "Titre": "Easy!",
          "Contenu": "I love Sortly for our inventory. Easy to use and I can keep track of all our supplies. Just overall a great app. I just wish that the price for adding users would be less. We have 8 techs and we would love for all of them to have access but the price is keeping us from doing that!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Jeroen",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T09:16:30.000Z",
          "Titre": "Sortly to manage our museum objects",
          "Contenu": "We use Sortly to manage our museum objects inventory. Next to the use of barcode, we can add foto's of an object to the registration and search full text on barcodes and description. Better still, Sortie works on your regular smartphone. It works very well. Of course, there are some things left to be desired but isn't there always?"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "KLMPR",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T03:27:50.000Z",
          "Titre": "Making the Inventory more Systematic",
          "Contenu": "It helps us to organise our inventory to be more systemic and easily accessible when and as required. We dont have to go through the hassle of checking it manually on a spreadsheet or physically that could save time and human resource."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Eduard Felder",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T18:44:02.000Z",
          "Titre": "Excellent product",
          "Contenu": "Excellent product. Very cleanly structured, has all the features needed for managing (most conveniently by mobile phone) inventories of all kinds. Very useful also for a private, non professional context (household and hobbies). A bit expensive if only used privately. I wish non commercial  users in private households would get a discounted rate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2018-09-26T21:49:25.000Z",
          "Titre": "Three months in, and it's been a great success!",
          "Contenu": "Sortly Pro has made a great impact on our company! We can work more efficiently, communicate more clearly, and make smarter decisions that impact our bottom line. It is easy to learn, easy to use, and their customer service team responded quickly to all of our questions and addressed them. This product continues to get better through numerous updates and improvements. Three months in, we have no complaints. Thank you Sortly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Van Deusen",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T18:33:46.000Z",
          "Titre": "Save me money, time and aggravation.",
          "Contenu": "Awesome program. I run an insurance restoration company and we keep about $30,000 in supplies on average. This helps us manage order and protect our inventory. We use three people to manage this process, and I think it saves me about 20% of the value each year that we are using it. Now I can hold people accountable for an accurate inventory and correct them on miss orders that they make or items that we run out of – even though that seems to be more about a Brandon problem than anything else today."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2022-02-07T18:41:01.000Z",
          "Titre": "Sortly ...good and getting better",
          "Contenu": "Sortly has mostly met our needs and has continued to grow their product, steadily improving all the time. Their customer support has been great, too. Things I look for: 1) solid app that does what I need it to, 2) great customer support, and 3) don't sit on your laurels - continue to develop the product in response to customer needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kris",
          "Nb_Reviews": 3,
          "Date": "2022-02-15T18:35:09.000Z",
          "Titre": "My experience with the company has been…",
          "Contenu": "My experience with the company has been great!  The Sortly program is used to manage our staging inventory for a small real estate office.  It is easy to use and we bar code some of our items with a small printer and use our phones to track things.  Also works well to see items that are at properties to anticipate when they will be available for next use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 1,
          "Date": "2022-02-21T18:46:11.000Z",
          "Titre": "This app is exactly what I was looking…",
          "Contenu": "This app is exactly what I was looking for and more. I'm organizing our entire home for the purpose of eventually moving out of state, and am packing things up as I go. Several times now I've needed something that I already packed. All I had to do was type it into the app and was told exactly what box I had the needed item in. Very impressive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2018-09-02T16:07:47.000Z",
          "Titre": "Love this app for our home staging…",
          "Contenu": "Love this app for our home staging company. Extremely helpful for keeping track of inventory and planning our next jobs. Only slight complaint was that I couldn’t move folders around manually - but that’s been updated! Woohoo"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2018-08-29T15:10:32.000Z",
          "Titre": "Love Sortly Pro and their staff",
          "Contenu": "Love Sortly Pro and their staff! Nothing but positive experiences and very user friendly. We’re a small business and this app has everything we need to keep track of our inventory and tools. Plus they keep adding great features and actually value customer feedback which is rare these days. Keep up the great work!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Connor",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T18:36:56.000Z",
          "Titre": "Fantastic Asset",
          "Contenu": "Sortly has been a great boon to our little business.  Now I can keep track of what my employees use and I'm not over or under ordering new stock."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Greg J",
          "Nb_Reviews": 1,
          "Date": "2022-01-19T13:00:03.000Z",
          "Titre": "Well-designed handy asset management tool for my household",
          "Contenu": "I use Sortly to manage belongings of our family sprawling mysteriously across our regular residence, summer house, attic, cellar, garage, storage, ... It works very well for me so far and is spared a lot of frustration and time. I am not a great fan of Sortly asking me about the amount of stuff to move between locations as I typically have just one thing of each kind and I would gladly switch this feature off, but maybe I don't care enough to look how to set it up right. In any case the value I am getting outweights any friction (and generally the app has very solid usability) and I am using Sortly on a regular basis."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Balloons Unlimited",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T22:33:55.000Z",
          "Titre": "SORTLY has added hours and confidence…",
          "Contenu": "SORTLY has added hours and confidence to my life!  As a sole proprietor with an overwhelming amount of inventory, that comes and goes in the blink of an eye, I needed a system that could keep up!!  SORTLY excells at keeping it all organized!!I am VERY HAPPY with it!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Jacinta",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T01:25:31.000Z",
          "Titre": "Wonderful Product",
          "Contenu": "This is a very easy to use platform and has made keeping track of our consumables very easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Esther (nonprofit organization)",
          "Nb_Reviews": 1,
          "Date": "2018-08-31T21:36:55.000Z",
          "Titre": "The BEST money we've spent..",
          "Contenu": "Sortly Pro made our office move so much easier! I honestly don't know what I would've done without it! There were so many moving pieces to track such as: current assets, what was being donated, brought along, or sold. Not to mention the tracking of new inventory and making sure everything was received and in its location. Our situation was unique but even after the move we will continue to use Sortly to log and track our assets and inventory, its so convenient and user friendly. There is no other app or service out there that gives you so much for the small price of $30 a month.  We cannot recommend Sortly enough! I tell everyone I know about them!"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Aida",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T22:18:09.000Z",
          "Titre": "Sortly is the best inventory software…",
          "Contenu": "Sortly is the best inventory software any business can have to keep track of items, arrivals, restocking and consumed items.I’m very satisfied and it is worth the investment. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-30T21:11:10.000Z",
          "Titre": "Brilliant inventory app",
          "Contenu": "Brilliant inventory app. Easy to use. Reasonably priced and customer service response time is tip top 👍would highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Derrick",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T20:56:04.000Z",
          "Titre": "Sortly is so user friendly and intuitive",
          "Contenu": "Sortly is so user friendly and intuitive that I was able to streamline our entire warehouse operation in just a few short weeks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan B.",
          "Nb_Reviews": 3,
          "Date": "2022-01-18T18:32:01.000Z",
          "Titre": "Very good tool",
          "Contenu": "Very good tool. Easy to use. Reliable. I use to manage eBay inventories. Access on the phone or the computer. I actually like the phone app more than the web but from the web you can generate very nice reports."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shannon",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T18:58:38.000Z",
          "Titre": "The photos view and ability to organize…",
          "Contenu": "The photos view and ability to organize data any way you want is amazing. Very user friendly and organized."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kris",
          "Nb_Reviews": 2,
          "Date": "2022-01-18T19:22:00.000Z",
          "Titre": "Sortly Inventory App: Simply Best of the Bunch!!!",
          "Contenu": "As an Executor of a large Estate, I have successfully  used the Sortly Inventory Management App now for over 2 years. Sortly by far was the easiest to use inventory management system of the number of ones I originally tested out. In my early days, I greatly welcomed and appreciated the help of the Sortly App support team. The App is extremely easy to operate by the Owner/Manager/Executor and his Staff. It was also very easy to add or remove my “clients or customers” and change “access permission levels” whenever, as required.  The Photo based inventory with many additional descriptions, etc. was simply perfect for a diverse group of beneficiaries with widely varying tech skills. Most importantly, as “Owner”, I found the App to be remarkably stable and robust. I have never had even one instance of of “downtime or instability” even with dozens of persons in various global locations working with the Sortly App platform. I highly recommend Sortly, in every respect. I confirm I have absolutely no affiliation in any respect with Sortly. I am simply a satisfied, grateful, happy customer. Sortly is simply The Best of the Bunch!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Balalaka",
          "Nb_Reviews": 1,
          "Date": "2022-02-10T13:09:29.000Z",
          "Titre": "Nice app very helpful for easy…",
          "Contenu": "Nice app very helpful for easy inventory management with pictures and quick entry wherever you located in the room or any tight spaces"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Alessi",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T18:32:16.000Z",
          "Titre": "Does Exactly what I need it to do!",
          "Contenu": "I love the Sortly system. We're a small business and it has just the right amount of functionality and is really accessible right out of the box. Intuitive and easy and simple."
        },
        {
          "Note": 5,
          "Lieu": "LV",
          "Pseudo": "Krists Versels",
          "Nb_Reviews": 1,
          "Date": "2022-02-16T06:14:58.000Z",
          "Titre": "Overall very good app for our business",
          "Contenu": "Overall very good app for our business. Great support from developers. Desktop app could be improved, for some reason it seams to work quite a bit slower than mobile app."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chad",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T20:35:59.000Z",
          "Titre": "Works how advertised and does what i…",
          "Contenu": "Works how advertised and does what i need it to do.Software is easy to navigate and easier to use."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2022-05-27T02:15:48.000Z",
          "Titre": "Exceptional customer service",
          "Contenu": "Exceptional customer service. We had to cancel our subscription yet the support we received was highly professional and very prompt. Kudos to the team at Sortly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T20:28:06.000Z",
          "Titre": "Perfect for mid-sized business",
          "Contenu": "I've had the privilege of helping implement Sortly at a mid-sized Manufacturing business.  Our goal was to gain real-time visibility to our inventory and provide an easy, intuitive user experience for our stock room employees here.  Sortly has lived up to both of our expectations- providing excellent real-time information on our inventory, while being easy to implement and to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2018-08-29T17:13:50.000Z",
          "Titre": "This is a great and simple app",
          "Contenu": "This is a great and simple app. Would highly recommend. I’m hoping they add some better features to their labels. Otherwise it’s awesome!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerald",
          "Nb_Reviews": 1,
          "Date": "2018-08-29T18:15:21.000Z",
          "Titre": "A fantastic simple program for managing…",
          "Contenu": "A fantastic simple program for managing your inventory that is independent of other systems so you know it is accurate.  The only mistakes I have found were obvious human error, never with the system and for the price point, incredible value!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Essert",
          "Nb_Reviews": 3,
          "Date": "2022-02-15T19:19:52.000Z",
          "Titre": "big help for our team",
          "Contenu": "Sortly has been a big help in controlling my inventory, and makes it easy across my team and cell phone and CPU."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LAURIS CADY",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T21:22:14.000Z",
          "Titre": "We love this software",
          "Contenu": "We love this software, it does exactly what we need it to do and all in real time. Easy to use and available to staff, clients, colleagues."
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Mohan",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T03:56:44.000Z",
          "Titre": "Absolutely happy and satisfied using Sortly",
          "Contenu": "So far very happy using Sortly. Thank you very much team Sortly for the great app and excellent support ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "McGinley Services",
          "Nb_Reviews": 2,
          "Date": "2022-02-10T02:34:23.000Z",
          "Titre": "Using this for my smaller HVAC…",
          "Contenu": "Using this for my smaller HVAC business. It's 2022 use inventory software that reflects that."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Bruce",
          "Nb_Reviews": 5,
          "Date": "2022-01-18T20:39:27.000Z",
          "Titre": "Great product",
          "Contenu": "Great product! very easy to use would recommend for anyone who needs to organise there stuff."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Grant Phillips",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T21:54:16.000Z",
          "Titre": "The Sortly App makes stock control easy.",
          "Contenu": "The Sortly App makes it easy to manage my small warehouse stock without integrating my stock control into my accounting software."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T20:53:19.000Z",
          "Titre": "Cigar inventory",
          "Contenu": "I just use it to keep inventory of my cigars in four humidors. Works great! Love the fact I can link up QR codes for fast scanning."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Greg Pritchard",
          "Nb_Reviews": 2,
          "Date": "2022-01-18T23:07:46.000Z",
          "Titre": "This is a simple program that is easy…",
          "Contenu": "This is a simple program that is easy to use that lets my business work effectively."
        },
        {
          "Note": 5,
          "Lieu": "LT",
          "Pseudo": "Lina Smirnovienė",
          "Nb_Reviews": 1,
          "Date": "2022-02-17T07:13:03.000Z",
          "Titre": "Very useful and handy app",
          "Contenu": "Very useful and handy app. Simple management, lots of sorting options."
        },
        {
          "Note": 5,
          "Lieu": "GI",
          "Pseudo": "Bruce",
          "Nb_Reviews": 1,
          "Date": "2022-02-07T18:32:41.000Z",
          "Titre": "Quick and very effective service when…",
          "Contenu": "Quick and very effective service when having any type of issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cassandra",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T20:07:26.000Z",
          "Titre": "What's not to like...",
          "Contenu": "Sortly is a great inventory system. Complete organization at your finger tips & user-friendly!"
        },
        {
          "Note": 5,
          "Lieu": "PS",
          "Pseudo": "jad",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T18:17:18.000Z",
          "Titre": "Been looking for a platform like this",
          "Contenu": "Been looking for a platform like this. Very awesome and easy to useThank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis Orbegoso",
          "Nb_Reviews": 6,
          "Date": "2023-08-16T18:57:35.000Z",
          "Titre": "THE ABILITY TO KNOW THE QUANTITY AND…",
          "Contenu": "THE ABILITY TO KNOW THE QUANTITY AND LOCATIONS"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Matt Digby",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T18:31:57.000Z",
          "Titre": "Lovely people",
          "Contenu": "Lovely people, fantastic service. Helped me out of a predicament."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gustavo Carrillo",
          "Nb_Reviews": 1,
          "Date": "2022-01-19T14:37:14.000Z",
          "Titre": "Very affordable and powerful solution…",
          "Contenu": "Very affordable and powerful solution to organize and keep track of product, tools, materials, etc."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Dallmann",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T18:46:56.000Z",
          "Titre": "Love the service needs a few more…",
          "Contenu": "Love the service needs a few more features but over all great product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michele",
          "Nb_Reviews": 1,
          "Date": "2022-03-07T19:50:10.000Z",
          "Titre": "Thank you for the great customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kylene Nester",
          "Nb_Reviews": 4,
          "Date": "2022-01-18T19:36:28.000Z",
          "Titre": "I love this app",
          "Contenu": "I love this app.  I keep a small shirt inventory on my phone and it is sooo easy to use."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Sebastian Ramondetta",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T20:58:46.000Z",
          "Titre": "Excellent inventory tool",
          "Contenu": "Excellent inventory tool, very easy to use"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T05:43:10.000Z",
          "Titre": "Ease of site use and helpful tutorials!",
          "Contenu": "Ease of site use and clear tutorials!"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "CureMD",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T20:28:26.000Z",
          "Titre": "Very Good Software",
          "Contenu": "Very Good Software, Easy to Use, User Friendly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gianni Fasano",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T18:32:54.000Z",
          "Titre": "Great app to keep your work organized"
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Hans Peter",
          "Nb_Reviews": 2,
          "Date": "2018-08-29T15:00:58.000Z",
          "Titre": "It works great and is getting even…",
          "Contenu": "It works great and is getting even better"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Hester",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T18:35:17.000Z",
          "Titre": "Great customer support",
          "Contenu": "Great customer support.  Always willing to help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2022-03-24T20:50:17.000Z",
          "Titre": "Awesome software helping me streamline…",
          "Contenu": "Awesome software helping me streamline our business"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Seema",
          "Nb_Reviews": 1,
          "Date": "2018-08-29T16:35:09.000Z",
          "Titre": "Best enterprise inventory app for small…",
          "Contenu": "Best enterprise inventory app for small business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rita Belenitsky",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T20:42:20.000Z",
          "Titre": "Really great inventory application",
          "Contenu": "Really great inventory application. Easy to navigate with great technical support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Doll",
          "Nb_Reviews": 1,
          "Date": "2022-01-25T16:28:08.000Z",
          "Titre": "Great simple program that works great",
          "Contenu": "Great simple program that works great. Like any software, it takes time to input all of your information but when that is over, it works great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas N. Dooley",
          "Nb_Reviews": 2,
          "Date": "2022-02-28T20:52:40.000Z",
          "Titre": "Everything is going great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Z-Bolt Lasers",
          "Nb_Reviews": 3,
          "Date": "2022-11-18T18:18:36.000Z",
          "Titre": "Outstanding Service - Top Notch!",
          "Contenu": "Outstanding service, thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Havin",
          "Nb_Reviews": 1,
          "Date": "2022-02-07T18:42:18.000Z",
          "Titre": "We use it everyday!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T04:08:48.000Z",
          "Titre": "Great software and customer service!"
        },
        {
          "Note": 5,
          "Lieu": "GT",
          "Pseudo": "Maria",
          "Nb_Reviews": 1,
          "Date": "2018-08-29T20:56:53.000Z",
          "Titre": "The app has helped me a lot",
          "Contenu": "The app has helped me a lot. Happy with it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T21:20:22.000Z",
          "Titre": "Great Product",
          "Contenu": "Very easy to use"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T19:37:38.000Z",
          "Titre": "Very useful inventory software!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Philip",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T20:36:23.000Z",
          "Titre": "Its great......"
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Raiad Elfellani",
          "Nb_Reviews": 2,
          "Date": "2022-01-18T18:59:44.000Z",
          "Titre": "Very impressive software."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "PARTHIBAN SAMARA Transport ACC",
          "Nb_Reviews": 1,
          "Date": "2022-02-21T02:45:39.000Z",
          "Titre": "Happy to use sorty."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sally-Ann Farrington",
          "Nb_Reviews": 1,
          "Date": "2022-01-19T15:55:10.000Z",
          "Titre": "Very user friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Brittain",
          "Nb_Reviews": 2,
          "Date": "2022-02-15T19:19:18.000Z",
          "Titre": "How To Get Me Organized",
          "Contenu": "Great app. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Anthony Berry",
          "Nb_Reviews": 2,
          "Date": "2022-02-16T08:59:04.000Z",
          "Titre": "Great Service",
          "Contenu": "Great product"
        },
        {
          "Note": 5,
          "Lieu": "AR",
          "Pseudo": "andrea c",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T19:09:42.000Z",
          "Titre": "Practicity!!"
        }
      ]
    }
  ]
}