{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "spaceship.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Asif Ali",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T16:50:07.000Z",
          "Titre": "Worst Support Suspended without Any Advance Notic",
          "Contenu": "Worst Customer Support. They Suspended my domain without any advance notice. Now they are not replying it's been 48+ hours. I contacted them multiple times on live chat they are saying we don't answer your query. contact through email. But they not replying. My Website is ranking drop on Google. Which made a loss of 15k visitors monthly."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Faouzi",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T13:32:04.000Z",
          "Titre": "I have been transferring the domain…",
          "Contenu": "I have been transferring the domain name for a week, to the host O2switch, until today,the host told me that they did not receive anything?I don't understand where the exact problem is"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Balaji kendre",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T05:39:34.000Z",
          "Titre": "It is biggest fraud company they have…",
          "Contenu": "It is biggest fraud company they have banned my domain under 10 days of purchase and I haven't done any illegal activity or any crime that they should suspend my domain they just suspend my domain without asking me and now telling we will not unsuspend your domain or refund my hard earned money? Can any body help me to get my domain back?Before suspend my domain it's your responsibility to notify me and tell me that something is wrong there and then also if I didn't delete that content you should suspend my domainWill you activate my domain or not?"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Digi Zeption",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T15:29:27.000Z",
          "Titre": "My all domains they cancelled i will…",
          "Contenu": "My all domains they cancelled i will ban this website in india by complaining indian goverment"
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Shaheer",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T21:25:37.000Z",
          "Titre": "Pathetic Complex Platform",
          "Contenu": "Pathetic Platform. Extremely complex platform. Doesn't have simple options for basic tasks. Online customer support is also very unhelpful. I would advice people to to avoid falling in trap of Spaceship because it will be a total loss of time and money!"
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "sohaib",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T18:08:39.000Z",
          "Titre": "WORD PRESS ERROR",
          "Contenu": "WORD PRESS IS NOT INSTALLING CORRECTLY. THE SUPPORT TEAM AND I TRIED A LOT TO FIX IT BUT ALL IN VAIN"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Arpit Jeswal",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T22:17:23.000Z",
          "Titre": "Cheating with customers",
          "Contenu": "Cheating with customers.Automatic account locked without notice. All my domains were canceled but i didn't receive the refund. After talking to them they unlocked the account but i can't use promo codes. They told me to buy at full price.Big cheating with customers. Beware before using spaceship."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Niraj Shivastava",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T15:11:09.000Z",
          "Titre": "Fake And False Promotions Spaceship",
          "Contenu": "Your account is locked, please contact customer supportfirst account open showing issueWe need a complete list of Spaceship accounts that were created and managed by you personally, your business partners, created by you for anybody else or accounts where your payment methods were used.?? I am new already told you @Marina Zh"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Ankit kumar",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T00:02:20.000Z",
          "Titre": "Scam website",
          "Contenu": "I just got scammed by spaceship. I and my brother both opened the account and used promo code to buy domain as we both were new user.They cancelled all our domains without refunding the money and after talks with review team they told us to buy domain at full price.Doing scam with people in the name of low offering prices."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Adam",
          "Nb_Reviews": 4,
          "Date": "2023-10-21T14:26:28.000Z",
          "Titre": "This company is a joke",
          "Contenu": "This company is a joke. Been locked out of my account for days due to a 2FA error on their end and the best they can do is tell me they're \"looking into it\". No details, timeline, alternative options, nothing. Do not waste your time or money. Absolute laughing stock."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sameer shahi",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T14:12:47.000Z",
          "Titre": "Took my money and closed my account…",
          "Contenu": "Took my money and closed my account immediately after payment and did not provide me refund. Literally scammed me. My account was flagged as fraud by their useless automated system even my account had any activity. I just loaded funds and haven't even started using the services/"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "- O G G Y -",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T14:33:14.000Z",
          "Titre": "i bought a domain few days ago img.pro…",
          "Contenu": "i bought a domain few days ago img.pro and said it was $2 and i added it in cart and after 10-15 min it shows $2000 instead so i tried to proceed my payment with the domain in cart with $2 and it failed idk what was the reason but i think it was fake marketing to show cheap domain and then fail the payment as technical issuecannot post images/links here otherwise i would i send the screenshots too"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Micah",
          "Nb_Reviews": 2,
          "Date": "2023-08-17T16:30:02.000Z",
          "Titre": "Do not buy anything from this company.",
          "Contenu": "After you buy a domain name they block your account so you can't access the domain that you PAID FOR. Then if you try to get your account unblocked, they make you jump through hoops trying to resolve an issue that you shouldn't have to deal with in the first place."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Srikanta Das",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T10:48:40.000Z",
          "Titre": "blocked my account. stay away",
          "Contenu": "I have registered my domain with spaceship few month ago. but they banned my account without any reason. they saying that i have made duplicate account which is fake. stay away from spaceship."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Andy",
          "Nb_Reviews": 3,
          "Date": "2023-05-17T07:11:10.000Z",
          "Titre": "Tried to transfer a domain to Spaceship",
          "Contenu": "Tried to transfer a domain via paypal, transaction declined 3 times, have to go with a established domain provider. Wasted a bunch of time to save a few bucks. And today paypal approved the 2 transaction out the blue for no reason whatsoever. Now i have to chase paypal my bank and spaceship to get refund. FIX YOUR BROKEN PAYMENT SYSTEM. I do not recommend spaceship at all."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Patrick A.",
          "Nb_Reviews": 1,
          "Date": "2023-05-28T21:09:09.000Z",
          "Titre": "totally waste of time",
          "Contenu": "They closed my account and canceled my domain name, it was a complete waste of time. Instead of buying from Godaddy, I bought a domain from spaceship because it suggested it on the tld-list. I set everything up, connected my hosting, and a few minutes later I got an email, they closed my account and canceled my domain. This was ridiculous, they just took all my time instead of just asking for a confirmation."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Symon",
          "Nb_Reviews": 3,
          "Date": "2023-04-22T22:59:40.000Z",
          "Titre": "Problems with Spaceship!",
          "Contenu": "Becoming a Spaceship customer was a real tragedy.The client panel interface has bugs, like checking the box to not display the message again, and the same message is displayed over and over again.In addition, the site makes the experience for changing DNS servers bad.eu domain was offline for several hours, so I asked for a quick cancellation of it, to register it again in Google Domains.A community with a population of over 40 million has gone offline due to issues not resolved by Spaceship.com!"
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Salman Asghar",
          "Nb_Reviews": 2,
          "Date": "2023-06-22T02:32:00.000Z",
          "Titre": "Ban my domain without warning",
          "Contenu": "I just bought my domain few weeks ago on spaceship. They ban my domain without any warning. However i removed all the data. I am requesting them consistently to unban my domain but they are not bothering to listen me and review my appeal. If spaceship ownerreading this, then this is not a professional service."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Martin Jacob",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T16:41:12.000Z",
          "Titre": "Ridiculously they just scammed me off!",
          "Contenu": "Ridiculously they just scammed me off!I bought a .co domain from their website and paid for it after I tried to add nameservers to my domain they sent me 2 emails one saying my account is closed and second email saying that my domain is cancelled due to fraud! What the h*** is wrong with you guys I need my payment back (FULL REFUND) or else immediately within an hour resolve this issue!P.S. SPACESHIP.COM ASKED ME FOR MORE DETAILS AND CONVINCED ME ABOUT A REFUND BUT I DO NOT NEED REFUND NOW ANYMORE I NEED MY DOMAIN WHICH I PAID FOR!"
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "Ahmed Hossam Ramadan",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T17:00:08.000Z",
          "Titre": "WORST DOMAIN BUYING EXPERIENCE EVER!",
          "Contenu": "WORST DOMAIN BUYING EXPERIENCE EVER!I lost many customers because of them. 48 hours after I registered my domain, it wasn't propagated to all locations yet and some customers even reported that the domain was redirecting to other websites. I contacted support and all they could do is tell my my domain has no problems!"
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "sneakyzakki",
          "Nb_Reviews": 5,
          "Date": "2023-05-17T17:26:31.000Z",
          "Titre": "Cant transfer domain to another account on same website or to a new host",
          "Contenu": "I bought a domain for my friend seeing that there was an option to \"transfer\" my domain to another account though this is disabled and not supported yet.and to transfer to another host i need to wait 60 days"
        },
        {
          "Note": 1,
          "Lieu": "FI",
          "Pseudo": "Omer C.",
          "Nb_Reviews": 8,
          "Date": "2023-07-08T10:30:00.000Z",
          "Titre": "IT'S SCAM!",
          "Contenu": "I'm deeply frustrated and disappointed with the recent experience I had with the Spaceship registrar. On the very night I purchased my domain name, it was unexpectedly cancelled, and I received an email stating that it was due to \"Abuse.\" However, I cannot comprehend how my domain could have violated any rules or caused harm in any way. To make matters worse, the support team has been unresponsive, providing no explanation or assistance whatsoever. This situation has left me feeling cheated as they have not only cancelled my domain without justification but also kept my money. I initially chose this registrar because they offered the cheapest .me domain prices, but I will never use their services again, nor would I recommend them to anyone. Beware of Spaceship registrar, as they appear to be engaging in dishonest practices.I highly believe they want the domain for themselves because it was a very good name which related to the \"Threads\", the new popular social network. They cancelled mine to get it for themselves."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "OJ The Rover",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T18:22:44.000Z",
          "Titre": "Blocked my account without any valid…",
          "Contenu": "Blocked my account without any valid reason. Don’t ever use spaceship to buy any domains."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Fonezo",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T17:46:41.000Z",
          "Titre": "Worst service",
          "Contenu": "Behenchod,  nameservers update taking more than 24hrs. Big loss. To money and Time."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Game Stars",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T16:41:27.000Z",
          "Titre": "my domain is locked",
          "Contenu": "my domain is locked, very bad service, i don't recommend"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Jonathon Jey",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T21:14:30.000Z",
          "Titre": "Fraud and scam",
          "Contenu": "Fraud! They took my money and saying they are not for aged under 18.They don't want to unlock my account."
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "FUck fuck",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T08:31:16.000Z",
          "Titre": "freakufck you all"
        },
        {
          "Note": 1,
          "Lieu": "BD",
          "Pseudo": "shoriful hasan",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T18:52:30.000Z",
          "Titre": "My  10  domain scam"
        },
        {
          "Note": 1,
          "Lieu": "BD",
          "Pseudo": "Msgsvwksvb bbndksis",
          "Nb_Reviews": 6,
          "Date": "2023-05-18T18:50:28.000Z",
          "Titre": "This is  scamer  website"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Harvey",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T18:00:23.000Z",
          "Titre": "Offer Phone communication for customers."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Rupesh Shah",
          "Nb_Reviews": 1,
          "Date": "2023-05-28T05:19:17.000Z",
          "Titre": "nice service",
          "Contenu": "nice service. needs improvement. good pricing for domains"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 6,
          "Date": "2023-05-01T19:12:58.000Z",
          "Titre": "Not sure I get it.",
          "Contenu": "Looks like they've implemented some great pricing to gain some marketshare, so that's good for now but it's doubtful they'll maintain this pricing. The site looks nice but some of the management functionality is frustrating. I don't really understand why Namecheap decided to launch a separate site and brand instead of focusing on and improving the one they already have."
        },
        {
          "Note": 3,
          "Lieu": "CN",
          "Pseudo": "yang",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T04:46:46.000Z",
          "Titre": "The slow loading of the web page may be…",
          "Contenu": "The slow loading of the web page may be related to the fact that the web page needs to load the Google rendering engine, and I hope to improve the settings to reduce the pop-up window, which will appear slower"
        },
        {
          "Note": 3,
          "Lieu": "AZ",
          "Pseudo": "Gudratli Rufat",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T11:05:42.000Z",
          "Titre": "domain stopt work just 3 week after purchase",
          "Contenu": "I bought a domain (voluntas.studio). Everything worked until today. the domain stops work and redirects to spaceship.com `s page. And writes \"Huston, you have a problem\" like a stupid joke.UPD: Problem was becouse of they didn`t ask about any email validation on registration and then becouse of I didn`t validate email - they stopped domain. Support was polite."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Farok",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T01:52:39.000Z",
          "Titre": "The company doesn't have a phone…",
          "Contenu": "The company doesn't have a phone number, its very tough to solve the issue, the turnaround time is long to solve the issue."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Ripudaman Kochhar",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T01:47:14.000Z",
          "Titre": "I am domain reseller | Trying Cheap Rates",
          "Contenu": "I am domain reseller, Price is really amazing just same as SAV.com (Inever tested) . I am using GOdaddy, Hostinger , Namecheap from years. Website is really cool, NewGEn website and AdminPanel.I was going to buy 10 domains, but I read this section and got 2 reasons to not to buy any.1. Their Transfer feature is not working yet, thats a big NO for me. I have to resell these Domains after 2 months.2. As Reported They Cancel your account and de register your domain. Even if my domains get unsold for an year, this thing would definitly make me to think that may be domain was of high value and they were the scammers."
        },
        {
          "Note": 3,
          "Lieu": "BD",
          "Pseudo": "MD ASHRAFUL",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T10:44:34.000Z",
          "Titre": "Service is good but could be better if…",
          "Contenu": "Service is good but could be better if domain auth code generate option is available for all users. And also domain lock and unlock option is available for all users. Thank you."
        },
        {
          "Note": 3,
          "Lieu": "PK",
          "Pseudo": "Osama Masood",
          "Nb_Reviews": 2,
          "Date": "2023-06-08T23:23:30.000Z",
          "Titre": "No option for unlock domain or EPP code",
          "Contenu": "Nice pricing but no option for unlock domain or EPP code. do i have to manually request for those things?"
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "Al Firous",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T07:57:37.000Z",
          "Titre": "Great UI, best PRICE, UX need improvement",
          "Contenu": "Although Spaceship is part of Namecheap, I like it better, especially the User Interface is simple and modern. The domain price is arguably the cheapest on the market (for now). Unfortunately, the UX in the client area is quite confusing (lack of structured flow). I don't need to reach support right now (so can't review it). Hopefully, Spaceship will grow and continue to prioritize its users & clients.Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T17:32:13.000Z",
          "Titre": "Spaceship is one of the best..",
          "Contenu": "Spaceship got one of the best Dashboard's / Control Panel's. Simple and Stylish. And to have email hosting under the same roof is a big plus. Spacemail has the same style and simplicity as Spaceship's Dashboard. We have tried many different hosting companies and this is one we recommend the most."
        },
        {
          "Note": 4,
          "Lieu": "UG",
          "Pseudo": "Francis Mukobi",
          "Nb_Reviews": 8,
          "Date": "2023-11-03T18:35:08.000Z",
          "Titre": "The Spaceship hosting and domain",
          "Contenu": "The Spaceship hosting and domain platform is fast and sleek. Also its easy for me to find what I want inside the panel. I have given 4 stars because Spaceship is a recent comer to the domain and hosting business. Shall they be able to sustain? will there prices spike up after some time?"
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Pug",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T02:23:32.000Z",
          "Titre": "This operation seems excellent",
          "Contenu": "This operation seems excellent. Prices are very competitive, with cutting-edge web interface and user experience. The name Spaceship(.com) also points to a premium effort. I'm not yet a customer solely because there remains a small gap in trust. Who are these people? \"About Us\" would improve with a handful of real faces. I want a measure of stability -- hopefully this business will survive a few years at least; is there adequate funding & resolve? This is a tough field, with tight margins, can they survive? It is troublesome to migrate websites and email if their effort can't be sustained. Finally, I see (with a bit of research, though the extent of linkage is not clear) that Namecheap shut-down their Russian clients rather summarily. We live in volatile times. Will politics or a (foreign) government's policies disrupt my relationship with this firm? The imagery of a spaceship is borderless, but do they have any commitment to operating in a borderless manner?"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Legitti",
          "Nb_Reviews": 61,
          "Date": "2023-07-26T19:26:39.000Z",
          "Titre": "Files wiped",
          "Contenu": "Randomly disconnected my hosting and domain resulting site begin wiped. The index page no longer works either after restoring a backup, nice job.Edit: 24hrs later I got a very detailed service disruption update email, explaining what caused the outage. Appreciating the transparency, hopefully, this won't happen again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ann",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T13:11:58.000Z",
          "Titre": "Transfer process went smoothly."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Kieran",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T11:22:25.000Z",
          "Titre": "Great prices and no hidden fees but the setup process for the domains was unnecessarily complicated."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Supratik",
          "Nb_Reviews": 2,
          "Date": "2023-07-14T17:45:42.000Z",
          "Titre": "Good 👍",
          "Contenu": "Good but there's always room for improvement 🤷"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Ajay Babu",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T14:01:37.000Z",
          "Titre": "Very Cheap price domain buy"
        },
        {
          "Note": 4,
          "Lieu": "FI",
          "Pseudo": "Ahmet",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T14:02:21.000Z",
          "Titre": "You don't have a free mail service"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Antoni",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T16:39:28.000Z",
          "Titre": "navigation post login is really really…",
          "Contenu": "navigation post login is really really confusing"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "abdosa",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T12:25:21.000Z",
          "Titre": "It's very good and easy to use"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Manish",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T08:12:38.000Z",
          "Titre": "Very nice service and spot team all…",
          "Contenu": "Very nice service and spot team all time available and good price"
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Monoxide Dihydrogen",
          "Nb_Reviews": 5,
          "Date": "2023-11-24T18:45:45.000Z",
          "Titre": "I recommend :)",
          "Contenu": "Good Pricing.Nice UI but not the best. it have some improvements such make more faster, understanble. but it looks like cool so its okay.If there is \"free mailbox for domains registered on spaceship\", its would be much better.because there is almost no provider offer thats for free.overall, its great domain registry, i can recommend."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:25:34.000Z",
          "Titre": "I have had a great experience using the…",
          "Contenu": "I have had a great experience using the Spaceship platform very easy to use and has many functionalities available."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allan W",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T16:37:24.000Z",
          "Titre": "Prices for most of domains (purchase",
          "Contenu": "Prices for most of domains (purchase, renew and transfer) are the lowest, while maintaining the highest standards of services and information related to domains. I moved all of mines from NameCheap because it’s been keeping failed to renew my domains.for more than two months. No apologies or explanations at all in NameCheap."
        },
        {
          "Note": 5,
          "Lieu": "KZ",
          "Pseudo": "Nurlan Khabibulla",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T11:46:57.000Z",
          "Titre": "the best service in the website domains…",
          "Contenu": "the best service in the website domains area. trully recommend..."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Alexandru Stefan",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T20:06:29.000Z",
          "Titre": "Best prices for domains!",
          "Contenu": "Best prices for domains!Stability, simplicity, best prices, everything you can want from a domain registrar."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Rupinder",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T14:59:29.000Z",
          "Titre": "Great Service and pricing",
          "Contenu": "Good Service and pricing"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Hi Fadhil",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T07:48:42.000Z",
          "Titre": "Best Service",
          "Contenu": "good service Please improve service quality"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Asim Patel",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T12:35:24.000Z",
          "Titre": "The shuttle 🚀",
          "Contenu": "\"This shuttle is instrumental in driving future success.\""
        },
        {
          "Note": 5,
          "Lieu": "LK",
          "Pseudo": "Sathyangi",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T19:40:25.000Z",
          "Titre": "Beginner's Best Friend in Domain Selection",
          "Contenu": "Being a newcomer in the domain world, finding spaceship was a true blessing. Their beginner-friendly platform made it a breeze for me to secure my domain."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "AAA",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T03:17:59.000Z",
          "Titre": "Modern, Secure and Powerful.",
          "Contenu": "Im just amazed by the quality and service that Spaceship offers!! Everything goes according to the modern standards and beyond. You just feel comfortable using it! it makes everything easy and you enjoy work when you're inside spaceship.Modern, Secure and Powerful.Next level service and the support team is very friendly & ready to solve anything.A1"
        },
        {
          "Note": 5,
          "Lieu": "NI",
          "Pseudo": "Rene",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T16:07:59.000Z",
          "Titre": "Cost effective and easy to use…",
          "Contenu": "I think spaceship is very cost effective and easy to use, manage and configure."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Rainer Gehrling",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T07:57:43.000Z",
          "Titre": "Spaceship is new and has just taken off",
          "Contenu": "Spaceship is new and has just taken off. They offer currently the best pricing. So I tried them out and got my new domain. DNS record worked fast and easy as you would expect it. You can set to auto renew so you don't forget the payment next year. I like it - wish them good luck."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Deepak",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T06:08:34.000Z",
          "Titre": "Great!",
          "Contenu": "I was a bit apprehensive about using a new registrar. But decided to give it to go after checking out cheapest deals on TLD list.I am glad I did so.Spaceship has very modern interface and easy to use navigation. There was no problem with payments and everything was instantaneous. Thinking of moving all my domains here."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Uriah Moisés Gomes",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T17:43:00.000Z",
          "Titre": "The cheapest domain you will find",
          "Contenu": "Excellent service, attractive price. You will not find a cheaper domain.The control panel is one of the most special I've met, thank you very much for everything."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Daniel",
          "Nb_Reviews": 20,
          "Date": "2023-11-14T11:46:09.000Z",
          "Titre": "Amazing support and great prices!",
          "Contenu": "Amazing support and great prices!Even tho they're part of a bigger brand, which I have a worse experience with, I do like this sub brand. Great support, great prices and a great platform!"
        },
        {
          "Note": 5,
          "Lieu": "MD",
          "Pseudo": "Filip",
          "Nb_Reviews": 6,
          "Date": "2023-08-02T19:06:55.000Z",
          "Titre": "This Is The Registrar That I Praid For To Be Created!",
          "Contenu": "This is the registrar from the space future, as I always wanted, everything is so easy, their prices are not inflated like on other registrars. I really like them, there are minor bugs but I m sure they will be sorted out, as other registrars had similar issues or even worse.That is why I recommend Spaceship to anyone, whether he is end user or domain investor, you will not regret your flight."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 10,
          "Date": "2023-08-23T18:32:27.000Z",
          "Titre": "Moved all my domains Here",
          "Contenu": "I started using Spaceship given that they simply offer the lowest prices on the market, while there are some small UX improvements that can be had with the service, and some TLDs aren't supported yet but to be hones There is nothing to really complain about.It's made by the NameCheap Team where I had most of my domains, and now I moved everything here."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Tom The B.",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T08:30:08.000Z",
          "Titre": "They should be a living proof of \"yest it can be done\"",
          "Contenu": "Process of placing any order is simplified that way where everything id clear, no hidden fees, data. Just service provide what it is supposed to. Thanks yo SPACESHIP approach they got 3 new regular customers ; me and two refereed friends). Keep going!"
        },
        {
          "Note": 5,
          "Lieu": "GH",
          "Pseudo": "Best Law Of Attraction",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T23:13:15.000Z",
          "Titre": "Spaceship is the best their hosting is…",
          "Contenu": "Spaceship is the best their hosting is very cheap and supper as to compare to others. their online help services are also quick and supper. i recommend it to you okay."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Imran",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T07:29:42.000Z",
          "Titre": "Awesome and Amazing",
          "Contenu": "Spaceship.com, a product by Namecheap, has truly lived up to its reputation as a reliable and trustworthy service provider. I placed my trust in their services, and I have been thoroughly impressed with the quality and usefulness they offer. The experience has been nothing short of exceptional, making it easy for me to recommend Spaceship.com to others seeking reliable solutions."
        },
        {
          "Note": 5,
          "Lieu": "AR",
          "Pseudo": "David Noack",
          "Nb_Reviews": 8,
          "Date": "2023-09-25T12:59:25.000Z",
          "Titre": "Very good prices",
          "Contenu": "Decent prices, nice UX and all the features you need to manage your domains. I'm migrating all my domains from Google Domains to Spaceship because it's the best company in the market right now."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-13T20:44:44.000Z",
          "Titre": "Best dashboard",
          "Contenu": "Best dashboard. Although it still need some simplification, but I like the features overall, especially grouping DNS records.I forgot to mention the competitive pricing on domains as well, spaceship checks most of the boxes."
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "kolesto",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T10:51:39.000Z",
          "Titre": "Probably the best customer service I've seen in my life",
          "Contenu": "I purchased a domain, then I was asked to complete a simple verification, but I faced some problems on my side. During the entire interaction with their support team, they were extremely polite and professional, but the best part is that, even though there were no problems on their side, they decided to give me the domain for free as an apology. I've never  seen such high level of customer service from any other company."
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "mehdi felaouss",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T17:05:20.000Z",
          "Titre": "Literally will take you to space of…",
          "Contenu": "Literally will take you to space of domains,they have fast live support, modern ui with really good and affordable princes as well as fast dns and yeah the best."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Sab Ana",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T02:58:06.000Z",
          "Titre": "Spaceship is just amazing.",
          "Contenu": "Spaceship is just amazing.Fast as speed of Light in everything. Never have I ever seen such a great registrar with quick chat support, no processing time, and appealing user interface.May SPACESHIP prosper by leaps and bounds. <3"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "chris",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T05:16:45.000Z",
          "Titre": "Awesome domain registrar!",
          "Contenu": "Spaceship has awesome interactive UX/UI with almost instant support that are not bots! Not to mention the support for Crypto payment and cheap prices for 1 year plan but renewals as well. I will be using this service in the future again, thanks :)"
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "Kyle",
          "Nb_Reviews": 9,
          "Date": "2023-05-22T05:51:19.000Z",
          "Titre": "Best domain registrar",
          "Contenu": "Obviously, I had a very difficult time transferring my Domain to Spaceship in the beginning due to PayPal issues. But they compensated me very generously for the damage, and I am generally satisfied with their service. There are still a number of shortcomings, but I'm sure they'll be the best company if they continue to improve on these.They also provided me with quick customer support all the time. This is a very good support that you can't find anywhere else."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Video Craze",
          "Nb_Reviews": 3,
          "Date": "2023-07-20T00:31:56.000Z",
          "Titre": "Awesome Speed",
          "Contenu": "I edited my review because apparently, while i was here doing a negative review the team was working on solving the issue i had. 10 minutes to solution, I am happy now. I will buy more domains."
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "Tuan.GG",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T18:48:57.000Z",
          "Titre": "I couldn't be happier with my experience...",
          "Contenu": "I recently purchased several domains from Spaceship.com and I couldn't be happier with my experience. The prices were very affordable and the payment process was straightforward and easy to use. The website interface was also very user-friendly and intuitive, making it easy for me to find and purchase the domains I needed.Overall, I'm very impressed with the service provided by Spaceship.com and would definitely recommend it to others looking to purchase domains. I plan on telling my friends and colleagues about my positive experience and encouraging them to give Spaceship.com a try. Thanks for the great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Awtsmoos",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T02:01:29.000Z",
          "Titre": "Awtsmoos revealed in the Web?",
          "Contenu": "B\"HHad issue with adding my MX records, so the support agent helped me remove the default email forwarding which solved the issue.Also I got a domain from them (.one) for $1.30 for the first year, pretty good deal"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Sami",
          "Nb_Reviews": 17,
          "Date": "2023-07-28T16:37:19.000Z",
          "Titre": "I don't understand bad reviews.",
          "Contenu": "I don't understand bad reviews.Honestly, for me, Spaceship.com really worked well for me, I love the user interface and how it's made, it's one of the cheapest and the easiest to understand website. You can get a [dot]com for only $1.50, I just hope that I will not get problems in the future."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Abhishek Kumar",
          "Nb_Reviews": 5,
          "Date": "2023-08-02T17:37:33.000Z",
          "Titre": "Totally loved the website and the…",
          "Contenu": "Totally loved the website and the prices of the domain. The user interface looks cool and great. However, I have not yet tried their hosting, only purchased domains from there. The prices of shared hosting seems nice, not sure how the service is. but for domain, Spaceship is cool. Loved the website and the idea."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brash Brand",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T22:40:55.000Z",
          "Titre": "URL.. Webhave liftoff",
          "Contenu": "Things are a bit rough around the edge as we blast off here but the fact there’s people out there even just thinking of the possibility of doing the kind of stuff Spaceship.com is doing is totally stellar! Spaceship.com is actually doing it, though! And that just out of this world!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Alexis",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T17:22:40.000Z",
          "Titre": "Stellar Domain Service!!",
          "Contenu": "I have over 100 domains with another registrar and their renewal rate has gone up twice just this year. I started looking for options and thought I would try spaceship.com. I had some reservations, but transferred a couple at first. I found initiating the transfer wasn't intuitive. I installed the transfer manager but no link to start a transfer. I couldn't find a help link inside launchpad so I went to the home page chat. Within a minute a nice tech was there to help me find where to start the transfer (which is from the home page). Those two transfers went well so the next day I initiated 13 more transfers, but had problem with the auth code being accepted (gave an error). I jumped on chat and again, a tech was with me in a minute and we worked it out. Everything has gone smoothly since. Now that my first batch has completed I navigated around and found the interface to be my favorite out of any registrar I have ever managed domains. I'm really liking spaceship.com and can't wait to have all my domains moved over. I highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mani",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T15:47:09.000Z",
          "Titre": "The fastest service ever",
          "Contenu": "I registered a domain at spaceship and my experience is amazing. Such a fast domain registrar. Registered and completed my order within a blink of eye. Thankyou and keep providing such service."
        },
        {
          "Note": 5,
          "Lieu": "DZ",
          "Pseudo": "nour eddine",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T16:09:06.000Z",
          "Titre": "BEST EXPERIENCE An easy interface",
          "Contenu": "BEST EXPERIENCE An easy interface. You can request a domain and connect it in seconds and at the best prices"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reed Howell",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T20:29:44.000Z",
          "Titre": "Ease of use",
          "Contenu": "Ease of use, great prices, and the value of the extras that you receive for being a Spaceship client, are all reasons why I'm a devoted fan."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Ricardo Aurelio",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T02:32:35.000Z",
          "Titre": "Newbie review",
          "Contenu": "For someone new to domain stuff, spaceship is a really great way to start, it's super easy to use"
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "Shahidul Islam Pranto",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T21:23:22.000Z",
          "Titre": "Customer service is a big help for me",
          "Contenu": "Customer service is a big help for me. They helped me solve my issue and the support was with me for about 1 and a half hours. I also got help for my additional subdomain issues. All in all, very good experience."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Sumra Admission",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T03:27:41.000Z",
          "Titre": "Exceptional Service from Dmytro Danylenko",
          "Contenu": "Dmytro went above and beyond to provide me with a solution that exceeded my expectations.Their expertise, responsiveness, and willingness to assist were truly remarkable. Dmytro demonstrated a deep understanding of my needs and provided clear and concise guidance that helped me resolve my issue quickly and effectively. Their professionalism and dedication to customer satisfaction are truly commendable."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Noor",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T17:18:59.000Z",
          "Titre": "I think it is good and running…",
          "Contenu": "I think it is good and running smoothly. I suggest all to use it for both blogger and wordpress"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Paulo Cesar De Souza Peixoto",
          "Nb_Reviews": 4,
          "Date": "2023-06-28T13:53:44.000Z",
          "Titre": "Spaceship.com - hard not to like!",
          "Contenu": "Spaceship is for me the best registrar in the world, as it is fast in the domain search, easy to register, has many advantages and, above all, its price is ALWAYS the best. I'm glad I found SPACESHIP.COM"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Raja Singh",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T07:59:20.000Z",
          "Titre": "Fabulous Domain Provider",
          "Contenu": "this one best website to buy a domain, I try it first time and I am very happy, becoz its very fast and easy to handle everything in this website. They make payment very easy for every region in the world."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Kayce Amobi",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T10:24:57.000Z",
          "Titre": "There are just the best",
          "Contenu": "There are just the best, so fast and easyLike I love them so much, all my domain will be registered on this platformSo cheap and affordable and also provide quality service with 24/7/366 support ❤️❤️❤️❤️❤️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 2,
          "Date": "2023-07-05T20:37:14.000Z",
          "Titre": "Spaceship",
          "Contenu": "Spaceship is a clean and clear, slick platform for purchasing your domain and getting it up and running on the web.  Zero complaints.  Thanks guys!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Ajay Purohit",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T16:24:46.000Z",
          "Titre": "I purchased domain from them and it was…",
          "Contenu": "Updating Review : I was Unhappy before my domain was not showing in my domain list , which has been fixed but took 24 hours so I would like to suggest team to improve that other than that very good response and support."
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Surya Giri Kurniawan Poerwanto",
          "Nb_Reviews": 5,
          "Date": "2023-10-14T00:26:03.000Z",
          "Titre": "The price is good",
          "Contenu": "The price is good, the feature is rather complicated to understand, but it is still OK."
        },
        {
          "Note": 5,
          "Lieu": "BG",
          "Pseudo": "Atanas Yonkov",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T19:21:24.000Z",
          "Titre": "Easy to use and very functional",
          "Contenu": "Easy to use, UX is really good, support is friendly and the plan I purchase have all the services I need.. what more should i say?! Totally recommend!"
        },
        {
          "Note": 5,
          "Lieu": "DZ",
          "Pseudo": "busines night",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T16:40:13.000Z",
          "Titre": "Excellent Support !",
          "Contenu": "Excellent Support !Live Chat Team Is Very HelpfulI had an Great Experience With \"Anastasiia Yamshchykova\""
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Jérôme",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T15:56:58.000Z",
          "Titre": "Spaceship 🚀 a new revolutionary low…",
          "Contenu": "Spaceship 🚀 a new revolutionary low cost  domain registrar. Excelent and fast domain panel. Crypto currency payments accept. 👍 I like it 😌"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Sanraj",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T19:07:19.000Z",
          "Titre": "Great service and support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Huzaifa",
          "Nb_Reviews": 9,
          "Date": "2023-07-23T04:48:36.000Z",
          "Titre": "Spaceship left me azamed…",
          "Contenu": "Spaceship left me azamed with such an incredible service. The fastest domain registrar and transfer ever."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Dimitris P",
          "Nb_Reviews": 2,
          "Date": "2023-06-30T21:01:04.000Z",
          "Titre": "Happy with my new .ai registration.",
          "Contenu": "Happy with my new .ai registration. Process was easy and fast. I liked the user-friendly interface!"
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "SALAMI YOUSSEF",
          "Nb_Reviews": 2,
          "Date": "2023-09-18T20:04:05.000Z",
          "Titre": "Good service",
          "Contenu": "Good service - a new method of showing the dns propagation (i like it )- Support at time"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Gyan",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T06:59:18.000Z",
          "Titre": "Very good for me thank you"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Shivam",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T15:46:21.000Z",
          "Titre": "Excellent",
          "Contenu": "Simple, modern, and feature-rich UI design."
        },
        {
          "Note": 5,
          "Lieu": "XK",
          "Pseudo": "PORTA",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T02:28:42.000Z",
          "Titre": "complete solution for your servers",
          "Contenu": "they have a very good service.also a very quick support staff to answer your questions"
        },
        {
          "Note": 5,
          "Lieu": "KW",
          "Pseudo": "Sledge On",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T14:45:21.000Z",
          "Titre": "bro refunded my cash",
          "Contenu": "bro refunded my cash. Big up spaceship mandem"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Martyn",
          "Nb_Reviews": 39,
          "Date": "2023-08-01T05:17:44.000Z",
          "Titre": "nice and simple domain provider.",
          "Contenu": "seems like a pretty nice and simple site to use, check around for coupons, there are some nice ones to try! (hint COM67) sorry Spaceship.com :P spreading the deals!"
        },
        {
          "Note": 5,
          "Lieu": "LK",
          "Pseudo": "Weera",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T15:54:50.000Z",
          "Titre": "Good and helpfull 💯"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Ngabi",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T16:54:41.000Z",
          "Titre": "Very satisfied with the service"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Mike Collins",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T14:47:07.000Z",
          "Titre": "Although in beta the features and user…",
          "Contenu": "Although in beta the features and user experience are amazing and fast! Much different than any other domain registration service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T14:34:22.000Z",
          "Titre": "Excellent service"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "surender",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T12:30:29.000Z",
          "Titre": "Very good",
          "Contenu": "Very good, please provide hosting like domain"
        },
        {
          "Note": 5,
          "Lieu": "BG",
          "Pseudo": "Maurits",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T20:47:23.000Z",
          "Titre": "Very good service!"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Bitrus",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T12:40:18.000Z",
          "Titre": "Great service",
          "Contenu": "Great serviceEasy to use even for absolute beginners."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Sayan",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T11:17:59.000Z",
          "Titre": "Very cheap domain and the interface is…",
          "Contenu": "Very cheap domain and the interface is user friendly"
        },
        {
          "Note": 5,
          "Lieu": "LK",
          "Pseudo": "ruka dino",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T17:22:56.000Z",
          "Titre": "highly recommended",
          "Contenu": "wow, amazing domain, support is very good"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Alessandro",
          "Nb_Reviews": 5,
          "Date": "2023-09-30T15:31:04.000Z",
          "Titre": "Very clear and easy interface"
        },
        {
          "Note": 5,
          "Lieu": "VE",
          "Pseudo": "timbalaye",
          "Nb_Reviews": 5,
          "Date": "2023-09-01T18:50:22.000Z",
          "Titre": "An attractive platform",
          "Contenu": "It is an attractive platform with services and control panel of extraordinary quality for serious projects."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Wildomains",
          "Nb_Reviews": 3,
          "Date": "2023-06-30T17:40:17.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good, easy to navigate the website"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "RIZI",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T05:47:40.000Z",
          "Titre": "Very good Experience 😊",
          "Contenu": "Very good 😊❤️❤️❤️"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Suparlan",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T12:05:49.000Z",
          "Titre": "Very cheap domain in spaceship"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Levi Harrison",
          "Nb_Reviews": 2,
          "Date": "2023-10-01T02:46:37.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, fast and knowledgeable"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Levi Harrison",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T02:13:13.000Z",
          "Titre": "Fast response time and problem solved",
          "Contenu": "Fast response time and problem solved. Happy!"
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "albert",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T14:38:48.000Z",
          "Titre": "good service"
        },
        {
          "Note": 5,
          "Lieu": "LK",
          "Pseudo": "Chathuranga Ruwan",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T16:54:38.000Z",
          "Titre": "Easy way really interested"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Numlk Numlk",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T09:45:12.000Z",
          "Titre": "Finally Got One",
          "Contenu": "Finally Got One. Thank for the prompt reply and support!!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Viijay parmar",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T07:26:16.000Z",
          "Titre": "Very helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 2,
          "Date": "2023-06-10T18:48:11.000Z",
          "Titre": "Great Service",
          "Contenu": "Easy to use … although coupon code didn’t work. Bummer."
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "voxlab",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T09:40:52.000Z",
          "Titre": "amazing....",
          "Contenu": "amazing....keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "PRIYANSHU RAJ",
          "Nb_Reviews": 2,
          "Date": "2023-04-20T11:50:37.000Z",
          "Titre": "Very Good User Interface And Value For…",
          "Contenu": "Very Good User Interface And Value For Money"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:08:40.000Z",
          "Titre": "Affordable"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "JackSparrow",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T16:45:41.000Z",
          "Titre": "Best service and support"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Yakov",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T10:49:33.000Z",
          "Titre": "awesome fresh modern service!! thx!! its awesome!!",
          "Contenu": "subj%)) u doing great!"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Abu Hafsoh",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T11:36:29.000Z",
          "Titre": "Very professional",
          "Contenu": "Very professional. Fast and reliable"
        },
        {
          "Note": 5,
          "Lieu": "NP",
          "Pseudo": "Basanta Sapkota",
          "Nb_Reviews": 7,
          "Date": "2023-09-22T16:15:09.000Z",
          "Titre": "best service"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "RapidNames.com",
          "Nb_Reviews": 4,
          "Date": "2023-05-18T14:12:31.000Z",
          "Titre": "Great registrar",
          "Contenu": "They fixed the issue. Thanks for the prompt response."
        },
        {
          "Note": 5,
          "Lieu": "LK",
          "Pseudo": "Ayesha Maduranga",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T11:32:19.000Z",
          "Titre": "Very Resonable price."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ryan Harris",
          "Nb_Reviews": 4,
          "Date": "2023-08-29T15:21:52.000Z",
          "Titre": "Best Domain Management Site I've Ever Used - Very Intuitive With A Nice Design And Clean Interface As Well As Nice Chill Support Staff, Couldn't Ask For More, Honestly!",
          "Contenu": "Best Domain Management Site I've Ever Used, I used to be with Google Domains, now they were great.. Except they are now in an agreement with Squarespace and I can't promise myself that the price of my Domain won't go up significantly after the 1 year same domain price promise that they accepted, after going back and forth with the team over at Spaceship, I can say for certainty that I've no idea what the negative reviews are on about, if I have to give my honest opinion, don't let the bad reviews put you off at all because I've not experienced any issues ever since I made the jump to Spaceship, sure there’s a few hitches here and there but nothing that can’t be worked around and they are working on consistently adding new features and fixing bugs, for which you should check their Roadmap to see what might be coming next! Another thing I can say is that even if you haven't quite made the flight to the Spaceship yet and are worried about some things and have some questions, don't be scared to ask the support team over at Spaceship, I had a bunch of questions over a bunch of days before I transferred my domain, I asked a lot and ended up opening at least 5 tickets because I'd have a new question every 2 - 3 days, their support team always got back to me really quickly and were very nice, all of them are absolutely amazing and the hard effort is really paying off. Another thing I like about Spaceship is how open they are to the community, I never really see anyone such as Google or Microsoft365 Admin etc mention what features they are adding but Spaceship have a subpage for what's coming next ( Go to their website, scroll to the bottom, under “About Spaceship” press “Roadmap” ) and you as a consumer are able to select and vote which one you want to be implemented / worked on next and it's amazing. Honestly coming from Google Domains and moving to Spaceship has been an amazing experience. Now would I stay with them long term? Yes I would I feel like what they are doing now, they are becoming a mainstream Domain Management site and with their intuitive UX Site and always happy to help 24/7 support I can say for certainty that I won't ever move from them because simply I wouldn't get a better experience anywhere else, thank you Spaceship for existing, and thank you for your well curated customer support, you're all absolutely amazing and I simply couldn't ask for more other than keep working hard on those features and bug fixes, you’re awesome and keep on at it :)"
        },
        {
          "Note": 5,
          "Lieu": "LK",
          "Pseudo": "Vihanga",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T18:13:45.000Z",
          "Titre": "Good service!"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Joni",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T13:27:16.000Z",
          "Titre": "Price goods and multy tld discount"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Burhanuddin",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T12:42:59.000Z",
          "Titre": "Issue solved immediately"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Shanti",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T16:01:33.000Z",
          "Titre": "Amazing Domain Provider 🤩🤩"
        },
        {
          "Note": 5,
          "Lieu": "LK",
          "Pseudo": "Weera",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T13:47:54.000Z",
          "Titre": "Good 💯",
          "Contenu": "Honest, Helpfull"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Sajid Aslam",
          "Nb_Reviews": 5,
          "Date": "2023-06-15T06:32:06.000Z",
          "Titre": "wonderful experience with Spaceship",
          "Contenu": "wonderful experience with Spaceshipand pricing is awesome"
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "QUOKKA SAS",
          "Nb_Reviews": 7,
          "Date": "2023-06-30T22:46:59.000Z",
          "Titre": "Excellent Standart.space"
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "Nguyen Hoang Nam",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T17:58:37.000Z",
          "Titre": "Fast and smooth"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "jayesh",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T13:59:44.000Z",
          "Titre": "very great experience"
        }
      ]
    }
  ]
}