{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "specialtyansweringservice.net",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AuctionVcommerce LLC",
          "Nb_Reviews": 2,
          "Date": "2022-01-21T03:48:57.000Z",
          "Titre": "My sales rep went MIA after day 1..",
          "Contenu": "My sales rep went MIA after day 1... My call set up referenced appointments, which had nothing to do with my business... Agents didn't follow the protocol that was put in place so I missed calls... This company is a great idea in theory, but in reality, it's bad for business!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason Taylor",
          "Nb_Reviews": 2,
          "Date": "2020-10-02T20:57:23.000Z",
          "Titre": "Run away!",
          "Contenu": "After spending a week trying to get access during our 2 week trial, we finally got it setup where we could start testing.   90% of our calls when straight to on hold music, after 5 minutes on hold it appeared to ring again then disconnected the line.    The calls that did manage to reach an agent, the agent couldn't answer basic questions that were in the script.   I called SAS to ask them about these issues and the response was simply \"It sounds like we are not a good fit\".    What company is a good fit for a call answering service that doesn't answer 90% of the calls, and the remaining calls that do answer can't response with the basic information?  Absolutely horrible experience. Stay away.Jason Taylor, CTO @ Dedoose"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joni Starkey",
          "Nb_Reviews": 2,
          "Date": "2019-10-02T20:02:18.000Z",
          "Titre": "I own an Emergency services company in…",
          "Contenu": "I own an Emergency services company in Las Vegas. I said,\"EMERGENCY\"...not wait on blank time, 1 minute to have their telephone line pick-up and then 2 minutes on music and then an operator answers and forgets the name of our business. This happened on many calls.The SAS office explained to me sometimes it takes a few minutes for the one answering the phone to receive the script on their computer she is representing. I lost many,many calls. I cancelled our service by phone and opened up the website to find no one cancelled my account. I went through a run around trying to cancel. We also were charged a whole month in advance and couldn't get our money back. If you value your customers and your business. DO NOT CHOOSE SAS!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jerome patterson",
          "Nb_Reviews": 1,
          "Date": "2020-04-07T15:19:02.000Z",
          "Titre": "Hocked over bill",
          "Contenu": "a minute agoGood service but the billing is terrible. They are not responsive. They hit you with late fees agree to withdraw it and don’t. Now I’m getting call after call over late fees they agreed to withdraw!! Plus I have sick family members that I need to take care it’s incredible they are worried more about late fees than people dying from this virus. Incredible just incredible that I have to worry about this when I worry if my family can breathe and have to go to the hospital!!!!"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Sona Patel",
          "Nb_Reviews": 1,
          "Date": "2019-07-03T15:16:18.000Z",
          "Titre": "Be careful this company is a scam",
          "Contenu": "Be careful this company is a scam.  They overcharged me for 2 months instead of charging me for one month at a time and the customer service says \"that's our policy, it's in the agreement\".   It does not state anywhere in the agreement that you will charged for 2 months at once.  Now I have to file a dispute and close my card.  This is a dishonest company and I wish I knew before I wasted my time here."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Beni Istoc",
          "Nb_Reviews": 1,
          "Date": "2020-03-10T18:43:15.000Z",
          "Titre": "Inconsistent service",
          "Contenu": "Inconsistent service, Long wait times up to 3 minutes on a call.  Terrible customer service. We ended up loosing business because of them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2018-01-17T19:10:37.000Z",
          "Titre": "Poor service",
          "Contenu": "The issues with the service were numerous.  I had multiple patients complain about how calls were handled, the name of my business was regularly stumbled over or said incorrectly and the scheduling that was supposed to take place seemed to be too much for the receptionists to handle.  There were also multiple instances when the receptionist would keep the caller on the line for an additional minute or two while they were \"entering information\" only then to hang up with the caller without further interaction on the caller's part.  To me that practice seems questionable at best when calls are billed by the minute."
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Ayomide Nike",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T11:35:00.000Z",
          "Titre": "Just started",
          "Contenu": "Just started, hoping to win more"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2021-08-23T18:24:32.000Z",
          "Titre": "Great service!! Very prompt responses & profess...",
          "Contenu": "Great service!! Very prompt responses & professional service. Only had 1 issue with a couple lines not getting answered during a busy call time, but other than that they've provided exemptional service & I would highly recommend them!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debi Blood",
          "Nb_Reviews": 2,
          "Date": "2020-01-22T13:50:31.000Z",
          "Titre": "Excellent service and value",
          "Contenu": "We've enjoyed excellent service from SAS for several years; great value for the comprehensive services they provide to us. The customer portal could be more user friendly, but any time we've had an issue using the portal it was quickly resolved with the tutorials they provide or a phone call/email."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alyssa Kraft",
          "Nb_Reviews": 1,
          "Date": "2018-06-06T12:28:25.000Z",
          "Titre": "Good For Us",
          "Contenu": "They promptly respond to any changes we need made to the script and ensure that their reps are sticking to the script. Accuracy in typing needs a little work as well as verifying the customer's information; however, that is just on the technical level."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Charlotte Ronvaux N",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T17:51:15.000Z",
          "Titre": "SAS is a very good service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eddie Whempner",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T18:09:54.000Z",
          "Titre": "SAS is easy to use",
          "Contenu": "The layout is great and simple to follow.  The response by those that answer the phones has been very good.  They make setting it up really easy.  I am happy I chose them for my business."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Samantha Lancz",
          "Nb_Reviews": 1,
          "Date": "2021-11-05T18:28:05.000Z",
          "Titre": "SAS is a great answering service",
          "Contenu": "SAS is a great answering service, completely flexible to have them answer for your company with a script of your choosing. Also great customer service!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kala Clark",
          "Nb_Reviews": 1,
          "Date": "2018-07-06T13:29:22.000Z",
          "Titre": "Great answering service",
          "Contenu": "Great answering service! Overall, we have been very happy with the service. There have been a couple of issues, but their staff was very helpful and corrected the problem immediately upon notification. I would recommend this answering service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yolanda Johnson-Martin",
          "Nb_Reviews": 3,
          "Date": "2020-04-18T03:12:06.000Z",
          "Titre": "I like being able to speak to a person",
          "Contenu": "I like being able to speak to a person. The online portal is a little confusing to me but they do get the job done. I never miss a call."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LaChandra Norman",
          "Nb_Reviews": 1,
          "Date": "2020-12-04T19:59:59.000Z",
          "Titre": "they were very helpful and helped in a…",
          "Contenu": "they were very helpful and helped in a timely manner"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bkann",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T15:48:35.000Z",
          "Titre": "Positive Interaction",
          "Contenu": "SAS has always supported our business very well.  The individuals that I have worked with make every experience positive.  They are an extension of our business and I appreciate their willingness to assist us every day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KC",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:46:06.000Z",
          "Titre": "Gabe was great and very patient at…",
          "Contenu": "Gabe was great and very patient at explaining the ins n' outs of SAS and very helpful in updating our phone script.  Just like Sam Zimmers, he gets an A+++ from us!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Pinnell",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T20:10:23.000Z",
          "Titre": "I have business to business relations…",
          "Contenu": "I have business to business relations with this company. I’m very satisfied and highly recommend to anybody who needs an answering service for their company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa Gutierrez",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:40:34.000Z",
          "Titre": "I called and spoke to Courtney about an…",
          "Contenu": "I called and spoke to Courtney about an issue with our account. Courtney got our issue resolved within an hour! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Roden",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:18:26.000Z",
          "Titre": "SAS has been a great addition to our…",
          "Contenu": "SAS has been a great addition to our office. Very helpful when our team is out in the field."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shelby Biggs",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T04:34:45.000Z",
          "Titre": "The discussion with the representative…",
          "Contenu": "The discussion with the representative was enlightening, articulate, and thorough. I left the call without any lingering questions and successfully tailored the routing for after-hours or emergency assistance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrea",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T16:18:46.000Z",
          "Titre": "Address my concerns & needs",
          "Contenu": "Jessi was prompt and professional & helped with our needs. Thx u."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Findley",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T18:31:13.000Z",
          "Titre": "Adding a new user to the script and…",
          "Contenu": "Adding a new user to the script and transfer list is as easy as a one-minute email. Jessi R. was quick to respond and complete the request. Thanks for a painless support process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jazzy Rippy",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:55:07.000Z",
          "Titre": "Friendly, Helpful, Quick",
          "Contenu": "Friendly, helpful and resolved my updates very quickly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Gerhardt",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T16:37:21.000Z",
          "Titre": "Danielle provided outstanding customer…",
          "Contenu": "Danielle provided outstanding customer service; it's noticeable when a customer service rep is hurriedly trying to get through a call.  Danielle gave concise and easy to follow step-by-step instructions which allowed me to make the necessary changes within my dashboard.  This is how customer service should be...thank you Danielle!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Becki Capone N",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T23:40:37.000Z",
          "Titre": "Reliable and accurate service",
          "Contenu": "Specialty Answering Service allows you to run your business efficiently 24 hours a day.  The operators provide accurate, detailed messages or patch urgent calls to us in real-time.  Couldn't ask for a better back up system!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kush Desai",
          "Nb_Reviews": 6,
          "Date": "2023-11-20T22:13:11.000Z",
          "Titre": "Positive experience",
          "Contenu": "The account setup was easy and their sales agent was helpful in getting me started. They typically answer calls promptly and I have received good feedback from customers about their phone experience with them.The programming team also did a great job helping me build and implement the script for answering calls.I recommend SAS without reservations and plan to be a customer for a long time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Balentine",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T22:59:32.000Z",
          "Titre": "EXCEPTIONAL WORK ETHIC",
          "Contenu": "EXCEPTIONAL WORK ETHIC, SUPERB STAFF WHO LISTEN AND GET ALL YOUR NEEDS MET THE 1ST TIME YOU CALL AND QUALITY OF SERVICES FROM ALL THE CALL CENTER STAFF ! THESE PEOPLE KNOW HOW TO ASSIST YOUR COMPANY IN BECOMING A LEADER!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tommy Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T20:25:32.000Z",
          "Titre": "Great customer experience",
          "Contenu": "The staff is always attentive and work hard at finding solutions to any issues or changes we need, which is a very customizable approach to customer service. Big thumbs up"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T21:21:56.000Z",
          "Titre": "SAS is very responsive to our company's needs!…",
          "Contenu": "SAS is very responsive to our company's needs!Always someone get's our message and responds right away! Has lots of programs to use when and if you decide to try something else when they're answering one of businesses most important communication, THE TELEPHONE! DAN'S Automotive Detail-Indiana."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RBL",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T18:40:39.000Z",
          "Titre": "Great Experience for Many Years",
          "Contenu": "I've worked with Specialty Answering Service for many years. They have flexible tiers to work with the fluctuating change in call volumes we have at different times of the year. Their customer service is top level in all aspects.. Quick, Efficient, Responsive, Professional, via phone and email. I can't recommend this service enough."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Starks",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T17:05:35.000Z",
          "Titre": "Overall the company is a solid company…",
          "Contenu": "Overall the company is a solid company and delivers on their promises. I appreciate their service and would recommend them. The team takes time to understand your needs and then makes sure that those request actually get implemented. I’ve been with them well over 5 years for a reason."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neece Jackson",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T18:17:35.000Z",
          "Titre": "Danielle is very knowledgeable and…",
          "Contenu": "Danielle is very knowledgeable and extremely service oriented.  She helped me navigate to where I needed to go to update my billing information and replace the former contact with my information. Additionally, she assisted me in creating my own log in and setting up 2 other users.  Fabulous service!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Claire Montgomery",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T18:58:13.000Z",
          "Titre": "QUICK customer support",
          "Contenu": "QUICK customer support! Really love that I can speak with the same person and that changes can be done over the phone or via email. The SAS team really are here for YOU and your team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neil H.",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T18:35:15.000Z",
          "Titre": "Great Experience, professional team",
          "Contenu": "I have used this service for quite a while.  They are great to get started and are always quick with a response by email or by phone.  Their team of agents is very professional but down-to-earth, friendly, and responsive.  The portal is a game changer with the ability to customize the scripting, where calls go, changes in staff information, etc.  Worth the money!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Discount PDH",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T21:35:25.000Z",
          "Titre": "SaS is the best thing that could happen…",
          "Contenu": "SaS is the best thing that could happen to our business. They are awesome.Franco Davati,PresidentFDA, Inc.College Station, Texas"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Edwards",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:03:14.000Z",
          "Titre": "Very helpful and friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sherry Carter",
          "Nb_Reviews": 2,
          "Date": "2023-07-28T22:13:48.000Z",
          "Titre": "SAS goes over and beyond…",
          "Contenu": "SAS goes over and beyond whatever your concern, change, or need might be!  The help is congenial, enthusiastic, and forthcoming with additional ideas to make your experience better than you thought it could be.  The answers to your questions and the changes you request are expedited quickly and get you on your way to a new and better experience.  I wish all my vendors offered this type of service!!  You are left feeling like you are the first or most important customer they have ever had!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Christopolis",
          "Nb_Reviews": 5,
          "Date": "2023-07-24T23:36:33.000Z",
          "Titre": "Great company that understands your business needs",
          "Contenu": "Great company that understands your needs and strives to accommodate them.  They have been extremely helpful to us with limited office staff to handle our phone calls which increase greatly after weather events."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Capone",
          "Nb_Reviews": 1,
          "Date": "2021-11-17T20:26:06.000Z",
          "Titre": "WestEd recently migrated to a new…",
          "Contenu": "WestEd recently migrated to a new Service Catalog and incident management system. There were several challenges and changes that needed to be made to our SAS service to accommodate the new system. Mollie, Kelly and there might be someone else I'm missing, sorry, worked with me to make the necessary changes quickly and effectively and also provided some testing time as well. Customer service at it's best!!Bob CaponeService Center ManagerWestEd"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Natalie Marino",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T17:15:50.000Z",
          "Titre": "Danielle is amazing",
          "Contenu": "Danielle is lovely and very helpful, thank you Danielle for assisting me with Kanopi's closure dates and helping us understand the best route to take to updating our greetings :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valerie Spence",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T17:23:16.000Z",
          "Titre": "Jessica was very helpful walking me…",
          "Contenu": "Jessica was very helpful walking me through the process.  She was very busy, but took the time to help me, and was very patient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elite Dental Assisting Academy",
          "Nb_Reviews": 1,
          "Date": "2022-08-05T01:29:31.000Z",
          "Titre": "Truly the most effective use of time…",
          "Contenu": "Truly the most effective use of time and money versus hiring an additional employee to answer phones. Knowing every call will be answered 24/7 is HUGE in this day and age when everyone wants a response NOW. The management at SAS walked us through every scenario involved in a call; sends out follow-up emails to the caller depending upon specific information requests.  Best of all, every call is recorded so that we are able to check in and make sure everyone is on point at all times. I highly recommend Specialty Answering Services!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Audrey Brunk Budig",
          "Nb_Reviews": 3,
          "Date": "2023-09-29T19:31:16.000Z",
          "Titre": "Helpdesk is Superb!",
          "Contenu": "We are newer clients, SAS helpdesk has walked us through making script changes and provided helpful suggestions. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RD's Total Lawn",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T13:00:49.000Z",
          "Titre": "I have used this company for my…landscaping business",
          "Contenu": "I have used this company for my business for multiple years. Having a service like this is a game changer and this company has stepped up and improved over time. They also do a good job checking in with you to make sure things are operating smoothly and will adapt when you notify them of any issues. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael McKown",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T03:31:08.000Z",
          "Titre": "Who could ask for more?",
          "Contenu": "SAS is client focused and is eager to present a positive face to callers, on behalf of the client. The salesperson (Kathy) I dealt with was able to answer technical questions and guided me through the process. I'm probably not the client likely to use common scripts found with these services. I'm a writer and editor at heart and I've been in business for a long time. I know what works for me. Once I understood the process, I wrote the if/then scripts and handed them off for inclusion on my account. Their phone-answering people have executed these scripts professionally with just slight informality, and with precision. I'm happy.  :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Life Is Good",
          "Nb_Reviews": 2,
          "Date": "2021-08-26T15:04:43.000Z",
          "Titre": "Specialty Answering Service is top notch!",
          "Contenu": "Specialty Answering Services has always impressed me. They are professional, courteous, and have lightning-fast response times to any issues I have ever had, day or night. As we all know in business, sometimes our phones don't stop ringing after hours. With SAS - I don't have to worry about my customers being taken care of, SAS has it covered!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Kelley",
          "Nb_Reviews": 1,
          "Date": "2022-10-01T16:33:36.000Z",
          "Titre": "SAS…Put it on your short list",
          "Contenu": "Looked at many options and chose SAS based on price, flexibility, and the fact that they built and manage their own platform as opposed to white labeling someone else's. Support during call flow setup was super responsive and very knowledgeable. Highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tonya - Value Add Contracting",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T01:41:10.000Z",
          "Titre": "Definitely Recommend SAS...",
          "Contenu": "SAS has been great in handling our after-hours calls and ensuring that the proper channels are followed to get our maintenance team informed and on the way to help tenants in emergency situations. Their support team answers promptly and is always very helpful and polite. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Scott H",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T21:01:03.000Z",
          "Titre": "Great Service, Best support",
          "Contenu": "Top notch support when you need it. They are upgrading their services and investing in their customer's success. As a Technical leader working in the Support industry, I give SAS top praise for the team they (thanks again Sheila!) put together and the products they are supporting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Verna Jones",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T21:45:43.000Z",
          "Titre": "Great customer support is rare nowadays",
          "Contenu": "The real estate company I work for is using SAS for their answering service.  Everyone has been extremely helpful, courteous, and knowledgeable on any questions I've had or help needed.  The transition has been simple and SAS has a very user friendly website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cathleen Hines",
          "Nb_Reviews": 2,
          "Date": "2023-01-25T21:34:50.000Z",
          "Titre": "Specialty Answering Service has…amazing, \"old school\" customer service.  I highly recommend them!",
          "Contenu": "Specialty Answering Service has amazing, old school customer service.  I worked with Jessica on making adjustments to my account.  She responded to all of my requests promptly, thoroughly, and I felt like she had a smile on her face.  I would highly recommend SAS, and I also know that when my customers call in they are receiving the same high level of service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sage Sylvia",
          "Nb_Reviews": 1,
          "Date": "2022-08-31T22:20:36.000Z",
          "Titre": "Amazing Support Team",
          "Contenu": "Intelligent, kind & fast customer support team! Anytime I've had a problem (or even a minor inconvenience) their response time has been within same day and they have gone above what I would normally expect to help me with my requests. Sheila F. in particular has been an amazingly attentive and helpful support person for me to work with!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet C.",
          "Nb_Reviews": 2,
          "Date": "2023-02-02T19:51:50.000Z",
          "Titre": "Gabe with Specialty Answering Service is awesome!…",
          "Contenu": "Gabe with Specialty Answering Service carefully listened to my concern, and he was able to offer an immediately solution to prevent it from occurring again.  I also presented Gabe with a IT quandary, and he again listened carefully to fully understand my issue.  Within 10 minutes he had a solution and completed 2 test calls.  It was a pleasure working with Gabe.  Thank you for your time and knowledge of the SAS system."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Jeffcoat",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T15:02:25.000Z",
          "Titre": "Quick and easy resolutions and answers…",
          "Contenu": "Quick and easy resolutions and answers to my questions and concerns!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane Lee",
          "Nb_Reviews": 1,
          "Date": "2022-09-26T22:19:56.000Z",
          "Titre": "EXCELLENT SERVICE",
          "Contenu": "I can't put into words how helpful this answering service is. Jessica R. has walked me through the process and if I need anything she is always available. Highly recommend Specialty Answering Service. Diane LeeOwner Family First Cremation Services"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack Silvestre",
          "Nb_Reviews": 2,
          "Date": "2022-03-03T01:27:31.000Z",
          "Titre": "I've been using SAS for a few years…",
          "Contenu": "I've been using SAS for a few years now.  First as a solo-practitioner doctor.  And now as a solo-practitioner lawyer.  Every missed phone call is a \"missed business\" opportunity.  New clients normally will not leave a \"voice message\" when nobody answers the call- they will move on to the next one on the list.  For a fraction of a cost, you get 24/7 live answering service with SAS which will immediately notify you by text and email that you have customer.  It's a valuable investment and even more so in these COVID times where a lot of businesses are operating from their homes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T17:23:31.000Z",
          "Titre": "Consistent Excellent Service",
          "Contenu": "We have used Specialty Answering Service for a long time.  Every time I need assistance, whether it's an update to my account or asking for help with calls received, I'm always struck by how responsive and helpful SAS is.  The customer service is CONSISTENTLY OUTSTANDING.  Much appreciated, SAS!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denise P.",
          "Nb_Reviews": 2,
          "Date": "2023-06-21T20:45:16.000Z",
          "Titre": "SAS provides fast, efficient customer service",
          "Contenu": "SAS provides fast customer service, no waiting on hold and they resolve your issues promptly, in a friendly manner and it gets handled right the first time around. Happy with the service we receive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cynthia Robbins N",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T21:09:33.000Z",
          "Titre": "Gabe was prompt and efficient",
          "Contenu": "Gabe was prompt and efficient!  A pleasant surprise on how quickly Gabe managed the issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shanti Gonzales",
          "Nb_Reviews": 1,
          "Date": "2021-10-28T16:16:04.000Z",
          "Titre": "Beyond Customer Service",
          "Contenu": "The customer service at SAS is ALWAYS on point! A real person answers the phone. Representatives are knowledgeable, patient, and provide options for resolving the issue. Even though the issue was an oversight on our end, SAS was exceedingly gracious in providing us exactly what we needed to get everything resolved, at no additional cost. Impressive.Thank you!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nichola Lembergs",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T17:06:34.000Z",
          "Titre": "Great company",
          "Contenu": "Great company! Very thorough in getting details of what the customer needed from us. Timely messages send next business day. Would highly recommend to anyone in need of an answering service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brittney B",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T21:31:13.000Z",
          "Titre": "Small Business Needs",
          "Contenu": "As a small business in CA, SAS has been meeting all of our needs. We are an Elevator company with 24/7 phone-line needs. Not only is the staff very communicative; they are professional and want to make their customers happy. We will continue to use their service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Innovative Therapeutic Solutio",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T04:33:14.000Z",
          "Titre": "5 Stars ++++++ This is absolutely the…",
          "Contenu": "5 Stars ++++++ This is absolutely the best Answering Service hands down!  Great customer service.  Representatives are very patient and help you write scripts, create content and provide amazing guidance to allow your company to grow. They have LIVE representatives that answer calls, take message, schedule appointments and even call callers back that hang-up!   Kaila, hand's down, is the best!  She exemplifies professionalism and class.  Please choose them for your answering service needs for your company.Respectfully Submitted,Tasha L. WilliamsExecutive Director Innovative Therapeutic Solutions, LLC"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paige Shue",
          "Nb_Reviews": 1,
          "Date": "2021-02-10T19:31:40.000Z",
          "Titre": "So thankful for SAS!",
          "Contenu": "So thankful for SAS!! As a small business owner I was spending most of my time answering the phone. Now I am able to work on other aspects to help us grow even more. They have been ANGELS (Especially Courtney P.) helping us get our script perfect to properly set up our customers expectations. If you're like me and are tired of answering your phone at 8pm, please give them a try, you won't regret it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denise Johnson",
          "Nb_Reviews": 2,
          "Date": "2021-06-11T17:35:28.000Z",
          "Titre": "Afterhours and overflow calls",
          "Contenu": "The Specialty Answering Service handles overflow calls and after-hour calls to our IT support center.  Their staff are friendly and efficient.  Takes the pressure off the Support Team during busy times and provides our staff with someone to take their calls during the weekends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T17:47:28.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Danielle V from customer service was very quick to respond to my email (within minutes!) and solved my problem right away. When I had a follow-up question a few days later, she again quickly attended to my question. SAS is great and so is the customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jayne Johhnson",
          "Nb_Reviews": 1,
          "Date": "2022-01-14T21:48:23.000Z",
          "Titre": "Specialty answering service has been…",
          "Contenu": "Specialty answering service has been great for us as a small business. An actual human answers the phone, takes a message and sengs it to us via email. We can recall the customer at our convenience and know what they are asking so we can be helpful on the call."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Coren",
          "Nb_Reviews": 1,
          "Date": "2021-03-19T18:48:35.000Z",
          "Titre": "They always pick up on only few rings.",
          "Contenu": "They always pick up on only few rings.Treat the customers respectfully, makingsure they have certainty before finishing call.Just like i train my staff to do,you can feel comfortable knowing your customersare in caring hands and will be well served!Andrew CorenCEONew York Connect"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Raab",
          "Nb_Reviews": 2,
          "Date": "2021-12-02T19:03:41.000Z",
          "Titre": "THE BEST",
          "Contenu": "First off let me just say these guys are the best!! Our charity started using SAS when our other vendors could not handle the call volume, we had terrible long wait times and worse a lot of mistakes being made, BUT thanks to SAS all that is a thing of the past, my charity simply could not offer our services to our donors, volunteers, and our supporters with out them. We have great service, awesome operators that really care and most importantly we get so much good feedback about the calls. If you want top notch service we can not recommend them enough. Even for our Hour long telethon specials, thousands of calls it simple is no problem and my favorite thing about it all is that their staff is so east to work with and always is able to make adjustments whenever we need them! 5 Stars all the way!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron Stroud",
          "Nb_Reviews": 1,
          "Date": "2021-04-27T17:14:31.000Z",
          "Titre": "We use SAS to manage our after hour…",
          "Contenu": "We use SAS to manage our after hour calls (emergency calls), they are very helpful and responsive when needed, I have spoken with Mollie in the past and recently spoke with Kaila H, she answered all my questions and gave all the info I needed with each answer. Couldnt be happier with my experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Grossman Dermatology",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T01:00:15.000Z",
          "Titre": "Jessica R.",
          "Contenu": "Jessica was friendly, respectful to my concerns and helped me accomplish my needs.  She responds to my emails pretty fast and makes me feel acknowledged before helping me with any issue I may have.Thank you, Jessica!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eunice Mathis, MSN, RN",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T21:27:49.000Z",
          "Titre": "Our business has grown since partnering…",
          "Contenu": "Our business has grown since partnering with Specialty Answering Service as our remote receptionist. They do an awesome job with taking and delivering our messages so that we can focus on our customers and teaching our classes. I highly recommend SAS. I have used other companies and SAS has the best rates without surprise charges."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Haberdash",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T02:26:02.000Z",
          "Titre": "So glad we switched to SAS",
          "Contenu": "We switched to SAS after years with another answering service and it is light years better. You can listen to every call, their messages are complete with good email addresses and phone numbers (unlike our previous service which often misspelled emails and names and didn't get the numbers correct), they have an option to answer with a recorded message and select 1 to speak with a receptionist - that alone has cut our solicitation calls in half. We are so pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gianna P.",
          "Nb_Reviews": 1,
          "Date": "2021-10-28T18:04:02.000Z",
          "Titre": "Great Service",
          "Contenu": "Great Service! Jessica R. recently assisted me with an issue I was having setting up my on-call schedule. I reached out via email and received a call not long after. She was quick to respond and very friendly over the phone. Really appreciate the readiness to help out a customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thank you",
          "Nb_Reviews": 1,
          "Date": "2022-03-01T23:31:20.000Z",
          "Titre": "Worry Free & Stress Free",
          "Contenu": "I have only been working with Specialty Answering Service for a few months, which I have had the best customer service in a long time.  They actual listen to concerns and will follow up regardless of how small the inquiry may be.  5 stars is not enough for the peace of mind I have with their service.  Worry free and stress free, pricing is very good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katrina Coleman",
          "Nb_Reviews": 4,
          "Date": "2023-07-25T00:32:19.000Z",
          "Titre": "I love SAS services",
          "Contenu": "I love SAS services. They do an amazing job in answering the calls for my business. I am so glad we chose SAS as our virtual receptionist."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica Davis",
          "Nb_Reviews": 1,
          "Date": "2022-01-27T22:11:33.000Z",
          "Titre": "I have been truly impressed...",
          "Contenu": "I have been truly impressed by this organization, specifically Sam! He responds quickly, answers my questions, and is always willing to help.  The answering service has made it so much easier and is saving me money with not having to hire an admin at this time.  I truly appreciate their work ethic and commitment to quality service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andie",
          "Nb_Reviews": 2,
          "Date": "2022-05-13T23:06:21.000Z",
          "Titre": "Wonderful Service!",
          "Contenu": "We have been happy with the services of  SAS and have used them for a number of years. It’s an extremely helpful part of our business to have these professionals answering our phones as we are at tutoring service and can often times be tied up with students during the day and cannot answer the phone at that time. They are communicative with customer service and work to answer any questions we have. We highly recommend them and thank them for streamlining our business to be more efficient!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John DeGirolamo",
          "Nb_Reviews": 2,
          "Date": "2022-12-31T01:18:22.000Z",
          "Titre": "SAS has brought a tremendous amount of…",
          "Contenu": "SAS has brought a tremendous amount of value to my business. I use the answering and calendaring service, and it is seamless. I can honestly say it has helped with the conversion of the leads my marketing team works hard to get."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara",
          "Nb_Reviews": 1,
          "Date": "2022-02-04T22:59:00.000Z",
          "Titre": "Excellent Customer Support!",
          "Contenu": "I had a question about an overdue charge and as we worked through that, we discovered some other updates that were needed to my account.  The representative couldn't have been more friendly, helpful, or efficient.  It was just a great experience plus my issue was resolved!  Excellent customer support - thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benazir",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T18:20:21.000Z",
          "Titre": "Our Staffing agency has been using SAS…",
          "Contenu": "Our Staffing agency has been using SAS for a few years now and we are very satisfied with the service! Their team is very responsive and attentive. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Loyd Smith",
          "Nb_Reviews": 3,
          "Date": "2021-03-05T19:04:17.000Z",
          "Titre": "SAS saves the day for Water Utility.",
          "Contenu": "We are a Water and Wastewater Public Utility in Texas. We were hit by an unprecedented blizzard with snow, ice, and single digit temperatures.  We could not get to our office, and power was out for extended periods. SAS, who normally answers our phones nights and weekends, picked up 24/7 coverage immediately with no notice. We were all on call 24/7 for the better part of a week, and the fact that SAS could answer our phones for us 24 hour really saved the day for our employees and customers.SAS  personnel would immediately ask any callers if it was an emergency, and those that answered yes were hooked up with our on-call folks and most were visited by one of our team in less than an hour. This was critical, as we were dealing with frozen pipes, flooding, and all sorts of other issues during an unusual event like this.  With over 4,200 customers, one can only imagine how many calls SAS handled for us.Many thanks to all of the SAS team for helping us in this emergency! Our loyalty to SAS is huge!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adrian",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T22:54:58.000Z",
          "Titre": "Jessica R provided excellent customer…",
          "Contenu": "Jessica R provided excellent customer service. She was a great listener and solved my many issues. I highly recommend SAS as a total solution to any small, medium, or large business!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JL",
          "Nb_Reviews": 3,
          "Date": "2022-01-13T23:47:59.000Z",
          "Titre": "I can't run my business w/o SAS",
          "Contenu": "I can't run my business w/o SAS. It's impossible for me to speak to two clients at the same time, and SAS has never let me down.My calls are answered professionally, the client is helped if possible and if not, a detailed message is taken. The biggest help to me, is being able to listen to the conversation after the caller has hung up.In a world where we are being pushed to our limit to hold on....I am truly thankful that they are showing up....they ARE essential to me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katie St. Clair",
          "Nb_Reviews": 1,
          "Date": "2021-05-18T16:55:49.000Z",
          "Titre": "Our secret weapon for after-hours customer service",
          "Contenu": "SAS has filled in a big gap for us by providing humans for our customers to talk to when we aren't in the office, rather than an answering machine. It's such a step up for our customer service, and incredibly affordable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T19:41:53.000Z",
          "Titre": "Great service!",
          "Contenu": "Mollie was a pleasure to speak with and answered all of my questions. We've been very happy with our service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keisha Holcombe",
          "Nb_Reviews": 3,
          "Date": "2023-04-03T13:51:16.000Z",
          "Titre": "Specialty Answering Service is the…",
          "Contenu": "Specialty Answering Service is the best! I have been using their services for a while now and I am very impressed. Their team is professional, friendly, and always willing to go the extra mile to help. The customer service is outstanding and they really take the time to understand my business needs.Their call handling services are top-notch, and I have received numerous compliments from my clients on how well their calls were handled. The technology they use is cutting-edge and reliable, and the pricing is very competitive. I also love the fact that they offer a wide range of services to choose from, so I can customize my plan to fit my business needs.Overall, I highly recommend Specialty Answering Service to anyone looking for a reliable and professional answering service. They truly are the best in the business!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kay Rowe",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T17:44:18.000Z",
          "Titre": "We had a single mishandled call that I…",
          "Contenu": "We had a single mishandled call that I reported.  It was researched and determined that the call taker needed additional training which was provided one on one.  I like the fact that this company takes it's customer service seriously and helps their employees to provide that service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Austin Metro Plumbing LLC",
          "Nb_Reviews": 1,
          "Date": "2021-11-10T22:52:57.000Z",
          "Titre": "Super customer service",
          "Contenu": "Our company has some pretty unique needs as far as scheduling and time slots.  Kelly and Chris have helped fine tune everything so well that I wish we would have found them sooner.  Great proactive customer service and follow up"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tasha Jones",
          "Nb_Reviews": 3,
          "Date": "2022-12-02T20:50:20.000Z",
          "Titre": "Extremely Helpful and Cost Efficient",
          "Contenu": "SAS is a unique and helpful software. They have many customizable options. My favorite is their customer service. They have the strongest customer service team I have ever worked with. Customer service is a lost art but SAS has nailed it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michele",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T19:01:51.000Z",
          "Titre": "Kelly was fantastic",
          "Contenu": "Kelly was fantastic.  Came up with a great solution to a question the operators were having about communicating our services to patients.  Added our website URL to messages from new patients - looking forward to seeing how much this helps!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oceans Mortgage",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T22:48:59.000Z",
          "Titre": "We have used Specialty Answering…",
          "Contenu": "We have used Specialty Answering Service (SAS) for years! As a small business owner its saved me a lot of money by alleviating  the need for a dedicated receptionist! Thanks SAS"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denise P.",
          "Nb_Reviews": 2,
          "Date": "2023-05-15T23:14:07.000Z",
          "Titre": "SAS customer service provided by…Courtney C",
          "Contenu": "SAS customer service provided by Courtney has made managing our account easy and painless. We are very happy with the services we have received."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda A",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T20:12:17.000Z",
          "Titre": "True partner for business",
          "Contenu": "I was looking for a local call-answering service to help our small business agency with after-hours calls, and stumbled across SAS in a Google search. I scheduled a demo consultation and was impressed with what I heard and saw, so I quickly agreed to a risk-free trial.They built a call script for me, but because of how hands-on I am, I went into the admin portal and edited it quite a bit to fit what I was envisioning. They provided me with help all along the way to make sure I was understanding what to do.We've now had SAS implemented for almost 4 months now, and I am continually impressed with the courteousness of the operators, the ease of getting my questions answered, and the flexibility that the SAS admin portal gives me. Any issues I've encountered have been easily addressed by tweaking the call scripts to make sure the operators know what to say.It has taken such a load off of us to know that our clients who call after-hours are being given correct information by a friendly live representative. I also love that our account rep Mollie checks in with me here and there to make sure I'm up-to-date on all the features in the portal. It feels rare to find a company that truly is a partner in business, but SAS is one of those rare finds."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fresh Air",
          "Nb_Reviews": 1,
          "Date": "2022-10-10T18:20:15.000Z",
          "Titre": "SAS was the answer to my prayers",
          "Contenu": "SAS was the answer to my prayers. I've been looking for a reliable answering service for over a year now and none of the others I have tried even come close to SAS. Sam Z was able to give me a demo the same day I requested info and he was fantastic. He was so thorough and responded to all the specific needs my business has. Sam walked me through set up and made sure everything was perfect before we went live. The agents are great! Awesome customer service and they do not sound like a call center in another country. The website allows you to rate each call so they can use that feedback to build. I can customize the script the agents use and provide them with FAQ's and easy to access info to make it a seamless call. I cannot thank Sam enough for all the help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy Sawyer",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T19:50:33.000Z",
          "Titre": "SAS has been super to work with",
          "Contenu": "SAS has been super to work with. Everytime I need assistance they are quick to help. The call center has been extremely helpful to our business so we don't miss those important calls after hours."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John L Simpson Co., Inc.",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T18:46:53.000Z",
          "Titre": "They are friendly and efficient",
          "Contenu": "They are friendly and efficient.  We receive our messages within seconds after our customers leave a message for us.  Would recommend to anyone who needs an answering service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M. Marsh",
          "Nb_Reviews": 2,
          "Date": "2021-03-17T16:36:36.000Z",
          "Titre": "Very attentive to our needs during…",
          "Contenu": "Specialty Answering Service has been very attentive to our needs during COVID and we will continue to have them answering our calls in the future.  The operators are friendly and helpful and the tech staff is very attentive in the event of a glitch.  We couldn't be happpier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Summit Vacations",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T17:21:32.000Z",
          "Titre": "Summit Vacations Recommends",
          "Contenu": "We use this company for our Summit Vacations property management company,. They are very responsive and quickly communicate with our requests. We highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tulia",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T00:32:54.000Z",
          "Titre": "This company is amazing!!!",
          "Contenu": "This company is amazing! They have great customer service! I highly recommend it! I personally had the pleasure of speaking to Gabe, and he answered all my questions and was able to resolve my issues. I give them 5 stars!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AA",
          "Nb_Reviews": 1,
          "Date": "2022-03-04T20:11:18.000Z",
          "Titre": "Wonderful customer & technical support",
          "Contenu": "Wonderful, dependable customer and technical support. They went above and beyond in help, and solved our issues quickly. We were also provided additional support links in case we had additional questions at a later time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Sparanges",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T22:30:11.000Z",
          "Titre": "Prompt and Professional",
          "Contenu": "Sheila at SAS answered my questions promptly and in detail. Customer needed details on actions taken place from a critical alert."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael E. Cherry",
          "Nb_Reviews": 1,
          "Date": "2021-07-20T20:40:57.000Z",
          "Titre": "Super responsive and very friendly…",
          "Contenu": "Super responsive and very friendly professional service. My request was handled with upmost care and speed. We have used this service for many years and remain very pleased. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan Barrios",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T01:25:16.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "We've used this service for about three years ans their customer service team is excellent. If you are looking for an answering service give them a try."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Loyd Smith",
          "Nb_Reviews": 3,
          "Date": "2022-03-21T20:26:49.000Z",
          "Titre": "SAS to the Rescue; Unexpected Storm Forced Closure",
          "Contenu": "We had an unexpected storm and had to close the office.  I contacted SAS less than 30 minutes before we closed, and they had our message changed in time.  That is great response in our time of need!A big thank you to the organization and the staff!"
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Kobi Z",
          "Nb_Reviews": 1,
          "Date": "2022-01-13T21:00:40.000Z",
          "Titre": "I would definitely recommend",
          "Contenu": "After checking almost every answering service out there - SAS is by far the most professional and user friendly. Thier service is amazing thanks to representatives like George N that took great care of us. I would definitely recommend them to anyone looking for an answering service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Wagner",
          "Nb_Reviews": 3,
          "Date": "2023-05-22T23:18:50.000Z",
          "Titre": "Always so helpful and quick to respond…",
          "Contenu": "Always so helpful and quick to respond to all my questions or concerns. Courtney was and always is amazing at taking care of things!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Schultz",
          "Nb_Reviews": 1,
          "Date": "2021-01-28T20:05:32.000Z",
          "Titre": "We switched to Specialty Answering…",
          "Contenu": "We switched to Specialty Answering Service after discovering that our previous service was not answering calls in a timely fashion and sometimes not answering at all.  I've now worked with their sales, support, and billing teams and all have been truly professional.  The call answering is excellent as well!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristal Ortiz",
          "Nb_Reviews": 1,
          "Date": "2021-06-28T13:55:27.000Z",
          "Titre": "Great customer service",
          "Contenu": "Had to close the office outside of our normal business hours and SAS made it very easy with their great customer service reps. Appreciate the help given and would recommend them!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tugba Dane",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T08:21:53.000Z",
          "Titre": "Great company to work with",
          "Contenu": "I discovered SAS couple years ago when I was unhappy working with another answering service company. I talked to many answering service companies until then. They were either too expensive or they were not well established. When I called SAS, they took time to understand my needs and were quick to setup my account with my custom questions. Their pricing plans are very reasonable. All calls are tracked and reps who are answering the calls are very professional. After working with SAS about a year, I had to take a break for family reasons. Couple months ago, I resumed my business and called SAS right back! I am a returning customer and very pleased with them. I was up and running in one day and my calls were getting answered.Beside their professionalism, they have a great call tracking system.  It is easy to navigate, easy to customize and it even integrates with 3rd party applications which I love using it! I recommend SAS to anyone who is looking for a professional, knowledgeable, friendly, and effective answering service company. I want SAS to be the #1 answering service company because they deserve it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cool Customer",
          "Nb_Reviews": 7,
          "Date": "2021-07-27T01:05:57.000Z",
          "Titre": "SAS has been amazing for our business",
          "Contenu": "SAS has been a huge help for my business so far. So far, the best answering service prices and customer experiences. Very pleased and strongly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Misbah Arshad",
          "Nb_Reviews": 1,
          "Date": "2021-09-07T15:38:02.000Z",
          "Titre": "Exceptional Service & Competitive Pricing",
          "Contenu": "Kaila H. and all team members I've encountered thus far have been absolutely great. I would not recommend another vendor.Thank you,Misbah"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kshanika",
          "Nb_Reviews": 4,
          "Date": "2022-07-20T15:27:22.000Z",
          "Titre": "Great service!",
          "Contenu": "My team and I had an issue with our script and worked with Danielle to resolve it - she was very helpful and followed up with us to make sure everything was working properly with our account!"
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Tsahi Goren",
          "Nb_Reviews": 1,
          "Date": "2020-12-16T15:09:32.000Z",
          "Titre": "Great service with a very attractive and flexible product",
          "Contenu": "Jessica was very helpful and immediately understood what we wanted. A few hours later and I had what I thought will take days to accomplish (if at all).If I knew it was that easy we would have done that long time ago."
        }
      ]
    }
  ]
}