{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "steals.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "anita urik",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T18:24:00.000Z",
          "Titre": "Sent incorrect size",
          "Contenu": "Sent incorrect size.  I ordered a size 12 you sent 0 for the size."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Janne Burgio",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T21:31:55.000Z",
          "Titre": "Poor follow-through from customer service",
          "Contenu": "With seconds of placing an order, I realized Apple Pay didn't have my new shipping address and I emailed it immediately to Steals customer service. I didn't receive a response until the next day and was told that the item had already been shipped and sorry, but it would go to my old address, nothing anybody could do. Now I see that the DHL label wasn't even created until today, two days later--very disappointed!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nancy Walther",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T16:34:18.000Z",
          "Titre": "I purchase a beautiful Vince Camuto women’s shirt from…",
          "Contenu": "I purchase a beautiful shirt from Steals.com by Vince Camuto.When I received the shirt it was crammed into an mailing envelope and so wrinkled. I paid 43.00 dollars for the shirt and the tag on the shirt was on clearance for 19.93!It is hard to believe this company would do such a thing, so beware if you purchase anything from this companyFOLLOWUP ON REVIEW: I received a refund after I sent a message and picture of the price tag! They did the right thing by refunding my purchase Thank you!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barbara Cherrix",
          "Nb_Reviews": 4,
          "Date": "2023-06-22T13:16:43.000Z",
          "Titre": "Warning: Company is offshore",
          "Contenu": "Warning: This company is not in the U. S. One easy way to tell is they ship DHL who only ship internationally. Once the package reaches the U. S., DHL, DHL hands the package off the either the USPS or another U. S. Delivery company. No signatures are required upon shipping, DHL's transfer to the US shipper... So you have to try to get info out of their tracking system."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Beverley",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T02:12:18.000Z",
          "Titre": "Order was a mess!",
          "Contenu": "My package arrived with clothing items stuffed in and wrinkled. There was no invoice in the package that I could find. One of the items was completely different for m what I ordered. It was a black blouse instead of a white one. Another item was a black skirt similar to what I ordered, but a different brand and style. Another package came with a dress I never ordered. It's crazy really!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Erin Norris",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T06:20:14.000Z",
          "Titre": "I still have NOT received the CREDIT for my return!!!…",
          "Contenu": "I still have NOT received the CREDIT for my return!!!!!  Even though I received an email notifying me that I will be refunded, the DEBIT was put through and NOT A CREDIT!!!!!!!  I need my REFUND IMMEDIATELY!!!!  I’m feeling that this is a scam website!!!  It took FOREVER to get concise instructions on how to do the return & now I have NOT BEEN CREDITED BACK!!!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Natalie Flitton",
          "Nb_Reviews": 2,
          "Date": "2023-06-20T17:15:53.000Z",
          "Titre": "Advertised buy one sweater get 2 free",
          "Contenu": "Advertised buy one sweater get 2 free. Went to check out and all 3 I picked out were sweaters but none qualified because one had buttons and one a zipper. Therefore they said they were not sweaters even though they were on the sweater racks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maria Burnham",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T14:48:46.000Z",
          "Titre": "The dress was to big I requested an…",
          "Contenu": "The dress was to big I requested an exchange or a refund and I got no reply. So I had to find another dress and I’m stuck with a dress that doesn’t fit me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rita Soodeen",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T17:41:23.000Z",
          "Titre": "i was told error with shipping and i…",
          "Contenu": "i was told error with shipping and i never did receive my item purchased. This was my very first purchase with Steals and unfortunately it didn't go as i expected."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Martha Dixon",
          "Nb_Reviews": 2,
          "Date": "2023-05-28T01:02:47.000Z",
          "Titre": "VERY VERY DISAPPOINTED under the impression that these…",
          "Contenu": "I was under the impression that these shoes were laced flats but when they arrived they are snake skin I Don’t wear snake anything. Very very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 9,
          "Date": "2023-05-10T21:17:34.000Z",
          "Titre": "Please be careful with this site",
          "Contenu": "Please be careful with this site.  The inventory is never correct.  Sometimes you recieve the item you order sometimes not, sometimes its the wrong size or even the wrong item"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sara S.",
          "Nb_Reviews": 2,
          "Date": "2023-05-08T20:21:16.000Z",
          "Titre": "This is a fraudulent site",
          "Contenu": "This is a fraudulent site. I received a random item label with an Alo Brand tag on it. I am reporting them to the Better Business Bureau. Do not order from here."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barbara Cherrix",
          "Nb_Reviews": 4,
          "Date": "2023-06-21T19:30:11.000Z",
          "Titre": "Package not yet received",
          "Contenu": "You're asking me to rate your performance when I've not yet even received my order. By the way, I only rate a seller when I feel they've earned it - not because they asked for one."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "VY",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T19:03:30.000Z",
          "Titre": "JUST TERRIBLE...",
          "Contenu": "Frequently sends wrong sizes, colors, and items. Terrible customer service that almost never even reads the emails I send and responds with something totally irrelevant."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cherie Shepherd",
          "Nb_Reviews": 3,
          "Date": "2023-06-30T01:12:36.000Z",
          "Titre": "We have been coming to this store since…",
          "Contenu": "We have been coming to this store since we found it. We loved it.    We loved the prices and the fact that the a lot of the merchandise came from Macys.Now the merchandise sucks.  Your selection was awful.It was the same crap  that was there the last time we were there.  Just a couple months ago.You have moved into a bigger store, but its not going to make any difference.  SO SO Sad. We were told it was under new management,  Again So Sad.My Neighbor started steals.com  this is a sad thing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 9,
          "Date": "2023-05-13T15:00:50.000Z",
          "Titre": "Be careful with this site",
          "Contenu": "Be careful with this site.  Inventory is not always accurate and at times you will receive damaged or even the wrong item"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mrs.Reilly",
          "Nb_Reviews": 4,
          "Date": "2023-06-07T23:29:04.000Z",
          "Titre": "I’ll stick with Amazon",
          "Contenu": "They sent me a gray top instead of a black one and it was advertised as black.They refunded my cost but not my $7.99  postage and I had to give the shirt away because it wasn’t anything I could use …so it was a total loss."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Natalie",
          "Nb_Reviews": 2,
          "Date": "2023-05-25T16:33:29.000Z",
          "Titre": "The 8 items I order none were in stock",
          "Contenu": "The 8 items I order none were in stock.  I got 3 emails. One said here your shipping number. The second said how did we do rate our service. The third said we refunded you all the items we don’t have any of the 8 different items you purchased"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Unhappy first time purchaser",
          "Nb_Reviews": 2,
          "Date": "2023-05-23T22:46:47.000Z",
          "Titre": "If I could give a zero I would.",
          "Contenu": "If I could give a zero I would.The order that was originally \"confirmed\" suddenly was not able to fulfill the main item that I ordered.And they suggest the rest of the order was not able to be cancelled.  Don't order if your really need the items."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 9,
          "Date": "2023-05-10T23:56:19.000Z",
          "Titre": "I would not recommend this site",
          "Contenu": "I would not recommend this site.  They continually have inventory issues and at times have sent damaged and wrong items"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 9,
          "Date": "2023-05-15T20:16:04.000Z",
          "Titre": "Be careful of this site",
          "Contenu": "Be careful of this site.  Inventory is rarely updated and at times you will receive damaged goods."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patricia Lewis",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T04:33:45.000Z",
          "Titre": "Buyers please beware.",
          "Contenu": "Absolutely horrendous first time shopping experience, I paid for a dress that was supposed to be brand new and what I received was the exact opposite, human hair animal hair, glitter, fuzz, lint, severe fraying all over entire black sweater dress, wadded up in shipping bag, no separate bag of it's own, mild musky odor and I have multiple pictures to back up my experience which I have already sent and was given a very empty apology with the offer of a partial refund. I could care less about the money, what I care about is this company misleading it's customers, lying and then trying to down play their knowledge of tattered items being sent out. I am absolutely appalled at their business practices and will never shop with this company again. I will share my pictures and make sure that this company is exposed for being very fraudulent. There is literally zero excuse for sending out used, old items and pretending to be oblivious to that fact."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Janet Allen",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T20:31:53.000Z",
          "Titre": "Horrible experience!",
          "Contenu": "Horrible experience!! I ordered blue Steve Madden boots and was sent brown cheap boots that was not Steve Madden! Still trying to get full refund!!Boots came in a bag not a box. SHAME ON YOU!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ray L. Lovel",
          "Nb_Reviews": 4,
          "Date": "2023-04-14T23:54:43.000Z",
          "Titre": "Communication is what went wrong",
          "Contenu": "Communication is what went wrong. The Order said petite x1. Not Size 12. From now on, I will order from Walmart."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cherie Shepherd",
          "Nb_Reviews": 3,
          "Date": "2023-10-02T18:13:59.000Z",
          "Titre": "You have nothing worth anything",
          "Contenu": "You have nothing worth anything.  You moved the store changed stuff  and it wasn't for the better"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 9,
          "Date": "2023-05-18T05:44:49.000Z",
          "Titre": "be cautious of this site",
          "Contenu": "be cautious of this site.  inventory is not updated and you may never get what you order"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "fae",
          "Nb_Reviews": 3,
          "Date": "2023-09-23T23:42:28.000Z",
          "Titre": "I hate having to do this survey before…",
          "Contenu": "I hate having to do this survey before I can get my receipt"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 9,
          "Date": "2023-05-10T15:04:10.000Z",
          "Titre": "Be careful when ordering from this…",
          "Contenu": "Be careful when ordering from this site.  The inventory is not up to date and you may be buying items that are truly not in stock.  It a hassle to shop with them"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "karen crawford",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T02:25:51.000Z",
          "Titre": "Wrong item sent",
          "Contenu": "Dress was supposed to be blue but a weird flesh colored dress showed up. I have sent it back for return but still have not received a refund. Very unhappy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-06-22T04:00:21.000Z",
          "Titre": "Do not buy from this company",
          "Contenu": "Do not buy from this company! The prices are cheap but quality control is non existent. I ordered 30 ties, the stuffed them in a single bag and they showed up wrinkled. Why would you do that?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nope",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T00:29:18.000Z",
          "Titre": "Refused delivery of my return so the…",
          "Contenu": "Refused delivery of my return so the USPS just disposed of it. I am out that money. What a crock"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Unhappy first time purchaser",
          "Nb_Reviews": 2,
          "Date": "2023-06-07T00:42:15.000Z",
          "Titre": "Waiting for refund as nothing was…",
          "Contenu": "Waiting for refund as nothing was received- completely disappointedreceived an email that the refund will be processed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joy Chastek",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T04:51:23.000Z",
          "Titre": "No return information",
          "Contenu": "No return information.  Purchasd item is too small!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Natalie",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T03:22:48.000Z",
          "Titre": "Expect me to pay to fix their mistake",
          "Contenu": "They sent me the wrong product, have no phone customer service, and their email customer service insists that I have to pay for return shipping myself to fix their error… I’ll be disputing the credit card charge because these people are either incompetent or scam artists"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julie Scovil",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T04:38:26.000Z",
          "Titre": "Store originally carried alot of Macys…",
          "Contenu": "Store originally carried alot of Macys product. Inventory is different and mistly winter apparel."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jill McAuley",
          "Nb_Reviews": 4,
          "Date": "2023-06-19T23:14:32.000Z",
          "Titre": "Because I was charged 3 times for 1…",
          "Contenu": "Because I was charged 3 times for 1 dress that was a total including tax $58.40. I was charged that twice and $66.80 once.  please credit my account back or I will have to dispute the charges.Thank you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Danny Seeger",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T05:57:12.000Z",
          "Titre": "Sent the wrong size",
          "Contenu": "Sent the wrong size.  Order was for 29 was sent 33, then when I initiated return they were out of 29.😫"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patricia Schatner",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T17:58:31.000Z",
          "Titre": "Very small",
          "Contenu": "Very small, material not giving, too short, too small"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MMerchen",
          "Nb_Reviews": 2,
          "Date": "2023-06-24T17:16:46.000Z",
          "Titre": "Wrong size received",
          "Contenu": "Wrong size received.  Return process is not easy to navigate"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rose Halfmann",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T04:23:59.000Z",
          "Titre": "I received an item that was the wrong…",
          "Contenu": "I received an item that was the wrong color, and now I cannot return it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ellen Graham",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T22:29:34.000Z",
          "Titre": "The wrong item was shipped",
          "Contenu": "The wrong item was shipped.  Not only was the item wrong, the size was wrong.  Trying to work with the company to get a full refund.  They want to send a gift card and I just want my $$ back, no gift card."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "tom kros",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T21:26:24.000Z",
          "Titre": "Cancelled I item in my order a day…",
          "Contenu": "Cancelled I item in my order a day after I ordered it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Valentina Poleva",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T15:10:58.000Z",
          "Titre": "I can’t return one thing",
          "Contenu": "I can’t return one thing. I can’t find any way to do it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 9,
          "Date": "2023-08-28T21:00:35.000Z",
          "Titre": "Never have anything in stock"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SEA",
          "Nb_Reviews": 2,
          "Date": "2023-08-05T23:49:38.000Z",
          "Titre": "customer service",
          "Contenu": "I tried to contact customer service, but nobody responded"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "judy",
          "Nb_Reviews": 2,
          "Date": "2023-05-25T04:38:25.000Z",
          "Titre": "Got item damaged and not in good…",
          "Contenu": "Got item damaged and not in good shipping box"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sharlene Urban",
          "Nb_Reviews": 9,
          "Date": "2023-03-13T21:02:25.000Z",
          "Titre": "Received damage merchandise",
          "Contenu": "Received damage merchandise, also looked used.Very disappointed in quality control."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Merlin Pitts",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T20:40:41.000Z",
          "Titre": "Hat came to all bented in and out of…",
          "Contenu": "Hat came to all bented in and out of shape"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Holly Chambliss",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T00:43:56.000Z",
          "Titre": "I haven’t received them yet"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 9,
          "Date": "2023-06-05T21:38:34.000Z",
          "Titre": "Again wrong size shipped"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sharlene Urban",
          "Nb_Reviews": 9,
          "Date": "2023-03-13T18:44:59.000Z",
          "Titre": "Sent damaged merchandise"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Teresa Warwood",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T00:29:05.000Z",
          "Titre": "Service is going downhill now as Tuesday morning, and Under New Management…",
          "Contenu": "Steals.com used to be my favorite place to shop with great deals and service. All shoes were $15. It was awesome! I just visited Tuesday Morning, which is an old brand but now the new steals.com. Service was fair to poor, three employees seem to be gossiping about a fourth employee. Their energy was obvious. They also were not helpful as they or busy chatting amongst themselves. Employees at the previous locations seem to always be informative and helpful. The shoes are different prices now, some of them quite pricey and I would do better at Nordstrom's Rack or Dillard's sales. They would not let me hold anything to run to an appointment and put all of my items back. It took me over 30 minutes to try to find the items again when I returned. At the old store you could hold things till the end of the day. There's also no longer discounts if you buy $100 worth of merchandise, and there are no returns with no exceptions. We used to be able to at least exchange an item. Having a no return policy keeps me from doing Christmas shopping or buying anything for my family there. I have bought over 100 pairs of shoes in the past for myself and my family, as well as hundreds of dollars and other items every few months. Not to mention I've referred at least 15 people there to do the same. The management needs to take a look at their new policies, as they are not in the favor of the consumer. These changes are all very disappointing. My favorite place to shop has now turned into some place I will not shop."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Delores Teklu",
          "Nb_Reviews": 3,
          "Date": "2023-12-09T17:17:37.000Z",
          "Titre": "The site would not let me complete my…",
          "Contenu": "The site would not let me complete my order. It said it did not deliver to my address. I have purchased several times before with no problems. I had to buy my items in four separate orders through FaceBook to complete. This made me lose out on the 25% discount for $100 order. Customer service told me there's nothing they can do."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Unique69",
          "Nb_Reviews": 2,
          "Date": "2023-06-21T07:07:27.000Z",
          "Titre": "The jacket I received was not the same…",
          "Contenu": "The jacket I received was not the same design nor the same size as was advertised on the site, even though it was Michael Kors.  I had some difficulty with the return label and it was delayed for a few days.  It has been 4 business days since I mailed back the return, but I have not heard any confirmation from customer service nor received my refund. The other product was supposed to be leather and it was faux.  I didn't bother returning it. Just too much of a hassle."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "UVA",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T05:19:32.000Z",
          "Titre": "Items NOT Available…",
          "Contenu": "I was refunded for an item that I really wanted. I shouldn't have been able to check out if the item was no longer available (like on other websites). That gives a  false confirmation about the products on your website."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Deanna",
          "Nb_Reviews": 4,
          "Date": "2023-05-04T01:46:04.000Z",
          "Titre": "Well you should have opportunity to…please read this asap.",
          "Contenu": "Well you should have opportunity to choice a size that is for me ,  not that easy too find size in your site cause now I have to return the tee ,no customer service number .why is that?give more time too cancel the order. Iam very  much  disappointed now that I have too send the whole thing back. Thanks a lot of nothing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kristen Osiwala",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T15:06:27.000Z",
          "Titre": "Ordered a dress for a wedding and…",
          "Contenu": "Ordered a dress for a wedding and received the wrong size. The first dress that I ordered was cancelled and I found another dress and ordered in a size 6 and received a size 12"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SEA",
          "Nb_Reviews": 2,
          "Date": "2023-07-29T20:17:30.000Z",
          "Titre": "It is hard to get customer service"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Yovany Gutierrez",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T01:43:42.000Z",
          "Titre": "Dirty items",
          "Contenu": "Wrong items, defective and dirty items."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alex Litovsky",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:51:33.000Z",
          "Titre": "Bought an item but order was cancelled",
          "Contenu": "Update: Steals.com refunded the $2.98 as well. Updating the star rating.Bought a pair of Nike shoes and paid an extra $3.00 for \"Free & Easy Return for Refunds or Store Credit\". I guess if you don't pay the $3.00, you can't return the item?Several days later, received a notification that they are cancelling my order and refunding the purchase price. They didn't have the item in stock, but never updated their website. However, the $3.00 wasn't refunded, so they just took my order, cancelled it, and pocketed $3. The name of the website is accurate as a verb."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-11-25T03:42:44.000Z",
          "Titre": "Extremely slow shipping.",
          "Contenu": "Product reportedly shipped from Utah to Minnesota took 13 days to be delivered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amy B.",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T21:36:47.000Z",
          "Titre": "The sale was great but there were only…",
          "Contenu": "The sale was great but there were only two dressing rooms, no cart I could find with buckles to contain my toddler, and I didn't get a receipt even when I asked.  They said it would be sent my phone but I only got an email for a review instead."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gihan Ateia",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T14:18:59.000Z",
          "Titre": "I like Steals and how they provide…",
          "Contenu": "I like Steals and how they provide products at better prices however I've received wrong items multiple times. Also, I don't particularly appreciate how the clothes are carelessly folded and thrown all in one bag."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gemcat4",
          "Nb_Reviews": 5,
          "Date": "2023-04-13T05:34:35.000Z",
          "Titre": "Know the brand and item your buying",
          "Contenu": "I received one item that looked like a shirt and was advertised as a shirt but it’s a sweater. Also four items I bought are see through but there was no way from the pictures or description one could tell they were see through and will require a shirt under the shirt I thought I was buying."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Katie F",
          "Nb_Reviews": 3,
          "Date": "2023-04-23T17:54:41.000Z",
          "Titre": "I didn't have a great experience with…",
          "Contenu": "I didn't have a great experience with Steals. The dress I ordered came with large holes in the seam, and when I contacted customer service, they offered me a $15 refund and keep the item or a full refund less shipping and mail it back. It was frustrating to me that the company wouldn't cover return shipping for a damaged item. I did keep it and take the $15 refund, but that still didn't seem great considering what I paid and that I now have to repair it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GJ",
          "Nb_Reviews": 3,
          "Date": "2023-05-10T21:28:56.000Z",
          "Titre": "Items ordered not actually in stock",
          "Contenu": "My last 2 orders with Steals have been disappointing. One of two items on the first order wasn’t actually in stock. I found out in the way of an a-mail that informed me that I was receiving a refund for that purchase. It happened to me again on my latest order where 2 of the 4 items I ordered weren’t actually in stock. It’s a bummer, cause I really wanted the items ordered, versus a credit. This has not happened to me on any previous orders, so I’m not sure what is going on. Maybe they don’t have tight control over their inventory at present."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brent M",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T17:41:11.000Z",
          "Titre": "A good deal makes a fun browse",
          "Contenu": "A good deal makes a fun browse.  Some things you couldn't pay me to take, but otherwise, great selection of socks, ties, women's shoes.  My wife found two pairs for excellent prices.  I bought a green screen for a fraction of retail value.  Fun place and willing to return."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Moody",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T02:25:52.000Z",
          "Titre": "I am still waiting for a refund for…",
          "Contenu": "I am still waiting for a refund for over two weeks ago for an item that was out of stock and each time I'm told it was refunded and it hasn't shown up in my account."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shirley Vides",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T00:27:15.000Z",
          "Titre": "More details",
          "Contenu": "The items I purchased arrived promptly, but the sizes were all different. Some were loose and some were tight even though I ordered the same size for all of them.I would also like more details on the description such as what material the item is made of and a size chartM"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nicole Soto",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T14:49:57.000Z",
          "Titre": "I would prefer to skip this opinion",
          "Contenu": "I was in the store and they didn't give me a discount for the clothes marked with color and I think that's dishonest. The guy who helped me didn't know how to handle his box"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Guadalupe Salazar",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T18:07:26.000Z",
          "Titre": "The color was wrong I asked for dark…",
          "Contenu": "The color was wrong I asked for dark blue not light blue and the material was very thick!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Julia Siik",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T06:55:39.000Z",
          "Titre": "Prices were good",
          "Contenu": "Prices were good, but 2 out of 3 dresses did not work & they don’t make it easy to return"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Samita Mahakul",
          "Nb_Reviews": 2,
          "Date": "2023-10-09T22:22:43.000Z",
          "Titre": "Return is complicated"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randy Turner",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T15:41:51.000Z",
          "Titre": "Very pleased with the quality of the…",
          "Contenu": "Very pleased with the quality of the socks I ordered"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelle W.",
          "Nb_Reviews": 7,
          "Date": "2023-05-20T07:13:38.000Z",
          "Titre": "Truly great “steals”",
          "Contenu": "I always find some amazing deals on Steals.com for brands I shop like Cece, Anne Klein, Tommy Hilfiger, and Nine West. However, you need to check regularly for new items, as quantities are limited at times. If they could improve anything, it would be photographs and descriptions. I’ve received a couple of orders in the wrong color, but they were quick to issue refunds after I sent photos. The fabric texture and added accents aren’t always visible or clear in photos either. For example, I ordered some plain navy blue pants for work  and when they arrived, the fabric had a waffle shaped texture to them. Not what i expected. I also ordered some other pants and didn’t realize they had gold accents on the bottom sides."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anne S",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T01:03:02.000Z",
          "Titre": "Very nice sweaters at a great price",
          "Contenu": "I purchased four sweaters that were delivered promptly, even more quickly than I expected! They arrived in good, brand-new condition, as advertised. If I could offer a bit of advice, though, I would suggest that the fulfillment center do a more professional job of packaging the merchandise. The sweaters were tossed unfolded and unwrapped in a plastic bag. This doesn’t affect their overall quality or wearability. The presentation was just not very professional."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jett",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T07:36:21.000Z",
          "Titre": "Name brand clothing at clearance prices",
          "Contenu": "You can find great deals on new clothing. Fitting rooms have been upgraded to actual rooms, they were previously made of fabric and very small with no chair. Down side is no returns. All sales are final."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susan Pritchard",
          "Nb_Reviews": 2,
          "Date": "2023-05-12T23:03:46.000Z",
          "Titre": "Outstanding Value and Service",
          "Contenu": "The quality and value can't be beat. My only suggestion is that when you cancel an order, you offer a 15-20% discount on the next purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cherie Shepherd",
          "Nb_Reviews": 3,
          "Date": "2023-04-28T22:56:36.000Z",
          "Titre": "It's always fun to go to Steals.com",
          "Contenu": "It's always fun to go to Steals.com.  The NO dressing rooms was a very big problem.  You should have made a bigger effort to get some decent ones built when you moved into that building."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sheila King",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T07:17:43.000Z",
          "Titre": "The jacket was not as what was expected…",
          "Contenu": "The jacket was not as what was expected but Steals took care of the  problem in a timely manner and the return system was easy to maneuver ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hilary B.",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T16:36:54.000Z",
          "Titre": "I would have given you the 5 star",
          "Contenu": "I would have given you the 5 star, but one my pants still has a security tag on it. So I have to come up and get that taken off.Prices are great, and selection is great as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CodyL",
          "Nb_Reviews": 2,
          "Date": "2023-06-18T03:01:16.000Z",
          "Titre": "Staff was great",
          "Contenu": "Staff was great. Very customer service oriented which is rare."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sally Jones",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T10:50:59.000Z",
          "Titre": "Just in time!",
          "Contenu": "The quality of the linen pants and the delivery time were good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "France Lebon",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T03:14:54.000Z",
          "Titre": "The experience was pretty good",
          "Contenu": "The experience was pretty good. Thank you 😊"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 2,
          "Date": "2023-04-08T00:14:36.000Z",
          "Titre": "ease of shopping at home"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Samita Mahakul",
          "Nb_Reviews": 2,
          "Date": "2023-08-28T16:01:36.000Z",
          "Titre": "Customer service should have a mobile number",
          "Contenu": "Prices are great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tuesday",
          "Nb_Reviews": 4,
          "Date": "2023-12-12T09:00:49.000Z",
          "Titre": "Ralph Lauren sweater",
          "Contenu": "High quality Ralph Lauren sweater, with exquisite design, at a reasonable price.  Very happy with the product. Would highly recommend Steals.com to everyone wishing to buy designer clothes at a low price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dale Robins",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T23:59:16.000Z",
          "Titre": "This was the first time I have redeemed…",
          "Contenu": "This was the first time I have redeemed my cash.  I didn’t know how to use the site.It was a success because I got a great pair of slippers for a hot deal."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Penny Assefa",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T16:11:15.000Z",
          "Titre": "Fast, reliable service and great merch",
          "Contenu": "My orders shipped out the same day and arrived in perfect condition. I got just what I expected. The only thing that is a little frustrating is how each size is listed separately on their site."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer Arlene JOhnson",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T20:51:18.000Z",
          "Titre": "This dress was a hit with my family and…",
          "Contenu": "This dress was a hit with my family and friends.It was a perfect fit and the price was right!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Clark",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T00:25:00.000Z",
          "Titre": "It appears to me that this company…",
          "Contenu": "It appears to me that this company provides deep discounts on quality goods.  I am guessing they are returns from stores like Macy’s.  I would definitely shop here again !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam Peresich",
          "Nb_Reviews": 6,
          "Date": "2023-11-22T19:14:17.000Z",
          "Titre": "You owe it to yourself to check out Steals!!",
          "Contenu": "Outstanding prices on designer brand clothing and accessories. Excellent customer service!! All of this in time for holiday shopping! I highly recommend the deals available on Steals.com. Steals is added to my Shop App and is convenient to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather LC",
          "Nb_Reviews": 6,
          "Date": "2023-11-29T00:31:09.000Z",
          "Titre": "Nice merchandise",
          "Contenu": "Nice merchandise, so much to look through, great selection, great prices, easy to navigate through, fast shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MD from Albany, NY",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T20:55:12.000Z",
          "Titre": "Great selection, prices & customer service",
          "Contenu": "I'm very happy to have found the Steals website, as their selection and prices are great!  Unfortunately, the first (beautiful mother-of-the-bride) dress I purchased didn't fit and the other sizes were sold out, so I had to return it, but the customer service was great as they were responsive and made it a very easy transaction.  I will definitely return to shop at this site in the future and will/have already recommended it to friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anya",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T00:04:47.000Z",
          "Titre": "Good price",
          "Contenu": "Good price, great shipping and ability for return"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T.C.",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T01:00:01.000Z",
          "Titre": "Lovely top",
          "Contenu": "Top was as shown and fit perfectly. It's a comfortable weight, a soft fabric and dresses up or down. Very happy with it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie",
          "Nb_Reviews": 4,
          "Date": "2023-04-10T15:39:38.000Z",
          "Titre": "Awesome deals on quality clothing",
          "Contenu": "This store is clean and its large selection of clothing is well-organized. I shopped on a busy Saturday afternoon, so I had to wait a few minutes for a dressing room. The employees were friendly and helpful. I used a coupon promotion to buy my merchandise, so the already low price was an even better ‘steal’."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ANDREA. NJ",
          "Nb_Reviews": 7,
          "Date": "2023-07-17T22:56:53.000Z",
          "Titre": "Z Supply LS Tops",
          "Contenu": "Found not 1 but 2 fabulous bargains & can’t wait to receive them! Excellent shipping & exactly as described! Love the 2 Z Supply long sleeve tops! Prices were fantastic!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Su Yamin Latt",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T17:14:36.000Z",
          "Titre": "Steals is a nice and affordable place to shop.",
          "Contenu": "I really like how Steals have a variety of clothing for women but I suggest to make more men clothing available to the customers too. I would like to see cosmetic products too. Overall I really like to shop at steals and visit frequent to get my essentials for my wardrobe."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GJ",
          "Nb_Reviews": 3,
          "Date": "2023-04-21T22:18:17.000Z",
          "Titre": "Steals is an awesome site",
          "Contenu": "Steals is an awesome site! They sell quality items for rock bottom prices. You can be sure when your purchase arrives that it will be just as pictured and described. Shipping is inexpensive and fast. If you ever have a problem with your purchase, they go above and beyond to make it right. No games or scams ever!! ❤️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glenda Woodard",
          "Nb_Reviews": 3,
          "Date": "2023-05-30T02:43:17.000Z",
          "Titre": "I didn't read the reviews until now",
          "Contenu": "I didn't read the reviews until now!  I just saw a great deal on the men seqin tux so I placed the order.  The reviews are very unfavorable from customer service to refunds and delivery.  This is my first time experience, the price was right, ordering was friendly easy and delivery was awesomely quick!  It too 4 days from the point of ordering to delivery  It arrived right at the scheduled listed time for my event.  We received compliments on the jacket and inquiries as to where I brought the item because of an upcoming event needed for.  I sent the information and I talked the item up.  However, I pray there is no disappointment for them because I just looked back on the price I paid and to my surprise the cost is much higher than the $48 I paid.Thank you for the awesome process!Blessings Always,Mrs. Glenda Woodard"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M. Poole",
          "Nb_Reviews": 3,
          "Date": "2023-04-11T00:37:32.000Z",
          "Titre": "FP FTW",
          "Contenu": "Love the site. I regularly search out their new items from my favorite brand (Free People) before bed. Unfortunately, I can't leave them in my cart or they get \"stolen\" by others :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alta",
          "Nb_Reviews": 2,
          "Date": "2023-03-09T00:50:30.000Z",
          "Titre": "I like the selections at Steals.com",
          "Contenu": "I like the selections at Steals.com. Whenever I'm looking for something, especially for a nice occasion, I can find something amazing! I like that I can find name brands that I would find in Dillard's or Macy's. I never feel like I'm getting a bad deal there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rubina",
          "Nb_Reviews": 7,
          "Date": "2023-09-24T04:13:15.000Z",
          "Titre": "I really like steal I only shop there…",
          "Contenu": "I really like steal I only shop there no where else I no all the associates there they’re very kind and helpful. Please keep the store the way it is . I don’t like some of the changes that have been make but I all the the good quality stuff you sell at the store . Thanks to everyone that works at the store they’re good people to work with.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Giles",
          "Nb_Reviews": 3,
          "Date": "2023-07-18T00:09:00.000Z",
          "Titre": "Great deals",
          "Contenu": "I have made many purchases with Steals and have never been disappointed Quality clothing for a reasonable price. Delivery is quick on most items"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rubina",
          "Nb_Reviews": 7,
          "Date": "2023-08-01T22:40:42.000Z",
          "Titre": "It’s a wonderful place to shop all the…",
          "Contenu": "It’s a wonderful place to shop all the employees are very friendly, helpful and patient. Best shopping ever to get your high end stuff. Its my Saturday stop. Love the place 💚 thanks Renee’"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie",
          "Nb_Reviews": 4,
          "Date": "2023-05-19T21:13:21.000Z",
          "Titre": "Great employees and great deals",
          "Contenu": "I shopped at a time that was not busy. There was maybe only one employee in the store. She was working hard to get merchandise on the racks, but also very attentive to the try on rooms and registers. I got several items of clothing for an amazing price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ZC Feather",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T19:34:20.000Z",
          "Titre": "We needed additional layers of clothing…",
          "Contenu": "We needed additional layers of clothing for a very cold soccer game at night. Steals had great deals for us on thermal underwear."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JC",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T04:22:39.000Z",
          "Titre": "I was satisfied with my purchases you…",
          "Contenu": "I was satisfied with my purchases you have to be lucky in some cases to find your size but the clothing is new and high end at discount price,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-06-19T20:26:02.000Z",
          "Titre": "I am happy with your quick shipping and…",
          "Contenu": "I am happy with your quick shipping and customer support. At the same time for the title you give to yourself does not apply to some merchandise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie",
          "Nb_Reviews": 4,
          "Date": "2023-06-25T00:34:57.000Z",
          "Titre": "You must check out this store!",
          "Contenu": "The clothing in this store is high quality at a low price. Everything is so well organized. I wish they had more ‘try-on’ rooms for busy days like today’s grand reopening."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gemcat4",
          "Nb_Reviews": 5,
          "Date": "2023-07-09T02:28:52.000Z",
          "Titre": "Always great clothes and shoes at a…",
          "Contenu": "Always great clothes and shoes at a great issue. I recently had a shipping issue and customer service acted very quickly in resolving the problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jill Allsop",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T07:46:04.000Z",
          "Titre": "Quality product for the right price",
          "Contenu": "You have to check out the shoe department.  Some amazing name brand shoes for an unheard of price.  I have been able to throw away some worn out shoes and replace them with very comfortable and quality shoes.  So grateful I found this store."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Loan Nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T17:58:41.000Z",
          "Titre": "I love shopping on the Steals because I…",
          "Contenu": "I love shopping on the Steals because I buy many things with good price.The Customer service is very good when I have a problem with my order, they solve it very quickly, friendly and happy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GJ",
          "Nb_Reviews": 3,
          "Date": "2023-04-12T04:54:21.000Z",
          "Titre": "Steals is amazing!!",
          "Contenu": "Love the Steals site. They have great name brand items for really low prices. Their description of the item is always right on and shipping is quick. My closet is literally filling up because I can afford to get so many pieces for my wardrobe."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raymond",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T18:01:32.000Z",
          "Titre": "Everything 50% to 80% Off. You can’t beat that. What a great store.",
          "Contenu": "What a delight this store is! Inflation is non-existent in this store’s prices. Just go see for yourself. I would recommend Steals.com to everyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura Eady-Popwell",
          "Nb_Reviews": 4,
          "Date": "2023-10-25T17:46:20.000Z",
          "Titre": "The lady who handled my purchases was kind, gentle and professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reyna I  Diaz",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T05:06:51.000Z",
          "Titre": "Because when I order some merchandise…",
          "Contenu": "Because when I order some merchandise it's fast and good service doesn't take long to get my items thank you!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roberta",
          "Nb_Reviews": 5,
          "Date": "2023-07-15T00:59:36.000Z",
          "Titre": "I’m impressed with the fast shipment",
          "Contenu": "I’m impressed with the fast shipment, easy return, and reorder the same item in a smaller size.  Returns being so easy"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "HECTOR LOPEZ",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T00:50:51.000Z",
          "Titre": "Like the name goes is literally a…",
          "Contenu": "Like the name goes is literally a steal, high end brands of a fraction of the price with a super fast shipping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anahi Castro",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T23:50:37.000Z",
          "Titre": "The best quality",
          "Contenu": "everything is of very good quality and the size is exact, they arrive soon and everything is perfect I love buying here I recommend it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lucy Wambui",
          "Nb_Reviews": 4,
          "Date": "2023-09-07T20:25:58.000Z",
          "Titre": "No disappointment so far",
          "Contenu": "No disappointment so far, quality and delivery on point. You're simply the best."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Meghan Shaver",
          "Nb_Reviews": 2,
          "Date": "2023-07-17T20:12:32.000Z",
          "Titre": "Organized and easy",
          "Contenu": "I loved how organized the store is becoming. I can easily find sizes. I love the shoe selection and the kids area."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MaryEllen Linder",
          "Nb_Reviews": 3,
          "Date": "2023-04-13T21:50:56.000Z",
          "Titre": "Item was a perfect fit.",
          "Contenu": "It was shipped quickly.  Neatly packaged this time.  Most importantly, the item fits perfectly.  Worked out great for an upcoming trip.  Thank you 👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Meghan Shaver",
          "Nb_Reviews": 2,
          "Date": "2023-04-19T18:30:40.000Z",
          "Titre": "I love how organized the store is…",
          "Contenu": "I love how organized the store is becoming. I love your shoe selections. Please keep those coming."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Nicolini",
          "Nb_Reviews": 2,
          "Date": "2023-03-14T23:36:00.000Z",
          "Titre": "My granddaughter loves her unicorn…",
          "Contenu": "My granddaughter loves her unicorn Christmas pjs. They were hand me downs from her cousin. They were wearing out and 7 years later I  found them here. She’s very happy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Molly Whelan",
          "Nb_Reviews": 2,
          "Date": "2023-05-16T14:58:44.000Z",
          "Titre": "You will not find brand name clothing at better prices.",
          "Contenu": "Great prices. Great quality. Fast shipping. I was missing some items, but they were promptly refunded. I'm totally addicted to Steals."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DIANA LAUVER",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T03:21:12.000Z",
          "Titre": "I saw the jeans that I love and could…",
          "Contenu": "I saw the jeans that I love and could not find them in any of my local stores. I saw them on your website and ordered them right away. Great service and good communication. I hope to order more items."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rubina",
          "Nb_Reviews": 7,
          "Date": "2023-08-06T02:19:23.000Z",
          "Titre": "Best store ever",
          "Contenu": "Best store ever. Love the associates and all the great deals I get. Much appreciated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Catarina  Nunes",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T03:21:13.000Z",
          "Titre": "Fast shipping...",
          "Contenu": "Fast shipping and the dresses look exactly as described!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customersue Funn",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T00:32:35.000Z",
          "Titre": "Your store is always clean and…",
          "Contenu": "Your store is always clean and organize. Great pricing. You have a large variety to chose from."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christine Fultz",
          "Nb_Reviews": 3,
          "Date": "2023-07-24T18:17:40.000Z",
          "Titre": "Experience with this company",
          "Contenu": "The pictures of the items were true to product. They are exactly what I wanted. They have many things to choose from and it’s easy to navigate. I love the tops I got! The sizes fit great.  They sent them faster than expected too"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stella Ortez",
          "Nb_Reviews": 4,
          "Date": "2023-04-13T00:25:55.000Z",
          "Titre": "Repeat customer",
          "Contenu": "I’ve bought other stuff from you and I’m very satisfied with my purchases. Prices are excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura Eady-Popwell",
          "Nb_Reviews": 4,
          "Date": "2023-10-15T00:52:27.000Z",
          "Titre": "The Young man who handled my purchase…Wonderful!!",
          "Contenu": "The Young man who handled my purchase was helpful and thorough."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah Zagorski",
          "Nb_Reviews": 2,
          "Date": "2023-07-17T23:54:38.000Z",
          "Titre": "I happen to just find the blouse that…",
          "Contenu": "I happen to just find the blouse that matches my pants. It was easy convenient to order . I couldn’t beat the price. And order was shipped the same day so I receive it soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "N N",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T20:22:38.000Z",
          "Titre": "Very Good",
          "Contenu": "Customer service are very nice, the product is more than what we expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leigh WILLIAMS",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T06:09:39.000Z",
          "Titre": "Assistance by the clerk in clarifying…",
          "Contenu": "Assistance by the clerk in clarifying where to find items and pointing out incentives to purchase through active sales"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lorraine F",
          "Nb_Reviews": 2,
          "Date": "2023-10-05T00:42:23.000Z",
          "Titre": "Love these pillowcases",
          "Contenu": "Love these pillowcases. I buy them for myself and gifts. Great quality and holds- up in the wash."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angie",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T17:02:52.000Z",
          "Titre": "Great finds!",
          "Contenu": "This is a great store! Great brands and the prices are amazing, also the staff is personable and helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rosemary Campbell",
          "Nb_Reviews": 4,
          "Date": "2023-06-18T21:58:24.000Z",
          "Titre": "This is the place to shop",
          "Contenu": "This is the place to shop!  The deals are unbelievable and delivery is very prompt.  I have been very pleased with everything that I have gotten!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris W",
          "Nb_Reviews": 4,
          "Date": "2023-04-18T19:52:34.000Z",
          "Titre": "Designer clothes at discounted prices",
          "Contenu": "I will always check all of the deals in my size. Recently, I got a name brand sundress and summer pants at about 70% off! Not seconds or flawed in any way. Awesome deal!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Deffez",
          "Nb_Reviews": 2,
          "Date": "2023-08-20T05:18:26.000Z",
          "Titre": "the store is very well organized and…",
          "Contenu": "the store is very well organized and clean, the customer service is good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 2,
          "Date": "2023-07-11T18:00:53.000Z",
          "Titre": "Great sweater tops at a great price",
          "Contenu": "Great sweater tops at a great price. Transaction was easy. Delivery was swift."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbie Bonillo",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T01:14:33.000Z",
          "Titre": "I just love comming in",
          "Contenu": "I just love comming in. I am able to afford warm boots. I am a substitute teacher I trach pe.   And am outside everyday!Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Molly Whelan",
          "Nb_Reviews": 2,
          "Date": "2023-05-16T21:39:11.000Z",
          "Titre": "Bang for your buck!",
          "Contenu": "Great prices on quality brand names. Fast Shipping. Great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yadira Moreno",
          "Nb_Reviews": 7,
          "Date": "2023-10-04T04:10:36.000Z",
          "Titre": "Their prices are excellent",
          "Contenu": "Their prices are excellent, I highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcela Ramos",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T22:47:43.000Z",
          "Titre": "Love the website",
          "Contenu": "Love the website! I could easily find everything I was looking for and the prices are great! Will definitely shop again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Deffez",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T03:16:45.000Z",
          "Titre": "The store always is clean and organized",
          "Contenu": "The store always is clean and organizedAnd the prices are good for me"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darwin",
          "Nb_Reviews": 3,
          "Date": "2023-05-21T20:30:21.000Z",
          "Titre": "I received what I bought in good…",
          "Contenu": "I received what I bought in good condition not complain since today"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rita Castillo",
          "Nb_Reviews": 3,
          "Date": "2023-03-20T06:13:50.000Z",
          "Titre": "First time purchasing from you",
          "Contenu": "First time purchasing from you. Satisfied. Received fast and free shipping 🤩"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sangsun yim",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T22:44:16.000Z",
          "Titre": "First",
          "Contenu": "First, I think this site scam.But I was wrong. I received  nice and good quality Calvin klein tweed jacket.Thank you.I already second order.Shop site is scam.But not steals.com."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Marban",
          "Nb_Reviews": 2,
          "Date": "2023-05-01T02:25:03.000Z",
          "Titre": "Loved using this site",
          "Contenu": "Great experience. Excellent product at a great price. No issues at all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John sarage",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T00:05:12.000Z",
          "Titre": "Great deal slow delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kat",
          "Nb_Reviews": 2,
          "Date": "2023-06-23T22:51:58.000Z",
          "Titre": "Just got notice of shipment within a…",
          "Contenu": "Just got notice of shipment within a couple of hours of order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Highland S",
          "Nb_Reviews": 3,
          "Date": "2023-10-07T00:37:20.000Z",
          "Titre": "Great selection of designer clothes for…",
          "Contenu": "Great selection of designer clothes for less. Quick delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eileen Geraghty",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T19:39:12.000Z",
          "Titre": "Great deals",
          "Contenu": "quality merchandise at a great price with quick shipping and good customer support!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura Eady-Popwell",
          "Nb_Reviews": 4,
          "Date": "2023-08-01T22:36:26.000Z",
          "Titre": "The person who handled my purchase was very kind.",
          "Contenu": "Reviewing the merchandise is always a pleasant experience. I made my selection and the lady was immediately ready to help me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yadira Moreno",
          "Nb_Reviews": 7,
          "Date": "2023-10-29T20:35:15.000Z",
          "Titre": "Everything here is excellent",
          "Contenu": "Everything here is excellent. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T17:08:13.000Z",
          "Titre": "I love your store",
          "Contenu": "I love your storeHigh quality productsGreat pricesExcellennt Store"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elvira  Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T05:19:42.000Z",
          "Titre": "Easy website to maneuver",
          "Contenu": "Easy website to maneuver. Easy check out as well. Quality items for a fraction of the cost."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gina Riveiro",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T21:40:03.000Z",
          "Titre": "Beautiful dress can’t beat the price’"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Courtney Preston",
          "Nb_Reviews": 2,
          "Date": "2023-09-10T02:56:37.000Z",
          "Titre": "I love this store",
          "Contenu": "I love this store. The in person store in Layton is way better than online FYI."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARK",
          "Nb_Reviews": 2,
          "Date": "2023-08-16T01:42:46.000Z",
          "Titre": "good experience",
          "Contenu": "The order I received was correct and arrived promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mr. Martin",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T14:14:50.000Z",
          "Titre": "Good products at very reasonable…",
          "Contenu": "Good products at very reasonable prices. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "xxxx",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T21:32:52.000Z",
          "Titre": "Securing an out of season garment…",
          "Contenu": "Securing an out of season garment unavailable for purchase on large retail sites."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eliz Smeds",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T23:40:43.000Z",
          "Titre": "The store is so clean",
          "Contenu": "The store is so clean, organized, easy to shop and friendly staff@"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elida Eagar",
          "Nb_Reviews": 2,
          "Date": "2023-07-25T22:47:32.000Z",
          "Titre": "Taylor is awesome",
          "Contenu": "Taylor is awesome. She always care for the costumers. Layton’ Store, Utah."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ola",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T01:04:44.000Z",
          "Titre": "Great organization and planning",
          "Contenu": "The ease of use of the website and the fast delivery of purchased goods."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Henry Washington",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T21:36:40.000Z",
          "Titre": "Good service and product",
          "Contenu": "Nice merchandise as advertised for a reasonable price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendi",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T17:13:36.000Z",
          "Titre": "Such a fun store and the environment…",
          "Contenu": "Such a fun store and the environment was great.  The staff was very friendly and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carrie DuBray",
          "Nb_Reviews": 2,
          "Date": "2023-05-05T06:13:41.000Z",
          "Titre": "Product description and speed of…",
          "Contenu": "Product description and speed of shipping is what made my experience amazing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Athena",
          "Nb_Reviews": 4,
          "Date": "2023-05-05T16:39:46.000Z",
          "Titre": "The store is now so well organized",
          "Contenu": "The store is now so well organized! It was easy to shop and find what I was looking for. The clerk was kind and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet Axtell",
          "Nb_Reviews": 2,
          "Date": "2023-04-25T16:19:25.000Z",
          "Titre": "Easy website to use",
          "Contenu": "Easy website to use - good selection of ladies tops."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Regina Done",
          "Nb_Reviews": 2,
          "Date": "2023-06-21T13:14:38.000Z",
          "Titre": "GO THERE",
          "Contenu": "It was so easy to browse with the way the store is set up. The prices are great and the employees are amazing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Armstrong",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T15:40:33.000Z",
          "Titre": "Quick and efficient",
          "Contenu": "Item arrived quickly and as described. Great tracking of product also"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karri",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T18:24:53.000Z",
          "Titre": "I love this store",
          "Contenu": "I love this store! You never know what treasure you will find!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet Meyers",
          "Nb_Reviews": 10,
          "Date": "2023-05-09T15:24:22.000Z",
          "Titre": "Your website is easy to use and the…",
          "Contenu": "Your website is easy to use and the selection is great.  Most of my clothes are ordered through your site."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hao",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T03:44:46.000Z",
          "Titre": "Great experience!",
          "Contenu": "Fast delivery. Items arrived as described. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tanya M.",
          "Nb_Reviews": 8,
          "Date": "2023-10-22T03:05:32.000Z",
          "Titre": "Easy and Fast!",
          "Contenu": "Easy ordering and fast shipping!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rascal",
          "Nb_Reviews": 2,
          "Date": "2023-09-16T23:31:52.000Z",
          "Titre": "Loved the shirt at a good price with…",
          "Contenu": "Loved the shirt at a good price with speedy delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SWC",
          "Nb_Reviews": 3,
          "Date": "2023-06-04T02:58:22.000Z",
          "Titre": "Happy customer!",
          "Contenu": "Great product at a fantastic price! Easy shipping. Terrific tranacrion overall."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ShuryvonneDixon",
          "Nb_Reviews": 2,
          "Date": "2023-07-03T22:22:44.000Z",
          "Titre": "Great Buys",
          "Contenu": "Reasonable prices for name brand clothing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Highland S",
          "Nb_Reviews": 3,
          "Date": "2023-09-26T23:44:22.000Z",
          "Titre": "Great prices and speedy delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rosalinda Burdette",
          "Nb_Reviews": 2,
          "Date": "2023-03-14T04:19:13.000Z",
          "Titre": "Store has great bargains!",
          "Contenu": "Lots to choose from. It would be nice to have built in dressing rooms. Some of your store people are very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SUSAN",
          "Nb_Reviews": 7,
          "Date": "2023-03-10T03:46:47.000Z",
          "Titre": "Great Buy!!!",
          "Contenu": "I received the dress and sweater very quickly and I'm very pleased with both items."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis Uriarte",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T22:16:27.000Z",
          "Titre": "FAST SERVICE AND I ORDERED MY ITEM  IN…",
          "Contenu": "FAST SERVICE AND I ORDERED MY ITEM  IN THE MORNING AND NOW IS ON MY WAY"
        }
      ]
    }
  ]
}