{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "stockx.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jade M",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:58:11.000Z",
          "Titre": "NEVER BUY OR SELL ANYTHING FROM THIS…",
          "Contenu": "NEVER BUY OR SELL ANYTHING FROM THIS SHADY COMPANY. Inconsistent verification process, horrible customer service. They sold me a shirt, it didn’t fit so we listed it and it sold. When it got back to them for verification they said they couldn’t verify it. Not the first instance of BS with this company. Use @goat instead!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "S Williams",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:53:49.000Z",
          "Titre": "I am at a loss for what to do I am so…",
          "Contenu": "I am at a loss for what to do I am so disappointed! I ordered the gold adidas gucci shoes in size 6 US but received size 6.5 US which is way way too big. I started the return process, submitted all requested photos, and send email follow up but did not hear back from StockX. Any additional assistance would be greatly appreciated."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matthew Sefton",
          "Nb_Reviews": 3,
          "Date": "2023-12-22T02:27:41.000Z",
          "Titre": "Expedited shipping price gouging",
          "Contenu": "No date provided for shipping, I want sure how long the shoes would take but getting them quicker would have cost $50 on a $110 pair of shoes. This is kind of ridicules in my opinion.Update…I didn’t complain about the timing of my delivery, but stockX had their bot apologize for that and then ask me if I wants to change my review."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony C.",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T04:37:57.000Z",
          "Titre": "Order a potential Christmas present on…",
          "Contenu": "Order a potential Christmas present on 12/9 only to be told their supplier couldn’t handle the delivery before Christmas so now without asking me, the found another supplier but the item doesn’t arrive until January 4th. Really?!?! I don’t want it then. I want to be credited. And you don’t gave a phone no over to call customer service. Buyer beware! This company sucks and are on the borderline of being fraudulent!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lauren Hicks",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:22:31.000Z",
          "Titre": "My shoes arrived “verified” but had pen…",
          "Contenu": "My shoes arrived “verified” but had pen marks ALL OVER THEM. The best part? Well you can keep them and we’llGive you 20$ off your next order or you can return them. But the others that are available are now more expensive and they’re Christmas shoes so now I don’t even get to wear them. Awful customer service. How does something like that get thru customer service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kimberly",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T16:11:22.000Z",
          "Titre": "Fake shoes!!!",
          "Contenu": "Placed an ordered on a pair of dunks that suppose to release 12/21/23. Receiving them within three days automatically gave red flags. After unboxing and viewing the shoes I noticed they were fake compared to several other dunks I owned. Contacted support team via email to make them aware of the dye stains, stitching, noticeable glue, and sole of the shoe. Now I’m in the process of making a return. Please check your shoes for authentication, especially when your paying more. StockX  “verified” means nothing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anna C",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:20:12.000Z",
          "Titre": "I was shipped the wrong item",
          "Contenu": "I was shipped the wrong item. I sent all information back that they requested to process a return. I was sent a message that they did not receive important information and will not respond regarding what information they need. If they do not fit or the size is wrong they will not return or exchange. I would give zero stars if I could. Horrible experience, horrible customer service and I’m left with a pair of purple shoes that I ordered in tan and another pair that do not fit. $350 down the drain."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Travis Terry",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T00:01:57.000Z",
          "Titre": "Order cancelled. Same as last time.",
          "Contenu": "Same as last time. I pay for the shoes and right before Christmas, they send me a message saying they are cancelling my order. No reason given just that they are canceling. This has happened the last two times I ordered for Christmas. I tried one more time and now I’m not getting any order status or response at all. I’m sure it will be canceled soon. This site is generally just an expensive letdown leading to disappointed kids."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nathan Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:31:49.000Z",
          "Titre": "I got the wrong size shoe that I paid…",
          "Contenu": "I got the wrong size shoe that I paid way too much for and the representative I talked to could not give me the common courtesy of at TRYING to help me fix it. Instead she was RUDE as hell to me and told me only thing i can do is put them back online and resale them.The shoes I bought from your website was suppose to be a Christmas present to a little boy who is disappointed now. Thanks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JI",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T02:13:45.000Z",
          "Titre": "The sales process can be misleading",
          "Contenu": "The sales process can be misleading, as StockX will allow other Country market’s goods to be sold as the item despite the package clearly being different from the picture on StockX’s site. Additionally StockX doesn’t seem to care if the seller sticks big foreign language stickers on the front in the middle of the package  which clearly change what a Lego can be marketed and sold as in the US."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeremy Janeczko",
          "Nb_Reviews": 4,
          "Date": "2023-12-19T20:17:22.000Z",
          "Titre": "MAKE SURE YOU ARE COMPLETELY OUT OF THE BIDDING IF YOU DON'T WISH TO BID FURTHER.",
          "Contenu": "Beware that this company forces purchases when outbid. If you stop bidding after you've been outbid you can be charged for the highest bid price even though you didn't bid past your original \"outbid\" That's what happened to me and I ended up paying way more than I intended to pay WITHOUT MY KNOWLEDGE."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Trina",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T00:32:04.000Z",
          "Titre": "I ordered a Christmas gift that never came",
          "Contenu": "I ordered a Christmas gift in beginning of December. Two weeks later I get a message saying there was a problem with the seller and they found me another seller. In the meantime, days are passing. I reach out to customer service saying I want to cancel my order so I cam order someplace else.  They denied me a cancelation and said I would be receiving my product. I reached out several times to customer service via chat and email. They just kept passing the messages along. Finally, after telling them I was going to dispute with credit card company, they gave me the cancelation and issued my refund. I would never deal with stockx again. I always buy from goat and will continue to deal with goat."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Kumar",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:45:47.000Z",
          "Titre": "Misleading",
          "Contenu": "Shoes were not as expected.  Condition listen was new but shoes had multiple mutilations. Instant loss if I tried to return or resell. Logistics and complications to execute a return is a nightmare and a half (probably on purpose).Trust was missing on your end. Shoe received stockx authenticity badge but failed obvious quality inspection. Listing was misleading. Negligent on stockx for not verifying. Site lived up to expectations of inconsistency and incompetence. First and last time using stockx. 0 zeros."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RICHARD PECHIA",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:15:03.000Z",
          "Titre": "I will never recommend this company to…",
          "Contenu": "I will never recommend this company to anyone; it is impossible to resolve a problem. they have a setup to still from people. consumer affairs should stop them from continuing stilling from people"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Susan Crosby",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T15:16:07.000Z",
          "Titre": "I bid on some shoes thought I had…",
          "Contenu": "I bid on some shoes thought I had purchased and then I got an email from you saying that the bid was not approved and processed so I bid on another pair of shoes got them and then low and behold in the mail. I get both pairs of shoes this is not good."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bethany Singh",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T15:53:31.000Z",
          "Titre": "You don't realize that when you click",
          "Contenu": "You don't realize that when you click, you purchase rather than add to cart. I clicked on item twice and bought two. I immediately contacted customer support and was told one the the purchases would be refunded. I got both items in the mail and contacted support and was told I would get a shipping label and a refund. Still nothing. It's super frustrating."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hugo Serrano",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T14:31:59.000Z",
          "Titre": "Ordered a Brickbear",
          "Contenu": "Ordered a Brickbear. This is a collectible item so you would expect item to be taken care off. DHL sent me a message saying package would be delivered on December 15th, didn't get delivered until December 18th, didn't opt out of PDF and item was dropped off without me signing for it, box which is part of the collectible item was damaged. Poor service."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "sarah",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T18:17:21.000Z",
          "Titre": "Damaged box with $450 shoes",
          "Contenu": "I received my shoes in a damaged box. The tissue paper is ripped and the box is so damaged it needs duct tape to hold it together. Stockx did not help in any reasonable way. Why am I paying a processing fee when it was processed incorrectly? I contacted stockx and they only wanted to give a $15 credit for future purchase, and I contacted within 10 days."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adam Espinoza",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T00:10:50.000Z",
          "Titre": "Scammers and unhelpful support staff",
          "Contenu": "I purchased a Disney Lorcana chapter 2 booster box and upon receiving the package it was blatantly obvious that the booster box had been opened and tampered with. Upon deeper investigation the entire box was replaced with one piece TCG bulk cards. When I talked to the support staff about a refund they basically said, “sucks to suck” and left it at that. I trusted you with my birthday present and you let me down. I will never buy through stock x again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Erica",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T21:22:46.000Z",
          "Titre": "Non-Authentic Jordan 11 Gratitude",
          "Contenu": "I bought the Jordan 11 Gratitudes and they were authenticated by Stock X but they are not authentic. The soles were a yellowish color instead of milky white. The insoles were gray instead of black. The stitching in the back was messed up and crooked. I ordered them on the 9th and just got them on the 20th. If I could give them a Zero I would!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "arbriana spann",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T08:01:57.000Z",
          "Titre": "I ordered a shoe December 9,2023 and…",
          "Contenu": "I ordered a shoe December 9,2023 and still haven't received my shoe. It stated it would be delivered before Christmas and it still hasn't shipped to stockx . So as a loyal customer what am i supposed to do about a Christmas present i ordered weeks in advance"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jahani Nyota",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:52:58.000Z",
          "Titre": "I placed a purchase on 12/15/23 but…",
          "Contenu": "I placed a purchase on 12/15/23 but realized instantly I chose the wrong size. I reached out to StockX customer service within minutes to change the size or to cancel and reorder the correct size. I was told it was nothing that could be done, and was sent the bidding policy. I explained that the order wasn't a bid, it was a purchase that was still pending and that it was literally 5 to 10 minutes that the purchase was placed. I also explained this was a gift (a Christmas gift). I was told the only option I have is to resell the item. I think that's a horrible experience for a customer to be told the only option is to resell a gift. If the order is still pending it should be a small grace period for change or cancel especially during the holidays."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "MELCHOR CRUZ",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:31:51.000Z",
          "Titre": "One order delayed and then cancelled…",
          "Contenu": "One order delayed and then cancelled and the one that arrived was all wet and package damaged. Had to buy from Farfetch and arrived perfectly. Will never use your service. Just waiting for my refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "C S",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:09:55.000Z",
          "Titre": "Cancelled the order weeks in advance - Andy L targeted me vs helping",
          "Contenu": "StockX cancelled the order weeks in advance.  Took two weeks to notify us made it so shoes would not arrive on Christmas.  Had the full StockX crew making excuses vs looking for a solutions.  Andy L  became involved and was threatening, refused to call, refused to assist and only targeted closing my account, more focused on proving he was right and then cancelled my account without ever speaking to me. I told him after he cancelled the account I would take legal action, he then became more aggressive. I have reported him and StockX to the BBB with various examples and he has forced me to take further action.StockX has had thousands in damages and when you dispute it they become aggressive and cancel you with no discussion. I had asked for a call to discuss and Andy L refused.This has happened many times. I asked to discuss the issues and a report on purchases. Andy refused and cancelled me. I have spent tens of thousands and the service is so bad.  Their process takes so long and they refuse to assist when asked or delay and I start over with a new person.  Again, more focused on being right vs fulfilling orders."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Papoose",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T21:19:02.000Z",
          "Titre": "I was sold some fake Jordan 11 size…",
          "Contenu": "I was sold some fake Jordan 11 size (15) and I’m very upset I purchased a 10.5 that I never received yet and these shoes are christmas gift the size 15 soles are yellow and the shoe itself doesn’t feel authentic I’m very very disappointed with this company and they’re saying that I can’t get my money back this is so unfair, but I promise I will tell everyone I know about this company and I will let them know what they did to me. I will never shop here again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kelly Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T03:22:32.000Z",
          "Titre": "When I clicked pay now to make my…",
          "Contenu": "When I clicked pay now to make my purchase the screen seemed to glitch for a second and the screen never changed. I assumed the purchase wasn’t processed as I did not see anything different. No thank you for your order, nothing. So, I clicked purchase button again only to see the same thing. Then I saw that I received two messages about my purchase from my credit card. I contacted the company right away. I received one email saying they are looking into it. But that was it. I have disputed the charges. We will see…,,"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pissed off",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T03:41:45.000Z",
          "Titre": "Compared then to a pair bought front…",
          "Contenu": "Compared then to a pair bought front the UGG store. There are several differences, they’re not authentic.  Also the size is way off compared to the authentic pair. Thanks for scamming me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bill Bankert",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:42:09.000Z",
          "Titre": "You guys let me buy a pair of shoes…",
          "Contenu": "You guys let me buy a pair of shoes that never arrived. And when I questioned about it after hearing nothing for 2 weeks I was told it was no big deal. Wasting my money is a big deal and I feel mistreated by this experience overall. I also wasted a free shipping coupon on that order that hasn't been replaced. Terrible experience overall."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kobagrill",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T19:21:48.000Z",
          "Titre": "Difficult return policy",
          "Contenu": "I bought a size M FOG Essentials t-shirt recently, but it's oversized and has a stain. Trying to exchange it, I found no direct option except contacting customer service, which was unavailable Saturday at 4pm PST. I had to fill out a form and am now waiting to see if I can return it. Frustrated with this complex return process."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "nathan brett",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:18:32.000Z",
          "Titre": "Purchased trainers in July 2023",
          "Contenu": "Purchased trainers in July 2023, trainers remained boxed with StockX authentication labels attached. Tried to sell them again on StockX and they failed authentication due to manufacturing defects. Report says failed due to manufacturing defects, when I contacted customer service they said I could have damaged them.Excuse me but if they have failed due to manufacturing defects you should be refunding me! Now gone to bank to raise case.Having used StockX several times previously I’m appalled by the service and this is borderline fraud!As for your reply, I have liaised with your customer contact department, I asked for the photographs you would have taken from my purchase…funnily enough they were not available…suspect!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony Miller",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T14:55:25.000Z",
          "Titre": "Stockx will delay and cancel order if you select standard shipping",
          "Contenu": "Ordered a pair of boots with standard shipping, plenty of time to receive them. Order was canceled 7 days later, excuse was seller damage boots and they would be reordered. I chatted with stockx explaining that shipping now needed to be expedited and I was willing to pay extra at this point in time. I was told I had that option when I ordered them and that's the only time I could choose it even though stockx was the on that canceled the order. No one was helpful at all and then 5 days later order was canceled again and I was promised a refund in 7 to 10 days wow. So I put up even more money and ordered the same boots for the same seller paying for express shipping and wow 2 days later they arrived. So if you want items from this site select the most expensive way to purchase that item or you will be screwed with and cheated till you finally repurchase the item at the higher price."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sinclair",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:39:23.000Z",
          "Titre": "Buy your shoes somewhere else",
          "Contenu": "I ordered 3 pairs of shoes from StockX in the past month. One pair of shoes never shipped. I had to reach out to customer service to ask them to cancel my order so I could repurchase the same pair. Now they wont be here by Christmas. The second pair of shoes was damaged, with the packaging completely destroyed in shipping. I have shipped these back to StockX. They have had them for days according to the tracking and not refunded my money. Only one pair of shoes was purchased successfully."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Chris H",
          "Nb_Reviews": 17,
          "Date": "2023-12-17T11:40:15.000Z",
          "Titre": "Fraudulent levels of penalty fees",
          "Contenu": "Provide a terrible service and then hassle me to provide a review. Ok then, was charged for incorrect sizing despite realising the mistake and not even sending the shoes. Was then charged £33 for this error. Apparently customer service no longer have the power to waive / reduce the fee due to circumstance, and have refused to escalate to management. Steer clear of these thieving cowboys. There is absolutely no justification for that level of penalty fee."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anaciano Ramirez",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:23:32.000Z",
          "Titre": "No returns or exchanges! 👎🏽",
          "Contenu": "My page refreshed during my order and I accidentally ordered the wrong size, only to find out this company doesn’t accept any returns or exchanges. Because of this, I will never be purchasing from the website again and will strongly recommend not to buy from here, until they change this policy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Echadly Etienne",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:12:40.000Z",
          "Titre": "I did not receive the product I…",
          "Contenu": "I did not receive the product I ordered. The shipping company said it was delivered but no one ever showed up and nothing was left at my door. StockX is very hard to contact and I'm not sure if they even have a customer service. Also the DHL customer service is impossible to get a hold of. I recommend using a better shipping company."
        },
        {
          "Note": 1,
          "Lieu": "CR",
          "Pseudo": "Alexander Chacón",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T19:05:48.000Z",
          "Titre": "Really bad attention of my request",
          "Contenu": "Really bad attention of my request, really hard to get your attention.Only automatic answers.I AM ASKING SUPPORT, AT LEAST TO CHANGE THE COLOR OF THE NB 530 TO STEEL GRAY, please or CANCEL MY ORDER EN RETURN MONEY BACK.. PLEASE.order #58790220 de las New Balance 530."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kyle Scofield",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:21:51.000Z",
          "Titre": "This platform sucks and the people you…",
          "Contenu": "This platform sucks and the people you guys have authenticating items don’t even know what they’re doing. StockX is a clown show, GOAT will get all my business moving forward."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Phakphum Vongthaveesab",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T03:38:09.000Z",
          "Titre": "Wrong size",
          "Contenu": "It is clear that the sweater I got is at least XXXL, not XL, that I had ordered.  The sweater is labeled wrong as XL.  The seller knows about it but still scams other people.  It is so disappointing that you didn't catch them when you inspected it.  I will never buy anything from your site again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joyce Hargrove",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T04:55:44.000Z",
          "Titre": "The costs are so expensive with all the…",
          "Contenu": "The costs are so expensive with all the fees.  I had issues with order going through and didn’t get a confirmation so I ordered again.  Then the confirmation was sent AFTER I order TE pair of TWO pairs of shoes and there was nothing I could do!  I was able to go to cancel the second pair only after I saw the first pair had been ordered twice.  There’s no. Way to return and nothing I could do.  Now I have two pairs of shoes for the same person exactly alike!"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Helen Enehizena",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:07:23.000Z",
          "Titre": "I Made an order since November and up…",
          "Contenu": "I Made an order since November and up till date i have not received my order instead the status displays delivered. I have Sent an email about the failed delivery AND I have still not gotten any response"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Cristen Hawkins",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T15:21:08.000Z",
          "Titre": "Horrible",
          "Contenu": "Horrible. Every time I order a pair of shoes and actually need them… you always mess up. You let a seller surpass the ship timeline, found me and new “seller” and then refunded me just today since it cannot be shipped. Keep in mind this is an accepted order from December 6th. It’s now the 19th and this was a Christmas gift."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve Hammelman",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:24:35.000Z",
          "Titre": "1 ordered 1 pair of Jordan Basketball…",
          "Contenu": "1 ordered 1 pair of Jordan Basketball shoes at apx $350 and received 5 pair and my credit card was chargee apx $1875.00 for 1 pair that i ordered.  I have been trying to no avail since before they shipped to explain the issue.  Now I am afraid if I send back they will get lost in the warehouse with our a Return author. number  Do not by anthing from this company and expect to have any correction if they make an error in shipping"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T12:40:56.000Z",
          "Titre": "False Advertising/Lack of Customer Supporr",
          "Contenu": "StickX advertised Xpress shipping to receive in time for Christmas.  I located a gift with the Xpress shipping icon, ordered and realized after the purchase that it was a regular purchase.  The seller still has not shipped and has no obligation to do so and StockX has no customer service response…automated ‘chat’ that will only give canned responses, request for live person that timed out, request for call back that has not occurred and an automated email.  Between the false advertising and lack of customer care and support, there are alternatives that this buyer will use going forward."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "kandace",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T22:13:21.000Z",
          "Titre": "I paid $134",
          "Contenu": "I paid $134, plus the fee and shipping for them to verify the shoes. The shoes' condition said \"new\" before I ordered them. Granted, I could tell the shoes hadn't been worn on the bottom, but one shoe has a whole crease across the top. For $134 the shoes should come \"new\" like unworn, not tried on, like the condition said. If you all are inspecting and letting the shoes go like that, in that condition for that price, they need to be marked with a \"new with crease\" etc. subcategory so we know the real condition before purchase. I won't order again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LK",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T18:37:58.000Z",
          "Titre": "I spent over $200 on a pair of Yeezy…",
          "Contenu": "I spent over $200 on a pair of Yeezy slides, was sent the wrong size, and they are too small to wear (9 UK instead of 9 US). I’m beyond annoyed and Stock X refuses to fix the situation despite my order showing that I ordered a 9 US and the box and slides showing a 9 UK. Unbelievable. I’m out $200, can’t give this gift and can’t even use the product. What a scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "itzel lopez",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:42:02.000Z",
          "Titre": "I am upset that my shoes were not…",
          "Contenu": "I am upset that my shoes were not delivered on the time it was said it would have been delivered. I had to go out off my way to purchase the same shoe from the actual shoe company and received it in less than 3days."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Raymond Ferrante",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T07:54:42.000Z",
          "Titre": "Very very dissatisfied",
          "Contenu": "Very very dissatisfied. I purchased my order for my son for Christmas before the holidays. I received several emails that my order was delayed that went on for three weeks. I just received another email that I will be refunded for my complete order and unfortunately I will not be receiving what I ordered. Very dissatisfied."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sue Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T15:07:27.000Z",
          "Titre": "Not delivered",
          "Contenu": "I received an email stating my daughter's $150 Jordan's were delivered but they were not! The customer service line is CONSTANTLY busy and I'm very annoyed that now I have no idea if my daughter will get them for Christmas or at all!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeffery Parks",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:35:39.000Z",
          "Titre": "I ordered a total 3 shoes",
          "Contenu": "I ordered a total 3 shoes. One shoe was the wrong size. I tried to exchange I was told I could sales it back on the website or rebuy the correct shoe size. I sticking with usual stores like nike, finish line etc... Better customer service and options."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cheryl S.",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:26:04.000Z",
          "Titre": "No customer service",
          "Contenu": "Notified StockXX that my product was going to be delivered to the wrong address. I moved and forgot to change it. I was told to contact the seller, there is no way to contact the seller! Product was delivered to the wrong address and I had to drive 2hrs out of my way to go get it from my old address. Will never order from this company again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeremiah Meek",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:07:30.000Z",
          "Titre": "Not sure who reviews but not many issues",
          "Contenu": "Was told that my item was not authentic, sent receipt from high end location and then when I disputed charge they suspended my account. Was told they would refund if i cancel my dispute. Had another item that was returned because it smelled like perfume and I replied and they gave me a credit. Also, bought a pair of shoes and they didn’t come with accessories.  * if you tell me that if I drop the dispute that you’ll refund my charge, it shows that you were wrong… my account is suspended till I drop the dispute even though you will refund it after, shady business! And you made me lose money in the process."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "G.Y.",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T05:29:13.000Z",
          "Titre": "Not happy with the item I received",
          "Contenu": "Not happy with the item I received. Although its authenticated real the item arrived with a bad odor. Smelled like cigarette smoke."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Franklin Hatchett",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:26:30.000Z",
          "Titre": "I order shoes from stock X and they were fake",
          "Contenu": "I order shoes from stock X and they where fake. I will be filing a legal lawsuit against stock X because they are false advertising like they have real authentic shoes and they are selling replicas"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bradley Loft",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:46:38.000Z",
          "Titre": "Item received was crushed in the…",
          "Contenu": "Item received was crushed in the shipping and all they offered me was $20 off my next purchase. Or my money back for a Christmas gift. Maybe you could hire a shipping company that won't destroy packages and leave a $300 item unsigned for on someone's step."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T05:12:15.000Z",
          "Titre": "Cannot cancel an order",
          "Contenu": "I placed an order for a shoe I will give my grandson for Christmas. No quick order confirmation came and I thought order had not been placed. So, I hit “order” again.  Still no confirmation. Then, I do receive a confirmation AND then a second one. No way to cancel duplicate order is unacceptable. I’ve received one order, but I received an update on DUPLiCATE order that it will arrive after Christmas.  I won’t order again from StockX."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tibbz",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T11:35:31.000Z",
          "Titre": "STAY AWAY THEY HAVE GONE DOWN HILL.",
          "Contenu": "STAY AWAY THEY HAVE GONE DOWN HILL.Heres my recent experience I had after using stockx for years. I got trophy rooms for a good price in my size for 850$. Shoes got to verification and they claimed it failed verification and gave a refund of the total amount IMMEDIATELY. While the shoes were going through verification the shoes went up 300 dollars. I think someone at the stockx facility saw this, failed my verification, gave me a refund instead of looking for alternate routes or sellers, and took my shoes for themselves, paying off the original price I paid.I went to customer service, they offered a 20 dollar store credit. So I gotta spend 300 dollars extra on a shoe. Close to Christmas too....NOPE GO TO GOAT, EBAY, DO NOT GO TO STOCKX."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T15:11:33.000Z",
          "Titre": "I advise you to never order anything…",
          "Contenu": "I advise you to never order anything from this site. I ordered the wrong size shoes and I immediately emailed customer service minutes after my purchase. It took days for them to respond only to tell me that I can't make an exchange and that they don't do refunds. So now I will have a 300$ pair of shoes that are useless and I have to resell myself."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adrian",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T04:05:00.000Z",
          "Titre": "Shoes are clearly a fake",
          "Contenu": "Shoes are clearly a fake, the sole is extremely dark but yet they have a certified tag showing that they've been inspected"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SWEATSHIRT PURCHASE",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:45:05.000Z",
          "Titre": "BEWARE - no returns allowed",
          "Contenu": "Since there seems to be waiting buyers for the products, the no return policy is not reasonable.In addition, the fees and shipping are onerous."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew Apple",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:51:53.000Z",
          "Titre": "Worst customer service ever",
          "Contenu": "Well first off I received a email saying my order was delivered which it wasn’t. Second it took me forever jumping through hoops to start a claim. Horrible customer service. I still haven’t heard back from them nor have I been able to speak with someone besides a damn bot. I will never buy through stock x again. I just got scammed and lost my money. Which this was suppose to be my wife’s Christmas present, thanks for nothing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Duygu Mack",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T20:37:43.000Z",
          "Titre": "They sent me a fake retro 4",
          "Contenu": "They sent me a fake retro 4. This is  literally scam, they say they verified it and they clearly they did not. I paid $300 for Christmas my daughter is been asking, you can literally see the glue and stitches are completely off you can see where the shoe leashed is plastic rubber and you can clearly see. This is a horrible website and I will be taking legal actions"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shifah",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T19:32:31.000Z",
          "Titre": "I don’t like the no refund policy with…",
          "Contenu": "I don’t like the no refund policy with these people.I once purchased a shoe just because order was just confirmed not even shipped yet ,they told me they couldn’t cancel it.Trying to sell a shoe on their website as they say ,they want to pay $50 for a $109 shoe.No.I tried to sell a $109 shoe that bought from them cze it was. Wrong size ,their buying price was $50.Not impressed at all and will never buy from them again……."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angry Dad",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:06:06.000Z",
          "Titre": "Thanks for verifying that you sent two…",
          "Contenu": "Thanks for verifying that you sent two different sized shoes. Not ordering until you fix this!! -Angry Parent"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Klarissa Conyers",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T10:43:00.000Z",
          "Titre": "POOR Customer Service",
          "Contenu": "Had an issue with my order and customer service was hard to contact. After reaching someone I was advised they would reach back out to provide further assistance and did not which left my issue unresolved."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Valeria Carvalho",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:07:36.000Z",
          "Titre": "O coudn’t buy anything",
          "Contenu": "My friends always buy from StockX when they go to the USA and I tried to buy sneakers and couldn't. I'm disappointed with StockXI tried several browsers and with several cards that I use in the USA. And it didn't work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacob Bishop",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:44:27.000Z",
          "Titre": "they didnt send me the right item and…",
          "Contenu": "they did not send me the right item and didn’t even offer to send me the correct one just a refund so garbage never using again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Troy Flanders",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T21:21:38.000Z",
          "Titre": "You web site is difficult to navigate",
          "Contenu": "You web site is difficult to navigate,  it's impossible to talk to a human. I ordered pair of sneakers and had issues now I'm stuck with 2 identical pairs. I'm pissed and will never spend another penny with you"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Karyan",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:56:13.000Z",
          "Titre": "Somehow allow them to use somebody…",
          "Contenu": "Somehow allow them to use somebody else's email address when ordering stuff. Keep getting an updates about the status of the deliveries and now I'm being asked to review"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Lindsay B - Canada",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T18:45:55.000Z",
          "Titre": "No product received.",
          "Contenu": "I would love to review the actual product I paid for, but sadly I have no received it. The carrier company that StockX sent my shoes with delivered it to the wrong address and I have yet to hear what will be done. I know this doesn’t entirely fall on StockX so I’m hesitant to give the one star review as I’m sure the shoes I paid for are amazing but given the fact that they’re responsible for shipping I feel that they should be ensuring the product is being rightfully delivered. So now I sit $180.00 out of pocket and no order and no resolution in sight. It was not delivered anywhere near my house. The city it was \"delivered\" to is not even near where I live. I had to start an investigation with UPS on my own. Be interesting to see what happens....I am not very hopeful"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Maya Lange",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T05:57:49.000Z",
          "Titre": "Totally terrible service - canceled order",
          "Contenu": "Totally terrible. I ordered something on December 11 and get an email tonight that they are experiencing delays and just canceled the order and refunding!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Furniture CPR",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:36:57.000Z",
          "Titre": "False info on shipping.",
          "Contenu": "I purchased my shoes. And in doing so. It gave me a chance to select express shipping. Turns out that when you get a $10 off coupon it changes the express shipping and now the express shipping is turning out to be 3 weeks. This company has no one to talk to in person. Only texts and they have you waiting for days for a response to see if they can cancel the order. I say don’t buy from these people. It’s not worth the hassle. Take your money elsewhere. They just care about their money and what they are getting.  By the way the shoes I purchased were over $450 and they can’t rectify the problem. I know that this is not the only pair of shoes that they have. Or that they will lose money on sending shoes from warehouse or other vendor."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brock",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:35:47.000Z",
          "Titre": "Color incorrect",
          "Contenu": "I have ordered from Stockx multiple times before and I have never had an issue with the product I received, however the shoes I got do not look like the advertised shoes online and Stockx will not let me return."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KKCJ",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:05:11.000Z",
          "Titre": "The box arrived smashed",
          "Contenu": "The box arrived, completely mangled and wet. It took forever to get here, and I am actually questioning the authenticity of the shoes."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kia",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T11:59:46.000Z",
          "Titre": "Not authentic shoes!",
          "Contenu": "I can not understand how this company claims to have a legit verification process when I received shoes that were CLEARLY knockoffs. They claim to have sent my shoes to one of their \"verifications centers\" before they were sent to me to verify their authenticity. Either their workers need more training, or they plain and simply practice in defrauding their customers, because the shoes I received from StockX were NOT the same shoes I ordered from DTLR and Finish Line. And they don't do returns or refunds. They say they have a guarantee if your purchase isn't authentic. But if they \"verified\" it before they sent it to me, how exactly does that work?! I wish I had read their reviews before I purchased from them. I would have NEVER purchased ANYTHING from a company that has a 2.2 star rating! Now, I'm stuck with 2 pair of shoes and I have no idea what I'm going to do with them. Do better, StockX!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Athena Lyras",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T18:11:48.000Z",
          "Titre": "I have been waiting on a pair of shoes",
          "Contenu": "I have been waiting on a pair of shoes. They keep getting delayed! I have wrote several emails regarding my order… simple questions to where my package is. Still no response! And I ordered my gift way before so I would t need to deal with this situation. And I should of never ordered an other pair . I spent a lot of money with this company. Truly need to talk to someone other than an automatic service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hector Labrada",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:51:15.000Z",
          "Titre": "Worst customer service experience I've ever had with any company",
          "Contenu": "You guys lied about my shoes and made my first sale absolutely the worst experience I've ever had with a company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Itw",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T07:12:53.000Z",
          "Titre": "Didn't receive what i ordered",
          "Contenu": "Didn't receive what i ordered, not able to receive what i ordered, can only be issued a refund once i return the wrong item i received."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Claudia Canzian",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:28:40.000Z",
          "Titre": "I haven’t received my order that they…",
          "Contenu": "I haven’t received my order that they say is delivered.  Poor customer support, you can’t speak to anyone you have to file a report.  If I don’t get an answer soon.  I will request a refund"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Holden",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:11:50.000Z",
          "Titre": "Non Responsive",
          "Contenu": "I attempted to communicate via email to inform you that no longer wanted to order the shoes and never received any response.  After expending an inordinate amount of time searching FAQs I attempted to communicate two more times and asked for directions for how to return the shoes; but no response has ever been received."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cody Muren",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:31:08.000Z",
          "Titre": "Took weeks to get my shoes",
          "Contenu": "Took weeks to get my shoes. You have no customer service via phone. I’ve had issues with you all buying and selling. You’re my last resort when it comes to sneakers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tammy Makhoul",
          "Nb_Reviews": 10,
          "Date": "2023-12-20T11:18:32.000Z",
          "Titre": "Horrible customer service & follow-up",
          "Contenu": "I posted earlier.  Never received the sneakers I ordered.  They asked me to contact FedEx which I did and I never heard back.  They asked me to file a dispute with Stock X which I did.  Have never heard back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Melanie Blythe",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:51:50.000Z",
          "Titre": "I did receive my product",
          "Contenu": "I did receive my product. They said they would give me a discount code for my next order and have not received it. Also, my order has not been refunded."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lincoln Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T16:37:53.000Z",
          "Titre": "A total scam!",
          "Contenu": "The price was in US dollars. I think you should specify the currency a specialty when you sell all around the world. once I realized it was a US dollars I tried to get a refund, but it was impossible to get in contact with StocKX A total scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jalen Renna",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T02:34:38.000Z",
          "Titre": "I Ordered shoes from StockX on Nov 23rd…",
          "Contenu": "I Ordered shoes from StockX on Nov 23rd of 2023. On December 4th 9th 13th and 17th i was told the order was delayed due to high volume. The order was the only thing my wife wanted for Christmas so i stuck it out until 19th. I spoke with a customer service over text chat and he told me it was not delayed and in fact the delivery was lost in transit to stockx and the only way to fix it was to get a refund. I respectfully expressed my wish to place a new order for the shoes with expedited shipping after the new pair reached their HQ to which he declined and then shortly after i had an issue finding my apple id email in the format he needed for refund he ended the chat. I still haven't received a refund or the shoes and was basically told they wont be coming at all and since i dont have the apple id email in the format requested i wont get a refund. To make matters worse i was emailed a 15% off discount code that expires in 90 days as if id ever purchase from this site again. If anyone is reading this do not order here. When the seller fails to send the item they in turn will lie and tell you its delayed, they refuse to give any customer service number for those that aren't tech savvy, and have zero customer loyalty. My shoes were lost in transit and my money was kept. This site is big trash"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lexi Nuss",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T01:56:37.000Z",
          "Titre": "I received a fake pair of shoes and…",
          "Contenu": "I received a fake pair of shoes and filed a complaint and was told they would reach back out in 5 to 10 business days it’s now been 12 business days. super unhappy with the customer service and the quality of authenticity they say they have."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "unsatisfied customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:26:40.000Z",
          "Titre": "The response time to emails is awful",
          "Contenu": "The response time to emails is awful and did not address the issue.  Still waiting for an appropriate response.  The delay in getting the product verified is terrible."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Francesca Pignataro",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:28:49.000Z",
          "Titre": "The item security seal was already…",
          "Contenu": "The item security seal was already opened. Not in its original seal. Not very happy, but because this is a Christmas gift from “Santa” that I promised my son, I can not return it and order a new one in time for Christmas."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maria tosco",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T07:10:56.000Z",
          "Titre": "I think it is ridiculous that you won’t…",
          "Contenu": "I think it is ridiculous that you won’t take back returns especially when are the wrong size and damaged this is the first and last time I will order from you"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hale Parriott",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:10:40.000Z",
          "Titre": "They sent me fake reimagined 3s",
          "Contenu": "They sent me fake reimagined 3s. I trusted StockX to take care of me as a consumer but I am very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lj",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T22:22:32.000Z",
          "Titre": "My shoes smell like weed  but I know…",
          "Contenu": "My shoes smell like weed  but I know stockx not going to fix the situation so I’m just taking the L"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zach Brown",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:01:21.000Z",
          "Titre": "Zero responses from customer service…",
          "Contenu": "Zero responses from customer service over the course of over 4 days. Terrible service. Excuse my language but this company is a f u c k I n g  joke."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amy  Wiegert",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:32:04.000Z",
          "Titre": "Very poor packaging",
          "Contenu": "Very poor packaging! Omega Swatch came in a damaged box. The Omega Swatch box was also all smashed when opened. The Omega Swatch also is not working. Very Disappointed with with purchase. I have purchased many things from StockX, and usually have a good experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Arthur Paz",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:13:44.000Z",
          "Titre": "I ordered a pair of shoes for my son",
          "Contenu": "I ordered a pair of shoes for my son. The size not clear on if it was toddler or youth and I end up getting a toddler size shoe which is too small for my son I showed my stepson after I ordered and he showed he told me that it might be a toddler size so when I called stock x I was unable to stop order or exchange or return it even before the item was shipped out to me. And I would have been gladly to accept a credit so I can get another pair of shoes even with a fee. Reasonable fee for me canceling order and they still refused Horrible service will not come back again with my first time and last time and I will make sure that people will hear this another platforms. This is the second message I have sent to StockX and I did call StockX trying to cancel the order and they refused and they refused to give me a manager or supervisor. Horrible experience. Horrible service. I will make sure everybody knows this. Trust me, I've done reviews before and people have thanked for the review and I've had a customer call me and try to threaten me because he lost customers because of my review. Thank you for nothing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elizabeth Armor",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T06:48:23.000Z",
          "Titre": "No luck",
          "Contenu": "I used stock x two times previously without a problem . This time even though I cancelled a bid , I am ending up with a pair of shoes I don’t want and didn't purchase.  . Fine they say , it was a mistake but you can sell them. Why do i need to sell them if I never purchased them ? I would not recommend this app to anyone because you cant talk to a real person & their customer service took more than 48 hours to get back to my complaint( via email ) . Of course by then , guess what the shoes  were already shipped to me . This is a useless site and their shipping is way too pricy. Never again ! App deleted"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Potts",
          "Nb_Reviews": 5,
          "Date": "2023-12-20T06:32:41.000Z",
          "Titre": "Both buyers and sellers beware",
          "Contenu": "Watch purchased for my son for Christmas.  Someone’s £2,500 hand bag delivered instead (no tags attached so despite on here multiple comments that they have vigorous verification processes that hadn’t happened) contacted stockx straight away.  Bag delivered back I’ve had 3 weeks of back and forward emails, multiple requests of confirmation that the bag was sent back.  Emails to me saying they have it but was waiting for verification (to be clear they had no idea what bag it was and that they ever sent it).  Then more emails as it was clear they had then lost the bag and were waiting for me to return the watch I never received.  They’ve requested my drivers licence details to open an investigation.  In the end I started a credit card claim against them and my bank advised no personal information be sent.  Finally today I received my refund it’s taken 4 weeks of constant emails.I’ve had along the way refund will be processed immediately after bag received back then 1-5 days, 3-5 days and 5-8 days.  No department knows what the other is doing.  My watch and this bag have clearly been lost along the way (to be clear the watch was no where near £2,500) so the suggestion I was somehow making up receiving it is just ludicrous.  I’ve been offered $40 goodwill gesture to re order the watch no thanks watch ordered via eBay and received 2 days later and is genuine with receipt etc.Would I ever use stockx again absolutely not would I recommend sellers using stockx absolutely not given I received someone’s bag they had sent in for verification.  Their verification team are non existent and I think their customer care team is just as bad."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Aladjem",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T09:19:42.000Z",
          "Titre": "Never again bad experience",
          "Contenu": "Bought new running Nikes. They were faulty and ripped in first 30mins of running. Stock X basically told me too bad no refund. Seller made money off me sending dud shoes."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bobby Brown",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:18:33.000Z",
          "Titre": "I received an email that my order was…",
          "Contenu": "I received an email that my order was delivered. It wasn’t. I sent them an email, it’s a few days before Christmas and still nothing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Debora  Magnani",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:44:43.000Z",
          "Titre": "I purchased the sneakers Yeezy 350 man…",
          "Contenu": "I purchased the sneakers Yeezy 350 man size 10.5 for my boyfriend and they don’t fit him and now I see that I can’t return it..I paid $420. I hate this app I would never buy another sneakers here .. now I have to resell the sneakers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lucy Newton",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T16:45:46.000Z",
          "Titre": "I ordered a size 6.5 Nike tennis shoes…",
          "Contenu": "I ordered a size 6.5 Nike tennis shoes for my granddaughter for Christmas ($156.00).  You sent a 6.5W.  When I went on line to return them because you sent wide, which wasn't ordered, I found that just because they were the wrong size I could not return them.  Very unfair of you.  I won't be using you again, and I'll let others know not to use you as well."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Sylvie Fortier",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:57:04.000Z",
          "Titre": "The product received is counterfeit",
          "Contenu": "The product received is counterfeit and I cannot get a refund. No more StockX for us!* You tell me to ask for your support,  I did, and you refused to help me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KM",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:45:50.000Z",
          "Titre": "My order was a Christmas present…",
          "Contenu": "My order was a Christmas present ordered December 1st. It originally said I would get it by December 15th. It is now delayed and I haven't received any updates. Needless to say I won't get it before Christmas which was the whole point. My son will be very disappointed. I get delays but 4 weeks is ridiculous! Especially when it is just waiting for verification of authenticity. The seller sent it immediately."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Debbie Ryan",
          "Nb_Reviews": 4,
          "Date": "2023-12-19T19:10:56.000Z",
          "Titre": "Stock X uses TFORCE shipping company they are horrible…",
          "Contenu": "Stock X used a new shipping company called Tforce which according to them that delivered packages didn't ring the bell or wait for delivery acceptance. There is no proof of delivery. I am out of luck for 2 packages that disappeared because I didn't get them. Stock X help told me they have a photo but didn't provide me with request for proof of delivery to ensure it was delivered to my address. Also couldn't get anyone to answer for help with not being able to access affidavit or password reset. Trying to reach Stock X help is not easy"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jaime",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T16:37:08.000Z",
          "Titre": "Defective shoes",
          "Contenu": "My son’s basketball shoes that I ordered were defective the first time he wore them. He wore them to practice the day after they were delivered and the sole came up, wasn’t sticking at all. These are supposed to be verified and inspected. Of course there’s nothing we can do because he wore them, but how else would he have known they were defective. Very frustrating because they are not cheap. This is the third order I’ve made, no issues with the other two but not sure I’ll order again."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Kevin Mbili",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T13:00:22.000Z",
          "Titre": "If you wanna compete with the Big…",
          "Contenu": "If you wanna compete with the Big brands you Need next day delivery it’s essential all these 7-12 days dispatch are costing your brand."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Erin",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T14:57:37.000Z",
          "Titre": "What a terrible experience this time",
          "Contenu": "What a terrible experience this time. I placed an order beginning of December, now not arriving until December 26th. I will not use you in the future and will be sure to tell my friends that too. I am really disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Terri Hollar",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:45:21.000Z",
          "Titre": "I needed to cancel the second order…",
          "Contenu": "I needed to cancel the second order which is a diplicate and do not need.  Didn’t realize this until I saw my credit card charge and by this time could not go back and cancel order.  Will not order again through company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rashidi Bennett",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T08:00:38.000Z",
          "Titre": "Could not make my purchase the first…",
          "Contenu": "Could not make my purchase the first six times I tried. Then couldn't get instant help. I could never find a phone number for StockX. Can only communicate by email and hope the item you want isn't gone or the price goes up."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Garry Hornby",
          "Nb_Reviews": 10,
          "Date": "2023-12-19T13:00:40.000Z",
          "Titre": "Waste of time",
          "Contenu": "5 Dec: Ordered hoodie from StockX. Told order en route to StockX.7 Dec: Told order had arrived at StockX.12 Dec: Told original supplier did not adhere to shipping guidelines and new supplier had been found. 13 Dec: Told order en route to StockX.18 Dec: Told refund issued due to issues with order.Two stars because at least I got a refund."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott & Frankie",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T09:22:40.000Z",
          "Titre": "Order now and get by Christmas…BS",
          "Contenu": "They had a count down clock at top of page telling us when to order before to receive before Christmas. I beat that by a couple days but when I finalized my transaction it then tells me I would receive Jan 2-8th. Done me wrong.To your reply; nowhere but nowhere did I state anything about not being able to locate my order. You obviously didn’t read my review. Pathetic"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Loraine S",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:35:53.000Z",
          "Titre": "Damaged",
          "Contenu": "These were supposed to be potential collectors items but the box and bag was damaged. Also, the extra $30 in shipping and fees is excessive."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Noah Pedigo",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:19:19.000Z",
          "Titre": "Ordered a 4090 and paid $100 for the…",
          "Contenu": "Ordered a 4090 and paid $100 for the verification, product still showed up with damaged heat sync fins that kept one of the fans from spinning. Luckily I was able to repair it myself"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christopher  Zabelicky",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T16:53:28.000Z",
          "Titre": "Havent used stock x for about two years…",
          "Contenu": "Havent used stock x for about two years have been using goat figured id give them another try. Bought a pair of burgundy dunks and the back of both shoes have marks on the back. Just contacted them to see if they can do anything but i just dont understand how they would pass authentication."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charles Sutton",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T20:37:36.000Z",
          "Titre": "Got janky all of a sudden",
          "Contenu": "Long story short. I’ve spent tens of thousands of dollars on Stock X over the years. All of a sudden, I can no longer order because of their risk management partner.  I can basically no longer order from them unless I write support complaining about it, and then they will enable me to complete the order. It’s such a hassle and I have now moved on to other platforms. No problems for 8 years, and then it took 5 days and 12 emails to order two items for Christmas presents. Just not what it used to be. Don’t recommend it anymore. One of the explanations I was given was they “my location wasn’t in the area code of the billing ZIP”. So they told me literally that I could not order unless I was in my hometown. 🙈"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jessica Disu",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T13:06:53.000Z",
          "Titre": "I ordered 3 pair of sneakers from…",
          "Contenu": "I ordered 3 pair of sneakers from StockX since Black Friday 2023. I have only received one pair which was shipped through DHL Express. The other two packages were shipped individually through FedEx and both times the driver never made an attempt for delivery and stole my packages. Christmas is ruined and StockX wants me to wait until after they receive their claims from FedEx and StockX is difficult to get ahold of an actual person. This has been unpleasant"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Kevin  Dalloo",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:26:05.000Z",
          "Titre": "When I received my shoes the tissue…",
          "Contenu": "When I received my shoes the tissue paper was ripped and crumpled. Not acceptable on a pair of dunks that came with a collectable shoe paper"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sezen Gosin",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T21:59:17.000Z",
          "Titre": "I ordered Nike 270 Air Max - not good quality",
          "Contenu": "I ordered Nike 270 Air Max women size 8 , a pair that was hard to find because it was no longer being produced. I bid on the shoe . The shoe arrived and it feels so fake, uncomfortable, the bottom the plastic sole feels so hard also , I own a lot of air max shoes and this one feels cheaply made compared to all of them . I don’t think they are authentic."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sergio BOISETTE",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T14:56:22.000Z",
          "Titre": "Let’s start with shipping takes too…",
          "Contenu": "Let’s start with shipping takes too long StockX marketing about 5 to 7 days shipping but it’s a lie, it took three weeks to receive my item. The item I purchased on StockX said (NEW) on the description but it was used.t I did received the item, it works fine but I gifted to a friend."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rocco",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T17:53:07.000Z",
          "Titre": "Beware",
          "Contenu": "Beware, especially at Christmas time, to check your delivery carefully because you only have 10 days to make a return.  Luckily I decided to wrap mine on the 10th day, because I noticed they sent the wrong size shoes.And in response to the Trustpilot response, I ordered the correct size...seller shipped a different size.  So, refund is coming.  Just glad I saw it when I did. Knowing returns are not typically an option, however, is also good to know."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "LS",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T23:27:20.000Z",
          "Titre": "No refund policy is stupid!!!",
          "Contenu": "There is a stitch in the right foot that genuinely makes the shoe uncomfortable to wear.  This no return policy is stupid as products do has defects from time to time"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Jessica cahill",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:49:09.000Z",
          "Titre": "Very disappointed",
          "Contenu": "Order completed on 8th December 2023, StockX timeframe guidance states 1-2 days from this date for the seller to ship item to StockX for verification. The seller was granted an extension (they only gave my this information after I prompted for an update) therefore my order was already delayed by 5 days. Ghada was very helpful in progressing my order so I decided not to cancel. StockX states a further 1-2 days for verification/authentication once the item has arrived to them- it has now been with them for 5 coming up 6 days and the order still hasn’t progressed. I sent another email asking for updates, Mohamed gave a very generic reply restating 1-2 days for verification therefore completely missing my point. I have since been sent an update simply saying that my order is delayed and will be sent in 1-2 weeks, which is totally useless to me and disappointing. StockX have failed to give updates willingly and have also failed to give adequate information when prompted. Avoid using if you want your item in a timely manner. It will be approaching a month by the time the item is even potentially shipped.Not to mention the inflated price I bought the item at on the original date which had reduced by £50 by the time the seller actually shipped the item 5 days later- no offer for partial refund to reflect current stock prices!!In response to StockX reply below- again you’re missing the point. My issue now lies solely with StockX who for some reason still have the item for verification/authentication after 6 days and show no sign of shipping it to me any time soon. What is the delay now please??"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GTK",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T22:55:10.000Z",
          "Titre": "Risky",
          "Contenu": "It's hard to tell if items are authentic or not especially with so many stitching defects etc. The shipping fee is pricey although you're spending a lot of the item itself and the extra fees add up."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:43:29.000Z",
          "Titre": "5 days in verification stage at the New…",
          "Contenu": "5 days in verification stage at the New Jersey stock x is way to long  . I should not have to wait this long for the product to be verified . If it’s that busy hire  more people . Not a happy customer so far at all ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ebony Sain",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T21:08:39.000Z",
          "Titre": "The sellers take entirely too long to…",
          "Contenu": "The sellers take entirely too long to send the shoes to StockX. My first order it took the seller almost 5 days before they shipped it to stock X. It then took another 10 days to get to me.Now I’m on my second order and it’s taking even longer! My order took five days to be mailed out and now it’s taking five days to make it to StockX. At this point I’m waiting almost a month after ordering shoes."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Monica Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T04:39:17.000Z",
          "Titre": "Great product but the shipping time was…",
          "Contenu": "Great product but the shipping time was unreasonable (right at a month and it kept getting pushed out a day or two at a time from original expected delivery)"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:31:48.000Z",
          "Titre": "Worn marks on shoes",
          "Contenu": "I bought my daughter a pair of Jordan 1 Elevate Low Atmosphere in new condition but what I received is not new condition. Definitely good or like new. The laces have stains and the bottom of the soles looked worn and along the side of the shoes there was scuffs."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tracey Shank",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T16:28:00.000Z",
          "Titre": "This is my third time buying from…",
          "Contenu": "This is my third time buying from StockX and probably my last. Previous purchases I have not had a problem with except the ridiculous amount for shipping and the length of time it takes to get my product. This time however, my T-shirt came jumbled up in two ripped open plastic bags. It is all wrinkled. I paid 67$ for a shirt plus 5.36 processing fee. I would like my product to look nice when I get it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T05:12:05.000Z",
          "Titre": "Be careful if you are not 100% sure on size",
          "Contenu": "Because the return policy for size issues is nonexistent, I suggest only purchasing items you have tried on somewhere or know 100% fit who will be wearing the item."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jordan Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T03:35:00.000Z",
          "Titre": "I purchased a new pair sneakers from…",
          "Contenu": "I purchased a new pair sneakers from Stockx that arrived the other day. The sneakers were fine but the box was beat up. When I purchase “New” sneakers that means the shoes and the box they come in"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steven Norman",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:16:17.000Z",
          "Titre": "The Switch",
          "Contenu": "Stop offering a\"buy\"price then at check out claim that the \"bid\" price is higher.If that's your sop then you should consider being a bidding only site."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Valerie  Sortito",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T14:42:16.000Z",
          "Titre": "I bought the item to be new and instead…",
          "Contenu": "I bought the item to be new and instead I got a damaged box and damaged paper on the side of my shoes."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Meghan Gregory",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T22:56:12.000Z",
          "Titre": "Our package was left in the rain",
          "Contenu": "Our package was left by our mailbox during a rainstorm (over two inches!). The packages was t wrapped in plastic and became severely damaged. The shoes will dry out and be just fine. But disappointing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rowell  Jessica",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T17:37:12.000Z",
          "Titre": "I understand mistakes happen but famous…",
          "Contenu": "I understand mistakes happen but famous footwear even checks the size of shoes before a purchase. I purchased my daughter dunks for Christmas. This is top on her list. I ordered a size 3 the box says size 3 the receipt says size 3, but the shoe is a size 2 this is not verified by any means even though it says it was, I would just expect more from a company like this. When I go to customer service you cannot talk to anybody on the phone you have to do a virtual chat. It has now been 24 hours and I don’t have a response."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kari B.",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T21:12:05.000Z",
          "Titre": "The website was glitchy and charged my…",
          "Contenu": "The website was glitchy and charged my card twice and placed 2 separate orders for the same pair of shoes. It was a nightmare to get a hold of anyone and once I did they told me not to order something if I didn't want it. It was insulting as it wasnt me who made a duplicate order it was the website! Absolute nightmare! Never again! The order did arrive though and my son will be happy."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "steve jackson",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T02:51:22.000Z",
          "Titre": "Item arrived damaged poor packaging…",
          "Contenu": "Item arrived damaged poor packaging literally thrown in a bubble mailer with no protection despite being a flimsy item that I paid nearly 10x retail for.Envelope was very dirty and looked like it was ran over. Was not gonna bother posting this review but they have been harassing me with emails to review the product every hour so hopefully this shuts them up"
        },
        {
          "Note": 2,
          "Lieu": "PH",
          "Pseudo": "Eric Apag",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T01:06:46.000Z",
          "Titre": "Poor packing of the item when received…",
          "Contenu": "Poor packing of the item when received from the third party courier or from the origin?it has a possible that the package was open and not being packed will again.Hope to have improvement about the handling of the package."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Cookie",
          "Nb_Reviews": 11,
          "Date": "2023-12-07T02:06:30.000Z",
          "Titre": "Frustratingly complicated and slow…",
          "Contenu": "Frustratingly complicated and slow process.  First seller didn’t bother sending item so I was refunded.  Second seller shipped item within two days and nearly two weeks have passed, I’m still waiting for my item.  Don’t think I will use again and I’m afraid I can’t recommend either"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Troy Campbell",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T01:11:14.000Z",
          "Titre": "I received my order finally but the…",
          "Contenu": "I received my order finally but the process took way too long every time I order for here"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Tiffany C",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T20:21:53.000Z",
          "Titre": "Lorcana card packs opened and replaced with pokemon cards …",
          "Contenu": "We had ordered from.you before without incident however our last order had been tampered with but still verified. We ordered Lorcana cards for our son and he opened the box to find all the packs had been opened. The high value cards were taken and replaced with Pokémon cards. So disappointing. We have not heard back from Stock X on getting a refund either."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Y. S",
          "Nb_Reviews": 3,
          "Date": "2023-12-04T02:54:30.000Z",
          "Titre": "The delivery time went wrong",
          "Contenu": "The delivery time went wrong. I mean when you buy from stock x there is no information if you’re buying from an international buyer and that delivery time might be longer. You guys should definitely do something about that. Give the chance to people to buy in the market they want. After 10 days of waiting, I wrote customer service and that’s when I was advise it was an international transaction. It could be an email or a warning before the end of the transaction."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:08:10.000Z",
          "Titre": "Delayed & didn't offer any solution.",
          "Contenu": "Delayed & didn't offer any solution. You guys"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Parker Southern",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T18:52:44.000Z",
          "Titre": "Shipping times are far too long",
          "Contenu": "Shipping times are far too long. For an item to take over two weeks is unacceptable in 2023. Fees for service are so high. I will always try to use a different service and only go to StockX when I cannot find my item because of this."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kade Holcomb",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T02:52:38.000Z",
          "Titre": "The shoes were in good condition",
          "Contenu": "The shoes were in good condition, but the box was smashed and the paper in the box was ripped with holes"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nicole Warwick",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T18:58:13.000Z",
          "Titre": "I think something that could be advertised better is even if you are outbid, your bid is still active",
          "Contenu": "I think something that could be improved is that once you are outbid on an item, your bid is still live. I realize (after the fact) that this is in the fine print, but I think a lot of people would go in like me with a more “eBay” mindset. I ended up getting two pairs of the same shoes and was unable to cancel even seconds later. I understand why, but there definitely should be a big warning after you are outbid that says your bid is still active."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chandler Henkelman",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:31:51.000Z",
          "Titre": "When I received my package it was not…",
          "Contenu": "When I received my package it was not sealed correctly and was partially open when dropped off! Once the package was open the Nike shoe box was ripped down the side! The shoes were in good condition but the box was ruined!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Craig Hertig",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:52:47.000Z",
          "Titre": "The shoes we thought we purchased were…",
          "Contenu": "The shoes we thought we purchased were to be a size 6 youth,,6C there came as a 6 toddlers"
        },
        {
          "Note": 2,
          "Lieu": "JE",
          "Pseudo": "Roland Mills",
          "Nb_Reviews": 11,
          "Date": "2023-12-07T11:41:55.000Z",
          "Titre": "Commission/Charges and shipping costs crazy",
          "Contenu": "Commission/Charges and shipping costs are crazy expensive and can double the item price...so waste time searching...should show price including admin cost at least."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kelby Guzman",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T03:57:59.000Z",
          "Titre": "Never shopping at Stockx",
          "Contenu": "Well, fasten your seatbelts because this might be a long one. Let's start with ordering the Air Jordan 11s platinum tints. Ordering was easy and simple, I like how they have a layout of when the order is placed, then recieved, then shipped etc.. Each step lights up when it gets to that step. That's all cool until my order was delayed for maybe a day or two since the original seller wasn't available anymore and now a new one needed to accommodate my order. Not a big deal, the whole purpose of this review is the fact these pairs of 11 platinum tints has a serious cosmetic issue, at least in my eyes, when it comes to the glue that is holding the shoe and white sole together, on one of the shoes it literally looks like It was put together by someone unprofessionally and given to me.. This will be the first and only review I ever write and make for you guys Stockx, not only because I don't even write reviews like that, but also because I will NEVER shop at stockx again, due to the fact you guys CANNOT be trusted, at least with my money, anymore since I am terrified of ever receiving another pair from you guys. Imagine how I feel having these pairs with this issue, wanting to now try to trade or swap the pair with a normal looking pair so I can feel comfortable wearing these. I have a video and photos to prove it. I'm also writing this for other buyers like myself that gets excited to buy a pair of awesome sneakers only to recieve a pair with a ugly cosmetic issue, when it's suppose to be factory brand new. I will now buy all my sneakers at goat from now on until they also give me a reason to stop shopping there. I just bought some 13s and the 11 gratitudes from goat so let's see how they turn out."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dominique N Kereluk",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T05:57:55.000Z",
          "Titre": "I didn’t like that I purchased my shoes…",
          "Contenu": "I didn’t like that I purchased my shoes at a lower price but then it was cancelled 5 days after. I thought the whole time I was getting my sneakers for my bday. Then realized it was cancelled and had to pay more in order to get the sneakers I had already “buy now” bought, for more money and days later than I had hoped.After “buy now” for a second time my shoes did go through the stockx process and were shipped to me. They are perfect. Second time around I received my sneakers quickly but had to pay way more."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cris Ivanov",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T06:44:51.000Z",
          "Titre": "I ordered my shoes as a birthday…",
          "Contenu": "I ordered my shoes as a birthday present on October 31st. The anticipated delivery date said 11/14 which was reasonable. Instead we received them on 11/20. I am giving StockX another shot but that was a huge disappointment especially since that was her only gift."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SA",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T17:50:20.000Z",
          "Titre": "My order was delivered 24hours after…",
          "Contenu": "My order was delivered 24hours after its original delivery date with the contents missing.It was delivered half opened and extremely un-secured (very minimal packing tape, only bubble wrap in the box, etc).Customer service has been very gracious during this ordeal, which has definitely helped me navigate this stressful situation."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brad Dusenbery",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T18:47:06.000Z",
          "Titre": "You sent me the product that was…",
          "Contenu": "You sent me the product that was subparYou sent me the subpar product. There were slight damage on it, and the verification caught that I was trying to sell this on goat then it would’ve not been approved subpar product. There were slight damage on it, and the verification caught that I was trying to sell this on goat then it would’ve not been approved and sent to the seller.That response is so AI. Jesus Christ hire people..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carter Rawson",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T17:37:19.000Z",
          "Titre": "When the customer is assumed to be a criminal...",
          "Contenu": "This experience was both elating and disappointing on a variety of levels. First, StockX as a sneaker exchange was the best marketplace I was able to find for a limited edition pair of sneakers that I was willing to overpay for due to scarcity. The pluses are they are big on product authentication and the personal touch of their customer support is solid. Unfortunately their customer service policies are a disaster. My package arrived damaged and the administrative burden associated with transacting a remedy were more challenging than applying for a credit card, paying court costs, or just about any other social transaction. #1 I am not a sneaker dealer, just an end user. StockX does not need a driver's license to issue a refund for shipping. No other entity does this and I repeat that I was not looking to return the entire shipment. My ability to resell the product is already compromised. Just comp me the shipping and call it a day. #2 They make you fill out a waiver as a PDF. Nobody wants to deal with PDFs unless you are dealing with a government agency and have no choice in the matter. #3 This company does business from a Michigan address. If the State of Michigan or Wayne County is indirectly imposing this administrative burden on customers then  I recommend StockX move to Wisconsin which is way nicer for mail order businesses. Thank you. I will go back to eBay."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eddie Mcdonald",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T21:41:58.000Z",
          "Titre": "I bought a ps5 slim \"brand new\" and it…",
          "Contenu": "I bought a ps5 slim \"brand new\" and it came out the box banned. Been spending 2 days trying to get it situated and havent heard anything back."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "WILLIAM FITZGERALD",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T13:49:14.000Z",
          "Titre": "After 3 weeks I was informed that there…",
          "Contenu": "After 3 weeks I was informed that there was an issue with the shoes and I would be refunded. Being so close to the holidays this has now put me in a poor situation for finding a gift"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Aa",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T06:38:19.000Z",
          "Titre": "Possibly fake",
          "Contenu": "Good shipping but pretty sus shoes. Chinese domestic market, box was almost destroyed, I’m pretty sure these are fake."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Melissa Cordoba",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T16:36:08.000Z",
          "Titre": "Shoes were a little bigger and the…",
          "Contenu": "Shoes were a little bigger and the store doesn’t allow returns or ex changes so you get stock with a pair is shoes that doesn’t fit you …"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eva Knievel",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T07:50:23.000Z",
          "Titre": "When I buy shoes in “New” condition",
          "Contenu": "When I buy shoes in “New” condition, I don’t expect to see scuff marks on them. Not sure if it was the seller or the shipping but there were scuff marks on them."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "John M",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T05:46:34.000Z",
          "Titre": "Delivery good. Hole in jacket pocket.",
          "Contenu": "The delivery on the jacket was great. Showed up ahead of the original forecasted schedule.   But when my son tried on his jacket, which was birthday gift, he noticed a hole in the pocket.  So he will need to find someone to mend it, as an online sale won’t be worth the hassle to return etc.  I’m glad it is in an inconspicuous spot."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joanne Cullinan",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T18:45:38.000Z",
          "Titre": "Prices are low but shipping fees makes…",
          "Contenu": "Prices are low but shipping fees makes their price exceed competitors."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Patrick Delos Reyes",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T00:45:43.000Z",
          "Titre": "Wrong delivery package",
          "Contenu": "There should be a clear resolution to my concern. How will I ever trust buying here again if I am gonna recieve the wrong package. Im glad the second package srrived with the right one but im hoping this doesnt happen again. And the process of having to report the problem is kinda tedious. There should be a much easier way to solve a concern and filling a claim"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lori Wikerson",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T21:57:36.000Z",
          "Titre": "Colors of the shoes were different when…",
          "Contenu": "Colors of the shoes were different when received that was shown on the site. Colors should be listed in the description.Thank you for your response. Unfortunately I don’t feel I answered the survey in time to have anything done. Will just be stuck with a pair of shoes I won’t wear or try to sell them and recoup some of my money."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Portia Addo",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T15:57:12.000Z",
          "Titre": "The box had a rip in it",
          "Contenu": "The box had a rip in it. Stockx should have deducted funds from the seller back to me. Not sure if it will affect the future resale value of the shoes since the box was ripped."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Garrett",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T03:28:46.000Z",
          "Titre": "Back Nike logo The N came With it…",
          "Contenu": "Back Nike logo The N came With it peeling off ,The wife doesn't want the Headache and They came from HK we Live in the USA doesn't make sense, but it's a Frist and probably last..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "marlenerose",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T20:53:18.000Z",
          "Titre": "Just wished you could return or cancel…",
          "Contenu": "Just wished you could return or cancel an order. I would purchase more often."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "M. Presly",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T23:58:09.000Z",
          "Titre": "There are pros and cons",
          "Contenu": "Online showed or implied mdse was in stock.  I ordered 3 pairs of shoes for my grandkids.  1 came in a few days.  Another came a few days later.  It's been WELL over a week and I still have not received the third pair.  I'm not even certain when they will get it in stock and ship it.BTW, my wife tells me that they don't take returns.  If the shoes have obviously NOT been taken out of the box,  I think that's a bit unreasonable.  I accidentally ordered two pairs of the same shoes and now must sell one on ebay or something else.   If my wife's information is true, deduct one star.  If it's not true, then the two star review applies.  I will probably not be ordering from them again.  I did this time because that's what I was instructed to do by my wife and she knows more about this than I do...or was supposed to. So I guess I'd say if you're in a hurry to get 3 day delivery, explore options.  If you're not absolutely sure of what you want, order from someone who takes returns.  BUT, it's my understanding that they have possibly the best stock available."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rob Kasprzak",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T23:39:32.000Z",
          "Titre": "My sneakers came WREAKING of cigarette…",
          "Contenu": "My sneakers came WREAKING of cigarette smoke. No idea how I’m going to get this smell out of them. Might return. How could you consciously ship these to me??? They stink up my entire house!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sarah Gardiner",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T17:59:23.000Z",
          "Titre": "Packaging was disappointing!",
          "Contenu": "The item description said the item was new however the item box looked used with obvious opening. In addition the box was damaged looking like it had been crushed. I would be embarrassed to give this as a gift to someone other than my son as the package looked old/used. It made me question if all pieces were there. Hopefully when my son puts it together nothing will be missing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Trey Tucker",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T04:00:40.000Z",
          "Titre": "Took too long and was told I would be refunded",
          "Contenu": "Ordered a pair of Dunks and it originally took around 2 weeks and requested information about my order. I got a pretty quick response saying that the seller did not pass the verification check and they got a new seller and that one did not pass either so they had started a refund for me. I needed the pair of dunks fairly quick for an event so I purchased them from a different website and received them. Then randomly one morning I got a notification saying the shoes had shipped and finally received them 20+ days later. Now I have two pairs of the same shoes and didn’t get a refund."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Khane Many",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T16:21:57.000Z",
          "Titre": "I gave it a 2 star because it took 12…",
          "Contenu": "I gave it a 2 star because it took 12 or more days to arrive. That wild because it's normally 3-5 business days. Goat took 7 days which isn't bad, but 12 days?!!! 12 days!!! My shoe went outta style by the time it arrived. Shhheessshhh!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Whitney",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T06:37:48.000Z",
          "Titre": "Unsatisfied customer",
          "Contenu": "The pair of shoes we purchased seemed to have some damage to the toe area. I tried to put in a request to speak to customer service I went through all the jumps, hoops and hurdles. They requested by taking all the pictures and documentation uploaded them and then I was denied because it said something went wrong on the page. I tried to email them through the link provided and again I was denied because something went wrong on the page. Needless to say, I never had a chance to speak to anybody about my concerns I was passed the 10 day allotted window, and now we have a pair of shoes were unhappy with, customer service is horrendous. It is not easy to find what you’re looking for in the health section. I’m frustrated there’s nobody to talk to or a phone number to contact anyone would not recommend purchasing through them again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bridget Marshall",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T16:44:05.000Z",
          "Titre": "Not being able to cancel an order…",
          "Contenu": "Not being able to cancel an order within minutes. I accidentally ordered the same shoe twice. I didn’t have the extra $215 to give away now I have to figure something out."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Josh Atwood",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T06:07:08.000Z",
          "Titre": "Sucks having to buy a 2nd pair of shoes…",
          "Contenu": "Sucks having to buy a 2nd pair of shoes on credit they gave me, all because my initial pair was completely defective.  Not even close to new like I expected.  Paying extra funds to ship them back?! Really?!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "BK",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T22:43:25.000Z",
          "Titre": "Received Unpleasant Surprise Credit Card Charge",
          "Contenu": "Seller never replied to my bid but I received a charge on my card. Makes me question the security of the site."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel Campos",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T17:16:59.000Z",
          "Titre": "Shipping takes absolutely Forever",
          "Contenu": "Shipping takes absolutely Forever, the Shoes came damaged & somehow were not Cancelled & returned back to Seller, Taxes are too High, NEVER Recommend StockX to anyone unless its something you certainly cannot buy out of StockX. Have purchased 3 items from StockX in the past & never been Satisfied."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Wendy Haley",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T01:14:40.000Z",
          "Titre": "I bought some mater crocs size 8 in…",
          "Contenu": "I bought some mater crocs size 8 in women's. Delivery was perfect but crocs not so much. One croc was noticeable bigger then the other. Looked at the website and clearly says no returns or refunds. A little disappointed being that these crocs cost me nearly $100. Don't think I'd ordered from this sire again."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "David Desjardins",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T21:27:23.000Z",
          "Titre": "Paying 20$ for shipping on a hoodie is…",
          "Contenu": "Paying 20$ for shipping on a hoodie is fine. That it’s not shipped in a box to protect it doesn’t make sense. You shipped in a bag which increases the odds of damage.  If you are charging that much you send in better packaging"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Renae Turner",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T18:08:57.000Z",
          "Titre": "Christmas presents not going to be on time",
          "Contenu": "Well, my sons shoes were supposed to be here already. Now I get told they had to find another seller and they won’t be here till after Christmas. I am devastated."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TD",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T22:02:38.000Z",
          "Titre": "Fast delivery but no help from customer service.",
          "Contenu": "The product was shipped/delivered quickly and with good communication. However, there was an error on the site when I ordered the shoes and I accidentally ordered two pairs. (First time the app didn’t show me a confirmation; it brought me right back to the product screen.) I contacted them and was told that I was out of luck and that there was no chance of canceling one pair. (Orders were placed less than a minute apart) This was to “preserve the integrity “ of their bid systems. I did buy both pairs at full asking price, for what it’s worth. The lack of any willingness to help turned me off. I will buy elsewhere when I am need. At least my daughter will have a backup pair, I guess."
        },
        {
          "Note": 2,
          "Lieu": "TW",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T11:38:22.000Z",
          "Titre": "Overpriced handling fee",
          "Contenu": "Overpriced handling feeSelling: setting the lower doesn’t get to be sold, quite bizzare.Buying: potentially still fake items even when verified."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kerri G",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T19:11:44.000Z",
          "Titre": "bad experience",
          "Contenu": "I just had a bad experience from start to finish. And the worst part is that after all of the issues and time it took for my package to get here, I can’t even return or exchange it bc it’s too big (I should have checked the return policy first) Unfortunately I won’t be ordering from stockX again."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Sam",
          "Nb_Reviews": 3,
          "Date": "2023-11-19T12:31:46.000Z",
          "Titre": "My Stock x experience was slow and…",
          "Contenu": "My Stock x experience was slow and painful. It took forever to process my order, then to find out they were being sent from Hong Kong!!!Trainers arrived and how these things passed there Authentifcation process is beyond me??Basically to cut a long story short one shoe is real and the other is fake. Again how they passed these is worrying...,even Stevie Wonder could of seen this!!! Then trying to get hold of Stock X was a mission in itself. All this AI chat BS sending you around in circles when you just need to speak to a human being was painful again. Avoid Stock X like the plague."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Porsha",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T03:53:01.000Z",
          "Titre": "It just took way too long to receive my order.",
          "Contenu": "I feel like this is a major company and to take as long as it did to receive my sons shoes I could have ordered them from china and got them sooner than we did."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jason Martinez",
          "Nb_Reviews": 4,
          "Date": "2023-11-26T15:10:37.000Z",
          "Titre": "You need to re-haul your entire company.",
          "Contenu": "You need better return policies. You do not honor the \"market\" prices, which is b.s. anyway and you cam make for easier communication. This whole new; \"Not leaving a number\" or making it extremely hard to call is.Shipping is very expensive too. Of I buy?, it's going to be $150 or under. To hell with the B.S. $600 plus shoes anymore that are worth $120.00"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JenBon",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T15:29:49.000Z",
          "Titre": "One Ugg slipper has a creased line down…",
          "Contenu": "One Ugg slipper has a creased line down the top of it that were not caught. With their return policy I have no recourse. Buyers beware."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Maggot Baby",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T07:46:12.000Z",
          "Titre": "open box",
          "Contenu": "The shoes look good but the package was delivered open.I checked my cameras and they were placed at my door with the tape not secure and the box flap was not taped down thoroughly"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kevin Phalen",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T00:51:03.000Z",
          "Titre": "I have made many purchases on Stock X",
          "Contenu": "I have made many purchases on Stock X. Every shoe arrived in great condition. I ordered the \"Korn\" Adidas shoes advertised as New/Unworn. Upon opening the box the tissue paper was horribly crumbled and the interior of the shoes appear to have \"sock fuzz\" in them. Very easy to notice as the interior of the shoes are white. I understand that Stock X is verifying the shoes as authentic, but in my opinion should also be looking at these details. These would not qualify as \"New\" to a person who collects shoes."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Syed Hussaini",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T06:51:18.000Z",
          "Titre": "Delivery date got rescheduled many…",
          "Contenu": "Delivery date got rescheduled many times, the seller needs to improve on shipping the item faster."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T12:42:30.000Z",
          "Titre": "disappointment t",
          "Contenu": "I don’t like the app. I prefer to to speak to a real person, when I have a concern. Had a an issue with an order an it wasn’t resolved, I feel. So, I won’t be using the app Again"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ashley",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T15:41:10.000Z",
          "Titre": "Skeptical and disappointed",
          "Contenu": "The country of origin  the shoes originate from how the verification is done and is a bit hidden.  The shoes promise to ship to the verification within a few days minus holidays and weekends, which took mine about a week and a half to even get verified and shipped… When I noticed it was coming from Hong Kong I was a little discouraged because I had never used this company before.  There are no phone numbers to talk to anyone. you have to wait till somebody send you an email to address your questions.  When I finally received the shoes, I inspected them, and was concerned because it looked like they had been worn, and that somebody tried to clean up the soles, but missed a few spots.  I’m upset because it said new never worn  and paid over $168 for the shoes and it is clear that they’ve been worn and cleaned.  If whoever was verifying, went over these shoes, a little slower, I believe they would’ve noticed that this has been worn or, they could advertise “shoe is new with minor imperfections from handling and trying on” I just feel all around that I was misled and I took a big leap of faith and spending this money on a pair of shoes that my son wants.  I am not satisfied with how this went down and I’m hoping to get some sort of refund… but as I waited so long to receive these shoes by the time that they could be replaced it’s going to be past Christmas… so definitely upset."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Raphael",
          "Nb_Reviews": 9,
          "Date": "2023-12-16T08:27:46.000Z",
          "Titre": "Usually good",
          "Contenu": "Usually good, they've put a shadowban on my account unjustly due to them not giving me a refund on shoes i didn't receive, I sell alot on this app and it was frustrating, so i contacted my bank to which they didnt like and have also randomly banned my brothers account, 2 dofferent addresses; and sometimes there prices online are different then on the app, so I'd recommend checking both before clicking buy now"
        },
        {
          "Note": 2,
          "Lieu": "FI",
          "Pseudo": "Jeremiah Hagins",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T21:16:33.000Z",
          "Titre": "First seller never shipped the shoes…",
          "Contenu": "First seller never shipped the shoes and they had to find another seller and wait for them to ship. The shoes were a gift so this caused a considerable delay. Most likely will not use StockX in the future as they didn’t offer to compensate or inquire if I’d like to cancel due to the delay."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert  Decker",
          "Nb_Reviews": 5,
          "Date": "2023-12-07T02:31:21.000Z",
          "Titre": "Not happy",
          "Contenu": "1. Add on fees not seen until transaction over.2. Package arrived pre-opened and damaged"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Sarah Kondorosi",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T21:41:33.000Z",
          "Titre": "Unfortunately my sneakers has some",
          "Contenu": "Unfortunately my sneakers has someWear and tear which means they likely weren’t vetted properly. They are still close to brand new and wearable but not at all how they were represented on the site"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ethan Berning",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T19:43:22.000Z",
          "Titre": "Check over your products carefully.",
          "Contenu": "When I received my product the shipping box was all trashed thank goodness what was in the box didn't damage my product and it was bearly sealed. I did get my product checked everything over and it's fine the box wasn't damaged. It was the shipping box that was all smashed and in bad shape the product on the inside was fine need better care of the actual shipping box."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Juliana Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T16:14:34.000Z",
          "Titre": "I reached out to costumer service right…",
          "Contenu": "I reached out to costumer service right away when i realized i had accidentally chose the wrong size. I tried to cancel the order or at least get them to send me my right size and now im stuck with shoes that don’t fit."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-19T07:20:55.000Z",
          "Titre": "StockX greed",
          "Contenu": "The bid was placed a while ago and the sneakers were purchased on November 1. Then I receive an email the seller backed out but do not worry we found another seller. However, the date sold magically changes to November 13 in StockX app. Which is obviously a lie. After the first buyer didn’t work out I should’ve been asked if I was still interested OR I should’ve been compensated. StockX once charged me a $75 cancellation fee as the seller because I shipped the sneakers 1 day late. Give me $25 back from that. The company keeps raising its fees and changing their rules. As a seller I’m held to a high standard… how come StockX isn’t held to a high standard when I’m the buyer?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gina Maria",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T05:27:24.000Z",
          "Titre": "Terrible Service",
          "Contenu": "Order was supposed to come way earlier than expressed & then my “matched seller” had to be switched to a new seller then i finally got a hold of someone on the chat help center and they didn’t even help me in the slightest.. the whole thing was sketchy and annoying"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Guy",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:55:29.000Z",
          "Titre": "seem OK",
          "Contenu": "Shoes arrived but the paper they were wrapped in was ripped and looked a bit dirty.  The box was crushed.  But the size and style was correct."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brian Richmond",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T19:15:28.000Z",
          "Titre": "When I received my shoes",
          "Contenu": "When I received my shoes, the box was completely ripped open and soaking wet. I’m not blaming stock x, but it was just a a bad experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JontaeO",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T20:59:27.000Z",
          "Titre": "I ordered my shoes for my wife on the…",
          "Contenu": "I ordered my shoes for my wife on the 30th of November it was delayed I contacted stock x to receive some sort of either compensation or even an opportunity to pay for extra shipping to it arrives sooner but instead I was greeted with a 30 min long wait only to then as soon as I connect with an agent have our chat end"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lydia",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:33:25.000Z",
          "Titre": "Shoes are for my son",
          "Contenu": "Shoes are for my son, Santa’s gift, and they smelled like cigarettes. The person who sold them either smoked in their home or something because the shoes were penetrated in cigarette smell, which now I am stuck trying to remove the smell before Christmas."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jania",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T14:11:21.000Z",
          "Titre": "Bad Vibes",
          "Contenu": "The fact that your not able to search express ship in filters to see what ships faster….Also there customer service is horrible you all are more so worried about your sellers then your consumers and that is an issue consumers is what makes your business thrive"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin Campbell",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:47:23.000Z",
          "Titre": "FIRST TIME USER…MY EXPERIENCE WAS JUST ‘MEH’",
          "Contenu": "Only 3 stars because of a few reasons. - Price (More expensive than any place else)- Shipping took a long time- Availability was good the week AFTER I ordered. So many places had these in stock after I ordered and I almost cancelled multiple times. Box was in great shape and I do not doubt the authenticity of the sneakers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aquatoneice Percy",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T06:13:38.000Z",
          "Titre": "The shipping was very timely",
          "Contenu": "The shipping was very timely. However, their policy won’t allow for returns. This is definitely very inconvenient if you happen to have an issue with the size or damaged merchandise."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Leslie Powell",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:36:04.000Z",
          "Titre": "Shipping Time + Customer Support",
          "Contenu": "I disliked the ridiculous wait time. I literally waited a month. Regardless of what the standard shipping option said, StockX did NOT uphold their end of the Standard shipping deal. Along with that particular problem that upset me, there was a miniscule reach out to me about the processes of my order. I say it was miniscule because the emails I would receive seemed automated. I felt that there was no real care about my order from a REAL HUMAN. StockX is now at the bottom of my least for a platform to purchase sneakers/clothes. I listened to past customers about the wait time problem and I thought y'all would've corrected it by now. Guess not. Glad my item is Authentic, that's why the 3stars. Doubt I'll come back to the platform for a purchase, probably just be on the App to check prices now."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Bloor",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:43:18.000Z",
          "Titre": "After my order had been received by…",
          "Contenu": "After my order had been received by stockx but not shipped - for several days I might add - I needed to change the recipient’s address. If it was possible, I was unable to decipher how on the website. In today’s digital world this should be a simple process, but clearly it is not here."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kyle Creteau",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T03:38:26.000Z",
          "Titre": "Lots of fees for this service",
          "Contenu": "Lots of fees for this service. Have many items cancel on me. I understand it’s an inconvenience for us both but it’s just really annoying."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T16:24:35.000Z",
          "Titre": "I like the prices",
          "Contenu": "I like the prices although the delivery time is a little long. What I do not like is waiting for an item I ordered for 10 days and then the order is cancelled and refund issued. Sometimes it is hard as the order is for a birthday or Christmas and there is no chance to replace."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ck",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:36:26.000Z",
          "Titre": "Upfront",
          "Contenu": "We were in a rush to find these shoes for my daughter’s Christmas. The initial grab from Stock x was that shoes were $151 and would arrive by Dec 25. After the dust settled, the shoes were $191 and there was a possibility that they could arrive by January 2.All is well though! The shoes made it- though they cost more than anticipated."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bulk Susan",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T00:40:52.000Z",
          "Titre": "I have ordered the same shoe twice…",
          "Contenu": "I have ordered the same shoe twice (11/28/23, 12/6/23,12/13/23) .  Today the second order was cancelled and referred to another seller and cancelled again, so I ordered a 3rd time.  It almost seems like a way to get more and more money from the customer. I know the problems may come from the seller and not StockX, but if you are paying a premium price for a product, StockX should stand behind the sale or stop dealing with those sellers that renege on the sale.  I hope the 3rd times the charm.  There will be NO more."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brandon P",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:01:55.000Z",
          "Titre": "Red mark in white shoe",
          "Contenu": "The process was quick and the shoe is comfortable. My only qualm was that when the order arrived, there is a red scuff on the tongue of my left shoe that’s quite noticeable. For paying as much as I did, this is unacceptable in my mind."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sharon Wright",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T17:32:53.000Z",
          "Titre": "Did took too long",
          "Contenu": "Did not deliver when first said the shoes I ordered would be here. The date of delivery kept getting moved forward.  Finally delivered yesterday. Don’t like waiting and wondering."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LaTina Love",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:26:08.000Z",
          "Titre": "Satisfactory Experience",
          "Contenu": "I liked the Fact that you had the shoe I wanted but once I made the purchase I didn't know when the shoe would come or if it was coming. I actually gave up because I thought I was being scammed.   but the shoe finally arrive and was in pristine condition."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeffery Metcalfe",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T02:39:58.000Z",
          "Titre": "The process was pretty straightforward",
          "Contenu": "The process was pretty straightforward, but the issue is that I ordered a pair of shoes and got confirmation that everything we good and then it got cancelled on me. The issue is that when I had to get the shoes again I had to pay $10 more than o paid the first time. Frustrating that something out of my control made me pay more for some shoes that are already pretty expensive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AMY SANDERS",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T17:04:40.000Z",
          "Titre": "Be cautious and ask lots of questions.",
          "Contenu": "I like that I can find items hard to find anywhere else, but the process takes forever, I placed my order in October and just received my package and although the product states it’s new in box, the box is in poor shape and the sneakers smell like cigarette smoke.  Very disappointing.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kristy Kumel",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:43:44.000Z",
          "Titre": "Fast shipment from selller to stock x…",
          "Contenu": "Fast shipment from selller to stock x and fast shipment from stock x to me but the shipping box was atrocious and barely taped closed ."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "DJ DTM",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T00:18:07.000Z",
          "Titre": "My package was delivered to the wrong…",
          "Contenu": "My package was delivered to the wrong address, I’m not really sure why but luckily I had a neighbour who picked it up from the front stairs of my building.I had a different address set as my shipping address but instead the package came to the address on my banking information.Porch pirates are active in my area this time of year but thankfully they didn’t get my shoes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ANNE CHRISTIEN",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T20:06:54.000Z",
          "Titre": "I know during the holidays things can…",
          "Contenu": "I know during the holidays things can get hectic and this review has nothing to do with the shoes themselves but with Fed Ex. The shoes were delivered on a Thursday, but they weren’t. Fed Ex sent a text notifying me of the delivery and signed by an individual I never heard of and does not live in my building. Waited a few days to file a claim with Stock X and lo and behold they show up 5 days later. No picture was taken and left outside by the Fed Ex driver when it would have been so easy to call me or someone else in my building by use of our phone system outside of the building. Packages are being stolen left and right. An unnecessary liability for $200.00 shoes if they would have just called. No idea where the shoes were for 5 days."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Lu",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:09:32.000Z",
          "Titre": "first order with StockX",
          "Contenu": "I was very impressed at the quickness of the order process.  The only thing I was upset about is that I was charged a different price than the receipt that came with the order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Madisen Paradiso",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T14:31:32.000Z",
          "Titre": "it was okay. not great, not the worst.",
          "Contenu": "it was ok. shipping and delivery got delayed and i was not updated about the status of my order. It took about 10-12 days to get a notification on where my shoes were. Once i reached out, i was then notified and my shoes were back on track. they look good. hopefully they will be the perfect gift."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melissa Love",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T17:18:24.000Z",
          "Titre": "Well to start with the positive I did…",
          "Contenu": "Well to start with the positive I did end up getting the product I wanted. The negative is the first time I purchased and was matched the product never made it to stock x and it took weeks to get a refund then had to do the process over so that’s frustrating."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Antonio Maglione",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T01:43:37.000Z",
          "Titre": "my experience",
          "Contenu": "I ordered the reebok question mid denver nuggets, great shoes, new and verified.Delivery time is good, it depends on different factors, I was lucky that my ordere has been shipped in 13 days (Italy).nonetheless there are something that left me like :/.the shoes' box seem soo old and gave the impression that the shoes was used, it's not new, so not a great impression at first sight.(I didn't receive stockx sticker, but not big deal).overall I suggest stockx!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sonny",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T16:17:02.000Z",
          "Titre": "Things that make you go hmm…",
          "Contenu": "In review of my first purchase I have a concern with the authenticity of the shoe. However, Second purchase was great. Perhaps I should have looked at the first pair before making another purchase. Not sure if I’ll be using StockX in the future."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "bfritchley",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T21:20:17.000Z",
          "Titre": "Shoebox destroyed",
          "Contenu": "slides were in good shape but the shoe box looked like it had been dropped in a swimming pool.  The cardboard was completely ruined and I had to discard the box and put them in an old shoe box for Christmas.  Thankfully these will be worn and not collected; otherwise they would have been returned."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LindsayMTX",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:01:37.000Z",
          "Titre": "First Impressions…",
          "Contenu": "Ordered twice because first pair never arrived. I had to contact stock x to get updated. Second try, Shoe box was damaged, paper inside was damaged and little teal bag that comes with the shoes is missing. Not superior service! Not packaged well so that the box is not damaged in transit."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "AW",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:14:08.000Z",
          "Titre": "Box has more damage than expected",
          "Contenu": "Box has more damage than expected. Shoes have scuff marks and aren’t in mint condition for the price I paid."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brenda Crabb",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T19:06:51.000Z",
          "Titre": "Excessive charges",
          "Contenu": "The product was available and arrived in a timely manner in spite of the extra authentication steps in the process and I sincerely appreciate that. However, the additional charges for taxes, shipping and “platform” fees added almost $100 to a pair of sneakers that already cost $315, is excessive and screams price gouging for the average consumer. While I do appreciate how well the process worked, thinking of all the kids whose parents cannot afford to even look at your website has made me question future purchases. Thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin C",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:36:29.000Z",
          "Titre": "Almost there",
          "Contenu": "I think the website could use improvements - after a purchase is made it brings you back to the show screen rather than a confirmation screen. Also need to be able to make multiple purchases at once instead of each shoe being a separate transaction."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shamel Ferguson",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:04:12.000Z",
          "Titre": "Shoes have delayed twice for shipping",
          "Contenu": "Shoes have delayed twice for shipping. It shouldn't take almost a month to receive an item or product that you purchased."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "eb",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:41:21.000Z",
          "Titre": "I didn’t like how my item wasn’t…",
          "Contenu": "I didn’t like how my item wasn’t package correctly and the of the item come damaged, I also don’t like the response I was giving when I made a complaint about it so I don’t think I’ll be shopping with stock x that much going forward"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Logan Smith",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T19:20:51.000Z",
          "Titre": "The return policy is a messy bit of bad business",
          "Contenu": "The shoes that came were attractive, but a size too small. The return policy is -- no returns; you have to relist the item. And StockX takes a cut coming and going: so, to break even, you have to relist at a price that no one is willing to pay. StockX gives themselves time to authenticate shoes, I wish customers had time to discover if they even fit."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Luis",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T20:25:33.000Z",
          "Titre": "Got my shoes...but it took longer",
          "Contenu": "My shoes were supposed to arrive within a week or so, but then I was notified that the original seller didn't comply with the order.  However, I DID receive my shoes, although it took an additional 10 days."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LJ Corbitt",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T20:45:44.000Z",
          "Titre": "Box came in crumbled",
          "Contenu": "Box came in crumbled, diminishing the resale value, but there was no help button or anyone to message about it."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Marc Lalonde",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:38:24.000Z",
          "Titre": "What I received is not exactly what I…",
          "Contenu": "What I received is not exactly what I ordered. Color detail is different"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-12-16T21:08:52.000Z",
          "Titre": "Refund would be nice",
          "Contenu": "I accidentally ordered M9.5 W11 because W11 as listed first 😕 and no returns so that sucked. Ended up reselling them but lost money. My fault but returns would be nice."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John H.",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T05:19:16.000Z",
          "Titre": "Overseas releases",
          "Contenu": "I gave this review because I received the overseas release of the Air Jordan 11 Gratitude. I’ve had great experiences with all the other purchases here, it’s just the overseas release of the shoe has a more yellowish sole than the US release so I returned them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donaven Rector",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T01:20:04.000Z",
          "Titre": "Given a stolen product that I waited 2…",
          "Contenu": "Given a stolen product that I waited 2 weeks to receive now I have to send it back and wait for a refund to buy the same product again from another retailer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason Scanlan",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:27:47.000Z",
          "Titre": "Very slow delivery of product",
          "Contenu": "Very slow delivery of product. Not impressed with seller service. I’ve had 2 products ordered and both were dropped. Is the average time 3 weeks?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "olivia",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T13:49:24.000Z",
          "Titre": "I paid large amount for these shorts",
          "Contenu": "I paid large amount for these shorts, I ended up getting refunded twice before finally getting a pair to actually ship to me. The hoers came with a. Cut in the bag. Very disappointed as I paid over 150$"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jenine Helfrich",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T00:58:34.000Z",
          "Titre": "Good service but bad experience",
          "Contenu": "The service it good bc it verified the item for authenticity and condition.    However, my experience was bad bc it was my 1st time using and the website wasnt updating my status.    So I placed an order 3 times, not realizing all three went through.    They only gave me a full refund for 1 pair.    Which half good news.   Not 100% satisfied…sorry."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kathi",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T05:22:06.000Z",
          "Titre": "My grandson was desperate for these…",
          "Contenu": "My grandson was desperate for these shoes I purchased.  He loves them; however, I found them after purchase and delivery at a much lower price.  Disappointed in myself for not spending more time searching"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jaden Ureste",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T02:41:41.000Z",
          "Titre": "overall good but shipping was terrible…",
          "Contenu": "overall good but shipping was terrible took a really long time good shoe though"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Bobby",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T17:22:45.000Z",
          "Titre": "When buying from Canada",
          "Contenu": "When buying from Canada, the lowest ask number is skewed to include some taxes or duty. I wish there was more transparency."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T18:43:18.000Z",
          "Titre": "Possible counterfeit sneaker",
          "Contenu": "I am concerned that the picture on Stock X does not match the shoe I saw in the store. The difference is subtle but very concerned that these are a Christmas gift for my daughter and she will be able to spot a fake immediately"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Juls",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T19:50:37.000Z",
          "Titre": "Shoes dope but one of the hardwear…",
          "Contenu": "Shoes dope but one of the hardwear pieces was missing. The brass shoe lace hole at the top. Disappointing considering they were almost $300 shoes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kamilla P",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T19:16:32.000Z",
          "Titre": "Just wow😹",
          "Contenu": "Can’t complain, but I liked the prices way more before all the ridiculous taxes were included! I payed almost $40 for taxes!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Beth Grey",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T00:42:12.000Z",
          "Titre": "Was bummed when I opened it box was…",
          "Contenu": "Was bummed when I opened it box was crunched and the shows have a few marks on them so not new condition as stated"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tracy Hill",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T16:27:18.000Z",
          "Titre": "First order had shipping issue",
          "Contenu": "First order had shipping issue.  Order was refunded and I had to reorder.  By this time the cost had increased $30."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ali Elbeik",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T16:23:55.000Z",
          "Titre": "Quality control sucks",
          "Contenu": "QC sucks you let deadstock shoes with scuffs on them pass. You should also give buyers the option to cancel orders if the first seller didn’t pass verification."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christine",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T18:21:46.000Z",
          "Titre": "Right shoes, not great delivery timing",
          "Contenu": "Thought the website payment section was confusing and got an unexpected email from someone asking for payment when I had already paid. Took a long time to actually get the shoes ordered. Not my fave shopping spot."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Debra",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T21:46:39.000Z",
          "Titre": "I don't find the website the easiest to…",
          "Contenu": "I don't find the website the easiest to use.  The bidding process is confusing.  In my opinion, if you want something, you have to do the Buy it Now option.  Also, it is concerning to me how many items are coming from China.  Hopefully, they are being authenticated here in the US.  I have bought here a few times, but still feel some concern every time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maxie Aguilar",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:11:25.000Z",
          "Titre": "The shoe box is kind of dented",
          "Contenu": "The shoe box is kind of dented not kind of happy but otherwise it’s all good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Awokenwook",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T00:10:52.000Z",
          "Titre": "Could have been packaged nicer",
          "Contenu": "Shoes came in great condition, but the box was torn and beat up, plus the paper around the shoes in box was dirty and torn as well."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Ross",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T01:57:58.000Z",
          "Titre": "Too much spam, little info on eta",
          "Contenu": "Received little information about shipping and estimated time of arrival and way too many spam emails"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Des",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T23:08:45.000Z",
          "Titre": "Order was fine",
          "Contenu": "Order was fine! They don’t provide a tracking link for FedEx. My package was delivered to the wrong address and I couldn’t see any photo proof of delivery. Luckily my neighbor returned it"
        },
        {
          "Note": 3,
          "Lieu": "SA",
          "Pseudo": "Faisal Aldosari",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:08:34.000Z",
          "Titre": "i received one of my recent orders missing",
          "Contenu": "i received one of my recent orders missing the dust bag which is supposed to a company the product, i should have been informed prior to shipping the product, nonetheless your service is spectacular."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kathleen Haggerty",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T23:50:45.000Z",
          "Titre": "Customer Service at StockX was great…",
          "Contenu": "Customer Service at StockX was great and quick to respond to my question on an order update.  I am new to this process and am disappointed to learn that a seller can immediately receive payment from me but then be unable to fulfill the order.  I waited days (Bid accepted on Nov 30 and I made contact on Dec 6) for an update that the item was shipped only to find out the seller could not fulfill the order after I asked.  I have a refund in process and appreciate the staff of StockX.  But, I hope the seller has some ramification for posting, accepting, and then being unable to complete the transaction.  I can't back out after they accept the bid.  Seems shady that they can."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ANDREW FRANCIS",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T07:14:00.000Z",
          "Titre": "Long wait",
          "Contenu": "The shoes are great.  However it took forever to arrive.  The original seller never sent the shoe in for authentication and stock x had to match me up with a new seller, this caused me to not have a gift for someone on their exact birthday which is a shame because It was ordered a month in advance."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Adil Khandwala",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T14:46:10.000Z",
          "Titre": "Shoe apparently \"passed\" QC",
          "Contenu": "Shoe apparently \"passed\" QC, but when I received the shoes, there was as clear scuff mark on the side. I've reached out to support, and TBD on the end result...very frustrating nonetheless.**UPDATE**StockX customer service replied and was understanding and apologetic about the error. They offered me the ability to return the shoes for a full refund or provide me with a $30 site credit. Customer service handled the situation appropriately, but this should not have happened in the first place. StockX should consider allowing sellers to post pictures of the EXACT shoe for sale in the seller stock instead of a stock photo."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tracey Kehler",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T18:22:38.000Z",
          "Titre": "Shoes arrived smelling like cigarette…",
          "Contenu": "Shoes arrived smelling like cigarette smoke. Service was good, but a bummer to pay good money for smelly shoes"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Baby Yoda MN",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T20:46:20.000Z",
          "Titre": "The shoebox came badly damaged and the…",
          "Contenu": "The shoebox came badly damaged and the right shoe itself is also badly shaped - For the price charged I could’ve just bought them without the box or another site."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jessica Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T04:28:26.000Z",
          "Titre": "The threading on the shoes were all…",
          "Contenu": "The threading on the shoes were all coming undone. Terrible quality."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T00:26:49.000Z",
          "Titre": "Seller’s shoes were not approved",
          "Contenu": "Seller’s shoes were not approved, no fault of StockX and appreciate the legit check and the price match with a new seller, but overall process took too long. Maybe overnight replacements after failed first transactions. Thank you!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Debbie Brodinsky",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T18:12:30.000Z",
          "Titre": "Quick shipping",
          "Contenu": "Quick shipping. Great product, but the return policy is length. My shoes were too small and I had to send like 5 pictures. Now under review.  Haven’t heard yet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roberto Ramirez",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T20:42:10.000Z",
          "Titre": "Order Issue",
          "Contenu": "I placed an order on 11/20 and haven’t received it yet. The item hasn’t been sent to StockX yet. Granted seller is still within window to send to StockX, but pushing the 7-10 days with last week’s holiday. Placed an order on 11/23 and already received. Just concerned I will look at alternatives if seller doesn’t deliver and reordering something to arrive in time for the holiday."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ashley Vaughan",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T03:05:19.000Z",
          "Titre": "Cancelling order",
          "Contenu": "I emailed telling them that I needed to cancel my order because it was going to arrive too late, was told that since it “was still processing” that I couldn’t cancel? I hadn’t been charged so I didn’t see the issue. Found a different seller and was able to get the shoes earlier SO now I’ve got two pairs of the same shoe. Hence why I had requested to cancel it. I’ve never had any issues with the company in the past."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PACmomma",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T20:24:53.000Z",
          "Titre": "good but...",
          "Contenu": "Glad to get my hands on shoes that are hard to find. But I dislike that immediately after a purchase while it's pending there is no room to tweak the order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JG",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T14:21:42.000Z",
          "Titre": "Box arrived pretty severely damaged…",
          "Contenu": "Interior shoe box arrived pretty severely damaged which is not helpful to a collector. Kind of disappointing. I understand that they inspect the shoes when sent in, but you should not be sending things to collectors with terribly damaged boxes. It completely devalues the item and makes them impossible to resell down the road. This should be treated just like the shoes and returned to the seller when they show up for inspection in a ruined box."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "The M",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T22:26:22.000Z",
          "Titre": "Not the best first impression.",
          "Contenu": "So this was my first StockX order. This purchase was for a pre order, Jordan 3 Fear 2023. The order was processed and received relatively fast compared to what I expected. The shoes arrived fine but they seemed a bit disheveled. I feel that the person who did the authentication was a bit careless. Laces were not tidy, an insole on one of the shoes wasn't in straight, the box paper was ripped and the authentication tag was loose in the box. Not a good representation or motivation of a future order. There was a processing fee as well and I don't recall every paying a verification fee elsewhere. Overall not a great first impression."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph F.",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T19:45:32.000Z",
          "Titre": "not satisfied",
          "Contenu": "overall the return process went well, but I have yet to get an update in regards to the outcome. I replied to the email I was in contact with Isabella that I would like to get the pair of shoes that I originally ordered but she has yet to respod. I guess I'll have to open up a new ticket to resolve the issue. so overall all I'm not happy with the end result."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melissa Martin",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T20:54:26.000Z",
          "Titre": "Damaged box",
          "Contenu": "When the expensive pair of shoes arrived the box it was shipped in was damaged as well as the box the shoes were in.  For the amount of money spent, the box should have been intact."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "A Bills fan",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T05:00:48.000Z",
          "Titre": "Good product, slow shipping",
          "Contenu": "I ordered a really popular shoe and the shipping took forever like over 3 weeks. You guys just need to do a pre-verification on popular shoes so you can ship them right to customer like GOAT does. Other than that everything was fine my shoes were straight packaging good and everything neat and tidy quality was there just slow ass shipping. All that being said though I will use stockx again"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "sammie brown jr",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T15:51:30.000Z",
          "Titre": "Usually my experience with Stock X is…",
          "Contenu": "Usually my experience with Stock X is good this last time wasn’t I placed a order it was confirmed but seller didn’t hold up there end it’s been 6 days and they have not sent out the shoe which I purchased for someone as a Christmas gift now I’m sure they won’t receive it on time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bree B",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T05:04:02.000Z",
          "Titre": "I was originally paying for a lower…",
          "Contenu": "I was originally paying for a lower price for the same shoes. But ended up getting a refund for it a few days later. I went back to check if the shoes were unavailable or not. The shoes in the exact size I was looking at before was still up but for a higher price. I didn’t understand why the sudden up charge for the same shoes in the same size but I was quite upset and dissatisfied by this result. However, I will say that Stock X did still had the lower cost option than the other websites and the shoes did come in premium condition. Just wish I could have bought them for the original price I was told."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T04:44:30.000Z",
          "Titre": "I had chosen PayPal extended pay",
          "Contenu": "I had chosen PayPal extended pay. I chose to pay in 4 installments. This appeared on the invoice. Although my debit card was charged the total amount. No explanation was given."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jody",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T21:03:34.000Z",
          "Titre": "Awful packaging",
          "Contenu": "Shipping was very slow! The packaging was completely destroyed, package was open and item was  falling out of the package. I am sure it was from shipping but it was bad. I haven’t had a chance to check the item, hoping it’s not ripped! I can send a picture if you would like. My name is Jody Cantu"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "L. H.",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T20:11:59.000Z",
          "Titre": "Missing Old School Receipt",
          "Contenu": "Shoes and box were in great condition. However it was missing the old-school receipt that was originally included in this relaunch. Disappointed that it wasn't in the box upon arrival."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T01:36:20.000Z",
          "Titre": "Shoes showed up in a dented box",
          "Contenu": "Shoes showed up in a dented box, couple loose threads, excess glue on the toe and a couple of the sewn lines on the top of the left shoe were crooked."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Erko Abdurahman",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T19:30:14.000Z",
          "Titre": "The delivery was alright",
          "Contenu": "The delivery was fine. I didn't like how the box was a bit beat up. Not just that, it took a long time to deliver."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Peter Creighton Jr",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T22:00:01.000Z",
          "Titre": "From purchase to delivery was crazy…",
          "Contenu": "From purchase to delivery was crazy long."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "aiden",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T21:59:43.000Z",
          "Titre": "i have never heard of stockx before i…",
          "Contenu": "i have never heard of stockx before i bought a pair of nike tech joggers and it’s taking ages for the seller to ship to stockx and the live chat don’t work at all"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MiMi",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T15:49:02.000Z",
          "Titre": "Arrival Time",
          "Contenu": "When it finally arrived the product was great and my grandson loves the shoes.  However all the extra fees were ridiculous especially how long it took for them to arrive.  I would get a notice that they were coming and get one that they were delayed.  Honestly I don't know if we will purchase from the company again...Their reply is why we will not purchase from this company again...Customer Service is terrible!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T21:19:08.000Z",
          "Titre": "Could be better",
          "Contenu": "While the shoes themselves are in great condition(read new), the box they came in and the paper in the box was ripped/torn, which definitely reduces the value original packaging would provide for limited edition shoes. Ultimately, they're a gift so it's not world ending, but I was hoping for better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dana Urey",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:33:44.000Z",
          "Titre": "I don't like that I can't return my…",
          "Contenu": "I don't like that I can't return my purchase. The shoes I ordered are nit what I expected and now I'm stuck with a 120 dollar pair of shoes i don't want. I wish I could return them!"
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "MaPe",
          "Nb_Reviews": 4,
          "Date": "2023-12-08T23:21:53.000Z",
          "Titre": "Good quality if one has time to wait for delivery...",
          "Contenu": "I liked the quality of the product, new, as described, the fact that Stockx kept me up to date al the time about the status of my order.I disliked the long delivery time - 20 days it's just to long."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "First-time customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T18:42:02.000Z",
          "Titre": "Buyer beware",
          "Contenu": "The shoes were exactly what I ordered. What I didn’t like was the handling fee ($6) and the shipping fee ($14). If I had waited for New Balance to restock the shoe I’d have paid a lot less. Shipping would have been free. The low price of the shoes at StockX was deceiving. And I’m still hoping they aren’t knockoffs. Fingers crossed. Buyer beware."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nita Davis",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T05:00:08.000Z",
          "Titre": "I submitted a bid for shoes",
          "Contenu": "I submitted a bid for shoes. It took 6 days for the bid to be accepted. I didn't hear anything from stockx for 6 days while waiting for the bid to be accepted or denied. So I bought a different pair of shoes from stockx because I thought my original bid wasnt accepted. Then the bid on the first pair was finally accepted and my card was charged. I wasn't expecting to buy 2 pair of shoes. It was frustrating. Stockx replied to my review by saying to me that stockx works on bids and then accepts or denies the bid. I already knew this.  It shouldn't take 6 days to accept or deny a bid meanwhile leaving the customer in the dark to wait, not knowing what is happening with their bid."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shane Olden Jr.",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T23:19:08.000Z",
          "Titre": "Box might be in good condition but also might have a slight tear.",
          "Contenu": "Shoe seems to be in good condition but the box was torn on the edge and the corner was smashed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "A.O.",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T21:26:04.000Z",
          "Titre": "All good except shipping timeframe",
          "Contenu": "The quality of the product and verification process is excellent and the buyer interface is super user friendly. The reason for three stars is the shipping timing. StockX could definitely invest in providing priority shipping labels to sellers and expedite the verification processes. Overall, it took over 2 weeks to receive the product I purchased."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cristina",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T17:45:21.000Z",
          "Titre": "Size not listed correctly",
          "Contenu": "Good general experience, but sizing was not correct. Shoe was listed with American shoe sizes, but the shoe is bigger, UK sizes. So, the listing didn’t match the shoe we got."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jose Mateo",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:04:30.000Z",
          "Titre": "I ordered a sweater and the order about…",
          "Contenu": "I ordered a sweater and the order about a week late. But after that everything was great"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jamie Pallas",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T20:55:54.000Z",
          "Titre": "Purchasing the shoes was quick and…",
          "Contenu": "Purchasing the shoes was quick and easy. Shipping was the hard part. I live in a small town and our physical address are not verified and we get our mail to a P.O. Box. You do not ship to a P.O. Box. I had to ship the shoes to a family member in another town to have them ship them to me. I wish there was a way to put both a physical and aPOBox on the mailing label."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roxi W",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T19:39:50.000Z",
          "Titre": "Disappointed",
          "Contenu": "The outer box & the actual shoe box was wet. And what's with the processing fee? I was better off using Nike.com. I'll end up paying the same amount. Sorry but very disappointed"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris Berrier",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T03:40:22.000Z",
          "Titre": "Not bad if you get a good bid.  3% processing SUCKS!!  Adds up also if large item. My 230 shoes cost 281 after tax processing and shipping!",
          "Contenu": "It's  okay the processing Fees are garbage as $15 is already very high 2 ship 1 item!🤔  I only use if the bid I get is low enough to offset the BS fees they add on!  They don't need 3% thats just another TAX on us!  I use waaaaay less now then I did because of the stupid ass BS processing fees and high shipping costs!  Otherwise I have only had 1 issues with a Rolex but all 12 other items came just fine and were authentic. 👍💚"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pablo Vidal Arean",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T04:50:56.000Z",
          "Titre": "Great catalogue but terrible purchasing experience",
          "Contenu": "Great catalogue. Misleading purchasing process, where bids do not seem to be real. Purchase process where product is shipped to Stockx then to us...a bit weird and not very trustworhty"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sean Lee",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:57:57.000Z",
          "Titre": "The process is too lengthy and the…",
          "Contenu": "The process is too lengthy and the variables are many."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "anisa berlanga",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T19:12:54.000Z",
          "Titre": "Shoes were delayed due to issues with…",
          "Contenu": "Shoes were delayed due to issues with original seller. Second seller send shoes that had a huge amount of creases."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Valencia",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T02:34:02.000Z",
          "Titre": "Dislike the “processing fees” etc,makes…",
          "Contenu": "Dislike the “processing fees” etc,makes what was a affordable pair of shoes,outrageously expensive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph Fogle",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T20:06:05.000Z",
          "Titre": "Tracking system could be better",
          "Contenu": "Tracking system could be better. Your item can show delivered and it’s with the authenticater and that’s what tracking shows until your package is delivered"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Candice Rich",
          "Nb_Reviews": 5,
          "Date": "2023-12-04T13:15:09.000Z",
          "Titre": "I’m happy I was able and could afford…",
          "Contenu": "I’m happy I was able and could afford to purchase. But, I will always have a huge hatred,for having to go through such lengths, and spend almost doubled to purchase something that isn’t available with the original merchant. We have to pay you, the middle man, much more if we really want it. How you’re able to get merchandise that’s sold out, and pay more for it, is shady asf. We are at the mercy of this if we want it bad enough. The bidding and all that, you’re still paying more for it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T21:34:00.000Z",
          "Titre": "Fast Process/Lackluster Packaging",
          "Contenu": "Fast processing and shipment, but lacked in packaging. Ordered a Supreme bogo from the recent drop, and it came delivered in a thin non-padded mailer. I feel like with this being a high value name brand clothing item it should have been at least padded because of the shipping/processing cost. That or preferably in a tamper-sealed box. The thin mailer made the experience feel less valued as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ezbncc",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T02:57:34.000Z",
          "Titre": "To bid or not to bid…",
          "Contenu": "Like the bid process just not how long it takes before u know if your bid is accepted or not! Quicker responses in the bid process, help you to know whether it’s worth just to purchase at list price or not."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jane",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:35:49.000Z",
          "Titre": "Shoes were exactly as ordered",
          "Contenu": "Shoes were exactly as ordered. Came in their shoebox and outer box arrived in good shape. Delivery updates because of shipping was a bit disappointing. The extra \"processing fee\" when ordered was an unexpected expense making the purchase from the site not the best value."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brenda Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:43:01.000Z",
          "Titre": "This was the second time in a row I…",
          "Contenu": "This was the second time in a row I ordered with them had no issues only thing that needs improving is when you first go on the site. I had difficulties trying to get the order in and then was locked out of my Google mail for several hours because something went wrong, but otherwise very pleased with the product, and in the manner in which it arrived before Christmas"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ALI BRUCKNER",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T16:03:28.000Z",
          "Titre": "As a first timer I was a bit nervous",
          "Contenu": "As a first timer I was a bit nervous.  I like the \"quality\" check but it unfortunately adds on to the shipping time.   The bidding process was a bit confusing for me but overall a good experience."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Stephanie Jané",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:27:37.000Z",
          "Titre": "Over communication was annoying but received our shoes earlier than anticipated",
          "Contenu": "We received our shoes in a good timeframe. There was some confusion in communication when I wanted to change the address and I received extra emails when I thought it had already been resolved. This wasn’t a huge impact on the service but it was annoying and that’s the reason for the loss of one star in my review."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cathy Fisher",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T03:38:13.000Z",
          "Titre": "Easy to order the item",
          "Contenu": "Easy to order the item - but thought we needed to change the address of delivery when we saw it was going to take longer than we thought to deliver. There was no way to get any one’s attention, no one ever responded to any emails or notices o tried to post- no one to help!!!  Good news, order date did change and she is very pleased with her selection ( nice tennis shoes)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roman Figueroa",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:43:27.000Z",
          "Titre": "Pricing has gotten better availability…",
          "Contenu": "Pricing has gotten better availability as well.  Delivery could be a little faster . But very happy with my purchase and I will continue to purchase in the future.  Also love that you have made PayPal pay later an option.  That really helps the buyer ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T19:10:17.000Z",
          "Titre": "I am mostly pleased with my transaction.  :)",
          "Contenu": "I am very pleased with my transaction.  The process was smooth and easy.  My purchase arrived in a timely fashion.  The only thing I'd would suggest is that the OVERALL price be made more attainable at the onset.  This being my first purchase on this site, I was more than a little surprised when my $264 purchase ended up being $325 after the smoke cleared.  I understand that figuring tax will be different for each order depending on where the customer is, but the processing fee and shipping cost should be fairly easy to factor in.   The \"total payment\" surprise was almost enough to make me change my mind. Had I known when I was initially searching, I believe I would have been okay with it in the beginning.  That's all."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven H.",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T20:17:05.000Z",
          "Titre": "Smooth transaction overall",
          "Contenu": "Smooth transaction; item arrived in new condition as described.  Only 4 stars because the box the shoes came in was damaged, since the original shoe box was shoved into too small of an outer shipping box, but the shoes were fine.  Bought them for my wife to wear so didn’t care about the box, but if these had been collector sneakers it would be a very different story as the box adds value."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Claudine Lapointe",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T00:37:31.000Z",
          "Titre": "Constant feedback as to the status of…",
          "Contenu": "Constant feedback as to the status of the order. One rough experience for my son’s birthday when an order placed was cancelled 2 weeks later leaving no time to turnaround"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SF",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:59:35.000Z",
          "Titre": "Great deal fast shipment",
          "Contenu": "Great deal on a pair of shoes that are difficult to find.  Arrived quickly and in perfect condition.  However, the delivery person placed the delivery in our neighbor's workshop."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T05:25:09.000Z",
          "Titre": "It is an interesting experience with…",
          "Contenu": "It is an interesting experience with StockX. We received what we ordered in good condition. It did take a little while, and I wondered if we would receive it, but it all worked out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CHreviews",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T07:38:58.000Z",
          "Titre": "Item as described",
          "Contenu": "Item as described. Took slightly longer because original seller did not fulfill order. However, StockX found another seller who accepted same price. Great options for finding limited stock or classic items."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Harriet",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T18:38:34.000Z",
          "Titre": "Confusing",
          "Contenu": "Different purchasing experience: Thought I was bidding on a pair of shoes, now I’m not sure, found the process confusing.  DHL delivery people wanted me to use their app, I don’t want another app.  Ultimately, DHL delivered the shoes, I have my purchase in hand and all is well, just a lot of extra thinking for a pair of shoes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AJ -Kickedalchemy",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:19:42.000Z",
          "Titre": "Pretty quick with my pay outs and…",
          "Contenu": "Pretty quick with my pay outs and authentication process. Shipping times can be slightly longer if buying sneakers but so far so good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JoAnn Lahners",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:32:05.000Z",
          "Titre": "It was very easy",
          "Contenu": "It was very easy - I could not find this anywhere.  However I believe they are not the PLATFORM slipper but the regular (which is not what I wanted)  So the only downfall is you can't return it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kristin",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T20:46:03.000Z",
          "Titre": "I think Stock X does a great job",
          "Contenu": "I think Stock X does a great job, I just continue to be aggravated by how expensive it is to buy shoes through Stock X. People take advantage of consumers by buying up all of the stock and then I get stuck paying nearly twice the price after, the premium, fees, shipping etc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Trouts",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T20:01:20.000Z",
          "Titre": "Review",
          "Contenu": "Shipping was fast, shoes came in tact, website is designed well, everything is all good BUT some of the extra fees for purchasing are kinda ridiculous in my opinion, I ended up buying shoes being sold like 5$ under retail I believe and ended up paying 15$ over retail entirely made up of extra fees. I mean, I get it processing fees, shipping fees, whatever but like damn."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Peter Veiga",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T21:30:25.000Z",
          "Titre": "The app created two orders when I only…",
          "Contenu": "The app created two orders when I only wanted one. However, they were quick to reverse the duplicate order a few days later. Phone support rather than a chat box would have gone a long way to reduce the anxiety while waiting days for acknowledgement that the duplicate would be reversed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debra Gatewood",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T00:00:56.000Z",
          "Titre": "The item came on the original day they…",
          "Contenu": "The item came on the original day they said that it would. I was worried as I didn’t realize it came from overseas and had to clear customs. Best thing ever that it came for Christmas,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Veronica Contreras",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:29:18.000Z",
          "Titre": "Shoes",
          "Contenu": "At first I was reluctant to order from here because I had never use this page, but it was done with no problem, since I found what I was looking for. A Christmas gift for my daughter"
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Tom",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T22:33:10.000Z",
          "Titre": "Prompt service, effective communication",
          "Contenu": "We were able to source some products through you which were unavailable at multiple vendors elsewhere - very pleased. Only hiccup was a switch of supplier at one stage - with a later delivery date (we would have missed Christmas), without the option to cancel. However this was remedied and the package arrived on time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sophia Contreras",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T09:08:31.000Z",
          "Titre": "good",
          "Contenu": "Checkout was fast and easy only complaint was shipping took quite a while other than that no complaints 👍👍"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mr EW",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T05:20:42.000Z",
          "Titre": "Timely and product arrived as…",
          "Contenu": "Timely and product arrived as described. FULL cost should be upfront prior to submitting order. Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tammy Stinson",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T21:31:44.000Z",
          "Titre": "I love how quickly my package arrived",
          "Contenu": "I love how quickly my package arrived. The shoes were perfect; a little pricey but I couldn't find then anywhere else."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Arturo Ortiz",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T17:18:33.000Z",
          "Titre": "It was a intuitive experience",
          "Contenu": "It was a intuitive experience, easy to buy and track the order. The only thing I didn't like was that the inside of the shoe  had a red stained, that should be checked in the verification."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Warren Jenkins",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T04:15:18.000Z",
          "Titre": "helped me find a product I couldn't find",
          "Contenu": "helped me find a product I couldn't find elsewhere, and got it shipped to me in the time span I needed. Great correspondence from order placing straight through to delivery."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Marena",
          "Nb_Reviews": 10,
          "Date": "2023-12-20T15:37:59.000Z",
          "Titre": "Purchase arrived quickly",
          "Contenu": "Purchase arrived quickly. I was worried at first as upon reviewing myPurchase it stated that I didn’t purchase anything. But it turned out ok in the end. Very happy"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CF",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T17:48:15.000Z",
          "Titre": "First time buyer on stock x",
          "Contenu": "While I received the product I ordered, the process was long and expensive, which is why I took a star off. However, I did appreciate all the updates and keeping me informed of the progress."
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Allan Laul",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T09:28:53.000Z",
          "Titre": "Generally it was good that delivery…",
          "Contenu": "Generally it was good that delivery arrived. Unfortunately the wrapping of delivery was not so good. Package was damaged from several places. If StockX ask such a high price for shipping and extra service then I as customer would expect to receive something for this service."
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "Gonçalo Jardim",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T13:37:33.000Z",
          "Titre": "Order took 1 week longer than expected…",
          "Contenu": "Order took 1 week longer than expected but it was due to the seller and not StockX. They were fast at getting another seller and received my shoes the following week. Good service, nice shipping tracking system."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T19:38:38.000Z",
          "Titre": "You can’t find great items but watch for fees",
          "Contenu": "I was able to get a pair of shoes my boyfriend has wanted for a long time. Unfortunately I felt like there were hidden fees I wasn’t fully aware of until I was checking out"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lariza Carlson",
          "Nb_Reviews": 4,
          "Date": "2023-12-16T17:50:12.000Z",
          "Titre": "Everything, with the exception of returns is great",
          "Contenu": "After some time trying to contact StockX I was able to return the item but it still needs to be assessed before refund.  Very difficult process but otherwise was good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deb",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T20:17:36.000Z",
          "Titre": "I liked the selection and how easy it…",
          "Contenu": "I liked the selection and how easy it is but I really think there needs to be at least a 30 minute window that the customer can cancel or edit their order if they see there’s been a mistake. Stuck with a pair of shoes I do not want because I ordered in wrong sz. Just a hassle to have to try to resell them"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Danean Doheny",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T20:56:19.000Z",
          "Titre": "pricy",
          "Contenu": "pricey for crocks but was left no alternative to buy them because it's what my son wanted"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keithbme",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:46:03.000Z",
          "Titre": "I got shoes that were sold out and I…",
          "Contenu": "I got shoes that were sold out and I got them at a reasonable price... I just don't like it takes so long to come one pair came before the other and they were order second ... But thank u I love it"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ethan Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T19:07:32.000Z",
          "Titre": "Shoes arrived as expected",
          "Contenu": "Shoes arrived in great shape as expected. Delivery status was constantly changing within the app and on the DHL Delivery site. Would be nice to see more accuracy between the app and the delivery service.!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kari Miner",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T22:19:56.000Z",
          "Titre": "Candy Corn SB",
          "Contenu": "The shoes I ordered are brand new and they arrived quickly. With it being the first time buying from stock x, I was a little skeptical when I placed the order. Stock x kept me updated as to when and where my package was. The shoes are in perfect condition. Thank you! All is well. Of course, as with any processing fees, none of us like to pay them. I understand the reason for them, doesn't mean I have to like to pay them..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephanie M.",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T19:29:18.000Z",
          "Titre": "Quick but incorrect box",
          "Contenu": "The shipping was fast which is always. Uggs were the correct style and color. However, the box was incorrect devaluing the credit of the authenticity if I were to resell. That’s disappointing coming from a company that is known for their vigorous authentication process."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Liam Wefing",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T16:26:24.000Z",
          "Titre": "The item page shows to many prices…",
          "Contenu": "The item page shows to many different prices. Also I could have gotten the wallet for cheaper on their own website…"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kay Macek",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T18:13:59.000Z",
          "Titre": "The product arrived in a timely fashion…",
          "Contenu": "The product arrived in a timely fashion with good updates on delivery.  The shoes are a gift for Christmas to my son as he asked for them - however, it is a surprise and he has not opened them yet so I can not do a honest review on the product!  I hope he loves them!  Currently they are under the tree!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bee",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T07:21:29.000Z",
          "Titre": "Process went well shipping took longer…",
          "Contenu": "Process went well shipping took longer then expected due to being linked with a seller in Europe."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Bb",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T00:30:54.000Z",
          "Titre": "Why the delay?",
          "Contenu": "I purchased shoes Nov 28th and they weren’t delivered until Dec 15th. I was notified there was a delay without any further explanation."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jesse Gilsrud",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T04:56:13.000Z",
          "Titre": "Better customer service/ accountability",
          "Contenu": "Goat sent me fake Jordan 1 lost and founds.    So that gives you guys (StockX) a one up on them. I’ve yet to get a fake. But quality control on items sent need to be better. If received damaged items from stock x twice now but, I understand that happensAccountability is important."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rachel Cugini",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T02:29:08.000Z",
          "Titre": "The sneakers looked as promised however box did not",
          "Contenu": "The sneakers looked as promised, new however the box was pretty worn and ripped slightly. I think it should have been listed as such for this kind of money. It was almost $75 in fees which is ridiculous."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Miguel Gomez",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:09:26.000Z",
          "Titre": "My first purchase, Great service and delivery times",
          "Contenu": "The order arrived in good condition, like new and original. The process was somewhat slow because the first seller did not comply with StockX policies, but I did not have to do anything additional, StockX solved everything and they found me a new seller and for the same price, but affecting the delivery date initially estimated (thats why 4 of 5 stars), affecting the experience a little, in any case they met the new delivery date and arrived on time, I am surprised that the shipments are so fast, from China to Mexico in just 4 days, impressive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen Crebase",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T15:21:22.000Z",
          "Titre": "High prices, hidden costs but great access to products and good service",
          "Contenu": "Although prices are high and the additional fees are expensive, and shipping requires you to pay for each item individually (which of course makes the cost of shipping high as well), you can find items that are sold out everywhere else.  Communication and updates are great as well.  If you need something specific and can’t find it elsewhere, this is the place to go…just be aware you will have to pay for the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Miikey R",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:17:26.000Z",
          "Titre": "Actually really wonderful services and…",
          "Contenu": "Actually really wonderful services and goods. But a bit pricey. Thank you Happy Holiday"
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "Santiago Lopez",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T22:39:40.000Z",
          "Titre": "good experience  buying  - Bidding not so good",
          "Contenu": "It’s good.. I trust the quality of the items sold. I still think the sellers have strategies to get people outbid on purpose that should be penalized"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "AK",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T05:22:56.000Z",
          "Titre": "The seller was found to have not…",
          "Contenu": "The seller was found to have not followed the shipping guidelines when sending the package to StockX so they found another seller and shipped for the item to me at no additional cost. For this I would give StockX 5 stars, but I am docking one because I still get ads pushed to my notifications even though I have communications set to off in my settings."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Anthony de la Rosa",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T14:49:30.000Z",
          "Titre": "Great service.",
          "Contenu": "The package was a little bit damaged, the shoe box was ripped and hit but the shoes were perfect, the quality 10/10 and the delivery time 10/10 counting that I live en europe and they deliver it from USA. Definitely would buy again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:13:57.000Z",
          "Titre": "Got the pair I was looking for",
          "Contenu": "Got the pair I was looking for. Was scared about shipping before the holiday but they arrived at a good time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tyler Tucker",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:10:27.000Z",
          "Titre": "The shoes arrived fast and as expected",
          "Contenu": "The shoes arrived fast and as expected. The only reason I didn't give five stars was there's too many fees and the prices are a little high but my order arrived without any issues"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tammy",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T04:52:46.000Z",
          "Titre": "The sneakers were delivered timely not…",
          "Contenu": "The sneakers were delivered timely not where it was supposed to be delivered but StockX has nothing to do with that otherwise i was completely satisfied"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "deadstockscoots&more",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T03:22:16.000Z",
          "Titre": "couple of items I want to comment on…",
          "Contenu": "I have just a couple of items I want to touch on. First is Customer Support. I have had several dealings with them through chat. All in all, they are a supergroup. I feel that they are very fair. The other is Seller Limits. I feel the more items on your site, the more sales you will get your fees on. I don't know, maybe I'm missing something. I'm not a fan of capping a sellers listings."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Damien Guihal",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:38:52.000Z",
          "Titre": "Nice experience and reliable site",
          "Contenu": "Nice experience and reliable siteBut beware of the last minute added costs"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ms Catalina Mendoza",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T16:30:53.000Z",
          "Titre": "The item ordered was perfect.",
          "Contenu": "The item ordered was perfect.  Although the delivery alerts said a signature is required upon delivery, I heard only doorbell.  Also, the shoes were $132 but I ended up paying $165 because of shipping and processing fees."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Apr",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T18:30:04.000Z",
          "Titre": "Stockx’s “Promos”",
          "Contenu": "My only issue was stockx’s promise of promos & discounts that were never delivered after signup of texts & etc.My experience with the product itself was satisfactory."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "XXXX",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:40:03.000Z",
          "Titre": "Review Return Policy",
          "Contenu": "Great product and experience. but there are no exchanges or Returns.Unfortunately, I did not read your return policy before making the purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AjaBone",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:14:42.000Z",
          "Titre": "Slow assssss delivery 🚚",
          "Contenu": "I wish the delivery was faster but I love my shoes can't wait for the rest of my items"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alejandro Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T15:55:28.000Z",
          "Titre": "Easy to order",
          "Contenu": "Easy to order, cost was higher than I wanted to pay. Shoes fit smaller than expected, but overall a good experience"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jesse Larsin",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T21:31:29.000Z",
          "Titre": "Great price",
          "Contenu": "Great price,  great selection, product showed up. It was absolutely perfect. Just took a while to get it, but worth the wait."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wendy Wildes",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T18:50:09.000Z",
          "Titre": "The shoes came quickly in new…",
          "Contenu": "The shoes came quickly in new condition. It was NOT advertised they were wide and now I cannot return them. It should have clearly stated in the description they were wide."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carol Keith",
          "Nb_Reviews": 6,
          "Date": "2023-12-14T23:19:28.000Z",
          "Titre": "The shoe that my grandson wanted was…",
          "Contenu": "The shoe that my grandson wanted was available, but the price was a bit steep.  Because of the availability at this time, I did not have time to shop around.  Plus I was holding my breath that I would not be scammed.  Overall, I am satisfied and hope he is also."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Erinton Savoie",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T15:51:48.000Z",
          "Titre": "Didn't get the extra laces, but minor inconvenience",
          "Contenu": "The entire process was incredibly fast, I was pleasantly surprised. Didn't get both sets of extra laces though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronda Hall",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T13:28:53.000Z",
          "Titre": "Delivery is always faster than…",
          "Contenu": "Delivery is always faster than expected. Tracking is constantly being updated. Only thing I don’t like is that if there is an issue my only option is to resell."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pam Ongley",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T05:19:15.000Z",
          "Titre": "I had several questions but could never…",
          "Contenu": "I had several questions but could never figure out how to send them. It was very frustrating. But my package did arrive yesterday and everything was ok. Just wished I could have talked with someone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen Hershey",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T03:42:28.000Z",
          "Titre": "The sneakers were supon…",
          "Contenu": "The sneakers were supposed to be on sale and it never went through…other than that the delivery was on time .. Christmas gift… let you know how he likes them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hillery Arroyo",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T15:44:07.000Z",
          "Titre": "Disappointed shipping isn’t combined",
          "Contenu": "I ordered two pairs of shoes and was not able to combine them into the same order. That meant I could not combine shipping. The products were in good new condition."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda Powers",
          "Nb_Reviews": 8,
          "Date": "2023-12-16T18:14:28.000Z",
          "Titre": "It was nice to be able to find the gift…",
          "Contenu": "It was nice to be able to find the gift my nephew wanted for Christmas, though it was extremely pricey. I don't like the bidding aspect of StockX, but that's the nature of these products. Everything came in a timely manner. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "bandaid",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:08:19.000Z",
          "Titre": "my experience was good but others…",
          "Contenu": "my experience was good but others haven’t had the best experience with stock x."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brianne",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T13:43:13.000Z",
          "Titre": "The buying process was easy",
          "Contenu": "The buying process was easy. My one slightly negative takeaway was that the tracking was slow to catch up. The item delivered quickly but when I checked the tracking number it looked like it was stuck not moving which isn’t a StockX issue!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lucky Haze",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T10:31:08.000Z",
          "Titre": "Timely and was kept update on the…",
          "Contenu": "Timely and was kept update on the purchases travel. Thank you and happy holidays I will continue using your services and recommend it as well"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Carmen F Gonzalez",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T05:35:45.000Z",
          "Titre": "I ordered tennis and they arrived on…",
          "Contenu": "I ordered tennis and they arrived on time and merchandise was as described"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kim Old",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T13:28:23.000Z",
          "Titre": "Was nervous about order",
          "Contenu": "I would have given 3 stars since the first seller fell through but you found another seller. Grandson will be happy with his gift. I was getting worried I wouldn’t receive the order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "shannon L",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T07:34:58.000Z",
          "Titre": "Easy to bid",
          "Contenu": "Easy to bid, get updates and purchaseProduct is in good condition Only reason for the 4 instead of 5 was the delay in shipping but got here with plenty of time for Christmas"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T21:34:10.000Z",
          "Titre": "They pretty decent💪🏾💪🏾💯",
          "Contenu": "They are good, I just wish they could speed up there process a little more during the holidays. Other then that they are perfect!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deserie Verdugo",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T20:59:03.000Z",
          "Titre": "was good but shoelaces were messed up…",
          "Contenu": "was good but shoelaces were messed up and left finger prints on shoes other than that shipping was fast"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roxane Darco",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T16:40:06.000Z",
          "Titre": "It took a little to long to arrive my…",
          "Contenu": "It took a little to long to arrive my house but everything was in order which appreciate."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "FM",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T19:42:23.000Z",
          "Titre": "The transaction went smoothly",
          "Contenu": "The transaction went smoothly, only the delivery was not good. DPD just left the package downstairs, thankfully it was not stolen."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Lee",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:41:38.000Z",
          "Titre": "I like that you guys verify the product…",
          "Contenu": "I like that you guys verify the product and then tag with authentic dongles. The fee’s are a little high imo though when you add it all up. Would be nice to see free shipping on a fair dollar amount spent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda Knoepfle",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T16:08:45.000Z",
          "Titre": "Although expensive you seem to have all…",
          "Contenu": "Although expensive you seem to have all the new trends that teenagers want. Don't like that you have a handling fee on top of the high cost but it is what it is. This is the second year I've got something from StockX and my nephew has been totally happy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gustavo",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:41:26.000Z",
          "Titre": "Shipping needs work",
          "Contenu": "I like stock x, ive used stock x to get the Nintendo switch oled as well. My only problem is the shipping. Why use TForce. Alot of people complain about it. People are already paying a marked up price, they should get premium shipping."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "ALLAN",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T15:41:18.000Z",
          "Titre": "I recieved the  item in good condition…",
          "Contenu": "I recieved the  item in good condition and arrived on specified time..it was awesome shopping online  experience thumps up.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sean Duffy",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T15:27:42.000Z",
          "Titre": "Was fast turnaround,but taxes and shipping are a bummer",
          "Contenu": "Was fast turnaroundTaxes and shipping are too high thoughTotal fees should come down at least $5 to $7Thx"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "don peluso",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:30:44.000Z",
          "Titre": "Everything went smooth got it faster…",
          "Contenu": "Everything went smooth got it faster than I expected will order again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Gibberd",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:49:19.000Z",
          "Titre": "At start you do not know how long the verification process will take until the parcel is given to UPS. You have no idea if parcel will make it to you before Xmas. This is why you only got four stars.",
          "Contenu": "It is run very efficiently only problem is highlighted below."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Denzel Mance",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T17:51:59.000Z",
          "Titre": "I ordered it",
          "Contenu": "I ordered it, it came after a good little period of time and been satisfied since"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Traci Tabor",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T17:45:28.000Z",
          "Titre": "Pretty good",
          "Contenu": "I had a hard time going back in to track my package.   But other than that great FAST delivery!"
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Johan Delzenne",
          "Nb_Reviews": 8,
          "Date": "2023-12-14T13:11:11.000Z",
          "Titre": "Article conforme. Bon site",
          "Contenu": "Article conforme. Bonnes Informations de suivi. Par contre délai un peu long."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marjorie Alfaro",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T22:22:22.000Z",
          "Titre": "I like the fact that you had the…",
          "Contenu": "I like the fact that you had the product I was looking for & I was able to have it delivered to another State where my grandson lives He was definitely excited"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jay Gatsby",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T20:18:41.000Z",
          "Titre": "pretty good tbh",
          "Contenu": "the purchases kept falling through, but that’s more the seller’s fault than the company’s. once everything worked out, they were pretty quick with verifying my purchase and shipping it out to me. yipee"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregory Barton",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T05:07:15.000Z",
          "Titre": "Got order in good time packaging really…",
          "Contenu": "Got order in good time packaging really well good quality"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Willis",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T03:34:18.000Z",
          "Titre": "Shocked  how quick it got here to the…",
          "Contenu": "Shocked  how quick it got here to the US from the Netherlands."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LISA SECAN",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T02:18:33.000Z",
          "Titre": "Product was as ordered",
          "Contenu": "Product was as ordered, no problems. Delivery could have been faster."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Ch Ht",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T06:45:39.000Z",
          "Titre": "Very fast shopping, few marks on the shoes",
          "Contenu": "Super fast shipping I was shocked at how quick I got them. However when I received the shoes they had a few marks on them that I’m not able to remove. They don’t look worn but also not new ? Not sure if during their check they got a few marks or what happened."
        },
        {
          "Note": 4,
          "Lieu": "HU",
          "Pseudo": "Gabriel Rodrigues",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T10:33:28.000Z",
          "Titre": "Very hard problem during delivery",
          "Contenu": "Very hard problem during delivery, since i was not able to write all my address details"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Norma Burrs",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:27:00.000Z",
          "Titre": "The item purchased is a Christmas…",
          "Contenu": "The item purchased is a Christmas present and is still unopened."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Harman D",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:02:24.000Z",
          "Titre": "Everything about the shoes and…",
          "Contenu": "Everything about the shoes and packaging was awesome however I hoped the shipping would be faster."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Len V.",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:35:31.000Z",
          "Titre": "First time user",
          "Contenu": "First time user. Site was easy to search. Transparency of pricing was much appreciated. Prices presented in Canadian dollars with taxes and charges shown.Status of bid and updates of shipment at each stage kept me informed of my order at all times and all dates committed to were met."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Damien Coleby",
          "Nb_Reviews": 14,
          "Date": "2023-12-21T09:07:42.000Z",
          "Titre": "First time buyer",
          "Contenu": "I’d not come across this site before and was looking for a discontinued watch.Really easy site to use, transparent on fees and prices so you know exactly what you’re getting. Watch arrived exactly as described.Superb communication on delivery and the stages all along the way. Highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "RebeKah",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T17:47:43.000Z",
          "Titre": "StockX are legit and easy to deal with!",
          "Contenu": "Had never heard about StockX until my son found a pair of shoes from them he wanted for Christmas.  A quick Google search said they were legit so I did the ‘buy now’ process.  I received an email every step of the way, Shoes were sent to StockX for verification, shoes were verified and being sent to me, etc. I was given a tracking #, they arrived on time, and within the window StockX originally provided.  Very painless and stress free process.  I would recommend them and use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trish",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T03:47:14.000Z",
          "Titre": "I made my first purchase on StockX and had a great experience!",
          "Contenu": "I made my first purchase on StockX and can’t say enough about how wonderful the service and staff are. The process is easy to follow and knowing the items are verified by qualified staff  puts your mind at ease."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "MC North Yorkshire",
          "Nb_Reviews": 19,
          "Date": "2023-12-21T22:44:21.000Z",
          "Titre": "Excellent service & product",
          "Contenu": "I had never heard of StockX and was dubious about ordering but glad I did.  Was kept fully updated on tracking of item & arrived as scheduled. Quality of product (trainers) excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jama Pilkington",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:27:46.000Z",
          "Titre": "Speedy First Purchase",
          "Contenu": "I am really happy with my purchase. This was my first purchase with StockX. I found the website very user friendly. I was worried about how long it would take to get my order since it had to be verified first. However, it processed along very smoothly and quickly. I received email updates every step of the way. I would have liked more pictures before purchasing, but everything else exceeded my expectations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denise Davies",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:21:22.000Z",
          "Titre": "Happy Nain (Grandmother)",
          "Contenu": "I was able to purchase the UGG slippers that my grandson wanted for Christmas and much to my surprise they were delivered early!I received frequent emails, keeping me informed of the various steps and deliveries along the way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "brenda bridgmohan",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T14:01:39.000Z",
          "Titre": "My experience with StockX …",
          "Contenu": "My past experience with StockX has been positive. I have only ordered sneakers and they were verified and shipped efficiently. My recent experience was I ordered sneakers and it got lost in the delivery process. The company responded and resolved my issue in a timely manner and reimbursed me. I will continue to purchase items from them"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debra L.",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:16:42.000Z",
          "Titre": "You did it",
          "Contenu": "You did it!  No one else had the item I wanted except you.  I was a little apprehensive at first when there was no phone or contact info listed but you kept me updated via email and the item was even delivered before the originally given date.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miss LaFleur",
          "Nb_Reviews": 6,
          "Date": "2023-12-21T21:33:26.000Z",
          "Titre": "I am new to the site",
          "Contenu": "I am new to the site. I was referred by a cousin of mine to replace a pair of Jordans for my brother that were damaged. Without this site, I would never have known how to replace them. The experience was quick and easy and delivery was the same. They helped me make the impossible possible for Christmas"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T Le",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T22:19:12.000Z",
          "Titre": "First time buyer",
          "Contenu": "The product was received in a timely manner even with the holiday. The purchase was verified and arrived in original clean packaging. This was my first time ordering and I will return for future needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandy",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:10:50.000Z",
          "Titre": "Possible late order",
          "Contenu": "Was notified that my order may possibly be late. After I contacted the company, they acted and responded with concern. My package arrived before Christmas and I couldn’t be happier. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Tanya",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T17:59:16.000Z",
          "Titre": "Love stockx",
          "Contenu": "Never have an issue with stockx. Products are quality and delivery is fast. Fees and delivery charges are high which sometimes makes me look for products elsewhere."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jane bederman",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T15:25:12.000Z",
          "Titre": "They kept me informed of the progress…",
          "Contenu": "They kept me informed of the progress made with my order.  Emails were sent when the seller mailed the shoes to stockx, when they received it and Authenticity was established and again when it was mailed out."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Teresa G Marriott",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T00:33:07.000Z",
          "Titre": "StockX always update me with my…",
          "Contenu": "StockX always update me with my purchase and it arrived perfectly in a good condion .I will highly recommend to my friends and looking forward to bid or buy again."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr gary hughes",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T22:53:19.000Z",
          "Titre": "Stock x 100% use again and again",
          "Contenu": "This stock x is fantastic couldn’t find these trainers anywhere in the colour I wanted, stock x was cheaper than Nike and delivered quicker. Amazing service will 100% use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Betsy Eastlake",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:59:10.000Z",
          "Titre": "Was able to get the Ugg Tazman slippers…",
          "Contenu": "Was able to get the Ugg Tazman slippers that no one else had!  My grand son will be so happy because they were impossible to find .  Great communication and arrived quickly!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brittany Gergely",
          "Nb_Reviews": 3,
          "Date": "2023-12-22T03:16:40.000Z",
          "Titre": "Great experience!",
          "Contenu": "I was able to find a product I couldn’t find anywhere else and at a reasonable price. StockX kept me informed every step of the way until I received the package. I am glad I used StockX and will definitely come back again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh Hayden",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T14:27:14.000Z",
          "Titre": "Clear Process",
          "Contenu": "Provided clear updates throughout the process from seller shipping to verification at StockX to shipping to us as the buyer. Process was smooth and very trustworthy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raluca Ceausu",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T00:16:41.000Z",
          "Titre": "Good experience",
          "Contenu": "Good experience.  I have to admit that I was a little worried, reading the reviews, but honestly no complaints.  The product came earlier than what was initially posted and it was what my daughter expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anna Montana",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:58:19.000Z",
          "Titre": "I ordered a second same pair of…",
          "Contenu": "I ordered a second same pair of sneakers by accident and when requesting a refund, which they state on their website not customary, they responded ASAP and my refund was issued quickly. Great customer service."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Ekaterini",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T11:55:17.000Z",
          "Titre": "First time buyer",
          "Contenu": "First time buyer. Item arrived well before initial delivery date. Very happy with the whole process on StockX. Will use StockX again in the future. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Schuller",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T23:19:40.000Z",
          "Titre": "I was skeptical",
          "Contenu": "I was skeptical, but I just received my order and the product is authentic! Fast, easy process. The product was sold out everywhere else I looked and now I have it to give as a gift in time for Christmas!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Fiore-Jannazzo",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:46:27.000Z",
          "Titre": "Everything from start to finish was…",
          "Contenu": "Everything from start to finish was amazing. Great communication and bonus that it came before Christmas!! Five stars! ⭐️⭐️⭐️⭐️⭐️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Becky N",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T03:37:42.000Z",
          "Titre": "Seller issue, quick turnaround",
          "Contenu": "When there was an issue with one seller they were able to locate another fairly quickly and the shoes are as expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:53:21.000Z",
          "Titre": "When we received our order the package…",
          "Contenu": "When we received our order the package and shoes were extremely damaged. Stock X issued a full refund and I ordered a new pair."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BONNIE JENKINS",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T06:16:49.000Z",
          "Titre": "Great Shoes",
          "Contenu": "My Grandson sent me your site last year. He collects shoes . He has good taste too. I just got another pair of Nike\"s that are pink, he loves them.  Thank you for getting them here before Christmas."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T21:18:31.000Z",
          "Titre": "Smooth Process!",
          "Contenu": "Easy ordering process. Kept me up to date all along the process, from authentication to shipping. Received in time for Christmas!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:28:26.000Z",
          "Titre": "Quick, easy, and simple",
          "Contenu": "The entire process was seamless, from the actual purchase to the delivery of the product. Also, kept me updated every step of the process!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Noel Carbo",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T23:42:24.000Z",
          "Titre": "Returns",
          "Contenu": "Great shoes! Unfortunately, we bought an extra by mistake and  we are trying to figure out how to return."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Richard",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T22:50:27.000Z",
          "Titre": "Fantastic service even got my item…",
          "Contenu": "Fantastic service even got my item earlier than anticipated so very greatful to stock x my grandson with love his Xmas present I highly recommend stock x"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Bell",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:16:20.000Z",
          "Titre": "They refunded my money promptly for…",
          "Contenu": "They refunded my money promptly for accidental double order and shoes got here a week before they were set to arrive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yaritza Rosario",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T22:13:33.000Z",
          "Titre": "Impressed with my order",
          "Contenu": "My first time ordering with StockX and I am truly impressed of how fast and smooth it went. Shipping was also fast and well packaged. Will order again soon. Also, size up as I’m a 8 and 9 fits perfect!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Elizabeth Wozak",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:07:54.000Z",
          "Titre": "The company was very helpful letting me…",
          "Contenu": "The company was very helpful letting me know when the item was going to be delivered. Why it was a day late was clearly explained. Tracking was helpful. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie Lott",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:07:52.000Z",
          "Titre": "Just do it!",
          "Contenu": "Enjoyed the experience and my nephew is in love with his shoes!! Easy to navigate the website and Fast shipping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carolina Bennett",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:17:26.000Z",
          "Titre": "Dhf y kn bhk by the. Jfjk",
          "Contenu": "Stfugfyu jho y h g b k j jf vigo yo NC b if b hxx y c c b vnn b vvjhccnchfd y"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "- Nuno Miguel Ramalho",
          "Nb_Reviews": 6,
          "Date": "2023-12-21T16:46:58.000Z",
          "Titre": "It was a great surprise my first bye…",
          "Contenu": "It was a great surprise my first buy with Stock X. The feedback about the purchase was fast and above all, the time of the delivery was fulfilled."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Isabelle D",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T00:40:52.000Z",
          "Titre": "Trustworthy",
          "Contenu": "I have ordered from the company twice for birthday gifts they have always delivered on time and efficiently"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Hollon",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:10:35.000Z",
          "Titre": "I was skeptical at first",
          "Contenu": "I was skeptical at first due to low price and happily surprised when product arrived sooner than expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ghee",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:58:56.000Z",
          "Titre": "The jacket we were looking for as a…",
          "Contenu": "The jacket we were looking for as a gift for my grandson. It's perfect! Shipping and delivery was fast!Thank you StockX!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marianne Barrows",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T22:06:06.000Z",
          "Titre": "Easy ordering-great wxperience",
          "Contenu": "Easy ordering, payment & lots of up to date delivery info.Will use Stock X again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer May",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T14:39:14.000Z",
          "Titre": "Going to be late",
          "Contenu": "I was afraid I wasn’t going to get it before  Christmas and it was delivered 5 days before. They also were the only ones that had the size I needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elaine",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T00:30:58.000Z",
          "Titre": "Fast and Exactly What I Ordered",
          "Contenu": "Delivered ahead of schedule and received exactly what I ordered.  Will definitely use StockX again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Bannasch",
          "Nb_Reviews": 5,
          "Date": "2023-12-21T18:11:39.000Z",
          "Titre": "They were fast and I was surprised…",
          "Contenu": "They were fast and I was surprised didn't know what to expect with them but everything was awesome."
        },
        {
          "Note": 5,
          "Lieu": "CR",
          "Pseudo": "Nathalia",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T14:59:25.000Z",
          "Titre": "Will recomend",
          "Contenu": "I had an Issue and they were very hepfull, my order also arrive sooner than I expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mykal Salvatore",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T02:59:28.000Z",
          "Titre": "Excellent",
          "Contenu": "Was impressed with how fast the whole process was, plus the shipping. Excellent service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B. Martin",
          "Nb_Reviews": 2,
          "Date": "2023-12-22T03:49:54.000Z",
          "Titre": "Great company true to their word.",
          "Contenu": "Great company true to their word.Easy checkout and process of receiving the product.My adult son referred me to Stockx.com.He shops them a lot."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ramon Rosado",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:43:09.000Z",
          "Titre": "The purchase was very simple and the…",
          "Contenu": "The purchase was very simple and the item was delivered as promised. Great service and great selection."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gracy Martinez",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T03:52:06.000Z",
          "Titre": "I had made a error when I was ordering…",
          "Contenu": "I had made a error when I was ordering my order not only did I order it but I order the same items twice but they understood and allowed me to get one of the orders credited back to my account !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eduardo Gomes",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:37:27.000Z",
          "Titre": "Great",
          "Contenu": "Prompt communication in every step of the process and received item as described. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hector Vega",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T13:51:40.000Z",
          "Titre": "Well you guys delivered on time.You…",
          "Contenu": "Well you guys delivered on time.You also have everything in stock. Great overall service. Will recommend to friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ana Benitez",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:28:51.000Z",
          "Titre": "Delivered exactly what I was looking…",
          "Contenu": "Delivered exactly what I was looking for and delivery was on time! Loved it, thank you Stock X!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LK",
          "Nb_Reviews": 2,
          "Date": "2023-12-22T03:45:32.000Z",
          "Titre": "Trusted",
          "Contenu": "The process for authenticating and shipping was very clear.  The cost was reasonable and arrived on time exactly as depicted"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah Woodin",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:24:17.000Z",
          "Titre": "Super fast shipping and receiving of…",
          "Contenu": "Super fast shipping and receiving of item ordered and legit real and worth the small fee!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mark, Chiswick",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T18:35:26.000Z",
          "Titre": "Late buy",
          "Contenu": "Late buy, but the trainers have arrived before Christmas. Great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ava Dooker",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T07:12:06.000Z",
          "Titre": "Amazing",
          "Contenu": "Amazing, very quick shipping shoes brand new no damage to anything"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "steven Perez",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T00:15:29.000Z",
          "Titre": "I've bought from Stockx multiple times…",
          "Contenu": "I've bought from Stockx multiple times and always had great experiences."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bobby Drake",
          "Nb_Reviews": 3,
          "Date": "2023-12-22T01:56:50.000Z",
          "Titre": "Awesome inventory",
          "Contenu": "Awesome inventory, great pricing and verified by StockX. Great shipping time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kay Jennings",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:26:49.000Z",
          "Titre": "My granddaughter requested these and…",
          "Contenu": "My granddaughter requested these and very happy she is getting them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LV",
          "Nb_Reviews": 6,
          "Date": "2023-12-21T21:12:42.000Z",
          "Titre": "Awesome!",
          "Contenu": "Great process and the shoes arrived very quickly. I had a great experience with StockX."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Williams",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:43:34.000Z",
          "Titre": "Exceptional Service",
          "Contenu": "Verification of product was great! Timing of delivery impeccable! I will definitely order again! Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trina McQueen",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T02:19:16.000Z",
          "Titre": "The shoes fit perfectly in size",
          "Contenu": "The shoes fit perfectly in size. Quality is fantastic. Shipping was on time. My son is happy. A win all around."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lo",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T02:45:43.000Z",
          "Titre": "The ordering process was easy",
          "Contenu": "The ordering process was easy. I ordered these for my son for Christmas. I ordered two pairs. They came really fast. I will be ordering from here again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sneaker Head",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:36:45.000Z",
          "Titre": "Received product in a timely manner and…",
          "Contenu": "Received product in a timely manner and the status updates are a bonus."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce Baker",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:22:27.000Z",
          "Titre": "Great buying experience",
          "Contenu": "The tablet was new. Undamaged .we were kept updàted on delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Eckert",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T15:57:25.000Z",
          "Titre": "Easy to order many email updates…",
          "Contenu": "Easy to order many email updates delivery in a timely fashion"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DOUGLAS",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T22:09:16.000Z",
          "Titre": "I thought my package was going to be…",
          "Contenu": "I thought my package was going to be late for Christmas but it was right on time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stacy Shea",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:35:48.000Z",
          "Titre": "Shoes were in perfect condition",
          "Contenu": "Shoes were in perfect condition. They fit well. Packaging was great. Very happy. Will buy from again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheryl",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:02:44.000Z",
          "Titre": "The StockX site was easy to use",
          "Contenu": "The StockX site was easy to use.  The tracking of package was very nice.  Delivery was fast and the product is exactly what it was supposed to be.  Very happy."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Callum Kirk",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T23:33:38.000Z",
          "Titre": "Speedy process that is also informative…",
          "Contenu": "Speedy process that is also informative at each step!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darnell Harris",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T21:04:11.000Z",
          "Titre": "It was a very professional experience…",
          "Contenu": "It was a very professional experience for my first time dealing with them and the turn around time for delivery was outstanding"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dillon Forsberg",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T14:56:29.000Z",
          "Titre": "Shipping was decent and the item I…",
          "Contenu": "Shipping was decent and the item I ordered was exactly as expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Calvin Tucker",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:19:27.000Z",
          "Titre": "I receive the orders at estimated time…",
          "Contenu": "I receive the orders at estimated time frame and it was delivered to the correct address."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nana",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T02:09:46.000Z",
          "Titre": "Perfect order!",
          "Contenu": "Exactly what I ordered and in the time expected! My grandson will be so excited!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "CLEMENCE AUTRAND",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:41:19.000Z",
          "Titre": "Fast, professional and efficient",
          "Contenu": "The delivery was very fast, and StockX keeps you updated at every step via emails."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fulton Hill",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T21:24:15.000Z",
          "Titre": "Nike shoes",
          "Contenu": "Arrived in good condition, good timing good price, love the shoes"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dana Perkins",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:10:43.000Z",
          "Titre": "Shoes arrived in a timely manner",
          "Contenu": "Shoes arrived in a timely manner. and received exactly what I wanted"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mathew Hiser",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T02:07:50.000Z",
          "Titre": "Shipping the verification process did…",
          "Contenu": "Shipping the verification process did not even slow it down."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gloria-Centerville,TX",
          "Nb_Reviews": 5,
          "Date": "2023-12-22T03:51:28.000Z",
          "Titre": "They kept me informed on shipment up…",
          "Contenu": "They kept me informed on shipment up until delivery - good service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley Rush",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:31:54.000Z",
          "Titre": "I strongly recommend StockX",
          "Contenu": "I strongly recommend StockX. My product arrived in a timely manner. I am very pleased!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gail Wirth",
          "Nb_Reviews": 3,
          "Date": "2023-12-22T00:30:43.000Z",
          "Titre": "I love The Burberry Sweatshirt",
          "Contenu": "I love The Burberry Sweatshirt. It was very easy to order. It was sent in a very timely fashion. I would order through them again"
        },
        {
          "Note": 5,
          "Lieu": "ME",
          "Pseudo": "Dejan Medojevic",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T14:39:43.000Z",
          "Titre": "See you again",
          "Contenu": "Nice, fast, and most important great customer service. 5 stars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Britnee",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:45:14.000Z",
          "Titre": "Swiftness of order",
          "Contenu": "Swiftness of order, I was expecting to receive in January and it came before Christmas"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Melissa Amerongen",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:55:39.000Z",
          "Titre": "Fast and careful delivery",
          "Contenu": "Fast and careful delivery. Arrived 2 weeks earlier than it was expected!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Cheyenne Williams",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:13:13.000Z",
          "Titre": "Quick shipping",
          "Contenu": "Quick shipping, no hidden charges! Sneakers were mint!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "michael cavoly",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T02:12:31.000Z",
          "Titre": "Quick delivery no bs",
          "Contenu": "Quick delivery no issues at all just order and shipped"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eifa",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:23:23.000Z",
          "Titre": "Love the sneakers and it came faster…",
          "Contenu": "Love the sneakers and it came faster than other sites like this that I have used!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JoAnn Carrier",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T15:15:16.000Z",
          "Titre": "Great product availability",
          "Contenu": "Great product availability.  Items are shipped fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T22:37:57.000Z",
          "Titre": "Always a pleasure doing business with…",
          "Contenu": "Always a pleasure doing business with stock X"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Belinda Young -Cooper",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T01:47:01.000Z",
          "Titre": "It delivered my purchase on time I…",
          "Contenu": "It delivered my purchase on time I greatly appreciate that"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benjamin Sanchez",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T02:27:37.000Z",
          "Titre": "The whole process was fast and got my…",
          "Contenu": "The whole process was fast and got my order in time for Christmas"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roosevelt Morris",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T05:10:04.000Z",
          "Titre": "No issues or concerns noted",
          "Contenu": "No issues or concerns noted. Prompt delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "laraine gately",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:55:08.000Z",
          "Titre": "Came on time",
          "Contenu": "Came on time.  Very well presented.  Your site is hard to navigate."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Treena Dean Chafe",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:28:39.000Z",
          "Titre": "Fast delivery",
          "Contenu": "I was impressed how fast I received my order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Misty Johnson",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T03:56:37.000Z",
          "Titre": "Got very quickly and they kept in touch…",
          "Contenu": "Got very quickly and they kept in touch with me to let me know about my purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Morales",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:27:59.000Z",
          "Titre": "Received before scheduled date",
          "Contenu": "Process was smooth and easy. I even received my order early!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bette Witt",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:16:39.000Z",
          "Titre": "Delivered quickly",
          "Contenu": "Delivered quickly. Went to our grand daughter so can’t tell you more than that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katie",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:54:17.000Z",
          "Titre": "Found Xmas gift",
          "Contenu": "StockX helped me get a Christmas gift I couldn't find.  Very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karyn Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:55:25.000Z",
          "Titre": "Superior quality!",
          "Contenu": "Easy to place initial order; excellent price; prompt and up-to-the-minute communications about tracking/delivery; high quality product!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Robin Knuppel",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T23:59:46.000Z",
          "Titre": "Perfect",
          "Contenu": "Good prices and good service. Product was in mint condition"
        }
      ]
    }
  ]
}