{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "storagetreasures.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lloyd Hartshorn",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:33:31.000Z",
          "Titre": "There’s a few issues one the bidding…",
          "Contenu": "There’s a few issues one the bidding process is incorrect. It’ll tell me I’m winning and then say oops something went wrong try again and then I’m losing. I have heard this from a couple other people that’s having the same issues. Second people are winning these auctions at the last second, which is not supposed to be allowed to happen, that’s the main too"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Taylor Mckinney",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T23:54:35.000Z",
          "Titre": "Items in storage molded",
          "Contenu": "Items in storage molded. There was wet place throughout the storage and the storage was in the basement. The pictures from the auction site were not updated and I would have been really upset if I place a bet for 100’s of dollars. Definitely would have asked for a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Randy Clark",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:03:18.000Z",
          "Titre": "Card charged fees and account suspended?",
          "Contenu": "I bid on an auction and was outbid so o forgot about it. Then 2 weeks later found out somehow i had won. They charged my card the fees. I called to find out the details and was told the contents of the unit had been thrown away already and my account was suspended. Also when i tried calling the facility ask i got was voice mail."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J. G.",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T22:35:45.000Z",
          "Titre": "They Suspended my account because I had…",
          "Contenu": "They Suspended my account because I had listed somebody as a authorized pick up person. But that person owed on an invoice From an auction they had won, but never paid. That purchased had nothing to do with me!  gentlemen, on the phone even told me \"Guilty by Association\". VERY unprofessional and discriminating!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daron ESTRADA-ARELLANO",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:27:13.000Z",
          "Titre": "Thieves",
          "Contenu": "Credit card wasn't updated. I updated it in the time required.  Payment had to be manually made. They took my money would not refund me and sold my unit. They sold the unit and then processed my payment anyway.Response.. I updated the card in the time allowed. The site dudnt take the payment.  The auction sold again But ii had alreasy paid. You dold it after i paid. Thats just stealing.  But ill dispute it with my credit company.  Even if it diesnt get refunded you will still get a $20 charge. I was on the site for 12 years and never had an issue.  But you guys did this to me.ok,"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alla R",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T10:17:08.000Z",
          "Titre": "Won the afrauduction",
          "Contenu": "Won the auction.  Came to pick up things from the garage.  The employees said that they gave my garage to another person and showed me an invoice with a different AUCTION ID.  The employees took over my garage!  The site did not understand the situation.  To all my evidence that fraud occurred, the site responded SORRY!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sherese Agyemang",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T15:58:41.000Z",
          "Titre": "Pick up Timing isn’t realistic to this lifs",
          "Contenu": "My account was suspended and it’s my first time. After winning the bid because it’s online and not all of us are watching in real time. There should be able a 24 hour window after you went to confirm so you guys don’t have a whole bunch of storage units to have not been picked up because sometimes it doesn’t go with with our schedule."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carlos Alberto Diaz",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T15:15:05.000Z",
          "Titre": "beware of fraud People sometimes cheat and you lose time that you will never get back.",
          "Contenu": "The person never responded, I drove more than 4 hours to find out that it was a fraud, I already made the report but.  They don't do anything I hope you don't have that problem in the futurePeople sometimes cheat and you lose time that you will never get back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Herbert Dawson",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:30:20.000Z",
          "Titre": "I won the auction and when I went to…",
          "Contenu": "I won the auction and when I went to pick it up within 24 hours the associate at the facility told me that she can’t let me have the unit. I was very confused"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Juan Reyes",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T21:37:01.000Z",
          "Titre": "It looks like every time you bid on a…",
          "Contenu": "It looks like every time you bid on a storage unit that have items with value alway gets cancel."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KEN GREGORY",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T23:33:50.000Z",
          "Titre": "Auction was  cancelled after I won",
          "Contenu": "Auction was  cancelled after I won. SCAM!!!!Won, called facility, went to the bank, got help, and drove to unit. They just blew me off. Said the owner had come in to settle while I was in route. That was my property. Waste my time for your free assessment of lockers value and sell it to your protégé. I have a paid invoice. That was my property. You can this is legal after you win the court case."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T14:27:28.000Z",
          "Titre": "The auction was represented as being a…",
          "Contenu": "The auction was represented as being a facility auction but it was a person selling the junk they didnt want to move after the actual auction. Theres no way to remove personal information from the site. No one answers when you call nor do they call back when leaving a message. No response from email either."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Monica Martinez",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T18:50:06.000Z",
          "Titre": "I'm having.issues at the facility",
          "Contenu": "I'm having.issues at the facility . The person on site is.never there. It took me till 4pm to getting storage and I was waiting since 1pm.i haven't got my deposit back due to the person not being there. To collect it  and my second.storage I wasn't able to purchase because the person was gone. Havi.seen since"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas Howitis",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T08:24:52.000Z",
          "Titre": "Do not buy storage units anywhere in Oklahoma",
          "Contenu": "Do not buy storage units anywhere in Oklahoma facility and facilities are not trying to help anyone on your behalf they only aim to get the amount owed from previous tenants in summary they are allowed to go threw the unit before they take pictures and post it for availability and take anything quote on quote illegal . Previously having bought these I’ve done countless observations and collected more than enough proof that before they sell these to individuals the owner of the facility will allow they workers to go threw and take anything valuable anything they completely ransack the unit and then sell us the buyers trash . They also will take nothing but trash put it in a unit and have you bid on it to see who’s gonna spend the most to clean the units . These websites in Oklahoma are thieves and dishonest pathetic people .I’ve personal put things in a unit let it go till the past dates of me owing it just to see what they took and what they do and bought my unit offline to see what they actually do before selling it and I had nothing in the unit except tools and storage containers with new expensive tools and old ones and upon going to the facilities to claim my unit for being the winning bidder I was insulted to find things that where not mine and all the new expensive equipment gone done trust Oklahoma storage facilities sites including Storageunitauctions.com Storagetreasures.com Storageauctions.com"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Randy Harris",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T01:00:28.000Z",
          "Titre": "Your website is garbage...",
          "Contenu": "Your website is garbage.... Hopefully bankruptcy is in your future? Thanks for nothing!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul Scherven",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T06:12:25.000Z",
          "Titre": "The bid was won on Saturday morning",
          "Contenu": "The bid was won on Saturday morning. Listed as having 48 hrs to get cleaned out. Called the listed no. Never got a response so went there on Sunday to cleanout. They have no staff on Sundays so called customer service. They could not get in touch with property manager and because of the 48 hrs running out at 830 on monday i agreed to be there at 800 am per there request. Sat there from 8 to 9 trying to call the property manager with no response. Went home and at around 12 noon i got a message asking me to call the same no. I had been calling. I called left another message and finally at 4pm spoke to the manager who stated that his boss put the unit back up for auction because he claims he never heard from me. Now not only did i loose the locker but i have been cut off from the site"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ken",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T11:00:08.000Z",
          "Titre": "Managers going through units and Staging Units",
          "Contenu": "Managers going through units, Staged units, places canceling auction just because it went over a certain amount---wasting our time to bid on them and driving there to be told sorry we're going to give the customer more time. Hold the storage facility responsible. You hold us responsible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Virginia Cardoza",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T05:51:26.000Z",
          "Titre": "************** SCAMMERS  **************",
          "Contenu": "************** SCAMMERS  **************Avoid placing your trust in this inadequate business or its associated individuals. They engage in widespread scams, unabashedly going to sleep with clear consciences after preying on people. The units they auction often consist of leftovers, not items lost by others, as they prioritize personal gains. Bidder payments essentially fund the cleanup of the aftermath of their self-serving actions. Upon winning my first unit bid, filled mostly with empty boxes and odds and ends, I brushed it off as bad luck. However, my recent winning bid of over $300 for the largest 10x30 unit at this storage facility revealed an identical scenario—empty boxes, odds and ends, stained clothes, and heaps of trash. Considering the monthly cost and deposit for a 10x30, it's perplexing that there wasn't a single valuable item. Why would anybody invest such a substantial amount of money on a monthly basis to store nothing more than discarded items ?In either case, I'm in the initial stages of filing a police report and submitting a complaint to the Better Business Bureau.Best of luck to all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aren Martin",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T23:38:01.000Z",
          "Titre": "Website is terrible",
          "Contenu": "Website is terrible.  Every 4th time I hit the back button, the scroll bar disappears and needs refreshing.  Pictures are terrible as is the picture interface.  Requires me to get a text every time I go to website.  Cookies don't work.  So much more UI/UX issues."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donnie Daniels",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T07:51:24.000Z",
          "Titre": "This is the worse online storage…",
          "Contenu": "This is the worse online storage auction company.  They do not know how to communicate.  They are QUICK to suspend your acct.  I had purchased over 150 units in 8 months.  Then travel 3 days to Oklahoma from Kansas attempting to pick up unit.  No Luck.  So they suspend my acct.  Really?  So I go under buddys acct to purchase.  They find out and then suspend his acct and mine indefinite.  There are few Storage facilities floored by this.  I'm trying to convince them to switch to Lockerfox.  They are much more respectful and know how to communicate.  You should go check them out. You will be pleased.  You won't be pleased long if stick around here."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen Williams Caldwell",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T20:49:44.000Z",
          "Titre": "The storage unit personnel made it hard…",
          "Contenu": "The storage unit personnel made it hard to remove items, did not receive a code so we had to make sure the elevator wouldn’t close while we gather everything from unit. Awful!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brett Coe",
          "Nb_Reviews": 4,
          "Date": "2023-11-24T13:34:34.000Z",
          "Titre": "StorageMart, Kempsville, Road, Virginia Beach This review is for the storage mart…",
          "Contenu": "This review is for the storage mart facility on Kempsville Road in Virginia Beach, Va. Lucas and Ricky are very racist, rude and disrespectful so-call managers at this facility.  They will try to keep your cleaning deposit even after you have broom, swept and remove all the items out of your unit. Never rent or bib on a unit at this facility. Also your contract states that you have 48hrs to complete your move, but you can only access the unit while the office is open from 9-6 so after 6pm you have to leave and return the next day. they will not give you a gate code so you can continue your move into the night. Which is not a complete 24hrs for that day."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Lee",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T10:09:08.000Z",
          "Titre": "Stole my money",
          "Contenu": "Stole my money! The storage sold my winning bid to another bidder before the 48 hours were up leaving me with nothing. Please refund my money since they sold my unit out from under me illegally!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T14:46:40.000Z",
          "Titre": "Site barely works",
          "Contenu": "Site barely works, have to reload page 30 times to find a sale … going to stop useing ot because of the issue"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Werkley",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T12:43:32.000Z",
          "Titre": "U sold my 20,000 dollars worth of stuff…",
          "Contenu": "U sold my 20,000 dollars worth of stuff out from under me and I begged u not to 609-369-9755 also I won the auction and could not pay timely  this is so wrong all personal information and paper work family airlooms ..so wrong"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kelly Ware",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T14:54:26.000Z",
          "Titre": "Second tim I used you and second unit trashedtime…",
          "Contenu": "Second tim I used you and second time had serious issues never again after winning bid it was cancelled then received call saying it was still available. After getting there right at closing and paying I saw the unit was left open for us but it was obvious it had been left open for awhile and gone through and was just trashed looked nothing like the auction pics"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Ogden",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T19:23:56.000Z",
          "Titre": "I did not know that this was a staged…",
          "Contenu": "I did not know that this was a staged unit. My fault that I did not read the fine print. Also, only being allowed 24 hours to clean out makes it very impractical for the normal bidder. I will never bid on units from this site again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 7,
          "Date": "2023-11-25T17:38:59.000Z",
          "Titre": "Unfair put us on suspension saying we…",
          "Contenu": "Unfair put us on suspension saying we did not pay a deposit and just decline offer. We paid deposit went to unit which was totally not like the photos and there was bad smell lots of fur dirt dust very unhealthy. I wore a mask but became ill within 5 to 10 minutes. We advised  the manager and they kept deposit. You should be given a warning first. We did have all the mask gloves and cleaning items. Look at the pictures it was totally not what the unit look like did not mention or show pets dander etc. I have had bad units before but never had any issues. I just feel its unfair to suspend with out a warning and understand the situation. Storage treasures is a great platform but you guys need to listen to the bidders too. I was planning to up to the 10.00 montly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 3,
          "Date": "2023-11-30T14:24:46.000Z",
          "Titre": "The storage unit I won an auction from…",
          "Contenu": "The storage unit I won an auction from was almost 2 hours away. I showed up and all the items were “stolen” by the tenant. No compensation and no insurance no payment for my time. This should have never happened. The lock they had on there looked like a child’s toy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:44:57.000Z",
          "Titre": "I brought the storage for the roku TV",
          "Contenu": "I brought the storage for the roku TV. That was in it and the 2 coolers in the pictwhen I got there. A customer told manager was coming out the storange when when I open the storage locker.  The TV was gone, so what's the cooler?Bad for business."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Meyers",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T16:44:03.000Z",
          "Titre": "Did not give enough time",
          "Contenu": "Did not give enough time, I'm only one person and it feels like a scam. 48 hours is not right because, storage is only open for 12 hours. Weekends are the only days that I could clean out a storage. One manager thought that he was doing me a favor, he wasn't. Update: response to Storage Treasures, the storage facility said the storage Treasures set the time. Passing the buck, I have businesses and people doing this would be fired immediately. Being dishonest would never be tolerated!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Velan",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T10:32:14.000Z",
          "Titre": "Block for no reason",
          "Contenu": "Storage treasure website states the facility closes at 6pm. I called the day before, I was transferred to the facility, the clerk hung up the phone on me. I went there to pick up the unit a little over 4pm, and they were closed"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew Merkel",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T17:35:17.000Z",
          "Titre": "I have bought approximately a dozen…",
          "Contenu": "I have bought approximately a dozen auctions from this company. Some were good buys others were not but that’s the gamble you take. My only complaint would be with auctions that were won and not bought due to either the storage facility not following through with the lien process or units that didn’t match the pictures. I have been turned away from storage facility’s and turned down some unit’s because they were not as advertised and still charged a premium and tax prior to receiving the invoice and never received any refund from storage treasures. I have tried to contact them via email and through their phone number with no response and no refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony Duncan",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T12:26:16.000Z",
          "Titre": "I bought a unit that was ALL TRASH(…",
          "Contenu": "I bought a unit that was ALL TRASH( broken appliances) and trash. This was not someone’s unclaimed unit. This was obviously a made up unit of over flow trash from other units and put up for auction. I don’t feel good that I got taken advantage of like this by your storage facility to haul off your garbage.I’m sure if someone did a records back ground check on this unit. It will show it’s NOT an unclaimed unit registered to a customer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jasmine Latham",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T15:42:37.000Z",
          "Titre": "The public storage on w airport in…",
          "Contenu": "The public storage on w airport in Houston LIED to yall about me not picking up my unit and I never got my refund for a cancelled auction."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Torivo Castaneda",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T13:51:34.000Z",
          "Titre": "Tried to make it work for years.",
          "Contenu": "Rude customer service. Banned and given a generic excuse. Stay far away from Kiosk only storage facilities. You will waste hours trying to figure out how to access your unit with Public Storage."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cahlin Kewley",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T17:20:05.000Z",
          "Titre": "Application would kick you out during…",
          "Contenu": "Application would kick you out during bids and you had to keep login and verify yourself causing me to lose a bid."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terry Hamilton",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T04:43:53.000Z",
          "Titre": "I got a new bank card and forgot to…",
          "Contenu": "I got a new bank card and forgot to update my info didn't know till after the auction was over so I updated it and my account was suspended so i couldn't even pay they gave it to backup bidder. I called customer service they told me to go their and pay but  nope when I got there. They suspended my account until I clean the unit out the one I didn't get."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles Cannon",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T19:33:09.000Z",
          "Titre": "No one’s here to return they took the…",
          "Contenu": "No one’s here to return they took the money now wasting my day."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christine Joseph",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T00:07:11.000Z",
          "Titre": "I purchased 2 units and they were…",
          "Contenu": "I purchased 2 units and they were picked through and left for me to clean the trash. A lot of these workers at the storage units cherry pick then take pictures and expect you to buy the garbage"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William butherus",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T15:33:56.000Z",
          "Titre": "Two bad things happened",
          "Contenu": "Two bad things happenedFirst we were bid up by who, we suspect, was the actual owner of the unit being auctioned. We were conned big time on this unit. The gun safes were “props” (no bottoms) and most of the boxes marked as collectibles were stuffed with actual trash. Cost us $2000 for 0 value. Storage Treasures allows unit owners to fraudulently stage then default on their unit rental, bid up the unit’s auction and score big profits. Treasures of course makes makes way more money allowing this to happen. No remedy for the scammed auction buyer. Happens a lot.My reaction to Storage Treasures reply? …misdirection hogwash by blaming the Extra Storage company, typical of a company involved in a very shady long term con.Law enforcement is interested."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "izzettin özbey",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T10:23:14.000Z",
          "Titre": "Auctions ended early",
          "Contenu": "I placed bids in 2 auctions. I usually increase the bid with 30 seconds left. But both auctions ended with 55 seconds left. This must be a legal issue. An auction website cannot cause such a technical malfunction."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandon Eldridge",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T16:56:49.000Z",
          "Titre": "Bad response time from email support",
          "Contenu": "Bad response time from email support. Horrible message at only number to call. Limited options with no operator or return phone call"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Gudowski",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T13:10:22.000Z",
          "Titre": "Fix your focking website!",
          "Contenu": "Fix your focking website!Your website sucks!Crashes, won't stay logged in, need login for company employees, when I check out apage and then hit the ba x k button it should go back to where i was.Your website is a focking joke"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeffrey McLaughlin",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T04:08:14.000Z",
          "Titre": "I got ripped off",
          "Contenu": "I got ripped off.  A previous offer of $40 was all of a sudden $140 when I went to check out 12 hours later… with no notifications that were additional offers even made."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tanis",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T17:46:18.000Z",
          "Titre": "Beware of Manager Specials!!!",
          "Contenu": "It wasn't necessarily Storage Treasure. However the unit I bid on and won was all completely destroyed by weather damage. Units roof had been leaking everything was growing Mold soaking wet. And Rat infested. So much Rat poop and pee even if something wasn't ruined by the water leak it was ruined by rats! How is this even legal to know the whole unit is destroyed and filed as a total loss and yet you turn around and auctions it off to someone. It was a hazard to my health breathing all that. It should have been listed that that was the case. I'm so upset about that unit!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jerry Johnston",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T04:01:56.000Z",
          "Titre": "unsatisfied first experience",
          "Contenu": "I bid on a unit, won the unit and storage treasures canceled my win due to the auction being posted a day early, after charging my card for storage treasures fees I had to wait a couple of days to get my money back. Overall this was not to big an issue but for it being my first unit not very happy with first experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason Mickel",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T03:05:23.000Z",
          "Titre": "This was the first auction I have won",
          "Contenu": "This was the first auction I have won.  And I lost out on it. Very displeased that it went like it did.  I wasn’t notified until late in the day.  Then I wasn’t contacted from the storage company at all.  I called and spoke to there customer service department and I was told the manager of the storage company would call me. He didn’t.  So I arrived there an hour late and he sold it to someone else. I feel that is bad business on the storage company.  I own a business too. And I’d go broke treating customers that way.  I feel the storage company should call and let us know we won the auction. Because I can’t sit around watching my emails and wasting my time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mircea Toupac",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T14:17:21.000Z",
          "Titre": "There was no real reason to suspend my…",
          "Contenu": "There was no real reason to suspend my account...it's more an abuse...P.S.That invoices was paid and is on my account, please check my account, one of last two places was clean out and second im was not able to do it because of my suspended account..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rochelle Felion",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T21:14:24.000Z",
          "Titre": "One of my auctions was given away to…",
          "Contenu": "One of my auctions was given away to another despite my having already Paid for it with other units all at once, and still plenty of time to meet the clean out time and date. My account is \"suspended\" due to payment issues that were promptly resolved. The agent who helped me assured me that he would be calling all of the locations and letting them know that the invoices were ready and paid. He also said that my account would remain suspended until all won units were finished in their entirety and cleaned out. I did this with 2 units within 24hrs of making my payment and my account still reflects suspended. Why? I wrote an email about this to support and have heard nothing back!! Please contact me as soon as possible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AYSEL ANGELA MANSLEY",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T06:01:47.000Z",
          "Titre": "I won the action and got an invoice",
          "Contenu": "I won the action and got an invoice. i went to the storage and learned that the action was canceled and i was not informed.  :( not good."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julius Hayes",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T17:56:44.000Z",
          "Titre": "Bad information I was told I could bid…",
          "Contenu": "Bad information I was told I could bid on my kids stuff just so they wouldn't lose it won the bid went to pay the remaining balance of bid then I was told no you can't because you are associated with this person.... the person that told me to bid was a worker that works for public storage... I advise any one if u don't have to put your belongings in a storage don't buy if you don't do it thru PUBLIC STORAGE they are not good at all"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Taylor",
          "Nb_Reviews": 3,
          "Date": "2023-10-31T20:39:21.000Z",
          "Titre": "CROOKS IN CONCORD",
          "Contenu": "Stay away from A-1 Storage in Concord, California, they are staging units. Purchased a Back up bidder unit for $6400 which was originally sold for $16,000. Unit looked like it was to good to be true and was. Unit had a Monster coin box right up front and slabbed coin set right next to it, and about 20 boxes of air jordans and other boxes. Monster box was empty and resealed, every box was completely empty except for two boxes that were full of trash that was swept up from other units with other peoples names on them, which i found out those people had units auctioned off previously as well. Spent 12 hours driving there from Las Vegas, for nothing. I have been in this business for 20 years now and have never been scammed like this til now. Buyers beware, stay away from this storage facility..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SAMANTHA WANG",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T00:58:15.000Z",
          "Titre": "locker was gone through",
          "Contenu": "locker was gone through; customer service didn't investigate. after sending pictures of boxes of baseball cards posted of fb. marketplace that was taken inside of unit that i won, they responded; with'I'm afraid that this is not a valid reason for a cancellation. Also, it seems that the cleanout time for the unit is over, this means that if you didn't clean the unit your account could be suspended.'  what a joke. yes, I'm going to clean out a locker that was cherry picked. basically, you're not guaranteed a untouched locker, most likely anything of value will be gone..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sonia Giron",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T10:50:48.000Z",
          "Titre": "I'm waiting for my refund because the…",
          "Contenu": "I'm waiting for my refund because the storage canceled the sale and it's been over a week and I really need that money back"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Duane Blank",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T18:44:46.000Z",
          "Titre": "Your response is incorrect",
          "Contenu": "In a continuing effort to rectify the extremely terrible service offered by your company, I just read your response to my review. On Saturday, October 28, I received two emails from your organization. One was an announcement that I won a unit and what steps had to be followed and the second email was a receipt for the amount of money charged to my account and showing it was paid. I received no further information until I appeared in person in the office on Monday, October 30th. At this point she referred to an email she sent, at 11:17, telling me the unit was canceled. While enroute to the office she sent a cancellation notice. Your response to the review doesn’t show this. Your response is incorrect. You need to answer theses truthfully. Please correct. I will follow this up. If you ask for a review you will get a fair and truthful review."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Will Bonwell",
          "Nb_Reviews": 2,
          "Date": "2023-09-30T01:59:07.000Z",
          "Titre": "Bought a storage unit",
          "Contenu": "Bought a storage unit, from Public Storage; that was filled with rat poop and pee as soon as you open the door you can smell the biohazard, Dead rats everywhere. Everything that could've been worth something was chewed up completely. There's no way you could've not of smelt the disgusting bio smell and they didn't say anything about it online, and there is no way to tell through the screen."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kenneth Magana",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T14:34:51.000Z",
          "Titre": "BUYERS BEWARE",
          "Contenu": "My bid winning was 2630 , When I received my final bill it was over 3800 dollars I couldn’t believe it this is a complete scam unless u want to get ripped off be very careful."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "G.B.",
          "Nb_Reviews": 4,
          "Date": "2023-11-18T10:38:35.000Z",
          "Titre": "Storage facility management acts put-out as if I am a burden for winning their auction",
          "Contenu": "Title says it all. I called to schedule pick-up an hour before the facility closed and nobody picked up the phone. I was an hour away from home and this facility was only 5-10 minutes from another facility that I had just cleaned out. The next day, management calls me and I schedule to meet them at 10:00. I know I'm going to miss 10:00, so I call them at 9:30 and reschedule for 12:00. It's one of those days, so I am a little over halfway there and it's 12:20 and management calls me and tells me that if I'm not there by 12:30 then they're going to give the unit to the next highest bidder. The manager's tone made me feel like a burden. Like she didn't want to help me get what I'd paid for, but would if everything lined up perfectly (and I do wish my life would allow that). Funny how her store can stop answering the phone an hour early (and thus cost me 3 hours of driving) no problem, but God save us all if I am 31 minutes late to where she's already going to be. So I turned around, knowing I would be at least 10-15m later than 12:30, and not wanting to deal with this lady's tone nor attitude in person. She made an offer to the next highest bidder, and she got StorageTreasures to ban my account."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan Haenggi",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T13:23:53.000Z",
          "Titre": "You guys charge a arm and a leg for…",
          "Contenu": "You guys charge a arm and a leg for winning a storage that sucks especially if you only have cash greedy. You should charge a one time fee to bid on whatever for so many months if it was like that maybe we would feel better about getting f*@#$D"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Milagros Vega",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T16:02:48.000Z",
          "Titre": "on my very first auction",
          "Contenu": "on my very first auction , i could not pick up the items due to holyday and the company denied me the refund"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Monique czaja",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T21:40:56.000Z",
          "Titre": "I feel that the extra space storage in…",
          "Contenu": "I feel that the extra space storage in Ocala, fl. Did not stand by its word to me. I feel so violated and cheated. I lost every stitch of my belongings because of thison the day of auction when I called to finish paying for a 10 by 10. They refused to work with me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Grimes Finds",
          "Nb_Reviews": 3,
          "Date": "2023-09-22T19:46:26.000Z",
          "Titre": "No Longer a safe place to Recommend for small buyers…",
          "Contenu": "No Longer a safe place for small buyers to buy. Way more units gone through than not. I have personally talked with corporate (OpenTech Alliance) and they have taken ZERO steps or suggestions to fix simple problems. We have accumulated stories other than ours over the last 6 months from other bidders who have literally lost LIFE SAVINGS all the way to ex employees all the way to the top! I thought they were good for the industry but I was wrong. My apologies to all I recommended to and that lost their livelihoods."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "okey Anumole",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T14:50:12.000Z",
          "Titre": "I bought a unit at 6633 n kedzie Chicago…",
          "Contenu": "I bought a unit at 6633 n kedzie Chicago IL.went there next day for pickup and I was told that the owner of the unit just paid them 2mins ago. meanwhile,  I rented uhal for 101 dollars called a helper for 100 dollars and drove like 34 miles to get there. no single reason was given for this and no refund or even compassion was made I lost my 300dollars plus this morning. I never recommend this business for anyone. it's all full of jokewhat's the difference between fraud and this act please. am asking a question"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jessica Butler",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T23:30:13.000Z",
          "Titre": "Five minutes after winning the auction…",
          "Contenu": "Five minutes after winning the auction I was the auctions storage unit was paid for by owner. I wish my card could of been charged for my winning bid the instance I won the bid.Reply: I understand that the guidelines state ‘up until auction payment,’ that is why I wished my card on file would be charged at the very end of the auction."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bernard Herrera",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T10:04:16.000Z",
          "Titre": "Terrible system for auction buying",
          "Contenu": "This website sucks. The pictures are terrible  and most of the units are the facilities. They throw garbage in the  units and sell it off the people. I’ve literally hauled several units straight to the dump. It’s been nothing but a waste of time and money I’d avoid it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rich",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T13:27:06.000Z",
          "Titre": "Life Storage is questionable seller.",
          "Contenu": "Nothing on your part went wrong, it was the storage company LIFE STORAGE that was the problem. I believe that the storage locker was staged to sell at higher price. I will never bid and would discourage anyone from bidding on any auction for LIFE STORAGE.Hi,Thanks for getting back to me. I have been doing this for some time now and every storage facility that I have dealt with has alway had some sort of conversation about the locker when collecting the cleaning deposit. This woman wouldn't make eye contact with me at all. She was looking to the side, asked me to sign the receipt and tossed me my $100.  This isn't the first time I had a locker that had nothing of value in it but it's the first one to appear to be staged. I will never buy a locker for this storage company nor would I suggest others to trust them. ThanksRich"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vitaliy Shikin",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T19:55:21.000Z",
          "Titre": "The boxes were open and was in…",
          "Contenu": "The boxes were open and was in different line than on pictures and looks like somebody came before and checked everything"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Britt Ekrem",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T18:37:53.000Z",
          "Titre": "You have to keep refreshing the web…",
          "Contenu": "You have to keep refreshing the web site to bid. Businesses lost money because I couldn't pull up the bid. It pulled another storage unit up and I could not bid on the one I wanted. If I was a Businesses I would  ever use this platform. Totally sucks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KENNETH GONZALEZ",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T16:33:37.000Z",
          "Titre": "The agent I spoke with told me once I…",
          "Contenu": "The agent I spoke with told me once I paid the deposit of 1500 and we deducted off the balance in this case that wasn’t true. That was just a tax is a charge for me to clean the storage, and I still had to pay more for that stores in what I thought."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cody",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T22:18:01.000Z",
          "Titre": "Less than 1 star",
          "Contenu": "Less than 1 star, drove all the way to the facility only to tell me that my locker just canceled. Unacceptable, now I'm out of $40 in fuel, who pays for that!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jaime sesters",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T12:08:09.000Z",
          "Titre": "Purchased locker tried contacting…",
          "Contenu": "Purchased locker tried contacting storage facility wrong number on invoice jumped through hoops getting number which I never got until at the facility where I learned they said own emptied half of it. I drove with trailer all that way for nothing. I guess storage treasures still made a few bucks off me because payment went through."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dallas Hulsey",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T18:29:06.000Z",
          "Titre": "Suspended my acct for not clearing out…",
          "Contenu": "Suspended my acct for not clearing out a unit to which I wasn't given the full 48hrs to clear out and won't fix the issue. Take your business else were this company is corporate driven greed, tried calling get told to send a request online yet online tells me to call. This company is hot garbage!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacky Westminster",
          "Nb_Reviews": 2,
          "Date": "2023-09-09T03:29:14.000Z",
          "Titre": "No Customer Service",
          "Contenu": "I have been with storage treasures 5 years. Usually very smooth. Last month I got scammed by a storage site. I guess it turns out when storage treasures acknowledges you were scammed they make it almost impossible to get your refund. I feel double burned by storage treasures. I keep getting bounced around by unfriendly customer service. Maybe think twice before trying these guys out."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ian",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T14:02:17.000Z",
          "Titre": "Customer Support Disaster",
          "Contenu": "For months, this website worked great, but lately I've had several gross interactions with their customer support team that have left me no longer interested in using the platform. There was an issue where a facility was unexpectedly closed on the day I had scheduled to clean out a unit and the facility did not give me any extra time to finish. That same facility actually had the audacity to report my account and have it suspended and the Storage Treasures customer support sided with the facility. Once I finally had my account reactivated, the customer support had told me that I was not allowed to bid at that specific facility again. After that, I won an auction at a different facility that belonged to the same company and they permanently suspended my account claiming that I was banned from all facilities belonging to that company. I reached out to customer support with the email proof that this was incorrect and again was not helped by them at all. It's a shame that this company is so willing to completely ruin someone's livelihood over false pretenses."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T19:26:32.000Z",
          "Titre": "I won many auctions,and then was…",
          "Contenu": "I won many auctions,and then was canceled(even though they charge your card right away) ,reason was that the owner decided to pay right after i won,this is happening especially when you win an auction at very low price,whenever i had won an expensive unit never got canceled.And of course many unit were staged 100%,there are no cameras on hallways."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cathy Smith",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T13:56:16.000Z",
          "Titre": "Avoid them like the plague",
          "Contenu": "Extremely poor communication methods. Arrogant employees,  nearing harassment. Charges hidden in a mountain of fine print. Laughingly double charge for the exact same thing. I would avoid them like the plague."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Geyer",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T20:03:26.000Z",
          "Titre": "Look out...",
          "Contenu": "Many of the recent auctions I was involved in I was high bidder down to the last second, thenI get a cancellation notice. Seems like they had a reserve price and wasn't happy with the win I should have had. Obvious greed mongering done with this sight! Don't waste your time or money! Happened way too often to be coincidence."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Will Bonwell",
          "Nb_Reviews": 2,
          "Date": "2023-09-09T20:17:19.000Z",
          "Titre": "The storage units are set up by the…",
          "Contenu": "The storage units are set up by the people in the storage unit facility they have all been gone through everything of value has been taken they'll leave you little things but nothing much. I know because I talked to the owner I bought the last one from and he had a whole bunch of old baseball card packets put up that were unopen there was slits and all of them they had went through every single packet there was over 500 packets that were still in the box that he said were never opened and they had opened them all. There was collection of cards and valuable missing ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ali Essafi",
          "Nb_Reviews": 2,
          "Date": "2023-11-12T16:28:53.000Z",
          "Titre": "It was my first time using it",
          "Contenu": "It was my first time using it I made mistake by bidding 4 times They said I won all of them I kept calling to explain what’s happened,they kept saying we can do nothing….I took 2 of those I won and they still suspended me ?????"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Salvador Perez",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T12:32:42.000Z",
          "Titre": "I don't know who to believe because the…",
          "Contenu": "I don't know who to believe because the storage guy told me that it was a mistake and that someone had won that storage, also how can a bet be canceled after someone wins it, and if it was canceled because they charged me, and they overcharged me , I need an honest explanation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kristian Regan",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T16:13:14.000Z",
          "Titre": "First of all the people who were…",
          "Contenu": "First of all the people who were selling the storage unit sat right in front of me running up the price second when I went to pay it told me my address was wrong and I couldn't pay and it was correct so I called to pay and you cannot get a human on the phone the automated system hung up on me 4 times in the hour and a half I tried to pay! Then they don't yell you there's a fee to the wen site and then a fee for the locker you bought. Never will I use this web site again!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jamie Newman",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T05:15:23.000Z",
          "Titre": "Site glitches",
          "Contenu": "It’s hard to get any bid to update its almost hit or miss when you go to put it in I’ve had to select the place bud button 11 times before it would put my bid in. After I won a unit the information on the site was not very helpful in getting a hold of the actual site it had the corporate number instead. So it was just a big long ordeal just to schedule with the facility."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bid Winner",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T08:54:07.000Z",
          "Titre": "I was charged $49 for a won auction",
          "Contenu": "I was charged $49 for a won auction, and they never allowed me to pay the remaining amount for the won auction to pick up my items. After several attempts to retrieve the items I won, and speaking to customer service several times, I was told they went to the next bidder."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicole davis",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T11:18:47.000Z",
          "Titre": "The storage I won a bid on was full of…",
          "Contenu": "The storage I won a bid on was full of rat feces which did and can make u sick. Every single  item was invested  with rat feces.  Even the one my daughter won which had to be at least 4 to 5 doors down. It's really a lawsuit."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacky Westminster",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T06:22:53.000Z",
          "Titre": "Patricia Porras ST Manager…",
          "Contenu": "Patricia Porras has let a longtime customer down. I don’t even have a complaint. I was only scammed from a storage facility and now it has been so hard to try to get my refund. I guess they just make it so hard on the client they want to give up. I only purchase $1,000+ units and this is how she treats me. Absolutely horribly. My only complaints started out with bad customer service. I guess they’ll show me bad customer service. Just try the other storage sell sites. They are definitely friendlier"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cheyanne Holliday",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T14:39:58.000Z",
          "Titre": "I have been trying to see my storage…",
          "Contenu": "I have been trying to see my storage unit since I won the auction on Friday 9/22 and the property owner or whoever she is has been giving me the run around and won’t allow me access to what I WON. It’s giving lawsuit"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "charles barker",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T15:24:52.000Z",
          "Titre": "the software is to hard to use",
          "Contenu": "the software is to hard to use, when i go down your auction list."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jg",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T10:11:44.000Z",
          "Titre": "Purchased my first private seller unit",
          "Contenu": "Purchased my first private seller unit. They staged it in a way that was deceptive. EVERYTHING in the unit was broken. EVERYTHING!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ly badi",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T16:03:11.000Z",
          "Titre": "Wasted my time on this",
          "Contenu": "Paid for my unit, Half of stuff loaded in my  truck already and the storage guy comes out and said it was canceled, so I have to return  everything again, wasted an hour drive, half day...  really wated my day for nothing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kathyrn Atterberry",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T22:33:44.000Z",
          "Titre": "I went to pay my invoice at a unit I…",
          "Contenu": "I went to pay my invoice at a unit I won at auction. The lady working was completely rude and screamed for us to leave her property when I literally had waited 4 hours for her to get there. I didn't get my unit there or my money back for reasons I can't control."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "mike porter",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T13:07:22.000Z",
          "Titre": "Unit was a staged and you could clearly…",
          "Contenu": "Unit was a staged and you could clearly tell owners of the storage facility was the ones that did it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wilkinson Family",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T18:15:32.000Z",
          "Titre": "Honestly I think that if a storage…",
          "Contenu": "Honestly I think that if a storage facility has a vehicle in it it's part of the auction I think its stupid they always say the vehicle isn't part of the auction. I don't like it and I don't agree with this fowl play of auctioneers"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Turner Turner",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T17:33:15.000Z",
          "Titre": "Because life storages has my deposit I…",
          "Contenu": "Because life storages has my deposit I came and started cleaning out my units I won four here at Bessemer 8551 and came back to finish this morning driving two hrs and my access code will not let me through why I don't know I'm am highly funking pissed off right now"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "What does it matter",
          "Nb_Reviews": 3,
          "Date": "2023-09-03T20:42:14.000Z",
          "Titre": "I bid on a storage unit",
          "Contenu": "I bid on a storage unit, won it and paid for it. Storage Treasures and the public storage were gaming me. I did as I was supposed to and the public storage sold the unit sneakily to someone else and I did not receive anything that I bid on. Then both places are avoiding my calls and being very unprofessional with me. I put in a complaint with the district manager and even they are refusing to call and resolve the issue. I'll never do anymore business with either of these companies and I would definitely not give them a good rating. I give the poor, not worth the money and time rating. I don't even offer a star for their services."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Norma & Johnny Vickers",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T19:26:54.000Z",
          "Titre": "Was told they can’t go in units only…",
          "Contenu": "Was told they can’t go in units only open doors so how and why do they take the guns out and claim them…only reason I buy some units…not cool…unhappy bidder…be careful…."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Spencer",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T15:33:43.000Z",
          "Titre": "Didn't know vehicles are not included…",
          "Contenu": "Didn't know vehicles are not included in auction . Nothing in the posting saying otherwise.  They took my money and would not give a refund.  The store manager took very clear pictures of the vehicles as if they were apart of the auction."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "What does it matter",
          "Nb_Reviews": 3,
          "Date": "2023-09-05T03:57:19.000Z",
          "Titre": "First of all",
          "Contenu": "First of all, if you had read my review since you're snapping back at me. I tried multiple times calling and emailing and your unprofessional support staff were rude and didn't try to resolve anything. So as I stated before I give your company no stars, and extremely poor, unprofessional, and very unsatisfiable service. And no I would not recommend this company. I'm sure another company would be a better fit and act in a professional manner not in the manner that this company and storage unit have displayed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Browne",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T14:58:05.000Z",
          "Titre": "Fishy",
          "Contenu": "After winning this lot a month ago and them canceling the auction right before i got there for reasons they counldnt give me. I won it again a month later for one thousand dollars more seemed very fishy"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Allen Mann",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T19:01:41.000Z",
          "Titre": "Terrible service!",
          "Contenu": "The store 08092 was horrible. They wouldn’t give us a passcode so we could stay and clean the unit. We drove from flint (hour away) and had to come back the next day. There were no carts in the building, had to walk way up front to get them. We got back there and couldn’t  get into the unit and had to wait another 10 minutes for them to unlock the building. Just horrible service! I will never buy another unit there!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Glen",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T22:43:09.000Z",
          "Titre": "Customer Service Terrible If You Have…",
          "Contenu": "Customer Service Terrible If You Have Issue....Software Still With Major Glitches.  After 500+ Purchased Units...Just Frustrating.  Sooooo Much Potential But Just Can't Get It All Together.  Recently Had Major Issue w/ Location & They Ignored for Two Weeks Before Handling....Wrong On So Many Levels."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kelly Ontiveors",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:29:14.000Z",
          "Titre": "I won a bid from a private seller only…",
          "Contenu": "I won a bid from a private seller only to have them cancel the sale due to not making the reserve price."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carrie Hurley",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T14:31:14.000Z",
          "Titre": "I'm very frustrated about the auctions…",
          "Contenu": "I'm very frustrated about the auctions we picked up in Hendersonville this weekend and want someone to call me please 6154182023"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Luis Perez",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T22:18:52.000Z",
          "Titre": "- Tried n different browsers and on…",
          "Contenu": "- Tried n different browsers and on diferente computers from time to time while searching it freezes.- you have to go back to the main page to see other as apose to opening on a second page.- Many times it say expired and the page would have to be refreshed. - After spending hours watching the expiration time of the bid it show canceled a minute before it expires. Discouraging."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Drew",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T05:03:58.000Z",
          "Titre": "Water damage unit",
          "Contenu": "This was my first unit. Unfortunately this unit had major water damage and there was lots of mold everywhere.  The mold and mildew smell was so bad it kept giving me nasty coughs and got me light headed. I ended up throwing up and had a migraine for two days. Most boxes fell apart when trying to pick up. Lots of broken glass and 95% of the unit was trash. Due to the amount of trash and mold I wasn’t able to clean out the unit and had to leave the trash behind."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T06:24:42.000Z",
          "Titre": "Lousy customer service",
          "Contenu": "When there is an issue bidding there is nobody to contact. The phone doesn't go anywhere but an answering service that refers one to the email and nobody responds to the email. 10-15% is a lot to charge for ignoring the customer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anthony Linville",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T13:52:14.000Z",
          "Titre": "The website needs some serious work",
          "Contenu": "The website needs some serious work. It locks up and freezes all the time you have to go back and go back and go back instead of clicking a button forward there's no direct access to locations in the map app. And frankly the buyer's premium is ridiculous. Other sites did not charge that. So I think I'll stick with them"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T10:14:32.000Z",
          "Titre": "You let them cancel the auction after I…",
          "Contenu": "You let them cancel the auction after I already bid over 400 on a unit"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ops Lion",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T15:38:01.000Z",
          "Titre": "This website doesn’t help buyers but help sellers",
          "Contenu": "This website doesn’t help buyers. They mostly help with storage owners. 3 different times I win the auction. Called the place to confirm, and drive 2 hours with trailer to place. When I arrive  to the place, storage owner will say, “ Ohhh that unit had been canceled and you should had get email.” It is like they are making fun of us. Report them to the website but they are still in business and putting new units on auction. If they don’t got good money, they will cancel it. They allow storage owner stage units so storage owner and them self can get maximum money for it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Roman gaspar",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T16:11:36.000Z",
          "Titre": "Don’t like the fact that stuff is moved….",
          "Contenu": "Don’t like the fact that stuff is moved and damaged upon removal from original storage. Also missing pieces from items like legs or glass."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ron Gaskins",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T16:07:02.000Z",
          "Titre": "I won an auction the other day and…",
          "Contenu": "I won an auction the other day and could not get anyone at the facility.After calling 5 times I drove to the facility and nobody was there. after about an hour someone showed up.She was unfriendly and made me wait about 20 mins.She then told me that the unit was paid up.I drove 50 miles to Houston for the unit only to be told it wasn't available. I feel someone should have contacted me and let me know that it was paid up."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "james phillipy",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T00:50:13.000Z",
          "Titre": "take the hole payment at one time and…",
          "Contenu": "take the hole payment at one time and give codes to winners that would stop people getting aggravated tring to get stuff out"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chad Leister",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T10:35:28.000Z",
          "Titre": "I hate when on website if I click to…",
          "Contenu": "I hate when on website if I click to look at a unit then go back it doesn't take me wjere I was in my search it starts over"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rose Britt",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T21:46:33.000Z",
          "Titre": "I have gotten lockers via…",
          "Contenu": "I have gotten lockers via Storagetreasures.com before, this was the 1st time I purchased from this particular facility. I paid online thru the site the fee and winning bid. Once I got to the facility they charged me again. Opened the locker and the big live roaches ran out and the bedbugs were all over the couches and chairs. I decided I wasnt going to take it. The site sent me a notice that I was banned from their site because of it. I have been doing storage lockers for better than  6 years and have never been banned. I just for fitted all of the moneys.I spoke with the manager at the facility and he refunded my money because of it. He said he understood and wouldn't take it either."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "eric hawk",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T10:13:13.000Z",
          "Titre": "storage company not getting what…",
          "Contenu": "storage company not getting what expected and removing bidsand some companies like public storage trashes units photos and how units actually look dont match"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "HEIDI",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T15:42:24.000Z",
          "Titre": "Customer service unhelpful",
          "Contenu": "The verification system for cards to be charged has changed. Despite knowing exactly how my address was written my my bank, (every other place verifies just fine) your system will not validate any of my 3 accounts and has now stopped me from any future purchases. I had to purchase premium trying to speak to a person, then choose options that didn't pertain to my needs. I finally reached a human to help. After telling me everything was good, my card again was not accepted and 4 calls later I am in the same spot."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ross",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T12:23:05.000Z",
          "Titre": "My storage unit was missing a box that…",
          "Contenu": "My storage unit was missing a box that was in the pictures of the unit I bought and looked like it was searched through. Bags ripped open every box was torn open regardless if it was empty or had something in it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Harald Buehler",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T04:36:46.000Z",
          "Titre": "Most of the photos do not show enough…",
          "Contenu": "Most of the photos do not show enough to make a reasonable choice to bid on the unit.  A high number of descriptions are vague and do not reflect on the actual items in the unit.It would be great idea to specify in the description if the unit is an upstairs or a downstairs unit."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DO",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T15:08:44.000Z",
          "Titre": "Waste of time",
          "Contenu": "I bought a unit, drove all the way there just to hear that it got canceled. Not upset about not getting the unit but upset that I did not get an email or any kind of notification stating that I couldn’t get it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark Delfavero",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T00:46:28.000Z",
          "Titre": "scam",
          "Contenu": "storage facility scammed me.  Update:  I contacted storagetreasures and the storage facilities main office the day I was scammed by the storage facilities auction.  Both said there is nothing that they can do about it. Now I receive an automated response to my review which is basically meaningless."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Josefa Duran",
          "Nb_Reviews": 1,
          "Date": "2023-01-29T21:57:11.000Z",
          "Titre": "My first time buying a storage and I…",
          "Contenu": "My first time buying a storage and I know why i got it cheap it was full of garbage . Then they expect you to empty it all out. Why can't the place provide a trash can for you to throw the garbage away . It's ridiculous the storage place on sunrise they were very rude about the whole situation about not cleaning up the unit for them . Literally were was I supposes to take a storage full of garbage ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "stacy",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T16:16:17.000Z",
          "Titre": "I would rather use bid 13 as my main…",
          "Contenu": "I would rather use bid 13 as my main platform. They charge straight 10%. The one I got on storage treasures churches a total of 26%. That was $814. That was a shock. Yes, I know its in the fine print but its split up to where it doesn't seem that the percentage is going to be that high and 2 of the % are basically the same thing! It would have to be a RE A LLY good unit for me to use storage treasures again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Markus Aurelius",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T11:52:45.000Z",
          "Titre": "I do not like the fact that I only had…",
          "Contenu": "I do not like the fact that I only had 24 hours to pay your fees or you would of gave the winning unit to the next bidder in line. I almost lost it because my payday was one day off schedule. That is just NOT fair to me and because of it, I will not be bidding again"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dwight Gordon",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T13:58:23.000Z",
          "Titre": "I won a unit and when I get the the…",
          "Contenu": "I won a unit and when I got there the thing I mainly wanted in the unit was gone and the lady at the storage facility was being unprofessional this was the first time something like this has happened too me and i pray it will be my last yall need too compensate me my gas money and for wasting my time if u do decide to bid on a unit make sure it's not in Atlanta smh"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ernie Hickman",
          "Nb_Reviews": 1,
          "Date": "2022-12-31T16:38:31.000Z",
          "Titre": "Empty unit",
          "Contenu": "I purchased two units. I had problems contacting the facility to set up pickup as I got an answer machine, left my number, then called again several hours later.When I did go to pick it up…the main unit I bought was empty! I had already paid for the unit, storage Treasures had already pulled out over $85 from my account, I can only hope I get over $700 reimbursed!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Adrian Acevedo",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T18:02:05.000Z",
          "Titre": "Cool win but sketchy website",
          "Contenu": "I was happy to see this was legit that I finally won a auction but this website charged me their fee along with what I was to pay the storage company and I I contacted storage treasures no one answered so I left a message and still had no response so I guess they take you money also??? Hopefully someone responds or refunds me because paying twice is kinda of sketchy."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Russell Whiteside",
          "Nb_Reviews": 3,
          "Date": "2022-12-25T14:30:49.000Z",
          "Titre": "Love buying units",
          "Contenu": "Love buying units. Lots of fun but please don't ever get hurt and miss a couple days cause your able to even prove your in hospital a week and a Vietnam vet . They will take your 4000-5000 you woulda made on.tbat unit and give the unit to another person , and still make you pay for it while your accounts suspended and oh never return your calls or emails. Other than that a great time. Oh yes and I had purchased/ won 8 units the same week."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Peckover",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T14:49:43.000Z",
          "Titre": "The storage unit I bought actually…",
          "Contenu": "The storage unit I bought actually wouldn’t have been a bad unit. Unfortunately, the facility had a major roof leak. Ruining all of the existing furniture in the unit. There was also a rat problem that chewed up a lot of the items in the unit. Unfortunately, if it wasn’t for those two things it would’ve been a pretty good unit."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rhett",
          "Nb_Reviews": 2,
          "Date": "2023-07-07T21:11:51.000Z",
          "Titre": "As a professional liquidator",
          "Contenu": "As a professional liquidator, we have once again been scammed from yet another public storage staged unit. I have been buying storage unit for over 32 years and this scamming through storage treasures is getting old. I have contacted my lawyer and they have been put on the buyers blacklist. I hope someone high enough at storage treasures reads this, as it is a fair warning that the community is building a lawsuit against those that are breaking the lien laws. Oh and it would be nice if you would post the legal sanctioned public notice that requires the tenants name and amount due.... Its the law. Might want to abide by it before trouble finds you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sterling L.",
          "Nb_Reviews": 2,
          "Date": "2023-08-28T14:52:24.000Z",
          "Titre": "Bidding on several units",
          "Contenu": "I was bidding on several units, but was very interested in 1 unit. Because all the units listed closed at the exact time, I left some go to focus on the 1. After I won, and my card was charged, I got a cancelation notice. I called and was told the client settled up 10 minutes before the close. So I ended with nothing but waiting for my payment to be refunded (3 to 5 days). All Because someone didn't cancel when they should have. If these facilities could put at least 5 minutes between close times, it would be better for everyone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mauricio Hernandez",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T21:39:52.000Z",
          "Titre": "Hello overall I love the content on the…",
          "Contenu": "Hello overall I love the content on the site however one thing that annoys me and I would like to see fixed is when I’m on the site using my mobile phone it only lets me view 2 storage units at the most then after that it resets everything and I have to type in all the information about location and we’re I want to search all over again to continue viewing more lockers then same thing view 2 then back to step 1 again and so forth."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Pensoneau",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T00:17:59.000Z",
          "Titre": "Overall this website is pretty…",
          "Contenu": "Overall this website is pretty forthcoming in the descriptions of units. In this case I found multiple rat droppings in the unit and upon further inspection, a very distinct smell found a dead rat that has decomposed in the center. SERIOUS HEALTH RISK!!!! Upon calling them, units are sold as is. Well yeah, but it was known by anyone near the unit it was contaminated. Buyers BEWARE!!!!! Regardless of potential health risks they will sell you anything!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T04:42:35.000Z",
          "Titre": "The mobile website is pretty bad",
          "Contenu": "Your mobile website is about as bad as it gets. Having to type in your search twice to get results. Only being able to select two or three units in your search before it times out and says there’s an error and it goes back to the start only to have to start your search all over. The pinch to zoom function is awful too."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Roy Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T10:25:43.000Z",
          "Titre": "I love to bid and always look forward…",
          "Contenu": "I love to bid and always look forward to the next sale near me, but the last couple of times really were disappointing because the staff didn't reach out to me while time was a major part of this particular unit. I ended up losing the unit then one more followed the same day."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ricky Lawless",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T02:57:55.000Z",
          "Titre": "I uploaded my photo of the cleaned…",
          "Contenu": "I uploaded my photo of the cleaned storage unit and it said I would get my deposit back. It's been a week and still nothing back. They gave me 48 hours to make this happen and I did. So I expect the same treatment in return."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anthony Johnson",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T01:37:36.000Z",
          "Titre": "well for starters because of storage…",
          "Contenu": "well for starters because of storage treasures server being down or whatnot it ended up ultimately screwing me out of my auction that I won and I still got charged for the premium thing and they gave my storage to the next person in line I feel like I should be reimbursed the $88 that they got from me"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RACHEL PANEK",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T12:54:06.000Z",
          "Titre": "Well from about 8 months ago when I…",
          "Contenu": "Well from about 8 months ago when I started using this company for online auctions the price I payed on the percentage wasn't ever the amount you get charged now I use to pay 5.00-60.00 dollars the most this time it's out rages 158.00 really isn't right that's one he'll of a rip off cause that's added to the amount you pay for the storage you get and it's crap when it's 3min. Left if some one else bids the time gets added 3more mins that's not fair do to the price ends up higher and higher witch is cheating and a rip off and unfa6"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kevin Lee",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T16:44:06.000Z",
          "Titre": "Dealing with the web site is ok",
          "Contenu": "Dealing with the web site was just ok. I felt like someone from the faculty was bidding me up. StrangeThis Particular unit that I bought appeared to be staged by the owners. It looks like it may have been a manager Unit. There was not a single piece of paperwork in the unit and that’s a big red flag. There were visible pistols and crossbows & a box that had jewelry written on the side in the pictures but everything in the unit was complete garbage including  the pistols & jewelry. Very disappointed. I feel ripped off !"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ordie",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T18:27:16.000Z",
          "Titre": "The storage unit appeared to be staged…",
          "Contenu": "The storage unit appeared to be staged by the unit owner or facility Rep, once opened the unit rep even stated that she wanted the empty boxes since she was moving, how do you know that there are empty boxes in the unit???"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ronnie Dalton",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T00:31:51.000Z",
          "Titre": "Lots of bugs in this system",
          "Contenu": "Lots of bugs in this system! A lot of mysterious,ghost ,fake bidders! I’m not totally dissatisfied but not being live you don’t know who your bidding against leaving a lot of ways to corrupt the system! Just beware and be careful not everyone is as honest as you!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Vaneka Cross",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T14:19:00.000Z",
          "Titre": "Rules,Regulations, and Quality criteria for price points",
          "Contenu": "Storage treasures should create stricter rules and regulations for storage facilities with units up for auction. My experience this time has been that a location can sell whatever it is they want however they want with no checks and balances in place from storage treasures to protect the bidders. I understand risk but when you allow places to take advantage of that-it’s poor customer service. I would suggest starting by putting in place price points for auctions and quality criteria for each price point. The support team response is low as well."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marie Mccloud",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T14:34:04.000Z",
          "Titre": "I bid a storage unit and they list…",
          "Contenu": "I bid a storage unit and they list twice and they sent me email telling available and melly 66 had same unit they left for her"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "C. C.",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T15:21:34.000Z",
          "Titre": "I got bit by a rodant of somr sort",
          "Contenu": "I understand they are storage units however i got bit by something big.  It made me have to go to urgent care.  I left the unit open in disarray but inhad no choice.  I got a tetanus shot.  I emailed 3 times and each time it bounces back.   I am out 100.00 for nothing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kiandra",
          "Nb_Reviews": 4,
          "Date": "2023-10-20T14:53:34.000Z",
          "Titre": "I personally think this page charged to…",
          "Contenu": "I personally think this page charged to much for auction we win after betting and getting for the price we want or a lil higher on top of that we have to give storage treasure 15/10%"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Braina Noland",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T16:28:42.000Z",
          "Titre": "There where hidden fees and its to…",
          "Contenu": "There where hidden fees and its to expensive to dump trash after buying the unit"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Phillip Denton",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T16:10:56.000Z",
          "Titre": "Very important get it fixed",
          "Contenu": "I'm sure your company is aware of what's happening if not I'll let you know.I've been bidding on several of units and got screwed let me explain your site would automatically log me out for no reason or it keeps shutting down and no it's not a internet connection. You need a technician to reform your website so for now I'm on a different site with no problems at all please fix your site so I can come back thanks"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeffery Boskat",
          "Nb_Reviews": 2,
          "Date": "2023-08-03T13:41:00.000Z",
          "Titre": "Won an auction",
          "Contenu": "Won an auction. Paid the amount due and 4 minutes later auction was canceled as supposedly the renter came in and paid the unit up current. This is very suspicious as the person working the counter said that he won one and needed to pay his. I believe fraudulent activity is being conducted by the person working at the storage facility. I was never notified of the renter coming in and paying so I drove to the place and found out. This was a complete waste of my time. No proper name tag on person working at the storage place just the letter T on name badge.  This is fraud any way you look at it. Don't plan on bidding on any unit again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sabra Kelly",
          "Nb_Reviews": 2,
          "Date": "2023-10-06T00:44:39.000Z",
          "Titre": "Auction Bidding is great very well…",
          "Contenu": "Auction Bidding is great very well organized and the updates are timely this was my first experience I bid this storage because of the nice couch in the photo. On the way to Shelton joking I said.  “I know I’m coming up on Christmas wrap because in the photo you can see Christmas wrapping in the front. When he opened the storage locker no couch. Guy said the owner of the locker came took what she wanted out because she had the key to do so. It’s a great price except it’s not what is pictured. It’s a let down. Don’t even know what to do now.  It’s been gone through and someone took what they wanted."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Snider",
          "Nb_Reviews": 1,
          "Date": "2023-03-25T10:36:34.000Z",
          "Titre": "Well I was bidding on a unit and put my…",
          "Contenu": "Well I was bidding on a unit and put my bid limit at 3,000 during the last 3 minutes I kept refreshing to see that my bid was not updating.  I called while bidding was still open but wasn’t able to win the auction even though the other bidder never bid nowhere close to $3,000.    I did win 1 unit on your site just to open the unit doors and found it had been ransacked and everything of value had been stolen."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Taylor",
          "Nb_Reviews": 3,
          "Date": "2023-06-01T09:02:26.000Z",
          "Titre": "I have emailed you at the support email…",
          "Contenu": "I have emailed you at the support email in regards to two facilities I have units to clear out. One facility has 3 units and the other facility has one unit. I am having difficulty reaching either one and there is a lot of confusion in the voicemails back and forth between myself and the public storage in St. Louis park. The uhaul of east St. Cloud is an automated system and says to press 2 for all other calls. When I press the two key, the call is immediately disconnected. It has been over a week since I paid the invoices.. very frustrated. In regards to the other units I am satisfied with storage treasures. I would really appreciate a response to my email previously sent."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Louise Longbottom",
          "Nb_Reviews": 1,
          "Date": "2022-11-27T16:20:54.000Z",
          "Titre": "Thanksgiving Rush!!!!",
          "Contenu": "Auction Site went great!It was storage place that was a nightmare!Having 72 hours when Thanksgiving happens to be in the middle, then because of the storage place not been open I end ip with 13 hours to to clear a unit!Couldn’t be done, lost my $100 deposit!Again, Auction site was great, just faults in the system, most auctions give you 10 days to get your Ducks in a row!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joanne Lund",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T19:55:47.000Z",
          "Titre": "The experience I had with extra  space….",
          "Contenu": "The experience I had with extra space storage and storage tresurests was not very fun I lost my storage unit with my whole life in it stuff that will never be replaced was in my unit and I had the full amount in my hand when I came to pay it and she still wouldn’t except the payment and more money ! This has been so stressful and wrong I can’t express how I feel at this time ! They say that all important stuff is to stay in the unit and everything was taken gone my pictures and my kids hands when they where first born stuff I’ll never be able to replace ! I have been so sick from this experience that I don’t know what to do anymore !"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Knight",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T00:09:49.000Z",
          "Titre": "2/15/23",
          "Contenu": "2/15/23After being placed on hold for over 20 minutes I finally left a voice-mail detailing the issue I am having. After being reassured that my voice-mail is a top priority and my call will be returned promptly I still have not heard back from them so far 8 hours later and counting.   I just read the reply and can only say wow. That is not the issue at all and as far as storage treasures goes, never again. The facility I purchased a unit from straight ripped me off for 75 bucks and storage treasures did absolutely nothing about it. So good luck if you have any issues you'll get no help at all"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "robert sarazin",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T00:45:57.000Z",
          "Titre": "they used to be really good but it…",
          "Contenu": "they used to be really good but it seems now their focus has all been turned to us the bidders..they allow the facilitiesin my areato post any picture weather they are sideway, bluring, or 6 of the same pictures"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "amber renteria",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T18:29:15.000Z",
          "Titre": "I really dont like that all the units…",
          "Contenu": "I really dont like that all the units ive won or bid on look ransack3d and only half of everything is there due to whomevwr opens them up first doesnt seem fair that the atorage facilities get to go in fieat and tak e out all the good money"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "narjol prado",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T11:41:05.000Z",
          "Titre": "facilities going through units storage treasures does nothing",
          "Contenu": "I hate the fact that the at the facility unit gets to go through the units before taking pictures. five out of three are always gone through by the facility employees. storage treasures wont do anything about it or they don't do anything about it. it's like they just  don't care."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Willie COBRA Lopez",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T04:08:01.000Z",
          "Titre": "the thing is not the company is the…",
          "Contenu": "the thing is not the company is the people or employee taking decisions without see how WE THE BUYERS of the auctions we work hard to comply the rules  cleanning the units and employees of storage treasures decide to suspend accounts without see exactly whats goin on sometimes just for misundertoond , mis-conmunication beetwen time to pick it up  sometimes managers of the storages premises is off or not available or sometimes your credit card is low they suspend  the account with not chance to review the payment i think 24 hours limit needs to be modified little more  excuseme if it im wrong but need to consider the custumers { we the buyers } so every party wins  auction storagetreasures wins. sellers storage premises wins , and we the buyers wins,  thanks for readind"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matt D'Aquino",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T01:17:34.000Z",
          "Titre": "I purchased 3 units and all three had…",
          "Contenu": "I purchased 3 units and all three had already been gone thru by someone who had already removed? One had a cash register that had been forcefully opened and another every box had been opened and half emptied looking thru the contents"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dave Trevett",
          "Nb_Reviews": 2,
          "Date": "2023-03-25T13:29:18.000Z",
          "Titre": "The facility and the employees were absolutely fantastic.",
          "Contenu": "The facility and the employees were terrific in understanding our problem. The listing was listed as 10x10. However, the size of the locker was 10x20, which is more than we would bid on. The staff was extremely gracious in helping us resolve this situation, but the ad was definitely misleading."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joshua Lynch",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T15:22:19.000Z",
          "Titre": "I’ve had three auctions cancel in the…",
          "Contenu": "I’ve had three auctions cancel in the middle or almost end of the auction. Waste of time and energy. Also having 72 hours to clean up when it takes 24 just to get ahold of most storage facilities to get a key an code is terrible"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Opy Taylor",
          "Nb_Reviews": 2,
          "Date": "2023-05-21T08:44:02.000Z",
          "Titre": "Some of the storage companies…",
          "Contenu": "Some of the storage companies completely Ransack the lockers it’s quite evident in the photos and in the lockers! This is in no way the fault of storage treasures who seems to be trying to run a legit business! Although some unscrupulous individuals are willing to cheat the system! Buyer beware!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lost Me",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T11:31:36.000Z",
          "Titre": "Well that was quick",
          "Contenu": "I lasted one unit before being banned.  I bid on a 10x10 that was stacked to the wall with stuff I didn't want but I bid in hopes of a gaming chair and leaving.  Don't make my mistake and bid on an item when you can't spend the $500 worth of time and effort removing the rest of the junk.  One strike and you may be out... we'll see what they decide on that \"Manager Special\" test unit I refused to pay to clear."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tony Soares",
          "Nb_Reviews": 2,
          "Date": "2023-06-26T11:10:17.000Z",
          "Titre": "I waited over 2 hours to get in to a…",
          "Contenu": "I waited over 2 hours to get in to a storage locker I purchased on line.I get down there and there’s a sign to go to theLongwood office in which I waited 1hour on the lady and then was told to meet her back at the original locker place in which I waited another 1 he 15 mins for her to come open the locker.I was not the only one waiting.Itcwas hot and this was ridiculous.They also couldn’t find my invoice.Totally mismanaged!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rob harbuck",
          "Nb_Reviews": 2,
          "Date": "2023-04-22T16:52:44.000Z",
          "Titre": "Owners of storage shed show up",
          "Contenu": "Although storage treasures was a great bid from your computer experience I just want people to know that when I was loading my won storage shed the owner and family of the shed walked up and confronted me telling me they want Thier personal belongings back.. They just happen to come in emptying another shed out that they owned the day I was clearing out the one they lost.. on top of it they were drug users wich made me feel super unsafe about a bad confrontation.."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Packers",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T20:01:57.000Z",
          "Titre": "The website is terrible",
          "Contenu": "The website is terrible, really needs some updates regarding how slow it moves through the pages. Also, customer service is absolutely horrendous. I’ve been using storage auctions.com since they are amazingly better (website and customer service)."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Travis Kearney",
          "Nb_Reviews": 4,
          "Date": "2023-03-24T16:02:37.000Z",
          "Titre": "Extremely misleading and stressful situation.",
          "Contenu": "I was overcharged by the facility.  They charged me the $36 fee that Storage Treasures also charged me. When I called to have it refunded, they “didn’t know how.”  Also, the “48” hours I had to clean out the unit was actually 17 if I was unemployed, as I could only clean it out during business hours 9:30-6:00.  And since I work a normal 8-5, I was only given 2 hours.  That is far from 48.Also, the $100 deposit was expected to be in cash, although that was not labeled anywhere.An EXTREMELY unprofessional and stressful situation all around."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Hornbrook",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T12:41:52.000Z",
          "Titre": "I think that if a unit is up for…",
          "Contenu": "I think that if a unit is up for auction that the owner should not be able to come in and pay off. I think that if they want their unit back that they all they should be entitled to bid along with the rest of us because sometimes we feel like we’re wasting our time there’s been multiple time is it the same unit has came up more than once I personally have wasted a lot of time checking my bids, making sure everything was right and at the very very end within the last few hours the auction gets canceled that’s why anymore when I see a unit this came up more than once. I don’t waste my time no more."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Medina",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T11:52:50.000Z",
          "Titre": "Won an auction and was cancelled…",
          "Contenu": "Won an auction and was cancelled following day."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rachel Mcgee",
          "Nb_Reviews": 1,
          "Date": "2023-02-19T16:38:27.000Z",
          "Titre": "2 stars.because I recently had a…",
          "Contenu": "2 stars.because I recently had a storage steal several toolboxes out of the storage I bought.the police were called and a report was made.then they tried to have me removed because I confronted them about it.and even though I cleaned the storage unit out and they gave me back my cleaning deposit they call and reported that I didn't clean it out out of spite.if I didn't clean the storage out then they would have kept the free $100 deposit.but they gave it back because it was clean.but storage treasures still suspended my account and still allowed them to continue selling storage and suspended me instead.clearly y'all support the stealing and bad business.customer service should be a priority.especially when they have been wrong but clearly y'all don't care"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steven G",
          "Nb_Reviews": 2,
          "Date": "2023-07-19T13:33:42.000Z",
          "Titre": "When I call with a legitimate problem…",
          "Contenu": "When I call with a legitimate problem your team should be able to resolve the issue. Instead they say all well this is the way it is., I asked to speak to a manager and they said they would pass on my phone number. Manager never called! Very poor way to run a business., now I get an email to review my experience?? Poor performance!! None actually, never took care of the unit I won., manager never followed up. Just enough for me to have a bad feeling about your company. I’m"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T20:04:52.000Z",
          "Titre": "Deception from StorageTreasures and Public Storage!!! Not at all what you expect!",
          "Contenu": "We've won auctions on this site not for the first time, and not for the first time we encounter deceit! Upon arriving at the unit in Public Storage, we find that the arrangement of items doesn't match the auction photos at all! Someone completely went through them and took what they wanted.We declined the auction and heard from the manager that they will take new photos and put the storage up for auction again!! How is this even possible? It's deception! All items have been rifled through and the most valuable things taken!We contacted StorageTreasures customer support and informed them about this situation. They replied that they won't do anything about it and will allow the same storage to be auctioned again.Based on this, buyers are completely deceived and the whole point of this 'game' is lost. How can you continue when you know everything has already been rummaged through before you? Very disappointed in the deceit from Public Storage and StorageTreasures!!!If this issue is not resolved soon and we are not contacted by a StorageTreasures manager, we intend to publicize this incident on social media platforms such as TikTok, Facebook, and YouTube. Everyone should be aware of this so as not to fall into the trap."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Geyer",
          "Nb_Reviews": 2,
          "Date": "2023-05-31T13:02:52.000Z",
          "Titre": "So far not impressed with the process",
          "Contenu": "I won a unit quite far away from me.i contacted the storage facility they said everything was a go. I drove over 50 miles which was about half way and they called and cancelled. They said my money would be refunded but it had not I'm currently waiting. I had to contact storage treasures to file a complaint. So far not a good experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Seth Stadtmauer",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T15:35:07.000Z",
          "Titre": "Pictures didn’t not accurately show…",
          "Contenu": "Pictures did not accurately show contents compared to being there. They must show more pictures of the mattresses and furniture and other less desirable items as well as the valuable items."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Harry Colyer",
          "Nb_Reviews": 1,
          "Date": "2023-03-26T16:14:13.000Z",
          "Titre": "Suggested Improvements",
          "Contenu": "Too many auctions are shill bid to ridiculous numbers and then cancelled. Considering the prices these units go for, a 10-15% buyers premium is obnoxiously high, especially when you're not protecting auctions from poor bidding practices. I would suggest finding a way to monitor the bidding habits of accounts and IP banning those that are bidding up auctions and not buying or buying and not paying. While I understand this practice makes you more money and not taking action against it benefits you, I likely won't continue to look at auctions here if it continues.Pictures are often grainy and out of focus. There should be a review process to clean this up. In the age of smart phones with 5 cameras we shouldn't be looking at world War 2 era motion photos of a storage unit. Bidding and browsing feel chaotic and unprofessional for the above reasons. Things need to be more monitored and controlled. Especially for the prices being paid and the amount of premium being charged."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bruce Parker",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T01:48:29.000Z",
          "Titre": "sale listed items that simply were not …",
          "Contenu": "sale listed items that simply were not  there!   Absolutely no motorcycles in a unit that could've easily been seen if it had been there.   Also bought a unit number that had the wrong unit number.     a little suspicious with a unit that when opened only had 1 item when opened.    Very Disappointing!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tamyra Hutzler",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T15:14:23.000Z",
          "Titre": "Auctions are BS",
          "Contenu": "An A.I. runs this app. Always outbidding us no matter the price could be $1000 and it'll go up another $10 no matter what."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gustavo Winkelmann",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T00:25:28.000Z",
          "Titre": "They do not convey credibility at work",
          "Contenu": "They do not convey credibility at work. It is a stroke of luck. Three times they canceled the auction when I had a high bid. The most absurd thing was canceling after I had already won the lot. 30 minutes later, they told me it was cancelled. Ultimately, they choose who wins or not. It could be their day or it could be they don't want it to be."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amb Zamora",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T10:42:24.000Z",
          "Titre": "Scam",
          "Contenu": "The storage I won had a safe in it, but the rest of the storage was full of nothing but junk and trash.  The safe was brand new and not even dusty the way the rest of the storage was.  Everything was dusty and full of cobwebs except the safe.  Given the condition of the storage vs. The   safe, I hate to say it but the safe was put there just so someone would clean that storage unit.  I spent 3 days cleaning a nasty storage unit, and then when I was done the people were out of town on the day they told me to be done in order to get my deposit back.  I still haven't gotten my deposit back and I live out of town like 45 miles away and the people won't do PayPal or Cash App or anything.  Now I have to make another trip because they chose to be out of town on a day they also scheduled my time to be done cleaning the unit in order to get my deposit.  Every time I speak to the woman who works at the storage sight she's rude and not very pleasant.  Next time they need to hire some junk removal company instead of scamming people."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Concerned Patron",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T14:19:17.000Z",
          "Titre": "A majority of Storage Facilities…",
          "Contenu": "A majority of Storage Facilities rummage through lockers once pictures on posted on your sight. And when reported nothing happens, you told to just move on. Complete waste of ones time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Idiot for shopping here...",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T11:19:24.000Z",
          "Titre": "Not impressed at all",
          "Contenu": "The online auction is a great ideaThe restarting of the clock if someone bids within 3 mins is nothing but a scam and blatant gouging. I’ve spoke to multiple auction houses and like myself .., they were baffled and appalled"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "A Navarro",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T22:23:31.000Z",
          "Titre": "No property manager - sold my unit",
          "Contenu": "The auction process itself was a breeze. Easy to use customer friendly website and instructions. A few hours away from the deadline for emptying the unit, I couldn’t reach the property so I went to the facility. I arrived at a different public storage about 3/4 mile up the road and the helpful lady advised me that I wouldn’t be in default because nobody is actually at that property today and that’s why I didn’t get an answer or reply. She was nice enough to send an email that indicated I was still entitled to the unit on account of their lack of availability. The next day, I stayed in touch with this gentleman all day long and immediately after I hung up the phone with him telling him I would be there in 15 minutes he sold my unit to someone else. I arrived and he was gone in the wind and someone else was emptying my unit into their vehicle. This was such a huge waste of my time to have gone out there two days in a row and not even a email notification that they sold my unit. Not a good first experience at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "mayra Millan",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T10:27:59.000Z",
          "Titre": "It is my 3rd time that I win an auction…",
          "Contenu": "It is my 3rd time that I win an auction and when boy is there a problem and it does not exist.  I'm still waiting for my money back.  because they charge me 16 dollars without giving me my won auction.  They told me that the owner of the storage room paid at the last minute.  I think they should take action with that detail because I spend my gasoline, my time, and my rented car to pick it up.  And when I am a boy, the owner already pays."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CUATENDSEAS",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T13:56:25.000Z",
          "Titre": "U guys where great",
          "Contenu": "U guys where great . My bad not knowing what a private seller was. Never again"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ken",
          "Nb_Reviews": 3,
          "Date": "2022-11-25T18:12:22.000Z",
          "Titre": "Terrible mobile service and staged units",
          "Contenu": "Terrible mobile connectivity. Always resetting when using the site. Logging out of account randomly. Almost unusable. Let’s certain storage facilities stage/go through units over and over without consequences, leaving the buyer with straight garbage"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Malachi Gregory",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T17:07:54.000Z",
          "Titre": "Unprofessional",
          "Contenu": "They don't give the full insight of they take cash or credit card and they don't give us as a consumer notice whether they open on  Sunday or for pickup this cost me money and time on three different occasions."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "herman pereira",
          "Nb_Reviews": 3,
          "Date": "2023-11-20T19:03:25.000Z",
          "Titre": "Customer service",
          "Contenu": "Do you win an auction by the time you get there took it off I feel that Least could do is call you and let you know that has been taken off the auction block and not wait till you get there and find out that somebody has already come to empty it out for most people time is money expenses are dragging the trailer all the way there is expensive and they don’t even have the decency to say I’m sorry"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "angelo shepard",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T13:00:27.000Z",
          "Titre": "Selling units that shouldn't be sold",
          "Contenu": "Selling units that shouldn't be sold, then banning me for not accepting my payment, one unit you was not even suppose to sell. Totally disgusted now I ban you!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "s b",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T15:02:01.000Z",
          "Titre": "website is slow",
          "Contenu": "website is slow, has glitches, for instance web pages freeze very very frequently and I have to refresh .  That's all info you get for free."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T15:52:29.000Z",
          "Titre": "Every time you hit the back arrow to go…",
          "Contenu": "Every time you hit the back arrow to go to the previous screen, you have to start all over to see your auctions. It’s bull crap and frustrating wasting all that time over a website issue."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Empra",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T14:05:02.000Z",
          "Titre": "Confusing service with storage unit property",
          "Contenu": "Couldn't reach property and still haven't been able to paid for storage unit I won bid for, once reached property they said they needed invoice and 3rd day later and they have not allowed me to receive and purchase storage unit yet"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "wanda mulhern",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T16:19:54.000Z",
          "Titre": "Brought two units at Redford storage…",
          "Contenu": "Brought two units at Redford storage unit. They weren't as pictured. Again last week,  This also happens 6 months ago.  The electronic and tools were gone. And air Jordan shoes. Reason of bidding."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Demid Makeikin",
          "Nb_Reviews": 2,
          "Date": "2023-02-03T21:53:14.000Z",
          "Titre": "I didn’t get a gate code or…",
          "Contenu": "I didn’t get a gate code or instructions for getting in my storage.By phone I only could get a number of the storage. And was waiting near your office while your employees came back"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Henry Hoadley",
          "Nb_Reviews": 2,
          "Date": "2023-04-23T16:17:16.000Z",
          "Titre": "2X CANCELATION",
          "Contenu": "The seller was rushing me to pick up and clean the unit. I still had 47 1/2 hrs left. This is the 2nd time I've been canceled. Different sellers each time. I read the small print and understand it. Maybe give 12 hours to pick up and clean up the unit, to give us buyers a sense of urgency. The employee at Extra Space @ 6301 W Mississippi  Lakewood Colorado told me I should be done very soon, because of the size of the unit. I have to rent a truck and coordinate with my work schedule. 72 hour after the end of the bid is comfortable for folks like me.             Henry G. Hoadley"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rocio Armenta",
          "Nb_Reviews": 2,
          "Date": "2023-06-16T23:55:39.000Z",
          "Titre": "The worst experience with cardinal…",
          "Contenu": "The worst experience with cardinal storage , and several times I have got storage that don’t look like in the pictures. When I call storage treasures I don’t get a response"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tim Burgess",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T13:58:09.000Z",
          "Titre": "I was given an open offer opportunity…",
          "Contenu": "I was given an open offer opportunity (Auction unit 2922558).  I received it late in the day on a weekend and had questions.  I first checked the frequently asked questions, but my issue was not present on that page.  I sent the following email:    I received an open offer 526425 for a unit on which I was backup bidder.  Before I answer the bid offer, I need to know the basis on which the winning bidder did not clean out the unit.In short, I need to know the unit was not entered and is still as pictured in the auction.  If this is the case, I will accept the offer.  If the winning bidder entered into the unit, I will choose to not accept.Please advise.Due to no one being available, the offer lapsed.  I never did receive a reply on the email.  I would definitely have purchased the unit if it were available.  I was quite disappointed, especially given the lack of response and availability with the timing of the offer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Melissa Langerak",
          "Nb_Reviews": 2,
          "Date": "2022-12-21T13:32:23.000Z",
          "Titre": "Lake Michigan Self Storage in Allendale…",
          "Contenu": "Lake Michigan Self Storage in Allendale  Won this auction 12/13, on 12/14 I drove 45minutes w/2 truck/helpers, but was supposed to make an appointment. I urged them to please send an attendant over to remove lock or allow me to do it since it was paid-in-full already but accomodating my request seemed impossible.  I called the 15th to see if I could come on the 16th(the deadline for cleanout) and the lady said she was much too busy and that wouldn't be possible, so I picked it up on the 19th(convenient for them) but a snowy/cold day for me. She didn't take a cleaning deposit, because they run on the honor system, aka, too much work to get it back to me after it's cleaned out. They need to hire someone more local to the facility to better service their customer's needs. The parking lot was a thick sheet of ice as well."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jill Lawson",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T00:19:37.000Z",
          "Titre": "The pictures were deceiving and only…",
          "Contenu": "The pictures were deceiving and only appeared to show one unit not 2.  Hid the 5 mattresses from pic that was clearly viewable when I arrived.  Had to pay $75 to dispose of the nasty mattresses."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tim Gardner",
          "Nb_Reviews": 2,
          "Date": "2023-07-01T12:13:03.000Z",
          "Titre": "I bid and won an auction but it cancelled",
          "Contenu": "I bid and won an auction. Then the auction got canceled so I really didn't win. Storage Treasures still took $2.50 out of my account even though the auction was canceled."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "FATMATA KAMARA",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T05:27:16.000Z",
          "Titre": "the storage sold  me was 100% trash",
          "Contenu": "the storage sold  to me was 100% trash, nothing to take home. when i complain and submitted the photos no one seem to care instead i was told i cant bid anymore for 30 days."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RJ",
          "Nb_Reviews": 2,
          "Date": "2022-11-23T00:20:53.000Z",
          "Titre": "I was sent an email about an OPEN OFFER…",
          "Contenu": "I was sent an email about an OPEN OFFER for a free unit I seen a couple of days ago that didn't sell. I accepted the offer, I received the invoice, I drove 45 minutes one way to the facility, and they told me there was some kind of mistake. They said storage treasure should never have offered u the unit. They also said they haven't even cut the lock, which was a lie, because there were pictures of the unit contents on the web site. I brought that to their attention and the reply I received was \" True That \". Now I am just wondering who screwed me out of 1 ½ hours of driving time, Storage treasures or Life Storage!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "J.B.",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:34:39.000Z",
          "Titre": "Please don't over bid causing auction to be cancelled",
          "Contenu": "I wish Storage Treasures could recognize some bidders who are taking advantage of the site. And over bidding on units. To where Storage Treasures has to cancel an auction. It could be the facility in fault. But it has been an on going issue with the same bidder causing the same unit to go unusually high. Then cancelled for unusual reasons. Friends an especially family members and the owner should be banned from bidding on there own storage unit. Also the storage facility should have new pictures each time an auction is up to bid on. Storage Treasures please follow up on this. One storage unit has been up to bid on and no new pictures are taken in Eugene or Springfield, Oregon"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AА",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T03:46:26.000Z",
          "Titre": "I won an auction a week ago on Sunday",
          "Contenu": "I won an auction a week ago on Sunday, went to pick up my winnings on Monday, before I went I called the office but no one answered the phone, I decided to drive 70 miles anyway and what do you think? upon arrival, I discovered that the warehouse and office were closed that day, this was written on a piece of paper at the door, but neither on the website nor on Google maps was anything written about a non-working day. in the end, I spent my legal one day out of three, money on renting a truck + gas there and back"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Reaper",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T17:27:35.000Z",
          "Titre": "Poor Picture Quality",
          "Contenu": "The biggest issue is if online is the only way buying units is going to be (which sucks) pictures are going to need to be a lot better. There’s no reason why with today’s phones they can’t be better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian Joslyn",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T18:32:06.000Z",
          "Titre": "I always have issues with moving from…",
          "Contenu": "I always have issues with moving from on id to another. The pictures don't follow they stay stuck on the previous auction unless I hit the refresh button. I also hate the second verification on the same device. I should be able to trust my devices so that I don't have too.Better pictures would also help."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Abagnale Franklin",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T10:09:45.000Z",
          "Titre": "Do better",
          "Contenu": "Convenient without having to show up in person bidding, but dang yall need to fix the issues with canceling auctions after the buyer wins, I have wasted time and fuel travelling only to be told its cancelled. When you buy pods on storagetreasures.com they take immediate payment , locks in the sale. Figure something out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "STEPHEN HARTFORD",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T22:14:19.000Z",
          "Titre": "I was super upset that I won the…",
          "Contenu": "I was super upset that I won the locker, drove to the storage place and found out that the locker had been paid for by the owner but the assistant manager didn't know how to end the auction. I wasn't notified until I actually showed up to remove items from the locker that I thought I had won. I did get all my money back which was fine but was out the gas money to make the trip to the storage unit itself."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T10:15:14.000Z",
          "Titre": "Hey dont always have the bidders back…",
          "Contenu": "Hey dont always have the bidders back when a pravite saler dont stay to the terms on the website but they are so quick to cut off the bidder if the bidder dont follow the terms"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aamir Khan",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T04:08:00.000Z",
          "Titre": "All depend on storage manager",
          "Contenu": "All depend on storage manager, how and when you will get the access. Moreover, we should be allowed to check the things to be same place as in the pictures, as my first-time storage manager did not return my call nor allowed me to access into the facility and the time and efforts vested. In the second one it was only two bags and a carton; however, both begs were opened and thoroughly checked and found moved from what I have saw in the pictures"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nabila Haniss",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T17:59:06.000Z",
          "Titre": "I like the convenience of buying on…",
          "Contenu": "I like the convenience of buying on storage treasures. But, I don’t like the extended period of closing the auction, the minutes sometimes turns into an hour. Also, the lack of transparency as to whom is bidding, other on line sites have verified user names to show the actual bid in live time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Zippostrat",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T10:57:35.000Z",
          "Titre": "Fairly easy to use but the website has…",
          "Contenu": "Fairly easy to use but the website has issues. My main complaint is that navigating is annoying when you go back to the list view from a single unit view, you are always sent to the top of the page and not to where you were in the list."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Business owner and buyer",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T11:51:58.000Z",
          "Titre": "Storage treasures is a great   Needs to update their policies with seller",
          "Contenu": "Storage treasures is a great site, however limited support With issues from the seller.  The  time line to empty out the units should be clarified for example : “let’s say a seller is open only from 8 am to 12pm: to them each day 24 horse makes up the 72hrs to empty 3 days. To me the buyer who has a life, children etc.. that’s 4 hours each day. Meaning,  i the Buyer have 18 days to get my purchase.” This site should specifically state 72 business operating hours to empty."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Crissie Blackburn",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T02:26:25.000Z",
          "Titre": "Rules need to adjusted",
          "Contenu": "Rules need to state if it's your own unit( that has gone to auction) that you will be wasting time bidding on the unit.  I tried and pleaded for my unit not to go to auction since I got paid 4 days after auction date. Wouldn't have it. I signed up/bidded and won the auction. Paid only to then be told I can't do that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Craig Wardally",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T19:02:04.000Z",
          "Titre": "I don’t like being taken advantage from…",
          "Contenu": "I don’t like being taken advantage from by the Storage facility. You guys are great when you are able to be reached but Public Storage is so hard to work with I wish they went back to live. Online they feel to much control with the timeframe. We should have 48 belts to pay for locker and then 48hrs to work the locker. Every time I go to them they say one day per locker. That’s not right. Please have a stronger relationship with these storage facilities so they know what the rules are for timeframe. I get the rules when I’m on there facility but the timeframe needs to be consistent with other facilities that are bought on your site. 48hrs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rafael Badillo",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T20:54:59.000Z",
          "Titre": "Good job, but there is room for improvement.",
          "Contenu": "I would add a notification to my phone as I do not always check my email as often.  The site is good, but I would recommend having different subcategories to filter with.  An example would be \"no minimum bids made\" or \"locker cleanout offer.\""
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tony Wilfong",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T16:04:29.000Z",
          "Titre": "I like the different varieties of…",
          "Contenu": "I like the different varieties of lockers and what can be found. I dislike when an auction gets canceled less than a day after watching it or bidding on it all week."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melissa G Franks",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T03:55:24.000Z",
          "Titre": "Not enough time to get the unit cleaned…",
          "Contenu": "Not enough time to get the unit cleaned out and not a fan of only going during hours the office is open, other companies provide a temporary code and give extended hours. When someone is getting a unit and have to clean out between 9 to 5 and no availability if the office is closed for lunch etc. 72 hours is not enough because it is not 72 hours when you can only go during day hours after 10 am before 5 pm. Will not bid on units from Prime storage again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff Miller",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T15:45:35.000Z",
          "Titre": "Sold after time is expired not extended",
          "Contenu": "I dont like the auction can keep getting extended by 3  every time a bid is placed under 3 minute mark. It should end when time is up. That needs changed.  Live auctions end immediately. Also if you win a auction and the owner gets there before you and pays you lose it. That should also be changed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Franky Lee",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T18:02:05.000Z",
          "Titre": "Website seems functional enough",
          "Contenu": "Website seems functional enough, but I wasnt given the chance to fully use it. Was unable to contact the seller after winning, but I was told I needed to wait until end of day the day after clean out time.  Effectively monopolized 2 days for no reason.  I was able to get a refund but it was frustrating having to sink time into a lost cause before getting the refund approved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mathew Chavez",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T05:36:07.000Z",
          "Titre": "When i pick a storage to view and bid…",
          "Contenu": "When i pick a storage to view and bid on, i would like to be able to scroll up and pick another storage to view instead of having to go back to the options menu and go back to online auctions."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kseniia Badrak",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T02:03:12.000Z",
          "Titre": "Sacramento-Life Storage",
          "Contenu": "Bought a unit in Sacramento-Life Storage #3510. I called the office in advance to come and make a payment and find out the details, the rude behavior of the employees was very surprising - because I heard only the best about Life Storage. When we arrived at the office, the manager said that in order to withdraw the unit that we won, we have the right to enter only by truck and only once, and that no one will let us in our car and that it is written out in the rules of their company, although there is no such information on the site. It was a shame to spend my time and resources on this attitude to customers. Guys, be very careful when contacting Life Storage, because there is a chance you won’t be able  to pick up your things."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "jeff Bixler",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T00:02:43.000Z",
          "Titre": "It would be nice to do live auctions",
          "Contenu": "It would be nice to do live auctions. The online pictures can often hide the excessive garbage and the pics are difficult to see the quality of the items. Some of the storage businesses seem to be a little less than honest at times. For example, some of the storage units have rules against storing food in the units. However, some customers store large quantities of food,,,the mice find these units, eat through the packaging, crap all over the unit and the storage owners know that when they open the unit and take pictures. However, they never say anything about the mice and open food in their descriptions!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Lynch",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T12:43:15.000Z",
          "Titre": "Some of the rules in place are too…",
          "Contenu": "Some of the rules in place are too harsh. some situations are truly accidents, while others are deliberate. Should they have the same consequences? sometimes the punishment doesn't fit the crime. Some people do learn from their mistakes and shouldn't be lumped in with repeat offenders."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jen",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T21:06:37.000Z",
          "Titre": "rights to unit",
          "Contenu": "I like bidding on here, but I feel that once an auction starts the owner has no more rights to the unit. On more than one occurrence I've won an auction and the facility will not answer or return phone calls then all of a sudden I get a text message stating that the auction has been canceled due to payment being made by unit owner. The rules need to be updated or changed about when the ownership of unit ends for the unit owner."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Javier Alvarado",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T01:16:07.000Z",
          "Titre": "Old 2010 Computers",
          "Contenu": "I was able to get the items I wanted that was listed, but those items were outdated and not functional."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard Hall",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T03:58:42.000Z",
          "Titre": "Looking at other lockers pictures your…",
          "Contenu": "Looking at other lockers pictures your site would constantly take me back to the first one I looked at."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Porter",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T21:40:39.000Z",
          "Titre": "Safe and Easy, Needs to Manage Bad Sellers Better",
          "Contenu": "Depending on your area, you might not find any better place to bid on storage auctions than Storage Treasures.  The site is easy to use, has a good format for viewing photos, and is safe and trustworthy.  However, the sellers are not, necessarily.  Storage Treasures needs to implement some better ground rules and consequences for sellers.  Buyers should be able to rate sellers, as there are some who are not honest, have poor pictures, or are generally unfriendly.  There isn't even a clear way to report things like items moved/removed from units.  Please implement some changes that will help protect buyers from poor sellers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "WBChris",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T11:00:51.000Z",
          "Titre": "Sticky Fingers",
          "Contenu": "The one suggestion I would have is somebody filming while the unit is being open.It would keep an employee at the facility from getting sticky fingers. Because without that it’s sure to happen and almost certainly does happen"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ernst Tenemille",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T15:33:49.000Z",
          "Titre": "In the midst of a highly competitive…",
          "Contenu": "In the midst of a highly competitive auction, where I was the highest bidder by nearly 100 dollars, other participants continued to bid but none higher than my posted maximum.  Nonetheless, the countdown timer for bidding continued to reset each time someone added $10 to their original low bid.  I think that is the wrong approach!  The countdown timer should not reset unless a new maximum bid is posted."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fred",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T18:54:51.000Z",
          "Titre": "I’m not pleased at all of the 3 minute…",
          "Contenu": "I’m not pleased at all of the 3 minute time extension if someone places a bid when the auction is about to end. If the auctions is about to expire let it expire. Does not make sense to add more time to it . It add more fees that you all charge that are already steep. If you have 10 sec to bid then it should close to the highest bidder and close . No reset for additional time if some one else places a bid with seconds or a minute left."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "K Coop",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T12:53:46.000Z",
          "Titre": "Their policy is not quite accurate",
          "Contenu": "Their policy is not quite accurate. My card was locked when they tried to process a payment and I almost lost the unit to the second bidder. It states that you have 24 hours to pay. This was just a couple hours after the auction ended. Storage Treasures bills immediately for the auction fees. The rest is paid in cash to the storage facility. The storage facility has been wonderful to work with. Lorraine made this experience very pleasant."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aleksandra Glusker",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T10:09:03.000Z",
          "Titre": "Cleaning deposit is to big in some…",
          "Contenu": "Cleaning deposit is to big in some places,few times money was changed by mistake but never refunded .Some units don’t look like the pictures on auction.Cleaning time is not enough. Public storage only one does not charge cleaning deposit and have enough time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joshua Anderson",
          "Nb_Reviews": 1,
          "Date": "2022-12-31T14:16:28.000Z",
          "Titre": "Good but could improve always",
          "Contenu": "Over all I thank the site is grate but it says the byers premium is 15% but when you win its moor like 30% they have some hidden fees or sompthing because I wasn't expecting to pay what I did after I won i just wish they would give like a example chart instead of letting you just find out your self but over all im still going to be using the site."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Auctioneer",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T15:45:04.000Z",
          "Titre": "Pictures quality",
          "Contenu": "I'm concerned that the person taking the pictures has already gone through the contents of the storage(some pictures are taken inside the unit instead of from the door.)And when the storage is jam packed the pictures are of low quality and you can't really see what you are bidding for."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steven G",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T08:04:22.000Z",
          "Titre": "Big gap in control over …",
          "Contenu": "I like that there is big amount of auctions. I don't like that storage treasures allows managers of the units to cancel auctions at any time me and many other bidders I talked about believe that many times managers canceling auctions because of low price. There is absolutely no way to check why auctions was cancelled. I tried that. It makes managers to become owners of the units. And that's illegal"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T15:02:27.000Z",
          "Titre": "Process is easy and convenient",
          "Contenu": "Process is easy and convenient, but when I got to the unit, items visible in the picture were missing.  I'm a reseller so that's money out of my pocket.  Probably will avoid investing too much in units at that facility in the future.  Would be helpful if sellers were held accountable since buyers are expecting the contents as advertised."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 3,
          "Date": "2022-12-17T17:06:28.000Z",
          "Titre": "Bidders have rights too",
          "Contenu": "As auction sites go, storage treasures is one of the better ones. However, the difficulty for a bitter to get an issue resolved or make contact with someone regarding a situation is not acceptable. Bidders should not have to shoulder the burden of the shortcomings of the facilities when they are not available, or the room is not as bid on.Note that this particular issue was long enough ago that I have forgotten the exact date. I believe the date I show below is correct."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Denise Burrows",
          "Nb_Reviews": 2,
          "Date": "2023-09-23T10:13:29.000Z",
          "Titre": "Dislike receiving an email that the…",
          "Contenu": "Dislike receiving an email that the auction/storage unit I've bidded on has been CANCELED. Dislike auctions I've had high bids on disappear off my list a day before auction ends."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lewis Leight",
          "Nb_Reviews": 2,
          "Date": "2023-01-14T14:31:19.000Z",
          "Titre": "Very difficult to alter my bids after…",
          "Contenu": "Very difficult to alter my bids after being notified regarding being over bid.I received a call from a storage center telling me I won a bid, but was not notified by your company.I had been traveling in my car and figured I would had seen notifications but not availed to me.Good site, but needs tooling as I see it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Stephens",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T10:36:06.000Z",
          "Titre": "Image layout and loading delays",
          "Contenu": "I really don't like the picture layout. The layout on self storage auctions is much easier to see inside of the lockers. When expanding the images. Also I seem to spend a lot of times waiting for images to load. To be honest while waiting for the images to load a lot of times I'll look at other auction sites while waiting."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "NICOLE Payne",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T15:35:29.000Z",
          "Titre": "I found it nefarious that the site went…",
          "Contenu": "I found it nefarious that the site went down 30 mins before the auction ended so I couldn't watch to see that I was bid up to my max bid. I did have fun bidding and collecting the unit as it was my first time. I will use this site again and am hoping it was a one time occurrence. I'm glad there are sites like this."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Julian Aragon",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T00:34:37.000Z",
          "Titre": "going through stuff and staging is not right!!!",
          "Contenu": "although I have had very good experience with previous auctions I find it interesting that while I am  looking at auctions now, 12-21-22, I see pictures of items opened and touched and moved.  totally apparent that things have been went through..  sometimes even staged..  We as buyers cant be sure that whomever is taking the pictures didnt take things..  Isn't it unlawful to go through things and or stage items in order to make it look good or to take things for themselves??  upsetting"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gabrielle Foster",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T23:22:51.000Z",
          "Titre": "Great app but would recommend better customer service",
          "Contenu": "The whole experience was great except trying to get ahold of a actual person. I had to use the live chat to contact them know I had updated my payment method and needed them to charge the new card so I could get the storage unit. Definitely would be nice if you weren't told to use the website when you called them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bobby Cole",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T12:30:17.000Z",
          "Titre": "It's cool that there's a website versus…",
          "Contenu": "It's cool that there's a website versus visiting and calling each location. However, it's frustrating not always being notified that you've been outbid. And when you do it's been by quite a bit based on the bid you have to raise. And how do we actually know that someone else is actually bidding versus the system just raising the bids for more profit."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shaun D",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T14:36:09.000Z",
          "Titre": "Not the happiest person",
          "Contenu": "For the most part, everything was going pretty well and then one of the options that I won. I showed up to the storage facility to collect the items inside the storage unit and they told me that I did not win the auction because the store manager decided to move the auction to another day, that store manager is blaming storage treasures for it still being active on the website who is telling the truth I do not know all I know is storage treasures took my money and has not refunded me. Also, when I call storage treasures, I can’t seem to get anybody on the phone. All I keep getting is automated messages. I think that automated messages is terrible customer service, especially when it is auction sites and people have a lot of questions."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "robert bailey",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T23:48:29.000Z",
          "Titre": "Would like bud manager to show all…",
          "Contenu": "Would like bud manager to show all units you are/were bidding on in the current 72hr period! Once I’ve been outbid and not known I can’t find anything on which units I’ve bud on!Also storage facilities should do more pictures and/or better pictures, some do not do more than 2-3 pictures for a larger u it!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Bayler",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T12:06:49.000Z",
          "Titre": "They do fine at connecting people",
          "Contenu": "They do fine at connecting people.  On these particular auctions that I one the depiction and the pictures were not 100% accurate.  That is not usually one of the risks that you take, live and learn.  I understand that it can be argued that if is not technically this website’s fault, but they did post the pictures and the description without verification.  I will still use the website.  I won’t bid on any units at that storage facility."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Doug Fowler",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T14:47:39.000Z",
          "Titre": "Too many mistakes on posting of storage…",
          "Contenu": "Too many mistakes on posting of storage units. Not all of units available being posted properly, some didn’t have pictures of unit that was available. Poor communication being given about pickup and pay locations."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin Drake",
          "Nb_Reviews": 1,
          "Date": "2023-01-29T06:37:15.000Z",
          "Titre": "I  was happy with treasures",
          "Contenu": "I was happy with storage treasures, wasn’t pleased with the facility. Unmanned and gate wasn’t working. When I tried to find out what was goin on I was told to call a # then they said to call a # . After I told them I was in the auction they just kinda blew me off ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lindsay Andrus",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T14:59:02.000Z",
          "Titre": "I truly enjoy being part of storage…",
          "Contenu": "I truly enjoy being part of storage wars but feel sometime that things are being removed after pictures have been taken.  There have been a few times I was 100 percent certain I know what I was buying and then when I pick up the locker the item I was going for is no longer in there.  Also don't understand why you can't sell the vehicles with the lockers?  Otherwise I would have given a five star review.  It's an awesome way to extra cash on the side and fun at the same time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roger Strode",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T14:58:11.000Z",
          "Titre": "Didn’t send emails when I won the units…",
          "Contenu": "Didn’t send emails when I won the units and couldn’t navigate the website to even know I won the units and charged me for the unit when didn’t let me have the unit I supposedly won the only reason I got the one unit is the facility owner called me. Other than this one time it’s been pretty flawlessThank you for the explanation of this storagemart states this is all automatically with you guys so I am not sure who why or what happened it’s really unfortunate situation. Hopefully you will refund my buyers fee because I did not receive the unit like promised. Thank you for a reply I really appreciate it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Larissa",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T17:49:12.000Z",
          "Titre": "I don't think its professional to post…",
          "Contenu": "I don't think its professional to post a unit and after a buyer pays their deposit , the then customer is still able to make payment and then the auction gets canceled. The unit should not be posted until it it officially sellable. That adds paper work , more transactions and a headache. Also alot of the units look ran through as if someone has we ttheough them and took out what they want and then resold.  I've bought a few so far and I see that alot. Not sure what policy is but I believe no one should be allowed to go into and snoop through units other then customer and buyer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe Pepe",
          "Nb_Reviews": 3,
          "Date": "2023-05-13T14:17:25.000Z",
          "Titre": "Seems that in recent transactions I…",
          "Contenu": "Seems that in recent transactions I have lost good units to things like bad paperwork or customer just happen to pay their bill, coincidence?? My last 2 transaction that I was winning bidder. Late April and early may."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jose Lopez",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T18:28:40.000Z",
          "Titre": "The fact they offered a unit to me the…",
          "Contenu": "The fact they offered a unit to me the get to the place and the guy from the storage told me that the other person show up for the unit that’s unprofessional, on who’s doing better Lockerfox on there. Page also better pictures better website,"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Touchstone Quality Cleaning Services",
          "Nb_Reviews": 2,
          "Date": "2022-12-06T03:40:22.000Z",
          "Titre": "Everything worked out fairly well",
          "Contenu": "Everything worked out fairly well. There were hidden fees that did not appear until after the sale was made and the storage unit was missing items that were in the picture at the time of bidding but other than that everything went fairly smooth."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patti Davis",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T22:41:37.000Z",
          "Titre": "Where's my refund!",
          "Contenu": "After winning an auction and contacting the storage unit, when in route an hour later I received a call from the same storage unit to tell me the owner had paid the night before. Storage Treasures had no problem immediately taking my fee money, even when the auction should have been cancelled, yet it has been 6 days since then and I still haven't gotten my refund!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris Weichler",
          "Nb_Reviews": 2,
          "Date": "2023-01-30T14:20:30.000Z",
          "Titre": "I was have an issue where my CC was…",
          "Contenu": "I was having an issue where my CC was declined. My wallet was stolen, and I had changed cards. I changed the info online, but tge system showed I didn’t win the locker on my phone app when I got to the location… So I got on the phone and the facility also got on the phone, it was over an hour with both of us on the phone waiting for someone to pick up on the other end. I called tge premium line and she called as a facility… I finally left and drove 30 minutes back home still on the phone 1.5 hrs now and finally got through to be told the situation has been fixed…I can’t believe I was on hold that long… I had to wait until the nrxt day to go back…"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jessann Mclean",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T17:25:41.000Z",
          "Titre": "This site is very fun and really cool",
          "Contenu": "This site is very fun and really cool, the experience that i disliked so far is that when I won a free storage, I drove to the place to get it and someone else had a receipt that they won it already"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Taylor",
          "Nb_Reviews": 3,
          "Date": "2022-12-24T19:31:16.000Z",
          "Titre": "I have been buying units on this…",
          "Contenu": "I have been buying units on this platform since it began. Everything always seems to go smoothly, I have bought over a thousand units on here, I have only one complaint, they need to change how they do back up bidders BUB. Too many times bidders will bid up units on someone who actually wants it, and then it gets dropped on them, and then they don't pay for it, All of that bidder's bids should be completely wiped out, to where they started bidding at. And then and only then should it be offered to the next highest bidder, they had no intentions of paying for the unit to begin with... not very fair to bidders who buy and buy everyday faithfully..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christopher Babb",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T11:39:38.000Z",
          "Titre": "Alright",
          "Contenu": "The fact that the storage had no attendant so I couldn't get in my storage until some one came from were ever had me running back and forth to the storage. But it was alright when I got the storage open."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Antonio",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T14:28:27.000Z",
          "Titre": "All the good stuff in the photos had already been taken out.",
          "Contenu": "When I went to claim my storage unit most of the items that caught my eye had already been removed.  I had been able to take a screenshot of the one photo in the winning bids section, but I could not find the other photos after the bidding closed. Luckily it was enough to get my money back on the unit, but I had already wasted money on a rental vehicle to take the stuff home. This was my first unit and I am not sure if I want to risk losing money bidding on line again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kendall Carpenter",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T17:57:08.000Z",
          "Titre": "Website needs work…",
          "Contenu": "Website needs work especially for smart phone use. What good is facial recognition if you’re going to make me put in a # from a text and also an anti-bot wall?Having just the facial recognition should be enough."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patricia Jones",
          "Nb_Reviews": 2,
          "Date": "2023-04-09T02:23:47.000Z",
          "Titre": "I have had good and bad experiences",
          "Contenu": "I have had good and bad experiences. Good ones were units were what was listed. The last one I bought I paid $270 for only to be told that it was already won in an auction and picked through, and the person never showed back up to finish. So essentially I paid the storage unit to clean out their trash. I wonder if the person who stated the facility bids to drive up prices is correct. HMM, The lady at the front desk stated she has been watching the unit on auction and the bidding went crazy within the last 10 minutes which drove the price up so high. I thought the facility employees did not have access to the auction."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard Cook",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T18:22:45.000Z",
          "Titre": "Some items were missing from the unit…",
          "Contenu": "Some items were missing from the unit when I got it.  Can't seem to get a straight answer from anyone on how to resolve the issue."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melinda",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T20:30:50.000Z",
          "Titre": "Website not always mobile friendly.",
          "Contenu": "Website lags a lot. And always puts you back at the begining of the page after you look at a unit and try to go back. Sort order isn't always correct.Maybe have a mobile app to download. Mke it mobile friendlier. Works fine on PC"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Egan",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T18:04:24.000Z",
          "Titre": "Questionable",
          "Contenu": "Some of their policies definitely lean towards the buyers. Allowing them to claim goods even after auctions are over if the items haven't been picked up by winning bidder."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nathan Wilson",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T13:24:45.000Z",
          "Titre": "The website could use some improvement",
          "Contenu": "The website could use some improvement. When I put in search parameters and then check out individual listings the site sometimes loses my parameters and I have to start the search over. Otherwise smooth process overall!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Zielisko",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T21:26:57.000Z",
          "Titre": "I like the online auctions",
          "Contenu": "I like the online auctions, because I can view many auctions in a very short amount of time, but they all should except debit or credit as well as cash as payment."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sherry Sullivan",
          "Nb_Reviews": 3,
          "Date": "2023-01-27T12:05:29.000Z",
          "Titre": "I think the action was great",
          "Contenu": "I think the action was great, biding is fun, but the storage was awful the stuff felt wet and there was mouse poop on everything it was gross, on top of mise running around. I just hope that I didn't bring any home."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T06:14:15.000Z",
          "Titre": "Website constantly has issues… arrr…",
          "Contenu": "Website constantly has issues… arrr matey! Frustrating when web page won’t load, crashes, stop working right in the middle of something very time sensitive!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Juan",
          "Nb_Reviews": 2,
          "Date": "2023-02-20T15:30:15.000Z",
          "Titre": "Needs improvement for buyers",
          "Contenu": "What I like is that your work with a lot of storage facilities. What I dislike is your website is always freezing and stalling and it can’t never stay on the web page when I’m bidding on multiple units. Also the zoom in future needs work. Also you guys might want to make it into an app. You would imagine the 100 subscription price with get us more"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeffrey M.",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T10:59:47.000Z",
          "Titre": "Website has issues",
          "Contenu": "Website has issues. Bid manager doesn’t work very well. Keep getting an error message and having to start it over. Other then that everything else was great!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 2,
          "Date": "2023-10-29T16:16:19.000Z",
          "Titre": "Descriptions/photos need work!",
          "Contenu": "The description/pictures of the units are not even close to what they need to be. I bought 2 units. One turned out to be a “in the house smoker”unit, so everything had to go in the trash. The other unit looked to be staged to me. It looked like there were power tools with boxes. After I opened the unit and moved some of the boxes, it was 100% trash. There is no way someone was paying to store that stuff there. It honestly looked like a bunch of leftover stuff from other units all shoved into that one. I say that because nothing matched. There were two miss match box springs, 1 wheel, a bunch of door handles and screws loose on the ground, 2-3 random baby toys (covered in oil from the floor of the unit), empty power tool boxes, an old exercise bike, 2 plastic chairs,etc. EVERYTHING WAS TRASH. Even a random bag of clothes was grease covered and ripped. I understand having bad luck with the smokers unit, but it would be nice if they mentioned that in the description. As far as the other unit goes, I feel like I got tricked because the boxes were covering all the trash underneath them. Maybe some better pictures and a little history of the unit in the description would be nice."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T11:39:27.000Z",
          "Titre": "Not what I vid on",
          "Contenu": "My unit that I won took 2 days to gain access to and then the main items that were pictured were not in unit. Unit was ramshackle and not all all what I bid for. I told the storage facility and they said someone had to have broken into the unit after auction. Sad that I drove over an hour several trips for nothing I was bidding on unit for"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Happy bidding.",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T11:40:26.000Z",
          "Titre": "I love using the website",
          "Contenu": "I love using the website, it’s a thrill to never know what you’re going to find. Recently I won an auction. It was a for a huge truck, awesome. A buddy of mine needed the parts for of it, I got it for a good deal and so on. So I won the auction and 8 minutes after the end of an auction it was cancelled. Now I didn’t check my email after winning the auction because I was so excited I was already on my way to the storage unit to claim my prize! But luckily enough the employee from the storage location gave me a call and told me the bad news. It was extremely upsetting but life goes on. Just wish when you were bidding on something they would tell you flat out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Connie Thomsen",
          "Nb_Reviews": 2,
          "Date": "2023-04-04T19:25:15.000Z",
          "Titre": "For the most part I have been happy…",
          "Contenu": "For the most part I have been happy with Storage Treasures.  Most of the units are as described and the bidding process easy.  On the other side I had one auction that the site did not tell me that GPS systems take you to the wrong site and I pd for a extra 25 miles in mileage fees for the truck rental.  I had one site that was so mouse and rat infested I had to throw everything but 2 pieces of furniture away due to droppings, urine and chewing damage.  I just won a Pod container and found out you have 1 day to get your items out and that is between 8AM and 3PM.  The only information I was given was a 24 hour waiting period to get your Pod out of the warehouse.  Spoke with the Manager of Pods in Florida and she told me it was Storage Treasures responsibility to let me know, not theirs.  I told her Pods should update the information on their write up page on Storage Treasures."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "van webb",
          "Nb_Reviews": 3,
          "Date": "2023-02-01T04:22:03.000Z",
          "Titre": "Kicks U out",
          "Contenu": "I have been calling storage treasurer off & on for years about their problem with the site. When you are looking at a unit and you back out of it to look at another unit it takes you back to where you have to put your zip code in and on more than one occasion it will knock you out to were you have to log back in. And I have lost a unit because of this happening one time. Now with their new security code when you sign in sometimes I can see were this could cause more problems especially if you’re bidding on multiple units and you’re cutting the time to close. I really don’t think they care or they would have done something about this by now. I have no problems on any other sites."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T12:23:31.000Z",
          "Titre": "Waste of my time",
          "Contenu": "I liked bidding and the excitement of winning. I disliked this was this first time ever using the services and both units got ripped from me. One right before auction was up the company removed it. The second I won it paid the money and storage company changed their mind. My time is more valuable than that foaks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Callie W",
          "Nb_Reviews": 8,
          "Date": "2023-04-23T11:51:13.000Z",
          "Titre": "I like and also strongly dislike…",
          "Contenu": "I like and also strongly dislike Storage Treasures.  Some of how they do things bothers me....and I don't like that there is no phone number or way to speak to customer service over the phone. Nor did they even bother to reply to my email about my frustrations,  which makes me believe they don't care."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "N.s.",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T17:36:24.000Z",
          "Titre": "They are not clear about time frames…",
          "Contenu": "They are not clear about time frames like when they start and stop, and if u make one tiny mistake like winning an auction right before a snowstorm,they close your account for a month. Kind of ridiculous"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Justin Merrill",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T18:51:34.000Z",
          "Titre": "The fees they charge are quite high",
          "Contenu": "The fees they charge are quite high. Whatever you pay for locker understand that you'll be paying a 25% fee on top of that. Also, this was a lien unit but it definitely appeared the stuff was gone through and not very nicely either. Alot of stuff was broke and dumped out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shawn Grafe",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T02:53:40.000Z",
          "Titre": "I was sold a unit that was broke into...",
          "Contenu": "I bought a unit that was not like the photos that was shown on the website. When I got to the facility I was told were the unit was and they gave me a code to one of the facilities locks that had a number on it for them to keep track of. When I open the unit everything was gone but some tarps and the was another one of the facilities locks on the ground in the unit,  and it had been cut of by some one. So the issue I have with it was that the facility would have to known about the first lock being cut because they had put a second one on it. That say at the very least they knew the lock was cut off and they failed to let anyone know so that it could be taken down . And I am out the money I paid for the unit. Sucks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephanie Flores",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T14:53:30.000Z",
          "Titre": "This is not Storage Wars!",
          "Contenu": "Storage treasures in general is pretty decent and straight forward. To use the site on a mobile device can sometimes be infuriating because there’s no easy way to go back to the search list I’ve been looking at without having to enter the info in again and then scroll from the beginning. There’s also something wrong with the zoom function that makes it very hard to see what’s in the unit without having to rely on super tiny pics. The experience after winning a unit is hit or miss though. Some facilities are on top of their auctions and when you arrive, everything is good to go. The ones that aren’t chain-stores I’ve noticed tend to have way more issues including: not having change when you get there even though you have to pay in cash, getting the units mixed up, not being at the facility when you get there, etc.     Overall it’s a fun experience but more like buying a scratch ticket than making an investment, because from the pictures you never really know what you’re bidding on except a few items on the surface."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Valle",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T14:25:20.000Z",
          "Titre": "Apparently for the second time it seems…",
          "Contenu": "Apparently for the second time it seems that the units are verified before going, there are no things worthwhile.  I have bought them before and they have not put so much garbage on it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frank James",
          "Nb_Reviews": 2,
          "Date": "2023-09-15T20:53:11.000Z",
          "Titre": "Too many auctions get cancelled.",
          "Contenu": "Too many auctions get cancelled. Always seems to be on lockers that are worth more than is being bidded."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patricia",
          "Nb_Reviews": 1,
          "Date": "2023-03-26T04:30:55.000Z",
          "Titre": "Didn’t like being suspended before…",
          "Contenu": "Didn’t like being suspended before checking the whole issue.  Got quick turn around tho.  Don’t like the fact that they can’t b reached and also haven’t responded to any of my emails   I do like what they offer.  Big selection"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "V S",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T23:31:26.000Z",
          "Titre": "It's an ok experience",
          "Contenu": "It's an ok experience. From my personal standpoint this is a science, the first wins you have aren't going to be that great. Communication with the storage facility isn't really mediated via storage treasure. But it is legitimate and I found some cool stuff."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Media Warren",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T16:07:59.000Z",
          "Titre": "Not enough time!",
          "Contenu": "The only thing I really dislike is your not given enough time after winning a unit to clean it out before they block you from being able to bid again. Like most people I have a job and these storage places close at like 5:00 so I might have to wait for my day off. So if it's 3 or 4 days away, I'm getting blocked. So I either have to miss work or risk getting blocked from bidding."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael H",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T21:49:29.000Z",
          "Titre": "The website",
          "Contenu": "The website, when I’m browsing on ipad a click back most the time it makes me go back to homepage and have to enter an all  the same information again. It’s irritating and redundant. Wish they would take the time to fix this issue."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ELAINE DARNELL",
          "Nb_Reviews": 4,
          "Date": "2023-12-02T10:19:42.000Z",
          "Titre": "Buyers premium charge…",
          "Contenu": "I don't like the fact that they charge a 15% buyers premium."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dave Rice",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T15:13:15.000Z",
          "Titre": "Stuff happens",
          "Contenu": "I understand policy as far as buyers are concerned but some times when we bid on a unit we have every intention on removing the contents of the unit we may have won but sometimes things comes up beyond our control and we don’t have choice to leave the unit for another day then we Get locked out of our account and are basically banned even though we have let the storage facility know what is happening I don’t agree with this policy"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eugenia Vargas",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T15:17:51.000Z",
          "Titre": "Very disappointing some facilities…",
          "Contenu": "Very disappointing some facilities don't open early most after 10am and customers service is not good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Angela Solesbee",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T14:45:13.000Z",
          "Titre": "I thought there were too many added…",
          "Contenu": "I thought there were too many added fees placed on top of the actual auction price. They would only take cash and not a credit card, which was an additional fee for me to obtain cash."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maria G",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T13:58:06.000Z",
          "Titre": "Long wait time",
          "Contenu": "1. A. My card was charged a pending charge immediately after the auction ended. When I went to the storage facility they requested I pay for the unit. This was confusing because I thought it was already paid for on my card. I still had to pay a $100 deposit for cleaning which was fine. I just was not expecting to pay for the locker again. He said the charge would fall off in a few days. The specifics of paying should be on the winning notice page so I can print it and show it to the storage facility as proof. B. The guy behind the counter was very rigid in needing the auction number and my ID, yet he still could not find which storage locker # I won. Isn’t the sale linked to the bidders name, phone, email,etc? Why was this so difficult and it seemed between waiting to get my locker # and waiting to collect my deposit I lost more than 30mins of my work day. NOT EFFICIENT.2. The specific # address of the facility was not on your site. It said “ Uhaul at Goldenrod road,Orlando”. Your software should default not to accept inadequate addresses. There are multiple Uhaul on goldenrod road.  I lost about 20mins asking which Uhaul my win was at by having to stop, park,go in,wait in line,leave go 11 mins down the road etc.etc.This was not a good experience in terms of the logistics of your system. I wasted almost an hour of my day either looking for the facility or waiting at the facility for what was only a hand full of items. It may not be much time to some people, to me time is valuable as something you cannot get back so I hope you will review your process for address location entry as well as how your clients are trained to use your system."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dimitrii Pechenev",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T05:40:24.000Z",
          "Titre": "I won the auction",
          "Contenu": "I won the auction.  I rented a car, took time off from work, arrived in another city.  And they told me that I can not collect my winnings because it is no longer for sale."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TE Gadgets",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T11:03:28.000Z",
          "Titre": "Was apparent that storage facility had…",
          "Contenu": "Was apparent that storage facility had gone through before auctioning just based off knowledge of what was listed under description of items listed. It listed fishing gear, which was buried in boxes and not visible without digging."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TAWNYA Benner",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T16:32:50.000Z",
          "Titre": "There was an issue with updating my…",
          "Contenu": "There was an issue with updating my payment information. It took over an hour to fix the problem but it was resolved and then it was a great experience!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Denise Baker",
          "Nb_Reviews": 2,
          "Date": "2023-03-26T19:38:42.000Z",
          "Titre": "I like the platform they make…",
          "Contenu": "I like the platform they make available, however they aren't as customer service oriented as they should be. I made contact recently questioning some photos a facility was using and wanted verification anout the unit size. I was told to call the facility and ask. I responded by asking wasn't that what ST should be doing? Holding their facilities responsible and accountable for their listing and photos? I was completely ignored and an answer was never given.ST does not seem to support their bidders as well as they should, just my opinion. But just as they receive $ from the facilities, I feel they receive mich more $ from their bidders, so I feel they should be more supportive and protective of their bidders. But in a fair manner, I'm not asking for them to do anything unfairly, but at least look into the concerns we bring to their attention. If they did so, made facilities provide photos that aren't blurry, make sure unit sizes are correct and check on shill bidding and why unit \"owners\" always manage to pay their debt within an hour of auctions ending. This happens at every facility 90% of the time an auction gets close to closing. Way, way too coincidental. ST tries to do a good job, but I feel they need to try and do a Great job."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "jorge lopez",
          "Nb_Reviews": 4,
          "Date": "2023-06-30T22:27:22.000Z",
          "Titre": "Website malfunction....",
          "Contenu": "Well when I first began to use Storage Treasures everything was great. Now for the pass 2 months the website is not working correctly. I have to refresh all the time to see the Storage its very frustrating. I called them to ask for help but they said its my computer. Trust me its not all my computers and cell phone as well, I don't think so. Hope they fix this because I do enjoy buy from them. Thank You"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jim Martin",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T14:40:22.000Z",
          "Titre": "Blocking someone without knowing the truth!?!?",
          "Contenu": "I had a very bad experience with a facility manager and they kept threatening to have me blocked on your site if i didn't \"wear a mask\" \"wear it the way i told you\" and then they wouldn't let me back in to get the rest of my units. Now im blocked by you from buying more because this person thinks that they run the world... when i called S.T. (STORAGETREASURES) i was informed that theres nothing i can do.But when i showed you proof that another facility was \"staging\" fake units and stealing from them AFTER we the bidders won they. Nothing was done about that facility. I was given 72hrs to empty over 12 units during Thanksgiving... when i returned to finish. My door code didn't work hence the not being aloud to get my stuff. I've called the facility many times and the manager had not responded. And yet im being punished."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe Mason",
          "Nb_Reviews": 2,
          "Date": "2023-04-02T17:18:51.000Z",
          "Titre": "Ok so far",
          "Contenu": "Site has been pretty good.I was high bidder on storage unit, watched the clock drop to zero but didn’t get the unit. I sent question to Storage Treasures, they never responded."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Bullard",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:46:12.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, they use a non-complicated system that makes use easy for any level of experienced user. And profile setup is relatively easy and quick as well. Only thing I wish was different would be having to refresh my page often to show an accurate countdown timer. Overall a very good service though! Much appreciated!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Caitlin Henry",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:48:39.000Z",
          "Titre": "Overall pleasant experience",
          "Contenu": "The auction page with the auction, you selected, has various other auction similar to it at the bottom of the page, but if you click on those other options, it doesn’t go anywhere and reload the same page over and over again. The quality of the photos are not that great but the overall experience was pleasant and I enjoyed the auctions. I enjoy the emails when I’m out bed so I know immediately to go back in bed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kim Beeman",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:04:57.000Z",
          "Titre": "Very easy to do however the people at…",
          "Contenu": "Very easy to do however the people at the places are hard to get ahold of and some offices have no idea how to handle the units being sold so you have to wait hours to get someone to know how to and be at the facility"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "greg walker",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T05:35:01.000Z",
          "Titre": "I love the way the lockers are…presented",
          "Contenu": "I love the way the lockers are presented and the usual quick response from where I got the locker. There have however been a few times where they don't have anyone on site and looking at their hours it shows them to be open 8-6 or 8-5 and I have driven up there to pick up a locker and then found out it is an unmanned facility. I realize if you scroll down to the bottom it tells you that. It would be helpful if it was stated where the locker is shown. That being said overall I am pleased with Storage Treasures."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Fuchs",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T15:46:56.000Z",
          "Titre": "was easy to use",
          "Contenu": "was easy to use, bid and pay, however would like to be able to easily view auctions I did not win that were saved in my account"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Malinowski",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T17:43:41.000Z",
          "Titre": "Site runs mostly ok… doesn’t go back to…",
          "Contenu": "Site runs mostly ok… doesn’t go back to where you were after looking at an auction. Also, doesn’t keep a history/let you see final bids prices on units you lost.  Could offer insight to bidders.  Oh, and will you FINALLY add a sort function by unit size????  Some of us aren’t looking for 45x90 units!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Magee",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T03:59:40.000Z",
          "Titre": "Meh, gets the job done.",
          "Contenu": "UPDATE: FOUND INFORMATION THAT MAKES MY COMPLAIMT ABOUT BIDDING VOID. GREAT SITE, FEES HIGHER THAN I WOULD LIKE.. BUMPING TO 4 STARS Auctions are easy. Sucks to have to refresh page constantly. Fees are too high to not have an app, or a site that auto updates the bids. Also, sometimes I'll place a bid say for $150, the system will say \" bid accepted, you've been out bid, bid again\" but the bid will still be at $150. Doesn't make sense. It's like they are running up the bids to make money off their 15% fee."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "michael mccollum",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T13:23:03.000Z",
          "Titre": "Happy holidays…",
          "Contenu": "I would of gave 5 stars but you need to make it a little easier for us to contact your customer service for any questions we may have the emailing in a pain in the neck and I went through hell getting the 800 number but happy holidays"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T14:16:36.000Z",
          "Titre": "The last few units had cockroaches",
          "Contenu": "The last few units had cockroaches, which are nearly impossible to spot in the pictures as opposed to in person auctions. We had to circle the area for dumpsters to trash everything since most storage doesn't allow onsite disposal. And as always, I let the storage company facility know 🙄 On the plus side, it is easier to see units in different areas without having to drive to see them all."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Frederick",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T18:33:54.000Z",
          "Titre": "Website is very easy to use",
          "Contenu": "Website is very easy to use, I appreciate how emails are sent to me regarding winning bids and when invoices are ready."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paula",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T19:45:07.000Z",
          "Titre": "Good Results",
          "Contenu": "Made my first auction win and was happy with the results."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeremy Dunlap",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T16:57:57.000Z",
          "Titre": "System is easy to use",
          "Contenu": "System is easy to use, guidelines in place are easy to understand. Opens up areas that in-person cannot do"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Todd knight",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T00:11:28.000Z",
          "Titre": "Easy",
          "Contenu": "Easy bidding and payment"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott E",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T14:18:30.000Z",
          "Titre": "Very nice experience",
          "Contenu": "This was my second online auction for a unit I had won. The lady was very helpful in explaining things of how it works"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lori",
          "Nb_Reviews": 2,
          "Date": "2023-10-31T13:39:07.000Z",
          "Titre": "The experience was frustrating trying…",
          "Contenu": "The experience was frustrating trying to get a live person. I needed to update my new card on file while I went to pick up my unit before work.  Once I tried the approach of being the facility … my phone call was answered by a Man who knew what he was doing. Made sure all info was updated and sent out two confirmation letters because I ended up being highest bidder on 2 units.   It’s a nightmare when you need to speak with a live person for an issue happening in real time. Other than that Storage Treasures is a great place to purchase through Thanks,                   Lori M"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lloyd R.",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T21:30:50.000Z",
          "Titre": "The platform of Storage Treasures works…",
          "Contenu": "The platform of Storage Treasures works well. The reason I didn't give it 5 stars is because I feel they need to regulate facilities better. They should push for better descriptions and pictures. I have found some facilities will not show the bad on purpose. They should be required to show all, good and bad. Also the generic description of boxes, bags and totes should not be aloud. I have seen pictures without a single tote or box but still says so."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mitchell Wiggins",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T15:25:01.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good, I enjoy the way the fees are set up, they are very reasonable"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bw",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T17:19:17.000Z",
          "Titre": "Clean out/ Dumpster needed",
          "Contenu": "The experience itself was without any major confusion just wish they had a dumpster or a container for trash...this was an inconvenience since honestly you do not know how much you need to get rid of."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T12:13:57.000Z",
          "Titre": "The truth....",
          "Contenu": "The website itself is easy to use and customer service has been helpful when needed. My only complaints are the websites acceptance of blurry photos and photos that do not show the entire unit. Some sellers have hidden large items like mattresses, pianos, etc to get bids. There are a lot of buyers that win an auction only to take the expensive items and leave the rest. I have seen the same units sell more than one time. This is a common occurrence which tells me these people are not getting reported."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carl Swensen",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T11:23:25.000Z",
          "Titre": "High fee, terrible website.",
          "Contenu": "Storage Treasures is easy to use, but the website has a terrible user experience, and the 15% hit is hidden and too high. It won’t be long before another app undercuts them or they change the rates."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John B.",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T13:03:33.000Z",
          "Titre": "Might be 5-stars if they could work out the bugs, treat buyers the same as facilities",
          "Contenu": "Overall Storage Treasures has far more auctions than any other storage auction website. However their site crashes all the time. I’m on the go, and have to use my iPhone. Their site seems to crash and always pops up an “Aaarhh Matey!” Pirate symbol when it does. Not sure if it’s an iPhone thing or what. Desktop not a problem. Wish they would get this resolved. While I’m glad to get a discount with my monthly membership, from a 15% buyers premium to 10% (it adds up) I still think the buyers premium is too high. But again, more auctions = more opportunities. So I use them a lot. I’ve only had one bad customer service experience. They chose the storage facility over me. We are BOTH a customer, and I would like to be given equal ground. There are some unscrupulous storage owners/managers out there. Happy hunting!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandra Parks",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T18:08:12.000Z",
          "Titre": "The bidding wasn’t bad",
          "Contenu": "The bidding wasn’t bad. The unit had a lot of trash and it’s a lesson learned. That was my very first unit and that was an awesome experience for me and my family. I would truly keep bidding on units for the excitement. The lady at the facility was awesome to work with her name was Mrs. Jane. Thank you all for the awesome experience. I also would like to know more about the unit liquidation program. Can someone please direct my family  to make this a business in cleaning out unbid storage units. Mrs. Jane said that they need people bad at her office. Can someone please let us know how to sign up. Thanks again for the wonderful opportunity."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Traci Jamison",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T16:20:09.000Z",
          "Titre": "I've been using storage treasures for…",
          "Contenu": "I've been using storage treasures for years now and I love it! Always an easy transaction..thanks!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Justin Parker",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T18:10:51.000Z",
          "Titre": "good experience",
          "Contenu": "It was easy and fast and the people where friendly and helpful"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angel Rodriguez",
          "Nb_Reviews": 2,
          "Date": "2023-08-11T13:42:03.000Z",
          "Titre": "Protecting the auctioneers",
          "Contenu": "The bidding process is quite simple. Improvements [must] take place to avoid the old/ real owner of the unit auctioned from contacting the auctioneer. This had happened to me twice in the last four (4) months and it is an awkward moment. What is to know if not only my phone is shared but my address too. This must definitely stop as it could lead to physical harm and for sure have legal ramifications. Another area to consider is limiting the number of pictures to about six (6)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Phillip Hansen",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T20:09:29.000Z",
          "Titre": "Credit card address not working",
          "Contenu": "The credit card I was using has a p.o. box address and your system would not take in any way I put it in. It was a big pain in the ass after talking to 3 different people 3 different calls no one still helped me figure it out. But other than that it was wonderful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lori Dziekonski",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T14:59:31.000Z",
          "Titre": "It was easy to bidon lockers",
          "Contenu": "It was easy to bidon lockers. The only problem I have is everytine I look at pictures of a locker when I go back it takes me to where I have to start over and put in zip code"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Eskridge",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T14:49:22.000Z",
          "Titre": "Ok experience on a unit",
          "Contenu": "It was good experience but for some reason did not get any emails until the 11/10 and thta the end day the unit was suppose to be picked up hopefully the storage facility will let me pick it up today 11/11"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tracy Lehmann",
          "Nb_Reviews": 2,
          "Date": "2023-08-26T01:35:15.000Z",
          "Titre": "It was really easy to find auctions in…",
          "Contenu": "It was really easy to find auctions in my area. I found that during the final hour and down to the last minutes it was hard to bid and I kept getting errors and had to reload the site several times. Luckily having the max amount you wanted bid option I was able to keep up with other bids coming in otherwise I probably would have not won the unit I was bidding on."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lawrence Cheeks",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T15:13:14.000Z",
          "Titre": "Storages I have been good",
          "Contenu": "Storages I have been good, there’s some ass, some storage units. We’ve been getting set up nice and neat boxes, stacked meat bags and eat it going to empty empty TV boxes empty boxes stacked neatly I guess you feel when I’m trying to say I just."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ken",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T19:28:30.000Z",
          "Titre": "Features and Function",
          "Contenu": "The format, navigation and bidding experience are easy to use and straightforward.  Mobile, not so much. Navigation in Safari is okay at best.  Lots of errors pop up.  Google, a lesser experience and some features won’t work.  Have we thought about an app?  Free for people and they have set up an account to navigate/activate.  I’m sure it’s costly for an app, regardless so many people go mobile once they win a unit or bidding.  Having the confidence that the app will work would keep me bidding, otherwise going mobile, I rarely try to continue bidding due to errors the “ar matey” something went wrong when bidding.  I do recommend storage treasures all the time.  Thx!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randy",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T23:09:29.000Z",
          "Titre": "Storage Treasures was great, the facilities sometimes are different",
          "Contenu": "Storage Treasures there were not problems. All was well as ling as you ready the rules and expectations. I will add watch the storage facilities; they do not always give you the time they state on Storage Treasures to get items removed. Example on Storage Treasures site states 72 hour clean out when you get to the facility you have to clean out only during office hours for three days which sometimes is equal to about 20-25 hours."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony Gossett",
          "Nb_Reviews": 3,
          "Date": "2023-11-19T19:27:22.000Z",
          "Titre": "Seems well designed",
          "Contenu": "Seems well designed. Accurate and quick updates. The only con for me is that the site doesn’t always run well with safari on iPhone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David J. Hill",
          "Nb_Reviews": 5,
          "Date": "2023-08-19T11:13:43.000Z",
          "Titre": "YOUR LISTINGS ARE EASY TO SEE",
          "Contenu": "YOUR LISTINGS ARE EASY TO SEE, ONLY MAIN ISSUE IS THE FACILITIES LACK OF CONSIDERATION TO THEIR OICTURES THEY SEND IN, THEY HAVE BEEN VERY BLURRY AND AT TIMES HARD TO SEE. THEIR DESCRIPTIONS BARELY MATCH THE UNITS. THEY HAVE BEEN USING THE SAME DESCRIPTION FOR EVERY UNIT."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tiffany",
          "Nb_Reviews": 2,
          "Date": "2023-07-15T17:45:46.000Z",
          "Titre": "I love this site however after having a…",
          "Contenu": "I love this site however after having a few problems with the workers at a 2 storage facilities I went for assistance from storage treasures I couldn’t get help. The agent seemed not to be interested. I’ve purchased quite a few units and pride myself on cleaning those units quickly and fully but when a circumstance arise to not have support isn’t good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Troy the treasure hunter",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T17:54:36.000Z",
          "Titre": "Great websites can always be better",
          "Contenu": "Great website with a lot of variety, easy to navigate and maneuver the photos, except when the are taken with dirty lense or by person who doesn’t know how to work a camera, then it would be nice to be able to request better pics. Would also be great to have the option to pay with card online or over phone, to insure that unit is not bought back while buyer is driving to storage unit location, as some lockers may be quite far from buyer’s home location."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nadine wullschleger",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T10:18:59.000Z",
          "Titre": "Am doing well with my storage but some…",
          "Contenu": "Am doing well with my storage but some private seller making food , alcohol and more but you never cancel this units for that am frustrated But otherwise is okay"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sorry customer",
          "Nb_Reviews": 3,
          "Date": "2023-08-11T14:43:14.000Z",
          "Titre": "Ok experience. I would do it again.",
          "Contenu": "Everything went as well as I imagined it would.Two less than desirable issues:1. During the bidding process the software kept logging me out and making me do a recaptcha screen multiple times.2. The information for pickup was only half-correct. This was a U-Hail storage sale and the address given me was for the storage location not the office. I had to get that off of a sign at the storage unit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Douglas Keetch",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T12:54:44.000Z",
          "Titre": "The only issue I have had with storage…",
          "Contenu": "The only issue I have had with storage treasures is buying a unit and getting half way there and being told the person paid for the unit. Any other auction, when the auctioneer says sold the item is gone. Storage treasures sould be the same way."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John McLendon",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T22:01:41.000Z",
          "Titre": "good experience.",
          "Contenu": "the only thing i can say is  what they said could be in the unit was not there"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donita Yarlott",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T10:43:00.000Z",
          "Titre": "storage treasures makes bidding on  and…",
          "Contenu": "storage treasures makes bidding on  and winning storage units simple,   registration is very simple in the whole process is really user friendly and purchased about 10 units so far in the very pleased with the whole process, except for iron guard  storage in smokey point. I recommend staying away from that place the manager there is not a street shooter."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thlathia",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T02:22:32.000Z",
          "Titre": "The drive from Loganville to Sandy…",
          "Contenu": "The drive from Loganville to Sandy Speings was not good. Please setup an online method of payment. The staff however was very informative and explained the entire process this was my first bid!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ed Hutchinson",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T12:36:05.000Z",
          "Titre": "I had a good experience",
          "Contenu": "I had a good experience, but the buyers fee is high"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cassandra Hill",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T11:09:41.000Z",
          "Titre": "Love it",
          "Contenu": "Always a good time, better than gambling. Smooth operation."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shane Meyers",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T15:33:20.000Z",
          "Titre": "It wasn’t clear that the cleaning…",
          "Contenu": "It wasn’t clear that the cleaning deposit funds had to be in cash so that delayed me by a day. Then, the box of personal affects I put together was stolen and the employee at the storage facility blamed me for losing it/getting it stolen. Great items in the unit though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carole Blackmon",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T16:44:04.000Z",
          "Titre": "I think you need a cancellation button…",
          "Contenu": "I think you need a cancellation button three days before auction ends.  You should have contractor phone number who will help haul peoples auctions away.  Thank you for everything this is a great website."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tammi Hale",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T16:27:05.000Z",
          "Titre": "Everything worked out perfectly",
          "Contenu": "Everything worked out perfectly. What I don't like is your company doesn't answer the phone, nor do you call back when I emailed asking for a return call. A huge negative for your company, that clearly doesn't care about the people paying your salaries!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ritchie Montoya",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T15:06:05.000Z",
          "Titre": "easy and simple",
          "Contenu": "Easy and simple way to bid on storages"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lindsay Savage",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T16:13:45.000Z",
          "Titre": "Great experiences at the storage facilities",
          "Contenu": "Great experiences for the 2 storages I've won so far. My only complaint is that too many units get cancelled... if negotiation is still going on with the owner, I feel it should not be listed then."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathy Downey",
          "Nb_Reviews": 3,
          "Date": "2023-07-28T21:10:47.000Z",
          "Titre": "All in all everything was smooth",
          "Contenu": "All in all everything was smooth. No real snags. Just pass it forward to to public storage units to have the lock box for return of locks, near the offices Finding them is impossible in some storage facilities. A map of each storage site would be nice so you don’t have to drive around in circles."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janelle Dinnetz",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T14:56:13.000Z",
          "Titre": "No deposit required",
          "Contenu": "No deposit required. Like being able to pay with debit card as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T22:07:55.000Z",
          "Titre": "Good but other stuff could he better.",
          "Contenu": "The units i have won were ok but i see alot of canceling even the day of and i get that happens.Storage treasures as a business has always been great. The canceling and the people that bid just to bid up make it annoying but that's all part of it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Durp A Durp",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T20:42:17.000Z",
          "Titre": "just call ahead to the storage to get accurate info on how much you owe.",
          "Contenu": "(To be clear - if you buy a unit the fee from the website is taken off your payment card, the cash remainder is paid with cash only and cash deposit at the facility.)  This time around the storage facility was way more helpful than the website. I was confused about the website's fees taken electronically vs the facility payment that is cash. If the facility didn't explain when I went in that there is only the cash reminder, then I'd think there was a problem with website's payment fees and that i was undercharged."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathleen Johnson",
          "Nb_Reviews": 2,
          "Date": "2023-08-11T10:08:48.000Z",
          "Titre": "Most of the time u get everything done…",
          "Contenu": "Most of the time u get everything done fast but there's been times where I win  I get there or it's been canceled n no one told me  I waste my time brushing to get there to get it done"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ralph Canales",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T03:58:39.000Z",
          "Titre": "First time on Storage Treasures",
          "Contenu": "First time on Storage Treasures sight was easy to navigate and place bids. Only hang up when trying to pay, I was sent to 2 other non related pages before I could pay for unit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Pruett",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T01:44:32.000Z",
          "Titre": "Easy to use, but soft close needs to go",
          "Contenu": "This site is one of the easiest to use. Being able to bid, and also put a max bid, is great. But, the soft close needs to go. The auction time is clearly stated, and adding an extra 3 min, because someone bids at the end, is honestly unfair. I would have had a few more auctions, if it wasn't for that soft close.Ok, this is my reply, to your reply. You say the soft close is like the auctioneer saying going once, going twice. But, that doesn't take 3 min, or add 3 min."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "carleen delatorre",
          "Nb_Reviews": 2,
          "Date": "2023-08-30T10:38:40.000Z",
          "Titre": "I'm going to be honest",
          "Contenu": "I'm going to be honest. I love the platform. The ease of bidding,the right area, more places than other platforms.  My grief is with canceled units. I believe that all units should only go up fir bid when the owner has legally lost control of it. I would rather bid on units that can truly be attained, than ones that can be canceled.  I understand the law behind this but don't agree. When you go to an auction, the item's now are up for sale. The resources on bidding with one unit are carefully scrutinized and to have it canceled.....please just hear this plee for a change somewhere in the system. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T10:57:51.000Z",
          "Titre": "I really like how its run",
          "Contenu": "I really like how its run. Ive bought a few lockers already.However i did lose a locker i was bidding at the last minute s bid was put in and i wasnt allowed to rebid it said sale was closed. I was watching it and never refreshed, i lost the locker."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer  feldpausch",
          "Nb_Reviews": 3,
          "Date": "2023-09-22T13:44:33.000Z",
          "Titre": "It's an easy process bidding",
          "Contenu": "It's an easy process bidding. My only issue is that I don't think you should add more time each time someone bids on a unit, i know its only a minute or 2 but I still don't think it should be added."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Miri",
          "Nb_Reviews": 2,
          "Date": "2023-09-22T15:55:50.000Z",
          "Titre": "Easy to use",
          "Contenu": "The website is easy to use for bidding, but I feel that the search function and the payment processing could be better.  I will definitely continue to use the site."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Olger Parker",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T02:25:54.000Z",
          "Titre": "It was easy process but  everything in…",
          "Contenu": "It was easy process but  everything in the unit I got was nothing but homeless peoples clothing full of roaches, maybe next time it won’t be so bad, but it was easy so I’ll keep using app"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Cordell",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T22:49:13.000Z",
          "Titre": "I bought a storage unit ...went first…",
          "Contenu": "I bought a storage unit ...went first day and got half of my stuff then went back next day and storage place wouldn't let me have it .This unit was not suppose to be sold at all .I drove over 80 miles for this unit .I wasn't compensated at all."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elizabeth Cook",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T04:05:26.000Z",
          "Titre": "They never answer at the office",
          "Contenu": "I can’t get ahold of public storage to get in the unit and they was closed today. I found this out after bringing over an hour and being told over the phone that they was open so I’m gonna run into issues even getting everything out and that is if they are really open on Memorial Day. I was told they was but I was told that about today as well"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T13:36:18.000Z",
          "Titre": "Fun experience",
          "Contenu": "Was a neat experience and an easy to use system. Wish it didn't do the auto bid stuff.  That takes some of the fun out of auctions imho"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Johnson",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T10:11:09.000Z",
          "Titre": "The only 2 issues I have with your site…",
          "Contenu": "The only 2 issues I have with your site is notification of auctions getting close to the end and notifications of being over bid. I was not notified with one of the most recent auctions. I have also noticed that a few times auctions have been extended when I was the high bidder."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BG",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T14:30:45.000Z",
          "Titre": "For a 1st time buyer",
          "Contenu": "For a 1st time buyer, I really enjoyed the process of storage selecting. My rep was super friendly and knowledgeable. I would definitely recommend trying them out"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 4,
          "Date": "2023-10-08T14:23:35.000Z",
          "Titre": "First Unit",
          "Contenu": "This was my first successful bidding on a unit.  Went very good.   No issues at all.  Was a small unit so was pretty simple.  The two gentleman who assisted me were very friendly and helpful.   No complaints this time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shannon Asim",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T11:21:07.000Z",
          "Titre": "All the storage unit that I been too…",
          "Contenu": "All the storage unit that I been too have great people that work there except for public storage 27382 on e pikes peak Ave she was very rude she didn't want to help me at all what so ever and I will never try to get one of there storage unit ever again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Doug Garver",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T12:59:31.000Z",
          "Titre": "Storaucreview",
          "Contenu": "Storage auctions has the most online auctions in my immediate area. They are reliable and consistent in their policies"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Will",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T19:51:21.000Z",
          "Titre": "Easy to navigate website…",
          "Contenu": "Navigation of the website is the best in the industry. Photos of auctions are also the best. Buyer fees are a little steep."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerry Barnes",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T19:22:00.000Z",
          "Titre": "Overall I am satisfied I wish the user…",
          "Contenu": "Overall I am satisfied I wish the user names were displayed to see if you are outbid by a random or in competition with another single bidder"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stacy Hjelmstad",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T16:36:32.000Z",
          "Titre": "Storage Treasures has the most auctions…",
          "Contenu": "Storage Treasures has the most auctions or any storage auction site."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Knapp",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T13:06:55.000Z",
          "Titre": "Pictures are clear and helpful",
          "Contenu": "Pictures are clear and helpful. Only down side is that once a unit is up for auction it should not be canceled. There has been more than enough time given to make payments and no payment should be taken except from the winner of the unit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T13:12:18.000Z",
          "Titre": "Quick and easy to use",
          "Contenu": "Quick and easy to use. Some storage facilities should be checked into, as employees don't stay around like they should. Not sure how ill get that deposit back"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Turner",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T13:48:26.000Z",
          "Titre": "I've had luck on some of the units…",
          "Contenu": "I've had luck on some of the units transactions always went smoothly I will continue to purchase or bid on units"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tinkers Treasures",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T13:40:42.000Z",
          "Titre": "Site could use some tweaking",
          "Contenu": "My first purchase went pretty well.  The site could use some work.  I found it difficult to find my purchased unit after the sale.  I contacted support and they were ver helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tina Woods",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T16:03:40.000Z",
          "Titre": "Very professional",
          "Contenu": "Very professional.  Was an easy process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 2,
          "Date": "2023-08-25T14:19:13.000Z",
          "Titre": "Had a good overall experience",
          "Contenu": "Had a good overall experience.  The invoice that I received took a hot minute to understand.  Take a look at how your invoices are layed out and change that please"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LFactor",
          "Nb_Reviews": 2,
          "Date": "2023-07-24T17:40:07.000Z",
          "Titre": "Super simple & fun process",
          "Contenu": "Super simple & fun process. I lost out on an auction due to the mobile website not working at the end, but I should have planned better so that's on me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randy Metzger",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T21:52:40.000Z",
          "Titre": "Storage Treasures is easy to use and…",
          "Contenu": "Storage Treasures is easy to use and find relevant lockers. They give feedback when you are outbid and provide accurate times for the lockers you are bidding on."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ash",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T10:40:23.000Z",
          "Titre": "Website is very finicky and glitchy to…",
          "Contenu": "Website is very finicky and glitchy to use but great resource for finding storage units to bid on."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Meise",
          "Nb_Reviews": 2,
          "Date": "2023-06-20T11:54:10.000Z",
          "Titre": "Kept me up to date on my bid",
          "Contenu": "Kept me up to date on my bid, immediately notified me whenever I was out bid. I do, however, feel that the amount they take is a lil to expensive, but that's just me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Estrolita Leavy",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T20:20:21.000Z",
          "Titre": "I was able to find it the lady at the…",
          "Contenu": "I was able to find it the lady at the counter was very helpful and the storage look just like it looked in the picture"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Farrah Reece",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T21:28:20.000Z",
          "Titre": "Trustworthy",
          "Contenu": "This just really makes the process so easy to do. Everything was exactly how it was shown on the site. And there were no hidden fees or extra charges. I guess 5 stars would have been more accurate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rosemarie Ison-Edgington",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T14:51:33.000Z",
          "Titre": "Everything was straight forward",
          "Contenu": "Everything was straight forward. I signed up, added payment info, bid, won, and printed my invoice. No difficulties at all."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Wilkinson",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T19:29:25.000Z",
          "Titre": "Things have been working out so no…",
          "Contenu": "Things have been working out so no changes"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Samuel Mikels",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T21:15:34.000Z",
          "Titre": "Fantastic",
          "Contenu": "The buying experience was great. It was our first unit bought through this site and everything went very smoothly. My only complaint was the site itself. If you click on a unit to look at it, once you back out it takes you to the top of the page instead of where you left off. It's very frustrating to have to scroll back down and try to remember and find where you where last. That's all tho. Other then that is was fantastic"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ercedes tureman",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T12:11:41.000Z",
          "Titre": "being so consistent in having the most…",
          "Contenu": "being so consistent in having the most available units. its the best online storage auction site there ever was"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wilona Mcleod",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T08:01:24.000Z",
          "Titre": "More time to move stuff out of the…",
          "Contenu": "More time to move stuff out of the storage don't know if you manage that part or not but food for thought and another thing should not be able to auction off what the other person already bought other then that it's all in all aj alright site"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JB",
          "Nb_Reviews": 1,
          "Date": "2023-05-28T15:07:07.000Z",
          "Titre": "Like online auctions…",
          "Contenu": "Like online auctions but you need to set up a program that emails you when you are outbid or when a unit you are bidding on is removed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mack Parker",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T08:04:46.000Z",
          "Titre": "Staged units ,watch out for private sellers and units with everything visable,",
          "Contenu": "It's a legit untel u get a staged unit or a unit that the employees have gone thru all ready,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Erickson",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T12:02:39.000Z",
          "Titre": "The facility I won the auction at was…",
          "Contenu": "The facility I won the auction at was Top Notch all the employees were more than helpful can't wait for the next one thanks guys"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew Crews",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T12:48:58.000Z",
          "Titre": "The info provided is great and the site…",
          "Contenu": "The info provided is great and the site didn’t have any issues at closing time like some others have. Only wish that there was a button to add to watch list with out going in the full add"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 2,
          "Date": "2023-06-16T10:14:48.000Z",
          "Titre": "Great site ..very dependable...easy to navigate.",
          "Contenu": "Great site for finding useful items for personal use or to resell. Great side income. Very easy to use and navigate. Trustworthy .."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jacob Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T14:23:35.000Z",
          "Titre": "Good experience",
          "Contenu": "StorageTreasures.com makes it easy for someone to purchase a storage unit. Your final price will be quite a bit more than your final bid. Keep that in mind when you bid."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ana Rosales",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T18:31:01.000Z",
          "Titre": "Great",
          "Contenu": "The only problem I found is the payment method, not being able to pay online and get the code, a lot of paperwork to pay"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Manuel N",
          "Nb_Reviews": 4,
          "Date": "2023-05-28T20:15:11.000Z",
          "Titre": "Overall positive review",
          "Contenu": "Overall positive review. However, I wish there was an EASY way to determine what the final bid was on a unit that I was overdid and lost."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Baker",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T14:10:50.000Z",
          "Titre": "The company seems to be fair to deal…",
          "Contenu": "The company seems to be fair to deal with so far. I would like the opportunity to do another review after using the site longer"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rich Rumbaugh",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T20:07:51.000Z",
          "Titre": "It was a good experience",
          "Contenu": "It was a good experience. I think the what would make the experience better would be to have the pictures be better and more descriptive as well as sizes of the items"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Katina Shaffer",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T13:33:54.000Z",
          "Titre": "Wish we didn't have to pay extra to get…",
          "Contenu": "Wish we didn't have to pay extra to get the different rate"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LynEll Richter",
          "Nb_Reviews": 5,
          "Date": "2023-12-22T00:20:20.000Z",
          "Titre": "Better experience than other sites",
          "Contenu": "I started my unit buying using another site, and the practices of that site are a little different than this one. There is time to get the units emptied, and I have not had the challenges of contacting customer service when needed as I did with the the other site. Thank you. Very helpful in my new adventure in buying abandoned units. I have recommended you to my friend who actually started me on this adventure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T11:57:36.000Z",
          "Titre": "Everything is easily done online",
          "Contenu": "Everything is easily done online, if only all storage lockers were online like Storage Express.... I have used Storage Treasures at least 10 times in the Louisville Kentucky area. You need  credit or debit card on file for auction fees....locker fee paid to storage locker company....most you have to pay cash and talk to a person, a few are completely online/phone.... easier for me to schedule..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert White",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T14:54:52.000Z",
          "Titre": "Trustworthy, reliable and honest!",
          "Contenu": "This was my first experience using storage treasures I was a bit hesitant at first. As I scrolled through the auctions I saw the detail ed description of each listing. After winning my first auction the process was flawless. A small premium charged to my credit card and then the balance paid to the storage facility. Even the storage facility personnel was a pleasure to deal with. Awesome experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "darlissa freeman",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T04:07:49.000Z",
          "Titre": "Customer support group was very…",
          "Contenu": "Customer support group was very friendly helpful in all kinds of ways need more people like them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erin Naastad",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T06:09:04.000Z",
          "Titre": "Storage Wars Dream come......",
          "Contenu": "I have always wanted to do a storage auction. Mainly from watching Storage Wars. Well Storage Treasures made that deam come true,  well most of it, I got 2 lockers cheap, didn't get lucky and find any Gold or thousand dollar items, but I found a bunch of Change, and costume jewelry. I got to start some where right.. over all I enjoyed myself and look forward to another auction!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Tessier",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T14:17:55.000Z",
          "Titre": "Staff was helpful and efficient",
          "Contenu": "Staff was helpful and efficient. I have noticed one thing that I don’t understand. Several times I have seen people waiting to make cash payments and there is no drop box or way for them to do so without waiting for staff to return."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alyssa Turner",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T04:28:04.000Z",
          "Titre": "It was pretty easy but I’m still…",
          "Contenu": "It was pretty easy but I’m still waiting for the storage facility to return my deposit"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wanda Reynolds",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T12:43:39.000Z",
          "Titre": "This was my first time buying at a…",
          "Contenu": "This was my first time buying at a storage auction everything went perfect. The unit had a lot more than what was in the pictures and the timing to get things out of the unit was good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T04:12:19.000Z",
          "Titre": "Great experience....",
          "Contenu": "Great experience..... I highly recommend storage treasures.  Bidders need to realize that some auctions may get canceled and getting to a winning bid locker asap is important."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lost Dutchman",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T15:40:12.000Z",
          "Titre": "Storage treasures makes the process so…",
          "Contenu": "Storage treasures makes the process so easy and seamless. Great selection of units, fair pricing and awesome customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Razner Bernardini",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T05:33:43.000Z",
          "Titre": "hats off to managers of storage business",
          "Contenu": "the last unit we bought was huge the manager said don't worry about the extra time we needed to clean it out. gave the whole deposit back, that was secure storage Malborne that gave us some southern hospitality we appreciate you two very much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FRANK LUCIANI",
          "Nb_Reviews": 5,
          "Date": "2023-12-15T13:35:59.000Z",
          "Titre": "Good service",
          "Contenu": "Been using storage treasures for years and haven’t any problems . Any time that a unit was cancelled I received the money from storage treasures in a timely manner"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Petar Otasevic",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T03:01:28.000Z",
          "Titre": "\"I recently had the pleasure of using…",
          "Contenu": "\"I recently had the pleasure of using TreasureStorage.com for bidding and purchasing storage units, and I must say, the experience exceeded all my expectations. The website's user interface is intuitive and user-friendly, making the bidding process not only easy but genuinely enjoyable. The efficiency of the service is remarkable – winning a bid and receiving a confirmation receipt was astonishingly quick, taking only a few minutes. This level of promptness and ease adds a lot of value to the overall experience. TreasureStorage.com has definitely set a high standard for online storage auctions, and they deserve every bit of the five stars I'm giving them. Highly recommended for anyone looking for a hassle-free and swift bidding experience!\""
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Duane Cazares",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T19:04:09.000Z",
          "Titre": "Storage treasures is very accurate on…",
          "Contenu": "Storage treasures is very accurate on their pictures and descriptions of what you are bidding on and purchasing...thank you storage treasures..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TIM",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T18:02:19.000Z",
          "Titre": "Storage treasures is becoming to go to…",
          "Contenu": "Storage treasures is becoming to go to site for storage unit auctions. They provide a good service at a fair price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marks Ochoa",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T12:25:42.000Z",
          "Titre": "Online is the best way to bid auctions…",
          "Contenu": "Online is the best way to bid auctions due to the fact there's no chance of any retaliation from any bidders that got outbid because nobody else knows who is bidding, at live auctions it's known to get ugly from some greedy people, storage treasures is the way to go if you do the auction circuit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K Bazz",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T15:14:19.000Z",
          "Titre": "We love using Storage Treasures for…",
          "Contenu": "We love using Storage Treasures for both buying and selling. Their customer service is awesome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Secrest",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T21:15:34.000Z",
          "Titre": "Great job",
          "Contenu": "All good. Facility staff was great, very helpful. Understood the processes, without any delays and were courteous and friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bradley Hines",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T14:38:11.000Z",
          "Titre": "Exactly as advertised",
          "Contenu": "Exactly as advertised. Locker was exact as pictures claimed. Storage location called within an hour of winning"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Scoles",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T16:37:10.000Z",
          "Titre": "The gentleman working the front desk…",
          "Contenu": "The gentleman working the front desk was a pleasure very friendly helpful couldn’t have asked for a better experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J Black",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:58:51.000Z",
          "Titre": "A lot of work but not because of the app",
          "Contenu": "Lot of fun…..got 2 units my first time out……even more work….not sure if I will do this again. Thank you Storagetreasurea.com you have made everything as simple as possible!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T22:35:27.000Z",
          "Titre": "I had a excellent experience altho I…",
          "Contenu": "I had a excellent experience altho I didn't get crap but the auction part was film and the unit owners was amazingly sweet thank you!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T07:56:42.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "Leslie made the experience amazing! She was very polite and extremely helpful, went above and beyond to ensure I had everything right the first time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MELISSA MARTINEZ",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T18:51:13.000Z",
          "Titre": "Excellent Storage Unit Auctions",
          "Contenu": "Very easy to use application for bidding on Storage units. I have won multiple units and its always so easy to pay your invoice and claim your unit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy Burford",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T12:37:28.000Z",
          "Titre": "Good web site",
          "Contenu": "It's easy to use, search feature gives accurate data, map to the storage facility is helpful, and bidding is easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J Skibell",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T01:04:59.000Z",
          "Titre": "Great things done in vain......",
          "Contenu": "The storage treasures team is great have given me free units in the past. The problem lies with the employees of the facilities that employ them. They obviously go through the units before they take the pictures so it's a little frustrating and it makes me quite frankly not want to do the auctions because anything that's a values been taken by the employees already. If there was a way you could remedy that the access that they have to it then I would be much more involved in bidding on auctions. I found the lock they had drilled out in the far back of a 10x30 unit laying 30 ft away from the door Tell me how that happens."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T21:27:39.000Z",
          "Titre": "E bet thing went smooth and easy",
          "Contenu": "E bet thing went smooth and easy, the office were freindly and very helpful .it was a pleasant experience,Ty and looking forward to doing more business with your company.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug Jarman",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T12:32:32.000Z",
          "Titre": "Best Photo Features",
          "Contenu": "By far the best of the online storage auction sites.  Best photo features of them all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "cher coscia",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T12:54:09.000Z",
          "Titre": "the photos where so very helpful it…",
          "Contenu": "the photos where so very helpful it made it so much easier in deciding on my first time ever auction.  The front desk manager was wonderful.  She explained everything to me. She was extremely and kind"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Preston",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T14:04:45.000Z",
          "Titre": "Careful who you associate your account with it could possibly hinder your ability to bid.",
          "Contenu": "I like the experience of low cost and specialty units where there is no deposit on the unit. Be Leary how you associate your account cause another bidders mistakes can leave the wrong impression on your account as it has mine,even though we have separate accounts. Your pick up partner can be in debt which can disable your ability to bid. I'm hoping my account will be reactivated cause I'm missing out on some good units. They cancelled on me early so I shouldn't be liable for service fees."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald Oconner",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T18:03:51.000Z",
          "Titre": "Great company",
          "Contenu": "Very nice and friendly experience with this company I will do business with them in the future"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T18:03:17.000Z",
          "Titre": "Everyone has been helpful and friendly…",
          "Contenu": "Everyone has been helpful and friendly that we have met via phone or in person . We love the profit and looking forward to much much more to buy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bashir Butt",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T15:55:45.000Z",
          "Titre": "I have a little hard time to use. You guys websites, you know, you guys need a little bit more easy to use it.Maybe IMA new that's why I may not understand it. I may have to get more time to learn.  I",
          "Contenu": "I am still learning but you guys website is a little bit hard to use it. I may not understand what I'm looking for but I have a hard time to go back-and-forth to do all those every storage. Not easy to go I have to close down and then I go back.  To be completely local and you guys have the pictures are not so many either"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DARLA GARRETT",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T03:12:28.000Z",
          "Titre": "I thoroughly enjoyed bidding and…",
          "Contenu": "I thoroughly enjoyed bidding and digging for treasures. I highly recommend to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ginger Potter",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T20:31:41.000Z",
          "Titre": "I love y'all but only wish y'all would…",
          "Contenu": "I love y'all but only wish y'all would change your rules when somebody wins the winning bid you shouldn't have the right to cancel or let someone come back into pay for their unit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luann Sparks",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T12:37:19.000Z",
          "Titre": "This was the easiest transaction I have…",
          "Contenu": "This was the easiest transaction I have ever found. This was our first time to use and we will definitely be doing this again. Easy to work with and very enjoyable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Brondsema",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T16:56:50.000Z",
          "Titre": "Nice easy process!",
          "Contenu": "Easy process with great info on storage unit"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathan Bradley",
          "Nb_Reviews": 8,
          "Date": "2023-11-30T17:10:24.000Z",
          "Titre": "Good things all around",
          "Contenu": "I utilize a few different storage locker auction sites but Storage Treasures is my top one I like. The lockers are always nicer, the pictures are always clear, and with the red and green banner letting you know if you are winning or losing makes it simpler then having to click into the post every time. I have had slight issues in the past that were cleared up on the spot with their chat feature which is super helpful. I have been told by storage facilities that calling customer service is a pain but I've never had to call. Obviously I will say paying the 15% buyer premium when you buy a locker is a burn on the wallet and I know I could buy a membership which would lower it the buyers premium but I just haven't made the jump."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CL",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T19:00:06.000Z",
          "Titre": "Winning an auction is exciting",
          "Contenu": "Winning an auction is exciting. Having one canceled as soon as you are the winning bidder is very disappointing. Overall I enjoy the auctions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Ballmer",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T17:41:26.000Z",
          "Titre": "Easy to bid and pay",
          "Contenu": "Easy to bid and pay. Communication was very good dealing with the units i bought."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nici Gibson Altstadt",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T06:23:03.000Z",
          "Titre": "In my area there is and there isn't…",
          "Contenu": "In my area there is and there isn't treasure to find. I feel if we didn't have you guys, letting storage units here. Get on board with you online. All of us in this area would be missing out. You so much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kris",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T13:50:31.000Z",
          "Titre": "I choose other sites first.",
          "Contenu": "The facility was great to work with. The site is the worst to manage.  Can’t see bidders and photos are terrible on an iPhone.  Not a fan of the fees that you charge either and it’s a paperwork nightmare! So most of my purchases are with other companies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bader Alsabah",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T10:09:24.000Z",
          "Titre": "It's a great auction..easy ..fear",
          "Contenu": "I'm new in the auctions  world. I feel comfortable when I m here ...it's good feeling and easy ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron Hernandez",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T06:41:49.000Z",
          "Titre": "My experience is good with yours easy…",
          "Contenu": "My experience is good with yours easy to buy and staff very friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melisa Short",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T11:11:14.000Z",
          "Titre": "I won 2 auctions and the people at the…",
          "Contenu": "I won 2 auctions and the people at the storage facilities were amazing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keisha Dalton",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T15:50:42.000Z",
          "Titre": "Easy process with no hassle",
          "Contenu": "The owner and employees of the storage unit were easy to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margaret McAlister",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T05:33:23.000Z",
          "Titre": "The ease of the whole process from…",
          "Contenu": "The ease of the whole process from beginning to the end"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Calvin Landry",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T16:03:35.000Z",
          "Titre": "Storage Treasures goes above and beyond",
          "Contenu": "With all my dealings with Storage Treasures the support team has been able to help me resolve any issue I’ve had with courtesy and respect."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Morris",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T14:51:08.000Z",
          "Titre": "Manager at storage unit was amazing --…",
          "Contenu": "Manager at storage unit was amazing -- very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R. Anderson",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T18:17:46.000Z",
          "Titre": "For the most part it’s an easy…",
          "Contenu": "For the most part it’s an easy experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Helen Riley",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T15:46:56.000Z",
          "Titre": "I love storage treasures",
          "Contenu": "I love storage treasures. Was a very easy site to use. I got my self a great treasure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Cox",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T00:15:24.000Z",
          "Titre": "I have been using them for quite some…",
          "Contenu": "I have been using them for quite some time and they are always so helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Fortner",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:43:49.000Z",
          "Titre": "Easy online bidding",
          "Contenu": "Easy online bidding, relatively cheap & lots of fun buying the unknown."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Omar San Diego",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T16:53:48.000Z",
          "Titre": "I am on storage treasure all day…",
          "Contenu": "I am on storage treasure all day looking for units, absolutely the best storage auction site!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Bishop",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T21:21:30.000Z",
          "Titre": "Life storage manager is great",
          "Contenu": "The manager sara at life storage was awesome. She took care of us quickly and was very nice. I will be back!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jazzmin dabney",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T14:01:19.000Z",
          "Titre": "One man’s lost is another man’s treasure",
          "Contenu": "This a great platform that you guys have I really appreciate this site to help others in the world. One man’s lost is another man’s treasure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex Astilla",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T20:03:06.000Z",
          "Titre": "Fast and easy transactions",
          "Contenu": "Fast and easy transactions, great and helpful staff. 👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sirenia Frasure",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T17:58:51.000Z",
          "Titre": "Smooth transaction from start to…",
          "Contenu": "Smooth transaction from start to finish, and the staff at each location was more than helpful. Will definitely be using again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher King",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T13:30:53.000Z",
          "Titre": "Very easy to navigate",
          "Contenu": "Very easy to navigate. I've qon so many good lockers from this site!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Herring",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T17:19:11.000Z",
          "Titre": "everyone is always polite and helpful",
          "Contenu": "everyone is always polite and helpful. the site is easy to use"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M.Mur",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T11:57:36.000Z",
          "Titre": "Courteous and Helpful",
          "Contenu": "I’ve purchased several Units through StorageTreasures and I’m very satisfied with the transactions. I’ve never encountered a rude or discourteous attendant to date! Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Bradbury",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T01:58:47.000Z",
          "Titre": "Great experience",
          "Contenu": "Had a great experience it was so easy to bid and follow along to see if I was being out bid"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elise Suarez",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T09:29:38.000Z",
          "Titre": "It’s a win win",
          "Contenu": "Easy money bet on something be the highest better win it pick it up, clean it out win-win"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tammy",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T19:05:01.000Z",
          "Titre": "Great service equals happy customer",
          "Contenu": "From start to finish everything went smoothly.  The website is great the customer service reps are friendly and proffesional and there were no hidden fees.  I am very satisfied with this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan Cajigas",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T15:30:19.000Z",
          "Titre": "This is not a TV show",
          "Contenu": "This is not a TV show! If you're thinking about doing this beCAREFUL There's a lot of fake units out there what you see is not exactly what you're getting.. Big Dreams Bigger nightmares! Totes filled w Christmas Halloween Easter.Jordan boxes stuffed with envelopes.Power tools with plugs cut off.Bed sets with no screws to put together.Washer and dryer that don't work.Refrigerators with old food in them. Lawn mowers always need repair they never startJUNK up to the ceilings!Very heavy furniture, sleeper couches that aren't worth anything you won't even let your dog sleep on them. Use sex toys a ton of that. Human waste yes believe it or not when people leave lockers behind they leave you a gift as well. I could go on and on and on. So basically you're cleaning out a storage locker most of the time it's what people leave behind on purpose meaning it doesn't have that much value to them. You might find something that you could use or even resell but after the expense of getting a truck guys hours of work to end up taking most of it to the dumpBe prepared for the worst keep your bidding low. Good luck 👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "valentina baca",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T00:06:55.000Z",
          "Titre": "Great customer service",
          "Contenu": "As soon as I won the units, I got a clear and very easy to read invoice, when I need to speak to someone I get great customer service they are very polite and helpful I will continue to try and get units with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Norsene Heather",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T10:07:43.000Z",
          "Titre": "Easy , fun, exciting",
          "Contenu": "Wat made my experience good was I traveled to another state and storage unit workers were great and helped me out"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gabe Potter",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:18:49.000Z",
          "Titre": "Staff is friendly and very helpful",
          "Contenu": "Staff is friendly and very helpful!  Will do business again. Thanks very much for.going the extra mile"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juana Felix",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T21:32:09.000Z",
          "Titre": "First and more important it’s not fraud…",
          "Contenu": "First and more important it’s not fraud and I thank for that, quick response on bidding, web site easy to manage."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Not a happy camper",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T19:01:51.000Z",
          "Titre": "Never again",
          "Contenu": "My experience has been awful I couldn't get to a won unit that I was charged for and storage treasures kicked me off the app so now I'm unable to use the app and bid on auctions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Solecial",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T12:18:20.000Z",
          "Titre": "Been great to use and easy to use app…",
          "Contenu": "Been great to use and easy to use app and site. Definitely been a great resource for us to build up a startup. Visually aesthetic and real time functionality makes it even better. Great job"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bella Wolfe",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T14:00:41.000Z",
          "Titre": "Super easy to use auction format makes…",
          "Contenu": "Super easy to use auction format makes bidding a breeze. I have purchased two lockers and both transactions went smoothly from bidding to payment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lionel Johnson",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T00:36:55.000Z",
          "Titre": "my experience is been very very good",
          "Contenu": "my experience is been very very good. thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JAY Rivera",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T23:05:23.000Z",
          "Titre": "I love this bidding site",
          "Contenu": "I love this bidding site! It is honest and I totally had a great experience. Definitely recommend it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S Miller",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T01:11:36.000Z",
          "Titre": "First time buying a locker",
          "Contenu": "First time buying a locker, and the process for setting maximum bids and the updates via email made the transaction easy peasy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle P.",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T11:01:36.000Z",
          "Titre": "Easy to use website",
          "Contenu": "Easy to use website. Also helpful customer service if support is needed. Fair and friendly. All around great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela Washington",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T10:56:42.000Z",
          "Titre": "Great Investment",
          "Contenu": "I am retired and this keeps me busy and entertained"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Kennedy",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T18:48:23.000Z",
          "Titre": "Smooth transactions",
          "Contenu": "Smooth transactions. Website is easy to use, and payment/pickup went flawlessly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cody Serucsak",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T01:34:48.000Z",
          "Titre": "The site work great find some cool…",
          "Contenu": "The site work great find some cool stuff. Locker all good no fuss bout the whole deal bro."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Travis Bowman",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T15:29:02.000Z",
          "Titre": "Simple process",
          "Contenu": "Storage treasures has been very easy to deal with when buying storage units.Simple and easy process from start to finish."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ward Cusic",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T19:22:42.000Z",
          "Titre": "Lots of Fun!!!!",
          "Contenu": "I am having the time of my life! The adventure of finding treasures in storage units is the best therapy I could ask for!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thea Fisher",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:12:02.000Z",
          "Titre": "love storage treasures",
          "Contenu": "This company made my online buying pleasant and they were very prompt. No waiting..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Troy",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T14:06:41.000Z",
          "Titre": "Treasure shopping lol",
          "Contenu": "Was a first for me. I enjoy looking through treasure lol. Employees were nice and ready to deal with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan Navarro",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T21:09:26.000Z",
          "Titre": "Easy process!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bishop",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T12:49:19.000Z",
          "Titre": "Very helpful",
          "Contenu": "Very helpful for my first time purchasing. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Misty Earley",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T14:10:27.000Z",
          "Titre": "Loving Storage Treasures",
          "Contenu": "I Love Storage Treasures. Storage Treasures is the best website for online storage auctions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pedro Rocha",
          "Nb_Reviews": 3,
          "Date": "2023-11-25T12:30:43.000Z",
          "Titre": "Storage treasures is an amazing…",
          "Contenu": "Storage treasures is an amazing opportunity for people to get out and explore a mysterious hobby.  Customer service experience has been great and very fare when it comes to bids."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roland Williams",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T10:37:13.000Z",
          "Titre": "User-friendly",
          "Contenu": "Very user-friendly all information is guided. I need it. Don’t have to worry about traveling out and not finding anything."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Figen Sahinsoy",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T16:59:01.000Z",
          "Titre": "It was my first time to get bid",
          "Contenu": "It was my first time to get bid. I won and when ı took the storage everything was understandable. Thank you making easy all these"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T13:42:03.000Z",
          "Titre": "Very simple process",
          "Contenu": "Very simple process, anyone could do. Just win the auction and pick up your stuff. I had no problems or complaints at all using this service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ramon Ramirez",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T13:04:48.000Z",
          "Titre": "Helpfull in all my questions"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tameka webb",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T13:45:48.000Z",
          "Titre": "Everything was safe and easy",
          "Contenu": "Just being online it was so much fun bidding against other and I actually received my items back for 70 bucks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "tosha Scott",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T10:28:08.000Z",
          "Titre": "experience was grate it was so easy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis Montes",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T15:36:55.000Z",
          "Titre": "It's a great site great opportunity to…",
          "Contenu": "It's a great site great opportunity to get great stuff at a great price easy site to get around on"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARK WARRINER",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T15:22:13.000Z",
          "Titre": "Vary helpful",
          "Contenu": "Always answer all my questions an usually resolve any problems I have"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zech Buck",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T12:37:05.000Z",
          "Titre": "I like the ease of the entire…",
          "Contenu": "I like the ease of the entire application But im about sure there's shill bidding going on"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paula Vaught",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T01:21:59.000Z",
          "Titre": "Good service.",
          "Contenu": "Luis straightened out my issue right away even though it was my mistake."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOAN",
          "Nb_Reviews": 3,
          "Date": "2023-11-25T10:24:10.000Z",
          "Titre": "Everything went smoothly      5 star",
          "Contenu": "Everything went smoothly      5 star.     No complication.   Looking forward to next Ct. auction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Besherse",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T15:03:48.000Z",
          "Titre": "It's real I've got what I bought every time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Clements",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T02:52:31.000Z",
          "Titre": "Every things went smooth",
          "Contenu": "Every things went smooth. Will be doing this again."
        }
      ]
    }
  ]
}