{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "storagepartsdirect.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T00:39:00.000Z",
          "Titre": "Canceled my order and upped the price…",
          "Contenu": "Canceled my order and upped the price immediately after"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jerry Reed",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T01:59:39.000Z",
          "Titre": "I did not recieve the item that I…",
          "Contenu": "I am editing my review because in responding to my review I was called a liar, which I am not. Storage Parts Direct advertised DPS-1200SB power supplies on their website.  I ordered 2 of them.  When placing my order the Spare Part No 660185-001 was referenced and I attempted to contact them both by Chat and Email with no answer.  I was later contacted via Email by Storage Parts Direct Sales Team and I asked them to verify that the Spare Part No 660185-001 was in fact the DPS-1200SB.  Their answer was \"Both Numbers belong to exactly the same Power Supply. 660185-001 is the Spare Part number and DPS-1200 SB is the model number\". Thus assured I ordered 2 supplies.  When I received them one was the DPS-1200 SB and the 2nd was a Model number HSTNS-PL30, a similar supply that I cannot use.  When I asked for a replacement with the DPS-1200 or a refund I got a one word response Refused.  I no longer want the correct supply.  I want a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Michael",
          "Nb_Reviews": 3,
          "Date": "2020-06-19T13:20:37.000Z",
          "Titre": "We purchased a drive from Storage Parts twice and got screwed twice.",
          "Contenu": "We purchased a drive from Storage Parts Direct. It Came in DOA. We returned it and have confirmation of the return. We ordered a second one, It too came in DOA. Returned it per Storage Parts Directs instructions. Still waiting for a credit to be issued for both drives. My lead engineer has made more than 10 attempts to get the credit resolved.Simply Storage Parts Direct = They SUCK"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Corsica  Procurement",
          "Nb_Reviews": 1,
          "Date": "2022-02-22T19:22:23.000Z",
          "Titre": "Our order was cancelled without…",
          "Contenu": "Our order was cancelled without notifying us. It was cancelled because you said you couldn't verity the credit card but you had a positive authorization, we called 5  times to speak to someone an could never get anyone. Asked person in chat to have someone call us back twice and left a voicemail the one time we had an option. I appreciate you trying to protect our credit card but if you are going to require speaking with someone to authorize then you need to have someone available to speak with."
        },
        {
          "Note": 1,
          "Lieu": "GN",
          "Pseudo": "jmg system",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T21:27:08.000Z",
          "Titre": "they sell me 8 hdd for 3par all faulty",
          "Contenu": "they sell me 8 hdd for 3par all faulty, i ask for change and they say not possible, they say warranty 3 years but not true, be carefull when ordering with them. just lost 3400 usd on this and customer is very angry."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tyler Jones",
          "Nb_Reviews": 1,
          "Date": "2022-02-20T22:14:02.000Z",
          "Titre": "Bait and switch at its finest",
          "Contenu": "Item was listed on Facebook for sale, but was canceled after order was placed. I was directed to the website where they had the item marked up several times the advertised price. Textbook bait and switch. I got my money back but I’ll never order from here again."
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "Paul Voller",
          "Nb_Reviews": 3,
          "Date": "2022-08-02T04:13:39.000Z",
          "Titre": "You failed because you cancelled my…",
          "Contenu": "You failed because you cancelled my order as my credit card is not based in the US. I buy items all the time from other US based companies with the same card, you are the only company that does not accept it."
        },
        {
          "Note": 1,
          "Lieu": "RS",
          "Pseudo": "Milan Vukičević",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T12:40:07.000Z",
          "Titre": "3 days after payment and still no info",
          "Contenu": "3 days after payment, no info about sending.No email answer, only chat that they will send.!Totally dont know what will be the final experience.will see....First order they canceled and inform me to pay over paypal, i done this and after no info.!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 2,
          "Date": "2021-07-22T14:25:59.000Z",
          "Titre": "Hasn't shipped after telling me it would",
          "Contenu": "The purchase process was easy and had a great price. Said there was over 190 instock for this item and would ship same day. Purchased 2 hours before the 5pm EST cutoff and the item didn't ship.Next day, chatted through the website to just see when it would ship and was told it was going to ship that day. Two days later, item still hasn't shipped.Called twice (left 1 voicemail), tried to chat twice and sent a message through the platform, still no response.Looks to be no way to cancel the order through the portal. If you need something that has to ship the same day, I would probably look at another website as there is no guarantee they will ship as they say."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JVB",
          "Nb_Reviews": 2,
          "Date": "2022-04-19T17:02:50.787Z",
          "Titre": "Unreliable",
          "Contenu": "Part showed in stock when I ordered. Delay in communication. They called after 24 hours to verify order. That delay caused parts to be out of stock by time they got around to processing. Was no need to verify. They had a valid order, with a valid email and a valid credit card. If they'd processed promptly, I'd have received the parts."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-02-05T23:16:17.000Z",
          "Titre": "Order Priority overnight on Jan 29th…",
          "Contenu": "Order Priority overnight on Jan 29th and still have not received the part nor any response for a demand for refund of shipping cost."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Melissa McLane",
          "Nb_Reviews": 1,
          "Date": "2021-08-04T22:39:59.000Z",
          "Titre": "Item was in stock at time of order",
          "Contenu": "Item was in stock at time of order, four hours later our order was canceled without any contact or prior notice!"
        },
        {
          "Note": 1,
          "Lieu": "PE",
          "Pseudo": "RAMIRO FLORES",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T18:18:23.000Z",
          "Titre": "They sent me another product",
          "Contenu": "They sent me another product, even though I asked about the authenticity of the product. Lima Peru"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Warranty Disappointment",
          "Nb_Reviews": 1,
          "Date": "2022-01-10T20:06:33.000Z",
          "Titre": "They do not stand behind the warranty stated on the product page.",
          "Contenu": "They do not stand behind the warranty stated on the website.  I purchased 4 drives on 07/15/2019.  The website (storagepartsdirect.c o m/hpe-791034-b21-1-8tb-10krpm-2-5in-sas-12g-sc-enterprise-g8-g9-g10-hdd) for the item clearly states three times there is 3 year warranty.  There are no disclaimers or conditions.  From their product description on the website:SKU:791034-B21UPC:00888793661833MPN:791034-B21CONDITION:Brand New in Factory Sealed BoxWARRANTY:3 Years WarrantyHPE 791034-B21 1.8TB 10000RPM 2.5inch Small Form Factor 512e Dual Port SAS-12Gbps Smart Carrier Hot-Swap Enterprise Hard Drive for ProLiant Gen8 Gen9 Gen10 Servers (3 Years Warranty)The HPE 791034-B21 Enterprise Hard Drive has a 2.5 inch form factor and a 12 Gbps external data transfer rate. It has a spindle speed up to 10000 RPM and a 1.8 TB capacity. This Small Form Factor Dual Port Hard Drive uses a SAS-12Gbps (serial attached SCSI) interface and comes with 3 Years Warranty.I had a drive fail and it has taken me a few weeks of me constantly following up to have them refuse to honor their stated warranty.  Their response is: We clearly wrote that these drives come with the 3 Years HPE Warranty. And for replacement or return our RMA Period is valid for 30 Days. That is clearly written in our Return Policy at h t t ps://www.storagepartsdirect.c o m/return-policy/.  This is not on the product page anywhere.  If it is true, they sold me a drive that sat for more than a year.It is terribly disappointing to have this happen.  The 3 year warranty was one of the selling points for my purchase."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rajiv Mehta",
          "Nb_Reviews": 1,
          "Date": "2022-04-04T16:46:24.000Z",
          "Titre": "I signed up for next day overnight air…",
          "Contenu": "I signed up for next day overnight air and received the parts 5 days via ground. Never suing this company again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephen Zink",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T16:55:55.000Z",
          "Titre": "Wrong Part Sent",
          "Contenu": "Ordered : EH000600JWCPLGot : EH0600JDYTLWrong part - different carrier"
        },
        {
          "Note": 1,
          "Lieu": "GI",
          "Pseudo": "Mahesh Basantani",
          "Nb_Reviews": 2,
          "Date": "2022-04-20T21:44:09.825Z",
          "Titre": "Order placed all paid and was cancelled",
          "Contenu": "Order placed all paid and was. Cancelled. They have a very good website all perfect but alas!"
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T05:40:58.000Z",
          "Titre": "Slow shipping, no respond",
          "Contenu": "Slow shipping, no answer on mails and contact forms."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wayne Ho",
          "Nb_Reviews": 1,
          "Date": "2019-11-06T19:19:11.000Z",
          "Titre": "Did not update in-stock information",
          "Contenu": "Did not update in-stock information. Only canceling my order after placing the online order."
        },
        {
          "Note": 1,
          "Lieu": "GT",
          "Pseudo": "William  Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T01:50:41.000Z",
          "Titre": "I made a purchase I registered I placed…",
          "Contenu": "I made a purchase I registered I placed my order I made my payment, he charged my card, then he canceled my order because I was not a national or with an American address and I asked that they ship it to an address in Miami, then he said that they would return my money in 2 or 4 business days and more than 8 days have passed and they did not return my money to the card and they urged me to buy the discs, so I had to buy it elsewhere and by the way they have not returned my money at this time money, what do I have to do to get it back or give me the discs that I had bought when they debited me, is it possible???"
        },
        {
          "Note": 1,
          "Lieu": "MT",
          "Pseudo": "Patrick Agius",
          "Nb_Reviews": 2,
          "Date": "2023-04-11T07:01:15.000Z",
          "Titre": "Part did not arrive."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Nielson",
          "Nb_Reviews": 1,
          "Date": "2018-06-12T16:58:41.000Z",
          "Titre": "Slow as snails",
          "Contenu": "I ordered two power supplies for my server. Great prices but it took three weeks to get them."
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "Chen Chuan Goh",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T02:03:02.000Z",
          "Titre": "Item not delivered"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Rachlin",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T19:37:07.000Z",
          "Titre": "Did not receive overnight",
          "Contenu": "Did not receive overnight. I paid for overnight delivery."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "IT Professional",
          "Nb_Reviews": 1,
          "Date": "2018-07-24T18:04:56.000Z",
          "Titre": "Wasted time.  Not buying anything ever again from them.",
          "Contenu": "First order had a defective part. Fortunately our servers have warranty, so we could exchange.Second order had a wrong part.No replies from customer service after RMA was requested. Replied only after I complained in chat.  E-mail rejected by mail firewall, because SPF record is not configured correctly.Worst experience in a long while."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Winters",
          "Nb_Reviews": 1,
          "Date": "2018-07-29T21:02:58.000Z",
          "Titre": "Very disappointing customer service",
          "Contenu": "Very disappointing customer service.  3 out of 4 drives I received did not work and it took three emails just to start the process of returning them.  Two weeks after the returned drives were received by Storage Parts Direct I still had not heard anything regarding a return or refund and when I contacted them they had no idea what I was trying to do.  Apparently my order was mistaken for another where too many drives were shipped to another customer??  All I know is that bad drives happen all the time but trying to get a refund or replacement should not be so difficult.  I was (and still am) looking for a reliable source for these hard drives as I manage hundreds of RAID arrays and disappointingly enough this is just not the company to do that business with."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Diana Shook",
          "Nb_Reviews": 1,
          "Date": "2018-07-17T12:09:21.000Z",
          "Titre": "So far not pleased",
          "Contenu": "Our first order never left your facility until we asked where it was.The wrong product shipping on our 2nd order I have asked for a return number but so far have not gotten a reply."
        },
        {
          "Note": 2,
          "Lieu": "EG",
          "Pseudo": "RG Solutions",
          "Nb_Reviews": 1,
          "Date": "2021-04-20T14:23:08.000Z",
          "Titre": "Not good customer service"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cap Short",
          "Nb_Reviews": 1,
          "Date": "2019-01-03T18:55:28.000Z",
          "Titre": "Item listed as new, but used",
          "Contenu": "Item listed as new, but, at least, notified it was used before purchase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patrick Fetherston",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T16:39:19.000Z",
          "Titre": "I still don't have my order",
          "Contenu": "I still don't have my order.  When I track it Fedex says it is on the truck for delivery.  It said that Friday and Monday and it is Tuesday and I still don't have it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jose Escobar",
          "Nb_Reviews": 2,
          "Date": "2023-07-28T07:12:46.000Z",
          "Titre": "Questioning customer",
          "Contenu": "I sent an email to this person:Mike Anderson, Sales ManagerBecause I like to place other order but I request some information before. I sent this email provably one week ago and still waiting for the answer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2019-11-22T21:52:01.000Z",
          "Titre": "The physical drive was correct however…",
          "Contenu": "The physical drive was correct however the drive housing that makes the drive hotswappable was the incorrect \"housing\" (slide in components). The picture for the drive, on the web site, showed the correct housing however what was received was different. We were able to take the old drive's housing and put the new drive in it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike D.",
          "Nb_Reviews": 1,
          "Date": "2021-02-22T13:04:26.000Z",
          "Titre": "Product was as described and shipping…",
          "Contenu": "Product was as described and shipping was prompt. I contacted them, via chat, to see if I could return an unopened item. I explained that I wanted to buy a more expensive version. The agent was a little upset with me for wanting to return the item. In the end, I was able to return the product for a 90% refund."
        },
        {
          "Note": 3,
          "Lieu": "HT",
          "Pseudo": "AIC",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T20:52:39.000Z",
          "Titre": "Too much time than expected."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Potential Loyal customer",
          "Nb_Reviews": 3,
          "Date": "2019-01-04T14:34:18.000Z",
          "Titre": "Solid experience with room for improvement",
          "Contenu": "I was thrilled to find the parts I needed for such a good price. I was disappointed when I received and email stating my money was refunded with no communication as to why. The Chat person was forthcoming with information, but I don't feel I should have to search for an answer in this case as to why I could not receive the items I purchased. Better inventory control and communication will improve this experience. Will give them a try again in the future."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JA",
          "Nb_Reviews": 1,
          "Date": "2019-04-09T16:04:39.000Z",
          "Titre": "Unsure about future purchases with this company.",
          "Contenu": "The jury is still out on storagepartsdirect.com. I purchased 2 HPE-branded drives that were supposed to be \"Brand New Factory Sealed.\" The drives were delivered and work but are not able to be registered with HPE. During warranty check no information is available. Trying to link warranties there was an error: \"This entitlement is inactive and cannot be linked.\" I contacted the seller and they indicated that they'll replace the drives if it becomes necessary. I've purchased drives from other vendors and had no issues registering them; your mileage may vary but personally, I don't plan to buy from this seller again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric Murach",
          "Nb_Reviews": 1,
          "Date": "2019-04-01T20:26:24.000Z",
          "Titre": "My simple order was not so simple",
          "Contenu": "A specific HP Part number memory was ordered. HP 774172-001.  A certified replacement memory for the server to match the other memory in the server which was (Hynix).  What was received did not have the HP PN 774172-001 on it.  But it did PN# 752369-081 which on my original memory.  However the maker was (Samsung) not (Hynix).  This did seem right at all.  I was force to track it down.  Called HPE.  They confirmed they did in fact use multiple vendors under assembly PN# HP 752369-081.The original goal was have same memory.  That reason for a any replacement number.  That's not what getting,  HP's mistake here. HPE says it 100% all works together but it's not what expected at all.  Nor what I wanted.  DIfferent makers working together is bad receipt.  In one sense you say the order was filled.  In another the goal was not met because it doesn't all match.  With a long Memtest86+ round testing to indicate to me if it all works or not.  It's running.  I'll see in 3 days from now.  If there going to multiple vendors for assy# then there should a multiple check boxes to state who the vendor was.  If it passes all the testing i'll change this to four stars.   I think in the future companies are just going have send blown up actual pictures of the memory before its purchase.  It's going to be only way to avoid this issue."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gary Miller",
          "Nb_Reviews": 1,
          "Date": "2020-12-15T14:13:59.000Z",
          "Titre": "StoragePartsDirect",
          "Contenu": "Review Deleted"
        },
        {
          "Note": 4,
          "Lieu": "MT",
          "Pseudo": "Ian",
          "Nb_Reviews": 4,
          "Date": "2022-11-24T07:04:49.000Z",
          "Titre": "Great products and fast reliable…",
          "Contenu": "Great products and fast reliable response. Highly recommendable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason S.",
          "Nb_Reviews": 1,
          "Date": "2021-05-13T13:36:28.000Z",
          "Titre": "Initial order placed took several days…",
          "Contenu": "Initial order placed took several days to ship and was explained that I needed to be verified a customer with a valid credit card and I need to be called and spoken to. I am a wholesale distributor, and when we take credit cards and verify zip code, cc#, and CID, we are not at risk of loss from our processor. I suggest you look into that and not put the burden on a new customer that may need something right away, like hard drives, as I did. After the initial order, my next orders were process and shipped very quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew Fricke",
          "Nb_Reviews": 1,
          "Date": "2020-08-18T14:12:33.000Z",
          "Titre": "Great prices but in-stock may not be accurate.",
          "Contenu": "I received an email after placing an order (Order # 4213) that my order was cancelled, even though the website clearly stated the harder-to-find items in question were in stock.  The stock system should be accurate and not misleading, as it can cause project delays.  At least the updates were timely and did not leave me hanging out there long.  We did have a larger unrelated order that went smoothly and were happy with how fast the drives came in.  Great prices there."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "S.Novak",
          "Nb_Reviews": 1,
          "Date": "2021-03-08T20:59:52.000Z",
          "Titre": "Shipped same day, got part over night, was the correct part",
          "Contenu": "Shipped same day, got part over night, was the correct part, decent prices.  Website needs help and annoying it doesn't support Google Pay, however."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven Bonici",
          "Nb_Reviews": 2,
          "Date": "2022-07-14T19:29:01.000Z",
          "Titre": "Everything was fine except for FedEx",
          "Contenu": "Everything was fine except for FedEx.  Delivery was not made on time.  FedEx has been a problem for many deliveries."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Leo Visser",
          "Nb_Reviews": 4,
          "Date": "2020-02-20T11:21:50.000Z",
          "Titre": "Due to not supplying correct country of…",
          "Contenu": "Due to not supplying correct country of origin, package was held up for 3 weeks at customs. Product is good though. Thanks guys."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marc Matthes",
          "Nb_Reviews": 1,
          "Date": "2020-07-06T13:17:59.000Z",
          "Titre": "great job",
          "Contenu": "great job on the order thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Bojorquez",
          "Nb_Reviews": 2,
          "Date": "2018-12-04T18:14:47.000Z",
          "Titre": "Price was very competitive",
          "Contenu": "Price was very competitive.  Easy website to navigate.  Would definitely recommend."
        },
        {
          "Note": 4,
          "Lieu": "VN",
          "Pseudo": "Khoa Pham Van",
          "Nb_Reviews": 1,
          "Date": "2021-12-29T16:20:33.000Z",
          "Titre": "good seller",
          "Contenu": "good product"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Happy Customer",
          "Nb_Reviews": 1,
          "Date": "2019-06-11T15:57:56.000Z",
          "Titre": "Products worked as described"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Agnieszka",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T13:21:23.000Z",
          "Titre": "Great Supplier!",
          "Contenu": "Good price, fast delivery, but shipping cost to Europe is very very high."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dillon Brown",
          "Nb_Reviews": 2,
          "Date": "2020-02-23T20:13:25.000Z",
          "Titre": "This website is legit!",
          "Contenu": "This website is legit.  Originally I'd been a bit skeptical about my order since I'd never heard of this website before and the price on the product I ordered was WAY lower than other retailers.  But the LTO drive I ordered came super quickly, packaged perfectly, and works fantastic.  Emails I sent were replied to promptly as well.  Highly recommended retailer and will definitely order from again in the future if I need any additional LTO / server parts.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J L",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T17:31:40.000Z",
          "Titre": "Great Source for Replacement Hard Drives",
          "Contenu": "I've ordered a few replacement hard drives from your company recently and they have all been quick to arrive and have worked great. I accidentally ordered the wrong part, but was able to swap out the drive caddy and get it working. I spoke with Mike through the chat and he answered all of my questions and was able to give me a link to the correct part so that I don't make the same mistake in the future. He also offered to help via the chat before my next order. The quick and helpful chat response was fantastic and I'll be sure to order future hard drive replacements through Storage Parts Direct."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Michael Hum",
          "Nb_Reviews": 3,
          "Date": "2021-09-14T15:12:59.000Z",
          "Titre": "I ordered online a replacement raid…",
          "Contenu": "I ordered online a replacement raid controller battery from a gen 9 HP server.  The battery shipped was exactly as advertised.  It arrived within 3 business days  of placing the order (i live in Markham Ontario Canada).  Very fast shipping.  Overall, I am very satisfied with the online ordering experience.  Will order again from Storage Parts Direct."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim - Systems Manager",
          "Nb_Reviews": 1,
          "Date": "2020-06-08T13:53:35.000Z",
          "Titre": "All worked as it should",
          "Contenu": "All worked as it should, You had the lowest price for HPE certified and warranted hard drives for a HPE DL360 G9. As with all aging HPE products, finding replacement or expansion hard drives is difficult and refurbished will not suffice in our organization. Thank you for stocking them, and your low prices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob The Geek",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T21:52:28.000Z",
          "Titre": "After CDWG HP Consultants screwed me",
          "Contenu": "After CDWG HP Consultants screwed me, I needed  a Raid 2 controller.  Storage Parts Direct saved me. They had it part in stock (which saved money) and they ship it free, and I used my credit card for free (I only pass on actual cost).  I had mentioned the cable to attach to the cage and he thought it was included, it wasn't.  I told him about it, and he and I researched really hard.  And we found the right cable.  Because he thought it should have been included, he didn't charge me for it.  I got the best for my customer; I am extremely happy with the prices and the service.  I would really thank Tim for his suggestions and his work to make everything work.  When I need storage solutions, they are I'm going to go first."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacques",
          "Nb_Reviews": 3,
          "Date": "2019-07-11T00:20:59.000Z",
          "Titre": "Very knowledgeable online \"MIKE\" guided…",
          "Contenu": "Very knowledgeable online \"MIKE\" guided me thru CHAT for this purchase.Order number: 1684Purchase date: 07/03/2019HPE 830824-B21 Smart Array P408i-p SR SAS-12G PCIe Controller for G10 × 1$365.00It was a pleasant experience. Will do more business with your company in the future.Good luck GuysJacquesPS: A little earliertonight, I send a RMA Request for :Order number: 1685Purchase date: 07/03/2019HPE 878645-001 28 AWG 3-Pin PCI to Controller Standard Power Cable × 1$100.00 Because I did not need it.  I originally was not sure of the type of connector on the PCI Card purchased.  But I had a cable for it.  Thanks for considering"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim C",
          "Nb_Reviews": 1,
          "Date": "2020-03-03T23:54:53.000Z",
          "Titre": "StoragePartsDirect.com has a great…",
          "Contenu": "StoragePartsDirect.com has a great customer service due to any issue.  We shipped something back without notify their RMA dept but their RMA dept is very nice to waive the restocking fee.  Thank you very much Adam!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt Bradberry",
          "Nb_Reviews": 1,
          "Date": "2021-06-21T19:19:26.000Z",
          "Titre": "We paid for overnight shipping and it…",
          "Contenu": "We paid for overnight shipping and it took 2 days. Also had to remove the drive from the housing to make it fit, which was a hassle because it's only supposed to be done in a dust-free environment. Product itself is working fine so far after <2 weeks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy Morgan",
          "Nb_Reviews": 1,
          "Date": "2020-03-19T15:35:41.000Z",
          "Titre": "Best customer service I have experienced in a long time.",
          "Contenu": "I appreciated how they addressed my concerns regarding the products I was needing.  They took extra care to provide the correct date code.  They didn't charge extra for the personalized service.  I received my product on-time & correct.Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-07T08:50:38.000Z",
          "Titre": "You had original disks for a Dell R540…",
          "Contenu": "You had original disks for a Dell R540 where Dell support itself could not provide them, and you shipped fast. High shipping cost to Europe is the only disadvantage."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie F.",
          "Nb_Reviews": 1,
          "Date": "2021-09-15T18:26:26.000Z",
          "Titre": "Flawless experience",
          "Contenu": "Flawless experience! Order was put in and shipped to us quickly and order was correct.  They even called to let me know that they received the order and just wanted to confirm it.  Order was shipped out a few hours later.  I will def be using StoragePartsDirect again for future needs!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Geoff R",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T17:40:00.000Z",
          "Titre": "Searching was very easy",
          "Contenu": "Searching was very easy thanks to SEO, was able to quickly order my part and delivery actually ahead of schedule.Part arrived clean and packaged well, very happy with the experience."
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "Павел Семенов",
          "Nb_Reviews": 1,
          "Date": "2020-01-10T00:04:53.000Z",
          "Titre": "This is a very good seller. Top recommendations! A++++++++",
          "Contenu": "I have bought items many times at storagepartsdirect.com.  These are great guys.  The goods are excellent quality, well packaged, shipped quickly.  Quickly answer if you have questions.  I highly recommend this seller.  A ++++++++"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken Abboud",
          "Nb_Reviews": 1,
          "Date": "2021-02-15T17:20:01.000Z",
          "Titre": "I was in a pinch and needed to order…",
          "Contenu": "I was in a pinch and needed to order some high end HPE SSD drives for a big server project for a client.  I found Storage Parts Direct online.  I reached out via chat to their expert Mike and discussed the drives, their availability, and quantities.  We needed 18 of them for this project.  Mike said they had them in stock and would ship on the same day if I put the order in.  He also secured an additional discount on the drives.  The drives arrived in a few days and we were off to the races.  This was a seamless transaction and we saved some money.  We will be definitely be reaching out to them again soon when we are ready for some more drives."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raqueal Ramdatt",
          "Nb_Reviews": 1,
          "Date": "2021-07-30T13:05:44.000Z",
          "Titre": "Excellent Customer Service.",
          "Contenu": "We had a catastrophic hard drive failure on our server were we lost multiple drive and could not recover the system. The only place that had the drive we needed was Storage Parts Direct. The drives were brand new and were compatible with our servers.  We ordered 4 new drives and began the process of rebuilding the server when 2 additional older drives failed. We needed to order additional drives but the store was closed as it was 11PM at night.  I decided to call anyways in hopes someone would answer but know one did. A minute later Mike the sales manager called backed stating that he recognized my number and knew that we had issues early that day and wanted to help in any way he can so he offered for us to come  pick up the additional hard drives we needed.   We got the additional drives at 11:45PM. I just wanted to thank Mike for providing excellent customer service in a dire situation.Thanks Mike"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay B",
          "Nb_Reviews": 1,
          "Date": "2021-02-15T21:45:53.000Z",
          "Titre": "Very professional",
          "Contenu": "Very professional. Nicely packaged. Received in just a couple days after ordering. Would definitely purchase from Storage Parts Direct again. Thank you -"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlos Castillo Diaz",
          "Nb_Reviews": 1,
          "Date": "2021-03-22T18:03:51.000Z",
          "Titre": "EXCEPTIONAL Service",
          "Contenu": "EXCEPTIONAL service, easy to work in your website, live support by Chat, to use your service was very easy even when I ship to my client address in France. CONGRATULATION you are an example of efficience, thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emil P",
          "Nb_Reviews": 1,
          "Date": "2020-06-18T11:46:07.000Z",
          "Titre": "SAS drives for HP DL380",
          "Contenu": "Needed SAS drives for HP DL380. Everyone was out of stock for the size we needed. Storage Parts Direct had them. Ordered in the morning on a Friday they shipped that day and we had them Monday morning.What a life saver!We were concerned about the \"Refurbished\" label. What we got were where factory sealed drives. I would never be concerned again when purchasing form Storage Parts Direct.Great Company!Emil P"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Piero",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T18:23:58.000Z",
          "Titre": "Quick, accurate and helpful",
          "Contenu": "Drives I ordered arrived promptly, they were as described and in good working order.  The person I spoke with was knowledgeable and guided me to the correct drives."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michiganrottmom",
          "Nb_Reviews": 2,
          "Date": "2019-12-27T18:04:06.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service.  Called because we had a hard time finding the hard drives for our server in stock any where else & wanted to make sure they truly had them all in stock.  Sure enough they did!  Even with standard shipping we had them in 2 days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Felix Vigo",
          "Nb_Reviews": 1,
          "Date": "2021-07-22T19:47:55.000Z",
          "Titre": "Flawless Order Process",
          "Contenu": "No issues with the order and call verification as we were able to get our delivery on first business day. This is our second purchase and with each order it's been an excellent experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sherry Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T23:24:05.000Z",
          "Titre": "I accidentally ordered two items alike",
          "Contenu": "I accidentally ordered two items alike.  One call and they fixed it happily.  Great Service and the part was exactly as expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Long",
          "Nb_Reviews": 3,
          "Date": "2021-12-09T19:12:00.000Z",
          "Titre": "Right part, right price, right on time.",
          "Contenu": "Made the mistake of ordering the wrong replacement, was able to return without any hassle really, ordered the correct one and was in my hands in no time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mitch",
          "Nb_Reviews": 2,
          "Date": "2019-09-19T11:12:48.000Z",
          "Titre": "My first time ordering from Storage…",
          "Contenu": "My first time ordering from Storage Parts Direct.  The website was user friendly, easy checkout and my order was delivered exactly when I asked for it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WW",
          "Nb_Reviews": 1,
          "Date": "2020-12-08T14:10:38.000Z",
          "Titre": "replacement hard drives right away...",
          "Contenu": "I needed replacement hard drives for our servers and Storage Parts Direct had the ones I needed in stock and at a great price.  I ordered the drives and they were delivered on time.  It is great to have a place to order what you need and have it delivered in a timely fashion.  Thanks Storage Parts Direct!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greensboro",
          "Nb_Reviews": 3,
          "Date": "2020-07-13T13:27:25.000Z",
          "Titre": "Delivered promptly",
          "Contenu": "Delivered promptly; the items matched the specs. The diligence of the sales team to confirm that the hard-drives would match the server is much appreciated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2021-09-17T18:17:58.000Z",
          "Titre": "Shipped promptly",
          "Contenu": "Shipped promptly.  Product as described.Unfortunate required step.  They need to validate you by phone for the credit card."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike H",
          "Nb_Reviews": 3,
          "Date": "2019-10-23T17:28:59.000Z",
          "Titre": "I got my parts easily",
          "Contenu": "I was able to get online and find what I needed easily (and in stock), and get it shipped to my location promptly at a good price. Thanks for being there, Storage Parts Direct. We will do business again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Miller",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T22:03:04.000Z",
          "Titre": "Buying was easy",
          "Contenu": "Buying was easy, shipping was fast (after the called to verify the order first, which was a bit different), the new HD are installed and working - I haven't had them installed long enough to have much more feedback."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Kaiser",
          "Nb_Reviews": 1,
          "Date": "2019-09-23T21:24:40.000Z",
          "Titre": "Great seller",
          "Contenu": "Great seller, fast response., delivered overnight when normal vendor could not on specific HP server parts."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Bernardo Reyes",
          "Nb_Reviews": 1,
          "Date": "2020-05-18T18:00:10.000Z",
          "Titre": "Post-sale",
          "Contenu": "The shipping speed and the product were excellent. The atention post-sale could be better, I asked for some information to acelerate the import process in to Mexico and did no get any answer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scot Susmann",
          "Nb_Reviews": 1,
          "Date": "2020-05-14T19:00:00.000Z",
          "Titre": "I had recently purchased the same part…",
          "Contenu": "I had recently purchased the same part from Server Supply it came in doa. I ordered from Storage Parts and the part came in working and arrived faster."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "New Customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-22T16:29:27.000Z",
          "Titre": "Storage Parts Direct is a great online store",
          "Contenu": "Storage Parts Direct had what I needed at a great price, and I had it in my hand the next day.  Customer service at Storage Parts Direct is first class all the way!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Ingram",
          "Nb_Reviews": 1,
          "Date": "2020-04-16T15:51:18.000Z",
          "Titre": "HPE 2 TB Enterprise drives",
          "Contenu": "Purchasing was simple. A standard cart check out. Communications about processing and delivery were prompt. The delivery was fast. Packaging was your standard anti-static bag. Installation and detection of the drive was successful. Overall a 5 out 5 experience with Storage Parts Direct."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marco Alcala",
          "Nb_Reviews": 3,
          "Date": "2022-09-09T21:04:20.000Z",
          "Titre": "Storage Parts Direct is a dependable…",
          "Contenu": "Storage Parts Direct is a dependable storage hardware partner.  I have been using them for years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "m shea",
          "Nb_Reviews": 1,
          "Date": "2019-11-04T15:21:11.000Z",
          "Titre": "Great job on getting the parts…",
          "Contenu": "Great job on getting the parts delivered! Will definitely use the site again.  Mike A. quickly resolved all issues."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Asif Khan",
          "Nb_Reviews": 3,
          "Date": "2021-01-07T23:39:31.000Z",
          "Titre": "goto site for any option parts for HPE",
          "Contenu": "goto site for any option parts for HPE. Mike is the man you need to go for, amazing service, quick turnaround and fast shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Schneider",
          "Nb_Reviews": 1,
          "Date": "2020-12-02T20:19:06.000Z",
          "Titre": "To the rescue",
          "Contenu": "Not did they have what I needed in inventory, they were able to get it to me extremely quickly. Definitely would use them again."
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "Ragnar Tabet",
          "Nb_Reviews": 1,
          "Date": "2020-11-02T17:37:33.000Z",
          "Titre": "Great parts selection and service.",
          "Contenu": "Ram arrived on time. Excellent packing. Every step of the transaction was smooth. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Welp",
          "Nb_Reviews": 1,
          "Date": "2019-11-05T20:32:21.000Z",
          "Titre": "Very prompt delivery",
          "Contenu": "Very prompt deliveryDrive came in factory sealed box faster than expected"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Johnson",
          "Nb_Reviews": 1,
          "Date": "2021-11-01T17:33:35.000Z",
          "Titre": "Thanks for your assistance to get me…",
          "Contenu": "Thanks for your assistance to get me the right drive and help with the 2 returns that  I had to complete"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phillip J Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T20:59:42.000Z",
          "Titre": "All parts were selected via the website…",
          "Contenu": "All parts were selected via the website and were comparable with our equipment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Bauer",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T04:58:51.000Z",
          "Titre": "Great to work with",
          "Contenu": "Great to work with.  Always what you expect when purchasing storage parts!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Willis  Marlin",
          "Nb_Reviews": 1,
          "Date": "2020-01-10T22:58:01.000Z",
          "Titre": "Super helpful group was able to deliver…",
          "Contenu": "Super helpful group was able to deliver overnight. Thank you for everything. Willis"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SamuelChiodo",
          "Nb_Reviews": 6,
          "Date": "2021-05-22T20:26:06.000Z",
          "Titre": "Excellent replacement Drive",
          "Contenu": "Excellent replacement Drive. I am grateful to Tim of StoragePartsDirect who made it possible.The successful results in resolving the issue of receiving the wrong item of the first shipment are fully attributable to the contact, help and assistance of Tim to whom I am greatly appreciative, thankful and grateful.  Tim made this happen successfully and is deserving of the highest recognition and commendations.  Tim is professional, gracious, thoughtful, considerate, understanding and accommodating.  I would use StoragePartsDirect again without hesitation, accordingly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SamuelChiodo",
          "Nb_Reviews": 6,
          "Date": "2021-05-14T14:18:24.000Z",
          "Titre": "Excellent replacement Drive and Exceptional Service",
          "Contenu": "Excellent replacement Drive. I am grateful to Tim of StoragePartsDirect who made it possible.The successful results in resolving the issue of receiving the wrong item of the first shipment are fully attributable to the contact, help and assistance of Tim to whom I am greatly appreciative, thankful and grateful.  Tim made this happen successfully and is deserving of the highest recognition and commendations.  Tim is professional, gracious, thoughtful, considerate, understanding and accommodating.  I would use StoragePartsDirect again without hesitation, accordingly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Thomas",
          "Nb_Reviews": 1,
          "Date": "2019-08-21T11:37:52.000Z",
          "Titre": "We needed a battery immediately and SPD…",
          "Contenu": "We needed a battery immediately and SPD came through.  We had it within two (2) days!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AJR",
          "Nb_Reviews": 1,
          "Date": "2020-09-08T14:33:37.000Z",
          "Titre": "A+++  Excellent Customer Service!",
          "Contenu": "A+++  Would certain use again.  There was a challenge with the order and they responded admirably.  Excellent customer service!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Charpentier",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T19:26:50.000Z",
          "Titre": "I like that you confirmed the purchase…",
          "Contenu": "I like that you confirmed the purchase by calling me and good speed and quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean Herman",
          "Nb_Reviews": 1,
          "Date": "2019-09-09T17:38:27.000Z",
          "Titre": "Fast (faster than expected given the…",
          "Contenu": "Fast (faster than expected given the shipping method), easy, parts as described."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerry Esh",
          "Nb_Reviews": 2,
          "Date": "2022-04-13T17:00:21.000Z",
          "Titre": "Found some hard to find parts at…",
          "Contenu": "Found some hard to find parts at Storage Parts Direct. They shipped quickly and I was able to finish my project."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fran Jacques",
          "Nb_Reviews": 2,
          "Date": "2022-02-15T13:09:27.000Z",
          "Titre": "Product was as expected and advertised",
          "Contenu": "Product was as expected and advertised. Service was prompt and product was received quicker than expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bernat, Michael",
          "Nb_Reviews": 2,
          "Date": "2019-11-08T20:51:19.000Z",
          "Titre": "Made a few purchases from Storage Parts…",
          "Contenu": "Made a few purchases from Storage Parts Direct and extremely happy!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Adofo",
          "Nb_Reviews": 1,
          "Date": "2021-04-29T16:00:25.000Z",
          "Titre": "Follow up",
          "Contenu": "Though am giving you a good rating. The postal service needs to be sorted up. This delays are not good for my business.Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2019-07-10T11:28:48.000Z",
          "Titre": "My HDDs came in quickly and was just…",
          "Contenu": "My HDDs came in quickly and was just what I needed. My server is back at 100%. Thanks storagepartsdirect.com."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B. Alvarez",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T22:07:43.000Z",
          "Titre": "Incredible prices and great customer…",
          "Contenu": "Incredible prices and great customer service."
        },
        {
          "Note": 5,
          "Lieu": "SV",
          "Pseudo": "JUAN JUAREZ",
          "Nb_Reviews": 1,
          "Date": "2022-03-10T00:16:15.000Z",
          "Titre": "EXCELLENT  DEALER",
          "Contenu": "disk installed without problem. it works perfect. excellent buy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Rader",
          "Nb_Reviews": 1,
          "Date": "2019-07-23T21:34:39.000Z",
          "Titre": "low price",
          "Contenu": "Great transaction. Low price, fast shipping. Thanks for making this easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amarillo",
          "Nb_Reviews": 4,
          "Date": "2019-07-22T14:26:40.000Z",
          "Titre": "very easy to order online and order…",
          "Contenu": "very easy to order online and order arrived earlier than expected. Thank You"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darlene Leas",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T06:38:45.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. They mean it when they say orders in by 5:00 shipped same day. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Willis",
          "Nb_Reviews": 1,
          "Date": "2019-09-03T16:22:26.000Z",
          "Titre": "Great selection and great prices",
          "Contenu": "Great selection and great prices coupled with prompt delivery. They are my new goto source."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt R.",
          "Nb_Reviews": 1,
          "Date": "2019-07-02T23:14:35.000Z",
          "Titre": "Great price and fast shipment",
          "Contenu": "Great price and fast shipment. Would definitely purchase from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aiman Arafat",
          "Nb_Reviews": 2,
          "Date": "2019-11-15T17:13:44.000Z",
          "Titre": "Fast Shipping Excellent price and the…",
          "Contenu": "Fast Shipping Excellent price and the Item received new as decribed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew F",
          "Nb_Reviews": 1,
          "Date": "2021-07-23T02:30:19.000Z",
          "Titre": "Fast shipping. Great products.",
          "Contenu": "Fast shipping. SSDs are exactly what I ordered and perfect as always."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas Pollard",
          "Nb_Reviews": 1,
          "Date": "2020-07-06T13:14:11.000Z",
          "Titre": "Very responsive sales team",
          "Contenu": "Very responsive sales team, quick turnaround on completing the order and delivery of the products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug",
          "Nb_Reviews": 1,
          "Date": "2020-04-23T12:05:22.000Z",
          "Titre": "Awesome",
          "Contenu": "Awesome, ordered from 3 companies and your were the first to arrive"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Thorsten",
          "Nb_Reviews": 2,
          "Date": "2022-12-03T22:27:17.000Z",
          "Titre": "Works fine",
          "Contenu": "You did everything well. Only German Customs failled!Thanks for your Work.Yours Sincerly T. Schlüter"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark H.",
          "Nb_Reviews": 1,
          "Date": "2019-11-20T15:04:50.000Z",
          "Titre": "Storage Parts Direct ships fast and…",
          "Contenu": "Storage Parts Direct ships fast and puts the customer first."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger Lapham",
          "Nb_Reviews": 1,
          "Date": "2019-12-27T23:11:25.000Z",
          "Titre": "You guys fixed a mistake in the order…",
          "Contenu": "You guys fixed a mistake in the order immediately, great job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denis King",
          "Nb_Reviews": 1,
          "Date": "2020-05-06T14:55:03.000Z",
          "Titre": "No surprises",
          "Contenu": "No surprises, the order arrived on time, and in good condition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Turner",
          "Nb_Reviews": 2,
          "Date": "2020-05-08T18:21:20.000Z",
          "Titre": "Always happy doing business with them.",
          "Contenu": "Always happy doing business with them.Fast prompt delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "IT Director",
          "Nb_Reviews": 1,
          "Date": "2020-09-15T16:23:13.000Z",
          "Titre": "Great prices and fast delivery",
          "Contenu": "Great prices and fast delivery. Will definitely use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mathew",
          "Nb_Reviews": 1,
          "Date": "2021-06-04T20:37:08.000Z",
          "Titre": "Parts showed up on time and as…",
          "Contenu": "Parts showed up on time and as described. And included both sized brackets which was nice. Well bubble wrapped as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kurt Moberly",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T19:49:52.000Z",
          "Titre": "Great Service and delivery",
          "Contenu": "Great Service and delivery. It's nice to deal with people who do what they say they'll do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2019-12-27T18:28:17.000Z",
          "Titre": "Perfect",
          "Contenu": "Perfect. Delivery on time. Helped us to expedite things."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lou Garcia",
          "Nb_Reviews": 4,
          "Date": "2020-05-15T21:49:29.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping, very attentive customer service. Will be ordering from them again!"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "brad soulette",
          "Nb_Reviews": 1,
          "Date": "2021-03-09T23:02:39.000Z",
          "Titre": "Great selection",
          "Contenu": "Great selection, great prices , great fast shipping ! 10/10 would recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EDWARD SHMARUK",
          "Nb_Reviews": 1,
          "Date": "2021-02-11T13:47:21.000Z",
          "Titre": "Great Service and a pleasure to deal…",
          "Contenu": "Great Service and a pleasure to deal with. Highly Recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russ Moser",
          "Nb_Reviews": 3,
          "Date": "2019-11-18T01:29:38.000Z",
          "Titre": "Great selection of server drives with…",
          "Contenu": "Great selection of server drives with good prices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Long",
          "Nb_Reviews": 3,
          "Date": "2020-01-14T13:11:51.000Z",
          "Titre": "Quick and painless",
          "Contenu": "Quick and painless, not at all like replacing the drive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Stock",
          "Nb_Reviews": 1,
          "Date": "2022-01-05T20:51:30.000Z",
          "Titre": "Everything was as advertised and was…",
          "Contenu": "Everything was as advertised and was delivered on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Rutter",
          "Nb_Reviews": 1,
          "Date": "2020-10-27T17:54:16.000Z",
          "Titre": "Excellent service....will definitely buy again!!!!",
          "Contenu": "Excellent service....will definitely buy again....Thanks to everyone!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward Torres",
          "Nb_Reviews": 2,
          "Date": "2019-11-20T00:22:28.000Z",
          "Titre": "Great products and great prices along…",
          "Contenu": "Great products and great prices along with great customer services"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Marc",
          "Nb_Reviews": 1,
          "Date": "2022-05-19T14:58:37.000Z",
          "Titre": "Quick and perfect delivery",
          "Contenu": "Quick and perfect delivery, all parts are perfect working"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phil Hartman",
          "Nb_Reviews": 1,
          "Date": "2019-08-19T16:37:44.000Z",
          "Titre": "Fast efficient service",
          "Contenu": "Fast efficient service. Just what we needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chad Hanway",
          "Nb_Reviews": 1,
          "Date": "2019-11-20T17:13:48.000Z",
          "Titre": "Fast shipping and products were as…",
          "Contenu": "Fast shipping and products were as exepected."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Austin Lovvorn",
          "Nb_Reviews": 1,
          "Date": "2022-04-14T17:14:13.000Z",
          "Titre": "Excellent Service",
          "Contenu": "Excellent Service. Will do business with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KELVIN LARRUE",
          "Nb_Reviews": 9,
          "Date": "2023-03-24T16:01:09.000Z",
          "Titre": "Straight forward process",
          "Contenu": "Straight forward process - no hassles."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Manno",
          "Nb_Reviews": 1,
          "Date": "2021-08-12T01:28:50.000Z",
          "Titre": "Received the drives on time and as…",
          "Contenu": "Received the drives on time and as expected"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TY COLEMAN",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T19:55:47.000Z",
          "Titre": "The customer receive items in an timely manner.",
          "Contenu": "Receive items in an timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Fischer",
          "Nb_Reviews": 1,
          "Date": "2019-11-08T16:41:35.000Z",
          "Titre": "Always a great experience.",
          "Contenu": "Shipped and packed well. Everything as advertised. My \"go to\" for server parts."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Russell Sherr",
          "Nb_Reviews": 3,
          "Date": "2020-02-13T10:18:04.000Z",
          "Titre": "Great Service",
          "Contenu": "brilliant - shipped drives to the UK for us very quickly and exactly what we ordered. Will use again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Georghiou",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T18:01:15.000Z",
          "Titre": "The HP Disks received on time as…",
          "Contenu": "The HP Disks received on time as promised!"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "João Marigonda",
          "Nb_Reviews": 2,
          "Date": "2023-06-19T23:39:05.000Z",
          "Titre": "Fast shipping to Brazil",
          "Contenu": "Fast shipping to Brazil! Original products, recomended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carolyn Zauche",
          "Nb_Reviews": 2,
          "Date": "2020-07-15T16:18:54.000Z",
          "Titre": "Great products and service",
          "Contenu": "Great products and service! Quick delivery."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Marc Dierichsweiler",
          "Nb_Reviews": 2,
          "Date": "2022-01-03T14:47:43.000Z",
          "Titre": "Fast and good packaged delivery",
          "Contenu": "Fast and good packaged delivery, everythink like promised!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose Escobar",
          "Nb_Reviews": 2,
          "Date": "2023-09-17T05:38:24.000Z",
          "Titre": "GOOD SERVICE",
          "Contenu": "Second purchase"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Henry Hinojosa",
          "Nb_Reviews": 1,
          "Date": "2021-08-23T18:46:49.000Z",
          "Titre": "Reliable Stock and Easy to Re-Order",
          "Contenu": "Reliable Stock and Easy to Re-Order. Quick And Easy!"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Dilyan Aynadzhiev",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T04:56:21.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, I got the drives within 3 days.Thank you guys."
        }
      ]
    }
  ]
}