{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "strobesnmore.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T00:52:27.000Z",
          "Titre": "They said never received order even…",
          "Contenu": "They said never received order even though I have receipt. Disputing charges with credit card company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NAC",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T21:22:39.000Z",
          "Titre": "Really bad customer service",
          "Contenu": "Really bad customer service. They tell you one thing then say they did not say that. Not professional."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-02T15:40:33.000Z",
          "Titre": "Inaccurate description of the product i…",
          "Contenu": "Inaccurate description of the product i bought. Beware of buying products. Be sure to read the full description of what you are buying. I called and told them i was unsatisfied due to being mislead by the pictures of what was suppose to be included, that i didnt end up getting. I wont be buying from them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Austin Carpenter",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T20:36:04.000Z",
          "Titre": "Shipping Issues",
          "Contenu": "No where on the order checkout page does it say signature will be required however this is how it was shipped. It also does not say you cant have it held at a access point down the street. The ONLY thing it says is you can't ship to a different state than the credit card billing address. Our UPS account has a shipment release authorization but it says not available due to shipper restrictions. We then tried to have it held for pickup at a access point but that too is restricted by the shipper. We then called Strobes and More and they told us we have to wait home all day for UPS. We have never had this issue with anyone else for such a small order, $1,100. We will never be ordering from Strobes and More again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "STINE ELECTRONICS, LLC",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T01:30:05.000Z",
          "Titre": "we received a lightbar that had a bad…",
          "Contenu": "we received a lightbar that had a bad controller so this Fire truck has been sitting at our shop 3 weeks waiting for the company to send the replacement controller that arrived yesterday.  We ordered a havis Console through Strobes and More for a 2023 Chevrolet Silverado with BENCH seats and they sent one for a 2019 Silverado with bucket seats and refuse to take it back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Louie",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T15:32:05.000Z",
          "Titre": "Received wrong part",
          "Contenu": "Received wrong part, would not let us return. I kind of understood that however they not only made me pay shipping charge they added $25.00 to handle. Not very accommodating."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T14:02:12.000Z",
          "Titre": "Unhappy with the backordef",
          "Contenu": "The item has been back ordered for some time. I don’t have a positive review as other retailers who sell the same item have been able to get stock. Very unhappy, about to ask for a refund and purchase elsewhere"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "reaction",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T22:19:51.000Z",
          "Titre": "takes way to long to check inventory",
          "Contenu": "takes way to long to check inventory. for a simple light its a 12-15 phone call. has to be a better way to check for inventory. on line ordering always shows positive inventory, but i have to call to check to see if in fact the part is in stock."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nolan",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T00:33:12.000Z",
          "Titre": "Negative experience",
          "Contenu": "Placed an order at 9:01am for items in a blowout sale that started that same day at 9:00am. My order was cancelled a few hours later and the email I sent to them asking why is still unanswered."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Henley",
          "Nb_Reviews": 16,
          "Date": "2022-08-03T16:22:23.000Z",
          "Titre": "I swear to GOD these are the dumbest…",
          "Contenu": "Now they called my attorney and lied to him. This is the pathetic steps they do to avoid being held accountable for there actions. The president of this company is a complete and utter D.A.As you can see they can’t count either. They again won’t deny what they have done. Today some uneducated dude who shows as President of the company thought he was going to outsmart me. All these emails and screenshots are available. They then try to blame it on UPSAs you can see they have no intelligent response. I've reported these thieves to multiple agencies as well as the attorney General. They are theives. Trustpilot said my review was to harsh but reality is they stole my money and refuse to deliver my items. I stand by my statement and hereby add attachments.I swear to GOD these are the dumbest ppl on the planet I have been arguing with them on order number 260825. They lied to me several times. They lost my order and then tried to make every excuse even blaming me for it. I promise you I have never in my existence encountered a more pathetic company in my life. I would rather eat rat crap the rest of my life then to deal with these uneducated morons."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-25T20:24:39.734Z",
          "Titre": "Shipping is a nightmare",
          "Contenu": "Shipping is a nightmare. Live in Canada and had to pay brokerage fee which wasn't an issue. Paid the fee and the shipper still wants me to pay it. Not happy with the overall experience"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandon Atkinson",
          "Nb_Reviews": 1,
          "Date": "2022-06-26T19:05:49.000Z",
          "Titre": "Product caught fire denied warranty replacement even though it caught fire while under warranty.",
          "Contenu": "Had been very pleased with them recommended to many friends and have been responsible for at least $2000 in sales to their website. Had one of their tailgators catch fire while still under warranty, had some difficulty finding a shipping tube to send it back in with. Recommended it to a friend because other than this one which I felt to be defective, I love the product. Ended up using the shipping tube theirs came in to return mine. By that point it was a few months out of warranty, I had documentation proving the event of it failing and catching fire occurred prior to the warranty ending and was declined warranty coverage on a replacement due to it being out of warranty by the time they received it.*in reply to their reply* I’m not sure how 2 am being the time this shows it was posted has relevance however 1. It was done about midnight but between time zone difference and there being a delay in reviews posting it appeared to be later. 2. I think it’s a given that first responders keep odd hours and I posted that before bed after having been busy all day.Also I emailed Lauren back in April asking that it be reconsidered after having talked on the phone including a picture of the product that was damaged that also included a time stamp from when it was still in warranty and never received a reply. This email also included a order number.In regards to the fuse it did blow after catching fire but regardless of that the product failed while under warranty and isn’t being replaced as if it were, that’s where my concern lies."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lawn guru",
          "Nb_Reviews": 2,
          "Date": "2022-05-26T21:07:07.000Z",
          "Titre": "Never received strobes",
          "Contenu": "Never received strobes.  Called and was suppose to get call back when they figured out what was going on.  No dice yet!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-05-14T18:43:45.000Z",
          "Titre": "Would not ship to my correct address",
          "Contenu": "Would not ship to my correct address, I had to pay shipping 2x.  I will not place any more orders."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T01:48:06.000Z",
          "Titre": "Canceled my order and never even…",
          "Contenu": "Canceled my order and never even informed me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NAC",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T16:46:49.000Z",
          "Titre": "customer service is horrible",
          "Contenu": "customer service gave me the wrong information."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T00:24:59.000Z",
          "Titre": "I spend 3 days triying to know my order…",
          "Contenu": "I spend 3 days triying to know my order status, no info"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T20:23:04.000Z",
          "Titre": "I purchased a Feniex interior lite bar",
          "Contenu": "I purchased a Feniex interior lite bar. The lite bar works in conjunction with a quad converter. I tried to have the set professionally installed and they could not make it work. At my expense I sent the set back to Feniex and they checked it out and sent it back to me. Following their instructions I attempted to install the quad and lite bar and it still does not work. Frustrated!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 1,
          "Date": "2022-03-04T22:07:57.000Z",
          "Titre": "Poor communication, 1 month and no updates",
          "Contenu": "Placed order on 2/7/22 And paid for next day air shipping. Today is 3/4/22 and order still not delivered. No emails,calls, or updates. Have tried calling multiple times and keep getting put thru an endless loop through the automated menu. My client is very upset with me for not being able to deliver and I am extremely disappointed in the level of customer service. Unless this is resolved within the next 24 hours, I will be requesting a refund and will not be doing business here again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-26T20:46:29.000Z",
          "Titre": "charge me twice for delivery"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-07T16:57:46.000Z",
          "Titre": "Not happy with this company receive a…",
          "Contenu": "Not happy with this company receive a defective And report to them . Basically not even willing to sent out replacement ? Which I just receive it less than 24hrs .they even mention in 24hrs if anything wrong please report . After report just getting more disappointed. Don’t get it twisted it was 24hrs now you say 2 weeks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2022-01-05T15:10:00.000Z",
          "Titre": "LED lens doesn't fit, not returnable",
          "Contenu": "A perfectly usable, returnable part is, in the fine print, not returnable. I needed a replacement lens for Whelen 600 LED light head, and found one advertised as such. I bought it, only to find out Whelen 600 LED light head lenses are glued in place and not replaceable. It should not be advertised as being compatible with Whelen 600 *LED*, as it implies the lens is replaceable when it is not. StrobesnMore would not accept the return of an untouched part."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Byron lewis",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T00:08:46.000Z",
          "Titre": "I ordered and received two sets of…",
          "Contenu": "I ordered and received two sets of sidewinder running board lights, both sets failed and were replaced under warranty. My issue is per your policy, my vehicles were down twice to remove and replace them. I would have preferred to pay for the replacement, and be refunded when I shipped the faulty product to you. Having the vehicle in the shop twice was a big inconvenience, and the replacement lights are not as bright. I have spent a lot of money  with you guys, and I must say I'm not completely satisfied with the products and policies."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Windham County Sheriff's Offic",
          "Nb_Reviews": 1,
          "Date": "2022-04-07T16:36:31.000Z",
          "Titre": "Communication was lacking",
          "Contenu": "Communication was lacking. We had an installer scheduled to arrive at our department to upfit a priority cruiser and needed the parts/lights the next day. We paid for next day shipping and only received a partial order.  There was no communication that the lights were on back order nor were we refunded any of the shipping costs for the lights. We had to call customer service who stated  that they don't guarantee that items are always in stock.  It would have been prudent if this company would have informed us that when placing the order instead of tracking them down for the information."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-17T18:52:19.000Z",
          "Titre": "I forgot to add a coupon code for free…",
          "Contenu": "I forgot to add a coupon code for free shipping. I emailed the sales department with in a couple of hours of placing my order. I explained the situation and they would not add the code to my order. Strobesnmore lost a customer over $13 and change. I will do any future business with another company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-16T05:02:21.000Z",
          "Titre": "I ordered two light bars",
          "Contenu": "I ordered two light bars.  They both arrived damaged.  I was referred to the manufacturer for replacement parts.  The manufacturer has not responded to my warranty claim in a month. This means I’ve had two light bars that I payed over $800 for laying around useless for two months.  No idea when I will get replacement parts. Have been a loyal strobes n  more customer for about 10 years.  Probably won’t buy from them any more."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2021-12-11T21:01:43.000Z",
          "Titre": "They send you what they want.",
          "Contenu": "I place an order for spilt Red/blue lights. And was send blue lights only. When I called to informed them of the problem, they stated that was on the invoice. What I ordered and what was on the invoice was two different things. I installed a lot of emergency equipment, so I tell my customers to order from your company. But after speaking to one of your representatives it’s like she didn’t care of the problem. So that just tells me you don’t care for my business. No problem, there are other companies that are more than willing to take care of us."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "D W",
          "Nb_Reviews": 1,
          "Date": "2021-11-14T15:51:29.000Z",
          "Titre": "Deceptive reviews and product info",
          "Contenu": "Was not super pleased with product and wrote a negative review that was never posted to product page. Looks like only positive reviews make it through. Part of the problem was that the product information listed on the page was incorrect, but I guess you're not allowed to point that out."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Saul",
          "Nb_Reviews": 1,
          "Date": "2022-02-03T16:40:53.000Z",
          "Titre": "Good quality product but horrible…",
          "Contenu": "Good quality product but horrible customer service. I placed an order online to be delivered to the place I’m working and had no issues doing so. The order got delivered to my mailing address across the country with no heads up to me and I’m being told by customer service rep that is now my problem with a condescending tone.  This is not the first time I’ve order a product to a different state from my mailing address and it was not an issue before. I understand if things change but if you’re not going to send it to the address requested don’t send it before confirming with the customer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-08T23:23:51.000Z",
          "Titre": "Zero response from sales/customer service",
          "Contenu": "I accidentally ordered lights that were too small for my van. I need to place a much more expensive order but I wanted to secure a return/exchange first. I emailed on February 4th and again on March 5th requesting a return and received no response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian t",
          "Nb_Reviews": 1,
          "Date": "2021-03-27T00:11:58.000Z",
          "Titre": "If negative numbers were possible we…",
          "Contenu": "If negative numbers were possible we would be at 100. I contacted strobes and more before I made my purchase. I explained what I was trying to do and was told that the product I purchased would work. It did not work as expected. I returned all four of the lights I purchased and because I opened one box and tested it, I only got credit for three out of four lights."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-03T00:17:23.000Z",
          "Titre": "Strobes N More",
          "Contenu": "Strobes N More, please dont send me anymore reminders to leave you a review, because if i type up my recent experience with you all, it won't be pretty. And I dont like to leave negative reviews.**EDIT!! The owner of the company called and apologized and admitted they had dropped the ball on my order. I have a lot of respect for a person like that. I will definitely order from Strobes n More again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Timothy Turner",
          "Nb_Reviews": 2,
          "Date": "2023-06-09T13:47:50.000Z",
          "Titre": "Very poor customer services",
          "Contenu": "Very poor customer services, very poor updates in products, awful communication."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles Hullinger",
          "Nb_Reviews": 2,
          "Date": "2021-08-31T00:59:35.000Z",
          "Titre": "Disappointing",
          "Contenu": "The add is misleading. No armrest or cup holders included. The communication for when, and progress of delivery, is non-existent. I paid for three day delivery and received the incomplete product twenty two days later. No directions included, have to download the instructions...👎"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2021-03-04T16:31:28.000Z",
          "Titre": "IF YOUR SMART STAY AWAY FROM THIS…",
          "Contenu": "IF YOUR SMART STAY AWAY FROM THIS COMPANY!!!!!The owner is very unprofessional and rude! We have been dealing with this guy for three months on one issue. It is impossible to get a refund with Louis because he cares nothing about his customers. He is a smart ass, and treated me like crap through the entire process! He is a joke and needs to lose his job for always trying to blame the customers. And if he is wrong, look out! Because he will ignore you and hang up in your face!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Happy customer",
          "Nb_Reviews": 4,
          "Date": "2020-10-02T00:17:11.000Z",
          "Titre": "Due to confusing wording on your…",
          "Contenu": "Due to confusing wording on your website, I purchased three amber and three red lights instead of the six red/amber split lamps that I desired.  My attempt to get this corrected fell on deaf ears.  In this tough economy, I would think that customer service should be extra important.  That is not customer service at all.  I'm sorry.  This gets you only one star today."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Randy Tyndall",
          "Nb_Reviews": 2,
          "Date": "2022-01-04T15:38:04.000Z",
          "Titre": "Spent over 600 on side running board…",
          "Contenu": "Spent over 600 on side running board lights and have one less than year old with a light on all the time and running my battery down so now not only do i have to buy a battery im having to pay again to have warranty repaired not happy or satisfied."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sean",
          "Nb_Reviews": 1,
          "Date": "2020-06-04T01:25:37.000Z",
          "Titre": "Every item I received had problems",
          "Contenu": "Every item I received had problems. Sure box/control box melted fuses and my dash light has led lights out of it straight out of the box! I paid money to have professionals install all the items and yet still defective parts. Spoke with the owner and he was extremely rude and after asking him multiple times to leave me alone over him emailing me about this negative review I had to threaten legal action for him to stop. Don’t buy here!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-10T14:47:54.000Z",
          "Titre": "I received an item that did not fit the…",
          "Contenu": "I received an item that did not fit the vehicle I entered. I called to have the issue resolved. Was given a link a contact the manufacturer myself… not sure why I’m having to do all the leg work to correct the issue… still don’t have the correct item…"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JW",
          "Nb_Reviews": 3,
          "Date": "2019-10-15T00:43:17.000Z",
          "Titre": "Cheap Chinese Product",
          "Contenu": "Cheap Chinese product that they advertise as their own. No instructions including as far as which is the sync wire etc, you just have to figure it out. WILL NOT BUY FROM THEM AGAIN! Then they responded with “Fake Review” instead of owing up to it. Since they chose to do that PLEASE RESEARCH THIS LYING COMPANY. My order number was 16-127800 feel free to look it up!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zeke",
          "Nb_Reviews": 1,
          "Date": "2019-11-22T04:50:06.000Z",
          "Titre": "you are absolutely the worst company to…",
          "Contenu": "you are absolutely the worst company to work with, unprofessional and rude. I will be taking other avenues to rectify the situation. Absolutely disgusting and should not be in business. Sham and Scam. I may only  be one customer but I intent to do what I need to make sure that people know how completely unprofessional this company is.Your response is a flat out lie! You should be ashamed. I urge anyone considering buying from this company to think again. Buyer be ware!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ursula",
          "Nb_Reviews": 1,
          "Date": "2019-01-02T23:23:09.000Z",
          "Titre": "How could I review an item I haven’t…",
          "Contenu": "How could I review an item I haven’t received? Terrible customer service. When I ordered the item I was expecting it in 10 days. After almost 2 weeks and still nothing I called and was told they have none in stock and should receive in 5-7 days. It is now day 8 and still nothing. Never did I get an email or phone call regarding this delay.  Again...terrible customer service!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patrick T.",
          "Nb_Reviews": 1,
          "Date": "2021-12-01T18:01:57.000Z",
          "Titre": "Worst customer service ever",
          "Contenu": "I placed an order but even though address was updated on my end, shipping showed my old address. I emailed customer service before the order went to shipping. I was told they can't help once the order is placed. All they did was tell me I need to update my account. I kept telling them I did and all my info shows correct. They refused to help and kept blaming me. I had to drive 45 min to go get it. Why wouldn't they fix the address before shipping? It makes no sense. I've been buying from strobesnmore for years. As per thier response below it's my fault. My credit card address is my current address and has been for 3 years."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 1,
          "Date": "2018-12-13T11:11:20.000Z",
          "Titre": "Totally screwed up shipping and ultra slow delivery.",
          "Contenu": "Totally screwed up shipping. Ordered items on a two day delivery and three days after ordered got a call on order telling me one of the items is no longer available. Told them to ship me what they had right away on another two day freight. Two days go by before they even ship that order. 10 days to get items I ordered on a two day that were all supposed to be in stock?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Gross",
          "Nb_Reviews": 2,
          "Date": "2018-11-01T21:44:21.000Z",
          "Titre": "Worst company",
          "Contenu": "Sent my item to the wrong address. Said it was my fault even though it was clear on many documents on where to ship it. Customer service kept saying “ the guy “ to handle it was out of the office. Other reviews said the same thing about “ the guy “. I had to drive to the random persons house to pick it up. The little girl that answers the phone thought it was no big deal. WOW!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-16T21:11:49.000Z",
          "Titre": "Support products you sell",
          "Contenu": "You will not support the product I purchased.  But you are willing to sell them.  Product does not work for my truck and I contacted the product company directly with two phone call and no returned call as of today.  If your not going to support a product then you should not be selling it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2018-12-09T23:48:27.000Z",
          "Titre": "I ordered a product in which it said it…",
          "Contenu": "I ordered a product in which it said it would ship in 2 days. After not receiving any emails other than the confirmation of order after 7 days I called to check status. They told me the product I ordered was out of stock and possibly wouldn’t ship till after Christmas. I ordered on nov 23. An email would have been appreciated to tell me status."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "john",
          "Nb_Reviews": 1,
          "Date": "2020-05-24T20:32:51.000Z",
          "Titre": "Unhappy",
          "Contenu": "I was trying to replace a Nova Superpack 606 and was recommended a Whelen model UFM8.... according to Whelen it will not work as a replacement for my old unit. The new power module only works with halogen bulbs which means I would need to completely re-wire the vehicle...Extremely disappointed"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 1,
          "Date": "2021-11-21T17:07:43.000Z",
          "Titre": "Never received",
          "Contenu": "Never received.  Message was sent about the original invoice and it was never answered.  Really upset and my entire build is being held up by strobesnmore and i missed my original deadline.  Extremely disappointed and frustrated."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Northtxupfitters",
          "Nb_Reviews": 3,
          "Date": "2019-01-08T01:07:22.000Z",
          "Titre": "Bought a tailgator light",
          "Contenu": "Bought a tailgator light. Received it.  Is not what was pictured.  No info to design changes.  Looks like crap lots of purple when it’s to be red and blue.  Customer service horrible and no honor in what they advertise for refunds or warranty.  Stuck with a purple light.   Save yourself the hassle buy a feniex or whelen"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2018-12-11T03:28:07.000Z",
          "Titre": "Cheapest prices but worst company",
          "Contenu": "Cheapest prices but worst company to deal with. Poor communication. Items I ordered were out of stock, but they left it up to me to discover that myself by waiting a few weeks. After a month, still no delivery, they say the ol’ “it’s on its way”.  No reason or compensation for my troubles. Will not be a repeat customer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chief",
          "Nb_Reviews": 1,
          "Date": "2021-03-26T17:54:02.000Z",
          "Titre": "Speed Turtle don’t buy, no responce",
          "Contenu": "Purchase speed turtle does not work as advertised speed turtle will not respond back with email or phone message contacted strobes and more they said they would call them didn’t hear anything back called strobes n more again the guy said he can’t help me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2019-07-26T16:50:12.000Z",
          "Titre": "I ordered an item several weeks ago and…",
          "Contenu": "I ordered an item several weeks ago and I still don't have it. Every time I call they say it will be shipped in a few days and today I called to cancel it and they said they couldn't. I no longer need the item because it took too long and I already bought it somewhere else."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JW",
          "Nb_Reviews": 3,
          "Date": "2019-10-15T00:48:38.000Z",
          "Titre": "Buyer Beware",
          "Contenu": "No instructions for wiring included. The company will respond with “ FAKE REVIEW” instead of owning up to their short comings. Pay the extra money and get Feinex or Brookings. Very disappointed with the audacity to flat out lie. Will email ANYONE WHO ASKS A COPY OF MY RECEIPT."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brett",
          "Nb_Reviews": 1,
          "Date": "2018-11-08T22:18:15.000Z",
          "Titre": "buy somewhere else",
          "Contenu": "Shipped to wrong address- won’t make it right!  do not order fromShipped to my credit card billing address which is a mailbox only.  That’s why we provided a “shipping” address.   There are 18 units at the mailing address.   I’m sure someone has our led lights.  Place is a joke"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2020-05-13T12:50:15.000Z",
          "Titre": "Not happy.The company representative that I talk…",
          "Contenu": "The company representative that I talk to on the phone was one of the rudest people I have ever talked to. He never let me get a word in and kept interrupting me. I got to a point i had no choice but to cancel my order. Not what I wanted to do."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Hilton",
          "Nb_Reviews": 2,
          "Date": "2021-03-18T09:16:44.000Z",
          "Titre": "My package still hasn’t shipped been 2…",
          "Contenu": "My package still hasn’t shipped been 2 weeks and I bought the 2 day shipping I hope I get refunded for the 2 day shipping charge you guys sold out on the product that your out of stock on the item so I can’t buy the product"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2020-07-04T18:43:22.000Z",
          "Titre": "Was disappointed I guess it’s my fault…",
          "Contenu": "Was disappointed I guess it’s my fault did not look close enough at the light cause I needed a new one and price was in my budget did not realize there’s no lens to cover the led bulbs so there exposed but other than that love the light"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-31T02:30:06.000Z",
          "Titre": "I don’t think it’s your fault Whelen is…",
          "Contenu": "I don’t think it’s your fault Whelen is so very slow."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank Chiodo",
          "Nb_Reviews": 2,
          "Date": "2018-11-08T18:23:50.000Z",
          "Titre": "Ordered two lights that were not to…",
          "Contenu": "Ordered two lights that were not to satisfaction.  Got a lot of grief exchanging them.  The one light I got cost less including the shipping exchange fees and was never credited the difference.  I will never do business with this company again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2019-01-02T21:59:04.000Z",
          "Titre": "Items Not In Stock As Advertised",
          "Contenu": "I purchased a Sound Off Signal 72\" Blue/White N-line from the Garage Sale section and money was charged to my credit card. The following day I received a voicemail saying the item is out of stock and a similar item was available, the Strobesnmore Atom. However, they said it was smaller, 60 inch, all blue, and would cost $150 more. This is a typical bait and switch tactic. Not even offer a similar item for the same price, but an inferior product for more money. I have used strobesnmore in the past, know many friends who have as well. After this, they left a bad taste and I do not believe I would deal with this company again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-17T20:17:08.000Z",
          "Titre": "Order had to be cancelled due to change…",
          "Contenu": "Order had to be cancelled due to change in product. I will need to figure out something different to meet my needs and fit my budget. This was the third company to turn me away."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JOHN",
          "Nb_Reviews": 1,
          "Date": "2019-01-19T18:37:04.000Z",
          "Titre": "Never Again",
          "Contenu": "Light did not alternate colors without being rewired.  After requesting assistance, received an e-mail that was part of an internal thread chiding my choice of language.  A subsequent request for additional guidance went unanswered."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ROW - Accounts Payable",
          "Nb_Reviews": 1,
          "Date": "2020-07-09T16:40:53.000Z",
          "Titre": "I can't give less than one star or I…",
          "Contenu": "I can't give less than one star or I would!!!  It took 3 months to get our product but you can bet the bill hit our credit card immediately.  Didn't receive the product until I disputed the charge due to not receiving my order.  Now I get very nasty email from the owner himself.  Accusing us of trying to get something for free...give me a break.  Trying to deal with these people is next to impossible once they have your credit card  number.  They are not concerned with customer satisfaction at all...only what is best for them.  Even blocked his email address so we could not respond via email.  What a great business...NOT   I do not recommend doing business with this company at all!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joel Peterson",
          "Nb_Reviews": 3,
          "Date": "2021-08-02T23:54:48.000Z",
          "Titre": "A high shipping cost",
          "Contenu": "A high shipping cost, then sent the wrong product. I returned items which they had to wait and receive before shipping the right items. Over twenty days before I received the right item."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Douglas O'Donnell",
          "Nb_Reviews": 1,
          "Date": "2018-11-01T17:36:07.000Z",
          "Titre": "Lights Ordered",
          "Contenu": "Lights OrderedOrdered a pair of of lights for my rocker panels, then was told they were out of stock. However when I visited the site a couple weeks later it said they still had 2 left in stock. Very disappointed"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 1,
          "Date": "2021-04-19T18:34:41.000Z",
          "Titre": "I ordered a LED magnetic strobe several…",
          "Contenu": "I ordered a LED magnetic strobe several months ago. That evening, I realized that I did not take the dimensions into consideration. I called back 1st thing the next morning. I asked the guy answering the phone if the unit had already been sent out. He asked my name, he looked it up and said how can I help you? I replied the dimensions were not going to work. He immediately said they were already out and there were no refunds... period. He was absolutely non sympathetic in any way and could have cared less.OK, I will not go further than this.Now, I have had to jury rig a mount to fit and have used it for the 1st time. The 2 position switch stopped working on the #2 position. Once again, I used it once and the switch does not work in the #2 flash position.I am not a happy customer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-30T01:20:55.000Z",
          "Titre": "Not sure when I received and email to…",
          "Contenu": "Not sure when I received and email to give a review knowing what my review would be. Owner is extremely unprofessional. And we still haven’t received our lights... 3 weeks now I believe."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Faulconer LLC",
          "Nb_Reviews": 1,
          "Date": "2018-11-01T18:10:35.000Z",
          "Titre": "I ordered the under tailgate light",
          "Contenu": "I ordered the under tailgate light. It only flashes red. Not red and white like it was supposed to. It worked fine for about a week then stopped. After trouble shooting still only red. Thanks for reading"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-09T22:16:26.000Z",
          "Titre": "I ordered a light a couple of months…",
          "Contenu": "I ordered a light a couple of months ago. It was a specialty item from Whalen and I wasn't told that it would take well over two months to get the light. If I was advised that it would have taken so long I wouldn't have ordered it. I did email your company, and they explained the situation well, however that was after 3 weeks of waiting for the light to be shipped. I'm not sure how you can make this not happen again, but I probably will not purchase anymore lights from your company in the future. Our emergency light salesman is no longer in business and I was hopeful that your company would be the replacement. I obviously was wrong. Thank you for your time, and I still have not received my light. I guess my business and future business with you doesn't mean anything to you all."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "PIERRE",
          "Nb_Reviews": 4,
          "Date": "2019-12-13T10:35:38.000Z",
          "Titre": "NOT COOL!",
          "Contenu": "They would not ship to other than my billing address. When I cancelled the order, they shipped it anyway to my billing address where it will now sit for a few months before I get back. NOT COOL!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2019-12-09T15:37:14.000Z",
          "Titre": "Bought a flashing  strobe headlight kit…",
          "Contenu": "Bought a flashing  strobe headlight kit which I found out will void my warranty on my new truck. Company refuses return says all sales are final! Will never use this company Strobesnmore. again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customermike",
          "Nb_Reviews": 1,
          "Date": "2021-12-13T17:20:33.000Z",
          "Titre": "Poor customer service.",
          "Contenu": "I usually buy all of my lighting and siren equipment from strobes n more for both my department and personal vehicles. In my last order I received a used light head. The bag it came in was cut open and taped shut and the protective film that should have been on the lens was missing. There was also a broken screw in the back of it like it was installed and removed. Upon receiving it I immediately contacted customer service and sent pictures. They assured me it was not used eve though it was obvious it was used. I replied back asking for it to be exchanged since I paid for a new unopened light. They said they would send a return label, but it has been almost two weeks and I have not received it. Every time I try to contact customer service I get told it should come in the next few days. I will not purchase anything from strobes n more again unless this is resolved quickly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 2,
          "Date": "2019-07-14T00:31:54.000Z",
          "Titre": "Lacking",
          "Contenu": "Ordered 6 strobes received 4. box has a huge green label saying claims will not be honored after 24hours, so it's my fault for not opening the box before I was ready to install."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-08T02:24:31.000Z",
          "Titre": "Listing on the website wasn’t specific…",
          "Contenu": "Listing on the website wasn’t specific to my order, was sent new old stock with colored lens, they wouldn’t rectify the issue, after admitting I was right."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Israel",
          "Nb_Reviews": 2,
          "Date": "2020-10-22T14:27:33.000Z",
          "Titre": "Unprofessional business",
          "Contenu": "The owner is arrogant, rude and very unprofessional. I ordered a light in a specific color combination, and also specifically added in the comments at checkout what exactly I need as a combo. After receiving the wrong combo (3 weeks later)  the owner Louis called me, after i explained the problem, he refused to work with me, forcing me to dispute it through paypal. The owner of the business actually hung up the phone on me because he didn't like my tone of voice. Shop elsewhere. He specifically told me that if ripped the bag open, which i did in order to check the light, they will charge me return shipping and restocking fee.When i mentioned that I also specified in the comments at checkout of what exactly I'm ordering, he said that they don't really pay attention to those comments. Why have a comments section at checkout?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2020-07-06T18:38:49.000Z",
          "Titre": "I thought the management was very rude",
          "Contenu": "I thought the management was very rude, condescending in fact.The technicians did an excellent job, however the front of the house could use some customer service training"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2019-02-21T19:29:03.000Z",
          "Titre": "18 days since order and still no…",
          "Contenu": "18 days since order and still no shipment, multiple missed promised ship dates. Got the request for the survey and still dont have the order so made sense to report that honestly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Damian",
          "Nb_Reviews": 1,
          "Date": "2020-05-29T10:31:53.000Z",
          "Titre": "NEGATIVE EXPERIENCE / POOR CUSTOMER SERVICE",
          "Contenu": "Purchased Whelen Avenger (AVW12K), online based off product description and provided website information. Received product damaged and/or not as described online and in unauthentic Whelen packaging (filler was shredded Amazon boxes?) inappropriately filled. Customer Service refused to accept any responsibility, refused to provide return label/shipping despite inaccurately (falsely) advertising product and/or shipping damaged item; additionally, despite matter being escalated to Owner (Louis Misto) I was denied any assistance in legitimately resolving issue and was informed I could return at my cost, for potentially a partial refund. Found experience to be insulting, fraudulent and disrespectful; furthermore, a company who refuses to stand behind their products is unworthy of my future business or positive feedback / recommendation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-16T21:30:49.000Z",
          "Titre": "It been over a month and I have still…",
          "Contenu": "It been over a month and I have still not Received my light. Every time I ask about it they say the manufacturer is building it it does not take that long."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-30T13:45:35.000Z",
          "Titre": "Product is not the way it was described…",
          "Contenu": "Product is not the way it was described on the phone and in not functioning as a reverse light like i was told it would also delivery was delayed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard J. Bathmann",
          "Nb_Reviews": 4,
          "Date": "2021-12-24T03:28:46.000Z",
          "Titre": "use caution/ read fine print",
          "Contenu": "too many loopholes, make sure you read before placing your order.  apparently, my order is a \"made to order\" product and now unable to cancel or even get a refund.  I am now at the Mercy of a third-party company Fenix; strobes n more has nothing to do with product delivery.  If I knew then, my item was not coming from strobes n more and needed to be made to order, I would have saved me $175 and needing to wait for a bs Target delivery date of 01/21/2022.  Strobes n more took my money, nowhere did I see it posted item is made to order and drop shipped from manufacturer.  Senseless, loophole for company to get funds and make customer wait.  I have been in customer service field for over 20 years and never had this type of service.  To anyone ordering from strobes n more, read the fine print before entering your payment information.  Never again will I use strobes n more again, and be sure, I will share this review on every social platform so others will not have to go down my path."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-06-24T16:01:12.000Z",
          "Titre": "Extremely long time for delivery and…",
          "Contenu": "Extremely long time for delivery and bad customer service and no returns for a regular non-special order item they decided it's special order"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SCOTT",
          "Nb_Reviews": 2,
          "Date": "2019-12-18T01:01:02.000Z",
          "Titre": "Placed my order on the 19th of nov",
          "Contenu": "Placed my order on the 19th of nov. Its the 17th of dec and still have not received order. I call and phone just sends me in circles with recorded messeges."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "rob smith",
          "Nb_Reviews": 7,
          "Date": "2021-01-29T18:41:07.000Z",
          "Titre": "TAILGATE LIGHT BAR LASTED 30 MONTHS",
          "Contenu": "TAILGATE LIGHT BAR LASTED 30 MONTHS. SOME OF THE LED'S DO NOT ILLUMINATE AND FLASH PATTERN IS OUT OF CONTROL. HIGH RATE OF MOISTURE IS PRESENT."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 1,
          "Date": "2021-03-15T16:09:06.000Z",
          "Titre": "Bought a duo light that us not a duo…",
          "Contenu": "Bought a duo light that us not a duo light. When the light flash you have to pick white or blue not both. Get price for single flash color light"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandon Johnson",
          "Nb_Reviews": 1,
          "Date": "2018-11-03T15:22:03.000Z",
          "Titre": "Rep was short and un willing to help…",
          "Contenu": "Rep was short and un willing to help and assist with the products I purchased.  Little or laziness about the products.  Lack of enthusiasm and or knowledge."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-16T23:13:19.000Z",
          "Titre": "not impressed I payed 2 day shipping…",
          "Contenu": "not impressed I payed 2 day shipping and didn't receive my item for a week. Don't offer it if you can't do it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Calvin",
          "Nb_Reviews": 1,
          "Date": "2019-12-18T21:06:43.000Z",
          "Titre": "Products can not be reviewed when they…",
          "Contenu": "Products can not be reviewed when they were lost in mail. Then they shipped another package still havent received it week later n still no package"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-01-23T19:36:03.000Z",
          "Titre": "Shop somewhere else",
          "Contenu": "Pathetically weak lights that I cannot return because I opened them and powered them up. I’m done with this store and their return policy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KE",
          "Nb_Reviews": 1,
          "Date": "2019-06-20T22:07:36.000Z",
          "Titre": "Shipping was fast and product was…",
          "Contenu": "Shipping was fast and product was correct. Customer service was absolutely terrible and it was clear that they do not care about repeat customers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank Seccurra",
          "Nb_Reviews": 3,
          "Date": "2021-07-12T23:01:30.000Z",
          "Titre": "I ordered the wrong color strobes they…",
          "Contenu": "I ordered the wrong color strobes they said they will get back to me no one has called I called and the said a manager would call"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Feniex Buyer",
          "Nb_Reviews": 1,
          "Date": "2020-12-22T21:51:16.000Z",
          "Titre": "I keep getting asked to review my…",
          "Contenu": "I keep getting asked to review my purchase.   I still haven't received it and their web person called me a liar for saying so."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-04-23T17:51:52.000Z",
          "Titre": "One part ordered ended up being \"no…",
          "Contenu": "One part ordered ended up being \"no longer available\". Other part ordered hasn't even shipped yet and it's been 2 weeks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-16T22:55:52.000Z",
          "Titre": "Stay away!",
          "Contenu": "Took way too long to get my items and was charged for two items that I never got. Customer service has been non-existent."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Johnny P Jank",
          "Nb_Reviews": 2,
          "Date": "2022-02-07T22:46:47.000Z",
          "Titre": "Up to date stock information",
          "Contenu": "On Jan 24th I placed an order for (6) Whelen M-7AC and (6) Whelen M-7WC and were told all twelve were in stock and should ship out the next day. On Jan 28 I received a package with only the M-7WC modules and no amber modules. On that same day (Friday 1/28) I sent an email to Brittany requesting and explanation on way I did not receive my order complete. On Monday 1/31 I received an email stating \"The amber are on backorder right now. We are expecting a stock delivery in the next couple of weeks. As soon as we receive them we will ship them out to you.\" I contacted my customer and he called back on the 2nd of February and said he needed them sooner than 2 weeks and canceled the balance of the order with me. The next day, Feb 3rd I called to called the balance of the order and I was told that the lights couldn't be canceled because they were actually out for delivery. I did receive them that day. In fact they had shipped from Strobes and More the day before the reply was sent out that it would be and additional 2 weeks before they would arrive. Please provide more up to date shipping information so that we know when the product might be available."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason Robles",
          "Nb_Reviews": 2,
          "Date": "2019-10-24T16:51:59.000Z",
          "Titre": "30 years in LE and never dealt with…",
          "Contenu": "30 years in LE and never dealt with such an unreputable company.  False advertising.  Buyer beware.  No legitimate return policy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Erin Medley",
          "Nb_Reviews": 1,
          "Date": "2018-11-06T15:17:10.000Z",
          "Titre": "Poor Customer Service/Communication",
          "Contenu": "I ordered a console for my new truck 5 weeks before it had to be installed. By week three (two weeks before it was going to be installed), I hadn't received it yet. I called the company and they told me that they needed additional information about my vehicle, so it was going to be another 4 more weeks before I would receive it. I asked them why they didn't communicate that before now. They said that they did try to call but I never received the call or message. I told them that I wanted to just cancel the order because I was going to use another company that could get it for me a lot sooner. Unfortunately, they told me that they couldn't refund my money. I had already placed the order and because it was a \"special order\" they wouldn't be able to give me a refund. How convenient, they hadn't started my order because they \"needed additional information\" but they sure could keep my money because it was a \"special order\"?!?! I will never use this company again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kelly - Firefighter",
          "Nb_Reviews": 1,
          "Date": "2018-12-03T20:59:57.000Z",
          "Titre": "Did not receive my order",
          "Contenu": "Did not receive my order.  The order was damaged via UPS while in transit to me (but never delivered to me) and reported to Strobesnmore, when I asked Strobesnmore to ship me my order, they made me wait until they worked out the damaged item with UPS when I never was not part of the damaged it or ever received anything from Strobesnmore.  They should have taken care of their customer while working out the separate issue with UPS.  I paid for 3 day shipping too.Here's the best part, I called asking about my order, was transferred to Dave, as he was working the claim with UPS.  Besides telling me \"i don't know why they transferred you to me\", He told me that they would not ship out my order until they work out the claim with UPS.So they have a customer order and paid for a product.  It gets damaged before ever delivered to the customer, and the customer will not get the product because of an issue Strobesnmore has with UPS.  I canceled the order and will go to a company that knows how to treat a customer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 2,
          "Date": "2019-09-22T00:58:29.000Z",
          "Titre": "Ordered LED Lights and couldn't return…",
          "Contenu": "Ordered LED Lights and couldn't return them for a different size.No credit for a Miss size No help from customer service"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-08-01T17:21:01.000Z",
          "Titre": "Product fine, policies and fees are ridiculous",
          "Contenu": "While the product seems fine, I was disappointed by the fairly draconian return restrictions. I ordered a light bar that ended up being an inch too wide. My installer, a former police officer and fire department chief (I point this out because he is a reliable, honorable person I trust), who recommends your company all the time, made the mistake when pulling it out of the box of cutting the zip tie holding the wires together, only to find that the bar was too long. He then simply placed it right back in the box. In returning it, was basically implied that I was lying in saying that no power had been applied to the bar, and it had not actually been installed in any way. To top that off, I paid for the bar, plus shipping. I returned it, paying for shipping, and then when I was told it was refused, not only did I have to pay for shipping BACK to me, but a $25 fee was added on top. This all seems like just a way to get more money out of people. I agree with paying for the shipping, but was the extra fee really necessary? I have already ordered other items (and fear any cancellation will incur more draconian fees) but once I receive this final order I will not be ordering from the company again. I only give two stars because the product is good, but management needs to look closely as to if they care to build long term business with customers, or adhere to rules, and charge unwarranted fees, to make an extra buck."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Slippery",
          "Nb_Reviews": 2,
          "Date": "2023-07-02T18:02:36.000Z",
          "Titre": "Confusion",
          "Contenu": "Lots of confusion without providing useful needed information. Order confirmation comes 2 days after order was placed. At no time was I given total cost of order. Several emails later, able to finally figure out total costs. I would say less than mediocre at best."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JC",
          "Nb_Reviews": 1,
          "Date": "2022-06-06T05:14:58.000Z",
          "Titre": "Instructions are not very clear",
          "Contenu": "Instructions are not very clear, unsure on where or how to connect the 7 connectors, no instructions on how they are connected. instructions say something about a blue wire, there is no blue wire. There are no tutorial videos on a GM truck just Ford and Ram"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-05-24T19:41:37.000Z",
          "Titre": "Missing Items",
          "Contenu": "Not all items ordered were received.  When the order was received I believed that all items were accounted for.  When customer service was contacted, because it was just over a month, they refused to supply the items that were missing even though they were a minimal cost.  It's stated that the order was signed for....UPS delivered the package and it was not signed for.  Yes, it was just over a month later as stated that it was discovered items weren't sent.  I must say I wasn't aware of the policy and didn't see the label.  I will know in the future that this exists and will ensure that every item is accounted for that's ordered.  I was sent an email asking for my review and I simply rated the experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kelley Perry",
          "Nb_Reviews": 2,
          "Date": "2023-02-02T12:07:42.000Z",
          "Titre": "Great lights, Great Value, Bad Service",
          "Contenu": "Edited due to the fact that they continue to be argumentative instead of addressing the issue. I have a screenshot of their website as of this morning that shows backorder status for the lights I actually received but I guess they don't check their own website. Ordered two different types of lights.  One showed to be on backorder, other did not.  I sent an email prior to ordering and was told I could go ahead and place the order and they'd ship them when they came in.  I paid, got a receipt, and then got a shipment notice.  Ended up receiving the lights that were listed as a backorder on the website, and not the ones that did not show as a backorder.  No one contacted me to let me know about any type of short shipment.  Following the directions on the box, I emailed customer service.I told them the lights that were showing as in stock (if you're showing backorder on one I assume the other is in stock) did not ship but the ones showing backordered did.  I got an argumentative response saying that your website did not show stock and the lights were 4 to 6 weeks out.The lights I DID receive are great.  I expected to have to wait on SOMETHING, so even that isn't an issue.  Had the shipment been short and someone communicated that, it would have been a 5 star rating.  Had the shipment been short and I got an update that wasn't argumentative, 4 stars just for me having to ask where the other lights were.  The quality of the lights and the value are why it's still at 3  stars and not lower.I would still recommend the company, just understand that you may or may not get what you ordered and customer service isn't going to tell you anything until you ask."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T14:47:05.000Z",
          "Titre": "Was not willing to work with me when a…",
          "Contenu": "Was not willing to work with me when a error  occurred."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-25T01:34:22.000Z",
          "Titre": "Was not told that a bar I ordered was…",
          "Contenu": "Was not told that a bar I ordered was on back order for several months and they wouldn’t let me cancel the order when I found out. I ordered a Whelen bar on 12/9/21 and have yet to receive it. StrobesnMore replied and said I received my order. I only received the dominator bar not the inner edge bar. They need to look at the whole order. I have had multiple orders and the person that replied may be talking about an order I have received and not looking at all the past orders."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-10T17:38:47.000Z",
          "Titre": "Lack of communication",
          "Contenu": "Lack of communication Ordered siren speaker, bracket and 2 led lightsOrder was shipped with no indication of a problemReceived orderMissing speakerPacking slip said combo speaker/bracket shipped Called/emailed Cust serviceCalled me saying speaker was on back order from factoryThen speaker shipped same day I think it was just a picking and packing mistakeBut no one would simply say so and apologize"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-03T13:56:14.000Z",
          "Titre": "I have always ordered Supplies from…",
          "Contenu": "I have always ordered Supplies from your company for many years, and have always recommended to other people.  This last order that I purchased went on sale drastically a day after I made the order, and requested a refund of the difference. I was advised that it could not be done and that I would have to return the items and re-purchase them again. Seems like a lot of extra nonsense to go through instead of just honoring my request."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kim Frazier Frazier",
          "Nb_Reviews": 2,
          "Date": "2021-11-15T23:44:41.000Z",
          "Titre": "Cannot give a good review at this time.",
          "Contenu": "Cannot give a good review at this time.After placing an order, I received an email a few days later notifying me that my order was canceled.I sent an email to customer service to inquire why my order was canceled.Over a week later I still have not gotten a reply or explanation.Additionally, there has been no refund to my credit card."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Firefighter",
          "Nb_Reviews": 1,
          "Date": "2021-04-29T19:28:36.000Z",
          "Titre": "List and sell products of which they…",
          "Contenu": "List and sell products of which they have no stock.   They will not tell you they do not have any to ship.  When u order, they will charge your credit card, send u a tracking number.  Once u wait to receive the item and open the box, there will be a slip in there telling you it’s out of stock.Deceptive practice to help ensure u will not leave their site to go buy an in stock item elsewhere - eg Amazon."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 2,
          "Date": "2021-01-14T19:27:56.000Z",
          "Titre": "I placed an order for a Feniex light in…",
          "Contenu": "I placed an order for a Feniex light in December. The website says it was shipped January 5th. I called to check the status a few weeks later. When  I called I talked to Brittany who said she would check and call me back. I never received a call back so I called again. This time I spoke to Sarah who said she would check a projected date. She called back and said it would be about 3 weeks until my order shipped. I received poor customer service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Samuel",
          "Nb_Reviews": 3,
          "Date": "2020-06-15T17:13:30.000Z",
          "Titre": "Bad Service from Customer Service",
          "Contenu": "I was Very Disappointed by Customer Service. I had placed 2 recent orders and was told I would get free shipping because of a problem on the first if I entered code on next order. I Forgot to use code on second order so tried on 3 ( Largest Order) it wouldn’t take Code. I called and they said it was because I added “Deal of the Day” and they wouldn’t be able to remove shipping. I cancelled the order!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-15T19:29:36.000Z",
          "Titre": "Quad",
          "Contenu": "The quad lights themselves are amazing. However the hood bracket leaves a lot to be desired. The wiring for the light didn’t even come close to matching up with the hole in the bracket. The screw mounting holes were not big enough and had to be drilled out to the proper size. Last the set screws to hold it to the hood didn’t come with a wrench ( anything I’ve ever got before always has ). But no big deal I have a very big set however couldn’t find one the right size either to big or to small."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Kempf",
          "Nb_Reviews": 2,
          "Date": "2021-02-22T17:03:07.000Z",
          "Titre": "Need \"lens color\" option at time of order/cart",
          "Contenu": "The site needs to be a little more clear about what color the lenses are. I bought blue LEDs and the picture showed a blue lens so thats what I thought I was buying. But when they arrived all the lights were clear. Unless you read the small print in the description, it says clear lenses and the color lenses have to be special ordered. Now I have to eat the shipping (+ the insurance since it was $1000 worth of LEDs) to return the order and get the correct lights. There needs to be an option to pick what color lens along with what color LEDs"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2020-01-23T19:47:36.000Z",
          "Titre": "I bought a strobes and more siren had 2…",
          "Contenu": "I bought a strobes and more siren had 2 parts go wrong with the unit in the first 3 days I had it then I was told to pay for shipping to send the whole thing back after install it already instead of them just sending me a new unit with a shipping label so I did not have to wait for them to diagnose my original unit then tell me they would send me it back fixed. Why should I pay to ship there defective part and have more down time to wait for them to send it back."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CR",
          "Nb_Reviews": 1,
          "Date": "2019-03-22T02:52:42.000Z",
          "Titre": "Poor customer relations",
          "Contenu": "The item I purchased didnt fit due to a quality assurance issue from the manufacturer. Instead of dealing with them for me they referred me to return the items to the manufacturer instead of just exchanging them for another and completing the manufacturer's issue from your end. From all the business I send them I pretty much get pointed fingers and pass offs of issues."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Yvonne",
          "Nb_Reviews": 1,
          "Date": "2019-01-01T16:06:14.000Z",
          "Titre": "Ordered lights before Christmas",
          "Contenu": "Ordered lights before Christmas - when I did not receive e-mail that they had been shipped, called and was informed they were being shipped from manufacturer - could expect shipment in late January.  No correspondence from company/manufacturer.  If I had not called, would not have known what happened to my order - An update on the status of my order would be appreciated!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2019-01-16T13:01:00.000Z",
          "Titre": "Poor Communication and Inventory Tracking",
          "Contenu": "My Whelen siren did not arrive despite me paying for expedited shipping. I finally called after 2 weeks and was told it would be another 2 weeks before they would have them in stock. Unacceptable!  No calls, emails or any communication telling me any of this despite the order having been paid in full. Had I not called I would have never known what was going on."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-12-16T15:38:47.000Z",
          "Titre": "Pretty disappointed",
          "Contenu": "Pretty disappointed.    Have done business with Strobesnmore for years.   Purchased a lightbar on black friday sale.    A couple days later attempted to purchase another of the same lightbar for the same price.    Sales lady became upset that I would even ask about getting the same price as the first.   I would have thought selling me the same lightbar for the first sale price would not have been an issue.    I will not be doing anymore business with Strobesnmore as there's lots of other LED light dealers that will honor sale prices most anytime."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 2,
          "Date": "2020-05-06T13:25:35.000Z",
          "Titre": "This last order i would give 2 stars",
          "Contenu": "This last order i would give 2 stars. Ordered a light. Paid for 3 day shipping. No light came. Called sales person they couldn't give me any info at that moment and said they'd call back by days end. Next day I  called again and sales person sales lights are on back order until June. I asked why couldn't u have emailed me and she didn't have an answerThe issue is that yes u where out of stock but no email was sent saying 1 you where out of stock and 2 that they where on back order until I called"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Grant",
          "Nb_Reviews": 1,
          "Date": "2019-05-27T02:38:13.000Z",
          "Titre": "Very disorganized operation!",
          "Contenu": "Recieved the wrong item first shipment. Had to return it via UPS, I was told that as soon as they received confirmation that the item was being returned they would send out the correct item. I called three days later and was informed that it would be delivered that day. Not even 15 minutes after that phone call I received an email stating a shipping label was created for the correct item. Not a very good first time experience and not sure there will be a second chance."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "john",
          "Nb_Reviews": 1,
          "Date": "2018-11-25T12:06:13.000Z",
          "Titre": "I placed an order to be deliver for…",
          "Contenu": "I placed an order to be deliver for work over the long weekend.. my order was broken down into two shipments without my knowledge and now my project had to be put on hold...Not coolI will not order from you againI placed orders with 4 other company’s at the same time.. all three of the other orders came in correctly at the same time as planned"
        },
        {
          "Note": 2,
          "Lieu": "SA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-06T07:53:17.000Z",
          "Titre": "I had been ordered the materials and…",
          "Contenu": "I had been ordered the materials and paid the fees since 22th of December 2021, but till now the materials has not been shipped, I hope if you taking care of my order No.246318. and update me.thanks in advance"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2019-01-01T19:09:40.000Z",
          "Titre": "they are very bad at communication of…",
          "Contenu": "they are very bad at communication of when things are coming and shipping. They need to make things more clear on the website of when something will be shipped. I paid for one day shipping and now its been about 2 weeks because it had to be built. their products are good though so i cant complain about that"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jake",
          "Nb_Reviews": 1,
          "Date": "2018-12-02T20:51:23.000Z",
          "Titre": "Normally have no issues with…",
          "Contenu": "Normally have no issues with strobesnmore but this is my second order within the last 6 months that \"supposedly\" the in stock items I ordered were actually out of stock and I was never told. Then I chatted with someone on customer service and got disconnected. So I called was given the story of I will call around and figure it out and send you an email with the run down within the hour. Still havent heard back a week later. If they are willing to help and make this right I am happy to change my review."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Troy",
          "Nb_Reviews": 1,
          "Date": "2019-11-12T16:51:10.000Z",
          "Titre": "Disappointed",
          "Contenu": "Item I ordered was not in stock. When I contacted and inquired about item I was told, it's back ordered and basically I should have called to ensure it was in stock. Well, if I am ordering a product online do you think maybe I did not want to be on the phone talking to anyone?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alexander G",
          "Nb_Reviews": 2,
          "Date": "2020-08-11T08:30:04.000Z",
          "Titre": "Disappointed",
          "Contenu": "I have ordered from many different vendors in since January and noticed a small delay in some of my orders, but none as terrible as this purchase. I just want to get this purchase out of the way and look for another Whelen dealer to do business in the future."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dwayne",
          "Nb_Reviews": 1,
          "Date": "2019-02-05T15:23:16.000Z",
          "Titre": "Received my first order promptly but…",
          "Contenu": "Received my first order promptly but with the 2nd order there is a 4-6 week lead time, nowhere on the page or website does it state that a custom order has a 4-6 week lead time. I would have not purchased if this was stated clearly. I feel this is deceptive and a poor business practice."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bender",
          "Nb_Reviews": 3,
          "Date": "2020-09-03T21:01:00.000Z",
          "Titre": "Not exactly trilled with the new dash…",
          "Contenu": "Not exactly trilled with the new dash strobe, as when you remove the screws for the mounts, they are pretty damn impossible to get them all the way back in. If I paid 50 bucks, I wouldn't say a work, bu for 160.00 quaility should be better."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2022-02-26T12:51:18.000Z",
          "Titre": "Very expensive for what you get",
          "Contenu": "Very expensive for what you get - much better options for LED safety lighting - look elsewhere. Customer service is VERY slow. My wife purchased as a Christmas gift, I sent her a link"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Duncannon EMS, Doug",
          "Nb_Reviews": 1,
          "Date": "2018-11-08T18:42:26.000Z",
          "Titre": "Need better backorder system or just good customer service",
          "Contenu": "I was not notified that my order was back ordered. I called yesterday at 10 days since submission and was told that the parts were on back order and would be a couple days yet. They have my email and phone number but never notified me of back order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2019-12-11T21:59:11.000Z",
          "Titre": "Terrible experience",
          "Contenu": "Failed to show on website that the product was not in stock, did not call to see if we could wait for it, gave bad information when we first called to check on availability, claimed \"stocking order\" was held up in customs on second call, then refused to cancel our order because \"it was ordered just for you\". Do not order from this company unless you confirm product availability, and whether they've labelled it as special order even if it's something they normally stock.Edit: after this review was posted, the company called back and agreed to refund our money and cancel the order. Added one star for the follow-up."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Allan Ramsey",
          "Nb_Reviews": 2,
          "Date": "2018-11-01T17:46:07.000Z",
          "Titre": "Not happy!",
          "Contenu": "Purchase two lights they stopped working, send them back on my dime. Got them back , they been installed for about 3 weeks , and stopped working again! It’s to much better work remove again and ship again, my loss! Will never purchase here again"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kurt",
          "Nb_Reviews": 1,
          "Date": "2019-04-17T01:31:42.000Z",
          "Titre": "Very disappointing",
          "Contenu": "Very disappointing! Coming up on one month from the order date and still waiting. I had to call to get an update and was told it must be a backorder issue.  This was not indicated on the website when the order was placed.  One item has been received that was drop shipped from the manufacturer.  This leads me to believe the other items were also not stock items but ordered from the manufacturer when my order was placed. This was not indicated on the website either. Stobesnmore has great prices, just not the product, and these items are for job that has been on hold for almost a month. I'm really glad my client is very patient."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 1,
          "Date": "2018-11-01T17:52:02.000Z",
          "Titre": "Customer service is not good",
          "Contenu": "Customer service is not good. Received a product that turned out to be defective after about a month of use, really let me down in several situations where the product was needed but didn't work. Then they made me pay return shipping to send THEIR defective product back so that it can get fixed/replaced. Spoke to a \"manager\" that didn't really provide any good customer service or even cared about the customer's satisfaction at all and said that everyone else in the industry does the same. Way to stand out against the competition. I would not purchase through them again. Product was a Strobes N' More brand product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JDH",
          "Nb_Reviews": 2,
          "Date": "2021-01-21T23:06:17.000Z",
          "Titre": "No packing slip included in shipment when received.",
          "Contenu": "This review score is based solely on the fact no packing slip was included in the initial shipment.I had a multi item order, most of it showed up except for the main item needed. I emailed the company and they did inform me that the item was out of stock and would be shipped when in stock. I give the products ordered a 5 star rating, I give the response from the company a 5 star, however when I received the initial items there was no paperwork showing what was being delivered and what was backordered. This one piece of information could have cleared up the whole issue right from the beginning. This overall is a minor issue and I will be doing future business with the company, their products are outstanding."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "IEW Construction Group",
          "Nb_Reviews": 1,
          "Date": "2020-10-16T16:42:25.000Z",
          "Titre": "Still have not revieved my order…",
          "Contenu": "I received an email with a link to track my order but is doesn't work.  You advertise that orders ship out in I believe 3 to 5 business days. I placed my order a few weeks ago and still have not received it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nate",
          "Nb_Reviews": 2,
          "Date": "2020-05-12T19:54:16.000Z",
          "Titre": "Strobesnmore TruDual 2.0 EFlood",
          "Contenu": "My experience with Strobesnmore was ok. It was the product that under-performed.  I purchased an LED light bar recently and noticed significant condensation on the front lens after the vehicles first wash (normal hand wash - no pressure washer used) that lasted for several days. I contacted strobesnmore and was told that was normal and would not affect the performance of the light bar.  Being that I wash my truck once per week, that will mean that I will most likely always have a condensation issue and it detracts from the appearance of the product. I’ve never had this issue with any other light bar I’ve owned. While the light is impressive in function it is subpar in design and production."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shawn",
          "Nb_Reviews": 1,
          "Date": "2019-10-07T17:17:07.000Z",
          "Titre": "Great product fast shipping but one minor issue :(",
          "Contenu": "The sirens I've ordered havent been installed yet so I cant review them yet but I will soon. The light I received I like and think will work out great. I would honestly be giving a 4 or 5 star review for strobes and more because the price was great and shipping was so fast! But that is where my issue is the sirens and light were ordered as a surprise gift for my sons vehicles so I put shipping address of a friend , the package was sent to my billing address instead of shipping so my son knew what his birthday gifts were and now is waiting till the date I scheduled to have them installed. I'm sure the siren will be just as nice as the light and I will review both at a later date."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kile",
          "Nb_Reviews": 1,
          "Date": "2019-02-09T23:53:25.000Z",
          "Titre": "License plate light materials seem to…",
          "Contenu": "License plate light materials seem to be good quality. One of the lights is out of sync in flood mode and flashes when the others illuminate solid, rendering the flood mode useless. I expect more for the price they charge."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-10-30T20:34:31.000Z",
          "Titre": "Not happy with your customer service",
          "Contenu": "Not happy with your customer service. The product I bought is made by strokes n more them self, he could charge me a small fee to replace the wire from the unit out to the correct length of wire."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Fitzwilliam",
          "Nb_Reviews": 1,
          "Date": "2018-11-01T21:57:16.000Z",
          "Titre": "I purchased the “tailgater” light and…",
          "Contenu": "I purchased the “tailgater” light and within a couple of day being installed on my truck, it was full of condensation.  A couple day later I received a surgery on the item and explained the issue. I heard nothing back. So I waited a couple weeks and still heard nothing. At that point I called to ask what could be done about this issue. I was told I had to removed this light, send it back to be repaired or replaced. This would leave wires not connected and holes exposed to the elements until my light same back or a new one showed up. I find this very inconvenient and feel that since this light was still new, a new one should have been sent to me right away and then I could send the defective one back."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-07-25T01:35:11.000Z",
          "Titre": "Great products but poor customer…",
          "Contenu": "Great products but poor customer service. I bought some items on 07/03/20 but less than 24 hours after I placed my orders, said items went on sale. So I emailed the sales department and the OWNER of the company asking if they can give me some sort of store credits for the items that I bought less than 24 hrs ago or cancel my orders so I can place a new order with the discount price. I got no answer until 3 days later and then was told “if you want a refund, wait for the initial order to be shipped and return the items once I get them so I can get a refund”....all I asked was to give me a store credit of the price difference which was like $50 total and they couldn’t do that. So like I said products are good but customer satisfaction is so so. Hope this help."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-27T22:42:47.000Z",
          "Titre": "The shipping charge was over $100.00…",
          "Contenu": "The shipping charge was over $100.00 for two boxes that weighed 2 pounds.  UPS doesn't even charge that much. It totally cancelled out the sale price."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-08T01:03:49.000Z",
          "Titre": "Lens did not do what I was expecting to…",
          "Contenu": "Lens did not do what I was expecting to do Did not know led lights behind lens are also colored LEDs.No option in notes about LED 900 color issues"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-03T19:57:02.000Z",
          "Titre": "First time customer order",
          "Contenu": "First time customer order:  I placed an order on 12/20/21 and became aware it was the wrong item.  I immediately called and talked with Brittany and she said she would cancel the order so it would not ship since we did place a corrected order. on 12/21/21 I received an email that the order was shipped.  I called and talked with Rebecca and she said that upper management did not see the cancellation and that a free shipping return label would be sent. On 12/28/21 I had not received the return label but but did receive a return form.  I called and talked with MaryBeth and was advised that upper management would not be sending a return label. The item was returned but because upper management failed to see the cancellation of the first order so we will not be reimbursed for our shipping cost to return the item.  I think upper management should do the right thing and reimburse for their lack of communication."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 1,
          "Date": "2019-08-06T14:21:03.000Z",
          "Titre": "Prior to ordering the Strobes N' More…",
          "Contenu": "Prior to ordering the Strobes N' More Dual Color 2X9 Dash Lights, I asked if they would be able to mount to my SUV's rear windows which are flat, and they said they would mount just fine.Unfortunately because of the weight (these lights are heavy) and the angle at which the lights are being placed, the two suction cups which are supplied do not hold the lights in place.I asked customer service if they could send me 8 new suction cups free of charge since I called in advanced and I was told they would mount just fine, but all they would offer is free shipping.In my opinion Strobesnmore could have afforded work with a customer who just spent $931.24 and take a loss of $7.96.To me it's a no brainer and now I wonder if they will actually honor the warranties they offer on their lights."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrew D Waddell",
          "Nb_Reviews": 2,
          "Date": "2021-04-07T00:46:41.000Z",
          "Titre": "Important issue not clearly stated on order page",
          "Contenu": "I didn't realize that they would ship the package to my BILLING address, not my shipping address. They said they don't ship things to people with a different billing and shipping address to help control fraud. When I emailed and included a screengrab of the invoice that clearly showed the SHIPPING address to be different, they said it was in their Terms and Conditions, which I had to click on to complete the sale. I told them that they know as well as anyone that most people don't read that carefully. When I suggested they make the Shipping vs. Billing very clear with a note on the Billing and Shipping page, they pretty much said, nah, tough luck...not gonna do it.So I have a package sitting 2000 miles away that I can't get to for another 2 months until I get there. My last order with them; I've ordered a few of their products before, but not again after this."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-17T14:24:40.000Z",
          "Titre": "I was sent the incorrect lens for the…",
          "Contenu": "I was sent the incorrect lens for the strobe light I ordered.I ordered a red led with red lens and was sent a red led with clear lens"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Judd",
          "Nb_Reviews": 1,
          "Date": "2018-12-08T00:55:56.000Z",
          "Titre": "Return order process sucks!",
          "Contenu": "As fast and thorough as their order process may be, the return process is 10 years behind other vendors. To be stuck with $50+ shipping to and from is rediculous!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-26T15:40:10.000Z",
          "Titre": "Strobe company that doesn’t sell…",
          "Contenu": "Strobe company that doesn’t sell strobes, or strobe accessories.  Only suggestion is to retrofit your trucks with LEDs."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-06-10T06:18:51.000Z",
          "Titre": "When it came in",
          "Contenu": "When it came in,  it  came damaged, a clip that holds the module in came off broken, and one module didn't light up at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-01-03T18:04:56.000Z",
          "Titre": "when am I going to get my refund for my…",
          "Contenu": "when am I going to get my refund for my return, I submitted the proper form with the returned item back in October"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JR",
          "Nb_Reviews": 1,
          "Date": "2020-11-10T15:00:23.000Z",
          "Titre": "Lack of communication to the purchasing…",
          "Contenu": "Lack of communication to the purchasing party! As well as lack of customer service when something was  messed up on there behalf"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "PorkChop",
          "Nb_Reviews": 1,
          "Date": "2021-02-02T18:14:05.000Z",
          "Titre": "SLOW TO DELIVER....took two weeks just…",
          "Contenu": "(EDITED) SLOW TO DELIVER....ordered part on the 12th after they closed... waited 2 days to receive shipped confirmation and called to be told it was delayed due to order system being down I need the part to finish setting up my truck so it could be put to work so instead of being delayed (over a week) in going to work and missing multiple jobs cause of it ... i called Feniex... industries and the shipped me their 4X flasher over night … sure i paid $30 dollars more for the Feniex...  4X Flasher but it was worth it not to lose thousands of dollars cause someone cant look at an order pull the item and put in  a bag with out a computer telling them to do it … thanks Feniex...Strobes  No MoreEdited with correct dates and times: Ordered on the 12th they shipped it on the 14th picked the shipping they stated was \"UPS BESTWAY\" (per the wordings on their site)  received on 21stDont get me wrong product is great ..wound up using it on another set up this weekend but instead of misleading by putting \"BESTWAY\" maybe put it as Slowest....."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2020-05-12T16:38:24.000Z",
          "Titre": "I ordered TIR 3s and LIN 3s were sent",
          "Contenu": "I ordered TIR 3s and LIN 3s were sent. Customer service was helpful and sent me a return label to exchange for the correct item."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2020-06-25T17:08:34.000Z",
          "Titre": "It has been over a month with no…",
          "Contenu": "It has been over a month with no deliverydid receive an email just now station it would be another month before delivery"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jim Bishop",
          "Nb_Reviews": 12,
          "Date": "2021-01-09T00:44:45.000Z",
          "Titre": "I hate having to keep putting my email…",
          "Contenu": "I hate having to keep putting my email to check in only to be told it doesn't match when I only have 1 email"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-19T22:15:52.000Z",
          "Titre": "We were told part was in stock and…",
          "Contenu": "We were told part was in stock and still have not received it. Was ordered 11/5/20 and it is 11/19/20."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kirk",
          "Nb_Reviews": 1,
          "Date": "2020-04-29T19:06:41.000Z",
          "Titre": "Their shipping charges are way out of…",
          "Contenu": "Their shipping charges are way out of range. Needed repair parts and got charged 4X original cost."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas E",
          "Nb_Reviews": 1,
          "Date": "2019-07-16T13:45:00.000Z",
          "Titre": "I ordered a Whelen lightbar with…",
          "Contenu": "I ordered a Whelen lightbar with red/blue LEDs but received a lightbar with just blue LEDs."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott P.",
          "Nb_Reviews": 1,
          "Date": "2018-11-05T00:46:40.000Z",
          "Titre": "Red leds work great on the true duel…",
          "Contenu": "Red leds work great on the true duel color light bar but some of white leds already quit"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-06-26T16:02:41.000Z",
          "Titre": "Disappointed",
          "Contenu": "You tell me I can’t make returns After it arrives at my house and not before I pay."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-10-20T16:18:17.000Z",
          "Titre": "Purchase gone wrong.",
          "Contenu": "Bad service on a purchase and wouldn’t refund full amount of a product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DOUGLAS",
          "Nb_Reviews": 4,
          "Date": "2019-07-13T18:02:20.000Z",
          "Titre": "Fast and convenient service",
          "Contenu": "Fast and convenient service. Products are  Not over priced"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charles Harris",
          "Nb_Reviews": 1,
          "Date": "2018-11-01T17:29:09.000Z",
          "Titre": "Never answered my question I submitted."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Seth",
          "Nb_Reviews": 2,
          "Date": "2020-11-08T17:30:37.000Z",
          "Titre": "Great service and great products."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-16T23:23:37.000Z",
          "Titre": "Waiting 16 days for my order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Knights Towing",
          "Nb_Reviews": 1,
          "Date": "2018-11-02T00:34:02.000Z",
          "Titre": "People who’s work there are rude"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-16T19:44:43.000Z",
          "Titre": "Horrible service"
        },
        {
          "Note": 2,
          "Lieu": "KR",
          "Pseudo": "Byoung Kwon Kang",
          "Nb_Reviews": 2,
          "Date": "2018-11-01T21:20:19.000Z",
          "Titre": "Too late shipping."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2023-01-01T06:12:38.000Z",
          "Titre": "Decent",
          "Contenu": "Good selection, called to verify an order I just purchased... Over $800 and the guy on the phone spoke to me as if I was an idiot."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 2,
          "Date": "2022-07-19T01:11:57.000Z",
          "Titre": "The transaction and delivery time for…",
          "Contenu": "The transaction and delivery time for the beacon arrival was exceptional. The product itself does the job satisfactorily (thought class 2 should be fine in a parade but class 1 would have been better).  The patterns are also easy to change and satisfactory.The concern is the cigarette plug.  Maybe some type of retainer to keep the male and female a little tighter would be helpful.  Zip ties can work but there is most likely a more creative solution out there."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "jalet",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T22:52:13.000Z",
          "Titre": "The new purchase and the strobes were…",
          "Contenu": "The new purchase and the strobes were top notch. These were to replace a pair that quit working in under 5yrs and when I called in, I was told that they were no longer available and there would be no warranty on the old models. Now I know there is only a few months left on the warranty but it shouldn't be advertised as a 5 yr warranty if you don't stand behind the product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Grant",
          "Nb_Reviews": 2,
          "Date": "2022-08-07T23:27:03.000Z",
          "Titre": "I think the strobes are great but the…",
          "Contenu": "I think the strobes are great but the service and general data available on these lights leaves a lot to be desired. Simple things like physical dimensions and accurate mounting data are not available. Called in to get hold of that data and the staff didn’t even have it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matthew Swain",
          "Nb_Reviews": 2,
          "Date": "2022-06-17T20:40:36.000Z",
          "Titre": "Great Products, Poor Shipping",
          "Contenu": "Great products at a reasonable price. However they shipped my order and did not inform me that a signature was required and they had it locked so I could not call UPS and allow them to deliver without a signature. This made it highly inconvenient."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-24T00:27:51.578Z",
          "Titre": "Great products — need shipping update!b",
          "Contenu": "Great products. I’m a repeat customer. However one item from my order wasn’t shipped and I haven’t been able to get an update after several attempts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 2,
          "Date": "2022-04-20T21:48:34.337Z",
          "Titre": "Some items are not in stock for long…",
          "Contenu": "Some items are not in stock for long periods of time. It should say that on the website."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T07:48:15.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping. Feniex fusion 6 has no directions from manufacturer their website is down with instructions. Had to call and have them send instructions which do not match or explain how to hook up. They sent two different instructions sheets for different lights and said you can figure it out. And videos also do not help. Feniex customer service is not helpful either just tell you to look at the instructions on website. It all has to mainly do with the quad converter that has waaay to many wires that should have just been built into the light like everyone else does. F for instructions on wiring."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-07T18:08:55.000Z",
          "Titre": "Just be straight with your customers",
          "Contenu": "I ordered two led lights that I thought were in stock. There was no mention at the time of order that they were not in stock. Only after making a phone call a week after ordering, did I find out I would have to wait at least another 2 weeks before both items might be available. It would be nice know if something is out of stock prior to ordering."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-17T09:05:44.000Z",
          "Titre": "Dissapointed on the customer service…",
          "Contenu": "Dissapointed on the customer service with this order. No like Strobes N More past experiences. Had trouble placing order online, finally placed order by calling in. 1 item arrived as usual. 2nd item is on back order which nobody indicated. Won't have the lights for 2 months. It would have been nice if they could have informed me of the back order when I placed the order. Or at least indicated on the invoice when the first item was shipped that the second item was on back order. They didn't, no mention of any back order at all. This is the first bad experience with Strobes N More."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles Dougherty",
          "Nb_Reviews": 1,
          "Date": "2022-01-17T17:09:15.000Z",
          "Titre": "I was very disappointed in the fact…",
          "Contenu": "I was very disappointed in the fact that I was able to place my order and not 1 single place did it say anything about be out of stock. Not did it say anything about being 2 months out. I would have never known this until I called and asked about it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2021-07-10T23:16:27.000Z",
          "Titre": "lack of communication",
          "Contenu": "I give 3 stars due to the lack of communication. I ordered a full-size lightbar couple weeks ago and haven’t heard anything on long it’s going to take before it ships. I understand it’s a third party transaction and it’s a “special order” product and may take longer to ship but, at least let customers know what that eta will be from the manufacturers. Also, don’t sell these items as they’re in stock if they aren’t. Otherwise my transaction has been okay."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Todd Smith",
          "Nb_Reviews": 1,
          "Date": "2021-07-21T02:09:30.000Z",
          "Titre": "Secure mount issues",
          "Contenu": "The Velcro connections for the strobes n more secure mounts are great, but the double sided tape that connects them to the rubber mount and to the window leaves a lot to be desired, I have already had them fall from the window and peel off from the Velcro.... recommend that their R&D folks find a better solution then 3M tape."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T20:44:25.000Z",
          "Titre": "Decent",
          "Contenu": "The products seem to be great, very bright for a good price. Customer service is great. However, items were left out of my order that should’ve been included, that forced me to have to go to a hardware store and spend more money than I had to. SNM did send me the correct mounting parts eventually for my e66 max and passenger side interior light bar, but it was too late. I would encourage SNM to include a battery connector for wiring as well, as I have to go out of my way to buy that as well."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2021-01-22T19:19:13.000Z",
          "Titre": "Brought these to get installed and the…",
          "Contenu": "Brought these to get installed and the tech was concerned of the legitimacy of the whelen ions. Due to the fact the product code was not correct and their was a sticker correcting the product code on the bag. Although they seem legit and are bright I just have concerns if these did come from whelen. Comparing them to the ions the installer had the codes were different although they were the same lights. Eg IONXB vs IONB (but were smoked)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-09T22:38:17.000Z",
          "Titre": "Mounting brackets never came with the…",
          "Contenu": "Mounting brackets never came with the light. Missed a install I had to schedule two months ago because of this issue. Now I have to wait another month and a half to have lights installed because of this era. Not happy about this. This is the second light I ordered from strobe and more that didn’t come with the mounting brackets."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph Cohen",
          "Nb_Reviews": 2,
          "Date": "2021-01-07T20:44:00.000Z",
          "Titre": "I got the strobes n mores dual color…",
          "Contenu": "I got the strobes n mores dual color interior light bar. - not the greatest patterns - the product does not come with a list of patterns. Why not??- not really what you would expect from a dual color bar (dual color patterns)- very bright thoughi asked if there was going to be sale and they said not anytime soon. Then 2 days after the 2 week return window there was a sale for 60$ off the LB i bought. They said they can't honor it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "C King",
          "Nb_Reviews": 1,
          "Date": "2021-01-26T16:44:42.000Z",
          "Titre": "Always room for improvement!",
          "Contenu": "When you have a rewards program that really doesn't reward large purchasers (PO's: not happy), when you've spend hundreds of dollars on an order and no free shipping (not happy), send sales out on holiday weekends when municipal offices at Fire and Police Departments are closed, so they can't benefit from the sale (not happy), etc.. Note: spend $75 on Amazon and most places on the internet and get free shipping. Otherwise the products themselves are great!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "charles",
          "Nb_Reviews": 6,
          "Date": "2022-03-13T08:43:59.000Z",
          "Titre": "Recently purchased some merchandise but…",
          "Contenu": "Recently purchased some merchandise but only half of my order was delivered.  When purchasing my order the comments stated all items were in stock and ready to ship, but now 4 weeks after my initial order I'm waiting on the second half of my order. Strobenmore did not even offer to compensate me any discount of free shipping off my order. I believe at a minimum they should deduct the shipping cost from my order just because they misinformed me when stating \"All merchandise in stock and ready to ship\". Any decent big corporation would offer some kind of discount or free shipping due to their inability to provide a timely order shipment.Respectfully Deputy C.  Bryla Harris County Sheriff's Office Houston Texas and pround U.S. Army Veteran."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T13:55:21.000Z",
          "Titre": "Liars",
          "Contenu": "Lied about their inventory twice which made me look like a liar to the client. Now they're refusing to give me an itemized return receipt as it appears they only refunded a partial amount."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "NICHOLAS",
          "Nb_Reviews": 2,
          "Date": "2021-03-13T14:35:19.000Z",
          "Titre": "Everything went well for several of my…",
          "Contenu": "Everything went well for several of my orders but I think if you’re a consistent customer and you’re spending 10k a year, you should be allowed free shipping for every order. Otherwise I start shopping around to see who else can compete with slightly higher prices but free shipping"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-01-14T14:17:41.000Z",
          "Titre": "The order was placed a month and a half…",
          "Contenu": "The order was placed a month and a half ago and I have yet to receive any word to what the status is of my order. I’m hopeful the product will be great but little to no communication is being given about the status of the order. The site was very easy to use and order everything I needed"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Grant Mills",
          "Nb_Reviews": 3,
          "Date": "2019-11-13T01:31:17.000Z",
          "Titre": "I would give 4 stars for the products…",
          "Contenu": "I would give 4 stars for the products and pricing, but I have to deduct a star for customer service.  They shipped my order to the wrong address (my order confirmation DID show the correct address) and instead of replacing the order and sending it overnight, they suggested I go try to retrieve it myself. Thankfully, my neighbor was nice enough to drop off the package."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-10T03:23:04.000Z",
          "Titre": "When I ordered this order was under the…",
          "Contenu": "When I ordered this order was under the impression I was getting two stop lights when I got packag6only got one.light only stays on one color not back and forth for both colors"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JEREMY J BORDENCA",
          "Nb_Reviews": 9,
          "Date": "2019-03-18T21:23:26.000Z",
          "Titre": "Incorrect parts #",
          "Contenu": "Product was listed as1 item # on the web page, and what arrived is something totally different. Trying to get the product corrected and get it shipped back in order to get the right one before my fleet vehicle goes on the road  April 1st. Not seeing it happening, since it was made direct and shipped direct from Fenix.Just need a label to ship, not a bar code and get it swapped out ASAP"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Walter",
          "Nb_Reviews": 1,
          "Date": "2019-01-02T19:13:03.000Z",
          "Titre": "Call before you buy online.",
          "Contenu": "Website does not say if items were are in stock. But still “guarantees” shipping within 24 hours. After I placed the order and received no email of confirmation I called and spoke to someone. They told me the items were out of stock and on backorder. I had to order different items to get them in the time frame needed. Was ordered 12/19. Items are scheduled to be delivered today. 1/2."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Terry Castris",
          "Nb_Reviews": 1,
          "Date": "2021-09-27T22:16:14.000Z",
          "Titre": "Like to product but don't like the…",
          "Contenu": "Like to product but don't like the policy.  I bought several LEDs costing a couple of hundred dollars.  They went on sale right after purchase and company would NOT adjust price of issue and credit towards future purchases."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Laz",
          "Nb_Reviews": 1,
          "Date": "2019-10-16T01:36:37.000Z",
          "Titre": "The lights arrived pretty quick BUT Poor Customer service",
          "Contenu": "The lights arrived pretty quick, though one light was damaged and when I requested they ship me the replacement asap they said no they need to wait till they receive the damaged light, and this was a big problem as I had a scheduled installation that could not go as planned because they refused to ship the replacement before receiving the damaged part. Very poor Customer service. BTW I offered to email them an overnight UPS label on my account for them to ship asap. They refused."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2018-12-13T22:51:04.000Z",
          "Titre": "Be Careful",
          "Contenu": "As far as I can tell their products are really good.My experience was this: I ordered an item that was on sale and received a call the next day saying that the item I ordered wasn't available but a similar but more expensive item was available. The price on the more expensive item was still reasonable. After I asked several times they did take $5 off the price but it seems a little 'scammy'. Their shipping charges are unusually high as well."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2019-11-27T23:20:39.000Z",
          "Titre": "Good concept the top panel rattles like…",
          "Contenu": "Good concept the top panel rattles like hell when driving ,should be better cushion between top panel and bottom ,would be better if bolts on back panel where larger connecting top and bottom  ,call strobes and more last week still waiting to hear back ,got sales girl. Got some bugs but good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tractor King",
          "Nb_Reviews": 2,
          "Date": "2018-11-01T17:45:21.000Z",
          "Titre": "Obviously selling quality products with…",
          "Contenu": "Obviously selling quality products with the Whelen brand. Be careful paying  extra for expedited shipping. I payed for two day, ordering on Wednesday, I received it on Monday. I called just to see if I could get a refund just for the extra cost.....no can do I was told. Uh? I wonder if Summit Racing sells Whelen...."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 3,
          "Date": "2019-07-21T14:43:48.000Z",
          "Titre": "Rec'd wrong product",
          "Contenu": "Rec'd. wrong productIt may not be there fault, since the box was marked Blue/Amber on a E-Bar mini bar I just received,  but QA should have double checked to see if actually was.   So for this opinion I marked them as 3 stars.,  all other dealing I Have had with Strobe-N-More has been spot on."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pat",
          "Nb_Reviews": 3,
          "Date": "2019-03-25T12:06:25.000Z",
          "Titre": "Purchasing experiance was fine",
          "Contenu": "Purchasing experiance was fine, very easy, the product was very nice and works great, however I had to replace the supplied magnet with a much stronger aftermarket magnet. Very weak out of the box. They claim its temporary, however as a first responder I dont drive 35mph down a state highway to a call."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2020-06-18T17:22:56.000Z",
          "Titre": "Would have given 5 stars but being my…",
          "Contenu": "Would have given 5 stars but being my slimlighter was defective  (not your fault) and I had to pay to ship it to whelen to get it fixed it replaced and now I don't have a light to respond to fire calls with for an undetermined time, that is why I didnt give you 5."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RD",
          "Nb_Reviews": 1,
          "Date": "2018-11-09T04:09:50.000Z",
          "Titre": "Strobes work great for about 3-5 months…",
          "Contenu": "Strobes work great for about 3-5 months then they started getting moisture inside of the lens.  Within a year three out of the 4 stopped working. I have bought several sets of 4 through this company (several different styles) with about a 40-50 percent fail rate.  When the strobes work they are awesome."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ricardo",
          "Nb_Reviews": 1,
          "Date": "2019-09-20T13:08:54.000Z",
          "Titre": "Great dash light, not so great suction cups.....",
          "Contenu": "Got the dual color 2x9 amber/white dash light and can honestly say that the lights are bright and work great and the price is reasonable. However the suction cups are not the greatest, the lights keeps coming off my windshield and find my self having to reinstall just about every day even though I cleaned my windshield very good. Trying to find a way to permanently mounted in the center below my rear view mirror. Don’t know if there is a bracket for that. Can’t lay it on my dash cause the light gets hot. Other than that I would of given it a five star."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Newmans Medical Services",
          "Nb_Reviews": 1,
          "Date": "2018-11-02T17:46:15.000Z",
          "Titre": "Warranties are not worth it",
          "Contenu": "Warranties are not worth it, to much trouble to have to go to someone else to get it replacedWhelen 900 led called y’all and you sent me to whelen where I had to pay them $309.00 to get another one till I paid UPS to send it back and still have not received my money back are a new light"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2019-02-11T05:08:25.000Z",
          "Titre": "Strobe n more is just ok",
          "Contenu": "Strobe n more is just ok, they have a good selection and decent prices but their shipping both cost and speed is poor.Replying to strobesnmore it doesn’t cost $19 to send 4 lightheads across the country in my experience, I expect you have a corporate account which increases the discount. All my orders have taken several business days to even ship, then 5-10 days to arrive. Your competitors do shipping better and are my first Reccomendation to others.  You have some niche products that are great. Great opportunity to improve. And thanks for the reply."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Ack",
          "Nb_Reviews": 3,
          "Date": "2018-11-01T19:42:57.000Z",
          "Titre": "Lights are good, info accuracy not so much",
          "Contenu": "I bought two of the snm triple threat lights. The website said they could be custom made (I wanted red, white and blue since I do a ton of parades) only to be told it couldn’t.  I was in a rush so I got the red/blue combo.  The lights are excellent but the yellow synch wire was so short that it was nearly impossible to get them together. I emailed them to find out what type of wire I could use to link them, never got a response. The quality of the lights are good, but they should update the website for more accuracy if something cannot be custom."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gene Smith",
          "Nb_Reviews": 3,
          "Date": "2018-11-02T00:44:38.000Z",
          "Titre": "There was no follow-up to my order…",
          "Contenu": "There was no follow-up to my order notifying me of shipping/delivery.  I had to call several times to find out status.  It took over a month to get some parts and their customer service person ( a male) was brash at best.  They do typically have fair prices but service is lacking."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carlos",
          "Nb_Reviews": 1,
          "Date": "2020-01-07T12:47:57.000Z",
          "Titre": "product is good",
          "Contenu": "product is good, but i don't find helpful videos to install it my self it is hard to find people to install it, in my opinion need to make videos and post on website easy to find to install a expensive product, finally i figure how to install it by my self but it was really hard to me find the use of the yellow wire because the pdf document which have the specification of installation, don't explain the use for it. believe or not i went on 4 different types of mechanics which they know about car electric systems, 3 of them refuse to install it, one of them try to charge me 600 dollars labor only."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jim Bishop",
          "Nb_Reviews": 12,
          "Date": "2019-01-15T00:36:54.000Z",
          "Titre": "Optimistic",
          "Contenu": "I like their service and some of their products but where they try to get you his offer you a deal on something and then when you go to check out and see the price on the shipping you're not saving anything that's my opinion and the return policy sucks"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "greg",
          "Nb_Reviews": 1,
          "Date": "2020-06-07T19:37:19.000Z",
          "Titre": "should of been 5 star",
          "Contenu": "i love everything about the bar light,electrical pre-wired,patterns are easy to use Controller is perfectly laid out and easy to use. .very bright day or night. However the controller wiring is very very fragile. Main power lead fuse probably 20 gauge wire is actually soldered to control board and loosely placed in back of box. It will absolutely will fail in time if you don't break it during install. Be very careful if you have to change fuse.Be extremely careful during install the wires on back of control box are very small and fragile to say the least.This light bar should  be a 5 star it is excellent except for control wiring."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 5,
          "Date": "2019-08-16T05:09:19.000Z",
          "Titre": "Don’t special order",
          "Contenu": "Well, I mistakenly ordered “special order strobe, and it’s been 3 weeks and counting still nothing. It has to come from factory. I could have installed photo eye. Can’t cancel order. Strobes and more is a good outfit just don’t get special order items"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2019-12-23T14:19:41.000Z",
          "Titre": "I ordered two items this time.",
          "Contenu": "I ordered two items this time. One arrived and the other is still on back order. I was never offered anything other than  to wait longer. No refund option or possible substitute. Not that I would take either but no other solution was offered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-25T19:35:04.000Z",
          "Titre": "Products seem quality",
          "Contenu": "Products seem quality, however they are not the most moral company. They don’t like to honor advertised discounts, even when the discount is sent directly to your email from them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Guest",
          "Nb_Reviews": 3,
          "Date": "2020-12-27T16:24:00.000Z",
          "Titre": "I feel that some of the strobes listed…",
          "Contenu": "I feel that some of the strobes listed don't have proper explanations of their functions. I ordered the whelen strip light plus warning light but wanted the sequence version. I thought, by the description given, that there was a compartment light version and the other was a warning/sequence version. it wasn't until after I received the lights i noticed that it was just a warning light. I listed them on a fb website and it seems a lot of ppl thought the same thing as I did, as they sent me the listing from ur website, and were confused. ur listing does clarify the difference but with the descriptions being merged together its unclear or confusing that these come in 3 different models."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Timothy Hastings",
          "Nb_Reviews": 2,
          "Date": "2021-09-03T14:30:06.000Z",
          "Titre": "Ordering was fine shipping is not.",
          "Contenu": "Ordering was fine, had some problems with PayPal but that is not your fault.  My issue is with getting the item I ordered.  I ordered and paid for is #M08T-RBRBR, an emergency light array for a Harley.  After 2 weeks of hearing nothing from you I called and was told that the estimated shipping date was going to be October 31 which is 3 months AFTER I placed the order.  I know you call this a custom build but you did not list what a standard build was.  As I told you before, once I receive, if I receive the item I have to remove the red and blue lights and replace them with white and amber because that is not part of your selection.  You would not ship it without lights in it so I had to make a choice.  Anyway my problem is with the shipping time, 3 months is ridicules."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jerry Lincoln, All Sweep, Inc.",
          "Nb_Reviews": 2,
          "Date": "2020-01-01T21:05:15.000Z",
          "Titre": "Terrible warranty service",
          "Contenu": "Great place to purchase lighted warning devices. But if you need warranty Stobes & More will refer you to the manufacture which sucks since your purchase was made through them. This makes warrant claims very difficult..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Af",
          "Nb_Reviews": 2,
          "Date": "2019-11-02T19:25:00.000Z",
          "Titre": "Ordered special item still waiting for…",
          "Contenu": "Ordered special item still waiting for it to arrive i was on time schedule with install for plow vehicle to be inspected by municipality now have to wait hoping no snow storms until it is installed or customer cannot plow"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pikemedic9",
          "Nb_Reviews": 1,
          "Date": "2020-08-14T22:18:32.000Z",
          "Titre": "The product was great but I gave 3…",
          "Contenu": "The product was great but I gave 3 stars because the shipping was entirely too high. Shipping was almost as much as the product. I had to pay the shipping because I could not find the product anywhere else."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles Coulter",
          "Nb_Reviews": 2,
          "Date": "2019-05-28T20:29:44.000Z",
          "Titre": "Prices are good but getting technical…",
          "Contenu": "Prices are good but getting technical install advice was not.Incoming receptionist was not very friendly and though technician was pleasant enough he did not offer much assistance with questions regarding installation."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Intlenus",
          "Nb_Reviews": 1,
          "Date": "2020-11-30T01:55:21.000Z",
          "Titre": "I would have given five stars but the…",
          "Contenu": "I would have given five stars but the Instructions included with this kit were terrible. I own a 2020 F350 and this kit says it is compatible with 2017-2019 but I bought kit for 2020. It turns out that they are the same but all of the messages I left with Strobes and More went unanswered and I had to figure this all out on my own.  So I went online and found the same thing, one terrible 2 MINUTE video that didn't explain anything and and just showed clips of some guy plugging stuff in with much explanation or close up shots of the panels.   Once I had it installed, 8 hours later, It all worked great and I'm impressed with the quality of the product, BUT, COME ON GUYS this is the world of Youtube, pull your head out and make a decent video."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jonathan R Goodwin",
          "Nb_Reviews": 2,
          "Date": "2018-11-12T23:52:59.000Z",
          "Titre": "I recieved the product very fast and…",
          "Contenu": "I recieved the product very fast and was very happy about the delivery time. But the product leaked water all over the inside of my truck when it rained out. I contacted strobes n more and never got a response back."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anne",
          "Nb_Reviews": 4,
          "Date": "2020-01-14T17:12:23.000Z",
          "Titre": "Just Okay For The Price",
          "Contenu": "I bought the blue light for my son. It's powerful for such a small product. My son, though, felt it's not well-made, and a part of it had already separated from the housing. He kept it anyway."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dean",
          "Nb_Reviews": 4,
          "Date": "2020-04-26T19:19:28.000Z",
          "Titre": "PAID UP FRONT then waiti 7 weeks",
          "Contenu": "Stilll awaiting balance of order from supplier to StrobesNMore to me. Invoiced and fully paid 3 weeks ago, with another 4 weeks to wait,  Unusual to pay for something not even available."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Catherine",
          "Nb_Reviews": 2,
          "Date": "2019-10-30T22:39:20.000Z",
          "Titre": "Like the light",
          "Contenu": "Like the light, but the suction cups will not stay stuck to the windshield and the right side white light stays on when the white or blue sis is selected.  I will try return the light."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2018-12-16T11:50:09.000Z",
          "Titre": "The shipping could have been smoother",
          "Contenu": "The shipping could have been smoother.  Initially they calculated $17 shipping  ( UPS ground ) from Rhode Island to NJ, on a switch I was ordering which was under $20, and maybe a 1/4 pound in weight!  After contacting customer service I received a “ship free” code to apply to the item at checkout.  There were also no updates on the package or tracking number tied to my email.  I work on the road quite a bit and find the arrival information vital, especially when the item ordered is holding up the installation of a warning light beacon.  The problem is most of us are use to dealing with Amazon which almost gives too much “update” information.  The item was packaged well and in pristine shape.  Other than the shipping policy, I like the products Strobes and More sells.  Hope this helps"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-03T14:02:56.000Z",
          "Titre": "LED lights late",
          "Contenu": "Never was notified that the item was on back order. I had to reach out after receiving my order. Also paid for 2 day shipping. It took 3 days to receive the package."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Coble",
          "Nb_Reviews": 2,
          "Date": "2020-12-31T02:20:03.000Z",
          "Titre": "Wasn't able to score real high due to…",
          "Contenu": "Wasn't able to score real high due to no info at all on my item being shipped. Didn't know it was coming today but it did. Need more communication."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "C.J.",
          "Nb_Reviews": 2,
          "Date": "2019-04-30T16:15:00.000Z",
          "Titre": "Poor customer service policies, average products.",
          "Contenu": "No price protection policy is a poor way to do business. When items go on sale less than 10 after a purchase, reputable companies will refund the difference."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Freddie",
          "Nb_Reviews": 1,
          "Date": "2018-12-01T04:28:19.000Z",
          "Titre": "It was shipped to the payment address…",
          "Contenu": "It was shipped to the payment address and not the ship to address. The original label says the shipping address but someone made one go over the original one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joy",
          "Nb_Reviews": 1,
          "Date": "2020-05-19T21:30:41.000Z",
          "Titre": "Could never get to speak to anyone.",
          "Contenu": "Could never get to speak to anyone.. think your return policy  is too strick,just got ahold of someone to install lights hoping they will work....."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-31T22:26:45.000Z",
          "Titre": "Some of the switch lights did not work",
          "Contenu": "Some of the switch lights did not work. 2 out of 4 of them didn’t work. Light is nice, just a shame."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2020-04-29T16:43:12.000Z",
          "Titre": "Put a review on Facebook",
          "Contenu": "Put a review on Facebook.You can not buy parts for lightbar if it gets broke and it's your fault. Will not spend money with them again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2019-11-18T17:14:00.000Z",
          "Titre": "I would rate 5 stars except one of my…",
          "Contenu": "I would rate 5 stars except one of my orders is going on 3 and a half weeks. Exceptional customer support and awesome products/service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-25T17:16:47.000Z",
          "Titre": "The suction cups on the lights don't…",
          "Contenu": "The suction cups on the lights don't stick for long. After 10- 30minutes they fall off. Not overly happy with them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-20T17:59:40.000Z",
          "Titre": "After many years of purchasing…",
          "Contenu": "After many years of purchasing equipment from strobes N More, I have to say I was extremely disappointed in the last order I placed.  I purchased a Havis console over the phone during which time I gave the customer service representative the type of radio, siren, Etc. that was supposed to get mounted.  She looked up the bracket numbers advising me the brackets should fit the application.  When I received the console, only one of the three brackets were correct.  When I called customer service, I was told they could not do anything about it that I would have to purchase the correct brackets for approx. 40.00. (AFTER JUST SPENDING 400.00 ON IT) I than explained that I was not that one who gave them incorrect part numbers and the 400.00 console I just purchased will not work with the brackets I was given.  I was than told I would have to contact Havis to resolve the issue.  I did contact Havis and they sent me the correct brackets and extra filler plates at no charge.  What really disappoints me the most is that I just recently spent SEVERAL THOUSAND DOLLARS with Strobes N More equipping two vehicles with lights, sirens and other equipment."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 5,
          "Date": "2019-09-19T20:03:08.000Z",
          "Titre": "Shipping cost too high",
          "Contenu": "Product itself is great, but I thought shipping rates were too high to Hawaii. Other websites were 1/4 the price."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shopper",
          "Nb_Reviews": 1,
          "Date": "2019-12-14T00:57:23.000Z",
          "Titre": "Great products and service but shipping…",
          "Contenu": "Great products and service but shipping is RIDICULOUSLY overpriced. $45 to ship 8 hideaways to CA? Really guys?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dolly A",
          "Nb_Reviews": 1,
          "Date": "2020-03-04T23:10:15.000Z",
          "Titre": "Took a VERY long time to receive my…",
          "Contenu": "Took a VERY long time to receive my order. I had to talk with the live chat to get a status on my order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-24T00:30:53.000Z",
          "Titre": "Cables are not long enough",
          "Contenu": "I have Ford Escape. The cables with strobe kit are not long enough. I have to order extension ones."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "American Student Transportatio",
          "Nb_Reviews": 3,
          "Date": "2020-12-14T22:05:02.000Z",
          "Titre": "room for improvement",
          "Contenu": "Customer service can be lacking at times I have dad to go to the manufacturer for direct service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Don",
          "Nb_Reviews": 10,
          "Date": "2019-04-02T20:20:39.000Z",
          "Titre": "Shipping costs unreasonable",
          "Contenu": "Shipping costs unreasonableOrdering a $3 plug should not be so much for shipping. Quick service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jenna",
          "Nb_Reviews": 1,
          "Date": "2019-12-14T18:31:36.000Z",
          "Titre": "STILL Have not received my products…",
          "Contenu": "Have not received my products nearly 2weeks after order date, so 10 business days which is the longest it says will take on their policy. Never received a “hey your products on back order” email to even give me a status update!! For expensive products thats ridiculous. spoke with support about the status of my shipment and they told me “sorry should be there soon, black friday causes shipping backups” totally understandable but an email regarding this matter should of been sent... few days later still have not received my products so I call support, they now inform me the products I bought are sold out... seriously?!!! Bought them weeks ago and no one thought to follow up with me after spending close to $200 on their site that my products are not available, thats so inconsiderate of the customer. They offered to send me different brand products for the sold out ones which was an acceptable solution, but the entire process to reach this solution will make me make sure I do not buy anything of greater value like I did again, just ridiculous that with the amount of money i spent no one thought to inform me about the status of my order at any point time, have used SNM one other time and had a great experience, this time around not so much. Very annoying!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-01-11T19:07:52.000Z",
          "Titre": "THE ONLY THING IS I HAD A BAD TAIL…",
          "Contenu": "THE ONLY THING IS I HAD A BAD TAIL GATER AND IT COST ALOT TO SEND IT BACK UNDER WARRANTY"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "424 Warning Systems",
          "Nb_Reviews": 2,
          "Date": "2018-11-01T17:31:06.000Z",
          "Titre": "Customer service was less then helpful…",
          "Contenu": "Customer service was less then helpful and somewhat talked down to me as if I was bothering them"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2020-01-06T02:43:52.000Z",
          "Titre": "Lights",
          "Contenu": "Did not send the right lights and the case cracked on them. They were the atomic cab lights"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-08-03T21:49:17.000Z",
          "Titre": "I’m waiting very long for an update on…",
          "Contenu": "I’m waiting very long for an update on my order and I can’t see it online in my account"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "thekreal",
          "Nb_Reviews": 7,
          "Date": "2022-02-13T01:37:20.000Z",
          "Titre": "Great product, took a while",
          "Contenu": "Great product, terrible wait time, but it was worth the wait."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tyler dartez",
          "Nb_Reviews": 2,
          "Date": "2021-01-16T09:14:30.000Z",
          "Titre": "I like the wiring I received",
          "Contenu": "I like the wiring I received.  Did not like the main insulation was white."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joshua",
          "Nb_Reviews": 1,
          "Date": "2019-09-22T16:15:10.000Z",
          "Titre": "They say cheapest around guaranteed",
          "Contenu": "They say cheapest around guaranteed. But the shipping is ridiculous in price."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-05T11:32:01.000Z",
          "Titre": "Still waiting for a response on my…",
          "Contenu": "Still waiting for a response on my missing lights from my last order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "UNIVERSAL SECURITY LLC",
          "Nb_Reviews": 1,
          "Date": "2020-09-02T14:05:13.000Z",
          "Titre": "I preferred a more change of colors and…",
          "Contenu": "I preferred a more change of colors and lights within the headlights."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andy D",
          "Nb_Reviews": 1,
          "Date": "2018-11-09T11:36:26.000Z",
          "Titre": "Sliver/ Sliver II",
          "Contenu": "I purchased multiple lights from Strobes n More. When I had a issue with one of my Slivers, they sent me a replacement, as to their 5 yr warranty, unfortunately they sent me a updated Sliver II model that would not work with my other 3 Sliver lights, forcing me to purchase 3 more Sliver II's. When I asked if they would discount the others because I was forced to purchase them, they refused. After having the Sliver II's in my vehicle for 2 months, I had a issue with 2 of the new Sliver II's. After sending them back, they told me nothing was wrong with them and sent them back to me. After rewiring my truck and putting them back in, as per Strobes n More, they still didnt work properly. Calling back again and sending them back, they stated nothing was wrong with them. They finally, after me sending 2 more back, they replaced 2 of the Sliver II's with E6 Slims and discounted 2 other E6 Slims for me. My complaint is I had to do all the labor and time to install and uninstall these lights multiple times. Imagine if I had to pay someone to do all that labor??? It would have costed me a arm and leg!! Also I am out of a lot of money with Sliver and Sliver II's I am not using. Thank god the different person I talked to the 3rd time gave me 2 E6 Slims for free as a warranty and a discounted price to purchase 2 more E6 Slims. I believe they had a issue with the Sliver lights because they are discontinued now, and being replaced with the E6 Slims."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 2,
          "Date": "2019-04-30T18:20:34.000Z",
          "Titre": "Product is quality",
          "Contenu": "Product is quality, but not in the configuration that I ordered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Grand Teton National Park",
          "Nb_Reviews": 2,
          "Date": "2018-11-09T14:50:28.000Z",
          "Titre": "Just got this light bar on Nov 8th…",
          "Contenu": "Just got this light bar on Nov 8th after calling them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-06T14:32:58.000Z",
          "Titre": "Good products",
          "Contenu": "Good products. Slow processing and shipping."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Zachary",
          "Nb_Reviews": 1,
          "Date": "2020-05-02T04:45:10.000Z",
          "Titre": "You didn’t sent the right light bar…",
          "Contenu": "You didn’t sent the right light bar mount"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Charles",
          "Nb_Reviews": 1,
          "Date": "2020-05-26T14:08:31.000Z",
          "Titre": "Nice people that's all I can say"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Travis",
          "Nb_Reviews": 1,
          "Date": "2019-09-12T19:16:15.000Z",
          "Titre": "E beacon",
          "Contenu": "I bought the E beacon lights for my truck. I work in the asphalt business therefore I spend my days in the road. Though these lights are on the more affordable end. Because they were made by strobesnmore I assumed nothing but the best. I’ve been extremely happy with every other product I’ve purchased but sadly these lights were sub par. They cannot be seen on sunny days which didn’t work for me. I’m not knowledgeable on the differences of classes of lights but these ones just aren’t bright. I contacted strobesnmore. They offered to have me send them in to look at them to make sure they were working properly. I can’t go without lights. Asked to replace them or exchange for a better light and I’d be happy to pay the difference. The owner of strobesnmore sadly wouldn’t help with any of that and from there I haven’t heard back since. So my advice would be to really know what your buying before making the purchase. Unfortunately due to this situation I will not be making anymore purchases with strobesnmore. They make false claims like this reply below that they tested my lights. I sure don’t remember sending my lights that I purchased from you in for you to test them? When did that happen? What good would testing any other light than the ones on my truck? Why would you want to resell these sub par lights to someone else anyways? Why is it my fault you sold me these lights that don’t serve the purpose? Like I said make sure you know what your buying before you purchase from strobesnmore because this is what you deal with if it doesn’t work properly or perform to proper standards. What a nightmare, I’ve wasted more time than it’s worth on this. Bought new Whelen beacons and won’t have to worry again. My complaint was they were dim and couldn’t be seen in the daylight. Did you test my lights or ones you had there? There’s no sense in wasting time with this and going back and forth. It’s my fault for not not testing each one before I brought them to be installed I guess. Guess it’s my fault I bought them and I’m not happy with them. Just would of expected a better outcome. Hence why I say to make sure you know what your getting from strobesnmore before you have them installed. Have a nice day."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "rick",
          "Nb_Reviews": 1,
          "Date": "2019-02-26T21:22:04.000Z",
          "Titre": "Decent product at a fair price."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2018-12-11T01:13:16.000Z",
          "Titre": "Suction cups don't hold"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2019-04-23T01:21:19.000Z",
          "Titre": "Outrageous shipping"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Leo911",
          "Nb_Reviews": 1,
          "Date": "2020-08-31T15:06:41.000Z",
          "Titre": "Poor customer service reps but was fast on shipping.",
          "Contenu": "I placed a order within the last 2 weeks.  The turn around time was spot on and the order shipped out to me quickly.  If I could rate only the products availability and getting my order fast it would be a 5 star scored review.However, that is not the case.  The online strobes n more website offers online chat.  The chat/service/answering questions and overall attitude of the rep via chat is useless. I was browsing the site on several different occasions compiling my order.  I had a few questions to be clear on some products, compatibility etc..  I always got the same female by the name of Sarah.  Sarah was not just unfriendly every single encounter with short 1 or 2 word responses but mid first question she vanishes.  She then almost answered 1 question then silence again for 10 + mins.  It’s always bad service when a customer is trying to spend their money yet receives a rep that is in and out of the conversation with no explanation as to why.  It’s obvious she is distracted by something else.  Once in dialogue with a customer on chat It should be treated just as I was on the phone speaking to her.  Unfortunately this is not the case.  In chat going over some products and she goes silent.  I am literally saying “Hello? Can I get some help with my order please?”  More silence then a “Tech”? person chimes in to tell me that Sarah answered the phone from a customer”(??)  However, I am a new customer trying to put a order together to place right then and I even said that.  So I got bypassed by the phone?  I do not understand why a chat box automatically pops up on the website offering to help you but you get dropped if the phone rings?  This is a huge waste of time for the customer.  I needed about 7 items on my initial first order of many to come.  I patiently waited a good 30 minutes needing some answers prior to placing a order.  Sarah never came back, no follow up message, nothing at all.  I was over it so I picked a product I was familiar with and purchased that item only.  The customer service rep was too busy to help me even though I was chatting with her before the phone rang from someone else.  I am very understanding if employees are only 1 or 2 at the phones and chat.  Most customer service reps would apologize with a brief explanation of their situation.  Also giving some idea of when they could help you.  Perhaps she would suggest to call me.  Sarah just vanishes without a word.  Long story short I purchased the one item for $300+ and went to another dealer who knows how important good service is.  He helped me right away, good attitude, very informative, took his time to answer any questions and he gave advice on how to make things run smoothly.  It took less than 30 minutes.  I was not dropped for another customer, ignored, no vanishing acts or any of that method of treating customers.  I have since made 4 purchases with that same competitor with no issues at all.  I possibly may buy another product again from strobes but It would have to be a product I know well.  However, if I get Sarah I will not waste any more of my time like I have already."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jake N.",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T02:00:41.000Z",
          "Titre": "Great American service",
          "Contenu": "The buying process is straightforward, the prices are competitive, and the shipping is decently fast. One thing that I wish was different was the shipping price. I believe they must have a contract with UPS which doesn't allow them to ship with any other company. If they were able to ship with USPS, the shipping prices would be much more reasonable. I also believe that shipping with USPS would have been faster for a cheaper price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chief Denny Baynham",
          "Nb_Reviews": 1,
          "Date": "2022-04-27T01:49:22.350Z",
          "Titre": "What I ordered was fine",
          "Contenu": "What I ordered was fine. When I called a few days later to order two faceplates for our KenWood radios I was told I would have to get the faceplate model so y’all would know which ones I would need to fit in our Havis console. I said I had the model number of the radio, but was told I had to get the model number for the bracket from Havis. So I went to somewhere else to order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tbird",
          "Nb_Reviews": 2,
          "Date": "2022-06-10T01:14:54.000Z",
          "Titre": "Everything I ordered arrived incredibly…",
          "Contenu": "Everything I ordered arrived incredibly fast and just as described! The LED Tailgator left a little to be desired in terms of brightness in the daylight, but I suppose if they had tried to put some sort of magnification optics in it, it would not fit very well in the designed location."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-02T21:53:49.000Z",
          "Titre": "Really like the dual colors amber for…",
          "Contenu": "Really like the dual colors amber for my plowing and the red for the fire dept. much brighter than my old strobe. I would have liked a longer cord  I was not able to route the cave properly. In my Silverado. An extra five feet would have mage a large difference. I like the strobe."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Austin",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T19:11:38.000Z",
          "Titre": "Great products and customer service overall",
          "Contenu": "Nothing to complain about really, just wish it would have been free shipping for the amount of money that was spent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RM",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T18:51:59.000Z",
          "Titre": "I used their gear primarily to retrofit…",
          "Contenu": "I used their gear primarily to retrofit a partially de-commissioned CVPI for security work. The hide away strobes were easy to install and are very bright. I do not know if the supplied gaskets keep out moisture, they are a cushion type material not rubber. There is some fogging in both headlight lens that was not there before the install. It should be noted, I used new OEM replacement headlights for the install. If you are running the control boxes in the trunk you have to buy an inordinate amount of extensions (8) at 9 bucks a pop to make it work. I had to get one extension to just outfit four hide aways in the rear reflector assembly and tailights, for a control box ALSO located in the trunk, which is ridiculous. The base set of wiring for each strobe should be 12 feet at least. This change would have eliminated half my extension purchases. The extensions have a nice shielded (easy to pull) individually wrapped hot and ground wire with a proprietary connection link. The shadow siren/light controller is fantastic and does a lot at its price point. I have divided the lights up on the supplied four switches A. rear (4 hideaways), B. Front (4 hideaways), C. (front amber x2 in grill), D. red/blue front grill. Siren tones are crisp and the PA function is clear through the siren that came on the vehicle. The remote function on the Shadow allows you to mount the control box out of the way in the trunk. You can then run the supplied (16 ft) RJ11 to the driver's seat where you plug in the handset. The handset itself is made with thin plastic, so I do not know how durable it is. I did not see replacement handsets on sale. You may need one during the life of the unit. Since the handset is so thin, I am scared to try to use the magnetic mic holder I got from SandM for fear of drilling into a vital component and voiding the warranty. I called their tech guys with a question regarding the 2 power inputs into the siren controller, and if they could be hard wired from one line from the battery. When pulling the wires back I had not anticipated needing 2 power lines to power one controller. Maybe it is necessary if you are running 2 sirens or siren/growler. Only one of the power inputs has a fuse on the line and BOTH should come with a fuse in a plastic housing based on that conversation. In all great customer service and tech support."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Travis",
          "Nb_Reviews": 2,
          "Date": "2022-03-05T03:33:38.000Z",
          "Titre": "Strobes n More has great products",
          "Contenu": "I like Strobes n More and love their products. They have some of the brightest lights on the market with a great warranty. Only reason not 5 stars is I do feel that some of the smallest items and accessories are overpriced. L brackets for mounting grill light is an example of one. The only other complaint is no free shipping. Free shipping should be offered once your have purchased a certain amount like $100 for example."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-01T17:16:52.000Z",
          "Titre": "Just installed on my 18 f-250",
          "Contenu": "Just installed on my 18 f-250 and to say you need to be a flexible person is an understatement but I finally got everything plugged in. Works great on my truck and haven’t had a chance to go through all the patterns. My only major complaint is it’s not working my trailer lights. I may be dreaming but was under the influence that this did the trailer lights as well maybe I’m wrong."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wayne",
          "Nb_Reviews": 2,
          "Date": "2022-03-02T18:02:28.000Z",
          "Titre": "Finally Found one",
          "Contenu": "I have been searching for this product for quite some time. I had one before that I got from Tractor Supply but couldn’t find it again (sold the vehicle). I’m glad I could find through Strobes and More. My only issue was that the remote battery was dead and I needed to go purchase one to test the unit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-08T22:01:38.000Z",
          "Titre": "The only issue I had was in payment",
          "Contenu": "The only issue I had was in payment. I evidently put in some incorrect information and my credit card was declined. I didn't know it was incorrect information.  It would have been helpful if it would have told me.  Instead I had to call and wait for someone who told me in a matter of seconds that the billing zipcode was wrong.  Not a big problem but if the page would have told me that I could have correct it and avoided a phone call and spending 15 minutes to get 5 seconds of information"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T16:56:05.000Z",
          "Titre": "Strobes n more E6 Duel",
          "Contenu": "Strobes n more E6 Duel.  Great light.  Well constructed very bright, love the combo optics.  Great value.  Only 4 stars because I would like to be able to sync in alternating colors, i.e. one on color A and the other on color B.  Apparently with the duel color version you can only sync on the same color.  When I call to confirm this capability they said if it doesn't say you can do it in the manual it isn't possible. Not much help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BARUCH  SIROTA",
          "Nb_Reviews": 2,
          "Date": "2022-01-11T19:50:21.000Z",
          "Titre": "All products are very bright especially…",
          "Contenu": "All products are very bright especially the ILB is so bright and such nice patterns. Customer service for technical is not the greatest. If they answer then they don't know too much or the voicemail they won't call back but I'm very happy with all their products that i bought so far"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-09-04T08:27:08.000Z",
          "Titre": "I like my new light",
          "Contenu": "I like my new light. I just wish it was about 1 1/2-2in height with the same brightness. Now I'm just waiting for Strobesnmore to come out with a traffic advisor with a cigarette plug in with about a 10-12ft cord. I highly recommend Strobesnmore, but the shipping was slow but don't think that it was there fault. Also there shipping is not free like all the other places."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill G",
          "Nb_Reviews": 2,
          "Date": "2021-08-24T18:36:33.000Z",
          "Titre": "The two sets of Surface star lights and…",
          "Contenu": "The two sets of Surface star lights and the E64 light bar where just as advertised. Very happy with all the lights I have gotten from strobes and more so far.  The only con is I wished the installation directions had the amp draws for the lights noted as this would have helped with selection of the correct size wiring and fuses needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randy",
          "Nb_Reviews": 1,
          "Date": "2021-04-26T21:55:51.000Z",
          "Titre": "Initial order was incorrect",
          "Contenu": "Initial order was incorrect, ordered 2 lights only got one.Contacted Customer Service and was informed the order had to be reviewed.   I was relieved/pleasantly surprised when I was informed it was an error on your end and my order was filled.I know in today's world there are many scammers, but not being brought up that way I was worried this was going to end up being a hassle.Glad we both got good results."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chief Johnson",
          "Nb_Reviews": 1,
          "Date": "2021-08-07T17:45:19.000Z",
          "Titre": "High hopes, then let down",
          "Contenu": "So I bought the triple threat dual color light, it is indeed dual color but you can't flash both colors together. It should say \"Single Dual Color Triple Threat\" which if it was dual color flashing together I was gonna do my whole fleet with the triple threat, however it seems that strobes more are behind in time, in making dual color flashing lights. The only thing I wasn't disappointed with is in how bright it really was, I was impressed until both colors couldn't flash together"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Weinberg",
          "Nb_Reviews": 4,
          "Date": "2021-11-03T16:49:15.000Z",
          "Titre": "The product looks good",
          "Contenu": "The product looks good, though I have not installed it yet in my experimental aircraft. The technical support was grumpy: I had to really lean in to try to find out what the width of illumination is for the surface star light--nobody on the staff knows! They should know--it's easy enough to figure out, and it's a valuable metric for a light that's used for illumination or visibility. I did get useful advice to include a 5 amp fuse on the circuit. I think you have made a good product and want to support it. Lewis's videos are helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 4,
          "Date": "2021-07-24T00:39:37.000Z",
          "Titre": "While I haven’t purchased a lot from Strobes…",
          "Contenu": "While I haven’t purchased a lot from Strobes N More, I have purchased lights on a few occasions. So far, I haven’t had any issues with their service or their product (3 of the 4 items I’ve purchased thus far have been Strobes N More branded) and until something changes, I’ll continue to do business with them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-14T20:27:17.000Z",
          "Titre": "Dual Threat LED Blue Light",
          "Contenu": "Recently signed on at my local volunteer fire department and needed a blue light. Decided to order the Dual Threat blue light to get me started. Absolutely love the light,  but the little suction cups for easy mounting are basically garbage,  they won't hold no matter what I do,  Otherwise this light would have gotten a solid 5 stars ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-03T15:56:27.000Z",
          "Titre": "Acari F150 Low Profile Steel Strobe…",
          "Contenu": "Acari F150 Low Profile Steel Strobe MountMy order processed and shipped quickly. The product met all expectations, however installation instructions could be clearer. The written instructions are not specific to vehicle, but are written with a broad brush for many makes and models. But with a little bit of common sense and referencing an online installation video for a different model truck, I was successful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Henry",
          "Nb_Reviews": 1,
          "Date": "2020-12-29T16:22:21.000Z",
          "Titre": "Ordered 8 photon",
          "Contenu": "Ordered 8 photon, 2 cobra, 2 atom 60, and a tail gator. Strobes are great. Wish they all were wired the same way. Became a bit confusing because there were 3 different ways the strobes were wired by color. To make them all work together off one controller proved to be slow moving to make sure it was done right. But the strobes are very bright."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Catherine",
          "Nb_Reviews": 4,
          "Date": "2020-10-08T20:04:32.000Z",
          "Titre": "Thanks for delivering the light we…",
          "Contenu": "Thanks for delivering the light we needed quickly and efficiently.  Our only problem was that we needed a red optics style lens on the light, to match the other side of the fire truck.  The salesperson did not understand that the red rendering LED was not all that we needed.  Given my good past experiences, I'll put it down to a misunderstanding/miscommunication."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chuck",
          "Nb_Reviews": 2,
          "Date": "2020-10-25T14:41:12.000Z",
          "Titre": "Great product but.",
          "Contenu": "The product is great. I purchased it for the backup light feature. I had some technical questions that were answered quickly and professionally. The only thing that I think could be improved were the installation instructions. Maybe it was just me but the hardware instructions were a little weak. Got the light installed and I am very satisfied with them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 3,
          "Date": "2021-02-23T20:53:56.000Z",
          "Titre": "Decent light",
          "Contenu": "This light is very sturdy, very rugged, and bright. However, the light shape as well as size is disappointing. Because of the round edges, there is very little light output on the ends of the light. I do recommend Strobes N More. Great place for products and the customer service is better than any other in the industry."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Austin",
          "Nb_Reviews": 5,
          "Date": "2020-08-20T17:15:28.000Z",
          "Titre": "Great company.. Some products take longer then others",
          "Contenu": "Strobes N More is a great company. I purchased a made to order item now 3 weeks ago and it is still in production but they were pretty quick on letting me know updates. Contacted SNM a couple times to figure out questions about it and they were pretty quick on getting back to me. Hopefully my product is sent to me soon but if not then it is not on SNM rather Feniex."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2020-05-27T17:01:17.000Z",
          "Titre": "Lights are awesome!",
          "Contenu": "Lights are awesome and definitely bright! But I installed two in my taillights and two in my headlights on a 2011 f150 short bed and I had already ordered two 10ft extensions and that still was not enough so I had to add wire to both sides coming from the taillights and also the instructions aren’t the best if your wiring them to a momentary switch, other than that I love them"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Happy Firefighter",
          "Nb_Reviews": 2,
          "Date": "2020-06-30T17:23:26.000Z",
          "Titre": "Nobody Does It Better",
          "Contenu": "Order well-packed and promptly shipped.  Unfortunately the address was wrong, but when I contacted them, within minutes they emailed me back, apologized, corrected everything and resent to the right address.  We all make a mistake once in a while.  These folks were SUPERB with correcting it, and I will happily do business with them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-01-08T11:51:39.000Z",
          "Titre": "Would recommend",
          "Contenu": "Would have given a 5 star but after installing one of the strobes, one of them was the wrong color.  I would guess it was a factory error as all the boxes were marked the same.  Ordering, speed of delivery, quality of product were all 5 star. Would definitely recommend doing business with them. Thank You!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric B",
          "Nb_Reviews": 1,
          "Date": "2020-04-07T14:46:29.000Z",
          "Titre": "Awesome lights with simple install",
          "Contenu": "Install was done on a 2018 Chevy Tahoe PPV.  Had to purchase additional hardware (3.5 in bolts and fender washers) to complete the mount. Only suggestion is provide the hardware needed.  Wiring was easy, and was able to sync both sides with no difficulty.  Lights work and look amazing.  Agency is planning on purchasing for all our patrol units!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shawn",
          "Nb_Reviews": 4,
          "Date": "2021-01-10T17:03:49.000Z",
          "Titre": "Great products",
          "Contenu": "Great products, fast shipping, good prices, not completely satisfied with communication.  I ordered 4 lights within 1-2 weeks.  Prior to placing my 2nd order I received an expired coupon code on 1/2/21 via email.  I asked if it could be honored due to the fact that it was emailed to me on 1/2/21 and expired on 12/31/20.  Despite not getting a response that was placed in my order, I will continue to order from Strobesnmore as I have constantly be pleased with their products, speed of shipping and the company as a whole."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Odowd,Richard",
          "Nb_Reviews": 5,
          "Date": "2021-11-23T23:11:56.000Z",
          "Titre": "I only have positive feedback",
          "Contenu": "I only have positive feedback. I love dealing with strobesnmore. Fast ship ,super priceing and a fantastic section of products. Coustomer service. Is also the best .can't wait for my next purchase. Thanks to everyone at strobesnmore."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SEAN",
          "Nb_Reviews": 3,
          "Date": "2019-01-09T17:51:40.000Z",
          "Titre": "tru dual 5400",
          "Contenu": "The light bar is everything i had hoped for, with the exception that steady burn with the color option is in the flash pattern and not a dedicated switch option. Also the fact that no where was it mentioned a  switch or controller did need to be purchased separately. and the item is not as user friendly as i had hoped being honest. But i do love the light bar and I am satisfied overall ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Trevor",
          "Nb_Reviews": 4,
          "Date": "2019-12-08T18:20:28.000Z",
          "Titre": "Happy with one exception...",
          "Contenu": "My only dissatisfaction with the order was that I was unable to cancel immediately after placing it, per order cancelling instructions on website. I had to wait for delivery of the order I wished to cancel, pay shipping to return before I could order the correct item. Other than that, I’m very happy with product I received."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2019-12-31T13:50:47.000Z",
          "Titre": "It was not what I saw on web site an…",
          "Contenu": "It was not what I saw on web site an try to call an all I got was the recording an try all numbers 2.3.;. An 0 please call me 9313301204It was about 300 when I calledI have talk to them they are telling me I did not look at product correctly they are going to let me return product they have work with me on this"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2020-04-17T15:44:25.000Z",
          "Titre": "Great light, great price!",
          "Contenu": "Wonderful light, as far as patterns and brightness! Only reason it didn’t get 5 stars is that it would be nice to have vehicle specific brackets. I installed this in a 2015 Dodge Charger, and one of the headliner brackets took some modification to get it to fit right. Other than that, awesome light!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2019-07-26T01:03:37.000Z",
          "Titre": "Order process is simple, pricing is good, items not easy to find on the website",
          "Contenu": "A bit difficult finding items on the webpage. There are a lot of categories and the search feature isn't too robust.  Seems that if you don't enter the exact name of an item, or if you make a typo, you'll get an 'item not found' type message, instead of a suggestion for another similar or related item.  Once I located my item, the order process was pretty good.  Shipping is a bit pricey, even for standard. Items seem to be priced well and are competitive with other suppliers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 3,
          "Date": "2018-11-10T00:17:47.000Z",
          "Titre": "To start with",
          "Contenu": "To start with,  I did receive my order in good shape  and packaged very well. The only problem I had was with the shipping which seemed a little slow . I had to email them a week after I ordered the product to get a tracking number. Some people like to keep track of where their package is and when it might get to their house."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2018-12-07T05:25:10.000Z",
          "Titre": "Quality but pricey",
          "Contenu": "Quality of the product was excellent. Bought the atomic clearance lights with amber strobes and the rear cab brake for my 2010 f350. Only issue I had was when the package was delivered I had to pay an additional $145 on top of the $45 I paid for shipping. With the conversion to Canadian dollars I spent $700 a little pricey."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "R.",
          "Nb_Reviews": 1,
          "Date": "2019-11-23T17:54:59.000Z",
          "Titre": "Purchasing process is easy",
          "Contenu": "Purchasing process is easy. My order was right every time.  However, their shipping process leaves something to be desired.  All of my orders never received shipping information.  One of my orders took three weeks to come in and the other took three days.  Great pricing, overall good experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sparky911",
          "Nb_Reviews": 3,
          "Date": "2018-11-08T18:23:25.000Z",
          "Titre": "Keep up the good work",
          "Contenu": "I have ordered many of their house brand items and have never been disappointed. Huge fan of their eflood series of dual purpose offroad/warning bars as well as the rocker panel series. Haven't had to use their warranty or claims departments yet. 4 stars because they phase out items sometimes that are popular."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wright Communications.",
          "Nb_Reviews": 1,
          "Date": "2022-02-28T20:21:03.000Z",
          "Titre": "I have purchased this light type before…",
          "Contenu": "I have purchased this light type before and will continue to purchase more.   This is a great light and option and I couldn’t be happier with anything else from anyone else.  Keep up the great work men."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Emergency Vehicle Repair Garag",
          "Nb_Reviews": 2,
          "Date": "2021-02-09T13:56:28.000Z",
          "Titre": "Shipping estimate",
          "Contenu": "Only issue I have is that I don't get any shipping estimate. I would like to see if it is either shipping from a stocking warehouse or from the manufacture and an estimate of how long either before it ships or when it is expected to arrive at my location"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-21T20:36:11.000Z",
          "Titre": "The lights are nice and bright but the…",
          "Contenu": "The lights are nice and bright but the carriage bolts are to small for the light mount and even when tight the lights still move. I ended using different bolts to tighten the mounts to the bracket I mounted the lights to."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adam Crispin",
          "Nb_Reviews": 3,
          "Date": "2020-10-01T05:19:01.000Z",
          "Titre": "Received wrong color item",
          "Contenu": "Received wrong color item. Had to return and wait for my correct item, which was sent after they got the wrong one back. Second time around I got the correct one, but well past when I needed it. Hopefully if I order from them again I’ll have a better experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Harvey",
          "Nb_Reviews": 1,
          "Date": "2021-07-06T12:18:04.000Z",
          "Titre": "I give 4/5 stars",
          "Contenu": "I give 4/5 stars.  I finally received the correct lights, after the incorrect items were shipped.  Thanks to those in the customer service department, I received the correct lights in a timely fashion and they look and perform great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 2,
          "Date": "2020-01-04T12:23:01.000Z",
          "Titre": "Anytime I order something from Strobes…",
          "Contenu": "Anytime I order something from Strobes N More its exceptional product. However this time is not the case. I ordered a license plate array in red/white alternating. When I installed it I discovered that it is all red. I looked at my invoice to see if I made a mistake and ordered all red but I didn't.  I looked at the box its labeled red/white. I contacted y'all and I received an email saying our techs can help with installation so give them a call....I don't need help with installation I need to know why I got an incorrect product and yet I've received no help"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 3,
          "Date": "2019-02-12T13:23:22.000Z",
          "Titre": "The lights purchased are great",
          "Contenu": "The lights purchased are great. The service needs improvement. Ordered the lights and got quick response but nothing after that until I sent a questioning email. Looks like they had not placed items for shipment until they received my email. Received items shortly after contact."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 1,
          "Date": "2020-06-04T01:49:56.000Z",
          "Titre": "the light is great as said online",
          "Contenu": "the light is great as said online. However when I bought the light and paid for it I never heard another thing from the company, no call email or mail. I had to email them 8 days later and ask whats going on? send me my stuff or refund my money. I did get a response right away after that saying it was shipped and on its way,and i should have gotten an email with the tracking number and so check my spam folder.I did and there was nothing on email or spam. and the light showed up a few days later. I think i got missed and when I asked is when it was sent to me. other than that the light is great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JESSE SNOW",
          "Nb_Reviews": 2,
          "Date": "2021-10-23T15:15:55.000Z",
          "Titre": "This remote switch is small and easy to install.",
          "Contenu": "This remote switch is small, so easy to find a mounting spot, but needs to be close to the battery as the power leads are short. Easy to hook up and with 4 separate switched circuits is enough for fog, driving, light bar, and either ditch, rear, or rock lights. The remote is small with good range. and comes with a visor clip, although I removed it to mount the remote flat with Velcro on the overhead console. I docked it one star as there are no on/off indicators to let you know if one circuit is left on in daylight. I added a key switched power (60amp) relay so all lights go off when the engine is turned off. All in all a much lower cost option to other switch boxes available on the off road market."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-07-27T15:41:04.000Z",
          "Titre": "The products are really great!",
          "Contenu": "The products are really great and time will tell how well they hold up. The turn around time from ordering to delivery was awesome!Installation was straight forward.So far we are very impressed. Thank you Strobesnmore!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Gerry J.",
          "Nb_Reviews": 1,
          "Date": "2020-12-20T21:19:06.000Z",
          "Titre": "Pleased with the product quality, but.",
          "Contenu": "Pleased with the product quality.Diagram instructions need to be supplied with lights.Diagramed installations using the lamps and switch combined.Have a pre-purchase summary page clearly marked with all shipping and potential duty fees to be paid BEFORE the consumer clicks any button that confirms / commits to an order.Don't assume we know what you're talking or writing about. Pictures speak a thousand words. Videos can help to some extent. But Louis talks to fast and watching from a distance isn't always the best vantage point. Have a second camera setup overhead or close-up so we can see what he connecting each wire to."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2019-07-22T17:33:57.000Z",
          "Titre": "Stobes n more has an awesome selection…",
          "Contenu": "Stobes n more has an awesome selection and good pricing and the best lights, but there shipping costs are terrible. If I order a couple mini light bars and need them next day air, how can you charge me $350 just in shipping? Mini light bars are not that heavy..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 2,
          "Date": "2019-10-10T09:16:25.000Z",
          "Titre": "I can not give you five stars",
          "Contenu": "I can not give you five stars. Reason being I ordered the tailgator strobe light thinking it would fit my 2017 F- 250, but it does not. I can not open the tail gate. There is nothing under description of light that says what it fits and what it does not."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2019-10-02T16:29:47.000Z",
          "Titre": "Great products",
          "Contenu": "Great products, price, and fast shipping...once the part came in. The only downside is the website said something was in stock but it took a week to come in before they shipped it. This is understandable, I just wish they had notified me of the delay"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-03-11T22:35:08.000Z",
          "Titre": "Great customer service , decent product",
          "Contenu": "Great and fast customer service, Product quality is decent, only reason I would not say great is the suction cup mount is a litte wobbly, a third suction cup on the mount i feel would make it more sturdy, But light is bright and functions awesome."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2020-06-05T17:43:43.000Z",
          "Titre": "Love the product",
          "Contenu": "Love the product. Only complaint was that I needed it in a hurry and your website does not let people know if item is in stock and when it will be shipped. That would be a helpful change. Other than that all is great. Thank You!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-04-12T02:54:34.000Z",
          "Titre": "I ordered a dash light that said flash…",
          "Contenu": "I ordered a dash light that said flash back shield included. When I called to order they said they’ve been meaning to change the video you now I have to pay for the flash shield. The video has now been  changed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-12T23:32:55.000Z",
          "Titre": "The ordering is easy but they are slow…",
          "Contenu": "The ordering is easy but they are slow to advise if they have a delay in a product especially if it’s back ordered. I had to call them to find this out. Otherwise am impressed with the quality of the merchandise."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mike",
          "Nb_Reviews": 2,
          "Date": "2018-11-08T19:30:21.000Z",
          "Titre": "The product works nice but your wiring…",
          "Contenu": "The product works nice but your wiring directions are kind of vaguethere is no instructions on run one wire to reverse lights or if you wanted brake lights run a wire to your brake lights if you wanted that part of the system to work"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marc ~ rgv tx",
          "Nb_Reviews": 1,
          "Date": "2018-11-09T05:42:32.000Z",
          "Titre": "Outfitted my truck with 10 leds and…",
          "Contenu": "Outfitted my truck with 10 leds and they are super bright. Budget was a factor and got them for less than $ 150.00. I have coworkers asking where to buy some and even constables.  Only draw back is how long they take to arrive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2020-01-22T17:56:18.000Z",
          "Titre": "Light emits so much light",
          "Contenu": "Light emits so much light, it’s great! However, I feel that the construction is a little cheap, and I had a little trouble getting the brackets for the the suction cups to fit correctly. But overall love the lights!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "charles",
          "Nb_Reviews": 1,
          "Date": "2018-11-19T16:46:59.000Z",
          "Titre": "Easy ordering and quick delivery",
          "Contenu": "Easy ordering and quick delivery.  My only complaint is there description was a little vague, and I ended up needing to buy extra things, that I thought should have been included.  Which took more time and money."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Clifton",
          "Nb_Reviews": 1,
          "Date": "2020-01-22T06:48:50.000Z",
          "Titre": "They sent the wrong item",
          "Contenu": "They sent the wrong item.  When I contacted them they sent the correct item.  When i asked them about returning the wrong item which was way more expensive than the item i ordered, they said to keep it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry",
          "Nb_Reviews": 1,
          "Date": "2019-09-01T22:59:59.000Z",
          "Titre": "Light bar is what I expected.the…",
          "Contenu": "Light bar is what I expected.the packaging was well protected so I was disappointed when the lens was broken before it was packaged.i needed it so I had to silicone it to keep water from getting inside."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vehicle Light Specialties",
          "Nb_Reviews": 7,
          "Date": "2020-12-14T23:52:58.000Z",
          "Titre": "Can't say enough good things about…",
          "Contenu": "Can't say enough good things about strobes n more, orders are delivered fast,at times they get mixed up ,but they always make good on it..other than that great people and products..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frederick County Fire and Rescue",
          "Nb_Reviews": 3,
          "Date": "2018-11-01T23:55:56.000Z",
          "Titre": "Good markers",
          "Contenu": "Ordered complete set to avoid making the replacements look different from the original set that was two years old. To our surprise we could barely tell the difference. Good product at a reasonable price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-31T13:58:10.000Z",
          "Titre": "I like the product just the spacing of…",
          "Contenu": "I like the product just the spacing of the magnets won't span the ribs in the roof of my Silverado. Forces the light bar to be off center. Also the electrical cord is way to short."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2018-11-23T23:32:14.000Z",
          "Titre": "Strobe n more has fantastic led strobes…",
          "Contenu": "Strobe n more has fantastic led strobes at reasonable prices. I have purchased many lights with excellent service. Only issue is shipping UPS is over priced and delivery in my area is unpredictable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 1,
          "Date": "2019-10-07T23:17:57.000Z",
          "Titre": "incredibly bright",
          "Contenu": "I replaced my $40 Amazon lights with $280 worth of strobes and it is well worth it. The only thing I was struggling with was cycling through the flash patterns to try and sync up the 6”strobes"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2021-12-13T17:45:02.000Z",
          "Titre": "Great price and product",
          "Contenu": "Great price and product. Would've gave it 5 stars but it doesn't have the strobe pattern of my last strobes n more mini bar. Overall a great value!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kirkpatrick",
          "Nb_Reviews": 1,
          "Date": "2019-12-11T19:08:59.000Z",
          "Titre": "Excellent product selection",
          "Contenu": "Excellent product selection, reasonably priced and plenty of product videos and information. The videos sold the product to me. I love that I can see what I’m getting before I receive it."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Graham Rupert",
          "Nb_Reviews": 1,
          "Date": "2018-12-06T14:28:03.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, great service. My second light from this company, originally had green/green, now amber/amber. Only negative is the lights went on sale less than 24hrs after order was placed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rich",
          "Nb_Reviews": 2,
          "Date": "2019-05-17T13:39:52.000Z",
          "Titre": "Good Quality Products, But the Wiring Might Surprise You",
          "Contenu": "After searching other sites, I’ve found that strobesnmore has a wider selection of good, quality, and affordable products (lights) that I need for work and for play. The videos they post are top notch, and give a great example on what the products (lights) can do. My only complaint is that they do not show the amount and type of wiring enough that a person has to do to get the products working correctly. For example, I recently bought a group of switches for an arrow light bar. The diagram on line only showed the basic wiring, so I had trouble figuring out which wire went where. Obviously red is positive, black is negative; but when all the wires are red, then what? After awhile of figuring it out, I got the light to work. It was just the agitation that I had to go through."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 4,
          "Date": "2022-03-07T14:13:29.000Z",
          "Titre": "I received an order for a horn kit",
          "Contenu": "I received an order for a horn kit. When it arrived, it was missing the amplifier. Customer service was quick to send out the missing piece."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GEOFF PAGNOTTA",
          "Nb_Reviews": 2,
          "Date": "2019-01-14T20:58:05.000Z",
          "Titre": "Shipping costs",
          "Contenu": "Shipping costs were (in my opinion) very high. It was good that I eventually did get free shipping but it put the order at risk and I really wanted the products, they are great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2019-12-28T16:08:15.000Z",
          "Titre": "Surface Star -- Great light overall!  But blue could be better.",
          "Contenu": "SNM overall has been fantasitc -- good customer service, detailed information in their webstore, helpful videos, etc.The Surface Star is an excellent light, very compact, build quality seems great, *very* bright, love that it doesn't have an inline driver since in my application I had very limited space.Only complaint:  the blue color is washed out and mostly white with blue undertones.  I had to apply blue-tint vinyl wrap to get a decent blue color out of it, which makes it less bright (though it's still pretty bright, just not as bright as it could be).I assume the other colors do NOT suffer from the same color wash-out issue -- I've noticed across multiple manufacturers that blue is the most difficult to get right.At some point, I'll probably pick up the amber to replace my front and / or rear motorcycle turn signals."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Ippolito",
          "Nb_Reviews": 4,
          "Date": "2019-04-24T10:16:20.000Z",
          "Titre": "Easy ordering",
          "Contenu": "Easy ordering. Fast delivery. Nice product. Very unhappy with tech support. First call disconected...second call never answered. Had to figure out obscure problem myself."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LEVI",
          "Nb_Reviews": 1,
          "Date": "2019-01-04T02:32:43.000Z",
          "Titre": "Shipped the wrong bracket super fast ;)",
          "Contenu": "Loved the ease of the website and fast shipping, sadly neither of the brackets I ordered were the right one.  Luckily some drilling and redneck-modifications made it work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-23T19:55:24.000Z",
          "Titre": "Excellent company to deal with",
          "Contenu": "Excellent company to deal with. Only thing keeping them from a 5 star review is that was never informed all orders over $500 require a signature"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 2,
          "Date": "2019-02-04T03:53:48.000Z",
          "Titre": "Good experience",
          "Contenu": "Good experience. Decent prices. My items always seem to be in stock and arrive at my door fast. I have always had a positive experience buying from strobes n more!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2020-01-17T04:07:51.000Z",
          "Titre": "Used a soft side organizer for years.",
          "Contenu": "Used a soft side seat organizer for years. I wish I had started out with a molded one. I would love to see a larger opening on the bottom of the molded one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Emergency Vehicle Repair Garag",
          "Nb_Reviews": 2,
          "Date": "2020-12-15T11:45:40.000Z",
          "Titre": "Received my order quickly",
          "Contenu": "Received my order quickly. Only thing I would like to see is an ETA on my order before ordering. I haven't had any issues on any of my orders."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 2,
          "Date": "2021-06-22T00:25:44.000Z",
          "Titre": "Item as described",
          "Contenu": "Item as described. Good pricing and shipped fast. The switch install wiring diagram could be better., but im still happy with the purchace."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ROBERT",
          "Nb_Reviews": 1,
          "Date": "2019-01-25T15:02:52.000Z",
          "Titre": "Chelsea",
          "Contenu": "I believe that is her name. My last few experiences with SNM has been very mixed. Chelsea made all my ‘problems ‘ go away and was delightful to deal with."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Matt",
          "Nb_Reviews": 2,
          "Date": "2020-01-18T18:39:14.000Z",
          "Titre": "Slight unexpected shipping delay",
          "Contenu": "Order came quickly once received by the dealer, however I was not expecting it to take a few weeks for them to receive. Otherwise smooth transaction."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Josh Brown",
          "Nb_Reviews": 2,
          "Date": "2019-12-09T04:23:24.000Z",
          "Titre": "After receiving the product and putting…",
          "Contenu": "After receiving the product and putting it to the test on the road, very happy with the light out put of my new E66 traffic director/warning led bar."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2021-12-06T21:58:47.000Z",
          "Titre": "Light was just as advertised so far I’m…",
          "Contenu": "Light was just as advertised so far I’m happy that I made the purchase.  I have never been disappointed by strobes & more"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Putnam County Rescue",
          "Nb_Reviews": 3,
          "Date": "2018-11-02T12:48:54.000Z",
          "Titre": "Great company, honest people",
          "Contenu": "We have used this company multi times and had little to no issues . Just hope they keep the prices down and don’t end up like a lot of other companies ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Todd Bevins",
          "Nb_Reviews": 2,
          "Date": "2018-12-02T11:31:41.000Z",
          "Titre": "The customer service was very helpful…",
          "Contenu": "The customer service was very helpful the shipping was fast the only thing I would recommend is a deal on shipping or package pricing on large orders"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David N.",
          "Nb_Reviews": 1,
          "Date": "2021-08-12T04:50:33.000Z",
          "Titre": "Product selection is great",
          "Contenu": "Product selection is great, love strobesnmore my only down side is shipping cost, BUT that has nothing to do with the company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dana",
          "Nb_Reviews": 1,
          "Date": "2020-01-02T14:22:56.000Z",
          "Titre": "Overall this was a good buying…",
          "Contenu": "Overall this was a good buying experience. Would have liked to receive my order a bit sooner, however it was accurate and packaged well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-04-26T00:32:00.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. Strobes and more go above and beyond to ensure customer satisfaction. Highly recommend. Great products"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-06-11T15:39:11.000Z",
          "Titre": "Had to modify the brackets for the LED…",
          "Contenu": "Had to modify the brackets for the LED heads used for customer. Otherwise they are decently designed, the test will be time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hershel",
          "Nb_Reviews": 1,
          "Date": "2019-10-06T05:05:50.000Z",
          "Titre": "I was recently dealing with a issue on…",
          "Contenu": "I was recently dealing with a issue on a order of mine but Bethany was really helpful in resolving that issue.Great customer service!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Odowd,Richard",
          "Nb_Reviews": 5,
          "Date": "2019-01-31T20:39:24.000Z",
          "Titre": "I buy from strobesnmore ,satisfaction guaranteed,every time.",
          "Contenu": "I buy from strobesnmore, because of the large selection, and great prices,I love there shipping notifications. Will keep buying from them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-02-18T21:30:04.000Z",
          "Titre": "I do not like the SOFT Rubber on the…",
          "Contenu": "I do not like the SOFT Rubber on the strobe bulbs. They do not stay in the 1\" hole very good. Had to dab silicone on it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2020-02-06T17:15:18.000Z",
          "Titre": "4 stars is real good",
          "Contenu": "I am tough grader so 4 stars is very good. Purchased several items for our department and was always very pleased with the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "B T Auto Repair",
          "Nb_Reviews": 2,
          "Date": "2022-05-10T20:04:43.000Z",
          "Titre": "It should get people to move out of the…",
          "Contenu": "It should get people to move out of the way. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2019-10-03T17:06:19.000Z",
          "Titre": "Ship offering US Mail I live in Rhode…",
          "Contenu": "Ship offering US Mail I live in Rhode Island where Strobesnmore are located and the cost of shipping was expensive with FedEx"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2020-05-01T20:44:16.000Z",
          "Titre": "I was recommended to you by a friend…",
          "Contenu": "I was recommended to you by a friend that outfits squads and he was right on.  Very easy to work with and fast delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T17:43:43.000Z",
          "Titre": "Very knowledgeable parts department…",
          "Contenu": "Very knowledgeable parts department that thoroughly explained all questions I had."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TE",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T16:09:04.000Z",
          "Titre": "Great and Fast service",
          "Contenu": "I ordered rush shipping due to tight time constraints; the products were in the hands of the shipping company in under two hours. Fantastic over the phone experience as well!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Williams emergency vehicles",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T03:58:36.000Z",
          "Titre": "You have the best customer support with…",
          "Contenu": "You have the best customer support with Bethany, she always takes care of us when we order. We order all of our lights and sirens without any issues, great company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 3,
          "Date": "2023-04-01T21:38:52.000Z",
          "Titre": "Trio/Duo X8T",
          "Contenu": "Purchased duo and trio X8T during a great sale! As usual prompt communication, order purchase confirmation and receipt, ordered on a Friday and received onWednesday (sho-me state). Fast shipping! Nice lights for the money, will buy from again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "STEPHEN",
          "Nb_Reviews": 4,
          "Date": "2022-05-12T01:49:17.000Z",
          "Titre": "Original order I messed up by only…",
          "Contenu": "Original order I messed up by only buying one mounting bracket.  I purchased a second bracket this month and it was wrong even though the part number was correct.  After driving 2 hours to your store  it was determined the incorrect part was incorrectly packaged.  Kudos to the agent who helped in figuring out this dilemma.  By the way you were suggested to me by Paul Boudreau the owner of All-Comm in Revere, MA."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-06-06T15:16:49.000Z",
          "Titre": "Quality products and quick communication",
          "Contenu": "You can rely on Strobes n More to have only quality items; I would trust anything they have in their inventory including their own branded products. Also, they are responsive to communication - no overseas call centers here! It’s a relief when many other suppliers are not as easy to speak with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-06-06T15:15:54.000Z",
          "Titre": "Reliable products!",
          "Contenu": "You can rely on Strobes n More to have only quality items; I would trust anything they have in their inventory including this own branded products. Also, they are responsive to communication - no overseas call centers here! It’s a relief when many other suppliers are not as easy to speak with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T14:25:31.000Z",
          "Titre": "The company and staff have been and are…",
          "Contenu": "The company and staff have been and are always very responsive and knowledgeable. It is clear they take into account the customers needs and the most up to date equipment.  We have received several compliments on the professionalism, neatness and ease of access of the equipment installed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2022-05-17T13:45:46.000Z",
          "Titre": "Whelen FST",
          "Contenu": "I ordered a made-to-order lightbar recently (Whelen FST) and was aware that there would be a lead time on the item.  It wasn’t clear to me when I made the order just how long that time would be.  Had I known, I probably would’ve ordered a different product.That being said, I commend Strobes N More for their quick responses and attention to my inquiries.  Their attentiveness to my concerns will definitely keep me returning as a customer.  I feel that to give them less than five stars would be unfair based on this experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2022-05-11T23:09:06.000Z",
          "Titre": "I've been buying stuff from Strobes n…",
          "Contenu": "I've been buying stuff from Strobes n More for many years, everything is always good quality works well and is priced reasonably. I like the videos that Luis does too so you can see what the items look like working before purchasing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad Vinson",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T22:18:36.000Z",
          "Titre": "They have great products.",
          "Contenu": "I had originally given a bad review, but have amended it as they have more than taken care of the problem and made everything good. I do love the quality of the products they sell, and for the price they can’t be beat. I very much appreciate the owner reaching out to me taking the time to get to the root of my original concerns, and then making it right. I commend that, and that is how a great company conducts business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luther Berge",
          "Nb_Reviews": 7,
          "Date": "2022-05-21T20:14:22.000Z",
          "Titre": "Love this light",
          "Contenu": "Love this light! I installed 2 older versions of this light on 2 of my trucks on the fire department so I all ready knew what to expect, but there's a very cool bonus to the new style lights that I didn't truly know about and that's the ability to flash the warning color and clear! That's perfect for a response mode and then just to have color on scene. I also did purchase the extra led lights because I will mount them either on the side of the grille guard or possibly in my headlights and thanks to the simplicity of the plug in style for the extra lights, it's so much easier now. I highly recommend this light!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 4,
          "Date": "2022-05-18T01:44:15.000Z",
          "Titre": "The staff was great!",
          "Contenu": "The staff was great!   They willingly corrected an error in ordering that I had made.  Not their fault but they were more than willing to accept an exchange.  Minor misunderstanding with shipping address was also resolved even though I was less than amicable at first.  Products and prices are the best I have found for the lights purchased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Fried",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T03:59:22.000Z",
          "Titre": "Lights were delivered in a timely…",
          "Contenu": "Lights were delivered in a timely manner. Installation video instructions made the install process easy. Lights are bright and noticeable even by day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mineral County WV Sheriff's Of",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T18:03:42.000Z",
          "Titre": "Great Products Great Customer Service",
          "Contenu": "I have ordered several items from Strobes and More. Excellent products fast shipping customer service a 10. Recently had to return an  License Plate Light  light for repair less than a week from the time I shipped to the time I received it back repaired ready to go."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer-sideshowjim",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T11:04:47.000Z",
          "Titre": "First time purchaser..",
          "Contenu": "First time purchaser... installed 4 E6 dual color and 1 Millinion dual color Light Bar on a 2012 RAM... NOTE : the yellow wire is not compatible with the E6's like the person in the messaging indicated. Seems the mini light bar yellow wire is only compatible with another mini light bar. Other than that I'm happy with my purchase. Would like to make a suggestion though... I needed to extend the light bar power cord a full 12ft to work on a 2012 RAM Laramie mounted on a \"BackRack\".... I made my own wire loom (soldered and heat shrink connections), maybe you could offer as a service to extend the light bars power cord... looking forward to the next purchase... Will also consider purchase the multi strand wire from you next time...highly recommend the E6 Dual Color and Millinion Mini Light Bar! Especially for primary lighting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shigeo",
          "Nb_Reviews": 2,
          "Date": "2023-03-29T17:46:13.000Z",
          "Titre": "Strobesnmore.com Great experience.",
          "Contenu": "I have ordered from this company directly and through Amazon and it goes smooth every time. Delivery is extremely fast. Haven't had any reason to contact them for any issues. Great experience every time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patti - customer",
          "Nb_Reviews": 2,
          "Date": "2022-07-02T15:41:56.000Z",
          "Titre": "This is my third time ordering from…",
          "Contenu": "This is my third time ordering from strobes’n more . My orders arrive in a timely manner and the one time I had an issue with an item in my order the handled it swiftly. Always highest quality and amazing customer service !!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Twin Buttes Fire",
          "Nb_Reviews": 1,
          "Date": "2022-05-15T17:00:22.000Z",
          "Titre": "Super Bright",
          "Contenu": "So we were putting together a wildland fire engine and we had ordered some LEDs from several other companies and after installing them on the grille of the truck the 4 reds (4 led lights per unit) were very under powered just horrible. We ordered from another company but we got more of a off-road light bar style of Red/Blue, and that worked well, We needed a few more reds on the rear so,I, have seen SnM on YouTube and decided to order a couple of the E6s and we bench tested them before we installed and all 3 of us were in ahhh now those are bright. So moral of the story is, we will order our LED lights from SnM"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2023-04-01T00:22:49.000Z",
          "Titre": "I've used strobes n more for many…",
          "Contenu": "I've used strobes n more for many years, the product has always been of good quality and on par with nationally know brands. I'd recommend them for good equipment for a good price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "City of Conroe",
          "Nb_Reviews": 1,
          "Date": "2022-06-07T18:53:32.000Z",
          "Titre": "Hassle Free!",
          "Contenu": "Hassle Free!These people are the best! Amy was a huge help assisting me with my order error and getting me a refund. I did order the correct part and it came as expected, packaged perfectly and on time. Thank you for saving me here! I would highly recommend this Company and I will order from them again in the future. Brenda"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DJ",
          "Nb_Reviews": 2,
          "Date": "2022-06-02T15:10:52.000Z",
          "Titre": "Like always",
          "Contenu": "Like always, fast shipping and great product line .Easy-to-use online shopping, Thay help me out when I'm short on lighting for a project and I need it like yesterday. Thank you Strobes N more"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victor H./Woodstock Ga.",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T05:59:23.000Z",
          "Titre": "thumbs up to strobes and more,really…",
          "Contenu": "thumbs up to strobes and more,really bright light bars,i ordered the warning/flood mode,connected them to the dome lights on the F-150,easy to install  and lots of light for the price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Fildes",
          "Nb_Reviews": 15,
          "Date": "2022-06-09T00:28:35.000Z",
          "Titre": "ordered additional LED modules for…",
          "Contenu": "ordered additional LED modules for Liberty II mini lightbar and items were received quickly, the right part and worked well.As always great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T00:12:21.000Z",
          "Titre": "Matt is excellent",
          "Contenu": "Matt is an excellent adviser and a credit to Strobesnmore. Thank you for the guidance!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EH",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T01:06:07.000Z",
          "Titre": "Good Price",
          "Contenu": "Good Price, fast shipping, no hassle. I have a second job if the had a local store either working their for free or to support my installing addiction."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Blaine Harris",
          "Nb_Reviews": 3,
          "Date": "2022-05-08T20:16:28.000Z",
          "Titre": "Again a repeat performance",
          "Contenu": "Again a repeat performance, great service and amazing products. Everything we have purchased is professional grade, not skimpy like China made products. Keep up the great work. Bovo Zulu."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-09-01T22:10:48.000Z",
          "Titre": "Customer service is great",
          "Contenu": "Customer service is great. Everything I’ve purchased has always arrived on time if not earlier than expected. The packaging is always nice and neat. 5"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JEREMY J BORDENCA",
          "Nb_Reviews": 9,
          "Date": "2022-06-18T23:08:13.000Z",
          "Titre": "Product speaks for itself",
          "Contenu": "Ive used this product in company vehicles within my fleet. I WILL continue to do so, due to the ease of installation/ light intensity/ and speed of shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer  J.W. Heavrin Inc.",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T18:34:40.000Z",
          "Titre": "I always enjoy working with you even…",
          "Contenu": "I always enjoy working with you even when we have a problem as we did on this order you helped me work threw it and have me up and going, Thanks for all your help and look forward to working with you again.ThanksJimmy Heavrin"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ted",
          "Nb_Reviews": 1,
          "Date": "2022-05-06T22:24:21.000Z",
          "Titre": "Absolutely love my new hideaways",
          "Contenu": "Absolutely love my new hideaways from strobes n more I have ordered many other sets before this one and they don’t compare with quality and ease of install couldn’t be happier"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craftmasters",
          "Nb_Reviews": 2,
          "Date": "2022-05-26T17:55:25.000Z",
          "Titre": "Great service!",
          "Contenu": "We have used products from Strobes n More for our business and have never been dissatisfied. Good quality products and customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RetCaninecop but still in LE",
          "Nb_Reviews": 3,
          "Date": "2022-06-29T23:42:01.000Z",
          "Titre": "Very fast shipping when they have the…",
          "Contenu": "Very fast shipping when they have the product in stock. Only had a small miscommunication but they made it right. I will continue to be a customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DanL",
          "Nb_Reviews": 2,
          "Date": "2022-07-01T19:40:51.000Z",
          "Titre": "My go-to for safety lights",
          "Contenu": "Every order from strobesnmore has been shipped fast, packed well, and priced fairly! Their customer service is great too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neil Henry",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T17:32:13.000Z",
          "Titre": "Order comes in 24 hours after order and…",
          "Contenu": "Order comes in 24 hours after order and is shipped AS SOON AS HUMANLY POSSIBLE!!! Great company to do business with!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay K.",
          "Nb_Reviews": 17,
          "Date": "2022-06-09T01:31:56.000Z",
          "Titre": "The best",
          "Contenu": "As always excellent service, and those rare times when you need something expedited…. The crew makes it happen !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-23T21:34:20.000Z",
          "Titre": "Good shopping experience on the…",
          "Contenu": "Good shopping experience on the internet. Very prompt! Email notifications were very timely. Product shipped quickly. Total satisfaction with the product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T02:10:24.000Z",
          "Titre": "I can’t say anything negative",
          "Contenu": "I can’t say anything negative. Awesome company to work with. I will definitely be placing orders in the future. Recommendable!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 4,
          "Date": "2022-05-02T13:24:51.000Z",
          "Titre": "Great products and awesome staff",
          "Contenu": "Great products and awesome staff. Pricing saved me a lot of cash.  An issue I had with the correct product needed was easily resolved.  I'll be going back for all my lighting needs !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phil",
          "Nb_Reviews": 1,
          "Date": "2022-05-06T01:57:49.000Z",
          "Titre": "Just as advertised",
          "Contenu": "Just as advertised. A high quality switch to replace the ones that wore out. Thanks for the quick delivery and careful packing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Yuodis",
          "Nb_Reviews": 2,
          "Date": "2022-05-10T03:25:51.000Z",
          "Titre": "Quality Affordable Products",
          "Contenu": "I have been using Srobes-N-More products for many years. They have high quality products at affordable prices. I use amber emergency warning lighting on my vehicles for the simple fact that I carry tools and stop to help motorists in need of help but don't want to get killed doing it. I use Strobes-N-More products on our work vehicles also for warning lighting. Just one example is a pair of E-6's that I put on the rear of my old company pick up truck cap. I received a newer company pick up truck three times now but that old Silverado with the E-6's is still in service. Those E-6's were disconnected for a while. I hooked up 12v power and a toggle switch and they still work just fine. They've been on the back of that truck cap as surface mount rear facing (Amber) warning lights for at least six years and we're still using them.Customer Service at Strobes-N-More gets a five star rating also. Not once have I called them and not spoken to someone that made sure that my question was answered before I hung up with them. They're the kind of people that you would feel comfortable just stopping in and saying hi if you were in R.I.If you have a business with vehicles that stop or stay on the side of the road (like landscaping vehicles), Strobes-N-More is the place to shop for affordable warning lighting.Thanks for listening,Joseph YuodisTolland County in Connecticut"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig Colantoni",
          "Nb_Reviews": 3,
          "Date": "2022-05-25T18:21:37.000Z",
          "Titre": "Awesome Company to Buy From Fast…",
          "Contenu": "Awesome Company to Buy From Fast Service, Amazing Customer Service and David is Awesome told him what I wanted for a Cencom Core Wecanx Build did everything I wanted in the Quote can't wait for the Install to Happen"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Stephane Poitras",
          "Nb_Reviews": 1,
          "Date": "2022-04-28T15:37:11.877Z",
          "Titre": "Stephane P.",
          "Contenu": "hello to you very fast service and answer our questions very fast email I am very satisfied with all my products that I have bought and it lights up very well moreover very discreet ghost and above all does not harm the vision I will recommend them I you  thank you again he just has a small suggestion the flashbacks for the Dual I had to make holes because he installed my passenger side for the triple threat I had no holes to make.  and the wire is on the passenger side near the door and the left driver the same thing but for the Dual also on the passenger side near the door and the driver's side no need to make holes.  and include the instructions thank you and I wish you a beautiful beautiful day to you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-08T01:09:53.000Z",
          "Titre": "I ordered the cobras dual color and I…",
          "Contenu": "I ordered the cobras dual color and I couldn't be more impressed with them they are bright day and night. look really well made felt good and study. Over all more impressed with the punch this product puts out"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-05-20T23:45:12.000Z",
          "Titre": "Very good company deal with excellent…",
          "Contenu": "Very good company deal with excellent customer service just wish their strobes  and more lights had better warranties"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 9,
          "Date": "2022-04-30T16:26:07.000Z",
          "Titre": "I wish you had  a red",
          "Contenu": "I wish you had  a red, white and blue system so as I have had blue and white system, I bought the red and white system and combined the two and they work perfectly for the saden If I work a detail as a Police Officer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles G Kohanowski",
          "Nb_Reviews": 2,
          "Date": "2022-06-09T06:29:03.000Z",
          "Titre": "Great experience",
          "Contenu": "Order was easy. Shipped fast and surface star product was excellent quality. Pleasure to do business with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "424 Warning Systems",
          "Nb_Reviews": 2,
          "Date": "2023-10-05T01:09:59.000Z",
          "Titre": "Great Service",
          "Contenu": "always great customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Carrillo",
          "Nb_Reviews": 5,
          "Date": "2022-05-09T15:14:22.000Z",
          "Titre": "I would like to say that I have had a great experience",
          "Contenu": "I would like to say that I have had nothing short of excellent service with you and your company .. your equipment is nothing but the best , thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TIM",
          "Nb_Reviews": 5,
          "Date": "2022-11-01T14:11:20.000Z",
          "Titre": "A Great Company to Partner With!",
          "Contenu": "As usual, they are super easy to deal with. They ship the orders super fast and are priced very fairly. I will continue to purchase from them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B.Donahue",
          "Nb_Reviews": 1,
          "Date": "2022-04-27T18:15:05.996Z",
          "Titre": "Amazing quality light",
          "Contenu": "Amazing quality light, super bright, easy install. Customer service is quick to help and very polite."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Aaron McMullin",
          "Nb_Reviews": 1,
          "Date": "2022-06-03T15:01:35.000Z",
          "Titre": "Fast shipping to Canada and products…",
          "Contenu": "Fast shipping to Canada and products arrived safe sound. My go to source for emergency lighting . Very happy customer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-01-03T17:46:34.000Z",
          "Titre": "Everything arrived",
          "Contenu": "Things are delivered as promised!! Although there seems to be a continuous change over ya really don't know who ya gonna get...in the end I get my product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "City Of Lander",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T18:10:42.000Z",
          "Titre": "Great Service",
          "Contenu": "Easy ordering, fast service and fast shipping. We recieved the right parts as ordered. Very good products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2022-04-28T15:45:17.462Z",
          "Titre": "I look forward to my next order",
          "Contenu": "I've had great service from strokes-n-more on  several occasions and this was no exception. They provide excellent customer service and fast shipping on great products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TGentry",
          "Nb_Reviews": 1,
          "Date": "2022-04-27T16:42:49.276Z",
          "Titre": "I have yet to be disappointed",
          "Contenu": "I have yet to be disappointed. I have ordered twice from here and both orders came on time and in great condition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 3,
          "Date": "2022-10-09T06:11:42.000Z",
          "Titre": "SNM products",
          "Contenu": "I’ve bought a lot of SNM products and will continue to do so very happy with all the lighting products they sell"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T23:22:46.000Z",
          "Titre": "Your company is always helpful and…",
          "Contenu": "Your company is always helpful and knowledgeable, to what I’m looking for and how to apply the product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reds Truck Equipment",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T15:33:05.000Z",
          "Titre": "Always been a great company to do…",
          "Contenu": "Always been a great company to do business with. Needed a special roof strobe by Whelen they had in stock at a good price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-06-09T04:51:22.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. Order was filled and shipped very quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn R",
          "Nb_Reviews": 3,
          "Date": "2022-07-03T15:42:06.000Z",
          "Titre": "Always a pleasure to deal with the…",
          "Contenu": "Always a pleasure to deal with the folks at SnM… fast shipping and 90% of stock items ship the same day!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T23:17:19.000Z",
          "Titre": "Ease of use with ordering and fast…",
          "Contenu": "Ease of use with ordering and fast delivery of items that were ordered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T16:18:03.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping, Item was easy to install and set up. Easy instructions with great product videos, works great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-19T21:38:41.000Z",
          "Titre": "i have made over 75 purchases and they…",
          "Contenu": "i have made over 75 purchases and they always strive for perfection, thank you for everything"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TCA",
          "Nb_Reviews": 5,
          "Date": "2022-05-19T05:20:53.000Z",
          "Titre": "Awesome Company with Really Great People",
          "Contenu": "As Always... The Best people you could hope to find in the world we live in Now.Louis and His staff are Top Notch. Special Thanks to Mary Beth, Lauren and Amy Jo.. They make the Difference and Get it Wright."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phill",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T19:53:19.000Z",
          "Titre": "Never a bad experience",
          "Contenu": "Never a bad experience, great products that are built right"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-17T19:30:18.000Z",
          "Titre": "Strobe’s n more is the place to get your emergency lighting",
          "Contenu": "Fast and reliable shipping, products that work great, simple and easy to use website"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn R",
          "Nb_Reviews": 3,
          "Date": "2022-05-21T04:28:38.000Z",
          "Titre": "Always a pleasure to order from",
          "Contenu": "Always a pleasure to order from! Customer service is top notch and fast shipping!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carter, JP",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T19:59:49.000Z",
          "Titre": "The Online shopping was easy to…",
          "Contenu": "The Online shopping was easy to navigate. The prices were also very competitive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Devin",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T00:03:54.000Z",
          "Titre": "Great Company",
          "Contenu": "Great customer service, great pricing, fast shipping. All around great company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-05T15:20:04.000Z",
          "Titre": "easy ordering on the phone and online…",
          "Contenu": "easy ordering on the phone and online store. no problems at all. fast shipping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Estevez",
          "Nb_Reviews": 3,
          "Date": "2022-05-19T15:04:24.000Z",
          "Titre": "Can't complain about anything",
          "Contenu": "Can't complain about anything. The service from start to delivery was great. Along with the product. Thanks again for all your help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T14:08:46.000Z",
          "Titre": "Purchasing the product was easy",
          "Contenu": "Purchasing the product was easy, shipping was fast!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "newton",
          "Nb_Reviews": 3,
          "Date": "2023-04-07T21:17:06.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience. Same day turnaround on the order. Fast shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Buchert",
          "Nb_Reviews": 3,
          "Date": "2022-05-30T12:18:35.000Z",
          "Titre": "The Dominator 4 shipped fast",
          "Contenu": "The Dominator 4 shipped fast!  Exactly the way I ordered it.  No issues at all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 5,
          "Date": "2022-11-03T16:31:33.000Z",
          "Titre": "Great service and quick shipping",
          "Contenu": "Strobes N More has items in stock and ships them quick.  When a return is needed, they take care of it promptly.  They are my go-to for vehicle lighting needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-05-13T01:29:33.000Z",
          "Titre": "Product was delivered fast and well…",
          "Contenu": "Product was delivered fast and well packaged. Product was easy to install and looks as if it belongs with car."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-01T00:15:41.000Z",
          "Titre": "Product exactly as described and…",
          "Contenu": "Product exactly as described and extremely fast shipping. Very happy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dion Taylor",
          "Nb_Reviews": 1,
          "Date": "2022-05-06T17:35:41.000Z",
          "Titre": "Very helpful and fast service for my…",
          "Contenu": "Very helpful and fast service for my special order Whelen parts!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 2,
          "Date": "2023-06-01T17:12:31.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping, nicely packaged and great quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T03:48:37.000Z",
          "Titre": "Great customer experience",
          "Contenu": "They had all the parts I needed for my project, and they had extra parts in case I needed more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-01T16:13:05.000Z",
          "Titre": "Great product easy to install",
          "Contenu": "Great product easy to install well worth the money along with fast shipping.If your even thinking about it do it!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carmelan Limo Service LLC.",
          "Nb_Reviews": 2,
          "Date": "2022-05-03T17:36:26.000Z",
          "Titre": "Both the Service Technicians (Installs)…",
          "Contenu": "Both the Service Technicians (Installs) and the front desk Staff, were very pleasing and professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-06-03T21:14:32.000Z",
          "Titre": "Great prices great customer service…",
          "Contenu": "Great prices great customer service just wish the warranty was better"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brayden T",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T17:56:21.000Z",
          "Titre": "Very quick turn around on lights hood…",
          "Contenu": "Very quick turn around on lights hood whelen quality like always"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T18:07:30.000Z",
          "Titre": "Bright lights",
          "Contenu": "Bright lights, fast shipping at a reasonable price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-10-31T20:39:51.000Z",
          "Titre": "Easy to use website and my order was…",
          "Contenu": "Easy to use website and my order was shipped the same day and arrived quickly"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Blaine Harris",
          "Nb_Reviews": 3,
          "Date": "2022-04-29T15:57:33.000Z",
          "Titre": "The products are service are amazing",
          "Contenu": "The products are service are amazing. Quality and ease of installation are above traditional products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Biddeford Public Works",
          "Nb_Reviews": 2,
          "Date": "2022-06-06T12:23:07.000Z",
          "Titre": "VERY GOOD COMPANY",
          "Contenu": "Very friendly and very helpful on any questions we had. Great selection."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J and J TROD, LLC",
          "Nb_Reviews": 3,
          "Date": "2022-04-28T14:43:27.092Z",
          "Titre": "Excellent products at a fair price and…",
          "Contenu": "Excellent products at a fair price and the delivery was on time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Volunteer FF",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T21:32:52.000Z",
          "Titre": "Great products",
          "Contenu": "Great products, everything you need in one place, lights are super bright and easy to wire."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-05-20T20:11:45.000Z",
          "Titre": "Great company",
          "Contenu": "Great company. Definitely my go to place for all my lighting needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LMB",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T15:15:58.000Z",
          "Titre": "Great product at ar reasonable price",
          "Contenu": "Great product at ar reasonable price. Quick delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-08T16:07:56.000Z",
          "Titre": "I’m very satisfied with my purchase",
          "Contenu": "I’m very satisfied with my purchase. Been looking for those for a long time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy  Bauer",
          "Nb_Reviews": 2,
          "Date": "2022-04-27T16:08:27.669Z",
          "Titre": "Great customer service and lights are…",
          "Contenu": "Great customer service and lights are bright and well worth the money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-05-22T16:21:38.000Z",
          "Titre": "Excellent price and quick service",
          "Contenu": "Excellent price and quick service, all I require, Jim"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-20T01:52:05.000Z",
          "Titre": "product arrived in a timely manner and…",
          "Contenu": "product arrived in a timely manner and works as described."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MICHAEL D",
          "Nb_Reviews": 3,
          "Date": "2022-06-08T17:06:06.000Z",
          "Titre": "Great Company Thank you for all the…",
          "Contenu": "Great Company Thank you for all the Special orders I called in."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 2,
          "Date": "2022-12-02T05:21:30.000Z",
          "Titre": "Quality products and great priced",
          "Contenu": "I have ordered from Strobesnmore for years. Consistent quality products and excellent customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Giampietro",
          "Nb_Reviews": 1,
          "Date": "2022-05-17T22:00:07.000Z",
          "Titre": "It was a quick and easy installation…",
          "Contenu": "It was a quick and easy installation done properly."
        }
      ]
    }
  ]
}