{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "studentdiscounts.com",
      "Review": [
        {
          "Note": 1,
          "Pseudo": "Amir Asgari",
          "Nb_Reviews": 9,
          "Date": "2023-12-17T19:54:27.000Z",
          "Titre": "Don’t trust this website I just bought 4 tickets from student…",
          "Contenu": "I just bought 4 tickets from student discount website, when I bought it checking bag for each passenger was included, but one day before my flight when I am coming to do check in on website I find out I have to pay for my check in bag!When I contact help desk they told wait and we will back to you we have to investigate it.Just imagine how it is stressful for me.My advice don’t put yourself in this position, and don’t buy any ticket from student discount websites."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Yaya Adamou",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T13:48:48.000Z",
          "Titre": "1spss installation problem",
          "Contenu": "1. I can´t download and istall the licence on my laptop2. They sent mi 2 licences:     Order/Invoice #386635 (August 8, 2023) Yaya    Adamou   Order/Invoice #386634 (August 8, 2023). Yaya   Adamou neither of them could be installed"
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "MS",
          "Nb_Reviews": 1,
          "Date": "2023-05-07T06:39:27.000Z",
          "Titre": "Poor customer service on chat",
          "Contenu": "Poor customer service on chat. Wrong version of software. Incorrect information provided through chat support."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "kino williams",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T21:49:42.000Z",
          "Titre": "The product is difficult to download…",
          "Contenu": "The product is difficult to download and use. Very little assistance"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Malick DIOP",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T17:58:19.000Z",
          "Titre": "Overcharged",
          "Contenu": "Charged my card 4 times after intial purchase"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kris",
          "Nb_Reviews": 3,
          "Date": "2022-12-28T01:09:45.000Z",
          "Titre": "I hate this",
          "Contenu": "I kept having to reinstall every time I accessed it.  I don't have time for that!"
        },
        {
          "Note": 1,
          "Lieu": "KH",
          "Pseudo": "Sovannarith CHHE",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T02:37:15.000Z",
          "Titre": "I bought a SPSS 28 premium pack",
          "Contenu": "I bought a SPSS 28 premium pack, but couldn’t process its program after successfully installed on Mac M1 Monetary 12.4 machine. I communicated the issue to service support; but, it didn’t help any thing nor received a technical sound of attempting to solve this.I just tried to inquire this product from OnTheHub and I got the clear explanation which is more than available source on the internet. Anyway, I just expect you can offer your clients wish onwards.csr"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Emina Kalic",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T03:18:36.000Z",
          "Titre": "Can't access the spss download"
        },
        {
          "Note": 1,
          "Lieu": "RO",
          "Pseudo": "Mihaela",
          "Nb_Reviews": 1,
          "Date": "2021-08-04T07:38:23.000Z",
          "Titre": "Good product, but not so good service",
          "Contenu": "The product itself is very good and worth the price. But, the service and the flexibility from staff is very low. It doesn't matter for them what is your specific need, unfortunately. I have asked for a small correction in an invoice (that was done last year without any problem), but now I have received only a short message \"That is all that is available from our credit card processor.\" So, they didn't show any intention to help in a situation that is crucial for customer. :( Sorry about it, you can do it better. Good luck!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Yvette",
          "Nb_Reviews": 1,
          "Date": "2019-06-23T12:54:26.000Z",
          "Titre": "Still Waiting for Product Support",
          "Contenu": "I’ve had the most disheartening & disappointing experience with Student Discounts. The on-line, e-mail and phone support have been less than helpful in running SPSS on my macOS for school assignments and statistical dissertation work. To date, the problem is still broken and tech support is non-existent. I’m reluctant to recommend this brokerage to fellow cohort members, students or schools with which I am affiliated."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Erica",
          "Nb_Reviews": 1,
          "Date": "2019-02-25T22:10:50.000Z",
          "Titre": "Unsatisfied customer",
          "Contenu": "I purchased the SPSS for Statustics and it was difficult to download. I had to try 3 computers before I can installed, then once I installed, my computer was hacked. Now I have to figure out if these scammers who got into my computer are causing further damage. If my school doesn’t offer this service to check my computer for free, then I will have to pay for it. Not satisfied at all with the SPSS program."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Caitlin",
          "Nb_Reviews": 2,
          "Date": "2017-06-14T03:21:23.000Z",
          "Titre": "NOT HAPPY.",
          "Contenu": "I never received my license information. Even after sending my ID and emailing your customer service representative (whom never responded to me). I paid almost $40 for nothing... I am now set back on my thesis work and based on what I read on your website your company policy doesn't offer any money back. I am so upset... and I think you're ripping off students."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Sandy",
          "Nb_Reviews": 1,
          "Date": "2017-10-27T01:23:16.000Z",
          "Titre": "I never succeed to install the …",
          "Contenu": "I never succeed to install the software. I had an error occured while the installation.I tried to buy a cd, but the site didn't recognize my identifiants. I was supposed to receive an email to change my password or reactivate my account, but I never received it for the 4 times I tried to get it.If you have a solution for me, I'll appreciate."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Melanie",
          "Nb_Reviews": 1,
          "Date": "2019-03-09T04:02:41.000Z",
          "Titre": "SPSS software (after being installed…yielded a message that the SPSS processor was down",
          "Contenu": "SPSS software (after being installed and working successfully for weeks) failed to communicate to the SPSS processor in the middle of my analysis.  I reached out for help and was told to install a lower version.  I have a new computer. I wasn't asked any questions about the system I used and they assumed I needed to uninstall and reinstall a lower version of software.  I paid $89 for software that fails in the middle of a two-way anova.  Thanks but no thanks...  the help via email was no help."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2015-10-26T23:19:19.000Z",
          "Titre": "first and last time using this site",
          "Contenu": "I purchased my software two weeks ago and have not heard anything about it. I sent in my verification email and never received any replies. I sent a follow up document and received an email asking me not to send anymore buy have yet to hear anything about my order. I have missed several large assignments due to not having what I purchased. What makes me the most upset however is that my money was taken weeks ago."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2017-10-14T14:13:38.000Z",
          "Titre": "Make simple impossible",
          "Contenu": "It took me 2 weeks and 27 attempts to hack the right combination of steps to meet the inane security to load SPSS.  This has been the most ridiculous process I have ever encountered to simply download software.  And the only help I got from StudentDiscounts provided was to tell me to uninstall and reinstall.  Thoroughly useless."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kiona",
          "Nb_Reviews": 1,
          "Date": "2014-08-26T19:58:52.000Z",
          "Titre": "Not what they advertised!!!!!!",
          "Contenu": "I ordered the quickbooks from studentdiscounts.com and the image on the order was of the quickbooks pro.  Well they sent me Quickbooks Accountant which has all versions available via the accountant version.  Meaning that not all the options available are there.  Of course there are no refunds.  Definitely disappointed with my purchase and won't buy from here again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Levi",
          "Nb_Reviews": 1,
          "Date": "2015-03-31T19:18:36.000Z",
          "Titre": "Poor Download",
          "Contenu": "The software would not download with the 20 numerical entry given. The entry request the license number be entered, but that was not given. I brought the software to help with statistical projects, but that never happened. I should of went with MINITAB. This bad experience has nothing to do with IBM SPSS, its a very good product, if you get to use in time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wenhao",
          "Nb_Reviews": 3,
          "Date": "2015-05-25T19:16:41.000Z",
          "Titre": "Service needs to improve",
          "Contenu": "I purchased a SPSS 21 software online on May 11, 2015 but it had a license lasting only about 20 days but not one year. I called Student Discount but it asked me to contact IBM SPSS. IBM SPSS staff found that the SPSS software I purchased from Student Discount had a 20-day license only and they help me solved the problem by resetting the license to one year.\r Based on this experience, I think the service provided by Student Discount needs to improve."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 1,
          "Date": "2015-06-29T14:12:31.000Z",
          "Titre": "Product problem still unsolved - Not impressed.",
          "Contenu": "I bought software from StudentDiscounts.com and have racked my brain making it work. It turns out that the product keys are defective. When approached, they sent me another set. When I contacted the manufacture, they said the second set of product keys was to a different product entirely. Software still doesn't work. :/ \r(The product review says 1 star, but that's only because the system made me choose at least 1 star before submitting. I would choose no stars.)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joy",
          "Nb_Reviews": 1,
          "Date": "2017-07-07T17:46:15.000Z",
          "Titre": "I waited for SPSS software to down load …",
          "Contenu": "I waited for SPSS software to down load 2 hours, was never able to open. Since the customer service was only open on weekdays, couldn't reach anyone for help. Finally gave up and ordered from Amazon. Cost twice as much, but received the next day, took only a short time to download, and opened without a hitch."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Olivia",
          "Nb_Reviews": 1,
          "Date": "2014-10-06T15:41:12.000Z",
          "Titre": "Order not available after 5 days of waiting",
          "Contenu": "I ordered the product and faxed in all info needed. 5 days later I get an email that says they do not have the product. I also noticed it was still up on the website. Why go through all of that? We needed that program in a timely manner and ended up buying somewhere else and paying 1 day shipping to get it on time. So frustrating!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 1,
          "Date": "2015-09-27T23:46:53.000Z",
          "Titre": "I was not happy with this product",
          "Contenu": "I purchased the program on my computer at home and it says you can download it on 2 computers but when I tried to download it on my computer at work I had to buy it a second time.  I mainly do my homework at work so if I had known this was going to happen I wouldn't have bought the program on my computer at home."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deven",
          "Nb_Reviews": 1,
          "Date": "2016-12-08T14:06:43.000Z",
          "Titre": "Needed Help - No Response or Follow Up",
          "Contenu": "I had some issues getting my software code to work, and after I spent hours trying to figure it out myself, I called and e-mailed StudentDiscounts.com for assistance. They were closed the day I called (Wednesday or Friday around Thanksgiving), and I never received an e-mail response (sent at the same time). Eventually I found a resource that helped me...but it is sad that I spent money at StudentDiscounts.com, and they chose to completely ignore me. Poor customer service, and I will not be back in the future."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "nilda Rivera- Cruz",
          "Nb_Reviews": 1,
          "Date": "2018-10-19T23:05:22.000Z",
          "Titre": "Service from Student Discount.",
          "Contenu": "I had problems with the SPSS installation (new version) called Students Discount and the person answering walked me through the process and in a few minutes, it was resolved. I had the same experience last year. Thanks so much for your help.! Nilda Rivera-CruzDoctoral Student AU"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MARCIA",
          "Nb_Reviews": 1,
          "Date": "2017-06-18T05:25:07.000Z",
          "Titre": "I cant get the program to work and i …",
          "Contenu": "I cant get the program to work and i called customer service it was stated they werent equipped to assist me. Provided me with an IBM # and that was a deadend as well.  I had to withdraw from my class and still pay the University for the class not to mention a waste of $50 for the SPSS program."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andre",
          "Nb_Reviews": 3,
          "Date": "2017-02-18T02:40:14.000Z",
          "Titre": "Selling a product that is not legit.....",
          "Contenu": "Bought Quickbooks for Mac and the product was unable to activate. It was beyond activation date.Called Quickbooks for tech support and they remote controlled my compuer and never saw the bundle I Purchased.  I immediately called StudentDiscounts and they promptly refunded me the purchase price."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 1,
          "Date": "2015-03-24T15:58:27.000Z",
          "Titre": "Poor service",
          "Contenu": "The software I bought was according to the description on this company's web site was supposed to have been licensed to me for two years after the purchase date. When I installed, I found that the license was for only a few months. When I emailed this company with a complaint, there was no reply."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leah",
          "Nb_Reviews": 2,
          "Date": "2018-09-30T08:02:00.000Z",
          "Titre": "I ordered a statistics program and had…",
          "Contenu": "I ordered a statistics program and had troubles downloading it. When I looked up how to correct the problem they offer a disk for additional money which would not help anyway because my laptop does not even have a disk drive. This was a waste of money and a lot of time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zahra",
          "Nb_Reviews": 1,
          "Date": "2017-03-27T23:07:36.000Z",
          "Titre": "horrible",
          "Contenu": "I ordered SPSS the online version because I was in rush to finish my research project for school. It took 2 days to upload, after that it didn't even open in my laptop. After one week challenging with the program, finally I had to order a CD from Amazon. Very disappointing."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Jenny",
          "Nb_Reviews": 1,
          "Date": "2016-04-10T04:18:43.000Z",
          "Titre": "Spss didn't work after download and functions disabled",
          "Contenu": "I purchased the student SPSS pack and it did not work at all. After contacting support they suggested that I re download again put in all the fields. So I did this and the functions were mostly disabled. Unable to input data or run any statistical analysis. What a waste of time and money. I then purchased the same package from another website and it worked w all functions! Had to get an assignment extension nexus de I was unable to obtain SPSS from this site. I would never from this site again. What a terrible experience. They also have a no refunds policy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tayla",
          "Nb_Reviews": 1,
          "Date": "2017-04-06T13:17:52.000Z",
          "Titre": "I believe I would like to return this …",
          "Contenu": "I believe I would like to return this product. I have been trying with my professor for weeks to get it to work and it still won't open any of the SPSS files I need. That was the only purpose of owning a license for SPSS myself. How can I go about this process?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2017-03-09T17:54:08.000Z",
          "Titre": "Rip off",
          "Contenu": "Dragon dictate Naturally Speaking.$98 plus some sense.Refuses to provide me program key.Now I have to return this program.A program for which I need desperately.Will never use you again!😲😲😠NEVER 😠😠Response to response. The program should not have been sold to me in the first place.I filled out the correct documentation and did make the purchase.The seller did make the sale to the buyer. the buyer did by the merchandise this seller is responsible for it completely.If you're not going to follow through with the sale do not make the sale.Thank you"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Texad grad student",
          "Nb_Reviews": 1,
          "Date": "2016-09-02T20:56:40.000Z",
          "Titre": "Horrible AFTER PURCHASE assistance",
          "Contenu": "The program I purchased from this company  is a statistical program for graduate students. I am a grad student. I needed this program to work the day I purchased it. I emailed asking for Urgent assistance and it really did not matter how much I spent, it was over $100 by the way, because I got assistance four days later which caused me a great deal of problems with my school program. And when I did get assistance the program still did not work. I ended up getting the program to work from a technology department from my school. Horrible customer assistance after the purchase of course. Very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Simone",
          "Nb_Reviews": 1,
          "Date": "2018-04-24T14:22:29.000Z",
          "Titre": "I will never use or refer anyone to use…",
          "Contenu": "I will never use or refer anyone to use Academic  Students Discount.com. Reason customer was terrible and I never received my authorization code after multiple times verifying  I am a student. The software never downloaded to my pc or my iPad Pro. It was a waste of time and money.  My course Principles of Research Methods is a 5 week course. In 4 weeks no results with the IBM SPSS 24 grad pack. I am not a satisfied customer and feel I should receive my refund for a software that was never delivered efficiently. Also, I was able to purchase the IBM SPSS 25 on another site and was verified instantly with my school credentials."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Melissa",
          "Nb_Reviews": 1,
          "Date": "2018-08-20T14:05:12.000Z",
          "Titre": "Unable to download",
          "Contenu": "Unable to download, even when I tried chatting with someone online, not successful. It's a very weird situation... not sure if this is a legit way to download student portal programs... I'm going to try and get a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Olivia",
          "Nb_Reviews": 2,
          "Date": "2020-07-24T17:17:09.000Z",
          "Titre": "I downloaded an SPSS system from…",
          "Contenu": "I downloaded an SPSS system from studentdiscounts.com and it won't install. Been going back and forth with technical support for a day now and we still can't figure out why it won't install."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Katie",
          "Nb_Reviews": 1,
          "Date": "2016-11-01T12:44:57.000Z",
          "Titre": "Charges is US dollars without notification",
          "Contenu": "I purchased a statistical software from StudentDiscounts.com and thought I was paying $92.00 for it ($30 less than more reputable sites). Nowhere prior to reviewing my VISA statement was I notified that the $92.00 I thought I was paying was in US dollars and that I was actually paying over $120 Canadian. I believed the $92.00 was in Canadian dollars. I did not knowingly accept to pay $92.00 american, but still had over $120.00 Canadian charged to my VISA. When I tried to contact StudentDiscounts.com, I received no reply. I would advise dealing with a more reputable source who will respond to your concerns about their products and who is actually forthcoming about the prices."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "mark",
          "Nb_Reviews": 1,
          "Date": "2015-11-17T11:36:14.070Z",
          "Titre": "Unable to return electronic downloads",
          "Contenu": "Recently purchased QuickBooks pro for another person and wasn't aware that it was region specific. After seeing that you don't do refunds, I've been attempting the same through Intuit. All my attempts so far have gone nowhere, as the company no longer provides a New Zealand desktop version. With this in mind, I'll have to award a single star, very disappointed that my error in purchase can't be rectified via the student discount website.\r QuickBooks offers 30 day money back, but because I purchased from an unregistered third party, they won't honour it. Had I purchased direct, they would of refunded my money. This is from their desktop support in the US."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sheron Gibson",
          "Nb_Reviews": 1,
          "Date": "2015-03-07T19:16:07.000Z",
          "Titre": "Poor Service!!",
          "Contenu": "I ordered the Quickbooks software. I paid extra to have the software mailed to me via U.S Mail. Once I ordered the software they sent me a link to download the software via over the web.  Once I downloaded the software, it made my computer VERY slow. The software takes alot longer to open then my older version that I had. I emailed the company and explained my problem to them and they simply said that they can not refund the funds that I spent on downloaded software. even through I ordered the software to be mailed to me via disc and paid that extra fee.  My computer and the software is slow and freezes. I will not recommend this company and will not buy from them again.  Very poor customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2016-10-12T12:22:40.000Z",
          "Titre": "Average service. **Update",
          "Contenu": "Bought SPSS. Sent in a copy of my student ID to verify my student status.Hadn't heard back almost a week later.Sent an email asking what was going on.The next day they verified it.Nothing bad, just average service.**UpdateWhen they saw my review, someone called me about it. The guy seemed like he didn't really know what I was talking about and tried to spin it like I screwed up by missing a download attachment.No. I sent the required proof of enrollment in school and did not hear back until I sent an email asking about it. Then I finally got my access code.They tried to buy me off with $10 rebate to change this review.Keep your $10 and don't call me again. Next time I rent from onthehub.com."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2015-02-02T18:48:18.000Z",
          "Titre": "unexpected problem",
          "Contenu": "I recently ordered Adobe Lightroom. The product installation code that you sent did not work and I was forced to go through Adobe and re-verify student status. It was a time consuming and difficult experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 1,
          "Date": "2015-08-27T00:08:35.000Z",
          "Titre": "Does not take care of their customer",
          "Contenu": "I never received the product. Tracking shows as delivered but I never received it. Called customer service and I was only directed to USPS to file a claim - no offer to assist me in any way. I opened a case with USPS, which took 3 days to research, and USPS closed the case because the package showed as delivered. After doing my due diligence I called customer service again, and was essentially told that I was out of luck. They took my $350 for software but will not refund me or make any attempt to resolve this for me. I have now had to pay another $350 but I went to Amazon, which offers a direct download option. Stay away from Student Discounts, folks! Amazon offers educational discounts and immediate downloads."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nirav",
          "Nb_Reviews": 1,
          "Date": "2014-09-19T04:08:50.000Z",
          "Titre": "Software description misled me",
          "Contenu": "The software I purchased, Quickbooks, said the software was good for 3 installs, which when I went to install it, I could install it on however many computers I wanted, but could only use 1 at a time.  I needed to have the software available from multiple computers.. I even bought 2 of these at the same time.  When I emailed them, they basically said if I bought 2 of the 3 install licenses, I only had 2 licenses.. (so not sure what the point of the 3 installs is...)\r I had referred a couple people to this site, but after this, there's no way I will ever refer anyone here.  Quickbooks supposedly has a 60 day money back guarantee, but not sure if it's only if purchased from intuit.  I will at least try."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christian",
          "Nb_Reviews": 1,
          "Date": "2016-02-27T23:27:12.000Z",
          "Titre": "Unable to Use Download",
          "Contenu": "I paid for a Student Version. After downloading, the software, the Key did not work what so ever! I wasted money!!! And then every time i called, I was given the run around. I will never use this website."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "סימונה פדידה",
          "Nb_Reviews": 1,
          "Date": "2022-07-26T20:39:04.000Z",
          "Titre": "It was a bad one",
          "Contenu": "It was a bad one. I can't open my spss, asking for help and you tell me again and again that its an id problem."
        },
        {
          "Note": 1,
          "Lieu": "TZ",
          "Pseudo": "HARRIET",
          "Nb_Reviews": 1,
          "Date": "2018-11-23T14:22:41.000Z",
          "Titre": "I have failed to log into spss ever…",
          "Contenu": "I have failed to log into spss ever since I purchased it. I am in week 5 of my course which is 8 weeks and I am struggling due to IBM not calling me, but sending endless emails without help."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anand",
          "Nb_Reviews": 1,
          "Date": "2017-09-05T14:39:46.000Z",
          "Titre": "Horrible Experience with Students Discount",
          "Contenu": "Please dont use this website for software. They dont clarify the timeline of delivery and will make you miss deadlines. In my case, I never received the software I purchased or the license key."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alison",
          "Nb_Reviews": 1,
          "Date": "2016-02-17T05:19:22.000Z",
          "Titre": "Program doesn't work, unable to complete my homework",
          "Contenu": "Program is missing certain important features. I'm unable to use this program to complete my assignments. Thank goodness I found someone who has the complete program that I am able to use."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 1,
          "Date": "2015-06-26T03:04:51.000Z",
          "Titre": "SPSS statistics",
          "Contenu": "Still not able to use the program. SPSS program does not connect to server.  Tried to contact right personnel about the issue but nothing as of yet, had been resolved. I'm very frustrated."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Confidence",
          "Nb_Reviews": 1,
          "Date": "2015-07-21T12:13:06.000Z",
          "Titre": "Terrible experience.",
          "Contenu": "I was unable to instal the software either from download or disc, even though I had a Windows 8.1.  Instead of trying to help me, I was given a refund. I need the software, not a refund!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "madrid",
          "Nb_Reviews": 1,
          "Date": "2019-12-02T16:04:45.000Z",
          "Titre": "My membership stopped when I thought it was good for 6 months",
          "Contenu": "My membership stopped when I thought it was good for 6 months- i got homework to do and this is annoying—I called Monday at 11 am and could not talk to a human being."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Velisa",
          "Nb_Reviews": 7,
          "Date": "2015-10-25T16:19:05.000Z",
          "Titre": "you sent me a windows disk for a mac computer",
          "Contenu": "I am truly disappointed. I purchased a download for my mac computer and it would not download, so I purchased the disk and that is for windows only. \rI want my money back."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2020-11-10T17:04:39.000Z",
          "Titre": "RUN if you can!!!!!",
          "Contenu": "Customer service horrible, Chat service horrible, general website layout & ease of use is horrible. Would NOT use if I didn't need it for school."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicole Jones",
          "Nb_Reviews": 1,
          "Date": "2020-02-04T15:49:24.000Z",
          "Titre": "The program didn't install or work",
          "Contenu": "The program didn't install and when i called the IT department no one helped. So i paid for a program and could not get the program to work at all"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Taylor",
          "Nb_Reviews": 1,
          "Date": "2015-03-23T16:35:27.000Z",
          "Titre": "Poor",
          "Contenu": "I couldn't get the software to properly install on my computer. When contacting student discounts via the email address they provided, they didn't address the issue and instead asked for my physical address to send me the software. I gave them the address, which is different from my billing address. They sent it to my billing address. I contacted them once more to let them know the issue and the person responding to my email was very rude saying, \"well that's the address you have on file, by the way.\" Very unprofessional. If they did their job correctly the first time and thoroughly read my response and the physical address I provided, we wouldn't have this issue. Or they could have answered my initial question and walked me through the installation process. I know many people having issues with the software downloading and installing on their mac books."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Niayesh",
          "Nb_Reviews": 1,
          "Date": "2017-02-18T20:28:55.000Z",
          "Titre": "Didn't work no customer service and the program wasn't real",
          "Contenu": "Costed me loosing five percent of my  final grades. Save your money don't buy this, they do not have any good customer service nor their program works."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hana",
          "Nb_Reviews": 1,
          "Date": "2018-03-29T01:35:16.000Z",
          "Titre": "Does Not work all the time!",
          "Contenu": "Does Not work all the time!My assignments should take no more than 2 hours, however because of the bad processing of the SPSS it takes days and weeks!"
        },
        {
          "Note": 1,
          "Lieu": "CL",
          "Pseudo": "Emilio",
          "Nb_Reviews": 1,
          "Date": "2018-07-13T17:08:33.000Z",
          "Titre": "Claim",
          "Contenu": "I never received the key to use the software. I have not received the physical software either. I request money back and cancel the purchase.Thanks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Natalie",
          "Nb_Reviews": 1,
          "Date": "2019-09-27T00:54:19.000Z",
          "Titre": "I bought an SSPS program off…",
          "Contenu": "I bought an SSPS program off StudentDiscounts.com. The company did not give me the license code that was required to use the program. I emailed them and received no response. I took the next measure to call them. I called them, spoke to a representative in a literal minute phone call, in which he told me that he would email me the information I needed. He confirmed my name and email, so I thought everything was resolved. I waited 24 hours for an email and nothing was sent. I proceeded to call a second time, but it went to voicemail. I knew they were open despite the three hour time zone difference. I live in on the east coast and they were on the west coast, but I made sure to be aware of the time zone difference. I never got to use the program, which I needed for school. I disputed the charge through my bank and got a refund. I'm not pointing any fingers at anyone specifically, but something needs to be done because I not only wasted my money, I wasted my time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicole",
          "Nb_Reviews": 1,
          "Date": "2014-09-17T14:54:28.000Z",
          "Titre": "Condescending business ethics!!",
          "Contenu": "As a student I was required to buy software from this company. I followed a link to the page provided by my professor which brought me to only one option of purchase. Naturally I bought the only one option which turned out to be the wrong version for my operating system. Yes it was user error, however, the team on the other end of the software line handled the situation in a horrible and condescending way telling me it was \"all my fault\" and that I need to \"actually look at what I am buying\" when the web page is confusing and unclear. They continued to charge extra to my account for my simple mistakes which they claimed \"happened often.\" All though it is user error you should never conduct business this way. Try to help the customer and mend the relationship they have with your company! I will never shop here again and I will let every body, including my professor, know how rude the team was to me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicole",
          "Nb_Reviews": 1,
          "Date": "2014-11-09T01:28:13.000Z",
          "Titre": "The software doesn't even work correctly.",
          "Contenu": "The wizard to upload a txt file doesn't work.  I can't bin any categories.  The software just does not work and I have requested a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Student A",
          "Nb_Reviews": 1,
          "Date": "2016-06-15T14:44:14.000Z",
          "Titre": "Received too late",
          "Contenu": "received access 2 weeks into my class- it was a 4 week class so this made my coursework incredibly difficult. Access should be immediate"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NINA",
          "Nb_Reviews": 1,
          "Date": "2018-10-29T23:02:17.000Z",
          "Titre": "Horrible experience",
          "Contenu": "Horrible experience! Software doesn't work and customer service representatives uncooperative. Would not recommend to anyone!"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2018-03-16T12:44:02.000Z",
          "Titre": "paid but product key code never…",
          "Contenu": "paid but product key code never delivered. No response when e-mailed several times. Would not purchase anything from this website!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Douglass",
          "Nb_Reviews": 2,
          "Date": "2016-02-08T11:46:33.000Z",
          "Titre": "I can't the program to work on any of my Macs",
          "Contenu": "I can't get the program to work on my Mac. I tried my Mac Air and my Mac book......no luck with either one. very disappointing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2019-12-19T18:57:43.000Z",
          "Titre": "This would never download either time I…",
          "Contenu": "This would never download either time I purchased it.  I lost my money, and had to buy SPSS from somewhere else."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JP",
          "Nb_Reviews": 1,
          "Date": "2016-02-05T07:20:40.000Z",
          "Titre": "The absolute worst",
          "Contenu": "this software never worked and the idiots in customer service could not help. I will be asking for my money back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kristin",
          "Nb_Reviews": 1,
          "Date": "2019-08-14T15:47:52.000Z",
          "Titre": "The website said 6 months access to a…",
          "Contenu": "The website said 6 months access to a program. I received 15 days. The website is not user friendly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 1,
          "Date": "2017-05-05T16:47:36.000Z",
          "Titre": "I did order",
          "Contenu": "I did order. They didn't have the product. I waste 2 hours to order. Really very power service."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Antonio valle",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T17:43:24.000Z",
          "Titre": "it doesn't work on mac and my refund never happened, you guys are scam"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adriana",
          "Nb_Reviews": 1,
          "Date": "2019-09-03T15:57:24.000Z",
          "Titre": "Wouldn't download to my computer",
          "Contenu": "Wouldn't download to my computer, no matter how many troubleshooting trials done"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2016-03-17T16:37:08.000Z",
          "Titre": "Don't answer anything",
          "Contenu": "I bought the wrong version and wanted to upgrade. Email sent but never get response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ann",
          "Nb_Reviews": 1,
          "Date": "2018-03-09T23:06:03.000Z",
          "Titre": "Can not download",
          "Contenu": "Can not download. I should have paid for the real SPSS. Total waste of my money,"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2018-02-09T14:52:44.000Z",
          "Titre": "Terrible",
          "Contenu": "I was directed to this StudentDiscounts by a professor for data analysis software.  I found what I needed easily enough but any convenience or even courtesy stopped there, after my card had been processed. I could not download the software due to a \"full disk\" error. When I reached out to StudentDiscounts via electronic message I was given an email address with only a short message saying that the email was tech support. I had to go back and forth with several emails.  All responses were curt. When I asked for a phone number to speak with someone the response was a request to access my computer remotely. The person on the other end had not even told me their name at this point. I asked and was given the name, Les. When I called the phone number on the website, Les, sent me to a very rude man to access my computer remotely to try and fix the download problem.  I was told that my \"system\" was too \"old\", and that there was nothing he could do.  I was told that Windows 7 could not run any newer versions of the software that I had purchased and that I would have to downgrade, at no discount. I emailed my professor and he said that he is running Windows 7 and that he has the new version of this software. I had to go to a third party and pay additional money to enable the download.From the moment my money was taken, my experience with StudentDiscounts was, at the very least, negligent and disrespectful."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gale",
          "Nb_Reviews": 1,
          "Date": "2015-02-05T00:03:48.000Z",
          "Titre": "not for us",
          "Contenu": "The program never worked on our computer, even the CD.  Will be calling soon!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frida",
          "Nb_Reviews": 1,
          "Date": "2014-11-02T02:10:33.000Z",
          "Titre": "my product didnt work",
          "Contenu": "I got a bootleg version.  I couldn't download it.  I want my money back"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2014-11-20T21:59:43.000Z",
          "Titre": "Disappointed",
          "Contenu": "I ordered Quick Books Pro 2014 and received Quick Book Accountant 2014"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kanwal",
          "Nb_Reviews": 1,
          "Date": "2016-04-16T12:40:17.000Z",
          "Titre": "Corrupt software",
          "Contenu": "The software never worked.. Please refund the $$ back to my account"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "pr",
          "Nb_Reviews": 1,
          "Date": "2015-12-03T13:57:41.000Z",
          "Titre": "Terrible experience",
          "Contenu": "unable or unwilling to help. I will never buy from this company."
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "SOO",
          "Nb_Reviews": 1,
          "Date": "2018-11-01T11:33:10.000Z",
          "Titre": "After paying",
          "Contenu": "After paying, still can't use the SPSS that I purchased!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Georgina",
          "Nb_Reviews": 1,
          "Date": "2016-09-25T11:05:24.000Z",
          "Titre": "Terrible",
          "Contenu": "No clear directions on download. No weekend  customer service"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Benjamin",
          "Nb_Reviews": 1,
          "Date": "2017-04-04T10:28:24.000Z",
          "Titre": "I send 2 mails to the helpdesk",
          "Contenu": "I send 2 mails to the helpdesk, no one bothered to reply."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Evan Clemmons",
          "Nb_Reviews": 1,
          "Date": "2022-04-01T02:52:31.000Z",
          "Titre": "I can’t even install terrible"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sandra",
          "Nb_Reviews": 1,
          "Date": "2017-06-04T03:20:52.000Z",
          "Titre": "Terrible and help desk was no help at …",
          "Contenu": "Terrible and help desk was no help at all"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "verna",
          "Nb_Reviews": 2,
          "Date": "2014-09-23T02:22:13.000Z",
          "Titre": "Horrible",
          "Contenu": "I am yet to get access to the program!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter Karagines",
          "Nb_Reviews": 2,
          "Date": "2015-08-19T17:32:24.000Z",
          "Titre": "Miss represented the product and no support form Quickbooks",
          "Contenu": "I would not buy from these liers again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thao",
          "Nb_Reviews": 1,
          "Date": "2016-06-03T20:18:34.000Z",
          "Titre": "unable to access QB 2016",
          "Contenu": "Unable to log into/access QB 2016."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrea",
          "Nb_Reviews": 1,
          "Date": "2015-09-26T13:56:19.000Z",
          "Titre": "never received",
          "Contenu": "never received the purchased item"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "natalie",
          "Nb_Reviews": 1,
          "Date": "2016-10-14T03:25:08.000Z",
          "Titre": "terrible!!!!!!!!!",
          "Contenu": "I never received my order!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Monique",
          "Nb_Reviews": 1,
          "Date": "2017-01-01T20:12:19.000Z",
          "Titre": "Would like my money back ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AXHD",
          "Nb_Reviews": 1,
          "Date": "2019-10-10T06:34:46.000Z",
          "Titre": "A Questionable Situation",
          "Contenu": "Buy at your own risk."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shamika",
          "Nb_Reviews": 1,
          "Date": "2018-09-06T16:13:14.000Z",
          "Titre": "Unable to download."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dan Scarborough, Marietta, GA",
          "Nb_Reviews": 1,
          "Date": "2014-07-29T12:25:20.000Z",
          "Titre": "It took 4 days to get Dl'd and then I found out what we ordered was not the correct software.",
          "Contenu": "I initiated an order with [external reference] because I was told \"what to do\" by my university.  Kennesaw University, Kennesaw GA.  \r The whole process started with a letter of student registration I was told to take to the GSU bookstore.   There, I was told they do not sell the QB 2014  Academic Version.\r I had signed up for an online course that began more than 10 days ago.  Four days later, I was still trying unsuccessfully to acquire and DL the software I was looking for.  The class had already started and I was already \"2 days late\"!  \r There seemed to be no way to get your site to accept my \"other documentation\" because the university had not issued me an email address that ended in .edu.\r Despite multiple emails and telephone calls, no one could provide me with the Academic Version of QuickBooks Pro 2014 from [external reference].  When I finally reached someone who would work with me, I \"bit the bullet\"  I placed an order (that was not an Academic Version and DLd what I thought was the QB version I needed... \r It turned out to be the Accountant version.... when I finally logged into my class, nothing made sense... the instructors directions did not agree with the software product I purchased from [external reference]\r I finally called [external reference] and ended up buying a $299+ version (non-academic) QB Pro+ and DL'd the software.... I still don't think I ended up with the subscription benefits I had anticipated from [external reference]\r The [external reference] rep told me to contact you for a refund... If that wouldn't work, get back in touch with them.\r Nevertheless, today I received this \"How did we do?\" email.... so, I'm telling you.\r The one silver lining in this (if it works out) is that when  went back to your website, I called and got in touch with one of your reps (the number given on this email was constantly busy) the person I talked to was very understanding, courteous, and professional... (I'm counting on this current assessment.) \r He asked about the \"boxed software\" I received (which did not even open) and told me \"As soon as I hang up, I will send you an email with a 'free shipping label' you can print out and tape to the boxed software to return it to us.  When we receive the box (probably within the week,) we will refund the total amount you paid us.\r I did not ask if there will be a \"re-stocking fee\" assessed... If that happens, I will take more draconian actions.... but I don't expect that to happen.\r When I get my refund, all will be forgiven (I'm finally online in my course and have caught up to the class,) and when I finally get an email address ending in .edu I will favorably consider returning to Student.Discount.com to do business again.\r Here's hoping an email will be waiting for me from your rep as soon as I post this review and follow through on his promise.\r I will change my rating if all goes well, but for now, one star will have to do."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Manette",
          "Nb_Reviews": 1,
          "Date": "2020-07-05T14:59:53.000Z",
          "Titre": "One of the functions",
          "Contenu": "One of the functions - multivariable regression analysis does not run on my computer and I tried to contact the help desk and redownload the system and it still does not work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Candice",
          "Nb_Reviews": 1,
          "Date": "2018-08-25T15:47:30.000Z",
          "Titre": "I purchased Adobe Pro for Mac",
          "Contenu": "I purchased Adobe Pro for Mac. They sent me the software on a DVD, but newer Macs aren't made with DVD players. When I called the company, they were not able to send me a downloadable program. I spent hours on the phone with Adobe to fix the problem. StudentDiscounts.com was no help at all. I could have purchased the software directly from Adobe for $2 more, and received a software download, rather than a software disk. Waste of time!"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Kate",
          "Nb_Reviews": 1,
          "Date": "2016-10-02T18:45:19.000Z",
          "Titre": "Missing important aspects.",
          "Contenu": "Read the fine print and be sure this product will meet the needs of the course you're taking or research requirements. The 6 month graduate student version does not include capabilty to bootstrap which was required on assignments. Told to purchase the premium version by customer service but a little too late. Will be seeking this product elsewhere. Otherwise install and use were relatively simple but a bit confusing with multiple steps and emails."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pat",
          "Nb_Reviews": 2,
          "Date": "2015-09-12T21:16:32.000Z",
          "Titre": "Inadequate instructions",
          "Contenu": "Ordered IBM SPSS software package.  Download instructions were horrible.  Ended up having to overnight the CD which arrived with NO instructions.  Had to insert the CD and find instructions on the download which stated to \"close\" the window that always comes up when you first insert a CD...too late.  Just a total cluster.  Had to uninstall and reinstall... Just a very frustrating experience and my classmates all had problems."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 2,
          "Date": "2014-08-26T00:53:40.000Z",
          "Titre": "Won't do business with this company again!",
          "Contenu": "Bought the base version of a program for $70 bucks and realized a month into the class that I needed the standard version instead so I bought it for $90. Called the company the next day and they said sorry but they have a policy that they can't refund me the money for the first purchase.  So now I own the base version and the standard version. Well I now have a policy too, never spend another dime with this company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carol Cameron",
          "Nb_Reviews": 2,
          "Date": "2015-11-02T20:22:12.000Z",
          "Titre": "Customer Service",
          "Contenu": "They are no live customer service representatives to talk to if you have a problems with the software like I had.  Also, there is no 24-hour customer service access.  People who go to school on-line needs those accesses to be able to work effectively and efficiently.  In this day and age, we definitely need that to met our deadlines."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stacy",
          "Nb_Reviews": 1,
          "Date": "2016-08-07T22:43:31.000Z",
          "Titre": "Bad advice",
          "Contenu": "14 day trial message kept popping up after purchase.  I called the help line a few days before it was about to expire and was told not to worry about it and that it would go away.  That was not the case and now I have a weekend assignment due requiring SPSS with no support from the company I purchased my product from."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ja",
          "Nb_Reviews": 1,
          "Date": "2015-07-24T16:24:55.000Z",
          "Titre": "Order for overnight delivery came in 4 days",
          "Contenu": "I needed this particular software for a school project and was working on a very tight time frame.  I selected the option for overnight delivery for an additional $44.00.  While expensive, I REALLY needed the software.  I didn't receive the order either the following day, as expected, nor by 2 pm CST on Friday.  I called the customer service number and they couldn't really explain why it hadn't shipped.  I finally got my order on Monday and was refunded the $44.00 fee for overnight shipping."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MICHAEL SCHROEDER",
          "Nb_Reviews": 3,
          "Date": "2018-10-18T19:38:16.000Z",
          "Titre": "Download process was a nightmare 🤬",
          "Contenu": "The download process required two IT specialists at my college plus a masters prepared statistician to get me started. My frustration level with this program just getting  it open to use hit maximum capacity. The senior IT person at the college had to go to a Google website to find out why the menu toolbar was not present after finally get the program downloaded and opened. This required another 90 minutes and finally success. I pity the poor people who purchase this software that don’t have the resources I did to get the fricking thing downloaded and then fixing the problem of the missing toolbar! Very unhappy customer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alison",
          "Nb_Reviews": 1,
          "Date": "2015-06-03T00:03:36.000Z",
          "Titre": "Not present with my transactions and questions!",
          "Contenu": "I received the incorrect version of Adobe Acrobat I ordered, which then took another 12 days to send back and receive. The person I was dealing with kept asking me the same questions over that had previously been answered. \r Like I said, the rep was not present with the whole experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2014-09-14T21:48:51.000Z",
          "Titre": "Great deal, but need 24/7 service",
          "Contenu": "The student discounted price was excellent, but the process to certify my student status was cumbersome, and unclear.  Also, I purchased on a sunday morning, but did not receive the activation codes and download link until monday.  I had an assignment due sunday night, and would have received a zero, had I not been able to get a trial version of the software elsewhere.  If you are going to have a website with 24/7 ordering, then you need to also have 24/7 responses to customers, instead of waiting a day to give them their product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sally",
          "Nb_Reviews": 1,
          "Date": "2015-02-04T15:52:33.000Z",
          "Titre": "Frustration",
          "Contenu": "The process of receiving my disk was arduous. I ordered a disk, and it never came in the mail. When it finally did, the directions for installing it were too complicated for me to understand. Installing software shouldn't be that hard. Every time I called Student Discounts I was spoken to as if the company didn't have enough time to deal with me or answer my questions, and I was rushed off the phone each time. Overall I'm not happy, but this company was the only one providing the software for a price I could afford, so I had no choice but to use them. Disappointed and frustrated."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marie",
          "Nb_Reviews": 1,
          "Date": "2018-10-24T14:27:51.000Z",
          "Titre": "I reached out to the \"orders\" email…",
          "Contenu": "I reached out to the \"orders\" email address requesting a receipt (NOT order confirmation, but a receipt that includes the last 4 credit card digits) and never received a reply. Otherwise, everything was good."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julie",
          "Nb_Reviews": 1,
          "Date": "2016-11-04T03:59:00.000Z",
          "Titre": "Not happy",
          "Contenu": "I purchased Quickbooks a couple days ago and I'm trying to download a second copy on a different computer but I can't find where to download. I tried logging into my account but apparently I didn't make an account during the purchase and I can't use the forgot password feature?!? If this is not fixable then you should require us to create an account. Also you should add directions to your FAQ's on how to locate your second download. I have been searching my emails and nothing from your company provides this info. I'm left with calling and it's past your hours of operation. I really needed to do this tonight and I'm stuck."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ebony",
          "Nb_Reviews": 1,
          "Date": "2015-11-21T21:55:22.000Z",
          "Titre": "My program does not work properly",
          "Contenu": "I recently purchase SPSS 23 and the package takes an extremely long time to open. It does not read files saved from work completed in 22 version. I am not happy with this program at all. I need a replacement copy of the software."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KW",
          "Nb_Reviews": 1,
          "Date": "2015-06-26T21:01:45.000Z",
          "Titre": "Out of stock.",
          "Contenu": "There was a great price on the product, but after ordering and charging my card, they emailed and said it was out of stock. They immediately refunded me, but the product should have said it was out of stock before ordering."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2015-06-23T19:08:36.000Z",
          "Titre": "Caution to MAC users",
          "Contenu": "There's a little too much going on on the website and instructions page but not enough where you can't figure things out. The company is pretty fast. \r If you are a MAC user, do not download the software! I rented SPSS and you can download it on both PC and MAC but I have a MAC. It downloaded fine but when opened it doesn't work right. \r Everyone in my Master's class said the same. They all said they contacted Student Discounts and they said call IBM. IBM doesn't have answers. When I looked online, there are so many discussion boards about this problem. I don't know why they offer this for MACS if it doesn't work. \r Steer clear MAC users!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dee",
          "Nb_Reviews": 1,
          "Date": "2020-03-29T23:43:53.000Z",
          "Titre": "No one ever got back to me",
          "Contenu": "No one ever got back to meTo figure out how to download product I ordered item twice Still not working"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Katie",
          "Nb_Reviews": 1,
          "Date": "2014-07-29T12:56:47.000Z",
          "Titre": "Other than the price, not worth it",
          "Contenu": "I ordered SPSS for my summer research project in college. Sold by the less than $100 price sticker, I was looking forward to the convenience of being able to do my statistical analyses from my own laptop. Purchasing went smoothly, but the process since then has been anything but. For over a week, I have been battling with IBM itself because the download link provided to me from [external reference] didn't work and, naturally, cannot be refunded. So at this point, I'm still in the process of getting it worked out--the authorization code also provided was invalid, causing even more of a headache. Looks like I'm out 100 bucks and still missing the software I need for my research."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "douglas",
          "Nb_Reviews": 1,
          "Date": "2016-10-25T19:14:43.000Z",
          "Titre": "Hard to load",
          "Contenu": "Very difficult to load. Multiple students in our grad class had trouble. I spent over 2 hrs on phone with tech support. Some of tech support not friendly. Some of our stu had to go to IT to load..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Megan",
          "Nb_Reviews": 1,
          "Date": "2015-01-07T03:54:02.000Z",
          "Titre": "Bad Experience but was refunded",
          "Contenu": "Needed software for a class and ordered it through studentdiscounts. Was surprised to find that I had to send in verification that I was a student (an @edu email address wasn't good enough.) However I sent it in, but never heard back from the company and didn't receive the software. I was unable to complete a final that I was buying the software for and I wasted $70. However, after posting this review (editing now) I was contacted by customer service. After some back and forth the cost was refunded (under the condition I would edit this review.) I appreciated the refund and at least one of the customer service reps I deal with was nice (Les), but it would have been nice to get the software I needed, when I ordered it, and received a refund no questions asked once they realized the error."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "D.Bell",
          "Nb_Reviews": 1,
          "Date": "2018-03-25T23:28:39.000Z",
          "Titre": "Paid for the data but was difficult to…",
          "Contenu": "Paid for the data but was difficult to download (had windows 10 16G) and ended up using statistical software through IBM.Waste of money........................"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alicia",
          "Nb_Reviews": 2,
          "Date": "2017-02-11T13:19:03.000Z",
          "Titre": "Download does not work in my computer",
          "Contenu": "I bought this software  and downloaded to my computer and it's not working try multiple things and still don't work. No happy with the product"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Odaris",
          "Nb_Reviews": 1,
          "Date": "2017-02-14T20:54:58.000Z",
          "Titre": "Failure to download and later open the program",
          "Contenu": "I downloaded the program to my computer at least 5 times, it didn't work. The program is on the computer but it won't open up."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brenda",
          "Nb_Reviews": 3,
          "Date": "2015-11-25T15:00:39.000Z",
          "Titre": "Frustrated PhD Candidate",
          "Contenu": "I purchased a SPSS Grad Pack March, 2015.  SPSS was on my dedicated dissertation laptop.  However, the laptop was stolen in October 29, 2015.  Notified Students Discount of the incident.  Additionally, my plan to purchase a new laptop.  In the interim, I installed the SPSS on my desk top.  Student Discount informed me of emailing a new product key.  Emailed the key.  Discovered this was a 2nd key and terminated the key.  Following frustration, I was told I had to purchase a new SPSS.  I complied to get my data.  However, I found out that the data on the desktop computer, I could not get my work completed.  In addition, referred to support from IBM but only to discover , student has to go through a support forum.  Currently, I am experiencing problem with data unreadable when exported.  As of yet, I have not received any help from IBM !  This is very frustrating! .  Too technical with any one you speak with IBM or Student Discount.  Worst experience!  Still waiting for a response."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ashley",
          "Nb_Reviews": 1,
          "Date": "2017-09-04T13:02:10.000Z",
          "Titre": "I was never able to download the SPSS …",
          "Contenu": "I was never able to download the SPSS system onto my computer. For the cost I should have been able to download without the CD."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2015-09-04T15:00:29.882Z",
          "Titre": "Long time between order and confirmation",
          "Contenu": "It took 5 days to get my confirmation email and download info.  My class had already started and I was behind.  Completely not cool."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stuart",
          "Nb_Reviews": 4,
          "Date": "2015-05-21T14:58:06.000Z",
          "Titre": "Clunky process",
          "Contenu": "By the time you order, verify student status, receive and install the software you could have saved more time buying retail."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Leah",
          "Nb_Reviews": 1,
          "Date": "2015-12-07T21:42:24.000Z",
          "Titre": "Poor customer service",
          "Contenu": "The product was good but the customer service was poor. I sent an email a month ago and still never received a response."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mallory",
          "Nb_Reviews": 1,
          "Date": "2018-09-22T17:36:53.000Z",
          "Titre": "SPSS would download but I couldn't…",
          "Contenu": "SPSS would download but I couldn't activate it with the key in the email with my order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KB",
          "Nb_Reviews": 1,
          "Date": "2018-02-01T00:31:48.000Z",
          "Titre": "Some anti-virus software downloaded …",
          "Contenu": "Some anti-virus software downloaded with the product and caused computer problems."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Colleen",
          "Nb_Reviews": 1,
          "Date": "2020-02-28T21:49:13.000Z",
          "Titre": "Code I received was expired & disappointed with customer service",
          "Contenu": "Code I received was expired, took days to resolve the issue. Difficult to reach and help was offered but wasn't extended making me think the queue wasn't reviewed. Overall the situation was resolved by receiving a new code for a different edition of the software I ordered but was left disappointed and frustrated by the lack of expertise and follow-through from customer service.EDIT TO CLARIFY-- I received an updated code after the one originally supplied was expired. Poor review due to poor customer service. Difficult to talk to customer service, the rep I originally talked to didn't know the hours of operation for the phone service, I was able to find out after digging through the website. Frustrating that the customer service rep didn't know this and didn't offer to find out. I had been talking to a different (higher-up I assume) rep after the first rep couldn't help me with the code. We set up a session where they tried to help me with the downloading, all they did was pin the software to my task bar. Was then told to restart my computer and then it should work, it did not work. Was told that I would be moved back onto the queue and would be contacted once it was my turn, I was never reached out to again after this. The lack of follow through, lack of expertise and lack of help is the reason for the poor review. Of course, if I hadn't received an expired code I wouldn't have gone through all this but I was left disappointed with the customer service. The expired code was all IBM's issue, the poor customer service is all Student Discounts. I was able to finally get the software to work after consulting other people outside of Student Discounts and now the software works.Last update-- The second customer service rep I had (Les) was easy to work with, it seems that on the macro system the customer service division lacked."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2016-11-03T01:01:41.000Z",
          "Titre": "Obsolete Software Versions Delivered",
          "Contenu": "The software delivered was for 2015 and purchased in the 4th quarter of 2016. :("
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lauren",
          "Nb_Reviews": 1,
          "Date": "2016-09-11T02:32:02.000Z",
          "Titre": "Software licensing defective",
          "Contenu": "Once installed, the program will not work due to licensing issues."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ricardo",
          "Nb_Reviews": 1,
          "Date": "2017-05-07T21:30:11.000Z",
          "Titre": "your website is very confusing and not …",
          "Contenu": "your website is very confusing and not really user friendly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "BB",
          "Nb_Reviews": 1,
          "Date": "2018-03-27T14:57:31.000Z",
          "Titre": "Had to call a few times to get access…",
          "Contenu": "Had to call a few times to get access to my download"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frances",
          "Nb_Reviews": 2,
          "Date": "2014-06-29T02:31:07.000Z",
          "Titre": "Two emails & one phone call, a file addition,  and still non-functioning software.  not happy.",
          "Contenu": "I needed this software last week.  VERY disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bridget",
          "Nb_Reviews": 1,
          "Date": "2018-04-22T23:51:05.000Z",
          "Titre": "Poor Service",
          "Contenu": "Rude customer service"
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "SHRUTI BHATTACHARYA",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T03:32:23.000Z",
          "Titre": "It computes very fast with multiple…",
          "Contenu": "It computes very fast with multiple results coming up at the same timeHowever my program kept crashing when I tried to import an excel sheet"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "student and employee",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T20:16:41.000Z",
          "Titre": "Not compatible with firewalls",
          "Contenu": "I was able to download - but because of the firewalls on my work computer i was not able to access all of the program components without getting IT support. (I needed IT admin permission to do anything that wasn't basic. Had to get a second computer to access the program. Very frustrating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lorentz Loriston",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T02:52:36.000Z",
          "Titre": "I like the software",
          "Contenu": "I like the software. I have usage for it to conduct analysis of data for policy revision."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "M.U.",
          "Nb_Reviews": 1,
          "Date": "2018-07-06T16:15:20.000Z",
          "Titre": "There was a cumbersome process of…",
          "Contenu": "There was a cumbersome process of having to have to provide personal info (not only student ID but financial standing at the Univ...etc.) which I did not think was necessary to be able to use the software - which was asked after I already purchased. Then, there was a confusion on what is the key code vs. password. I think one terminology should be used so that the consumer can have easier experience in purchasing/accessing the program."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Alexandre",
          "Nb_Reviews": 1,
          "Date": "2019-01-02T01:14:00.000Z",
          "Titre": "Sells software like its 1996",
          "Contenu": "Only went there because in was mentionned in my course synopsis. I paid for a software and received it. Otherwise its one of the uglyest and non intuitive website ever created. Reminds me of 1996 or a store where all the goods are always on sale at 50% all year long amd the store manager calls you \"my friend\"."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nicole",
          "Nb_Reviews": 1,
          "Date": "2017-10-03T18:30:17.000Z",
          "Titre": "While I understand its necessity I …",
          "Contenu": "While I understand its necessity I think that having to jump through the hoops of proving student status was time-consuming and unnecessary. Most applications simply allow the use of a working .edu account. I also found it frustrating that there was no confirmation email that stated that my student status was approved. The multiple different direction pages were also annoying. It would have been nice to simply have the complete instructions in the email."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Noemi",
          "Nb_Reviews": 1,
          "Date": "2018-02-04T17:59:15.000Z",
          "Titre": "The website and ordering process is not …",
          "Contenu": "The website and ordering process is not user friendly. There’s extra clicks that aren’t necessary, just keep it simple :) Also, the website just screams at you, as a user I’m a bit overwhelmed with the information. It took me 10 mintues to find a simple button because of the information overload. Same thing with the email that was received after my purchase. Wordy and time consuming. Just give a button to verify and below it any other information you’d like to market to me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2014-10-20T11:46:14.000Z",
          "Titre": "a rocky start but ended well",
          "Contenu": "I bought IBM SPSS Graduate Premium package which did not come with all the product discribtion said it should. Initially I got \"we can not help you\" responce. Then after I wrote a complaint the company looked further into the issue and it looked like I did not receive some important pieces of softwear. The company ended up sending me what I needed in order to complete my school work."
        },
        {
          "Note": 3,
          "Lieu": "JM",
          "Pseudo": "Wendell",
          "Nb_Reviews": 1,
          "Date": "2018-03-24T06:05:05.000Z",
          "Titre": "I purchased a product in 2016 with my…",
          "Contenu": "I purchased a product in 2016 with my credit card and didn't have any problems. When I tried purchasing an updated version a few weeks ago, I was told that my country couldn't make purchases. Yet the country was available for selection. I had to use the StudentDiscount address to purchase the product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gail",
          "Nb_Reviews": 2,
          "Date": "2014-10-02T14:22:04.000Z",
          "Titre": "Software Crashes Mac",
          "Contenu": "There was no problem with my purchase or the service.  The service was great and quick.  However, the SPSS 22 Grad Pack download purchased with your company crashed my MacBook Pro costing me $200.00 to get it working again.  Can you explain the problem with the software download?  I still need to work with the program to complete my dissertation."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DANIEL",
          "Nb_Reviews": 1,
          "Date": "2015-05-18T15:18:44.000Z",
          "Titre": "license authorization for spss21",
          "Contenu": "Less than a month ago I ordered spss21 standard which is valid for one year.  After download was completed including license authorization, a message appeared on my screen saying my authorization will expire in 26 days. I was shocked and very displeased. I have notified customer service about the problem and the issue is not resolved.  I am currently in the midst of data analysis for my dissertation and this situation may not yield good rating for your service"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Stephanie L",
          "Nb_Reviews": 3,
          "Date": "2017-11-05T22:14:59.000Z",
          "Titre": "Perfect for University",
          "Contenu": "Easy to buy, complicated download process, to many steps, and annoying procedure, could have been a couple steps, but it was not.  Had to search my computer, and then manually download the program...  But good price, for what you get , as a student program.  Spss us a big rip off price normally so I guess its ok."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Neil",
          "Nb_Reviews": 1,
          "Date": "2015-06-08T14:56:51.000Z",
          "Titre": "Quick Books Pro",
          "Contenu": "Don't like the new program. It uses your old program files. Not user friendly at all. Waste of money, wish I had just stayed with the old software. Download of purchase worked after several tries. I requested a hard copy and never did receive it. Not that happy with Student Discounts. Will look somewhere else next time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ying",
          "Nb_Reviews": 1,
          "Date": "2018-09-29T03:37:58.000Z",
          "Titre": "I experienced some difficulty figuring…",
          "Contenu": "I experienced some difficulty figuring out how to download the program after paying for it. Also, still not quite sure if I bought a program or just renting it... I would have preferred just buying a program online and paying some sort of amount over time until an end date for the payments."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 1,
          "Date": "2017-09-13T22:13:45.000Z",
          "Titre": "Well I appreciate the relatively fast …",
          "Contenu": "Well I appreciate the relatively fast turnaround between my ordering, providing documentation, and receiving word about my purchase, i'm not so happy with the final experience. I purchased  The software Endnotes  and my \"key\" did not work. I was immediately referred to the manufacture. This is not a good practice I have not even opened the software yet. At the point of purchase, I should've received assistance for getting a verification  code to authorize the software.  I'm not sure I will order again"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2017-04-10T04:40:37.000Z",
          "Titre": "Upon the purchase of each software …",
          "Contenu": "Upon the purchase of each software subscription, the license codes were not immediately (or automatically) forwarded to me and only after I followed up were the codes sent in a message that said:\"Here's the code:#####(License number)########\"The assistance was expedient tho."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aneesha",
          "Nb_Reviews": 2,
          "Date": "2014-09-18T15:31:24.000Z",
          "Titre": "Confusion about product",
          "Contenu": "I had a question about the product because it wasn't working properly, and I sent in a detailed message to Student Discounts explaining the issue. However, I got a response that was completely unrelated to what I had asked, and I had to figure out the issue on my own. Next time please ensure that your customer service representatives take more care when it comes to such expensive packages, because we as students are very  limited on time and need all of our purchases to work properly when we purchase them. Thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jonna",
          "Nb_Reviews": 1,
          "Date": "2014-07-21T20:45:49.000Z",
          "Titre": "Please fix the online download...it was problematic!",
          "Contenu": "You have a great product but the download is awful..I spent $4.99 for nothing! I am happy that I also purchased the disks! The company representative could not help me solve the issue over the phone which was frustrating! But in fairness he did say that people have problems with the download. On my opinion, if so many people have problems with the download, the company has the obligation to fix it or not offer it...too frustrating for students needing the software quickly. Thanks for providing the product! Just fix the download glitches!"
        },
        {
          "Note": 3,
          "Lieu": "KR",
          "Pseudo": "Mia J",
          "Nb_Reviews": 1,
          "Date": "2014-12-27T00:27:23.000Z",
          "Titre": "SPSS",
          "Contenu": "After purchasing the program, I was dismayed to find the basic version didn't allow access to two-way ANOVA. I think this needs to be made explicit in the program's description. This way, those who need to use two-way ANOVA can purchase the advanced version from the start."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Janet",
          "Nb_Reviews": 1,
          "Date": "2015-10-23T23:01:31.000Z",
          "Titre": "Offer was not clear that had to be a College Student instead of a Teacher to qualify to purchase!",
          "Contenu": "Repeat customer and tried to purchase another SW package.  Paid for it and then was asked for more ID info.  The info earlier said if you'd purchased in the past year your ID was on records so no more needed.\rAfter completing the purchase got an email stating \"need more ID info, etc.\"  \r I then got email stating SW was only available for college Student (University) and that must have college ID to qualify.   Why wasn't that in the original description or more clearly stated at the time of purchase?\r Not happy as was buying for an elementary teacher, not a student."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "KM",
          "Nb_Reviews": 1,
          "Date": "2015-05-04T19:06:19.000Z",
          "Titre": "Questionable ethics towards students",
          "Contenu": "While the products work well, are relatively affordable, and easy enough to download, the ethics towards students are questionable.  I purchased a product, but later on realized it did not have all of the capabilities I needed.  So I wanted to purchase an upgraded version of the software and was hoping to get some kind of credit towards the new product.  I was told that this was not possible and would have to buy the product in full...essentially buying the same product twice.  For a company that is supposed to be helping cash strapped students, this is a very stingy way of doing business."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Willa",
          "Nb_Reviews": 1,
          "Date": "2016-01-28T23:17:15.000Z",
          "Titre": "Very difficult road to be able to use the product",
          "Contenu": "I purchased SPSS and got the less expensive version only to discover that ti is not have all of the components loaded.  I wanted to upgrade and this was not possible I had to buy an additional program at another $99.   This program also did not work and I had to call the company and they have do to some kind of finagling to get it to work.  It sounded very loud like a mad scientist working and doing several things as I was put on hold multiple times.  Three weeks into my class I could finally use the software.  This was extremely frustrating and I lost money ordering a program that was not complete."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2018-02-24T18:49:44.000Z",
          "Titre": "Installation Instruction Error",
          "Contenu": "The software did not work properly for a long time after I purchased it. An IT employee at my practicum was able to get it working, but without the menu option, rendering it useless.  However, once I contacted studentdiscount.com's tech support, they said to fill in a name and institution during installation when asked to do so, which I left as the default (not blank) the first 2 times I installed it.  According to the installation instructions, the direction was to leave no field blank, it does not indicate all fields need original designations.  Now that the software has been installed correctly it is running fine."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2015-06-17T15:02:50.494Z",
          "Titre": "Big glitch with software purchase",
          "Contenu": "I purchased a one-year license on a particular product only to have the license spontaneously expire before the year was up. I did not create an account when I purchased, so I had no way to prove the expiration was premature and was forced to purchase another license. Be sure to create an account that stores your order info.\r UPDATE (this is in response to the reply below from StudentDiscounts.com): I did indeed place an order for a 3-year license in 2011. When that expired, I placed another order for a 1-year license on September 16th, 2014 for $94.98. That license expired in May of 2015...prematurely."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2014-09-22T23:21:06.000Z",
          "Titre": "Too many issues",
          "Contenu": "I purchased the SPSS Premium GradPack. I received a licensing code promptly, but the license did not work. I tried emailing StudentDiscounts, but received no response so I emailed IBM who got it to work. Once it worked, however, I realized I did not get the version I ordered (the Base is very different from the Premium). I called StudentDiscounts and was told to call back the next day. I did and they sent another code which also did not work. The person did not know what to do so I contacted IBM again and they did get it to work.\r Overall, although they were somewhat helpful, I had too many issues to give them more than three stars."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pam P",
          "Nb_Reviews": 2,
          "Date": "2014-09-07T22:32:53.000Z",
          "Titre": "Mmm...not the greatest",
          "Contenu": "The website could've been a little more user-friendly, and the fact that I had to send proof that I'm using the software for a class was a pain in the butt. Especially since I'm now having issues with the software not working."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Caitlin",
          "Nb_Reviews": 1,
          "Date": "2015-06-17T19:26:57.646Z",
          "Titre": "real deal, want better customer support",
          "Contenu": "the product is real. however, i had some trouble with launching the version of spss i purchased on my mac. student discounts was unable to provide any customer support on this issue, leaving me without any help to figure out the matter."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "M",
          "Nb_Reviews": 1,
          "Date": "2020-09-07T23:31:38.000Z",
          "Titre": "Issues with license expiring early ended with bonus year",
          "Contenu": "I purchased a 3 year SPSS license from StudentDiscounts only to find it expired less than 1 year later. I tried multiple times over almost a week lodging the issue with various email and online chat support staff, but each time staff would tell me that they didn't have authority and needed to escalate the issue... then no one would respond! FINALLY, within hours after I posted a negative review online I received support. Coincidence or not? I'm not sure.I have now been issued with another 3 year license and (assuming it lasts its full term) get a bonus year for my trouble. While I would've preferred not to have had the wasted time and frustration, I'm grateful that the problem was able to be resolved (I hope)!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JackieM",
          "Nb_Reviews": 1,
          "Date": "2017-01-27T12:59:20.000Z",
          "Titre": "SPSS Download",
          "Contenu": "As a technology person, I have certain expectations of the process of downloading software. It seemed a bit strange to me that when I purchased the software I was sent a link to a PDF file which then provided the instructions for how to download the software and a link to the software download.I was expecting an email with a link a link to the software and further instructions so a link with a PDF to me was confusing.Also, as a first time user, I had to send my credentials as a student and it wasn't clear to me that I could download the software--there was no acknowledgement that my credentials were received, which caused a delay on my part in downloading the software."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Serena",
          "Nb_Reviews": 3,
          "Date": "2015-09-23T18:22:56.649Z",
          "Titre": "Pretty painless",
          "Contenu": "There were a few hiccups, but I think it was due to the notices of the viruses. If you do ignore them, it shuts down the program. In any event, it did work after a while. Worth the price overall.\r Thank you,\r Serena Monzo"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2017-02-24T16:05:36.000Z",
          "Titre": "ISSUE RESOLVED",
          "Contenu": "UPDATE: UPDATE: The people from the company contacted me directly regarding me negative review. They were very professional and concerned regarding my experience and circumstances with their company, product, and resolution. They offered to provide me with a free disk of the program purchased and promptly provided me with a full refund. They continued to follow-up to ensure I was satisfied with the resolution. I am completely satisfied with the customer service and resolution of my transaction. ORIGINAL POST:  Product did not load or work on my computer. IT guy out of the office. They say you have to pay for an additional disk. No thank you. Called my bank to get my money back."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Najla",
          "Nb_Reviews": 1,
          "Date": "2018-08-14T00:20:39.000Z",
          "Titre": "No product activation link!",
          "Contenu": "I was misled by one of the customer service associates on the live chat. I specifically asked if the product I'm buying can be downloaded immediately after purchase and he said yes. The product didn't come with a download link and I had to talk to 3 different people on the live chat about this but no one was able to help or identify the problem. I was not even able to cancel my order and get a refund since it was after hours. Finally I received an email the next day saying my product is supposed to be shipped. Eventually I received a license key to activate it instead of waiting on the shipment. My experience would have been better if I knew the product couldn't be downloaded right away."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2016-11-02T23:47:43.000Z",
          "Titre": "Support after the Sales",
          "Contenu": "Originally I did not get assistance with uploading the software on my MAC I am modifying my original post as the company did contact me to assist with the upload of the software on my system so I appreciate the effort."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Holistic1 1",
          "Nb_Reviews": 1,
          "Date": "2019-03-20T12:37:11.000Z",
          "Titre": "I am satisfied with the product but not the service.",
          "Contenu": "I am satisfied with the product but not the service. I had to pay twice for the base pack and then the standard grad pack not knowing that the base pack would not do the regressions and factor analysis for my course. I was in a panic for a week not understanding why I could not perform functions and then called to speak with a rep. I paid twice without complaint as I was relieved to be able to still continue with my PhD course - however I think this should be made much clearer to students. Customer service could have offered a 10% discount or a discount coupon for future purchases due to my experience, I am not seeking anything now but think this could have been handled in a better way to retain a future customer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Will",
          "Nb_Reviews": 4,
          "Date": "2016-06-05T13:23:08.000Z",
          "Titre": "A little more clear with instructions in the beginning",
          "Contenu": "At first it was just the teacher ID. I scanned it and was ready to send it but in the email instructions I had to send a pay stub. I scanned it and sent it. I waited two days and had to call to receive the software."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "sadpanda",
          "Nb_Reviews": 1,
          "Date": "2019-01-07T23:58:15.000Z",
          "Titre": "Great customer service but software often doesn't work",
          "Contenu": "Great customer service but the doesn't work (constant crashing, despite trying many times with different versions). They are fully aware the latest version they sell doesn't work on the latest Macbook (models from 2018) yet it doesn't say that anywhere on the product page. That said the customer service is great as they do try to make things right and troubleshoot and offer a refund. So I do love that and keep coming back because of it. I should also note the software I buy from them (SPSS) is notoriously buggy so a lot of it is not their fault. But they should still tell you not to buy versions with known compatibility issues, and I've had problems with SPSS from them on previous Macbooks and previous SPSS versions."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Himanshu",
          "Nb_Reviews": 1,
          "Date": "2016-11-21T04:41:52.000Z",
          "Titre": ".....",
          "Contenu": "i paid for my purchase in USD. However, as I stay in Australia and needed to claim the payment, I needed the receipt in AUD. I emailed StudentDiscounts twice requesting the same but did not hear from them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 2,
          "Date": "2020-09-17T15:10:55.000Z",
          "Titre": "Problems? Email direct, not the chat",
          "Contenu": "for some reason, spss26 would not download onto my Mac. I communicated several times with online representatives, one who gave me the worst advice of going into every folder and subfolder in the IBM program to change the permissions. And after the time-consuming act of unlocking each folder and changing the permissions in each one, (that the online rep assured me would solve the problem) it still didn't work. Unfortunately, because of attempting to solve it through the online consultants, I didn't email directly to the company until right at the beginning of the Labor Day weekend, which meant I had to wait till Tuesday to hear back from anyone. However, once I did, it was a simple return email from the company with a different link which dowloaded the app which now works perfectly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Josie",
          "Nb_Reviews": 1,
          "Date": "2016-03-19T21:03:01.000Z",
          "Titre": "Can't hold promises",
          "Contenu": "I was supposed to get a hourly quote because I couldn't afford the package, and never received it. But, instead got an astronomical quote that I refused. After refusing it, I never got a reply back."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cathaleena",
          "Nb_Reviews": 1,
          "Date": "2014-10-30T17:42:16.000Z",
          "Titre": "Overall quick, but alot of extra validation",
          "Contenu": "I was able to order the software and I got it pretty quickly, but there is another validtion process that you have to do before you can actually download the software....didn't really like that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cassidy",
          "Nb_Reviews": 1,
          "Date": "2014-07-19T17:12:01.000Z",
          "Titre": "In the End I DID Get the Product",
          "Contenu": "Although it took some time and there was difficulty, the product did come and it does what it's supposed to. When they know they have an unsatisfied customer they definitely hurry to rectify."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Alexandra",
          "Nb_Reviews": 1,
          "Date": "2016-02-17T07:58:11.000Z",
          "Titre": "meh.",
          "Contenu": "not really into the poor exchange rate. What was $80.00 USD ended up bein $100.00 CAD. Also a computer science friend had to help me open SPSS on my MAC. Your instructions fell short."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "cathy",
          "Nb_Reviews": 4,
          "Date": "2014-08-28T17:34:46.000Z",
          "Titre": "SSPS VERSION 22- UNABLE TO DOWNLOAD TO MY COMPUTER",
          "Contenu": "I was not able to download the program to my computer, so the amount that I paid for the program is a waste of good money.  I will not recommend this program to future DNAP students."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Annette",
          "Nb_Reviews": 1,
          "Date": "2015-09-29T22:31:02.000Z",
          "Titre": "Problems but I got my software",
          "Contenu": "I didn't get my download email in a timely manner.  I also purchased SPSS from them last year and it stopped working 3 months before my license expired with no way to fix it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2018-10-31T16:54:58.000Z",
          "Titre": "SPSS purchase",
          "Contenu": "Download process and instructions were clear, but the file was difficult to find once downloaded. Additional instructions for initial program startup would be helpful!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2015-05-11T05:39:47.000Z",
          "Titre": "Don't Order on Friday",
          "Contenu": "The price was good and the overall experience was satisfactory.  My only frustration was that I ordered my product on Friday afternoon with the assumption that I would be able to easily verify my status as a current student and download the software (SPSS) within a few hours.  Because it was Friday, and from what I could tell nobody is available after Friday at 5 and over the weekend, I had to wait until Monday and call/email before I was able to be verified.  I have ordered from other websites that require verification and was able to download my software the same day.  I was hoping to use the software over the weekend and thought about canceling my order and going somewhere else but the website has little information and nobody available over the weekend so I was concerned I would still be stuck with the bill if I took this route.  Do not order Friday if you need the software quickly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frustrated",
          "Nb_Reviews": 1,
          "Date": "2014-12-19T00:58:08.000Z",
          "Titre": "Product and pricing good; customer service lacking!",
          "Contenu": "I was furious the day I made my purchase from StudentDiscounts.com. The purchase was made. The personal forms sent and....nothing; dead silence from them. There was no confirmation email for either the sale or the documents and the phone rang off the hook for hours without so much as a beep or a automated message. I felt sick, thinking I had just been duped into handing over my personal information to a scam.\rI tried to cancel payment and wrote a strongly worded letter to their contact email. Within an hour they had contacted me and sent my product, which worked as promised. Though they made the excuse that they were busy that day and had to jump my order to the front of the line.\rI think the products and prices they offer are great but their customer service needs some serious upgading to an automated response system since they are too overloaded to properly treat there customers with the service they deserve."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2015-09-29T17:41:00.000Z",
          "Titre": "Terrible shipping & handling",
          "Contenu": "Took more than a week over what I was told could be the shipping time to get the package. I haven't even installed it yet, its taken so long."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Brian Cooper",
          "Nb_Reviews": 1,
          "Date": "2022-05-29T04:21:23.000Z",
          "Titre": "Had to purchase a second licence to…",
          "Contenu": "Had to purchase a second licence to install on a second computer as the computer had failed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alexander",
          "Nb_Reviews": 1,
          "Date": "2017-09-25T13:25:49.000Z",
          "Titre": "I had to call a few times to get an …",
          "Contenu": "I had to call a few times to get an issue fixed, the staff team helped pretty well but i wish i had not had the issue in the first place."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Darren",
          "Nb_Reviews": 1,
          "Date": "2015-04-15T07:11:25.000Z",
          "Titre": "it works, but took a long time",
          "Contenu": "It took several attempts to get the software installed, but I am happy...now that it's over  will buy again if necessary. Great price."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Lillian",
          "Nb_Reviews": 1,
          "Date": "2016-09-06T08:57:01.000Z",
          "Titre": "Good product but lacking information",
          "Contenu": "Good product, but not super easy to understand what you need to do. Confirmation email of student ID verification would be better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rebecca",
          "Nb_Reviews": 1,
          "Date": "2019-05-02T13:33:52.000Z",
          "Titre": "I purchases SPSS in September 2018 with…",
          "Contenu": "I purchases SPSS in September 2018 with a license for two computers. I installed on one. That computer died and when I tried to install the second copy on my new computer, it wouldn’t work. I contacted the company and was asked for the order number. I supplied the purchase receipt with the order number. The reply was the same; I was asked to provide the order number again. As a doctoral student, I needed this program to complete a course project, so I had no choice but to purchase another copy as customer service response was not effective.NOTE: Quickly after posting this review, I received a phone call from Student Discounts.  They offered to reset my subscription so I could download the second copy I had originally paid for, but was unable to access.  I had since purchased a second license and was in the middle of data evaluation, so I did not want to lose the new license and potentially any data I was working with currently.  The resolution was they refunded the cost of the second license.  I do appreciate the customer service resolution."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lynne",
          "Nb_Reviews": 2,
          "Date": "2014-09-11T02:07:26.000Z",
          "Titre": "My download didn't work, didn't receive confirmation of purchase",
          "Contenu": "I didn't receive confirmation of purchase. My download was unsuccessful. They gave me the Intuitive # to call."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Liza",
          "Nb_Reviews": 1,
          "Date": "2017-06-09T22:05:46.000Z",
          "Titre": "Authenticity code and downloading did …",
          "Contenu": "Authenticity code and downloading did not match   code provided only was for 10 days when I paid full price."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2015-12-05T20:29:11.211Z",
          "Titre": "software is good, installation is a pain",
          "Contenu": "Took 1 day and many emails back and forth to get installed.  Now it works great, but it was a journey"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bryon",
          "Nb_Reviews": 1,
          "Date": "2016-04-02T16:52:00.000Z",
          "Titre": "Avid product issue",
          "Contenu": "Good rate, good delivery time, but my Avid product (Sibelius) came with the wrong activation code."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "1111",
          "Nb_Reviews": 1,
          "Date": "2018-09-28T16:28:37.000Z",
          "Titre": "The website was not that user friendly…",
          "Contenu": "The website was not that user friendly and took me some time to figure out how to check out"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "emily",
          "Nb_Reviews": 1,
          "Date": "2017-09-12T03:08:29.000Z",
          "Titre": "It was difficult to download on my Mac …",
          "Contenu": "It was difficult to download on my Mac and run the program, had some trouble at first."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Erich",
          "Nb_Reviews": 8,
          "Date": "2019-07-26T15:39:27.000Z",
          "Titre": "Solved the issue",
          "Contenu": "OK now, there are ways to upload SPSS on Mojave. The program is called Parallels"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "STELLA",
          "Nb_Reviews": 2,
          "Date": "2015-10-30T15:49:26.000Z",
          "Titre": "Great Initiative!",
          "Contenu": "Prices are fair, but the website is confusing. I would re-map and organize the flow."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ami",
          "Nb_Reviews": 1,
          "Date": "2017-01-23T17:57:11.000Z",
          "Titre": "Studentdiscounts",
          "Contenu": "Trouble signing in post download but overall it was okay. I love the prices."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Kirsten",
          "Nb_Reviews": 1,
          "Date": "2019-09-30T06:09:01.000Z",
          "Titre": "Abhorrent (update: then improved) customer service.",
          "Contenu": "I purchased a 2-month subscription to SPSS as my license had just run out and I was on a tight deadline what with my honors thesis being due in under 3 weeks.  Upon attempting to run the analyses I was required to do, I realised I had accidentally purchased an insufficient version of SPSS.  As per the instructions on the website I contacted the company via their support email requesting an exchange.  I sent them two emails, two days apart, and have still heard nothing 9 days later.  As a result, I have wasted $50ish dollars on a program that is of no use to me, and had to make three 1-hour round trips to campus specifically to use their computers to run my analyses.  Will never purchase anything from StudentDiscounts again, and will warn away anyone who considers doing so.UPDATE: Less than an hour after I posted my original review, the 'head manager' of StudentDiscounts contacted me to apologise and offered to upgrade my version of SPSS to the required one free of charge.  As I told him, the crisis period has already come and gone, so having access to the program is of far less assistance than it would have been 1.5 weeks ago, but the gesture is appreciated.  I'm changing my review to a mid-way 3 stars in light of this development.  Hopefully StudentDiscounts review their turnaround times for support requests, as other than not receiving communication from them of any kind (which burdened me greatly IRL) until I left a negative review, I have no complaints about their business."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2018-02-06T17:32:09.000Z",
          "Titre": "Purchase went well until my activation …",
          "Contenu": "Purchase went well until my activation email did not come through."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tracy",
          "Nb_Reviews": 3,
          "Date": "2019-06-05T06:30:36.000Z",
          "Titre": "Great Product, Poor Customer Service",
          "Contenu": "The product is working great. However, I was very disappointed with customer service. It took a few hours for me to remedy the download problem. I event so far as attempting to have Geek Squad attempt to install the program. Their assessment was that the download key was not compatible with the program, which made sense to me as the error message indicated. Two confirmations.  However, when I called StudentDiscount and told a salesperson about the problem and the recommended problem as described by Geek Squad, he would not listen to m and insisted I uninstall the program (4th or 5th time) and try a reboot. When I told him I'd performed the same procedure several times he insisted I \"try\". I reluctantly did with the same results. Then and only then did he submit report to their IT department. Actually, I had already contacted their IT department and got an email telling me that they would respond within 24 hours. I really wanted to get going with using the program, so that's when I used the live chat feature to dialogue with the sales person. After talking with the sales person, he sent me an email indicating that he'd filed a service report and someone would respond within the next 24 hours. Later that morning, I received a couple of emails. One indicated that problem sounded like a computer problem or something. The other, from the same source, indicated definitively that I had the \"wrong product key\" and posted the correct one (LOL). Full circle back to what I knew hours earlier and what the salesman did not believe. Again, great product poor customer service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michu",
          "Nb_Reviews": 1,
          "Date": "2016-02-05T20:43:15.000Z",
          "Titre": "Not bad.",
          "Contenu": "A little confusing with the download, but otherwise it was good."
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "ofer kis",
          "Nb_Reviews": 1,
          "Date": "2022-07-30T22:26:07.000Z",
          "Titre": "No followup after purchase"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jackson",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T00:14:12.000Z",
          "Titre": "Website not very intuitive.",
          "Contenu": "The software buying experience could be improved on."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cristina",
          "Nb_Reviews": 1,
          "Date": "2017-09-25T04:48:21.000Z",
          "Titre": "Good prices, So-So Ordering Software",
          "Contenu": "Good prices, but ordering software could be improved,"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Jm",
          "Nb_Reviews": 1,
          "Date": "2020-12-14T22:50:50.000Z",
          "Titre": "I did not recieve a discount with my…",
          "Contenu": "I did not recieve a discount with my purchase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Terry",
          "Nb_Reviews": 1,
          "Date": "2017-11-26T21:16:30.000Z",
          "Titre": "Needed help to load",
          "Contenu": "Needed help to load, but it all worked out good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Harrison",
          "Nb_Reviews": 1,
          "Date": "2018-01-29T17:07:18.000Z",
          "Titre": "Website ui/ux and clarity could be …",
          "Contenu": "Website ui/ux and clarity could be improved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Yasmine",
          "Nb_Reviews": 1,
          "Date": "2016-10-04T17:40:23.000Z",
          "Titre": "Costumer service",
          "Contenu": "They take customer service very seriously."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sara",
          "Nb_Reviews": 1,
          "Date": "2016-02-11T02:26:25.000Z",
          "Titre": "hard to download",
          "Contenu": "poor website design, hard to navigate"
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "Charles",
          "Nb_Reviews": 1,
          "Date": "2020-09-26T06:01:53.000Z",
          "Titre": "Hard to find download file."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pete",
          "Nb_Reviews": 2,
          "Date": "2017-04-30T16:31:34.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience. No hassles."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "CARMEL",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T05:22:23.000Z",
          "Titre": "The SPSS product is great to work with…",
          "Contenu": "The SPSS product is great to work with and installing it was quite intuitive. However, when I called for IT support, the person I spoke with was disrespectful. I am 60 years old and I was treated like a child."
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "Sadıka",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T21:18:52.000Z",
          "Titre": "Installation problems",
          "Contenu": "While installing the program there was a warning about ‘ local computer’, I was able to fix this problem very hardly. But now I can use the program now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Caegan Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T04:11:26.000Z",
          "Titre": "Customer Service was Great!",
          "Contenu": "I had a bit of trouble with the software on my Mac but after emailing the contact given for assistance I was given a solution in a very reasonable amount of time. I would definitely recommend just off of the customer service experience alone."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Stefano",
          "Nb_Reviews": 4,
          "Date": "2023-11-13T15:39:47.000Z",
          "Titre": "I am fully satisfied with the service",
          "Contenu": "I am fully satisfied with the service, fast and efficient, with an extraordinary economic benefit.A small note: on November 9th I purchased a \"12 month\" license which however expires after 11 months, on October 14th 2024."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LL",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T13:04:26.000Z",
          "Titre": "Tricky but Successful",
          "Contenu": "The licensing wizard wouldn't open for me to add the license for the first few weeks and I had to delete and redownload the software in order to get it working correctly. But the student discounts team was very supportive and made every effort to support me and get the software running."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "mark shepit",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T19:51:23.000Z",
          "Titre": "Overall Great, Maybe One Thing To Consider",
          "Contenu": "overall, my experience was very good. there is one issue with your setup for purchases though. i think it might be helpful to have a link right beside the key code for the activation. If i remember correctly, i encountered some challenges with a seamless download around this point. at any rate, the idea to allow SPSS upgrades (without having to purchase a new one) is a great one. the 24 hrs chat also helped a bunch. I hope the upgrade and 24/7 chat remain in your business plan.mark"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "LhachoLa LhachoLa",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T03:32:03.000Z",
          "Titre": "It was really a matter of great concern…",
          "Contenu": "It was really a matter of great concern for students' welfare  that SPSS latest versions is made easily accessible and affordable to students  with great convenient in  split discount and choices for 6 months, one year and so on.  I appreciate the move."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Scimeca",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T19:21:36.000Z",
          "Titre": "My Experience with StudentDiscounts.com",
          "Contenu": "The overall experience went smoothly and without any noticeable flaw. My only issue was that the website's UI felt very cluttered."
        },
        {
          "Note": 4,
          "Lieu": "JM",
          "Pseudo": "LM-P",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T19:34:53.000Z",
          "Titre": "Very good experience",
          "Contenu": "The process was very smooth and when I was ready to download, there was no glitch with the download process.  The step by step instructions made it even better as I did not have to be wondering what to do.  Very positive experience overall."
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Kiet-ye-obong Udoeshiet",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T18:59:52.000Z",
          "Titre": "Feedback",
          "Contenu": "Well, right from the moment I made the purchase to the time of installation I felt as though I had someone physically guiding me throughout the process. Nevertheless, it would be great if the company make timely feedback."
        },
        {
          "Note": 4,
          "Lieu": "LK",
          "Pseudo": "Kemiya Kodituwakku",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T20:19:24.000Z",
          "Titre": "Great Initiative",
          "Contenu": "Appreciate the effort taken to make such software available at affordable rates for all students. I wish more incentives can be provided specifically to developing countries as even the discounted rate is sometimes not very much affordable. Having Norton security on board, and as well as being recommended from IBM, lead me to trust your site and download the product."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Atul Prashar",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T13:30:35.000Z",
          "Titre": "Great overall experience, go for it!",
          "Contenu": "Update 2023-07-31:Realized today that the support responded swiftly to my student email. I was all the time checking my personal mailbox as the confirmation of complaint registration came there. Eventually, the responses and the license key got buried in my student mailbox.I thank the support for their swift action, and their offer to refund money if I am not satisfied. I did not take the refund as my software license got vadidated today.I correct myself and state that Student Discounts has been the right place to get SPSS software for your research work as a student. Now I can even confirm that they are very swift in their support as well. You will be in safe hands.___________________________________First review - 2023-07-17Ordered AMOS 29 2-year license on July 17 but have not yet received the license keys. Look like my money ($79) is gone.The customer support is completely unreliable as every time I raise a request over the live chat, an email is sent and nothing happens. So, far I have 2 emails from 2 separate requests I sent for license keys.I will not trust and will not recommend this site to buy licenses. I have had consistently good experience with \"onthehub\". Feeling bad why i did not order this from there."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roger",
          "Nb_Reviews": 2,
          "Date": "2022-10-19T11:51:00.000Z",
          "Titre": "THE SOFTWARE WAS PERFECT",
          "Contenu": "THE SOFTWARE WAS PERFECT; PAYMENT SYSTEM QUICK AND REASSURING; VALIDATION OF FACULTY STATUS WAS A BIT STICKY AS SLIGHTLY DIFFERENT INSTRUCTIONS APPEARED ON DIFFERENT PAGES.IN THE END, EVERYTHING WAS FINE, DEFINITELY WILL DO BUSINESS WITH THEM AGAIN."
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "Shanti Budi Lestari",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T03:48:39.000Z",
          "Titre": "It's my first time using…",
          "Contenu": "It's my first time using studentdiscount.com hence I had an obstacle with different language. But after all I get what I bought and no more any problem. Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amanda Oviatt",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T00:59:36.000Z",
          "Titre": "The videos were helpful in downloading…SPSS 29",
          "Contenu": "The videos were helpful in downloading the product. However, the download button to reach the PDF was not in an obvious place within the email confirmation."
        },
        {
          "Note": 4,
          "Lieu": "LT",
          "Pseudo": "Simon",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T07:37:59.000Z",
          "Titre": "Reliable with a room for buying experience improvement",
          "Contenu": "The website is reliable and I got my product that I bought. However, the buying process and verfication process of student status need to be improved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis Bueso",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T05:24:24.000Z",
          "Titre": "Some of the links to the tutorial didn't work",
          "Contenu": "Some of the links to the tutorial videos didn't work. Otherwise, easy download. Recommend checking those tutorial links though!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Bella Furness",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T12:19:58.000Z",
          "Titre": "Legit Product, pity access is only 11 months NOT 12 as purchased!",
          "Contenu": "Cheaper alternative to legit product, thank you!Easy to download and install, thank you!Purchasing 11 months access instead of 12 - deceptive!!"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Khang Li Looi",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T21:33:38.000Z",
          "Titre": "Great online chat help service",
          "Contenu": "The sales rep was very helpful online and tried her best to resolve my questions"
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "JunJae Lee",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T13:41:31.000Z",
          "Titre": "Very good",
          "Contenu": "Very good. However, it is disappointing that there is no repeated measures analysis of variance."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Meera",
          "Nb_Reviews": 4,
          "Date": "2023-09-11T12:17:10.000Z",
          "Titre": "Excellent job one of the best company…",
          "Contenu": "Excellent job one of the best company in the world"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Samuele Cesarini",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T20:33:01.000Z",
          "Titre": "Pointed, precise and timely done",
          "Contenu": "It was reactive and exaustive in the answer. Good support and prepared people"
        },
        {
          "Note": 4,
          "Lieu": "GT",
          "Pseudo": "Johan Emanuel Palacios Rivera",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T20:37:16.000Z",
          "Titre": "Service is good but can improve",
          "Contenu": "The payment experience was excellent, the only inconvenience I had was when activating my license on a second computer because it was not activated instantly and I had to send an email"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Theodore West",
          "Nb_Reviews": 1,
          "Date": "2023-03-25T03:04:10.000Z",
          "Titre": "Doctoral Student Statistics software",
          "Contenu": "A good price for this item.  I did not find it easy to get the software on both my computers, so it is only on my desktop as of now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AN",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T22:06:28.000Z",
          "Titre": "Everything was great",
          "Contenu": "3verything waws great, just a little confusing on the download."
        },
        {
          "Note": 4,
          "Lieu": "LB",
          "Pseudo": "Kareem Abu",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T11:37:13.000Z",
          "Titre": "Order:368244 Offline Use right on my Pc",
          "Contenu": "With the licence, I activated the already installed trial version SPSS software, without having to re-install from the purchased software package."
        },
        {
          "Note": 4,
          "Lieu": "LV",
          "Pseudo": "Inita Kronberga",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T18:34:39.000Z",
          "Titre": "It's difficult to gind students spss"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Erin",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T01:12:49.000Z",
          "Titre": "Simple to download and install"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michel Holder",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T12:15:35.000Z",
          "Titre": "Great site ever!",
          "Contenu": "Great site ever!The customer service is also very good."
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "Panagiotis Ballis-Papanastasio",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T09:08:33.000Z",
          "Titre": "Easy to complete",
          "Contenu": "Easy to complete. I was able to download SPSS without any issues."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "LEOPOLDO GARCIA VANEGAS",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T22:31:32.000Z",
          "Titre": "It was easy download the software."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gail W Lazard",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T19:25:52.000Z",
          "Titre": "Thanks for all the help!",
          "Contenu": "Thanks for all the help; I was able to download the spss package."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Claudia Pérez Flores",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T23:06:58.000Z",
          "Titre": "All is ok",
          "Contenu": "All is ok, the only thing is something's the language in Spanish."
        },
        {
          "Note": 4,
          "Lieu": "TZ",
          "Pseudo": "Bosco",
          "Nb_Reviews": 2,
          "Date": "2023-10-16T06:30:21.000Z",
          "Titre": "Good",
          "Contenu": "Is working well"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Reginald",
          "Nb_Reviews": 3,
          "Date": "2022-12-02T15:57:12.000Z",
          "Titre": "Prompt service",
          "Contenu": "Prompt service, install went well."
        },
        {
          "Note": 4,
          "Lieu": "KH",
          "Pseudo": "Hsandy Thovy",
          "Nb_Reviews": 1,
          "Date": "2022-10-16T04:39:45.000Z",
          "Titre": "Good service with fast response."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-12T01:41:45.000Z",
          "Titre": "I found the site easy to use."
        },
        {
          "Note": 4,
          "Lieu": "BW",
          "Pseudo": "Tshidi M Wyllie",
          "Nb_Reviews": 2,
          "Date": "2022-12-03T09:37:46.000Z",
          "Titre": "Prompt response to queries",
          "Contenu": "Prompt response to queries. Thank you💕💕👌"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sad Amos user",
          "Nb_Reviews": 1,
          "Date": "2022-03-28T14:53:31.000Z",
          "Titre": "Purchased AMOS",
          "Contenu": "Purchased Amos. Version 28 wouldn't allow me to load data so I had to reach out to customer support. They ended up sending me a code for 26 that worked. Notwithstanding the initial headache that was resolved by their customer support team, it's a good product for a very good price."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Celeste A",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T05:37:35.000Z",
          "Titre": "It was a good experience!"
        },
        {
          "Note": 4,
          "Lieu": "GH",
          "Pseudo": "Nana Adwoa Konadu Dsane",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T17:13:39.000Z",
          "Titre": "Easy web user interface"
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Hafez Ahmed",
          "Nb_Reviews": 2,
          "Date": "2021-10-24T06:55:00.000Z",
          "Titre": "Although the five codes given to us did…",
          "Contenu": "Although the five codes given to us did not work for a few days which gave me a very hard and stressful time, you have substituted these codes by others that did work and the course is now running thanks to your help. The program is very useful for MSc students and combines practical experience and theoretical demonstrations. Thanks very muchHafez AhmedProfessor of Biochemistry and Director of ResearchDubai Medical CollegeUnited Arab Emirates"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Karen Court",
          "Nb_Reviews": 1,
          "Date": "2022-06-21T08:37:00.000Z",
          "Titre": "Amazing price for Camtasia and Snagit…",
          "Contenu": "Amazing price for Camtasia and Snagit bundle. There could have been some instruction/information about the need to wait for Techsmith to release the product so that I wasn't emailing asking where my product was."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joaquina Fontes-Lopes",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T15:01:23.000Z",
          "Titre": "Easy transaction and delivery",
          "Contenu": "Easy transaction and delivery. A bit expensive for the convenience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TES",
          "Nb_Reviews": 1,
          "Date": "2021-04-29T20:50:50.000Z",
          "Titre": "It was difficult to install",
          "Contenu": "Although the installation process was user friendly and easy to follow, it was difficult to install.  I was not getting the information when I needed it, via email, so things happened in pieces.  I do like that I was able to chat with someone 24/7 though, as I am in a different time zone than the company.  Eventually it all worked out and is running fine."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Andrea Cooper",
          "Nb_Reviews": 1,
          "Date": "2021-03-29T18:50:06.000Z",
          "Titre": "Support from StudentDiscount",
          "Contenu": "I purchased SPSS software and I had difficulty downloading it on my computer.  After several emails with Les from StudentDiscounts, he was able to get me up and running!  Although initially frustrating because I couldn't get it loaded myself, I was really pleased with the help I received and the willingness to make it right! Thanks."
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "Yongki Ahn",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T01:21:51.000Z",
          "Titre": "a little bit difficult to follow the installing method",
          "Contenu": "i’m satisfied"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sean Waddingham",
          "Nb_Reviews": 2,
          "Date": "2020-10-22T19:48:29.000Z",
          "Titre": "Good customer experience! But quite an unattractive User Interface",
          "Contenu": "Overall, the service was good, and I was able to get a student-priced copy of SPSS nice & easily, which I'm now using for a class. The proof-of-student-status process was pretty simple & easy too. However, I have to say, the user interface on this website is really below average, especially graphically. If the front-end user interface was a bit sleeker, I think it would help with the overall appearance of credibility & quality."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "L. Diggins",
          "Nb_Reviews": 2,
          "Date": "2019-08-30T18:23:50.000Z",
          "Titre": "Not Excellent, But Still Great...",
          "Contenu": "I gave it a four for the ease of purchasing the product in general. It did not require a book of information from me to register and that is a plus because I do not like such lengthy processes. However, the installation of the software I purchased (IBM SPSS) was a little confusing and it took some time on a wild goose chase before I realized the simple solution. In all, the price was good and I would consider purchasing from them in the future given the chance."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JC",
          "Nb_Reviews": 1,
          "Date": "2018-10-08T13:43:00.000Z",
          "Titre": "Good deal/service",
          "Contenu": "Very good deal for the product. Once installed, I did have some issues with the license so someone had to access my computer remotely to fix. Great service. I give it four stars because the times that the technician was actually available were difficult with my east coast calendar and were not really made clear to me. I suggest being available earlier in the mornings and later in in the evenings."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Kat",
          "Nb_Reviews": 1,
          "Date": "2018-03-15T03:14:11.000Z",
          "Titre": "Very good experience",
          "Contenu": "Really good prices and products. Was easy to download and I was using the software within an hour of purchasing. However I docked a star off because the website was not the most user-friendly. Not terrible but could be improved. Also, the descriptions for products could be more detailed, had a hard time figuring out exactly which version of the program I needed. Overall, very good website. Highly recommend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "xxx",
          "Nb_Reviews": 1,
          "Date": "2021-01-28T03:47:49.000Z",
          "Titre": "Quick service",
          "Contenu": "Quick service.  Had issue with authorization code for statistical software and customer service addressed issue in timely manner.  Delivery of download was also quick.  Prices are reasonable and comparative to other student sources.  Have been repeat customer for several years"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2018-01-15T19:24:01.000Z",
          "Titre": "I liked that you guys always get back …",
          "Contenu": "I liked that you guys always get back to me with very short notice. Recently, I have updated my SPSS to a better version, but I am still waiting for you to pay the difference as promised...I am not sure if my basic version is coming to end soon...if so, doesn't matter because it wouldn't be fair to ask that as the basic version would already be paid off...thanks for providing this service!"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Miguel",
          "Nb_Reviews": 1,
          "Date": "2018-05-12T15:28:24.000Z",
          "Titre": "stock unavailable but still shown in the online shop",
          "Contenu": "I never had problems buying from your online store until last time. I was in a hurry to by a product that is only physically delivered so I agreed to pay the extra fee to ship it faster. A day later I got an e-mail asking me to cancel or wait until next week because there was no stock.My suggestion is to keep your stock updated in the online shop so customers could do an informed decision when there is no stock.Sincerely,Miguel"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Stephanie L",
          "Nb_Reviews": 3,
          "Date": "2017-12-14T05:12:15.000Z",
          "Titre": "I first bought the SPSS basic program and then upgraded...",
          "Contenu": "I first bought the SPSS basic program for statistics class, then upgraded to a different version because the basic one did not have the features I needed to complete my homework.  Without using a trial version at home, I would not have been able to complete my assignments.  I found the customer service to correct my problem of upgrading, to be excellent.  The basic was a terrible option, for stats class, fyi.Hope this helps."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jean",
          "Nb_Reviews": 1,
          "Date": "2018-05-03T00:46:52.000Z",
          "Titre": "I initially had a rough experience when…",
          "Contenu": "I initially had a rough experience when the software I purchased did not appear to have an active license, and when I tried to call, no one answered. However, someone called back within an hour (an actual person!) and helped me fix the problem quickly. So my experience quickly went from being a one star to a four star. Thanks, awesome customer service!"
        },
        {
          "Note": 4,
          "Lieu": "CW",
          "Pseudo": "Ronald Severing",
          "Nb_Reviews": 1,
          "Date": "2019-04-18T16:00:31.000Z",
          "Titre": "Buying and downloading SPSS",
          "Contenu": "On the start page of the SPSS program all versions are mixed up. When you start, it is not clear on the start page where you will end. It is good to know what you must have ready. The list of eligible countries shows the Kingdom of the Netherlands, only the Netherlands and Aruba. The other countries within the Kingdom: Curaçao and St. Maarten are not listed. Downloading went fine. Downloading the second copy at home on the other computer was a bit of a process. The program works well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2016-12-05T04:30:09.000Z",
          "Titre": "Delayed shipping",
          "Contenu": "I ordered two pieces of software. One was shipped immediately and after not receiving the second one after a week later I called to inquire about the status. The follow up was very satisfactory and the delay was explained thoroughly. I would have rated it 5 stars if the company had notified me first without me calling that there was going to be a delay in receiving the software."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Pedro Luis",
          "Nb_Reviews": 1,
          "Date": "2018-05-10T22:08:19.000Z",
          "Titre": "From buying to downloading the software…",
          "Contenu": "From buying to downloading the software was okay! The installation instructions are reasonable, however, does not cover contemplates some problems that may occur. In my case, the software did not run and I found nowhere to help resolve this situation. It was after I monitored the need for resources (memory, HD, UCP, etc) that I realized that my HD could be \"too full\" which prevented software startup. I installed it on an external hard drive, so it ran normally !!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LeTrecia",
          "Nb_Reviews": 1,
          "Date": "2017-05-01T20:12:58.000Z",
          "Titre": "Quality Customer Service",
          "Contenu": "The SPSS product that I originally purchased did not have a valid license that worked.  Thus, I purchased a SPSS that did not work.  However, after working with one of the representatives, he was extremely intentional about ensuring that I had a trusted product and quality experience.  I was contacted each business day to ensure my product worked until he was able to remotely troubleshoot it and fixed the issue.  I now have a working SPSS.  Great service."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Shins",
          "Nb_Reviews": 2,
          "Date": "2019-09-21T13:43:20.000Z",
          "Titre": "Review of SPSS Software",
          "Contenu": "Great price, good download instructions. Important to note that software won't work on Windows 10 Pro in S Mode, as it is locked to apps verified by the Microsoft store. I was charged more than the specified price on the website due to conversion fees, so take that into account when purchasing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Morris",
          "Nb_Reviews": 1,
          "Date": "2017-01-04T17:23:15.000Z",
          "Titre": "Software download worked - no problems",
          "Contenu": "Simply put, purchased my software package at a great student price. Download went smoothly, I followed the directions provided. Since download, software has worked just fine. No problems. Basically, a simple transaction with no problems. I'll be making future student purchases here. Only wish I knew about this site sooner!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "of",
          "Nb_Reviews": 1,
          "Date": "2021-03-10T21:08:57.000Z",
          "Titre": "Better customer service",
          "Contenu": "Customer service rep was not helpful at all in the beginning as everything occurred via the chat. I was later contacted over the phone a few days later and another rep and he was very helpful with my concerns and changed my overall view of the company"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Dr Naveen Kumar C",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T15:21:16.000Z",
          "Titre": "A good initiative for students and researchers",
          "Contenu": "Ease of payment"
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Ana",
          "Nb_Reviews": 2,
          "Date": "2019-11-18T18:33:07.000Z",
          "Titre": "I consider good",
          "Contenu": "I consider good. Because if I did not have a StudentDiscount it has been impossible do by the program. So I should tell: thank you.But to validated the key code was very difficult.I talked with assistance for one week. And only one week after by,  I can use the program."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cici",
          "Nb_Reviews": 1,
          "Date": "2016-09-30T16:13:26.000Z",
          "Titre": "Straightforward service",
          "Contenu": "I bought SPSS pack from student discounts for a price so ridiculously awesome I almost thought it was a fraud. But it wasn't; I purchased and downloaded it with no problem, and it works great. I have shared the site with many of my classmates who are now purchasing items from this site as well. The website is not as slick or professional as amazon or my school's IT marketplace, but despite my initial misgivings, I cannot complain about the service. It works and I received a quality product at a quality price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shonda",
          "Nb_Reviews": 1,
          "Date": "2019-09-21T16:56:43.000Z",
          "Titre": "My SPSS 25 works Great!",
          "Contenu": "My SPSS 25 works great! I love that you can put it on 2 devices at once, but do not like that it expires in 1 year! I do not know if it will be the same rate or a different one, because I will have completed my education by then! Overall, good price!! Thank-you!!…"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ivan",
          "Nb_Reviews": 1,
          "Date": "2019-02-14T01:38:54.000Z",
          "Titre": "SPPS buy",
          "Contenu": "I would probably just have the option to download the desire format after buying on the webpage instead of having to do an additional download of instruction page. I truly appreciate the library tutorials, it helps to refresh the memory when attempting to do analyses."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Hlengiwe Selowa",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T22:33:21.000Z",
          "Titre": "Good experience, few glitches",
          "Contenu": "The license key I was given did not work initially but after I alerted them, I received help quite swiftly😀"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Abdelaziz",
          "Nb_Reviews": 1,
          "Date": "2017-08-28T21:53:11.000Z",
          "Titre": "YOU PROMIS TO DOWNLOAD YOUR PROGRAM ON …",
          "Contenu": "YOU PROMIS TO DOWNLOAD YOUR PROGRAM ON 2 COMPUTER. ONE IS OK ON PC. THE SECOND FAILED AND I REPLACE THE MAC . I WILL RECEIVE IT IN 10 DAYS ON SEP. 8 2017. I HOPE YOU ASSIST IN DOWNLOAD. ONE MORE THING, I NEED QUICK GUIDE FOR REGRESSION APPLICATION; TIME SERIES.THANK YOT"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ana",
          "Nb_Reviews": 1,
          "Date": "2016-11-26T22:13:09.000Z",
          "Titre": "Smooth sailing.",
          "Contenu": "I ordered SPSS and I was sent the links to download the program immediately.  Unfortunately the key codes to access the program were not sent and I had to call costumer service. The person who answered sent the key codes right away and everything else was smooth sailing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Starterstudent",
          "Nb_Reviews": 2,
          "Date": "2017-07-04T20:09:12.000Z",
          "Titre": "I haven't used the product yet but had …",
          "Contenu": "I haven't used the product yet but had submitted my student verification via email and hadn't received the product. I called the company and a live person answered on the second ring, and emailed me the product within five minutes of hanging up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2018-08-22T15:55:38.000Z",
          "Titre": "FIrst up",
          "Contenu": "FIrst up, \"Excellent\" is a rating I rarely use. I DO think, however, SD is a very, very good place to shop for software and they have always satisfied me - they are my one-stop place to go for a while now. I am a satisfied consumer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aaron chikakuda",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T00:33:51.000Z",
          "Titre": "Easy to process except for requirements…",
          "Contenu": "Easy to process except for requirements for verification of studentship are cumbersome"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chelsey",
          "Nb_Reviews": 1,
          "Date": "2019-02-20T17:48:50.000Z",
          "Titre": "Good Experience overall",
          "Contenu": "Good Experience overall. I accidentally purchased the wrong version of the software I was seeking for the same price of the upgraded one that I needed. My mistake, not the company's, I'm hoping to be able to exchange licenses"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Lisa",
          "Nb_Reviews": 3,
          "Date": "2016-10-05T02:56:57.000Z",
          "Titre": "Quick and easy",
          "Contenu": "I wasn't sure about the website when I first saw it, but I purchased anyway. I wasn't disappointed. Immediately after purchase I received a link for the download. Instructions could be slightly easier, but other than that I am happy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2020-08-09T12:30:58.000Z",
          "Titre": "Made Whole After My Mistake",
          "Contenu": "By mistake I purchased a SPSS license; I teach at a college and should have gone through it to obtain a free license. I worked through my school and StudentDiscounts refund my cost. Thank you for your good service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Justine",
          "Nb_Reviews": 1,
          "Date": "2017-03-28T08:02:29.000Z",
          "Titre": "SPSS program",
          "Contenu": "Ordered the SPSS program for school; it was very affordable, fairly easy to send the required information, and the directions were pretty easy to follow. A few snafus here and there, but once up and running, it works great! Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Clint",
          "Nb_Reviews": 1,
          "Date": "2017-02-12T18:07:55.000Z",
          "Titre": "Easy transaction",
          "Contenu": "The download and install instructions, although thorough, were a little tricky to navigate. However, the software installed correctly with no problems and tech support was prompt and understanding in responding to my requests."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lee",
          "Nb_Reviews": 3,
          "Date": "2017-04-15T20:09:47.000Z",
          "Titre": "Very good customer service",
          "Contenu": "Very good customer service. Had one small issue with the down load when I purchased a version of SPSS that was not compatible with Windows 10. Would most definitely purchase from them again and recommend them to anyone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Olga Lucia",
          "Nb_Reviews": 1,
          "Date": "2021-10-14T19:18:02.000Z",
          "Titre": "I got the required book",
          "Contenu": "I got the required book. I just think that I am paying a lot of money only to rent a book, and it is not even on paper. However, the service does the job of getting the book."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sydney",
          "Nb_Reviews": 1,
          "Date": "2019-10-12T23:56:39.000Z",
          "Titre": "Would buy again",
          "Contenu": "The software can be a little confusing to download, but I got in contact with tech support and they helped me figure out the problem I was having. They were very helpful and it was a quick and simple fix."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Prashant",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T07:17:56.000Z",
          "Titre": "Price",
          "Contenu": "Price can be a little cheaper"
        },
        {
          "Note": 4,
          "Lieu": "LV",
          "Pseudo": "Anna",
          "Nb_Reviews": 4,
          "Date": "2020-11-21T14:15:39.000Z",
          "Titre": "Your service is great",
          "Contenu": "Your service is great, but unfortunately for the concrete SPSS product was not available even partial refund since accidentally didn't order the right extension first time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2016-10-23T05:05:50.000Z",
          "Titre": "Good store",
          "Contenu": "Bought an accounting software and got a pretty good discount.  Received the email with direction to download the software in minutes.  Everything went smoothly and fast.  Good buying experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MDG",
          "Nb_Reviews": 1,
          "Date": "2019-09-25T22:38:22.000Z",
          "Titre": "Great help with science project",
          "Contenu": "Lifesaver to assist my daughter with statistic calculations on her high school biology product but did have to spend time on online video tutorials to learn use the software package."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Shaw watanabe",
          "Nb_Reviews": 1,
          "Date": "2021-10-16T06:40:39.000Z",
          "Titre": "Quick response",
          "Contenu": "As IBM-SPSS prescription makes a contract with companies or organizations, the Student discounts service for an individual researcher is convenient."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RB",
          "Nb_Reviews": 1,
          "Date": "2016-12-01T17:59:44.000Z",
          "Titre": "Initial Issue Turned out OK",
          "Contenu": "The PDF initially did not work for me and I was apprehensive that I had made a terrible mistake.  It worked out in the end and did not have any trouble with my download/program."
        },
        {
          "Note": 4,
          "Lieu": "BT",
          "Pseudo": "wangchuk wangchuk",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T16:11:47.000Z",
          "Titre": "Friendly and very useful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fredrick",
          "Nb_Reviews": 1,
          "Date": "2019-09-22T18:50:50.000Z",
          "Titre": "Kept sending me emails suggesting I buy…",
          "Contenu": "Kept sending me emails suggesting I buy a program that I actually had just bought from them.  Irritating.  Otherwise great.  Easy website, reasonable prices."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Jeevan",
          "Nb_Reviews": 1,
          "Date": "2018-06-16T00:54:17.000Z",
          "Titre": "Few problems with initial loading and…",
          "Contenu": "Few problems with initial loading and sending confirmation of enrolment twice. However sorted out in a decent time by student discount management team. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "Sharifah",
          "Nb_Reviews": 1,
          "Date": "2020-09-12T04:19:10.000Z",
          "Titre": "The description for the product",
          "Contenu": "The description for the products should be easy to understand to help customers make the right decision without having to contact customer service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Praise",
          "Nb_Reviews": 1,
          "Date": "2019-11-04T01:44:36.000Z",
          "Titre": "Took Some Time but Still Good",
          "Contenu": "For some reason I had problems getting the license to work, but by the third try, I finally had my product! Thank you for a good product that works!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mom",
          "Nb_Reviews": 1,
          "Date": "2020-09-16T14:46:34.000Z",
          "Titre": "A little Help for those NOT techno savvy",
          "Contenu": "The instructions to purchase and how to transfer the online software to my son were not apparent and a bit frustrating to get a detailed response as to what we had to do.  We did reach out to support to find out how to do it and the response was light - not great instructions other than to just purchase it and then email it to my son.   I had no idea what IW as supposed to \"just do\" so we took a chance that we would get information when we made the purchase that would be intuitive to follow up on.   We purchased the software blindly and when an email came we forwarded it to him, then another came and we forwarded it to him - realizing the second email had a key# and login information in it that he would ultimately need.I would suggest a quick PDF How-To for what could have been a graphic step by step - instead of an email response to just pay for it and send the email to your son!He was able to log in and is using it with his class as intended.Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alan",
          "Nb_Reviews": 1,
          "Date": "2017-01-21T20:33:16.000Z",
          "Titre": "Mathcad on CD",
          "Contenu": "Got me what I wanted in a good amount of time.  Liked I could get a CD, little confusing as to what I needed to send them, but everything worked out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "chris",
          "Nb_Reviews": 1,
          "Date": "2019-06-29T02:49:07.000Z",
          "Titre": "Almost perfect",
          "Contenu": "Had some difficulty with the instal due to previous trial version that I had to troubleshoot but otherwise a great experience and final product"
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Ana",
          "Nb_Reviews": 2,
          "Date": "2020-06-07T19:22:26.000Z",
          "Titre": "It is good",
          "Contenu": "It is good. Because it is a very important software for the research. But it is so expensive too. The discount made the possible purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marcia",
          "Nb_Reviews": 1,
          "Date": "2016-10-10T19:17:13.000Z",
          "Titre": "Fantastic value",
          "Contenu": "Great value on a quality product for students. A little tough to maneuver the download for macs, but it worked eventually and is now smooth sailing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "an SPSS user",
          "Nb_Reviews": 1,
          "Date": "2021-04-08T02:20:52.000Z",
          "Titre": "Complicated, but clear and effective instructions",
          "Contenu": "The download instructions are a little bit complicated, yet they are clear and they worked the first time, which I consider a win."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessie",
          "Nb_Reviews": 1,
          "Date": "2018-07-30T16:36:51.000Z",
          "Titre": "Great prices",
          "Contenu": "Great prices, but was difficult to download the SPSS package that I had purchased. Instructions for download could be simplified/more clear."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yvonne Baptiste-Szymanski",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T20:28:05.000Z",
          "Titre": "Expert and reliable tech support",
          "Contenu": "I'm never optimistic when having to rely on tech support to overcome a glitch, but just a brief description of my problem in the chat window gave me a thorough explanation about how to make the necessary fix (replacement file)- took minutes."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Leyterhs vratsos",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T09:00:09.000Z",
          "Titre": "Best informative site for purchasing student software",
          "Contenu": "I found the software needed for my thesis and the price is affordable for my budget. Overall very happy."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Luis Ley",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T18:28:38.000Z",
          "Titre": "SPSS 29 works excellent on MAC Sonoma Chip M1",
          "Contenu": "The most current program SPSS 29 works well on MAC Sonoma Chip M1, you have to do a configuration after installing it but via WhatsApp they give you all the instructions and they answer very quickly! Highly recommended"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Volker Stieg",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T09:29:54.000Z",
          "Titre": "Perfect online service",
          "Contenu": "Perfect online service! I ordered IBM SPSS Statistic Pack Grad 29. Installation was done in a few minutes.Thanks to the whole StudentsDiscounts -Team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susannah Malarkey",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T05:18:02.000Z",
          "Titre": "Les was AMAZING!",
          "Contenu": "Les was AMAZING!! SUPER knowledgable, helpful, and efficient. I really needed SPSS to work on my Mac and it was having issues and he knew just what to do. I'm super grateful!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T12:50:04.000Z",
          "Titre": "Best deal for students",
          "Contenu": "Price is great especially if you are student who is not earning. Also they are flexible enough to allow using the license on 2 machines. It can't get better than this."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Pinneo",
          "Nb_Reviews": 3,
          "Date": "2023-11-10T16:53:46.000Z",
          "Titre": "I cannot access SPSS - RESOLVED!!",
          "Contenu": "I cannot access SPSS.Update: I was able to resolve the issue. Windows users: Make sure you change settings to allow for the download of apps other than Microsoft ones. Otherwise, this will not work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tiffany Jones",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T23:39:28.000Z",
          "Titre": "timely and clear",
          "Contenu": "timely, clear directions for downloading/troubleshooting, easy to show proof of academic appointment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ph.D. Student",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T01:18:29.000Z",
          "Titre": "Easy and supportive",
          "Contenu": "Capable and supportive. Software was easy and quick to buy. Installation was easy, but the software did not run properly unless the support jumped in with a quick guide and a file to fix the problem. I wished I could get Minitab here too. That would be successful.PS. I am an accepted Ph.D. Student :-))"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas H.",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T14:26:37.000Z",
          "Titre": "Excellent deals and service",
          "Contenu": "I appreciate the deep savings for software you are providing to college graduate students. Your website is very easy to use."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Ivan Hadlich",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T00:08:59.000Z",
          "Titre": "Buying it directly in Brazil",
          "Contenu": "Buying it directly in Brazil would have been 10x the price or more. I am glad we can have a global website to save some money, PhD students are never wishing for more than saving money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Pinneo",
          "Nb_Reviews": 3,
          "Date": "2023-11-10T18:14:14.000Z",
          "Titre": "I was able to resolve the issue",
          "Contenu": "I was able to resolve the issue.  Windows users: Make sure you change settings to allow for the download of apps other than Microsoft ones. Otherwise, this will not work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark from Minneapolis",
          "Nb_Reviews": 3,
          "Date": "2023-10-24T15:34:45.000Z",
          "Titre": "Upgrade to new SPSS software - helpful support team.",
          "Contenu": "The team at StudentDiscounts.com was helpful to me through several emails and phone calls related to getting the new version of SPSS software to work properly with the new version of Apple Mac operating system release.  They also helped with a refund and setting up a new customer account that I needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melanie Elson",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T01:27:32.000Z",
          "Titre": "Thank you for great customer service",
          "Contenu": "Thank you for great customer service. When I had a question, someone answered me right away and was super friendly! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather Lucas",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T02:28:39.000Z",
          "Titre": "Hooray for the student discount!",
          "Contenu": "It was easy to install the program and get to work. I really appreciated getting to try it out for a month before purchasing it and also the student discount! This is probably my favorite purchase of the year, and it's now November."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Andrea Sepúlveda Ortega rtega",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T12:14:49.000Z",
          "Titre": "Excellent assistance post sold out",
          "Contenu": "Les is so gentle and helped me a lot with the software installation in my computer. Thanks again 😊"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "ALFREDO GUTIERREZ",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T19:29:05.000Z",
          "Titre": "Its website is a very useful tool for…",
          "Contenu": "Its website is a very useful tool for students who are starting to work or who have to learn about SPSS as part of our training. The page is organized and with all the necessary help to solve problems or doubts. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lyn",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T02:26:03.000Z",
          "Titre": "Decent price - Great Customer service",
          "Contenu": "The product I ordered (SPSS Grad Pack Standard) included 2 license keys, which is great.  However, I quickly learned that this program isn’t compatible with the latest MAC OS update.  I have a Windows laptop and PC.  I used the remaining license on my laptop but also wanted to install it on my PC.  I contacted customer service and they responded within minutes.  I told them my snafu and they quickly reset the key so that I was able to download it on my PC as well.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Smilie",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T03:16:15.000Z",
          "Titre": "I working on a Ph.D",
          "Contenu": "I am working on a Ph.D. in Business Administration. My plate is full to the brim with work. That is, I needed to utilize IBM SPSS for my quantitative analysis class but I made a mistake in purchasing the wrong program. The manager at StudentDiscounts, Mr. Les, was compassionate and helpful. He speedily marked out a pathway to get the proper program and my problem was solved in less than 15 minutes, including phone time and installation time. Absolutely fabulous. Mr. Les gave me something that I cannot seem to get enough of: time. Thank you so much and I will return to this company for future needs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Peters",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T02:28:27.000Z",
          "Titre": "Fantastic Customer Service!",
          "Contenu": "I bought a program from StudentDiscounts.com then was not able to use it (not anyone's fault, just not able to download to my work laptop which is where I need it).  I sent them a message and someone responded to me within an hour!  They offered help, however understood that I just needed a refund.  Within 3 days the refund was in my bank account.  I will definitely be using them for any future software needs because of their integrity and customer service, even though officially I haven't bought anything yet.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Moore",
          "Nb_Reviews": 8,
          "Date": "2023-11-28T21:48:30.000Z",
          "Titre": "Very easy and seemless",
          "Contenu": "Very easy and seemless. Make sure you follow the simple directions in how to download"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victoria Dawson",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T01:04:43.000Z",
          "Titre": "Follow-up",
          "Contenu": "Les remained in constant contact via email, calls, and texts to try to resolve the situation, even after I explained that figured out the problem myself - Very professional and courteous."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TJFrees",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T18:21:44.000Z",
          "Titre": "Best price, great service!",
          "Contenu": "After researching prices, StudentDiscounts.com had the lowest price for SPSS. The website was easy to use and my purchase went without a glitch.  My copy of SPSS was available immediately. They said on their website that if the wrong version of SPSS was purchased, it could be exchanged for a different version.  That happened to me and they facilitated the switch just as promised and refunded my first purchase immediately. Would recommend this seller to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brayden Richards",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T19:10:43.000Z",
          "Titre": "I had purchaed the wrong software…",
          "Contenu": "I had purchaed the wrong software license, But luckily Student discounts was able to help me get the correct license and also refunded the initial purchase I had made. I would definitely recommend them. Their customer service was excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carla Rischer",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T01:41:04.000Z",
          "Titre": "the website is easy to follow",
          "Contenu": "the website is easy to follow. the download went smooth. I was assured several times on the website that I would have available assistance via phone or email if i had any issues. No issues, all is working well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chiquita Jones",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T02:11:32.000Z",
          "Titre": "I was a bit skeptical at first",
          "Contenu": "I was a bit skeptical at first. However, I was able to download and use my SPSS software seamlessly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Iris",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T18:35:17.000Z",
          "Titre": "Solid",
          "Contenu": "I was able to get what I needed in a fairly straightforward manner. The price seems a little high for a 6-month software *rental*, but better than most everyone else out there and I'm sure this is set to a degree by IBM. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Minasie Letta",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T12:48:54.000Z",
          "Titre": "I purchased the wrong SPSS version",
          "Contenu": "I purchased the wrong SPSS version for the MPH Epidemiological analysis. I communicated with them, they told me to purchase a new one and send the older order number for a refund. Right now my refund is processing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Missy",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T18:03:52.000Z",
          "Titre": "Customer service is amazing",
          "Contenu": "Customer service is amazing. I have contacted representatives via chat twice now and have had fast, great service!"
        },
        {
          "Note": 5,
          "Lieu": "KE",
          "Pseudo": "Client C",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T01:56:11.000Z",
          "Titre": "Cost",
          "Contenu": "The free tier helps one experience the benefit of your service,making them believe it is worth it to subscribe"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jill Dyer",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T21:09:20.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "The customer service Dept went out and above my expectations. Les was excellent and knows his Tech Stuff. He emailed me back and forth. He even called me and stayed with me on the line until I could resolve my issue. I greatly appreciated the help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tricia",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T02:31:58.000Z",
          "Titre": "WOW....just Wow!",
          "Contenu": "I had some struggle with the program initially and was prepared to give a 1 star rating. BUT - their customer service was phenomenal on many levels - even had someone do a remote access install! They fixed the issue, provided a version of the program that worked, and more! Excellent! Will definitely use them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chaos",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T23:03:23.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "This company has excellent customer service. I bought a copy of SPSS from this company and encountered compatibility issues with my device. However, customer service was excellent at helping me find a solution to the issue and actually gave me a free version of SPSS for my computer. I would recommend it to all college students."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DJ",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T21:02:50.000Z",
          "Titre": "Exceptional Customer Service",
          "Contenu": "This software was very reasonably priced and affordable for students. Also, I had technical difficulties downloading and was provided with assistance IMMEDIATELY! Les, was AWESOME in helping me download the software on two computers..easy breezy! Thank you so much.. I highly recommend this company!"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Grace R",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T23:32:36.000Z",
          "Titre": "easy to download and use",
          "Contenu": "the download was easy to complete and works well!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Anna Dalle Grave",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T19:10:13.000Z",
          "Titre": "Great experience",
          "Contenu": "Never had an issue with any of the versions that I have installed. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Karma Wangchuk",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T04:44:29.000Z",
          "Titre": "I recently bought SPSS v29",
          "Contenu": "I recently bought SPSS v29, I got the link through mail to download but it wasn’t working. Immediately I contact them and they sent me another link which it worked perfectly. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Presmanes",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T01:36:31.000Z",
          "Titre": "How professional your people are and the excellence of SPSS in terms of power and ease of use",
          "Contenu": "My experience was made excellent by prompt, professional, and courteous support.  This is a real competitive advantage you have, in my estimation.  You are reliable."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Marcelino Garcia-Noriega Ferna",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T21:22:22.000Z",
          "Titre": "All help to the student is important. The aid to knowledge is priceless",
          "Contenu": "I am very happy to know the website of studentdiscounts.com because my teacher told me ́ò to get the statistical program SPSS at a good price. Thank you for your help"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Rudy Setyopurnomo",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T15:45:49.000Z",
          "Titre": "Easy",
          "Contenu": "Easy, speedy, helpful, and important"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrea Osuna",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T18:07:35.000Z",
          "Titre": "The customer service gave me good…",
          "Contenu": "The customer service gave me good advice about what to buy. The installation process was fast as well and the instructions were clear."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacy Mynette Salazar",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T02:14:59.000Z",
          "Titre": "Instructions are easy to follow."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lee",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T20:02:35.000Z",
          "Titre": "Exceptional and Timely Support",
          "Contenu": "Les, was exceptional in getting the installation process of my newly acquired SPSS software correctly and timely downloaded and working.  The attention to detail made me feel secure even as a novice to the operation of this software.  Les, patiently worked with me through each step with steady words of reassurance to ensure that I was tracking along with him and felt supported through this process.  THANK YOU so much for the support and will be sharing this experience with my peers and school administration as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ruben Espinosa",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T23:41:30.000Z",
          "Titre": "Hey, can i help",
          "Contenu": "First, have evidence your eligible. Next read the instructions carefully! I found the upgrades to be worth the dollar difference, for example on reporting column output."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Sebastian Schiller",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:16:55.000Z",
          "Titre": "Straight forward delivery process"
        },
        {
          "Note": 5,
          "Lieu": "KZ",
          "Pseudo": "Ainur Dossanova",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T09:02:52.000Z",
          "Titre": "Better data for better lives",
          "Contenu": "Know more about statistics"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Yann Kaiser",
          "Nb_Reviews": 2,
          "Date": "2023-10-11T17:24:45.000Z",
          "Titre": "Great prices and services",
          "Contenu": "Bought SPSS as a Student - great prices, fast delivery! Can recommend the site to every student looking for SPSS"
        },
        {
          "Note": 5,
          "Lieu": "ZM",
          "Pseudo": "Derrick Bwalya",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T10:22:13.000Z",
          "Titre": "Great Technical support",
          "Contenu": "Response from the Technical support Team is excellent. They helped me resolve the license issue on IBM AMOS 24"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Pietro",
          "Nb_Reviews": 7,
          "Date": "2023-10-19T21:18:34.000Z",
          "Titre": "SPSS 29. Great experience.",
          "Contenu": "I bought SPSS 29.It was very easy to buy and download. But the best thing is the support team that is incredibly fast and sort out all kinds of problem almost in real time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tricia",
          "Nb_Reviews": 3,
          "Date": "2023-08-10T21:33:05.000Z",
          "Titre": "I purchased the SPSS (statistics)…",
          "Contenu": "I purchased the SPSS (statistics) software for a class I’m taking. I was having issues with the software loading but their customer service is fantastic! Especially Les who has helped multiple times!They even asked for remote access to my computer to uninstall and reinstall the software and get it working. I definitely recommend them and appreciate their amazing customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fatin Atrooz",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T15:10:14.000Z",
          "Titre": "Affordable prices for students",
          "Contenu": "Affordable prices for students, follow up after purchase, very responsive if you contact them for any issues during activation of the product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pamela Segura",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T15:22:26.000Z",
          "Titre": "Easy",
          "Contenu": "Easy, straightforward process. Plus, I now have SPSS for 3 years as a psychology grad student. Thank you :)"
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "chung wai kwok",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T02:33:39.000Z",
          "Titre": "Flash delivery of software",
          "Contenu": "Flash delivery of software.  The pricing at around $35 for six months is reasonable for a student and that duration is good enough for a semester."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tami Videon",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T12:57:20.000Z",
          "Titre": "I made an error in ordering",
          "Contenu": "I made an error in ordering, and had to cancel the original order and make a new one. Customer service was super helpful and pleasant."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Khulong Mogajane",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T14:35:47.000Z",
          "Titre": "Great service"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Rayane",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T11:07:29.000Z",
          "Titre": "good",
          "Contenu": "Good company with high-quality customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy Rowell",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T02:15:45.000Z",
          "Titre": "I had to call for installation support…",
          "Contenu": "I had to call for installation support and customer service was PHENOMENAL!"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Mauro Santos",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T19:54:47.000Z",
          "Titre": "Clarity of the information",
          "Contenu": "Clarity of the information provided and quick purchase process. I'm very satisfied!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SUKRU ARAS",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T20:22:46.000Z",
          "Titre": "Perfect thank you"
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "ARHYEL MSHELIA",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T08:01:05.000Z",
          "Titre": "My experience with online shopping at…",
          "Contenu": "My experience with online shopping at the student discounts website is that purchasing software of your choice is so easy and not complicated. I am so proud of the company because they make available and pave the way for biostatisticians to purchase the latest software versions like IBM SPSS at very reasonable prices."
        },
        {
          "Note": 5,
          "Lieu": "PE",
          "Pseudo": "Alexandra Lorena Herrada River",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T02:08:23.000Z",
          "Titre": "Seamless SPSS Purchase Experience",
          "Contenu": "My recent experience with StudentsDiscounts.com while purchasing SPSS software for my statistical studies was exceptional. The website's user-friendly design made finding the software a breeze, and what really stood out was the speed of their service. Instant access to the software was crucial for my studies, and StudentsDiscounts delivered on their promise of efficiency. The secure payment process and prompt confirmation email added to the overall trustworthiness of the experience. In summary, StudentsDiscounts is the go-to choice for students seeking hassle-free and swift software access, making them a top recommendation for all students."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Archana",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T16:41:44.000Z",
          "Titre": "Excellent customer service.",
          "Contenu": "Excellent customer service.Accidentally brought a different package and they helped me navigate through the process of refund. Took only a couple of a minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tameka",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T18:07:41.000Z",
          "Titre": "thank you Les for guiding me through…",
          "Contenu": "thank you Les for guiding me through this process! I really appreciate your help!"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "CARLOS ABEL ROJAS AQUINO",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T22:38:41.000Z",
          "Titre": "This is a great opportunity… thank you",
          "Contenu": "This is a great opportunity for grow up in academic, clinic and teacher’s area. Thank you for this!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory 2653",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T20:38:18.000Z",
          "Titre": "Great Stuff",
          "Contenu": "I have used this website to purchase statistics software and it is fabulous. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edison Manjarres",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T22:26:57.000Z",
          "Titre": "Review",
          "Contenu": "There was an issue with receiving the license code but they responded quickly, provided me the license code and refunded me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 4,
          "Date": "2023-11-12T21:44:24.000Z",
          "Titre": "Price is good and accessing the…",
          "Contenu": "Price is good and accessing the software was very easy!"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Paulo",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T17:18:13.000Z",
          "Titre": "Very good experience",
          "Contenu": "the purchase was simple, quick and the instructions provided great guidance"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Chino",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T22:02:10.000Z",
          "Titre": "fast and easy process",
          "Contenu": "fast and easy process, immediate download, I will use them again"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Josue Lopez",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T19:07:15.000Z",
          "Titre": "Studying a PHD is not an easy task but…",
          "Contenu": "Studying a PHD is not an easy task but getting the proper tools makes it easier. The price is achievable and the website is easy to use."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Ashaki Dore",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T01:55:33.000Z",
          "Titre": "Access within minutes",
          "Contenu": "The instructions were easy to follow. And I was able to use the system withing minutes of my class."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracey Clark-Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T22:43:48.000Z",
          "Titre": "It was reasonably priced and just what…",
          "Contenu": "It was reasonably priced and just what I needed for my DNP Biometrics class😊"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "fatima malik",
          "Nb_Reviews": 5,
          "Date": "2023-10-01T09:00:05.000Z",
          "Titre": "Student discount",
          "Contenu": "This app have easy to install . its very helpful for the students. Students solve over problem in this."
        },
        {
          "Note": 5,
          "Lieu": "PE",
          "Pseudo": "Luis Cueva",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T06:34:10.000Z",
          "Titre": "The quick attention to my order is Great!",
          "Contenu": "The quick attention to my order is great, with an excellent price-quality ratio for installing the program on two machines."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "John Callaghan",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T00:56:35.000Z",
          "Titre": "The response to my recent enquiry…",
          "Contenu": "The response to my recent enquiry regarding renewal for SPSS was prompt, professional and very helpful as always in my experience."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "RG",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T00:45:22.000Z",
          "Titre": "Incredible",
          "Contenu": "Payment was seamless, found what I needed easily, setup instructions were clear and helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pamela Fulton",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T21:28:44.000Z",
          "Titre": "Most helpful!",
          "Contenu": "They helped me when I updated my MacBook and it wouldn’t work with SPSS. They took the time to walk me through the fix step by step. Thank you so much!"
        },
        {
          "Note": 5,
          "Lieu": "CR",
          "Pseudo": "Warner Ruiz",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T01:00:39.000Z",
          "Titre": "Excellent",
          "Contenu": "It was a quick and efficient purchase; very good value for the Ph.D. undergraduate option."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Nasir Mahmood",
          "Nb_Reviews": 6,
          "Date": "2023-07-16T09:02:04.000Z",
          "Titre": "Very simple and easy process",
          "Contenu": "Very simple and easy processThe software was functioning within minutes of the purchase. Great work"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Park",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T15:00:03.000Z",
          "Titre": "Everything is good",
          "Contenu": "The downloading process is pretty easy to follow and the product quality is excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marija Petkovic-Cooke",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T18:37:31.000Z",
          "Titre": "Seamless purchase",
          "Contenu": "Seamless purchase. Paid, downloaded, installed, analyzed data. The price is fair for academic researchers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leigh McCormick",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T22:49:02.000Z",
          "Titre": "Thank you Les for getting my SPSS back…",
          "Contenu": "Thank you Les for getting my SPSS back & working ! Best customer service 😊"
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Elboussairi",
          "Nb_Reviews": 3,
          "Date": "2023-10-17T19:00:00.000Z",
          "Titre": "You discount is the best gift for…",
          "Contenu": "You discount is the best gift for student researchers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JAMES W",
          "Nb_Reviews": 3,
          "Date": "2023-07-25T00:20:59.000Z",
          "Titre": "Bought the wrong product by mistake",
          "Contenu": "Bought the wrong product by mistake. CS issued a credit immediately. Nice!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ALESHIA BIGGERS",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T14:20:41.000Z",
          "Titre": "Great customer service.",
          "Contenu": "They were so thoughtful and helpful. I appreciate the quick response."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Valerie",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T12:14:09.000Z",
          "Titre": "Good service and price",
          "Contenu": "Buying and downloading SPSS were easy.  The price for the program is also reasonable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trena Todd",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T22:52:22.000Z",
          "Titre": "Detailed and Clear Instructions",
          "Contenu": "Students Discounts.com provided clear and concise instructions for easy  navigation of their website"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Luciane Costa",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T18:46:15.000Z",
          "Titre": "Fair and inclusive business",
          "Contenu": "It sells a software license, thinking of teachers and students who cannot afford expensive products"
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "mostafa elhalaby",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T06:50:50.000Z",
          "Titre": "changing mu license",
          "Contenu": "Thank   you for helping me change my licence, I still did not receive the refund back, but I know it is on the wayThanks again"
        },
        {
          "Note": 5,
          "Lieu": "BW",
          "Pseudo": "ONKEMETSE GABALOTEGWE",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T09:32:40.000Z",
          "Titre": "I made a purchase and received the link to access the software, the software is 100% efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Stuller",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T20:48:56.000Z",
          "Titre": "Access",
          "Contenu": "Hello, I have not been able to use the program. Not able to log in."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Handsome Tadesse",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T20:27:21.000Z",
          "Titre": "all options",
          "Contenu": "SPSS is so great I love it.I was surprised to hear you discount for students"
        },
        {
          "Note": 5,
          "Lieu": "BH",
          "Pseudo": "M mahdem",
          "Nb_Reviews": 13,
          "Date": "2023-07-16T12:58:08.000Z",
          "Titre": "Very simple process",
          "Contenu": "Very simple process. The software was functioning within minutes of the purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yvonne Baptiste-Szymanski",
          "Nb_Reviews": 2,
          "Date": "2023-07-13T23:57:44.000Z",
          "Titre": "Very simple process",
          "Contenu": "Very simple process. The software was functioning within minutes of the purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "arthur",
          "Nb_Reviews": 4,
          "Date": "2023-10-30T19:03:57.000Z",
          "Titre": "Knowledgeable support people.",
          "Contenu": "Knowledgeable support people.Responsive.Fixed my problem with professionalism and courtesy.Will definitely use again."
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "Wong",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T01:16:46.000Z",
          "Titre": "Great experience",
          "Contenu": "Efficient and smooth"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Asmaa Balagha",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T18:34:28.000Z",
          "Titre": "SPSS STUDENT VERSION",
          "Contenu": "SPSS STUDENT VERSIONIt's affordable and easy to use"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jb",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T00:26:50.000Z",
          "Titre": "Awesome Customer Service!!!",
          "Contenu": "Awesome Customer Service!!!! My SPSS is up and working!!!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Sehliselo Ndhlovu",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T04:31:20.000Z",
          "Titre": "I brought the product key twice",
          "Contenu": "I brought the product key twice,  they we very efficient to refund me back. Keep up the great service."
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "Sharon",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T07:08:42.000Z",
          "Titre": "Immediate download after payment",
          "Contenu": "Immediate download after payment. Easy to follow instruction given. Can use immediately, no time wastage."
        }
      ]
    }
  ]
}