{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "swann.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mrs Russell",
          "Nb_Reviews": 27,
          "Date": "2023-12-20T11:18:12.000Z",
          "Titre": "Aftercare not very good",
          "Contenu": "Whilst I did a lot of research before I purchased the system, I am disappointed with the aftercare.I am struggling to get the additional chimes connected to the buddy. I sent an email and not received a response.I also had a query regarding connecting the WiFi items onto the dvr player and again no response"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Natalie Trew",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T08:01:15.000Z",
          "Titre": "Should have a 0 star rating!!",
          "Contenu": "Bought Swann enforcer cctv 2 months ago. Spotlights on 2 cameras have stopped working after just 2 months. Contacted Swann who went through tech support - waste of time clearly a fault with the actual cameras as I have now found other reviewers with the same issue. Swann customer service and warranty is a joke luckily the manager in screwfix has agreed to change the cameras for us after Swann we’re completely useless! Do not buy from Swann, product clearly has a common fault, zero customer service and unusable warranty!!!!Automated response just shows what type of company Swann is!! Follow up what communication I haven’t received any!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angel & Kristina  Davis",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T02:51:34.000Z",
          "Titre": "The customer service and live…",
          "Contenu": "The customer service and live interaction is very lacking. If you try and chat or communicate Realtime it is not very well put together. There is no guidance on purchase or help. The product is good. Camera Quality is great. I wish they could fix the customer service experience to match."
        },
        {
          "Note": 1,
          "Pseudo": "John Young",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T18:52:42.000Z",
          "Titre": "Terrible",
          "Contenu": "Terrible, never was able to talk to anyone for determining compatibility.  Ordered what I thought would be right, waited several days, went online to check hadn't even been processed. Still \"pending fulfillment\".  Got worst when I attempted to cancel order, followed automated prompts to return, got to the point of waiting for a person to respond no one ever responded.  \"is anyone there?\" several times.  finally got an email for each time I asked \"Is anyone there?\"  What a disaster!!  Called Lorex talked to someone and in TWO days equipment was on my doorstep."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr Paul Corrigan",
          "Nb_Reviews": 15,
          "Date": "2023-12-18T11:04:39.000Z",
          "Titre": "poor camera build quality",
          "Contenu": "the night vision failed on 6 cameras and the other 2 stopped working all together, upon opening one up i was surprised to find a bag of silica gel to help keep inside dry.poor quality"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Andy Maddison",
          "Nb_Reviews": 11,
          "Date": "2023-12-19T09:35:37.000Z",
          "Titre": "Dealing with tech support is a painful…",
          "Contenu": "Dealing with tech support is a painful experience. It takes days for a response, they just keep asking more and more questions. After many emails over weeks I got fed up with them"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ian",
          "Nb_Reviews": 10,
          "Date": "2023-12-19T17:12:48.000Z",
          "Titre": "Swann have been a nightmare from day 1",
          "Contenu": "Swann have been a nightmare from day 1. Now all the camera's are faulty, none of the white LEDs work. The motion detection is a waste of time even when areas are masked off. You can't talk to any one in the UK. Absolutely useless, worse than useless."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JC Ojeda",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T04:12:03.000Z",
          "Titre": "I just recently became a swann security camera owner.",
          "Contenu": "I just recently became a swann security camera customer. I have always had these great expectations for swann security cameras until now. Have two different kinds of cameras. 1080 p wifi and and extreme camera. The video quality and motion sensor quality is ok but should be great. I have a set of blink outdoor 4 cameras and these have better motion and video quality. I've honestly always wanted swann cameras but I had him higher expectations just for the simple fact that you guys are a leading brand in security cameras. I constantly have to keep closing and opening the app due to app freezing or becoming unresponsive. Camera constantly going offline for no reason. Internet signal excellent. I don't seem to understand what the issue is.  The App just doesn't work properly."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mrs Stacie Harrison",
          "Nb_Reviews": 12,
          "Date": "2023-12-21T03:38:20.000Z",
          "Titre": "Don’t buy unless your 100% sure on product",
          "Contenu": "Brought the wrong item but unable to return as I removed a few pieces of sellotape even though I contacted them the day I had it delivered."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael A",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T15:52:21.000Z",
          "Titre": "Refurbished swann camera",
          "Contenu": "Floodlight Camera was not working. Went through swann support tech1 and tech 2 found out it was a faulty camera. The return process through swann is horrible. I've been trying to get a replacement for over a month and still working with them. I will never order directly with swann again. I will only order from someone that will take return immediately. Horrible experience,  shame  on you swann for making this experience horrible."
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Hardwire TV",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T02:58:43.000Z",
          "Titre": "Swann is rubbish",
          "Contenu": "Swann offer a product that stops working while you are away on holidays leaving your home unsecure and unmonitored. The cameras aren't very good and the \"supporting\" app is even more useless. Swann customer service is totally bs and they don't support their products. Even the response below is totally nonsense! Don't even bother with the \"woke ai bot\" to help direct you to a human whom can sort out the problem. I've written via email with no reply. Can't call them because I'm overseas ATM and not practical. Absolutely useless company with no care for the end user. You are wasting your money and time."
        },
        {
          "Note": 1,
          "Lieu": "JM",
          "Pseudo": "gary wallace",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T19:18:06.000Z",
          "Titre": "I bought the 1080 package and I was…",
          "Contenu": "I bought the 1080 package and I was sent 1080 box but 4k cameras so I’m still without working camera as it’s been a slow process to try and sort out, which still hasn’t been resolved."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lloyd Brooks III",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T04:44:39.000Z",
          "Titre": "I ordered a refurbished nvr 8580…",
          "Contenu": "I ordered a refurbished nvr 8580 system. Opened it and set everything up quickly as I have been using swann system for over 5 years. Unfortunately I received a unit that was not soldered properly because ethernet ports 1-4 do not work."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Chewii Wookiee",
          "Nb_Reviews": 69,
          "Date": "2023-12-13T20:53:59.000Z",
          "Titre": "Useless takes a minute for the app to…",
          "Contenu": "Useless takes a minute for the app to wakeup the live view.When my son visited he had been sitting talking to me for nearly four minutes before the app said the bell has been pushed, useless.In reply to your reply I did they replaced the unit because it to was useless, Your support department know exactly what kit I have and the installation why don't you contact them"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T21:09:06.000Z",
          "Titre": "· 4 days ago  Cameras with moisture",
          "Contenu": "· 4 days ago  Cameras with moistureI bought this NVR from eBay brand new unpacked with a full receipt. After installation noticed that 4 cameras have moisture inside the lens. Contacted support and they said they couldn't help because I bought the product from eBay. Well disappointed especially since I was planning the get this system on the 2 sites in the business. Well, obviously I am not going to do that and get something other like Hikvision for example. Please look at the pictures, nothing more to comment"
        },
        {
          "Note": 1,
          "Pseudo": "Brian Porter",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T08:27:37.000Z",
          "Titre": "Swan cameras are the worst cameras ive…",
          "Contenu": "Swan cameras are the worst cameras ive ever had.. Even the oldest cameras were better the these pieces of junk. Leaving your home unprotected while your gone. The picture is bad and the sound keeps sounding like static going in and out you cant even hear let alone see it. I wouldnt even rate it a 1 star. More like a 0 star. Ive had nothing but trouble out of them. The app is the worst app ive ever seen. I bought 3 cameras at 150.oo bucks a piece . Never do that again. I had to spend another 125.oo bucks on a Night Owl. Witch works great and has an awasom app. These people need a good sueing.... Not a good camera or app."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Francine Paquette",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T04:08:17.000Z",
          "Titre": "I bought two outdoor wireless cameras",
          "Contenu": "I bought two outdoor wireless cameras. I have so many problems with them. The battery dies within a week and have trouble connecting"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "laura Anne",
          "Nb_Reviews": 10,
          "Date": "2023-12-09T14:35:59.000Z",
          "Titre": "Purchased the swann fortify cameras…",
          "Contenu": "Purchased the swann fortify cameras which looked great. Thought we would test them in the living room before installing them. The app doesn't work! Many functions in the app have been turned off tech asked us to reboot the cameras function unavailable, set date and time function unavailable. Unable to view cameras, notifications come though to say motion detected but then app says unable to view camera. Tech has checked our WiFi which is very quick, ensured they are set up on the right network etc and all is okay. On reading the reviews on the swann security app this seems to be a highly reported issue since the app was updated. Awaiting reply so I can return them. Cameras look good but not fit for purpose as the app is faulty and you can not view any footage."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Ashleyy Jennifer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T23:23:43.000Z",
          "Titre": "Well my cameras load way to slow I get…",
          "Contenu": "Well my cameras load way to slow I get a notification and I can’t view it for atleast 2 minutes after. What’s the point of this security system if I can’t view it as soon as I open my app it takes too long to load yuu pay big money for these cameras to sit there and watch it load"
        },
        {
          "Note": 1,
          "Pseudo": "Mary Kolyaei",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T09:27:14.000Z",
          "Titre": "Save yourself the frustration and steer…",
          "Contenu": "Save yourself the frustration and steer clear of Swann products. I made the mistake of purchasing the swwhd-dp890c model six years ago, only to find out that Swann doesn't provide any support for it now. It's disappointing that a company wouldn't stand by their products for the long haul. Consider this a cautionary tale before investing in any Swann products.\""
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Fili Corpuz",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T23:22:57.000Z",
          "Titre": "The recent clips doesn’t showed we have…",
          "Contenu": "The recent clips doesn’t showed we have already subscribe can someone assist us our unit is brand new we did everything but still nothing has happened."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Mary Kolyaei",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T01:37:06.000Z",
          "Titre": "the Swann response also reinforces the negative review I provided for their business.",
          "Contenu": "This is my previous review:Save yourself the frustration and steer…Save yourself the frustration and steer clear of Swann products. I made the mistake of purchasing the swwhd-dp890c model six years ago, only to find out that Swann doesn't provide any support for it now. It's disappointing that a company wouldn't stand by their products for the long haul. Consider this a cautionary tale before investing in any Swann products.\"The below is their reply:Reply from Swann Security2 days agoHello Mary,We are sorry for the inconvenience, please note after careful consideration and evaluation, Swann has decided to discontinue support for our end-of-line products. Please click on the link below for more information:Thank you,LV - Swann Team*****This is what I am trying to say: there is always a high chance that your business will undergo another careful consideration and decide not to support your current or future products.*****"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "George Woollons",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T05:15:39.000Z",
          "Titre": "I have asked for information twice over…",
          "Contenu": "I have asked for information twice over the last month via both Email and chat and other than automatic replies which did not cover my queries have had no other response.  My queries are regarding why the spotlights on my cameras have started coming on in daylight hours and why my DVR Wi Fi has suddenly started dropping out, I am having no trouble with any other of my WiFi device."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "carl",
          "Nb_Reviews": 7,
          "Date": "2023-12-14T08:35:14.000Z",
          "Titre": "The item was not for me I opened it…",
          "Contenu": "The item was not for me I opened it only looked at the item did not remove it from box. Got in touch with you to return item and was told that could not receive refund or return item. Not really helpful"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "bryan buckman",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T21:33:01.000Z",
          "Titre": "dvr unit defective cannot access main…",
          "Contenu": "dvr unit defective cannot access main menu with right click only camera tool bar will show with left click tried both front and rear usb ports and a second mouse but got the same results."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AD Henson",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T06:30:35.000Z",
          "Titre": "I ordered 3 cameras, 2 don’t work",
          "Contenu": "I ordered 3 cameras. Two aren’t working. I’ve called, emailed, chatted with the chat bot, called again several times. No one has called me back or responded to my email. Stuck in the phone tree. I am VERY upset! I seem to have no recourse."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Peggy Keyte",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T12:15:37.000Z",
          "Titre": "4 out of 6 cameras are no longer…",
          "Contenu": "4 out of 6 cameras are no longer supported through the app and the other 2 constantly cut in and out, not happy at all"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "GEOFFREY TODD",
          "Nb_Reviews": 4,
          "Date": "2023-11-30T18:42:49.000Z",
          "Titre": "The system went faulty after logging in…",
          "Contenu": "The system went faulty after logging in twice and locked me out,cannot use it, and no customer supportbought this as a plug and play without the need for internet connection.but you need internet to fix it which will not work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Truth Be Told",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T23:31:38.000Z",
          "Titre": "4K Camera Floodlight Defective",
          "Contenu": "Camera Floodlight came defective.  Spent over 1.5 hours in chat with tech and they could not remedy.  Swann has a return policy that you have to talk to tech before returning.  They also made me send photos and video of the issue before they would take a return.  Then I had to fill out a form to get a Return Authorization.  Received email that they want to know if I needed to return 1 or 2 cameras.  I only ordered the 1 4K Camera Floodlight.  They are doing a stall tactic.  I have written them several times and still no Return Authorization number from them.  Do not buy from Swann."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bianca Salvatore",
          "Nb_Reviews": 5,
          "Date": "2023-12-07T19:14:54.000Z",
          "Titre": "Camer  never works",
          "Contenu": "Camer  never works! You can’t talk both ways to it ever and whenever you click an automatic saying to someone that’s outside it won’t work. This is the second one they’ve sent me and they still don’t work."
        },
        {
          "Note": 1,
          "Pseudo": "Yong Fang",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T20:39:19.000Z",
          "Titre": "Zero star I would give",
          "Contenu": "Zero star I would give. Terrible customer service. Short live Swann security camera! No app to link with! No support given. Waste of money. AVOID!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Michael  Wishart",
          "Nb_Reviews": 16,
          "Date": "2023-12-10T18:23:54.000Z",
          "Titre": "I tried for 2 hours to get it going",
          "Contenu": "I tried for 2 hours to get it going, I tried talking to a robot but got nothing. It says it only takes 5 minutes to set up .Absolutely waste of time and money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jackie shamburger",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T14:32:28.000Z",
          "Titre": "I have had 2 DVR’s go bad within about…",
          "Contenu": "I have had 2 DVR’s go bad within about a 2-3 year span and I had to pay for both of them. I love the system but the equipment should not go out that fast."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Steps",
          "Nb_Reviews": 10,
          "Date": "2023-11-23T11:39:26.000Z",
          "Titre": "Terrible customer service",
          "Contenu": "Terrible customer service, do not return calls cut you off & that's if you get through. Are extremely unhelpful definitely not like the service it use to be, call centre in the Philippines if i remember been trying to get hold of them for several days now. When call automatically put on call back list & without even giving number & my number is withheld so it wouldn't come up on the system & even if it did nobody returns the call.Pittyful service its disgusting & I'm beginning to regret upgrading with another swann product"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Phil",
          "Nb_Reviews": 8,
          "Date": "2023-10-31T18:06:54.000Z",
          "Titre": "My existing DVR8- 4980 install in 2020…",
          "Contenu": "My existing DVR8- 4980 install in 2020 came up with HDD Reformatt . Reformatting clears all saved content which may or may not have recorded criminal damage to my property before it failed. Tried rebootingswitched off and on dead. So bought new compatable system with Sound cameras. so far just plugged in DVR to existing cameras. Tried to ask Swann to retrieve encrypted images from old HDD they do not want to know."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Steve Gunn",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T13:32:31.000Z",
          "Titre": "Wireless security cameras and Door Bell",
          "Contenu": "Bought 2 * 2 Wireless security cameras and the Door Bell.   Cameras frequently go offline and batteries last about three weeks.   Can't change the batteries so have to recharge, which takes hours.  Same for the Doorbell which is made worse by having to undo the tiny screw at the bottom to take it to charge.   Been trying to improve battery usage for months now, but haven't even bothered with 2 of the cameras due to the hassle of the first 2. Unless you have a lot of spare time - the wireless versions are a waste of money."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Seamus Moore",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T13:54:35.000Z",
          "Titre": "Keep well clear of this rubbish",
          "Contenu": "After receiving a replacement camera/spotlight I have had it installed and it is exactly the same as the first one. The light comes on after 1 second and flashes on and off all night long. You refuse to honour your policy and now I must pay (for the third time) to have it removed, and posted to you at my cost and then you will decide within 10 days if you feel like refunding me?!!!!!?"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Sam H.",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T12:29:32.000Z",
          "Titre": "Full order not received",
          "Contenu": "Full order not received! DVR box and Home Security Camera kit received but no cameras! Emailed Swann Customer Services several times reporting this but not received any response to date. Booked engineer to install and paid deposit in advance which is now lost! Compensation required!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RO JE",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T00:06:08.000Z",
          "Titre": "SWANN SECURITY CAMERAS COMPANY NO GOOD",
          "Contenu": "They quit letting my phone connect to the system then told me the dvr system was dead because they wanted people to buy there new stuff when my dvr and cameras still worked 😒  and couldn't do nothing for me"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Rocchetella Lanza",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T13:58:37.000Z",
          "Titre": "I bought 4 new add on Enforcer cameras…",
          "Contenu": "I bought 4 new add on Enforcer cameras for our NVR system from your website , we have now been told that they are not compatible, there was no indication on your website that they wouldn't be,  I have emailed without response from you to return them, we feel let down by Swann whom we thought was a genuine company. Can you please get in touch with me regarding this matter. case number is 2227514, my name is Rocchetella Lanza and you can contact me on 07769901318 uk  Thank you"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "MrDavidb64",
          "Nb_Reviews": 3,
          "Date": "2023-11-07T01:09:08.000Z",
          "Titre": "I purchased a Swan security system in…",
          "Contenu": "I purchased a Swan security system in February and had it professionally installed. The system started going offline after 6 months unexpectedly by the start of November it stopped working. Tech support couldn’t resolve it so I had to post the DVR and power source at my expense and now waiting for the outcome. Not happy.The reply is worthless as I already did that and had to send the device for assessment at my cost whilst under warranty. Clearly customer assistance team didn’t read my review properly."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Keith Lantsbury",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T10:21:03.000Z",
          "Titre": "I purchased a Swann Corecam 4 system 2…",
          "Contenu": "I purchased a Swann Corecam 4 system 2 weeks ago. 4 cameras were included. One has failed due to moisture getting inside it, another has gone offline and will not restart when the reset button is pressed. I have two cameras out of 4 working after only a few weeks of operation, I can't trust the other two, therefore I am no better off than i was before, with no reliable security on my place. I paid 800 bucks for the system and thought that this would be enough to know that i wasn't buying something uselses.Not happy 0278140321"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gerald KAY",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T02:09:10.000Z",
          "Titre": "Just because this NVR is only 4 years…",
          "Contenu": "Just because this NVR is only 4 years old, you won't tell me which camera models are compatable.  You say it is obsolite?  After only 4 years?  That is crazy!  Just look back in your records and let me know which cameras I can buy for it."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Matthew Symonds",
          "Nb_Reviews": 4,
          "Date": "2023-11-03T18:02:49.000Z",
          "Titre": "The returns policy is against UK…",
          "Contenu": "The returns policy is against UK consumer rights! Caused major issues when returning an order and if I was less informed of my rights I would have been taken advantage of.Don't deal with companies who happily take advantage of vulnerable customers who do not know their rights"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mac Clatchey",
          "Nb_Reviews": 4,
          "Date": "2023-11-21T23:17:00.000Z",
          "Titre": "Avoid swann CCTV app",
          "Contenu": "Have to say swann security and it's app has to be the worst CCTV provider I have ever used , avoid buying any of swanns  security package cos it's not fit for purpose!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Wakil  Mawlawizada",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T02:19:20.000Z",
          "Titre": "This is not a good quality camera and…",
          "Contenu": "This is not a good quality camera and has no sound, I don't recommend to anyone"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Lee Sherwin",
          "Nb_Reviews": 10,
          "Date": "2023-11-14T01:33:40.000Z",
          "Titre": "less than 2 years old and 3 separate Enforcer systems have failed cameras",
          "Contenu": "I installed 3 enforcer systems just under 2 years ago.On my personal system the main hard drive failed just after a year.On all 3 systems the lights on the cameras have failed on the most used cameras and on my own system it is now 3 cameras that have failed.Swann have asked me to try many things via support before coming to the conclusion that the cameras have failed but will not replace them as they are out of warrenty.Swann is a well known and supposidly reliable system. From my experience, 3 systems and each system has failed cameras within 2 years and they are not cheap to replace. On my system I may as well spend the extra money and replace the system completely as two cameras are approaching half the price of another complete system....but it will not be Swann, that I can say for sure. If you want a system that is reliable then Swann is probably best avoided."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Stu",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T09:31:11.000Z",
          "Titre": "Difficult to get through to customer…",
          "Contenu": "Difficult to get through to customer service. Provided virtually no advice except 'device is not compatible with your phone' by then I had opened the package so they would not accept a return or refund. They have not responded to email requests - definitely consider other makes instead."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "H.M.",
          "Nb_Reviews": 6,
          "Date": "2023-10-28T16:26:56.000Z",
          "Titre": "The CCTV system delivered to me was the…",
          "Contenu": "The CCTV system delivered to me was the wrong one. After a call to your Indian call centre I eventually got a text message telling me to down load a return label in a PDF., by the way telling people they have seven days to do this when it was your mistake at the start is a bit rich. A few days later I have received confirmation my money was being refunded. Note: A much better customer service experience would have been the following, \"We're sorry you got the wrong system, we will arrange an uplift and ensure the correct system is dispatched immediately\". Future sale lost."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Brian Wevill",
          "Nb_Reviews": 10,
          "Date": "2023-10-20T14:16:24.000Z",
          "Titre": "Rubbish after sales and support",
          "Contenu": "The product itself seems fine, but seeking advice when fitting the system was ridiculously difficult, you need a telephone helpline, not an online system where, when you eventually get through, you find you have to pay for the privilege. NOT ON SWANN! get your act together.NOT IMPRESSED.Ru"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dissatisfied Comester",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T14:30:44.000Z",
          "Titre": "Worst customer service ever",
          "Contenu": "Worst customer service ever! Call the 800 number and gives few options, tells you to web site them hangs up on you. Try to chat no one answers. Never gives you a option or a chance to speak with a live person. I would not recommend Swann for any of your security needs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "val",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T18:08:31.000Z",
          "Titre": "problems with getting email alerts and…",
          "Contenu": "problems with getting email alerts and system oesn't do pushes, and no beeping to alert, and at this moment, only 2 of 6 cameras are working...still working on these things but shouldn't have to"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Carl Nixon",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T14:59:57.000Z",
          "Titre": "Absolute rubbish.",
          "Contenu": "Absolute rubbish.Two 8 Channel DVR's in five years.First hard drive gave up within 18 months.Second one couldn't access using a monitor within 14 months and could only use via app. A year later the hard drive failed.Called technical support and they are more interested in all your details less your inside leg measurements to then be told they no longer offer support but can put me through to sales!!Like i'd buy another!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sylvester Butler",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T17:11:39.000Z",
          "Titre": "The device is antiquated",
          "Contenu": "The device is antiquated. No one uses an Ethernet in their home. My modem and router are not located in the same room as the device. So I wasted money to purchase a wireless adapter only to find out there is only one usb port that supports the mouse. So now there is no way to connect the adapter. This is a genius operation! Imam so disappointed in your product."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "simon cole",
          "Nb_Reviews": 10,
          "Date": "2023-10-27T09:33:42.000Z",
          "Titre": "Dreadful company",
          "Contenu": "Dreadful company. Had 3 working cameras, told that support for them was ending (they were 4 years old) and they stopped. Swann then said \"oh yes you will have to buy new ones - we'll give you a small discount\"I will never trust this company with my money ever again, appalling service from a group that care little about it's clients"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Keith Abernathy",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T05:05:08.000Z",
          "Titre": "Really just need some customer support",
          "Contenu": "Really just need some customer support.  I have one of your systems and, apart from watching the cameras on my screen, don’t know how to do anything else and don’t see any support to show any of this."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mukhtiar Dobb",
          "Nb_Reviews": 21,
          "Date": "2023-11-04T17:36:26.000Z",
          "Titre": "One star is a bit too much to give…",
          "Contenu": "One star is a bit too much to give despite they couldn’t help me with a system of their own in trying to set it back to the factory setting on a DVR8-4680XN cctv box"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Charlotte Salway",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T02:32:19.000Z",
          "Titre": "Trying to return a camera that has poor…",
          "Contenu": "Trying to return a camera that has poor quality and I'm having to jump through hoops just to get a return address. It's been 10 days and I still haven't been able to get an address to return the item. Avoid this company !!!!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Joyce",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T20:06:47.000Z",
          "Titre": "It’s not working… ping… 2am get…",
          "Contenu": "It’s not working… ping… 2am get notified offline….."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kate Hayward",
          "Nb_Reviews": 3,
          "Date": "2023-08-29T01:28:02.000Z",
          "Titre": "50% work. SOL on warranty. Save your money.",
          "Contenu": "Bought 2 sets of fortify wifi cameras at Pricemart, a big box store in Latin America. Had cameras professionally installed. One set totally not working. Had 6 calls over the course of 2 months to resolve the issue. They finally agree that the cameras are faulty and told me to return them to Pricemart, who only has a 30day guarantee. Swann refuses to act.Costly mistake in time and money. Save yours"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ND",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T22:01:48.000Z",
          "Titre": "I buy the enforcer audio /video I order…",
          "Contenu": "I buy the enforcer audio /video I order before thanksgiving delivery was terrible customer service so awful no answer the phone and and the worst is audio has only aesthetic noise i can heard any thing only noise waist time and money,If  i could give you a -0 I be pleased and I’m a regular customer to swann …"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Dave Fisher",
          "Nb_Reviews": 6,
          "Date": "2023-11-28T16:45:25.000Z",
          "Titre": "I have tried my best with Swann",
          "Contenu": "I have tried my best with Swann, so I decided to look them up on Trust Pilot...I have told them I will be posting my whole experience and their responses on the Internet Their Cutomer Services have lied consistently, and their Technicl Department?? Well customer Services advised me yesterday that they would be calling me either yesterday or today from the UK...They even gave me the telephone number tey would be calling me from as I requested that because we get many unknown/spam callers and have to be careful when you are elderly. So yesterday evening I received an email from the technical department from a chap named Paulo? from his mystery location at GMT+11 ?? Which the last time I looked was not Greenwich near London.... On which email were a ream of questions about my time zone and could I suggest two different days and two diiferent times that I may be able to take a call??   Now if he was based in the UK (Say at the UK Milton Keynes address which forwards your call to the Philippines) Then I would apologise for suggesting they lie... however no apology coming and looking at all of the comments and complaints I have seen today on this site. I think I need not bother them any more. I will just download the copies of my chats and conversations and if I cn prevent one person having to go trough the trouble I have had, then hopefully that will be someone receiving a Security Camera system from a reputable supplier this Christmas... And on an even more sour note, I have received multiple advert from them via email to visit their black Friday Sale at their website. think there was an error on that email and it should have read come and visit our \"blacked out screen\" site.You know it makes sense!!!   Really Dreadfull and if a Manager would like to call, then please use the contact details that were supplied to you on Order Number 5116334..that is if your computer will let you have them."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Alison",
          "Nb_Reviews": 14,
          "Date": "2023-10-10T18:12:26.000Z",
          "Titre": "They have no returns service at all",
          "Contenu": "They have no returns service at all, absolute disgrace of a company. Purchased a Swann security system, opened the box and realised it was the wrong one I purchased, I contacted them to return sit and they said because I opened the box they will not accept it back, well you obviously have to open a box to check goods!!!! Never again, DONOT USE  THIS COMPANY*****Would like to also add the company said if I return back they will also CHARGE ME A FURTHER £25 because the box was opened, plus cost of return at my expense as well, they must think I’m stupid!!!  Total ripoff of a company, do not want to know you once they have your money"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mrs carol steele",
          "Nb_Reviews": 9,
          "Date": "2023-09-05T11:28:49.000Z",
          "Titre": "Cameras are great but the app is…",
          "Contenu": "Cameras are great but the app is dreadful especially the new update.Picture so small you can hardly see it it's distorted and runs fast extremely hard to work. Dont know why you change it, it was never wonderful but even worse now. If needed to change cameras due to app would not be replacing with Swann😡"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "A B",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T09:13:02.000Z",
          "Titre": "Item did not work, no customer service",
          "Contenu": "Item did not work, customer support live chat did not respond. Technical support telephone line unable to get camera working. Swann currently haven't provided full refund and have not said they will. Terrible experience, would not use Swann again."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Annonymous",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T17:34:21.000Z",
          "Titre": "No support",
          "Contenu": "Similiar experience to other users.  Customer support is non existent.  Online functionality is broken whilst it is impossible to get assistance with a telephone call.  I will be replacing this equipment with a manufaturer that values its customers."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "M.T.H",
          "Nb_Reviews": 54,
          "Date": "2023-08-06T21:09:14.000Z",
          "Titre": "I so wish I could give no stars.",
          "Contenu": "I so wish I could give no stars.I've 3 cameras cordless cameras on my WiFi system.Regardless of the settings they will continually record or not record at all.App continually crashes and when you log in you are shown old footage until you reboot the system.Each camera cost me £150 so three cameras cost £450 so buy other brands and get better quality.Just avoid!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Gary Bostock",
          "Nb_Reviews": 3,
          "Date": "2023-09-30T08:33:15.000Z",
          "Titre": "No returns",
          "Contenu": "I purchased two wifi cameras which unfortunately when setting up one of them I found to be very poor quality (quite possibly our wifi) I contacted Swann to return them but this is not possible due to the item being opened. Now I'm stuck with two un usable cameras."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "DK Security",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T05:41:05.000Z",
          "Titre": "Would not recommend Swann to anyone",
          "Contenu": "Would not recommend Swann to anyone, had cameras working fine for 2 years and the technician thinks they need to be relocated. They don’t record when motion is detected. Had a camera technician install them too. If you want something that will work for a short time then waste your money on this. Regret buying this brand. It’s rubbish!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "HO",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T08:10:49.000Z",
          "Titre": "Wouldn't recommend Swann Security",
          "Contenu": "Wouldn't recommend Swann Security - the systems not very easy to use and the footage skips to random points throughout the day and cannot watch certain times. Tried contacting them for support but were useless and just kept sending website links which were not helpful or relivent to the issue. Before I could go back to them they would close the case so I would have to open a new one. All round awful service.Update - after Swann responding to my review, they still have not made any contact by call/email."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Zara Bea",
          "Nb_Reviews": 5,
          "Date": "2023-09-15T17:45:53.000Z",
          "Titre": "Poor service",
          "Contenu": "It's ridiculous that I have to leave a public review due to the lack of response. I tried contacting you by phone and if you call once... any further calls are cut dead with the response there's already a callback for this number and no one ever calls. I contacted you by chat which suggests someone will be in touch then received a whole conversation the advisor had with themselves - it's just getting beyond a joke. I returned my items for order 5114460. They were delivered 8/9/23  I keep trying to check if they've been received and when I'll get a refund... your chat and phone functions on the site don't work properly. Extremely frustrated."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "kkkeving2019",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T17:09:32.000Z",
          "Titre": "Shocking cameras",
          "Contenu": "Shocking cameras. In the fiew months I've had them they have probably worked for me about 5 times the rest can't load the video. Live stream has a delay so that is pointless and by the time you open app get it up you have either been robbed or have left premises and can't view what's going on. The playback never works unless your on the WiFi at home which doesn't always work. Sorry I bought this system nothing but problems."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Rich",
          "Nb_Reviews": 8,
          "Date": "2023-10-10T18:14:58.000Z",
          "Titre": "Swann camera",
          "Contenu": "Swann camera. Been ok for several years. All of a sudden the recordings are there but they don’t play. Asked support and they said- your model is no longer supported. That’s it! They take the money and don’t deliver. AVOID SWANN. They replied that I can search the manuals. They don’t support ‘end of line devices’ (that they made and sold for money). What a wonderfully customer centric company."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Phillip Antony Stansfield",
          "Nb_Reviews": 5,
          "Date": "2023-07-02T14:38:03.000Z",
          "Titre": "We had a Swann Video Doorbell that has…",
          "Contenu": "We had a Swann Video Doorbell that has always been for the best part useless. Last week the Swann Buzz App to support it has been made obsolete so now video doorbell is 100% useless. Thanks for letting us know before hand Swann , front door surveillance/security really secure. Swann your customer service is 2nd to none 🤬"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr alexander samuel",
          "Nb_Reviews": 5,
          "Date": "2023-09-18T20:27:50.000Z",
          "Titre": "Tried to return item bought that was…Thank you for your reply. However, as I am profoundly deaf the only way to contact me direct would be to use email. I look forward to your response by email regard",
          "Contenu": "Tried to return item bought that was wrong item sent. Was passed from pillar to post several times and followed instructions every time to no response. Each time I contacted Swann I was redirected to the supplier who redirected me back to Swann. Still awaiting instructions to send back to have payment refunded."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kevin",
          "Nb_Reviews": 10,
          "Date": "2023-08-15T08:51:07.000Z",
          "Titre": "System works when it wants to",
          "Contenu": "System works when it wants to !  Cameras pick up motion, when they want to !Re-booted system three times, re-set to base settings and started again but still has a mind of its own.Watching recorded items takes an age and runs very slow, if at all.Should never have bought a wireless system."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Swann User",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T05:31:59.000Z",
          "Titre": "Poor product",
          "Contenu": "Purchased the Swann WiFi product based on the wire free convenience but for a security solution it is useless.The motion detection hardly ever works.When it does, it captures too far after the event it is useless.When notified of motion the live view takes so long to start the subject has gone ! Useless."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "A.  Cag",
          "Nb_Reviews": 4,
          "Date": "2023-08-26T13:59:27.000Z",
          "Titre": "Does it worth to buy Swann Security system?",
          "Contenu": "I have Swann Enforcer System DVR 4680 , used it for about 20 months, on motion detection, used to give push notification on mobile app. Recently I was forced to upgrade the app and since than this most important future,  does not work anymore. I have contacted Swann Communications and emailed the app developer but I had no reply.  Is this deliberately done,?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dennis Sher",
          "Nb_Reviews": 2,
          "Date": "2023-07-21T04:13:59.000Z",
          "Titre": "Stil waiting for customer service LIZ…",
          "Contenu": "Still waiting for customer service LIZ to call as promised   Tomorrow will be day 3 I am waiting for her to give me a camera/DVR compatibility ok.  I can’t move forward until I hear from her. I presently have a new DVR from Swann.com that is NOT COMPATIBLE. Dennis Sher9142246304"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T02:08:54.000Z",
          "Titre": "Unreliable",
          "Contenu": "Unreliable, self storage options just don’t work, so for a good security solution you will have to pay. Disappointed in what I thought would be a good self managed solution."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "pyron",
          "Nb_Reviews": 3,
          "Date": "2023-06-06T23:34:33.000Z",
          "Titre": "the camera has a really slow load time…",
          "Contenu": "the camera has a really slow load time adn constantly freezes. I still can't believe they dont make a 5ghz wireless camera. The 2.4 does not provide the proper bandwidth to stream 1080 without constant crashing. I have the gigabit package and my speeds are 950mbs but the camera still has a hard time loading as do the swann doorbell cameras, another purchase of wireless camera with poor antenna's. I would stay away until they make a reliable 5G wireless camera."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donald Giroux",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T05:35:29.000Z",
          "Titre": "Poor customer service",
          "Contenu": "I have had several issues with Swann since I purchased the system. Each time customer service did not exist. The 7/16/23 date was my purchasing a new NHD-887MSFB Camera. This is camera #6 in my system. The original issue was moisture in the camera. The request was to send a photo of the camera noting the moisture. I never got a response back. Ultimately I tried to repair the camera but due to water damage I was forced to purchase a new replacement unit on 7/16.Your support services are lacking especially for equipment that is no longer under warranty.I like the system but hate dealing with your support services"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nicola",
          "Nb_Reviews": 17,
          "Date": "2023-07-06T09:17:59.000Z",
          "Titre": "CAMERAS ARE VERY DELAYED",
          "Contenu": "Even on 100% sensitivity they are delayed 10/15 seconds!! Someone entered our garden and we couldn't prove it because the camera didn't pick it up!!! Yet we knew from what they left behind!! We then checked and it didn't pick us up for 12 seconds before it recorded. So this is a waste of money if it doesnt pick up for so many seconds. We have actually only noticed this recently from having them a year so very grateful I have considering anything could have happened in the last year. Very disappointed considering the price we paid. DEFINITELY WOULD NEVER RECOMMEND"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Ellen Fraser",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T04:42:19.000Z",
          "Titre": "Would not recommend at all",
          "Contenu": "Would not recommend at all. As an electrician myself I am blown away at what a terrible system it is. I have had problem after problem since I installed my setup. But today takes the cake, I am currently away working and I have stopped receiving notifications to my phone about movement at my house. I called Swann to get this fixed and was told I have to be with the device to fix this so I have to be at home. I explained I am away and my house is empty right now so I need to be receiving notifications. Apparently there is nothing that can be done as you have to be at home to do any troubleshooting."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Marc",
          "Nb_Reviews": 2,
          "Date": "2023-05-20T15:29:23.000Z",
          "Titre": "For the application I give 5 STARS but FLOODLIGHT 1 STAR",
          "Contenu": "For the application I give 5 stars but for the reliability of the Floodlight I give 1 star. Since 2019 This is the third Floodlight installed. The first under warranty suddenly stopped detecting wifi, Swann replaced it. In 2020 while waiting for replacement I bought and installed another one and in 2022 it also suddenly stopped detecting wifi so I've installed the third one since, hoping this one won't break like the other 2. Finally the app works perfectly now."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jack",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T09:55:25.000Z",
          "Titre": "Customer service are rude",
          "Contenu": "Customer service are rude, hard to get a hold of, and lack suitable training to help their customers. They do not understand consumer law and are breaking it with what they are doing!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Holly M",
          "Nb_Reviews": 2,
          "Date": "2023-07-24T02:56:25.000Z",
          "Titre": "Do not buy refurbished equipment from them",
          "Contenu": "We purchased 2 refurbished outdoor cameras. One came with an invalid code so it could not be installed, the other had a bad lens so you cannot see the recordings.  I’ve tried twice to get customer service and have gotten no response from them yet.  Do not buy refurbished equipment from them!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Unhappy Customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T03:41:43.000Z",
          "Titre": "Do not buy!",
          "Contenu": "I've had these cameras for over a year now. The cameras, themselves, work fine, with the exception of the settings and sensors not working very well. The biggest problem is the app. It's never worked right, and the updates only make it worse. When you're not home, the app not working properly, is a huge issue. The whole point of cameras is to be able to monitor your home when you're away. Due to the garbage app, I advise anyone to not purchase anything from this company."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "jack fisher",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T18:27:38.000Z",
          "Titre": "FAULTY CAMERA",
          "Contenu": "If you can buy elsewhere do it don’t bother with this awful company I purchase a four camera set up and had it installed professionally.Three four weeks later a camera went off? I called the company and after two hours in the phone with there tek department still not working I then contacted swan who put mill through the mill again send prof of purchase I did that they they couldn’t read it sent it again they never came back to me until I contacted them?.Then they wanted a serial number and pictures of the wires?.Did that but the wires so high up I couldn’t get a good picture.Then they said send the camera back as there cameras don’t often fail?.Not happy they don’t want to know the warranty is a waste of time as they don’t honour it Disgusting behaviour from a major company you would expect a better customer service but you don’t get that I’ve now decided to buy a camera to replace there fault one and I wouldn’t ever buy from this awful company"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Denise",
          "Nb_Reviews": 8,
          "Date": "2023-06-02T12:41:16.000Z",
          "Titre": "Replacement hard drive is NOT user…",
          "Contenu": "Replacement hard drive is NOT user friendly and doesn’t work properly. No GMT for UK and record time not displayed on playback. Records randomly for no apparent reason. Chat assistant vague and no facility to address my problem."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Heidi McInally-Henry",
          "Nb_Reviews": 13,
          "Date": "2023-08-14T09:38:51.000Z",
          "Titre": "14th July contacted Swann with all…",
          "Contenu": "14th July contacted Swann with all their requests met.Constantly chasing them until 3 days ago Earl requests information already given in singular e-mails. I think this is to stall as he has this information yet will then take a few days to message another request for information he has.........3 of my cameras have water ingress, yes supposed to be weather proof & I am still waiting for resolution"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Bryan Hawke",
          "Nb_Reviews": 2,
          "Date": "2023-08-20T05:25:05.000Z",
          "Titre": "Would not recommend Swann to anyone",
          "Contenu": "Would not recommend Swann to anyone, had cameras and system working fine for 3 weeks, then the system went off line I reset it and it works for a few hours and it is goes offline again.For security the system is useless, for the robbers it is great.COMPLETE RUBBISH"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "stephen bunn",
          "Nb_Reviews": 13,
          "Date": "2023-09-17T18:58:02.000Z",
          "Titre": "Good points delivery",
          "Contenu": "Good pointsReceived the item in good time.Item packed and all parts there.Bad points.Realised I had purchased the wired set when I needed the wireless set, to send back I was going to be charged for the return of wich I accept but when they wanted £25 extra to replace the security tape on the box I changed my mind absolutely disgusting les than a yard of tape on the hole box"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Stephen Dhesi",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T08:23:23.000Z",
          "Titre": "Sent me the wrong cameras",
          "Contenu": "Sent me the wrong cameras. Customer agent didn't believe me and wanted to charge me £25 for returns. Very Poor customer service that's if you can actually get through to them. NEVER will I use swann again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wolf L.",
          "Nb_Reviews": 2,
          "Date": "2023-08-09T17:50:46.000Z",
          "Titre": "Password reset nightmare",
          "Contenu": "In the old days I could call up Swann and get a password reset. Now it is impossible to get help. If you do manage to get through to a live person, they give you a link to a reset process, which does not work for me. I cannot get a password without having the system connected to the internet and I cannot set up the wireless connection without a password. I tried calling again and the voice system told me Swann cannot help me as my system is too old. So now I had to order a replacement DVR on EBay only because I lost the password. Not a good experience, lots of frustration and time & money wasted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Teresa",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T19:41:12.000Z",
          "Titre": "Nothing but issues with cameras not…",
          "Contenu": "Nothing but issues with cameras not capturing any motion and if by chance they do it has super lag time. So frustrating. Have had this system since November 2022 and it worked pretty good for almost a month. Haven’t used it in close to 3 months now and am giving it another try today. June 2023"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nelson Curl",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T18:30:26.000Z",
          "Titre": "I received a reply from Swan.  Gave me number to call.  I called.  the automated reply system told me my equipment was no longer supported, and linked me to some websites for manuals. Did not work.",
          "Contenu": "Purchased equipment. Hooked it up. Worked fine.  Went through the set wizard. Worked fine. 4 hours later, quit working. Went on line.  Checked my account. Looked good. Found nothing to change or fix. System not working. No one to call. Not planning now to continue business with Swann. I do not recommend for anyone else."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Garry Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T18:47:49.000Z",
          "Titre": "Faulty cameras",
          "Contenu": "Bought the Swann enforcer 8 channel 1080p dvr cctv kit with 4 cameras.After only 12 weeks two of the cameras stopped working properly. Even though they still recorded they were flashing continuously really fast and not displaying the right lights for night vision.I spoke to customer service and on their advice explained the issue and sent a video to the technical department who confirmed they were faulty.I was the informed to return the two cameras to see if they could be repaired and track the delivery.I have no problem sending the cameras back but was not in a position to have no security . I informed them of attempts on my property to take my dog and threats made .Unfortunately they would not send two working cameras to put up as this is not the policy.Considering they are only weeks old and the position I was in I was not satisfied with this.Now having to replace with a different systemWill never buy Swann again"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "SM",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T20:59:53.000Z",
          "Titre": "Still trying to get a reply about how…",
          "Contenu": "Still trying to get a reply about how to return a purchase and very, very difficult to get an answer to a simple question.Unfortunately, email replies which were apparently sent have not come through to either my email or junk folder and i have checked many times."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Gillian Dunmall",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T07:07:35.000Z",
          "Titre": "We have tried to install the cameras",
          "Contenu": "We have tried to install the cameras, they initially worked and now are not working at all. We are receiving a message that there is ’no signal’ yet the box is connected properly and the Wi-Fi is working. We contacted the technical helpline and they have sent us a new plug! I don’t know if that is going to help as only just received it."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "abe  REES",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T12:10:29.000Z",
          "Titre": "not a great system unable to read a…",
          "Contenu": "not a great system unable to read a number plate at 35 ft in daylight no wonder thief's get away no surprise eh."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Laurie Butler Iverson",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T19:17:15.000Z",
          "Titre": "Took a long time to deliver",
          "Contenu": "Took a long time to deliver.   The item is not working appropriately and does not appear to connect to my Swann security system.   Needs MUCH improvement or I want my money back."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Juana",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T20:24:16.000Z",
          "Titre": "I like the swan cameras…but,",
          "Contenu": "I like the swan cameras, however the app is very slow to load up. Also if one wants to view a specific area, let’s say 2 persons were detected, once you click to view the persons it takes you to the whole recording and not the specific area selected. The doorbell and inside camera at times disconnect themselves, as well as take long to load up. On reference to the main device it does not give one the option to go back to recordings."
        },
        {
          "Note": 2,
          "Pseudo": "Mr Richard Brightmore",
          "Nb_Reviews": 6,
          "Date": "2023-12-08T11:27:24.000Z",
          "Titre": "I bought the Swann 2 x core cam",
          "Contenu": "I bought the 2 x core cam, managed to pair one camera but the other would not. I find the camera which works very slow to connect even though we have fibre. I decided I wanted to return the product and get the EUFY system I have at work which works far better. The customer care would not give me a returns process without speaking to technical. I didn’t want it replaced or repaired but they weren’t very cooperative."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Terry Keller",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T04:47:16.000Z",
          "Titre": "Overall the extension cable is top…",
          "Contenu": "Overall the extension cable is top quality, however the union-connection is all i needed to extend the cable I already have. I feel that $30 something, was too much to pay for just the union- connection. Just a couple dollar piece of hardware is all I really needed."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Sam Sandon",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T02:22:10.000Z",
          "Titre": "doorbell camera constantly drops…",
          "Contenu": "My doorbell camera constantly drops out. Takes forever to load when there is a motion detection. By the time you finally get into the camera whoever was trying to break in would’ve got you by then…"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "lee",
          "Nb_Reviews": 5,
          "Date": "2023-11-30T09:29:08.000Z",
          "Titre": "Swann cctv",
          "Contenu": "HiI purchased a Swann security system after looking at many reviews, and after installing a six camera enforcer system I was instantly very impressed but after two months the cameras spotlight failed an I must say the customer service was appalling, avoid.follow up after swann replied 30-11-23i contacted swann helpline with my unique code on the app.i was then told to reset the system didn't work, then began thirty days of e-mails i was told to swop cameras on dvr rewire cameras to see if cables were faulty. The cameras were faulty but still they did not replace finally 27/11 they told me to return the system to screwfix as they would not help anymore, customer service is none existent AVOID"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jose Ramirez",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T03:27:16.000Z",
          "Titre": "Lately, I lost  video very often, hard to fix problem. Tec support on Swan not really good. Hopefully they will get better for better customers",
          "Contenu": "Lately, I lost  video very often, hard to fix problem. Tec support on Swan not really good. Hopefully they will get better for better customers."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Robert & Deb",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T00:11:48.000Z",
          "Titre": "Playback",
          "Contenu": "Difficulty in seeing playback. Unsure about length of storage, time kept."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T13:14:30.000Z",
          "Titre": "Tried numerous times to contact…",
          "Contenu": "Tried numerous times to contact customer service only to repeatedly got bounced around then the phone would automatically disconnect you. What I wanted from  SWAN customer service representative they told me to call another number for Customer Service to try to order part only again I found that you only can talk to technical support who tells you that they can’t handle any issues outside of technical support. The part I needed was the weatherproof connector to the cameras. Much to my surprise not one to represent or technical support knew what I was talking about. How sad!. I am so glad I bought it through Amazon and the customer service was right on re-ordered the parts. If I would’ve known, SWAN was such a complicated company , I would’ve never purchased the system the Company. DO NOT BUY IF YOU PLANNED NOT TO HAVE A PROBLEM."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Graham T",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T13:26:12.000Z",
          "Titre": "If you want decent quality email images choose your cameras carefully..",
          "Contenu": "Replaced a Swann recorder which had failed plus its 4 x 5MB coax fed cameras with a Swann 4k system using power over ethernet with 4 x SWNHD-887MSFB cameras. Video and detection are fine but only see a tiny 8kb to 11 kb image on email. The images are blurred and I can't even recognise myself in them. The old cameras gave about 200kb decent images and were able to show me why the email alert was triggered. Raised with Swann support who eventually said its the cameras and that was the end of their interest. No information in camera specs regarding email image quality. Very disappointed with these cameras and lack of information regarding how and where images are generated. I had expected it to be within the recorder."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Suleyman Soydag",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T12:03:07.000Z",
          "Titre": "System data is 2 slow"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Tim  Donson",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T15:55:55.000Z",
          "Titre": "Nvr fine cameras find good picture",
          "Contenu": "Nvr fine cameras find good picture. But the cable as in network cable for cameras to nvr .awful cheap and a nightmare to unravel. Which is a shame as the rest of the system is good. Also DHL offered a service point for delivery that don't take large parcels. Not swanns fault but as a customer shouldn't have to take over a week chasing and sorting redelivery out"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "callaway",
          "Nb_Reviews": 4,
          "Date": "2023-07-31T18:32:29.000Z",
          "Titre": "iv had swan cctv for years always been…",
          "Contenu": "iv had swan cctv for years always been happy but this new set up is the pits just won,t take any email address what ever i do 5 days now still unusable  wish i left the old set up . really unhappy think your doing good upgrading  now not got any cctv taking care of my disabled  dad"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bruce  Peloquin",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T13:52:31.000Z",
          "Titre": "Swann tech incorrectly diagnosed the…",
          "Contenu": "Swann tech incorrectly diagnosed the issue requiring me to purchase a DVR that was not needed. It was a new camera that was required. I found this out by doing my own trouble shooting. I am presently trying to return the DVR which is turning into a nightmare. Therefore I believe the Swann support severely lacking."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Peter Cassidy",
          "Nb_Reviews": 8,
          "Date": "2023-10-06T18:55:20.000Z",
          "Titre": "Just basic instructions in pack",
          "Contenu": "Just basic instructions in pack, ie initial setup, no idea how to access main menu or how to down load any content. Got it recording but unable to figure out how to access data. Not so hot for the novice"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mrs Clarke",
          "Nb_Reviews": 9,
          "Date": "2023-10-16T23:33:50.000Z",
          "Titre": "Good cameras and clear pictures but the…",
          "Contenu": "Good cameras and clear pictures but the app is shocking. The cameras are wired but still require Internet for the app to get notifications.  They disconnect continuously throughout the day and the app, well its a joke one minute you'll get numerous notifications the next it tells you no recordings on the day. I get a better service from my cheap WiFi cameras off amazon."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Dave",
          "Nb_Reviews": 19,
          "Date": "2023-09-08T11:48:48.000Z",
          "Titre": "Poor customer services",
          "Contenu": "We got a faulty camera. I never see that as a problem, it is how the company deals with it that matters. They don't do refunds only exchanges which is unusual these days. There tech support was ok in sorting the fault (hence the extra star!), and agreed a replacement. The replacement that they sent was unboxed so was not an off the shelf new camera. I raised this with them and asked for an explanation. Despite emailing them three times over a three week period I did not get any response from them at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JOHN STEPHENSON",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T11:25:25.000Z",
          "Titre": "I received my new unit",
          "Contenu": "I received my new unit, hooked up everything and when I plugged in the power supply, no power. Tried several other outlets on surge protector, then tried a different wall outlet, still nothing. Looked around house for another power supply with same power specs and found one. Tried it and I had power. Notified you regarding the issue. Over a week later, no response, now it's been several days since the second request and instead of a response to my issue, I receive a Rate your experience. I would have given you a five if I would have received a reply and a power supply already. But still have a new unit I can't use. Your Customer Service needs work."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Marco",
          "Nb_Reviews": 9,
          "Date": "2023-09-28T10:22:54.000Z",
          "Titre": "Swann NVR setup and support",
          "Contenu": "Pre-sales is only conducted via email once a 'chat case' is opened... the equipment is wifi capable, however the adapter is not sold in the UK... I managed to import one but it doesn't work over 5G... system works if hard wired to the router... also seems ok using ethernet to powerline adapter... the responsiveness of email answer can range from once a day to every 4 days... they have now offered to call me... the equipment seems to be decent. The UI on the HDD, HomeView (Windows) and iOS app are clunky, don't seem to synchronise / complement each other and requires trial and error and youtube videos to guide you... a very stressful time with very poor support... not what you would expect from a leading company... equipment fair, support and ease of set up lacking... also note that the equipment and cameras have a watermark... HiSilicon... this can be removed in the UI on the HDD... be prepared to have to work it all out yourself..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brian  Jobe",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T22:26:05.000Z",
          "Titre": "When you by a kit and it said it's a…",
          "Contenu": "When you by a kit and it said it's a 100 ft coaxial. And you need a adapter to put them together and I called you guys and I can a pack of them the blue ones then tell me to go to lowe's to see if I can get the other one (red one) and have a problem hooking it up to my android phone"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Chris",
          "Nb_Reviews": 9,
          "Date": "2023-06-17T20:53:18.000Z",
          "Titre": "Not worth the money",
          "Contenu": "1 week of running 4X HD4k cameras. Quality on the monitor/phone is pretty poor for 4k.Cameras dont like sun hitting them at 90 degrees and puts them into a very dark mode.Night view is actually very good until you put the light on and then it is (s...) very poor. Motion detection is VERY hit and miss. From,in day mode, not picking up a full blown adult  to falsely recording a couple of  bushes moving. Night mode is set off by spiders,moths,owls and bats. Disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2023-01-29T02:41:51.000Z",
          "Titre": "Adjusting device settings seems to have a delayed effect",
          "Contenu": "Device had issues at 1st being able to set up the motion detection mask.  Once I was able to set up the motion detection mask it still seemed like it was alerting in the areas i told it to ignore.  Once it finally did start functioning properly the device is repeatedly tripped by shadows that are moving on the ground within the vicinity of the camera. What claims to be a 6 Mon the battery ends up lasting about a week. Over 200 plus notifications from moving shadows in 2 days alone with motion set to close"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TaJuana Williams",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T07:52:18.000Z",
          "Titre": "Unwanted viewers/users",
          "Contenu": "Wish I could figure out how to remove the person or persons that have hacked my system and then I would love this system. The fact that anyone within 50 can search for a device and link up to it with a password is ridiculous. The safety of me, my wife, children, and animals are at risk daily. I have called and nothing has been done about it. My system is still being used by an unknown user within 50/80 ft radius. I have made serious considera to switch this year. It’s unfortunate because I own eight Swann cameras. I should feel safe and I don’t. Is there a resolution? I’m not sure other than switching providers."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Austen Kirby",
          "Nb_Reviews": 6,
          "Date": "2023-06-23T20:42:16.000Z",
          "Titre": "Had 2 Swann systems now and also…",
          "Contenu": "Had 2 Swann systems now and also install them for customers. I would say the support is rubbish in the UK. Just encountered another issue today where they have updated the swannview app, Now it doesn't rotate on multiscreen mod, so now I have to tilt my head 🙃. Will not buy another or install it for others. Shame as they system can be very good."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Terry Adams",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T02:51:22.000Z",
          "Titre": "The camera had no video playback",
          "Contenu": "The camera had no video playback. The other functions worked well. After multiple attempts to contact customer service by phone and a recorded message they would call back in 10 minutes, I never received a call. I sent an email to customer service and after two days they got back to me.Too late camera returned to Lowes for full credit."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Markystarburst",
          "Nb_Reviews": 5,
          "Date": "2022-12-20T19:54:25.000Z",
          "Titre": "Poor battery life",
          "Contenu": "I bought a Swann Xtreem wireless security camera to use in my back garden. The idea of going wireless was to make it easier and the Swann camera was attractive in that it had a long battery life. I wish I'd had a camera hardwired in now. Battery life is roughly 10 to 14 days even with hardly ant motion triggers and linking back onto wi-fi and the app after charging is a nightmare, sometimes taking an hour or two of faffing on. On the plus side, the picture quality is excellent even in the dark. Overall, pay for someone to hardwire a camera in for you, it'll be far less frustrating."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Rodger O'Toole",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T02:06:20.000Z",
          "Titre": "Poor wifi reception…",
          "Contenu": "Brought these security cameras to replace the cheaper non Swann ones that all bar 1 camera stopped working. What a mistake, should have just upgraded to newer version of the old 1s that i had. Old cameras were always getting 60-80% wifi and the wifi never dropped out, these Swann ones get 1- 20% at the max and are installed in excatly the same places but are constantly dropping out. I get great wifi around the house but these cameras just wont pick it up. Will not buy again or reccomended these cameras for the above reasons."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "A Jones",
          "Nb_Reviews": 22,
          "Date": "2023-06-13T10:59:06.000Z",
          "Titre": "One camera out of 4 has failed so asked…",
          "Contenu": "One camera out of 4 has failed so asked advice on a replacement. Advised camera is not compatible with my NVR system, waste of money on bad advice. System appears not to be flexible. I have 5MP system, 4K camera doesn't talk to my current NVR system."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ivan Ritchie",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T04:06:22.000Z",
          "Titre": "No customer service. Don’t buy Swann",
          "Contenu": "Purchased a replacement dvr online from swann. Was not compatible with my existing system because mine had bnc connectors and it had another style. Absolutely no way to talk to a human being about the return. none of the phone numbers on your site or on the papers that came with it could get through to a human being. When I figured out how to request a return online I had to have an active case number with tech support. Obviously this unit would not work. When I finally got through to tech support I had to argue/plead with the guy to give me a case number.  He kept telling me I was not talking to the right place. I kept asking how to talk to anyone else. He finally gave me a case number. So I finally could complete a request for a return.  Then I waited two days for the return authorization number. Finally sent it back and now waiting for the refund.   Will I buy Swann again? No"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "pawel gdula",
          "Nb_Reviews": 2,
          "Date": "2023-05-05T04:48:14.000Z",
          "Titre": "Hello",
          "Contenu": "Hello. I have bought the Swann security system and to be honest im dissapointent now. Had the old version of Swann cameras and they last for 8 years so i decide to upgrade for 4K resolution new set with build in lights and mic. After 3 weeks one of the camera lost the LED light, i report this to Swann and takes 2 weeks to get this replaced. 2 weeks later another camera lost LED lights as well. We see what Swann will have to say about that one now."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jose Perez",
          "Nb_Reviews": 2,
          "Date": "2023-07-14T18:50:56.000Z",
          "Titre": "I don’t have a problem with a company buuuttt…",
          "Contenu": "I don’t have a problem with a company restricting their products to outside companies. As an owner I wouldn’t want to grant access to my devices outside of my network or products. However, when I upgraded my DVR from an 8 channel to a 16 channel, I had to buy new cameras that were compatible with my new Swann DVR. The cameras were the same BNC connection as the old ones but would not work on the new DVR. The Swann cameras should also allow you to edit the motion zones to cut down on some alerts. My cameras that are in front oversee some traffic driving by and send an alert to my phone. My front property is not far enough away to not see the street traffic. I have checked and there is no edit zone for motion activity."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John colon",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T05:27:09.000Z",
          "Titre": "Well",
          "Contenu": "Well, I read lot of review fromCustomer that have issue with  security camara. Respond from swann to Customer nice greeting thenWent Customer start writing What going With camara.Customer service well weWith recommend to talk toOur tech support.why Customer service answeringQuestion that their don't know about technology gadgets and not qualified To anwer question.put someone from the beginning Like tech support people whoWhat are their talking aboutFrom the beginning. A readLot of reviews and I wasn't toInpress. I even read thisReviews I Took a change Ibought a camara from swannAnd planning to buy moreCamara and box 16channel3t.b.hard drive. In near future.In my opinion some enployNeed to get re-train by a person  who is qualified techOn security systems and camara for tech support onCamara& computer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kenneth  Carter",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T20:50:47.000Z",
          "Titre": "It would be nice to have a phone number…",
          "Contenu": "It would be nice to have a phone number to talk to someone about a problem and if they could speak good English.Just got your reply, thank you."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "R Hawker",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T21:24:06.000Z",
          "Titre": "Disappointing",
          "Contenu": "The product is disappointing and does not work as reliably as I would expect. Unfortunately having opened the outer box I have been refused a refund. I would not recommend this product and would not consider buying again from Swann."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CJ",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T02:31:44.000Z",
          "Titre": "I purchased a refurbished unit from…",
          "Contenu": "I purchased a refurbished unit from you.  It took me 4 phone calls and several days to get this unit disconnected from the previous owner.  I wasn’t able to connect to my phone until then.   Customer service was not helpful and kept promising to call back and did not."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Martin  Ward",
          "Nb_Reviews": 14,
          "Date": "2023-01-26T09:13:07.000Z",
          "Titre": "No replacements available.",
          "Contenu": "Our original NVR box failed so I purchased another 8 channel device which I then found was incompatible with the existing cameras and there was no other machine available that would be compatible so I then had to buy 8 new cameras as well to use with the new NVR. In total this has cost the best part of £1500.00 for me to self install so no labour costs. After installing the new cameras which seemed to be working ok o the Saturday coming into the office on the Monday they had condensates behind the lens cover so were either fogged up or or as you are looking through mist. it is now Thursday and 4 of the eight still have not cleared. One still completely affected and not showing anything other than water droplets. Not too impressed so far."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gerald Fernholz",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T02:44:46.000Z",
          "Titre": "The application for the smart device…",
          "Contenu": "The application for the smart device does not work correctly. In the playback screen there is a large portion at the top of the screen that is blacked out. Once you zoom in on an object it moves out of view and you are unable to move the screen back to see what it is you wanted to see. When using live view in high definition the app has a problem streaming in real time and most of the time there is a 4 to 6 second delay. I have updated my firmware on my Swann device and I have no problems streaming videos on my smart device."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Martin Edmonds",
          "Nb_Reviews": 5,
          "Date": "2023-08-09T09:26:59.000Z",
          "Titre": "NVR8-8780 Poor service life",
          "Contenu": "Had to buy a replacement NVR8-8780 camera system controller after original unit failed - original unit lasted only 2 years almost to the day. Camera’s have now also started to loose function."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "YOSRY RASHWAN",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T03:02:16.000Z",
          "Titre": "Good camera",
          "Contenu": "Good camera, easy to setup, speaker no loud , siren & speaker, useless, , picture quality not bad, but you can’t read license plate number if they are just 5 feet  away from camera"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Reinhardt lilley",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T02:39:43.000Z",
          "Titre": "Instructions are not very clear how to…",
          "Contenu": "Instructions are not very clear how to set this thing up."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "MR. RICHARD  CLIFFORD",
          "Nb_Reviews": 33,
          "Date": "2023-08-29T17:15:34.000Z",
          "Titre": "Does not seem to detect movement…",
          "Contenu": "Does not seem to detect movement consistently. Camera is located in place by a magnet so could be removed easily"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Susan Pungitore",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T15:08:49.000Z",
          "Titre": "Spotlights go off and on all night when…",
          "Contenu": "Spotlights go off and on all night when weather is cold.   Seems like ice or water gets inside. Tried adjusting but still happens.  This is the second spotlight with camera that we have bought from swan.  We have another one around the house that works fine."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 10,
          "Date": "2023-07-26T06:40:30.000Z",
          "Titre": "Gutted has one of the two wires,I…",
          "Contenu": "Gutted has one of the two wires,I ordered was snapped when I tuck it out the box I found it hard to contact someone regarding this so just give in"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Jan",
          "Nb_Reviews": 6,
          "Date": "2023-03-28T13:25:45.000Z",
          "Titre": "Nothing but trouble since I purchased…",
          "Contenu": "Nothing but trouble since I purchased these wireless cameras.The customer support cannot help me.I keep doing everything I’ve been asked. Re paired many times overI’m over it.Now I see that Swann wants to be paidThat says it all.Very disappointed and will not recommend them at all."
        },
        {
          "Note": 2,
          "Lieu": "BB",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T03:05:32.000Z",
          "Titre": "Better playback of footage",
          "Contenu": "My only problem with the app is that it is very inconsistent in saving playback footage. It skips way too much, even over a days worth of footage. Please find a way to improve this issue"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "I Jones",
          "Nb_Reviews": 5,
          "Date": "2023-07-21T23:45:24.000Z",
          "Titre": "Poor support.Does not last.",
          "Contenu": "Bought a CCTV system a few years ago, needed new cameras and now the hard drive has gone, spend a little more and get a better system.👍🏼Spend a good amount of money but still failed.😔"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Rory",
          "Nb_Reviews": 4,
          "Date": "2023-01-05T10:16:08.000Z",
          "Titre": "INTCAM No Longer Supported and No Replacement.",
          "Contenu": "I bought an INTCAM in October 21 and just been sent a message stating that camera will no longer work. It wont charge or connect to the Swann. They have offered a healthy 60% discount on a replacement but have limited me to what I can buy. Pushing me to the higher value models. I did pay very little for the camera last year but would expect it to last for longer than 12 months. No answer to emails as yet. Swann, you need to replace this for me please.Update to the rseponse from Swann. 05/01/23After your kind response, I contacte the tech team who cannot help and says to contact customer support. Those email seem to fly off into the ether and I do not get a response. If I provide my home address, could you please send a replacement as this is silly. 12 Months of use is not acceptable."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "chris day",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T10:42:52.000Z",
          "Titre": "Let down by operating system",
          "Contenu": "Bought 2 new Wi-Fi cameras to replace 4 year old ones hoping a newer version would be more reliable. I was wrong, the cameras themselves are good quality and picture it’s the operating system that lets it down. Cameras constantly disconnect and have to be reset. Detection is random when connected , had to turn notifications off as camera was activating every five minutes with nothing in view."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Brace",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T22:22:57.000Z",
          "Titre": "It is hard to get customer support and…",
          "Contenu": "It is hard to get customer support and my experience is that this system has not been user friendly"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matt Haskins",
          "Nb_Reviews": 1,
          "Date": "2022-12-18T05:56:55.000Z",
          "Titre": "I have had issues with My system ever…",
          "Contenu": "I have had issues with My system ever since I bought it 2 years ago.  Customer support doesn't exist.  Cannot get these cameras to stay connected and it is not my wifi."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Brendan Greaves",
          "Nb_Reviews": 7,
          "Date": "2022-12-27T17:07:03.000Z",
          "Titre": "It’s Expensive to keep replacing parts that should last much longer.",
          "Contenu": "I have three Swann systems. Each one I thought was good at the time of purchase but then problems occurred on one system and a new one had to be purchased.  Then More problems occurred and new ones had to be purchased. And so on. If I didn’t use the Swann app for three systems I’d have changed brand. Unfortunately I keep having to buy Swann so they all work on the same app. Otherwise I’d have to buy three sets from a whole new company. I’d say their Quality has deteriorated badly since my first purchase. Yet here I am still having to buy their products so it’s all on one app."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Diego",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T02:38:39.000Z",
          "Titre": "My cameras are slowly not working…",
          "Contenu": "My cameras are slowly not working properly after 2 years. It has been professionally installed and setup. I have already replaced 2 cameras."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JARED SOUTHERLAND",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T02:30:48.000Z",
          "Titre": "Unit won’t power up, just over 2 years old",
          "Contenu": "Unit completely dead, just over 2 years old.   Did not last very long before NVR had to be completely replaced."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mr Sumner",
          "Nb_Reviews": 11,
          "Date": "2023-10-02T13:48:48.000Z",
          "Titre": "Disappointed",
          "Contenu": "Bought my cameras because my recorder stopped working but was disappointed that the new ones to not have mask or  any means to reduce the motion detection"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jesus Hernandez",
          "Nb_Reviews": 1,
          "Date": "2023-02-25T03:02:49.000Z",
          "Titre": "I didn't receive my surveillance…",
          "Contenu": "I didn't receive my surveillance cameras with dvr 2T .Please reimburse me.Customer service is terrible!I need my money back please"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Customer of royal mail business",
          "Nb_Reviews": 18,
          "Date": "2023-02-04T17:55:12.000Z",
          "Titre": "not very clear instructions with…",
          "Contenu": "not very clear instructions with regards to changing default format, have to go to youtube from past customers to find things out"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "RamaIyengar Nagesh",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T05:29:04.000Z",
          "Titre": "It doesn't capture the activity and…",
          "Contenu": "It doesn't capture the activity and show. It shows gor 10 seconds only. I am not gaining any advantage after installing it. It is every day issue not one day."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ricky Skaggs",
          "Nb_Reviews": 2,
          "Date": "2023-10-19T04:56:36.000Z",
          "Titre": "No money will this company give out.!!",
          "Contenu": "Hello. If your company says it’s going to give you 25 off then you should get it. Spen over $700.00 and nope not one cent did I get. Then after my order the next day make an order and get 20 off. What a joke.!!!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Stewart In Milngavie",
          "Nb_Reviews": 5,
          "Date": "2023-07-01T08:27:33.000Z",
          "Titre": "Little help is as good as no help. Still can get the email side sorted out…",
          "Contenu": "Still can get the email side sorted out the technical help too quick to state just do this and that and we will send a link but it won’t work. Wouldn’t buy Swann again"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "rxdogs",
          "Nb_Reviews": 5,
          "Date": "2023-12-08T13:59:46.000Z",
          "Titre": "I have to reset a few times a year 🫤"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 2,
          "Date": "2023-05-10T04:46:35.000Z",
          "Titre": "What happened to your customer service ?",
          "Contenu": "I’ve been a 20 year swann customer, in the past 5 years, customer service has went to $&@/. I had 2 wireless cameras that for some reason swann decided to drop and totally disconnect and discontinued. My 2 were working fine until swann cut them out of their system.  Can’t remember exactly how long I had had them but less than 2 years and swann offered me 60% off for 1 replacement camera, again I had 2, so I’m supposed to get a discount to spend more money to replace. Next I broke my WiFi antenna and needed to replace it, I was told I could get 40% off other products, the antenna was $35 tax shipping all that bs, so I was going to get what $6 off. I personally think that my 2 cameras that were working were worth more than $6 ! So I didn’t bother using my discount code, but I did call and ask hey, since I spent couple hundred bucks on cameras that swann discounted, why could swann not just send me a new WiFi antenna and I would be just fine with that, “free of charge to me” $200 from me swann couldn’t try to make me happy by sending me a $35 antenna. Yeah you could say that NO IM STILL NOT HAPPY ABOUT IT !! I’ve set up my father’s house with swann, couple of friends houses, and 3 systems of my own over the years, but now I won’t be buying anything swann! When I decide to upgrade again which by the way is sometime this summer, it won’t have swann written on it anywhere. I don’t know what happened with swann but you used to have some damn great people there, now you’re a greedy company that could care less about your customers. Thank you for sending me this review form so I could let all of your colleagues know how I felt"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Susan Bounds",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T12:22:09.000Z",
          "Titre": "Playback Videos Won’t Load",
          "Contenu": "Less than 50% of the videos will play back through the app. It’s very frustrating.We have tried all kinds of troubleshooting, but nothing fixes the issue."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shane Allen",
          "Nb_Reviews": 1,
          "Date": "2023-05-14T11:49:44.000Z",
          "Titre": "I can't log my second device to my DVR …",
          "Contenu": "I can't log my second device to my DVR  I was removed from my account with swann and it won't let me do nothing"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "M",
          "Nb_Reviews": 6,
          "Date": "2023-03-07T10:18:27.000Z",
          "Titre": "Aftersales warranty support (if your…",
          "Contenu": "Aftersales warranty support (if your unfortunate enough to receive a faulty unit) is absolutely atrocious). 1884348 noisy fluttering fan / processor straight out of box"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mr Woodhouse",
          "Nb_Reviews": 4,
          "Date": "2023-09-10T10:09:14.000Z",
          "Titre": "Well unit and cameras very good but…",
          "Contenu": "Well unit and cameras very good but after sales service not all I wanted was a adaptor for the plug on usb connection for tilt and turn camera and said would send one then get a email saying the unit is faulty and needs to be returned which is load of rubbish as now got it working with one of my usb leads ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Zach",
          "Nb_Reviews": 2,
          "Date": "2023-06-27T02:27:38.000Z",
          "Titre": "Overall will not purchase again",
          "Contenu": "App sucksCustomer service is nice and try to help.Doesn’t help with resetting a DVR so I have to spend $270 to replace it"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Tracey Silk",
          "Nb_Reviews": 2,
          "Date": "2023-07-28T10:00:53.000Z",
          "Titre": "the process of having to link my…",
          "Contenu": "the process of having to link my personal phone details was not very helpful"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jay Quintero",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T05:49:55.000Z",
          "Titre": "Not happy with product",
          "Contenu": "The recording is very hit and a lot of miss and the time is always wrong even after I reset it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Josef Tovar",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T03:05:59.000Z",
          "Titre": "The night vision part on camera doesn't…",
          "Contenu": "The night vision part on camera doesn't work as good as my older cameras."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Giovanni Solano",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T13:53:30.000Z",
          "Titre": "One camera works the second does not 50% quality.",
          "Contenu": "I acquired two outdoors security cameras, one worked the the second did not, customer service was quick to assist, we are now waiting for the RMA to be approved, quality control on their products needs improvement."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Chris Brown",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T22:17:15.000Z",
          "Titre": "A better and more straightforward app…",
          "Contenu": "A better and more straightforward app -this app isn’t user friendly and should be a lot better to navigate and manipulate- will consider switching to another"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Donald Nicoline",
          "Nb_Reviews": 2,
          "Date": "2023-02-19T04:33:58.000Z",
          "Titre": "I purchased this system at menards",
          "Contenu": "I purchased this system at menards, and I am happy with the original system, BUT trying to get an additional camera through your web site has been a nightmare, Angie tried to help but I think someone in a higher position isn't doing their job, I've ordered 2 cameras you recommended, neither one is the same as my original, even after I gave you the model # of my camera. I would like a call from someone higher than your customer service, leave a message in case I don't know the number, hopefully I will hear from you within a week."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "cecilia demontesquiou",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T18:00:34.000Z",
          "Titre": "not received all the parts to install",
          "Contenu": "I still am waiting for the parts to install the system.  I guess I will have to return if they don't come.  You said you would send them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ronald Jay Smolow",
          "Nb_Reviews": 2,
          "Date": "2023-02-06T03:04:55.000Z",
          "Titre": "i cannot use swannview link to login to…",
          "Contenu": "i cannot use swannview link to login to my swann from my iphone. i get login failures. i wasted hours today :("
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-02-22T02:15:59.000Z",
          "Titre": "Customer support",
          "Contenu": "Continues to avert the issue I have with still no solution after 2-3 weeks"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Isobel Ajagbe",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T17:31:21.000Z",
          "Titre": "The cameras are decent quality and were…",
          "Contenu": "The cameras are decent quality and were easy to install. What let's the company down is their customer service. They've struggled to answer basic questions. The advice they gave me isn't suitable for the country I'm based in as they only sell certain add on products in certain regions. After a few emails with them, they failed to resolve my issue."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "hollya",
          "Nb_Reviews": 2,
          "Date": "2022-10-28T17:14:26.000Z",
          "Titre": "Good system UNTIL something…",
          "Contenu": "Good system UNTIL something malfunctions. My experience,  a camera malfunctions by internal fault, swann does NOT repair ANYTHING. be prepared to spend $250+ if anything goes wrong. They will ONLY replace IF under 1 year warranty. I've owned my 2 NVR systems for 2 years and have had to replace 4 cameras. Two systems later at $1600 and about $1000 dollars later in replacement cameras the system has got really expensive"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Rob Stone",
          "Nb_Reviews": 23,
          "Date": "2022-10-23T17:18:12.000Z",
          "Titre": "A Useless App",
          "Contenu": "I have had a Swann camera system for nearly 8 years using the Swannlink app with no problems all over the world. Had to replace the DVR now have to use the Swann security app, Waste of time !!! its fine in my house but outside even with a full G4 signal all you get is black screens. I have a reasonably good android phone but makes no difference. I thought Swann were one of the best, i would have sworn by them but not now. just give up"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cathy Zwiefelhofer",
          "Nb_Reviews": 2,
          "Date": "2022-12-20T02:48:31.000Z",
          "Titre": "I did not receive the price break that…",
          "Contenu": "I did not receive the price break that was promised in email and had some difficulty setting it up."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chrystal Smith",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T06:26:41.000Z",
          "Titre": "Always off-line",
          "Contenu": "Always off-line. The pictures are blurry and sometimes the video is too."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "DOUGLAS ALEXANDER",
          "Nb_Reviews": 4,
          "Date": "2023-03-20T09:13:41.000Z",
          "Titre": "Purchased a Wi-Fi camera doorbell and a…",
          "Contenu": "Purchased a Wi-Fi camera doorbell and a Wi-Fi camera, disappointed with both as they lose internet connection regularly despite being very close to hub."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mick Steele,",
          "Nb_Reviews": 3,
          "Date": "2022-10-12T08:33:16.000Z",
          "Titre": "Not as good as portrayed I bought this…",
          "Contenu": "Not as good as portrayed I bought this system to upgrade to a much  better system with the ability to see much more detail than my older swann system after installation I'm not impressed with the quality or clarity of the new system ie number plate recognition etc I don't feel it was worth the extreme time and  effort to change over to this system not blown away at all sound is noisy overall not impressed ."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "richard Morris",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T18:11:18.000Z",
          "Titre": "It seems to lag a lot"
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Paul Watts",
          "Nb_Reviews": 1,
          "Date": "2022-10-09T21:39:08.000Z",
          "Titre": "I would never buy Swann again",
          "Contenu": "I would never buy Swann again. Before the camera starts recording you have to be standing directly infront of the camera. If you walk past it it clicks on after you have gone past and records nothing. I have spent hours changing the settings and makes no difference. My $80 security lights click on 10 meters away. Also the cameras regularly go off line. Waste of money."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "kid awesom123",
          "Nb_Reviews": 5,
          "Date": "2023-05-22T22:22:43.000Z",
          "Titre": "Movement is very slow when camera…",
          "Contenu": "Movement is very slow when camera engaged"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Bartek Kawalec",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T22:24:08.000Z",
          "Titre": "View by camera is very poor",
          "Contenu": "View by camera is very poor. 1 camera does not work. Problem with swann app."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shannon Mitchell",
          "Nb_Reviews": 2,
          "Date": "2022-09-21T16:53:19.000Z",
          "Titre": "I bought the 16 camera DVR set up",
          "Contenu": "I bought the 16 camera DVR set up.  I drilled holes all over my house to install cameras,  climbed in the attic to run all the wiring. It worked great for about 2 -3 years then completely died. Now I'm stuck with a bunch of holes and useless cameras.  :( haha now they are saying it wasn't installed right. When I called they said it needed it needed an updated version.  Priceless! Run folks or buy a cheap one."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jacqueline Swannick",
          "Nb_Reviews": 1,
          "Date": "2023-01-22T00:24:09.000Z",
          "Titre": "Does not work with Alexa",
          "Contenu": "Does not work with Alexa. It connected once and that was it. Also, no off switch"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Don",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T23:02:19.000Z",
          "Titre": "Can’t get one camera to go online for…",
          "Contenu": "Can’t get one camera to go online for play back"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T07:22:08.000Z",
          "Titre": "The videos don’t save and it takes so…",
          "Contenu": "The videos don’t save and it takes so long if not even doesn’t load at all"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Sean Beardmore",
          "Nb_Reviews": 5,
          "Date": "2023-02-25T18:18:39.000Z",
          "Titre": "Brought and installed a four camera…",
          "Contenu": "Brought and installed a four camera system which worked fine for about three months then the flood lights on the two front cameras stopped working got in touch with customer services who I gave remote access to they could not resolve the problem so they asked for pictures of the back of hardrive and camera positions which I supplied wait and nothing so got in touch again and they asked for same items again this happened three times then they stopped replying to my emails a number of times this was reported may last year and still waiting, customer service is a waste of time and camera quality is poor at the best of times a waste of 350 quid there's other systems out there that are much better will never buy anything swann related again and make sure everybody I know doesn't either"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2022-09-12T01:11:57.000Z",
          "Titre": "Hopeful But not!",
          "Contenu": "Swan,When the items work, they are ok. but Support. Yep its now September and I'm still waiting on assistance to fix issues I logged in March. The Line \" As we currently don't have a fix so we are closing your ticket\"    does not cut it!Disappointed.!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "josie barber",
          "Nb_Reviews": 3,
          "Date": "2023-04-17T21:31:47.000Z",
          "Titre": "Still waiting for refund !!!",
          "Contenu": "Still waiting for refund !!!! Equip has been sent back 2 weeks ago"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "MINIBUS SAFETY CONSULTANTS",
          "Nb_Reviews": 19,
          "Date": "2022-10-31T17:02:18.000Z",
          "Titre": "lousy documentation",
          "Contenu": "lousy documentation.  only online  manual which was impossible to print out in a font large enough to read  How easy to include it n the box.Releasing camera from holder was disgraceful. With no manual no indication how hard one had to push the button down to release ( it was actually really quite hard so worried about breaking it).The chat line was just as ridiculous unless you asked a question they had highlightedVery poor and when I did get thru on the phone the agent did not have a clueHaving received your reply I am even more disgusted. You claim to reduce paper waste by not including a tiny installation doc but you send out dozens of basis papers in different languages - ?discrimination?. AND your packaging was way over the top and you could save thousands by not double and triple packing items.    Your agents were not very good but then you probably pay them peanuts  I shall be interested to see if you send me a non computer generated reply - the chat line was clearly computer generated and of a very low quality. just gave generic answers"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Piccha Junsree",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T02:44:41.000Z",
          "Titre": "One of the camera is broken doesn’t…",
          "Contenu": "One of the camera is broken doesn’t work at all"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Karen Portoglou",
          "Nb_Reviews": 1,
          "Date": "2022-08-07T09:28:37.000Z",
          "Titre": "Clear footage and Can view on your phone when it works",
          "Contenu": "Great that you can view cameras on your mobile phone anytime. Problem is only works occasionally on phone very frustrating when you get a notification of movement/activity  and then unable to view while out or at home but not next to hard drive. This is a continual problem, have even changed internet providers incase it was my internet connection but still the same hasn’t improved. Have tried to contact Swann but got nowhere"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Tim",
          "Nb_Reviews": 8,
          "Date": "2022-08-25T10:10:08.000Z",
          "Titre": "Slow and long winded returns process",
          "Contenu": "Update** Terrible Service!I called the number below (UK) spoke to someone in US who advised I need to call a different number in the UK (02036911158), this new number just goes to a voice mail - they don’t call back either. I have raised the inability of Swann to accept a return with my credit card company who will now follow up for me. God bless the protection of Credit Cards when it comes to rouge traders!Original: Slow and long winded returns process. Still not retuned items after a week of emails and questions, buy from Amazon."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Christopher",
          "Nb_Reviews": 4,
          "Date": "2023-09-27T09:08:27.000Z",
          "Titre": "The cameras don’t work reliably"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Kevin Pope",
          "Nb_Reviews": 11,
          "Date": "2022-09-25T22:28:50.000Z",
          "Titre": "Brought cctv system a week ago fitted…",
          "Contenu": "Brought cctv system a week ago fitted it works quite well but I require a wifi dongle so I can connect to the Internet as I cannot hard wire I was told that you can purchase a dongle part number swacc-usbwifi-gl which will work on the new cctv system I purchase part number srdvr-44680h by swann tech . And hear is the problem you can't purchase one in the UK.! Hopeless so now can't connect to wifi I ask if I can purchase one and you can send it to me but no they can't sell them in uk . So I just waste my money on a promise it will work on wifi which it will if they can sell me the wifi dongle but as they can't for some reason sell them in uk . I'm willing to pay for the dongle but they won't sell it . Not a happy customer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alan Thiewes",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T05:32:39.000Z",
          "Titre": "I have 2 cameras that won’t hook up…",
          "Contenu": "I have 2 cameras that won’t hook up after the new app update came out and I tried everything to get them hooked back up but can’t figure it out and I can’t get it to alert me on movement all the settings are on"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "D. MORRIS",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T03:45:43.000Z",
          "Titre": "Apps don’t work in Windows 10 PC laptop",
          "Contenu": "I’ve tried all the current apps to view m cameras on a windows 10 PC.  Not have not been able to make any app work in this PC.   I was able to view my old cameras using a sean app prior to this. Bits a bad user experience that forces me to use my camera when I would prefer to view my cameras via my laptop."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T16:25:32.000Z",
          "Titre": "Could have gone better",
          "Contenu": "Whilst not directly Swann's fault, delivery was a nightmare, with 5 claimed attempts to deliver by DHL, all being lies, so it took over a week to arrive. Then after several attempts by Swann's tech team, we could not resolve an issue of not being able to view Livefeed on my 3year old Samsung phone.  Unhappily, I had to purchase a new phone to resolve this issue, =despite Swann claiming all versions of software were compatible."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Bart",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T00:16:02.000Z",
          "Titre": "What I like about the cameras is that…the clarity is formidable.",
          "Contenu": "What I like about the cameras is that they are so clear and the storage is great.But there’s one camera that doesn’t work at night for some reason it is showing all black screen but during the day it’s fine the only thing I think of is the camera is too close to the corner of the house which it picks up in the screen so I was going to move it forward and see if it makes a difference."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "king ning",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:32:19.000Z",
          "Titre": "Outdoor camera need to reset  to check…",
          "Contenu": "Outdoor camera need to reset  to check live view every period of time ."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Lance Pawley",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T22:47:03.000Z",
          "Titre": "System runs fairly well - but not really as hoped for",
          "Contenu": "System runs fairly well, but often goes offline for a day or 2, then mysteriously bursts into life again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "W. McLean",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T18:03:24.000Z",
          "Titre": "Cameras work good",
          "Contenu": "Cameras work good. A bit of foggiest on one but the view is great. We have a lot of learning to do with all the configurations. One day we get hardly any views and the next we get over 20k on the playback."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "Neil Mohammed",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T12:00:56.000Z",
          "Titre": "Cameras offline",
          "Contenu": "The unit at times go offline and I have to reset the system"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Randy",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T14:53:16.000Z",
          "Titre": "I keep getting a log in box popping up…",
          "Contenu": "I keep getting a log in box popping up on the system and the time is always an hr behind I’ve tried to set time in the system but it just goes back to one hr behind. Can you fix this."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Waraporn Pakkatanang",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T08:44:42.000Z",
          "Titre": "I not sure is because internet not or…",
          "Contenu": "I not sure is because internet not or something wrong is so slow take to long to download when we want to check the camera is was so good before now not to good"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Steven Hill",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T09:15:16.000Z",
          "Titre": "Cameras seem slow to wake up and miss a…",
          "Contenu": "Cameras seem slow to wake up and miss a lot.When checking playback the event is all ready over before it can be captured"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Andrew V Morris",
          "Nb_Reviews": 3,
          "Date": "2023-12-09T22:36:47.000Z",
          "Titre": "In consistent",
          "Contenu": "In consistent . The customer support is poor and non technical. I knew more than them…"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MIKE",
          "Nb_Reviews": 3,
          "Date": "2023-10-18T16:05:35.000Z",
          "Titre": "i need to call but i dont see any way…",
          "Contenu": "i need to call but i dont see any way to make the camera sensitive to people not movement. so the flag blowing in the breeze sets it off every minute. also it keeps disconnecting and now i cant get it connectedi have called and good news bad news. for one thing i did not know this review went outside of swan. but swan was helpful in tyring to mitigate the 2 problems and i will work on suggestions to fix/mitigate the problems i'm having. 1 being a wifi extender and the other utilizing the mask feature"
        },
        {
          "Note": 3,
          "Lieu": "CY",
          "Pseudo": "nathan staniforth",
          "Nb_Reviews": 6,
          "Date": "2023-11-23T12:13:45.000Z",
          "Titre": "Ordered 2 cameras to complement our…",
          "Contenu": "Ordered 2 cameras to complement our existing system ,very easy to set up however 1 camera is permanently black and white ,ive filled out the contact sheet with swamn but heard nothing back been over a week"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Nicola Connor",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T07:05:58.000Z",
          "Titre": "It drops out all the time",
          "Contenu": "It drops out all the time and cameras have to be unplugged and plugged in again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DaninMCI",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T11:51:06.000Z",
          "Titre": "Wifi antenna and longer cables should be included",
          "Contenu": "Wifi should be included without additional purchase. The standard cable connection doesn't work with many routers (I found out the hard way) so this forced the purchase of USB antenna. The setup is a bit complicated for the average user. You can use it without a subscription but the phone app is limited. Camera cables should include longer wires. 60 feet is not nearly enough this forced an additional 3rd party purchase as the Swann local retailers don't sell the extension wires."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "VC saver",
          "Nb_Reviews": 17,
          "Date": "2023-04-14T13:34:24.000Z",
          "Titre": "Like that camera does not need to be…",
          "Contenu": "Like that camera does not need to be wired- just find a suitable spot and set up with available attachments.Dislike that the battery needs regular recharging.  It doesn’t last as long as advertised even when camera placed in areas where there is little or no motion. The above wasn’t the case when purchased some years ago and the update does little to improve function."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew Corson",
          "Nb_Reviews": 2,
          "Date": "2023-05-24T22:37:41.000Z",
          "Titre": "Getting service support",
          "Contenu": "Unit had issues after lightning strike (not Swann's problem).  However, trying to get anyone from Swann to help was worse than taxes.  Nothing I'd want to repeat.  I've looked over options and decided to buy a refurbished unit from Swann instead of the repair route.  Really dislike the online help system and the time required to get to a person and understand problem. However, in the end, I'm investing to keep the system operational.  It was killed by lightning strike and not Swann's fault.  That counts for something!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Dennis",
          "Nb_Reviews": 3,
          "Date": "2023-09-19T16:58:17.000Z",
          "Titre": "Not a user friendly camera",
          "Contenu": "Not being able to leave on for constant viewing. I know I would have to charge battery more often but at least give me the choice. The camera comes  on when triggered and the delay from waking up missed the first 10 sec of event. So slow to respond even though being close to the router and a internet speed of 75Mbps. I expected better from a Swann product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "michael perry",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T04:46:34.000Z",
          "Titre": "Disappointed …",
          "Contenu": "I purchased a four camera SwannSecurity system, but didn’t install it until after the warranty had expired, the recorder was defective. After numerous phone calls with Swann, I purchased a new recorder. The only reason that I’m not giving Swann one star is the last technician I spoke with was helpful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Thornton",
          "Nb_Reviews": 2,
          "Date": "2023-04-15T02:05:36.000Z",
          "Titre": "Love the camera quality BUT",
          "Contenu": "Love the camera quality. I do wish I could set recordings to specific events like people, vehicles animals. I get WAY too many recordings because of wind blowing landscaping. I don’t mind it recording it, but I have to go through hundreds to find those that matter."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Harold Sheehy",
          "Nb_Reviews": 2,
          "Date": "2023-02-17T21:33:33.000Z",
          "Titre": "NVR Replacement",
          "Contenu": "We like the products, but no operations manual was enclosed. We have no idea how to operate the units recorder / complete setup / software up dated from our the previous NVR unit. Our system works, but we only use it for observations. The “Quick Start” paperwork is marginal information at best. Not very easy to understand."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Andrew Idowu",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T01:01:33.000Z",
          "Titre": "Good  viewing on days but very poor on…",
          "Contenu": "Good  viewing on days but very poor on nights"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stuart",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T16:49:59.000Z",
          "Titre": "NVR, bad camera, wiring",
          "Contenu": "My NVR & 2 of the 4 cameras  is having problems right out of the book. Trouble shooting is straight forward and simple. Calling tech support was helpful until I requested 2 replacement cameras and cables. 3 weeks later, i have ordered new cables from Amazon. Bought a new pan tilt camera to replace 1 of the malfunctioning cameras. And still no solution from tech support."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Audrey Armijo",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T16:37:41.000Z",
          "Titre": "Info not great",
          "Contenu": "It doesn't have very easy instructions on what you actually pay for.  There's no details and it seems like im not getting anything different than if I didn't pay the monthly fee.  Customer service didn't help very much and I can't even get anybody on the line so I can return a PepsiCo I didn't need"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Dave Morris",
          "Nb_Reviews": 5,
          "Date": "2023-03-20T12:20:39.000Z",
          "Titre": "new doorbell startoff",
          "Contenu": "unhappy with Swann because my doorbell worked the ist day 2nd would not open up ,had about 3 phone calls to support said they was looking into it a week later message from swann to say system had gone down and was never noticed.so another week of me trying to get the doorbell going only after 2 weeks now did i get message to say fault was with swann doorbell was working again .still unable to connect with my Google Home Hub have ask for help  none coming .i realise swann are busy but so am i . not the best experience i would expect from swann"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Vandereedt",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T02:12:44.000Z",
          "Titre": "Live chat never live",
          "Contenu": "Live chat never live. Tech assistance was good once they called back.  Improve your customer service by being more responsive. Update your site to be user friendly to see compatibility of products."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "alec hutchison",
          "Nb_Reviews": 6,
          "Date": "2023-09-04T11:01:39.000Z",
          "Titre": "Easy to install but expected the…",
          "Contenu": "Easy to install but expected the enforcer system to have audio as per video.Found out after installation that this model does not have audio. Impossible to talk to customer service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Adrian",
          "Nb_Reviews": 3,
          "Date": "2022-12-28T01:32:09.000Z",
          "Titre": "I honestly thought that I bought the…",
          "Contenu": "I honestly thought that I bought the best of the best when I purchased swann. The camera doesn't catch every movement and recording even when someone or something is passing in clear view. Night vision is decent bur still doesn't get the 4K quality I need. I'm willing to spend on a higher quality if I need to but I just don't know what to look for when it comes to top tier."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dan L second time purchaser",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T12:57:12.000Z",
          "Titre": "After several hours of installation",
          "Contenu": "After several hours of installation, I replaced my wireless outcam with a cheap refurbished model only to find it disconnects every 3 minutes. It’s defective.  I have rebooted, reset, removed and reinstalled, all to no avail.  I wrote an email to Swann tech last week but received no response.   I tried again today and after many minutes of waiting on the chat, I gave up.  Finally, I got an email from “John” of tech support who seemed nice but the email process is painfully slow and I will have to figure out the problem myself or seek another vendor.Second note:  I called a live person who was very helpful and updated my camera software (v. 6.4.3 vs. 6.1.7) remotely and that solved the problem.  My suggestion is to speak to a support tech. initially."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Parish",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T00:43:15.000Z",
          "Titre": "Clarity of the picture .",
          "Contenu": "The clarity of the picture was great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Katherine Cassell",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T03:42:53.000Z",
          "Titre": "I loved the camera at first but…",
          "Contenu": "I loved the camera at first but connection became more and more difficult.. also the speaker sounds like a drive through speaker from the 70s. The speaker is basically useless unless you like sounding like a bee."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Peter Herriott",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T09:21:59.000Z",
          "Titre": "Relliability",
          "Contenu": "Ok sometimes"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mike",
          "Nb_Reviews": 18,
          "Date": "2023-02-26T11:08:08.000Z",
          "Titre": "The cameras are not easy to set up",
          "Contenu": "The cameras are not easy to set up, they don’t always recognise the router, you have to try several times, then suddenly the camera links to the router. I have fibre and very high speed. Plus the cameras are very close to the router, but it makes no difference. It took me 4 hours to set up 3 cameras. I gave up on the 4th!Why not allow the initial set up via the RJ45 cable first?I’m Looking for other suppliers now for the rest of the house."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Louis  Bond",
          "Nb_Reviews": 3,
          "Date": "2023-10-07T04:40:24.000Z",
          "Titre": "Why does my Swann Motion Sensor give…",
          "Contenu": "Why does my Swann Motion Sensor give false detections and notifications?Easy set up and use!"
        },
        {
          "Note": 3,
          "Lieu": "BB",
          "Pseudo": "Sonia Briceno",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T14:14:41.000Z",
          "Titre": "Recently receiving notifications when…",
          "Contenu": "Recently receiving notifications when opening the app for the first time on the day, saying that the app is not in sync with the phone's time.Also, all motion is not detected. E.g. there is a camera at the front of the property. On reviewing the recordings,  I can see when my husband returned, but not when he left. This is the only way to come and go."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dan Orr",
          "Nb_Reviews": 2,
          "Date": "2023-04-24T04:17:11.000Z",
          "Titre": "8 channel 4 camera NVR",
          "Contenu": "I purchased a Swann 8 channel 4 camera, hard-wired NVR system to monitor my property. The cameras come with 60 ft. wires. Seems long until you add the distance down the wall (mine are 9ft.), and the slack (3ft.?) you need to the NVR. I needed 100 foot wire$ to reach my far corner$. My house is really not that big. I made it work. POE cameras are fantastic...software...not so much. Very cumbersome. I needed to cover some blind spots so I added a couple of hard-wired refurbs, and some Solar WiFi's. PC/TV is my preference for viewing, but you cannot see the Swann WiFi cameras on PC/TV...only on phone (Android/iPhone) app! I can now see 8 Swann cameras from my phone and only 6 Swann cameras on my PC/TV. Meanwhile my phone app times out on a security cam!!! \"Unamused emoji\". So, yes, I would still recommend this system, but be prepared to invest more than you originally anticipated to get the hard-wired solution you imagined."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mesha",
          "Nb_Reviews": 2,
          "Date": "2023-03-06T23:54:05.000Z",
          "Titre": "Overall decent",
          "Contenu": "The quality isn't the best and that could be my internet. It doesn't pick up motion like I would like especially when I know there is motion. Overall it's a decent product, maybe a little pricy for the quality."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charlie Sanchez",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T18:30:18.000Z",
          "Titre": "absolutely horrible cameras and…",
          "Contenu": "cameras get water inside the lens when it rains and having to call and replace them is a pain to get ahold of someone! update: I got my replacement cameras a lot faster than i thought."
        },
        {
          "Note": 3,
          "Lieu": "JM",
          "Pseudo": "Aleabra Brands",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T07:04:26.000Z",
          "Titre": "Playback filter selection dont work…",
          "Contenu": "Unable to filter amd select only the feed i want to view during playback. It always return with all camera feeds even when only one camera selected."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Raymond",
          "Nb_Reviews": 2,
          "Date": "2023-07-25T16:08:00.000Z",
          "Titre": "Getting in touch with Swann through…",
          "Contenu": "Getting in touch with Swann through email or phone proved to be difficult and time consuming. It is enough for me not to do business with Swann anymore."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Christopher Kay",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T10:11:11.000Z",
          "Titre": "One of the cameras not working.",
          "Contenu": "One of the cameras not working.Have contacted Swann tech support with no reply so far in the last 4 days."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Phil Little Gillies",
          "Nb_Reviews": 4,
          "Date": "2023-01-26T18:59:15.000Z",
          "Titre": "Pretty easy to set up",
          "Contenu": "Pretty easy to set up, camera quality good, battery life poor, maybe it me checking to see if they are working. I’m going to let it do it’s own thing to see how long they last"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "ANNETTE WAKERLEY",
          "Nb_Reviews": 9,
          "Date": "2023-08-31T07:30:52.000Z",
          "Titre": "Good service on technical issue but bad…",
          "Contenu": "Good service on technical issue but bad service on sales. it was us that pointed out wrong hard drive format."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christopher Cranor",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T14:26:43.000Z",
          "Titre": "We were unable to link our phones and…",
          "Contenu": "We were unable to link our phones and when we called the help line we were told the system was already linked so we had to email proof of purchase and device info. This didn't get resolved for a few days.   We are happy with the product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2023-05-28T16:49:59.000Z",
          "Titre": "The items were hard to set up and get…",
          "Contenu": "The items were hard to set up and get on the paring part. Shipping was a mess and slow.  Not knowing where the items were most of the time. They work fairly well but will pick up at distances further than they 13 feet suggested. There for don't place where cars are going down the road.  They are hard to adjust so far as the two places that allow you to go up or down or side ways."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Casey",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T11:14:53.000Z",
          "Titre": "The software is unpredictably unstable…",
          "Contenu": "The software is unpredictably unstable and the recording take a long time to change from black and white to colour. Even so when it's working I like it."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Stacey Lloyd",
          "Nb_Reviews": 1,
          "Date": "2022-11-25T02:13:26.000Z",
          "Titre": "Love it when it works",
          "Contenu": "Love it when it works and sends me notifications but tends to shut down after a few hours and I have to open the app to start it getting notifications agains but works great other than that"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Les Jay",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T00:51:47.000Z",
          "Titre": "Battery runs down quicker than I…",
          "Contenu": "Battery runs down quicker than I expected.Does not turn off to charge upNo updates Screw does not fasten into the unit at bottom, not a very good way of securement"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Aaron Pakalniskis",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T05:40:47.000Z",
          "Titre": "Clear video",
          "Contenu": "Clear video, but no sound, had to purchase seperate microphones. And sometimes the playback doesn’t work without rebooting the app. But for the price it is worth the money"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Thos",
          "Nb_Reviews": 18,
          "Date": "2022-11-21T18:23:28.000Z",
          "Titre": "Slow and Painful",
          "Contenu": "Your support systems are slow and painful to use.It takes too long between interactions, and when speaking to your agents, there are always misunderstands because English is not their native language!We are talking about  $30 camera, it’s cost you more in agent time, and my inconvenience!!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Rob Daniels",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T09:02:42.000Z",
          "Titre": "Lack of control of field view area and…",
          "Contenu": "Lack of control of field view area and sensitivity is a real problem for me. I wouldn't have bought them if I knew this would be an issue."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Millie",
          "Nb_Reviews": 2,
          "Date": "2023-05-20T07:33:06.000Z",
          "Titre": "It doesn’t always capture movement",
          "Contenu": "It doesn’t always capture movement. The light and talk speaker features seem to play up which really annoys me but it does catch most movement. It’s a bit glitchy though."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Ian Alsop",
          "Nb_Reviews": 4,
          "Date": "2023-03-16T09:33:35.000Z",
          "Titre": "Fist impressions",
          "Contenu": "System easy to install, cameras very good, hard drive keeps loosing connection. Might be a simple fix though"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe Rush",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T11:54:24.000Z",
          "Titre": "It said on the video that these cameras…",
          "Contenu": "It said on the video that these cameras would charge up to 3/4 months I’m only getting 3/4 days on a full charge.they are no better than the other cameras I had"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Trista Richards",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T18:21:15.000Z",
          "Titre": "Swann cameras don’t pick up everything",
          "Contenu": "Swann cameras don’t pick up everything. It’s been a bunch of time I couldn’t go back and check replays. My car was damaged and the camera didn’t pick that up as well. Really thinking of changing cameras"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cinthya Avelino",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T22:31:16.000Z",
          "Titre": "I don’t like that my camera at firts…",
          "Contenu": "I don’t like that my camera at firts tej recording video alerts were faster and then started to record ama alerts to slow I pay 9.99 at month and it’s too slow"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Clevett Hanson",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T07:51:40.000Z",
          "Titre": "Not too good for some reason my camera…",
          "Contenu": "Not too good for some reason my camera offline stuck since March 11 get so tired of rebooting it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Doug",
          "Nb_Reviews": 4,
          "Date": "2022-12-30T04:51:32.000Z",
          "Titre": "Multiple DVRs are bad.",
          "Contenu": "In less than two years, I am on my third DVR (Model # SWNVK-88580H.)  The first time the DVR broke, dealing with Swann tech support, it took me two weeks to get a warranty replacement.The second time the DVR broke, it was out of warranty.  I had to buy the third DVR.  The third DVR arrived in one day.  That is an improvement but three DVRs in less than two years is still bad."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "CIPRIANO CECARO",
          "Nb_Reviews": 2,
          "Date": "2023-08-17T09:27:54.000Z",
          "Titre": "Like the camera",
          "Contenu": "Like the camera, but the range of the connection to my router not so great & very slow when opening the app"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "David Luigi Fuschi",
          "Nb_Reviews": 11,
          "Date": "2023-07-30T16:56:54.000Z",
          "Titre": "Compatibility issues after delivery issues",
          "Contenu": "I needed to fix a specific delivery date and time due to the distance between my workplace and my house, but neither proved possible and I had to wait 2 weeks to receiving the equipment. As I am replacing an older system that has experienced a complete HD failure, I only purchased the CCTV recorder and not the cameras, as these are already installed; however, it looks like they are incompatible as they do not work once connected to the new recorder. I will try again to contact the support team for further assistance, but I may be forced to return the CCTV and get another one or get new cameras and dispose of the previous ones."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jandra Carter",
          "Nb_Reviews": 2,
          "Date": "2023-03-09T04:20:40.000Z",
          "Titre": "We are basically happy with the system",
          "Contenu": "We are basically happy with the system, however the box says the system is expandable to eight cameras but your customer service representative said they don't make additional cameras for the system. The representative also sent us two cameras that she said were compatible to the system we own but they were not.  We had to return but don't have the credit on our credit card yet.  I also had to make multiple calls, with the automatic system hanging up on my several times.  One representative was supposed to order cameras she said were compatible but never sent the email with the order.  To sum it up, I had multiple problems and have given up on getting additional cameras.  On a good note, the cameras have a great picture."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Ramon  Morfin",
          "Nb_Reviews": 2,
          "Date": "2023-05-22T18:22:31.000Z",
          "Titre": "They stared charging for some services…",
          "Contenu": "They stared charging for some services and some times the system loses signal or it records too late"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 2,
          "Date": "2023-07-10T21:29:05.000Z",
          "Titre": "SwannLink Setup  credit card needed - won't take my name  Richard DeWolfe Coe",
          "Contenu": "Unable to connect camera to Netgear Router R7350 after 3 hours andSwannLink Setup  credit card needed - won't take my name /"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Brad Samuel",
          "Nb_Reviews": 11,
          "Date": "2023-05-12T03:15:53.000Z",
          "Titre": "Had one camera firmware failed after 2…",
          "Contenu": "Had one camera firmware failed after 2 years and could not fix it. The others are good cameras and easy to install and use."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carlos Rivera",
          "Nb_Reviews": 2,
          "Date": "2023-06-16T13:09:55.000Z",
          "Titre": "The reason behind this rating is…",
          "Contenu": "The reason behind this rating is because it’s difficult to get in touch with your staff."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KP",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T21:45:37.000Z",
          "Titre": "It seemed like getting help was like…",
          "Contenu": "It seemed like getting help was like pulling teeth a bit.I guess I eventually figured out what I needed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "edward a",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T00:53:26.000Z",
          "Titre": "No manual to download!",
          "Contenu": "There does not appear a user manual is available to download and learn the various options."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin Witmer",
          "Nb_Reviews": 1,
          "Date": "2022-12-24T09:24:24.000Z",
          "Titre": "Camera works good",
          "Contenu": "Camera works good. Problem is it chooses when it records and when it doesn’t. Wish it would record every time the sensor is tripped on"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "BARRY REEVES",
          "Nb_Reviews": 6,
          "Date": "2023-03-26T13:31:49.000Z",
          "Titre": "The only thing that I find annoying is…",
          "Contenu": "The only thing that I find annoying is when you playback recordings it has been set off by RAIN or trees and you think someone has been detected in the recordings it just shows rain and trees blowing  should be just that it identifies just heat and motion"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "PeteC",
          "Nb_Reviews": 1,
          "Date": "2022-12-18T12:07:25.000Z",
          "Titre": "Swann Wifi cameras and doorbell",
          "Contenu": "Bought two Swann indoor wifi cameras and a doorbell.  Overall quite mixed experience so far. Doorbell camera had initial set up issues and has a few flaws:  (1) lag between registering a ring and getting phone notification (2) video recording is too short and often cuts off part way through (3) sleep function renders device useless for a security device due to period between clip recordingsPan and tilt camera and auto tracking camera are good when they work but periodically disconnect from wifi.  Pan and tilt camera motion detection is a bit hit and miss.  Website point of sale also not clear that the device would not trigger through a window.No way to turn cameras off for privacy in the app or set scheduled on / off times.  Result is the need to manually switch them on or off and reconnect them in the app each time.App is slow to respond sometimes despite ultrafast broadband connection.Initial customer service contact via chat was ok but no contact recieved after case transferred for follow up."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "John McMenamin",
          "Nb_Reviews": 4,
          "Date": "2022-11-11T04:32:55.000Z",
          "Titre": "Bought  the camera and found the camera…",
          "Contenu": "Bought  the camera and found the camera lens was damaged exactly in the middle so we have smudged imaging.  We are using it to observe our rescued Wallabies in the back yard and for our security. Unclear video does  not help at all and came that way out of the box brand new.otherwise, would have been good but an expensive exercice when bought damaged brand new."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Apfel",
          "Nb_Reviews": 2,
          "Date": "2023-06-23T03:21:09.000Z",
          "Titre": "Still working out the kinks",
          "Contenu": "Still working out the kinks, incorrect time although it is the correct time zone"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "shawn",
          "Nb_Reviews": 2,
          "Date": "2023-05-14T22:32:51.000Z",
          "Titre": "A bit difficult to set up without clear…",
          "Contenu": "A bit difficult to set up without clear instructions. FAQ was not very helpful"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sarah Norment",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T02:04:32.000Z",
          "Titre": "Good for what i needed",
          "Contenu": "The app on my phone is chopping really bad. It doesn't want to play a smooth video and watching live view is the same way. It's fine on my husband's phone, maybe it's just mine."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Casey Jones",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T19:55:02.000Z",
          "Titre": "Oh no not signal again...",
          "Contenu": "Every so often  My signal will drop and I have treboot the sysyes at least once a week."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "David Parker",
          "Nb_Reviews": 2,
          "Date": "2023-02-23T09:43:06.000Z",
          "Titre": "Hard drive not formatted on arrival and…",
          "Contenu": "Hard drive not formatted on arrival and no instructions to tell you to do it."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "John",
          "Nb_Reviews": 16,
          "Date": "2022-11-03T12:54:54.000Z",
          "Titre": "The cameras are good but that’s about…",
          "Contenu": "The cameras are good but that’s about it.  The system doesn’t do what the adverts suggest especially in the evening.  Constant alarms as car headlights trigger the sensors and this is with areas supposedly blocked to prevent this happening.  Don’t set email reporting as you will get a constant barrage of reports.  I believe the headlight problem is impossible to stop, so why not say so."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Phil Mcleod",
          "Nb_Reviews": 39,
          "Date": "2022-11-25T21:52:36.000Z",
          "Titre": "Nice camera but customer sucks not even…",
          "Contenu": "Nice camera but customer sucks not even a delivery email regarding delivery"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dexter Boone",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T23:30:48.000Z",
          "Titre": "Today the device seemed to not work",
          "Contenu": "Today the device seemed to not work. From what I was told that happened. Either someone is lying or the device skipped two motions one in and one out the door. What do you think. Those should be an exit between the hours of 12or1 pm"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Darko Filko",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T07:03:24.000Z",
          "Titre": "Ok products for a small budget"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer name declined.",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T18:06:21.000Z",
          "Titre": "Shipping Information Not Provided",
          "Contenu": "After placing my order I was not provided shipping information - expected delivery date, carrier, etc.  The confirmation of purchase stated that Swann had not provided shipping information."
        },
        {
          "Note": 3,
          "Lieu": "PR",
          "Pseudo": "Ramon",
          "Nb_Reviews": 4,
          "Date": "2023-03-23T05:31:46.000Z",
          "Titre": "Security concerns",
          "Contenu": "Is easy to install, but difficult to keep updates for software."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Young",
          "Nb_Reviews": 2,
          "Date": "2023-02-13T03:21:02.000Z",
          "Titre": "App issues",
          "Contenu": "App issues. Playback breaks up sometimes. Having to reset cameras too."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T17:56:17.000Z",
          "Titre": "I still cannot figure out audio… even…",
          "Contenu": "I still cannot figure out audio… even the cheep and inexpensive cameras on the market, have it."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Brandon",
          "Nb_Reviews": 1,
          "Date": "2022-10-22T15:16:24.000Z",
          "Titre": "Good cam, no shipping info",
          "Contenu": "Camera works fine. There is no tracking information on shipments out of Swann, which is inconvenient for people worried about the security of their packages. The tracking on the website still said \"being processed\" when the cam was delivered. I'll prob buy my next one from ebay, just for the ease of mind."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Regial Barrett",
          "Nb_Reviews": 3,
          "Date": "2023-05-23T02:06:20.000Z",
          "Titre": "Camera lens",
          "Contenu": "The lens on the camera has a scratch almost in the center of the point of view. Makes it look cloudy. They rest seems to do good"
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Quinn Longman",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T10:03:06.000Z",
          "Titre": "I have 2 cameras and one always seems…",
          "Contenu": "I have 2 cameras and one always seems to not record."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Raj Bommakanti",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T04:47:35.000Z",
          "Titre": "Laptop app works fine but android is NOT",
          "Contenu": "Laptop app works fine.  Android app on the latest Samsumg Galaxy is unstable.  Help please."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mr Alan Tulip",
          "Nb_Reviews": 3,
          "Date": "2023-05-18T20:51:59.000Z",
          "Titre": "When I rang to ask a technician they…",
          "Contenu": "When I rang to ask a technician they seemed very inexperienced"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Guest",
          "Nb_Reviews": 5,
          "Date": "2023-03-12T02:44:12.000Z",
          "Titre": "They record ok but delayed action on…",
          "Contenu": "They record ok but delayed action on live so only 3 stars from me"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Andre",
          "Nb_Reviews": 2,
          "Date": "2022-10-28T03:15:27.000Z",
          "Titre": "Plug and play doesn’t work for all set…",
          "Contenu": "Plug and play doesn’t work for all set ups! I need a network engineer to help me. Continuing to send me links to articles gets old. I have live video locally but not when I’m on line."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph Humet",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T15:56:07.000Z",
          "Titre": "The software is a PITA to install and…",
          "Contenu": "The software is a PITA to install and get Up  & Running"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Johanna Linton",
          "Nb_Reviews": 3,
          "Date": "2023-05-16T23:27:47.000Z",
          "Titre": "Security system stops.recording  at anytime. Hard to replay video.",
          "Contenu": "My security system stops recording  unexpectedly. Important data is lost. Have problems reviewing past dates."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Vilmita Montalvo",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T01:28:36.000Z",
          "Titre": "It’s get freezing all the time..so…",
          "Contenu": "It’s get freezing all the time..so frustrating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jesus Rojas",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T19:34:51.000Z",
          "Titre": "I missed important events in my property"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mr Sibley",
          "Nb_Reviews": 20,
          "Date": "2022-09-22T10:00:38.000Z",
          "Titre": "Disappointed",
          "Contenu": "I purchased this camera to complement an exiting wireless alarm system. Installed outside on the driveway. I am sorry but I am disappointed with this camera. It does not always trigger movement, tried all the settings. The biggest issue is with the low light usage which is pretty poor. While it does not claim to work in low light conditions, as a security camera I would have expected more."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mr Bryant",
          "Nb_Reviews": 8,
          "Date": "2023-03-21T18:29:10.000Z",
          "Titre": "swann buddy it just never seams to be…",
          "Contenu": "swann buddy it just never seams to be online when you check"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ROBERT HARLOW",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T04:26:13.000Z",
          "Titre": "Awful battery time.",
          "Contenu": "At the time I received this email to review I am charging the battery this is 6 days from installation I believe when I researched  before I purchased  swann stated most customers get 2 to 3 months on charge. This seems like either I got a bad one or.maybe.there not what they say they are not real happy. I will gladly edit review if possible if swann can contact me and explain."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kim Hickman",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T04:44:04.000Z",
          "Titre": "Love the picture but lose network…",
          "Contenu": "Love the picture but lose network connection every night works ok during the day"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "David Parkinson",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T09:12:38.000Z",
          "Titre": "Easy to use but deleting is annoying",
          "Contenu": "The Swann security camera was easy to set up and just as easy to use day to day, the picture is clear and the app simple to use. The only issue I have is when deleting clips, there is a delete all button but it doesn’t, and often takes ten attempts to clear 300 clips.  Other than that it’s very reliable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rodrick  Zeller",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T03:35:10.000Z",
          "Titre": "My DVR 16 was easy to set up",
          "Contenu": "My DVR 16 was easy to set up. This is my 3rd Swann system since 2013, each time moving to a better system. I am having a little problem pairing my system to my iPad, but it is paired with my phone.I like Swann cameras and would recommend them to anyone looking for a good camera system."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Sharon Mair",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T10:35:18.000Z",
          "Titre": "Pretty good system …",
          "Contenu": "It’s been great but we did have a few months where it didn’t work or notify us at all and we couldn’t work out how to fix it but it rectified its self eventually"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T04:25:25.000Z",
          "Titre": "I would like it if the lights would…",
          "Contenu": "I would like it if the lights would stay on longer than 5 minutes The camera keeps going off line,really a bad timing when this camera is used for security"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T13:15:46.000Z",
          "Titre": "Just knowing you have the cctv at your…",
          "Contenu": "Just knowing you have the cctv at your property makes you feel safe, checking play back if you want to see some event. just grate."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Colin Mason",
          "Nb_Reviews": 15,
          "Date": "2023-12-08T15:52:28.000Z",
          "Titre": "Super easy system and installation.",
          "Contenu": "Although I bought this 2 years ago, I only installed it a year ago. The system has worked fine. The difficulty was the installation at my dormer bungalow with several lofts. Thankfully Swann supply extremely long cables so I was ableTo route everything to where I wanted it. You can also buy extension cables if you have more extreme lengths. After installing, it was a case of connecting the plugs into the cctv box, attaching a spare tv and the mouse and then working through the easy menu, followed by watching it all fire up. It’s now been a year of use without any problems. One of the front cameras covers a good 20 metres. The system connects to my smart phone so I can monitor whenever I want and review previous footage without needing a tv monitor."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Tony Wainwright",
          "Nb_Reviews": 5,
          "Date": "2023-12-06T14:50:47.000Z",
          "Titre": "Good but not great",
          "Contenu": "Could have been five stars but for the the bends and kinks in the ethernet cables.  For 5mm ethernet cables they should have bend radius of at least 20mm.  The ones I got were bent double.  (ANSI/TIA Generic Guidance - Minimum inside bend radius for copper)Had to get some new ones and have bought weatherproof."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "arperezattglobal.net",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T16:09:47.000Z",
          "Titre": "Keep your property safe",
          "Contenu": "It lets you know when any movement is happening in the area of the camera"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shane",
          "Nb_Reviews": 5,
          "Date": "2023-12-10T20:13:31.000Z",
          "Titre": "I like the system",
          "Contenu": "I like the system. What I don’t like is, I have to subscribe to have any features like voice and audio. I was reading the other reviews and I would like to add a few things. 1) I’m not the only one with audio issues. 2) Another person says their cams won’t pick up deer and other wild life. If you have it set on the highest setting with PIR, it might. Otherwise, deer move too slow to set it off. I had to turn mine down because I have a herd come through my yard every night about 3am."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "PF",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T21:02:54.000Z",
          "Titre": "Easy to use and setup",
          "Contenu": "Easy to use and setup, would be a good improvement if you were to be able to make DVR setting changes from the app"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Allen",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T18:12:54.000Z",
          "Titre": "I’m keeping an eye on my home!",
          "Contenu": "I love the clarity of my cameras & the Swann team honors the cameras because one of my cameras stopped working & the Swann team replaced it!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Shelley Sullivan Desborough",
          "Nb_Reviews": 4,
          "Date": "2023-12-07T13:25:15.000Z",
          "Titre": "It’s great",
          "Contenu": "It’s great. Sometimes need to tweet the camera settings. only frustration is not being able to get help quickly in some cases I’m google searching help/ solutions for hours, and impossible to speak to a human"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lynda Shepard",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T16:48:04.000Z",
          "Titre": "The only problem I have had with the…",
          "Contenu": "The only problem I have had with the cameras is that most of the time they don’t catch the dear and other wildlife. Otherwise… the cameras are great!!!"
        },
        {
          "Note": 4,
          "Lieu": "JM",
          "Pseudo": "Kwabena",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T06:01:21.000Z",
          "Titre": "Real time videos",
          "Contenu": "Video quality is great but no two way audio nor does it have a flexible playback feature"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Patno",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T02:24:24.000Z",
          "Titre": "The cameras work great",
          "Contenu": "The cameras work great.  NVR works great.  Plug and play from the existing installation of Ethernet cables.  App is buggy.  Sensitivity settings sometimes do not stick.  Cameras are Online\" or not.  Technical support could not provide an answer.  The biggest flaw is that you get very little local storage.  The NVR only stores about 30 seconds of the last event and nothing else.  I want local storage to roll over.  The only storage option is to buy a service package for $100 or more per year."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "M Radoi",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T13:23:51.000Z",
          "Titre": "I like swann app but unfortunately is…",
          "Contenu": "I like swann app but unfortunately is not stable, when I need to open it is randomly asking for password, by doing that I am missing that critical time when someone is at the door"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Deborah B",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T06:34:42.000Z",
          "Titre": "The camera is great",
          "Contenu": "The camera is great. A bit laggy to go to live view, but overall I recommend. Easy to install"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Ray Mason",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T23:14:36.000Z",
          "Titre": "lollllllll",
          "Contenu": "lol. I’ll no doubt say what I’d like to say. No need to prompt an inflated response because you advise me that’s what I should do. I like my cameras but they are far from perfect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lane Bentsen",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T04:02:46.000Z",
          "Titre": "I like the cost and features of the…",
          "Contenu": "I like the cost and features of the wifi cameras.  However, sometimes it takes a long time to wake them up to view."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T03:14:53.000Z",
          "Titre": "Not sure if is my internet but the live…",
          "Contenu": "Not sure if is my internet but the live stream is pretty weak other than that no complaints"
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Judy Boucher",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T11:44:47.000Z",
          "Titre": "Peace of mind .",
          "Contenu": "Peace of mind and a feeling of safety was of utmost importance for my selection of Swann products.It has not let me down."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "David Phimister",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T16:42:34.000Z",
          "Titre": "Works well most of the time",
          "Contenu": "Works well most of the time. Night camera doesn’t always seem to kin in though."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "virgilbkhotmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T02:24:04.000Z",
          "Titre": "We love the live views and activity…",
          "Contenu": "We love the live views and activity recording.   Very good video.   We have had a ton of trouble adding our second homes swann system to the app though."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Michael And",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T13:41:16.000Z",
          "Titre": "Swann NVW800 and Sensors",
          "Contenu": "System works well so far however, sensors (door, windows, syren) don’t connect directly with NVW-800 but through home wi-fi. This is a serious security flaw of the system cause unnecessarily add sensors visibility in the network. Called Swann helpline and nothing can be done with the problem as the software prohibit connecting additional irems to the NVW.Today for the first time I opened the door without changi g the mode. Door sensor triggered the siren and… the siren is a mistake. A bit louder than the alarm that comes from the camera but behind the door it sound like a toy police car. And again, sensor didn’t trigger camera and camera didn’t notice the movement. I will keep observing how the system work…UPDATE: As of Nov 2023 the system works well. Other than above I’m quite pleased with it’s performance. I just love the app with Modes function and Live View. NVW-800 works silent and in comparison to Hiseeu I bought formerly It’s bearly hearable. Overall 5/6."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T14:38:20.000Z",
          "Titre": "From a novice security user",
          "Contenu": "I'm new to the security scene. It used to be that crime wasn't even thought of, and when it occurred it was not fraught with violence.I like the picture resolution, and the ability to zoom in on a downloaded image. I wish it were real-time, and easier to view on my laptop. Only viewing on my phone, and only in portrait, limits what I can make out.  The sound took a long time to get where it was even intelligible, and maybe it can be more fine-tuned. I may play with that some more.It'll be interesting to see how it performs over the winter and through various weather types."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Jay Bails",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T09:46:10.000Z",
          "Titre": "Great so far.",
          "Contenu": "Great so far.Does seem to lose contact in 30secomds of connection"
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Jerry Crowley",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T00:31:56.000Z",
          "Titre": "‘Quick response to queries"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Corey Ninyett",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T06:38:03.000Z",
          "Titre": "We’re pretty happy foe our camera setup",
          "Contenu": "Swann is the best for surveillance and home protection 💯"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Denis Perkins",
          "Nb_Reviews": 2,
          "Date": "2023-09-17T10:00:47.000Z",
          "Titre": "I contacted support for setting up my…",
          "Contenu": "I contacted support for setting up my new dvr,It was with a very good support person was sorted in no time.The second person I spoke to a few days later releating to a connection problem with my new router,just gave me a run around,after about 20 mins I rung off.I sorted it out next day with a neighbours help in 10mins."
        },
        {
          "Note": 4,
          "Lieu": "PA",
          "Pseudo": "Claudio Hawkins",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T12:58:00.000Z",
          "Titre": "Reliable surveillance system.",
          "Contenu": "Reliable surveillance system.Only one problem: channels seven isn’t working."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Denis Andlauer",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T18:43:11.000Z",
          "Titre": "Good app",
          "Contenu": "Easy to use and stable application"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Piyush Patel",
          "Nb_Reviews": 6,
          "Date": "2023-12-07T20:04:18.000Z",
          "Titre": "Nice and clear view from cameras",
          "Contenu": "Nice and clear view from cameras. System easy to set"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wayne",
          "Nb_Reviews": 2,
          "Date": "2023-07-30T03:49:17.000Z",
          "Titre": "I love my Swann Security cameras",
          "Contenu": "I love my Swann Security cameras. The only problem that I see is the cameras are weather proof up to a point. I've had to replace two outside cameras for the same reason, they have screws that where not tight that hold them together in the back. This lets water in when it rains hard. I think they should have a rubber plug over the screws to keep the water from entering and rusting them."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "L Warren",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T12:37:14.000Z",
          "Titre": "We are very happy with our new SWANN…",
          "Contenu": "We are very happy with our new SWANN quadcore cam. It is a vast improvement on the older one we had that malfunctioned and wouldn't hold power. It is very clear footage and audio. Holds the charge well as it's wireless. We love the fact we can see what's happening at home if we are out as we get push notifications.  We would purchase again and recommend these cameras for anyone needing to secure their property."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Martin Aust",
          "Nb_Reviews": 22,
          "Date": "2023-07-29T13:23:27.000Z",
          "Titre": "good product, works well",
          "Contenu": "It was delivered quickly and worked well with little difficulty. I had problems getting remote access, it turned out that the phone and PC software that worked with my previous Swann DVR didn work with the new one and I had to install new programs which worked fine."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Daz man",
          "Nb_Reviews": 12,
          "Date": "2023-12-08T12:41:13.000Z",
          "Titre": "Very good quality.",
          "Contenu": "This is a great system  so easy to use. Picture is so clear and great detail"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "SlowNige",
          "Nb_Reviews": 24,
          "Date": "2023-08-25T09:38:20.000Z",
          "Titre": "Good For the price",
          "Contenu": "For the price, especially through the many sale offers, these are decent cameras. I have them fixed outdoors and also use some now and then for indoor supplements.  The software is ok and is improving."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 2,
          "Date": "2023-10-08T05:06:03.000Z",
          "Titre": "A Novice review",
          "Contenu": "This is my first security camera system.  The hardware installation was fairly straightforward.  The software setup was somewhat confusing and I had to read the instructions manual several times to get the desired settings.A mistake was made setting up the initial password and it was somewhat of a hassle resetting it, since the system is a standalone installation (I. e., no network, no Internet). I had to remove the DVR and temporarily install it on a network, so that it would have a MAC address assigned to it.  Once that was done, the password was reset and the DVR returned to the desired location.  I thought that was a bit much just to reset a password.  I guess the manufacturer assumed ALL systems are installed on a network; which was clearly not my situation.Anyway, I was able to get the system operating as designed.  I'm still trying to fine tune some of the settings.  This is taking a little longer then expected; but I'm attributing much of that to my limited understanding of how the system operates as a whole.I'm having to re-read some parts of manual to correctly apply the instructions, but I guess that's just part of the learning process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Davis",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T17:25:47.000Z",
          "Titre": "Knowledgeable Tech staff were able to…",
          "Contenu": "Knowledgeable Tech staff were able to troubleshoot issues resulting from power surges...I now have 5 of the 6 cameras back online.  As it happens, I don't think the old DVR is damaged, but I will keep the new one!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Philip McGhee",
          "Nb_Reviews": 4,
          "Date": "2023-09-27T10:38:43.000Z",
          "Titre": "HD upgrade",
          "Contenu": "Efficient service and great price for the 1080 HD kit. Sadly, the quality of the images, particularly at night, are not much improved from the 720 cameras which this kit was bought to replace."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "ABDULLAHI HAJI MOHAMED",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T17:47:27.000Z",
          "Titre": "Good but sometimes was on and off the…",
          "Contenu": "Good but sometimes was on and off the camera."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donnie Gay",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T21:07:27.000Z",
          "Titre": "Great camera’s and system"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank Fracasso",
          "Nb_Reviews": 4,
          "Date": "2023-03-27T04:44:55.000Z",
          "Titre": "Camera was determined to be defective…",
          "Contenu": "Camera was determined to be defective by support person.  I ordered a replacement camera which worked fine.  I received helpful guidance in connecting DVR to our new WI-FI mesh.  Also activated SWANN app to monitor via iPhone.  Happy with the assistance I received from SWANN tech support person."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Les Leddy",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T05:58:28.000Z",
          "Titre": "Excellent video quality with great features.",
          "Contenu": "Excellent video quality, and some of the best features. My only complaints are: It did not include templates for mounting the cameras and not including printed instructions. I had to download and read everything on PC, how much would it cost to include the instructions? But overall it's an excellent system with some of the best features available."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Sarah unsworth",
          "Nb_Reviews": 2,
          "Date": "2023-06-08T13:21:18.000Z",
          "Titre": "Great technologies",
          "Contenu": "Great tech, easy to install' fantastic playback, and when you're busy or on the move. Motion alert, notifies you when there's a detection. My favourite about Swann security is the night vision' it really sees in the dark!"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Casa Miguel Arcangel",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T14:59:02.000Z",
          "Titre": "Works great and easy to understand."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John",
          "Nb_Reviews": 39,
          "Date": "2023-07-22T09:18:58.000Z",
          "Titre": "Reasonable price, easy to install",
          "Contenu": "The system I have purchased is the 4 camera 1 tb dvr. Good quality. Easy to install. The instructions for setting up could be better - I had to consult a YouTube video to see how to remove a dome camera base. Other than that I’m quite happy."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Raj",
          "Nb_Reviews": 4,
          "Date": "2023-07-28T11:05:14.000Z",
          "Titre": "Order process",
          "Contenu": "Hello, the staff check the item would work with my system was very polite and helpful.  The order was done on line without any issue until the delivery.  I waited for the message on system to say item was due for delivery but only got processing due to it was the weekend.  On Monday the system still say processing.  On Tues still processing but got message from the delivery company saying it on it way.Item arrived and I was happy.  Hope this helps."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 7,
          "Date": "2023-05-03T02:20:41.000Z",
          "Titre": "Swann security cameras, watch the refurbished ones",
          "Contenu": "I believe that the cameras are very good..I bought a refurbished camera from them, and before I installed it, I powered it up in the house. I could not get it to hook up to the WiFi. After a few attempts, I discovered that the WiFi user name did not match. I called tech support and explained the issue, they assisted in troubleshooting and finally decided the camera had not been updated. They make it very hard to send anything back, requiring all sorts of documents. They finally sent an RMA to return it but no return ticket, guess they want me to pay for shipping to send back."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Grant",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T09:01:34.000Z",
          "Titre": "Nice residential system",
          "Contenu": "Nice residential system. They seem to be very attracted to lightening. This is my 3rd system. The prior 2 was damaged by lightening. Annoying notice (A screen has been detected in 4k, do you want to set this resolution). Can't stop the notification from popping up!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "chris carroll",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T16:41:42.000Z",
          "Titre": "it would be nice if you provided a…",
          "Contenu": "it would be nice if you provided a users manual,  so customers know how to use features like back-up and other settings"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SB",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T17:11:54.000Z",
          "Titre": "Easy setup",
          "Contenu": "Easy setup. Easy to understand.  My only issue is a lag time between when there is activity and receiving a notification.  Also,  the camera doesn't catch activity until the person is almost gone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wayne S",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T23:09:15.000Z",
          "Titre": "Recorder",
          "Contenu": "I originally had a different brand security system. It lasted just over a year. Just long enough to get out of warranty. I purchased a swan and it lasted for several years as well as was very user friendly. But, it finally crashed and I had to buy a new recorder. I would have given this new one five stars except they have downgraded the graphics displays. The old swan had colorful, visible and easy to use pages for setup and operation. The new one kind of went back in time a little bit. For example the buttons on the screen are not colorful buttons, just outlines. Some of the features have changed as far as viewing them on the screen but the operation seems just as good as the old Swan."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "THOMAS OPOKU",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T04:21:54.000Z",
          "Titre": "Good picture quality at day time.",
          "Contenu": "Picture  quality at day time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Fry",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T14:24:34.000Z",
          "Titre": "Reliability",
          "Contenu": "High quality"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Paul Barron",
          "Nb_Reviews": 3,
          "Date": "2023-05-22T06:57:47.000Z",
          "Titre": "Really impressed",
          "Contenu": "Really impressed, with the quality of this camera set up. Even down to using the app on our phones. Surprised at how much tech is available and things you can do in the setting and easy enough to understand and use if necessary."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Pete Banks",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T08:18:26.000Z",
          "Titre": "Swann Camera system",
          "Contenu": "So far the Cameras and Swann system has been functioning as I would expect... All 5 locations are pretty clear. But I'm not sure if I would recognize an intruder facially , at a distance..?"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Patrick Lindop",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T06:12:25.000Z",
          "Titre": "Always works!",
          "Contenu": "Had the system for 3 years and never fails"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Neil Soto",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T21:32:14.000Z",
          "Titre": "I received technical help on perching a…",
          "Contenu": "I received technical help on perching a new recorder on line . The technician was efficient and was very knowledgeable on the system I needed to replace my old one . It was a perfect fit for my cameras. The only thing was it was a 8 channel , my old one was 16 . I was only using 8 cameras anyway , so it was ok for me ."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Yash Shah",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T22:23:31.000Z",
          "Titre": "It is a great product at the price with some workable flaws",
          "Contenu": "It is a great product at the price point. The only concern is with motion detection. It detects every bit of motion like trees moving in wind or leaves etc. That defeats the actual purpose where I am getting continuous notifications and start to ignore them instead of focusing on them if it was actual human motion related notification."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mrs Miranda Rossiter Doel",
          "Nb_Reviews": 9,
          "Date": "2023-11-20T11:38:20.000Z",
          "Titre": "The system works and is easier to use…",
          "Contenu": "The system works and is easier to use than the last one we bought from you 6 years ago"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adrian Navarrete",
          "Nb_Reviews": 1,
          "Date": "2023-03-25T00:21:22.000Z",
          "Titre": "The system works great",
          "Contenu": "The system works great, I've not had any issues and going on 2 years. A while back there was an app update and once it was installed, I have not been able to view the playback videos consistently. The video always pauses or doesn't playback. That's the only issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen Burris",
          "Nb_Reviews": 2,
          "Date": "2023-06-07T16:33:08.000Z",
          "Titre": "Great picture quality for the price. I am able to save almost 30 days video  before days start dropping off but I can save whichever ones I need. I only wish I could more easily save and send.",
          "Contenu": "I love the ability to save videos. I just wish I could understand why it's so hard to save a whole portion of a video instead of just a few seconds etc...picture quality is very good for the money. I have been able to use videos for legal issues. Very much appreciated."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "A  Borg",
          "Nb_Reviews": 7,
          "Date": "2023-05-21T02:44:27.000Z",
          "Titre": "Three SWifi-Cam different",
          "Contenu": "The three SWifi-Cam cameras are very good when they work, but they all are different in the way they perform. As they are all the same config they are different in the way the app interacts with them and response."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Steven Kaye",
          "Nb_Reviews": 2,
          "Date": "2023-09-25T19:01:59.000Z",
          "Titre": "Swann",
          "Contenu": "Have had swann for many years great piece of equipment but slight delay in the cameras when using the app"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Iain Perkins",
          "Nb_Reviews": 2,
          "Date": "2023-05-20T11:43:02.000Z",
          "Titre": "SWNVK-874004 - 4 camera system.",
          "Contenu": "I have an SWNVK-874004 with 4 x 4K cameras. Overall this system is excellent with very good video quality and internet connectivity. The reason I have given 4 stars is that 1 or other cameras will go offline occasionally for no apparent reason and the system needs rebooting to bring it back on. Otherwise I am totally satisfied in every other respect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "L Hatcher",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T17:19:34.000Z",
          "Titre": "This is the 9th Swann system I have…",
          "Contenu": "This is the 9th Swann system I have install for friends and family. (2- DVR8-5580) It has good color night vision with ample amount of light. Good night vision with little or no light. Day Picture is very good. 1TB Hard Drive records many months when set to motion. Easy to operate and playback. The app is fair for playback. Biggest drawback for Swann is their support. Sometimes they are slow, but they will follow up if you Email or call and get a case number."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lynn Davies",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T02:04:18.000Z",
          "Titre": "Great system but the phone app needs…",
          "Contenu": "Great system but the phone app needs work."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Catherine Morgan",
          "Nb_Reviews": 9,
          "Date": "2023-11-27T12:55:44.000Z",
          "Titre": "Great customer care great quality of…",
          "Contenu": "Great customer care great quality of products"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T02:52:32.000Z",
          "Titre": "Good quality",
          "Contenu": "Good quality, clear video. Has intermittent problems connecting to wifi but unsure if that's the unit or my connection, but still records in the background anyway."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T19:13:16.000Z",
          "Titre": "Almost a 5 star Review",
          "Contenu": "The package I bought was a solid value for the money spent. It is simple enough to put up a basic configuration. Where I feel it falls short is with the quality of the ethernet cables, they are wound very tightly and I had issues with 2 of them not working after spending quite a while to unwrap them and allow them to soften and straighten You should pretest them before installing them in a permanent location. The audio is acceptable in listening mode only and records at a reasonable quality. Using the microphone is a different story and only results in a horrible screech coming from the camera. I tested this on multiple cameras as well as on a different model camera and the results were the same. I tried disabling the audio on all but 1 of the cameras and had the same results. The app for IOS and Android are basic and sufficient for viewing/reviewing events but making config changes is not a current capability, however it suits my needs. The management app for Mac/Apple doesn't work. I have not yet tried to install on a Windows based PC. The system comes with a lot of features that if needed will require a fair amount of time to configure and tune to dial in the system to reduce white noise alerts and excessive recording, but this would be true of any system with advanced features. The 6k quality is excellent, I would take their advice and add a second and or larger hard drive option if recording multiple cameras in HD if you don't want archive more frequently."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SR",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T20:00:34.000Z",
          "Titre": "Should have a windows based application…",
          "Contenu": "Should have a windows based application for all cameras so additional wireless cameras are not just available on the phone. After power outages the NVR has to be constantly be restarted 2-3 times before the cameras are available."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "VTS",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T17:41:17.000Z",
          "Titre": "The Swann motion detector does not work…",
          "Contenu": "The Swann motion detector does not work as good as cameras. It does not push an alert as fast as cameras when activities happen."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Mark",
          "Nb_Reviews": 13,
          "Date": "2023-03-24T00:08:38.000Z",
          "Titre": "Easy to set up and use",
          "Contenu": "Easy to set up and use, so far no problems and a good service, only have system a few months so cannot comment on prolonged period of use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carl Fetty",
          "Nb_Reviews": 2,
          "Date": "2023-07-23T06:51:23.000Z",
          "Titre": "Broken camera in order",
          "Contenu": "I received my package and 1 of my cameras was broken. I have been trying to get a hold of someone to get it either fixed or replaced. I am now well out of 30 days but so far things look good except for the broken 1."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Iris Campbell",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T22:09:32.000Z",
          "Titre": "I’m all satisfied except that sometimes…",
          "Contenu": "I’m all satisfied except that sometimes my cameras get distorted. Not sure of the dates but it happened a couple of times."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Su",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T13:34:16.000Z",
          "Titre": "Is nice to not have to go outside and…",
          "Contenu": "Is nice to not have to go outside and check if you hear something and notified when there is someone. But it is annoying on windy days."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randy Hughes",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T23:44:41.000Z",
          "Titre": "Camera system is great",
          "Contenu": "Camera system is great. However, I have one camera the infrared is not working on trying to find out what I need to do to get a new one."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "graham walls",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T02:00:57.000Z",
          "Titre": "Cameras generally working well",
          "Contenu": "Cameras generally working wellOnly issue is the indoor camera has gone to black and white for some reason"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randy",
          "Nb_Reviews": 2,
          "Date": "2023-05-20T14:11:21.000Z",
          "Titre": "Everything would be fine if your main…",
          "Contenu": "Everything would be fine if your main base was in the United States. You can’t understand a word from them people in the Philippines.   And fix the hour behind on the system and app."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Nigel Hale",
          "Nb_Reviews": 16,
          "Date": "2023-05-31T10:04:06.000Z",
          "Titre": "Decent cameras",
          "Contenu": "Decent cameras, fair price. App is improving nicely.  Moving up to faster WiFi would be good."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Feely",
          "Nb_Reviews": 7,
          "Date": "2023-09-22T13:28:16.000Z",
          "Titre": "Plug and play set up worked well only…",
          "Contenu": "Plug and play set up worked well only issue is the size of hole required to get cable through walls"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Virgy M",
          "Nb_Reviews": 4,
          "Date": "2023-03-24T19:31:08.000Z",
          "Titre": "It's very clear",
          "Contenu": "It's very clear. Unfortunately, maybe because of the distance, I can't talk back or hear any one talking."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Customer Steve F.",
          "Nb_Reviews": 36,
          "Date": "2023-05-09T09:24:09.000Z",
          "Titre": "Had issues with my camera",
          "Contenu": "Had issues with my camera, was able to do online chat with agent who was able to advise me on the issue."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Neil Smith",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T20:57:20.000Z",
          "Titre": "Helps with my business"
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Vernon Armstrong",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T18:16:49.000Z",
          "Titre": "I feel  secure",
          "Contenu": "I feel secure and comfortable  a  few  weeks ago I misplaced my car keys and thanks to the system I was able to locate it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ralph",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T01:59:35.000Z",
          "Titre": "Security",
          "Contenu": "I love knowing I can rest seeing my surroundings are safe!  The pictures are clear and quality is exceptional"
        },
        {
          "Note": 4,
          "Lieu": "JM",
          "Pseudo": "Kevan Archer",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T00:48:00.000Z",
          "Titre": "The product is user-friendly great…",
          "Contenu": "The product is user-friendly great night vision with led light support which gives color night  vision"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Josh Ladue",
          "Nb_Reviews": 2,
          "Date": "2023-04-25T17:46:34.000Z",
          "Titre": "Faulty HDD receiver",
          "Contenu": "I had issues at first. However the products been replaced by Swann under the manufacturer warrant"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 7,
          "Date": "2023-05-22T13:47:11.000Z",
          "Titre": "Security light",
          "Contenu": "The security lights work quite well, I was able to check on house in Mich all winter long while in Florida"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dev",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T13:06:08.000Z",
          "Titre": "They always work and never have an…",
          "Contenu": "They always work and never have an issue!!! I do wish they were a little easier to dial in. Like the settings and stuff like fine tune them.. but I really enjoy the product and plan on buying more!!!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Paul Anthony Dickinson",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T12:02:37.000Z",
          "Titre": "Good well done wish there was dound"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "City1",
          "Nb_Reviews": 5,
          "Date": "2023-04-10T22:34:00.000Z",
          "Titre": "East setup",
          "Contenu": "East setupSimple viewingClear image but 1 camera shadowing at night so 4star."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lorie luiza",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T02:18:09.000Z",
          "Titre": "Would have liked to have a live person…",
          "Contenu": "Would have liked to have a live person or chat available The email worked just took longer and then some of the cables were out of stock.We did receive the cables so thank you."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "tony brown",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T08:32:00.000Z",
          "Titre": "I’m impressed",
          "Contenu": "It’s does capture any images across my area of camera settings. I’m impressed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fran Lumb",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T05:55:42.000Z",
          "Titre": "Technician I spoke to was knowledgeable…",
          "Contenu": "Technician I spoke to was knowledgeable and helpful and patient. My issue was resolved quickly!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom Lebel",
          "Nb_Reviews": 2,
          "Date": "2023-04-01T13:46:19.000Z",
          "Titre": "Decent app",
          "Contenu": "Decent app. Good camera system.Wish there were more options for export/save."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "stephen bedford",
          "Nb_Reviews": 6,
          "Date": "2023-05-18T06:32:24.000Z",
          "Titre": "worked for 1 week before it broke …",
          "Contenu": "worked for 1 week before it broke  support have been great waiting for replacement  4 stars was for speed of delivery ease of setup while it worked it was great  but when i recieve the replacement and see how it goes my rateing may change i am willing to give them a chance"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T12:27:43.000Z",
          "Titre": "Great app",
          "Contenu": "Great app, just need to workout the best setup for notifications as the wind will set off the camera and the notifications gets annoying."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mrs Caroline Sleight",
          "Nb_Reviews": 13,
          "Date": "2023-05-12T11:52:50.000Z",
          "Titre": "I'm a super nosey spy and I love seeing…",
          "Contenu": "I'm a super nosey spy and I love seeing what's happening on my patch..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AS",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:15:55.000Z",
          "Titre": "These cameras are tough and withstand…",
          "Contenu": "These cameras are tough and withstand all weather conditions! We live in the northern part of WI and see all kinds of harsh cold, wind, snow, and rain/ice storms and these cameras never quit! The only thing I wish Swann would do better is the syncing process when you add a camera to your network of previously purchased swann cameras. The QR codes on the back of the cameras don’t always work when trying to add to the app."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Ross",
          "Nb_Reviews": 4,
          "Date": "2023-12-22T02:30:45.000Z",
          "Titre": "Great cameras and internet interface…",
          "Contenu": "Great cameras and internet interface package! This investment has already saved us $1000s through crime detection and prevention. With the right settings, we haven’t missed a thing, or been bothered by unwanted notifications."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "A. Angel T. Bueno",
          "Nb_Reviews": 7,
          "Date": "2023-12-15T08:55:27.000Z",
          "Titre": "Good product at a reasonable price",
          "Contenu": "Good product at a reasonable price. Good customer support through all channels available. Item was received quick and in perfect conditions.It was easy to install and set-up thanks to clear instructions and online resources. I will highly recommend Swann products after this experience."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Michael Tenn",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T07:34:58.000Z",
          "Titre": "To be honest it’s by far the best and…",
          "Contenu": "To be honest it’s by far the best and most user friendly system out on the market. I have owned both Arlo system the Swann . I will never waste another dollar on the Arlo cameras ever again.I had problem after problem with Arlo and on top of that the best quality pictures I could get for night vision were very poor n useless. I can keep going on and on four years later Swann still going perfect and the customer service support amazing always there to help, not like I have even needed them once anyway"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Roy Layton",
          "Nb_Reviews": 5,
          "Date": "2023-12-18T11:20:32.000Z",
          "Titre": "Morning",
          "Contenu": "Morning,  good  service  good  quality   excellent   back   up    thi  is  the  third  set   I  have   bought  with   no  problems, ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D.G.",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T04:04:35.000Z",
          "Titre": "Great purchase, very pleased!",
          "Contenu": "I am very pleased with this camera, the video quality is superb. I have had it for about 6 trouble free months. The sensitivity is outstanding. No more surprise visitors, or wildlife, and I always know when packages arrive.Will definitely get another one soon for the backyard. 5 stars."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Daniel Cockinos",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T14:46:42.000Z",
          "Titre": "Love this system",
          "Contenu": "Love this system. Best customer support service as well. Cheers guys"
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "W. Lopez",
          "Nb_Reviews": 4,
          "Date": "2023-12-12T07:31:14.000Z",
          "Titre": "So far I’m having a good experience with…",
          "Contenu": "So far I’m having a good experience with my Swann Cam System.  On the down side the plastic materials used to manufacture your cameras feels kind of weak after exposed to the elements.  The plastic cracks after a few months of use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcella  Demulling",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T22:08:00.000Z",
          "Titre": "Ease of Use",
          "Contenu": "Easy to navigate your site.  Customer service is helpful.  Setting up your cameras is simple with step by step directions and/or video support."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "K ATKINSON",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T21:19:08.000Z",
          "Titre": "Got a two camera system and HDD…",
          "Contenu": "Got a two camera system absolutely love it,took me some time to get used to and learn the settings but practice makes perfect,Live phone app is great 10/10"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "miguel fonte",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T22:18:37.000Z",
          "Titre": "Swann is amazing",
          "Contenu": "I’ve had the security camera for so many years and it always works perfectly. I updated my system a couple times with Swann and when the company updated the software I never had any issues."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Reilly Sarahlee",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T16:46:58.000Z",
          "Titre": "Excellent",
          "Contenu": "I’ve never had no trouble whatsoever. I’d highly recommends I’m actually unsure why everyone don’t have cameras"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Stephen Swift",
          "Nb_Reviews": 21,
          "Date": "2023-12-13T01:00:45.000Z",
          "Titre": "Great system",
          "Contenu": "Love the work being done on this site really enjoying my system at the present time got 4k wired system 8580 and tracker plus doorbuddy all working great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Recalte Navarro",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T21:54:47.000Z",
          "Titre": "Swann security cameras is so great and…",
          "Contenu": "Swann security cameras is so great and hard to beat in protecting my home, it shows so clearly and displays everything on what going on around every inch and every location and every part of my home.  We feel so safe, secure, and  protected and with a peace of mind.  Thank you very much.  Aloha Nui Kakou Hawaii!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Hazel",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T13:42:52.000Z",
          "Titre": "the set up is user friendly for people…",
          "Contenu": "the set up is user friendly for people with limited computer skills.  The instructions still need some improvement though."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Lyle",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T22:18:49.000Z",
          "Titre": "Great cameras and recordings.",
          "Contenu": "All the cameras are very clear and the playback is also clear. The zoom is awesome. Notifications are a few seconds slow but you have the playback to view if necessary. Best cameras I have had. Will purchase again if needed."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Charlotte Jones",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T10:20:59.000Z",
          "Titre": "Exceptional Value with Swann Security",
          "Contenu": "My first impression was the fantastic price, followed by the simplicity of setup and mobile accessibility for camera viewing. The four-camera package ideally suits my home's exterior security needs. I've been recommending Swann Security to friends and family for its user-friendly installation. Here's to many years of reliable security!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Robyn",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T00:09:16.000Z",
          "Titre": "I can access my home at all times to…",
          "Contenu": "I can access my home at all times to check all activity. I find it great to check on deliveries and just in general. I feel safe at night, and is great if I need it for emergencies. I can change or update my settings mine  was a Christmas gift some yrs back and would recommend this product."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Bernie",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T09:52:59.000Z",
          "Titre": "It’s been great but I need to learn how…",
          "Contenu": "It’s been great but I need to learn how to use system properly as I get way too many notifications from birds and tree branches moving"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Lou Verzola",
          "Nb_Reviews": 6,
          "Date": "2023-12-08T04:32:56.000Z",
          "Titre": "It’s a very good service that I’ve had…",
          "Contenu": "It’s a very good service that I’ve had for years now and hasn’t let me down only once or twice but we got that fixed and organized and reset. It definitely does the work for me and I can view it from anywhere I am in the world."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Paul Dwyer",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T00:11:19.000Z",
          "Titre": "SWAN FOREVER",
          "Contenu": "My experience with SWAN has been over a decade and I’m proud to say I’m very pleased with all the Security cameras I have purchased and the support and customer service I have received from the SWAN team. Merry Christmas and happy New Year."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Beverley Hooper",
          "Nb_Reviews": 39,
          "Date": "2023-12-10T09:29:39.000Z",
          "Titre": "Used my Swann security for a couple of…",
          "Contenu": "Used my Swann security for a couple of years now and find the app do easy to use . Notification are great and I can see easily my property and feel very secure"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T05:08:12.000Z",
          "Titre": "Great cameras",
          "Contenu": "I have been having these camera for a few years now, they have preformed awesome. The videos are so clear day and night. Only thing is, I never could figure out how or if you can set them to daylight saving, I can live with that. So far so good. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr S",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T10:56:15.000Z",
          "Titre": "Kit arrived on good time and of good…",
          "Contenu": "Kit arrived on good time and of good quality. Not had to use their customer service as of yet as instructions well laid out and easy to understand"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Medhat Azer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T10:11:52.000Z",
          "Titre": "Great video quality with free cloud",
          "Contenu": "I’m using this camera for more than 2 years, it’s working very well with good quality videos and most importantly, free cloud memory with no subscription required."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy Kelly",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T19:12:54.000Z",
          "Titre": "Fast response to questions prior to…",
          "Contenu": "Fast response to questions prior to purchase helped make the selection for me."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Martin Sloan",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T07:56:43.000Z",
          "Titre": "Good realiable system and never plays…",
          "Contenu": "Good realiable system and never plays up easy to install but I have installed a lot off cameras before"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:15:00.000Z",
          "Titre": "The quality of the camera is excellent…",
          "Contenu": "The quality of the camera is excellent day or night"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald N Sanders",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T09:39:37.000Z",
          "Titre": "Well laid out web site.",
          "Contenu": "Well laid out web site.Ease of ordering.Decent shipping times."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victor Diaz",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T12:54:08.000Z",
          "Titre": "The system works great —and if you ever…",
          "Contenu": "The system works great —and if you ever have any questions or problems — the support time is amazing. I will be purchasing another package very soon"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Marcus Barstow",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T13:20:05.000Z",
          "Titre": "It’s probably the best on the market",
          "Contenu": "It’s probably the best on the market. I have had mine installed for over two years. Not a single glitch and still have an excellent picture.  Dry happy with it"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T12:51:50.000Z",
          "Titre": "Have had it for 3 years now and still a…",
          "Contenu": "Have had it for 3 years now and still a great product. Instillation was easy, setup was too. 4K is a perfect resolution the police said. Sadly I had to use it, but that why I bought it. It allowed the police to put a name to the suspect as well as used in the prosecution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sabrina Norvell",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T16:10:16.000Z",
          "Titre": "This company has been amazing!",
          "Contenu": "This company has been amazing in helping with any issues i have ever had. I have had this system for 5 years or more and I was so impressed I bought my daughter a full system. They still do full tech support with any issues I have. Do not ask for extra money after a certain time to continue tech support. I do 110% recommend this company. If the system is a little out of your price range they do go on sale. So worth the money!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Britidge Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T02:43:33.000Z",
          "Titre": "I received a faulty DVR box and…",
          "Contenu": "I received a faulty DVR box and everyone I spoke with was polite and professional in assisting me with a replacement DVR box."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gordon",
          "Nb_Reviews": 48,
          "Date": "2023-12-18T19:06:57.000Z",
          "Titre": "Great quality at a fair price",
          "Contenu": "Great prices for quality gear that’s easy to fit and reliable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chad Warner",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T20:07:22.000Z",
          "Titre": "Definitely worth your property protection!",
          "Contenu": "Amazing customer support and service, always helpful if needed, love the systems and notifications! And have sent several people to buy this system! My family and I love Swann security!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Fox Convenience",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T16:29:53.000Z",
          "Titre": "High quality vision",
          "Contenu": "It’s my first time using Swann Security System, Easy to access install with you tube videos . Very clean pictures and night flashing lights too. All to all I love it."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "CHRISTOPHER",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T13:48:51.000Z",
          "Titre": "HAPPY DAYS",
          "Contenu": "Very happy with Swann Security cameras, give me peace of mind when I am home or away  , easy access through Swann app, Great system in every aspect, clear images, alerts , video replays , I’m totally satisfied customer , cheers"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim Wittig",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T14:16:44.000Z",
          "Titre": "Great security",
          "Contenu": "As a woman living alone, it gives me great comfort, knowing that I always know what’s going on around my home"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T00:30:21.000Z",
          "Titre": "Good product",
          "Contenu": "Good product. Easy to use and reliable. Does what it says it will do. Not the most indestructible build quality as they are made out of plastic but I’ve had mine in service for 5 plus years on some of the equipment and it is still as good as it was on day one. I will stick with Swann."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chico Taco",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:23:44.000Z",
          "Titre": "Love it",
          "Contenu": "Love it,   Nothing like watching from your phone. 📞"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maxine  Harris",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T13:13:21.000Z",
          "Titre": "Call Swann it was quick the agent was…",
          "Contenu": "Call Swann it was quick the agent was so good and nice she did everything to help me"
        },
        {
          "Note": 5,
          "Lieu": "PA",
          "Pseudo": "Anita Zetina",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T02:12:17.000Z",
          "Titre": "Happy customer",
          "Contenu": "I am able to see my environment when I am away from home - very clear pictures."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Lockhart",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T14:35:43.000Z",
          "Titre": "Love the camera",
          "Contenu": "Love the camera. Only problem is it sends me 100 notifications if I am in front of thf camera for a minute. How do I fix that? I end up muting the camera"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "John Buckley",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T11:05:51.000Z",
          "Titre": "For the price works very well",
          "Contenu": "Has helped in making an insurance claim against a contractor"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Walter",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T21:09:09.000Z",
          "Titre": "The best camera available in the market…",
          "Contenu": "The best camera available in the market and most importantly they have the best customer services, fast response and effective. I surely recommend this product."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "pwa",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:46:49.000Z",
          "Titre": "Swan security light and camera works…works well",
          "Contenu": "Swan security light and camera works very well. Reliable and usable."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Des",
          "Nb_Reviews": 7,
          "Date": "2023-12-12T06:10:35.000Z",
          "Titre": "This door bell and video unit is great.",
          "Contenu": "This door bell and video unit is great.Works very well and not too difficult to set up.The only thing it needs is a wider view of the person ringing the bell. Needs to have a better view of what is left at the door."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ridy Sid",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T15:25:51.000Z",
          "Titre": "Good quality products and easy to use…",
          "Contenu": "Good quality products and easy to use software. Just wish that smart notifications (notifications with pictures were available on wired devices)"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Brian Hainge",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T08:43:04.000Z",
          "Titre": "Our general disposition is one of…",
          "Contenu": "Our general disposition is one of contentment, although there are instances when we feel otherwise. Despite making adjustments to the settings, we still fail to capture every vehicle movements, which is quite surprising considering the primary reason for installing the cameras."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "JimMac",
          "Nb_Reviews": 28,
          "Date": "2023-12-08T15:46:36.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, worth the cost. Great support network. Looking forward to controlling the weather remotely"
        },
        {
          "Note": 5,
          "Lieu": "ZM",
          "Pseudo": "Kanak Mistry  KM",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T07:48:21.000Z",
          "Titre": "Order dispatched promptly and received…",
          "Contenu": "Order dispatched promptly and received safely"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lee",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T19:39:01.000Z",
          "Titre": "Swann is a reliable product",
          "Contenu": "Swann is a reliable product.  It provides me the comfort of knowing my family is covered in emergencies."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Emily Bishop",
          "Nb_Reviews": 24,
          "Date": "2023-12-10T10:24:44.000Z",
          "Titre": "Had Swann security cameras for…",
          "Contenu": "Had Swann security cameras for years…new set installed recently…..great quality picture and playback"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Hatfield",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T04:44:22.000Z",
          "Titre": "Easy to install",
          "Contenu": "Easy to install. Great features"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Richard",
          "Nb_Reviews": 8,
          "Date": "2023-12-20T04:56:13.000Z",
          "Titre": "I can watch my homes surrounding any…",
          "Contenu": "I can watch my homes surrounding any time 24/7."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David Knight",
          "Nb_Reviews": 23,
          "Date": "2023-12-10T22:29:21.000Z",
          "Titre": "Great reliable security system that…",
          "Contenu": "Great reliable security system that gives you a lot of confidence when not at home."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Akuma Gouiki",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T01:36:17.000Z",
          "Titre": "I like the quality everything works…",
          "Contenu": "I like the quality everything works fine. The only problem that I have is with the sound."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Phillip Hawkins",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T23:56:56.000Z",
          "Titre": "That ahhh feeling",
          "Contenu": "Great to know what’s happening in my back yard carport"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ali Hassan",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T13:57:38.000Z",
          "Titre": "The best system",
          "Contenu": "The best system with that fair price I have ever used"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jason",
          "Nb_Reviews": 7,
          "Date": "2023-12-11T16:42:32.000Z",
          "Titre": "Very efficient on delivery",
          "Contenu": "Very efficient on delivery, I know someone who purchased the same product"
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "John",
          "Nb_Reviews": 8,
          "Date": "2023-12-07T17:13:43.000Z",
          "Titre": "Great system",
          "Contenu": "Four cameras, so it’s quite a basic system but it really does work exceptionally well."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Cosmin Minascurta",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T21:36:53.000Z",
          "Titre": "Really good use of checking things as…",
          "Contenu": "Really good use of checking things as well as helping to verify things which would need to be done"
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Christopher Roberts",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T05:46:24.000Z",
          "Titre": "Reliable only a few small glitches…",
          "Contenu": "Reliable only a few small glitches occasionally and resolution could be improved."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Terry",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T19:11:13.000Z",
          "Titre": "Great product",
          "Contenu": "Great product highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Moncy Kokkan Simon",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T07:05:56.000Z",
          "Titre": "Swan security best security",
          "Contenu": "Swan app helps to check the live footage and video recordings..can access from anywhere"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kashmanchew",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T18:09:17.000Z",
          "Titre": "I am pretty happy with this system",
          "Contenu": "I am pretty happy with this system. It can be corky sometimes… one camera’s siren has never worked…. But over all it’s a great system for the money. Support is easy to get a hold of also"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy Brogdon",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T02:03:52.000Z",
          "Titre": "I love our security cameras",
          "Contenu": "I love our security cameras. I have to reset them once in awhile but they work great."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Htun Htun Oo",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T03:20:00.000Z",
          "Titre": "Camera’s coverage",
          "Contenu": "Camera’s coverage, clearly visible and user friendly. We love it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Cowan Herd Spartan",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T22:25:34.000Z",
          "Titre": "Helpful but…",
          "Contenu": "Easy to install and set up and really appreciate the fact that it doesn’t require a monthly subscription to use but however, it does require to be close for a Wi-Fi signal, and I’ve noticed most days it can be very spotty when detecting movement"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Klarissa E.",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T03:47:31.000Z",
          "Titre": "Reliable and friendly use",
          "Contenu": "Swann Security is friendly use and reliable. I never had any system issue."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Mathew Mccrickard",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T03:15:43.000Z",
          "Titre": "It’s been pretty good wish I had sound…",
          "Contenu": "It’s been pretty good wish I had sound available."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terri Brewer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T01:36:35.000Z",
          "Titre": "I love my Swann security camera my…",
          "Contenu": "I love my Swann security camera my color not showing right Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yasmin Quinteros",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T16:19:03.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, I have been using it for more than 4 years and never had a problem. I recommend this product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tomas figueroa",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T20:21:34.000Z",
          "Titre": "Great product very clear image and easy…",
          "Contenu": "Great product very clear image and easy to manage"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Isenhower",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:48:30.000Z",
          "Titre": "We really like the system and all the…",
          "Contenu": "We really like the system and all the features it has to offer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Onyeka Ifeacho",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T08:20:53.000Z",
          "Titre": "Best camera",
          "Contenu": "Best camera. Been using them for the past one year without issues"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Drew",
          "Nb_Reviews": 3,
          "Date": "2023-12-09T07:31:57.000Z",
          "Titre": "Quality for a great price",
          "Contenu": "Quality for a great price, the picture at night is outstanding"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Edward Yorston",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T11:46:43.000Z",
          "Titre": "Works great no problems at all",
          "Contenu": "Works great no problems at all. It has been installed for 18 months works well with mobile phone app."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cathy",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T21:07:48.000Z",
          "Titre": "I love my ring doorbell",
          "Contenu": "I love my ring doorbell, it’s home away from home."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anuar Ali",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T14:43:39.000Z",
          "Titre": "Take care our home is the most important place in our life",
          "Contenu": "Berry grateful with the camera my friend has a car on front to my house and some trays to stollen"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mihai Naziru",
          "Nb_Reviews": 2,
          "Date": "2023-12-22T05:15:21.000Z",
          "Titre": "Great camera system."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodrigo A",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T16:51:43.000Z",
          "Titre": "No complaints at all",
          "Contenu": "No complaints at all Just perfectly fine views and recording"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Val Quams",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T12:25:04.000Z",
          "Titre": "Prompt detection",
          "Contenu": "The display of was very clear and notifications were very prompt"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Adil",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:14:48.000Z",
          "Titre": "Great service"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Sanju Rawat",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T10:32:04.000Z",
          "Titre": "Clear footage"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T22:40:16.000Z",
          "Titre": "Good app great camera quality"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roland Vela",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T02:59:54.000Z",
          "Titre": "I like to see what’s going on outside…",
          "Contenu": "I like to see what’s going on outside when I get the notification"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Gordon Laidlaw",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T13:55:08.000Z",
          "Titre": "Seems to work very well",
          "Contenu": "Seems to work very well. I would like a continuous record function tho."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John Lovatt",
          "Nb_Reviews": 10,
          "Date": "2023-12-09T12:59:10.000Z",
          "Titre": "Working great",
          "Contenu": "Never had any problem with the set up well recommended"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luu Nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T05:17:43.000Z",
          "Titre": "Love it",
          "Contenu": "Love it! 2 system for my family"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hope Ybarra",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T10:50:26.000Z",
          "Titre": "The devices are the best even with out…",
          "Contenu": "The devices are the best even with out WiFi… Quality, app, and all the above does what I need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Labarre",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T02:09:21.000Z",
          "Titre": "Overall good experience",
          "Contenu": "Easy ordering, clear website, good delivery of the right oroduct"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Megan  Page",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T17:47:44.000Z",
          "Titre": "Amazing",
          "Contenu": "Amazing. I love love Swann. Been using it for 4 years now."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory Baird",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T20:54:04.000Z",
          "Titre": "Quick shipping and great set easy setup…",
          "Contenu": "Quick shipping and great set easy setup and a phone app is a great addition"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Anne Smillie",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T14:16:29.000Z",
          "Titre": "Love my Swann cameras",
          "Contenu": "Love my Swann cameras. Great quality and good response"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JenniferSnowgmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T20:07:37.000Z",
          "Titre": "Awesomely awesome",
          "Contenu": "Awesomely awesome. Perfect couldn’t be better. Awesome"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tommy Beavers",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T01:08:24.000Z",
          "Titre": "Had for years",
          "Contenu": "Had for years. Good cameras. Love the free cloud storage. Was one big reason I bought them."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Gavin Gilsenan",
          "Nb_Reviews": 12,
          "Date": "2023-12-07T19:50:13.000Z",
          "Titre": "Very easy to use",
          "Contenu": "Easy to set up and use very good picture phone app excellent"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Jones",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:53:10.000Z",
          "Titre": "Clear and reliable"
        }
      ]
    }
  ]
}