{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "tailorbrands.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Monique Malabet",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T05:07:23.000Z",
          "Titre": "Not transparent at all on or pricing",
          "Contenu": "Not transparent at all on or pricing. The pricing is slick and confusing. I say go to ZenBusiness at least they tell you all the fees upfront and technically better and much more affordable. Also, they don't respond to any emails at all. I'm still waiting on email responses that I sent over a week ago. When calling customer support none of the reps can answer your questions, it's also a major language barrier everyone is foreign, it's very difficult to understand their english."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "shehroz kapoor",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:54:14.000Z",
          "Titre": "Poor Service (too much costly) and don't show all pricing while signup",
          "Contenu": "They are good in there promotion but not good in there service.They charged the highest price and don't provide the service.They charge $199 / year for agent fee and other agents just charge $50/year also they first show that you can create your LLC in $229 but after paying that they charged the registered agent and EIN separately"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "james becker",
          "Nb_Reviews": 12,
          "Date": "2023-12-20T21:30:57.000Z",
          "Titre": "They play games on the telephone",
          "Contenu": "They play games on the telephone, they have been dishonest, they will not resolve an issue, stay away to save you money and a lot of wasted time, they also send email there are issue, when you call them they state no issue"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sebastian Ayala Viteri",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:24:57.000Z",
          "Titre": "I pay the express service",
          "Contenu": "I pay the express service, and Its been 2 months and they do not process the LLC application. Bad service for sure. Use other llc services."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony Grant",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T13:42:33.000Z",
          "Titre": "This is a scam to steal your money they…",
          "Contenu": "This is a scam to steal your money they stole 277$ from my account and I never authorized this the service is trash they take your money and anything u ask them they will tell u to google it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bota Juma",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T07:28:14.000Z",
          "Titre": "UNAUTHORIZED CHARGES",
          "Contenu": "BE CAREFUL, THEY CHARGED ME EXTRA $388 WITHOUT MY AUTHORIZATION. THE WORST SERVICE EVER!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Gordon",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T20:12:58.000Z",
          "Titre": "Do not pay this company money",
          "Contenu": "Do not pay this company money - they charge $99-$199 for things you could simply fill out yourself in 30 minutes. It’s not completely hands off, you still have to fill out your information on tailor brands and all they do is pass it along and charge you a fee. You can fill out the official government paperwork yourself in the same amount of time you fill our Tailor Brands questions. Waste of money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Valerie Marshall",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T18:02:24.000Z",
          "Titre": "DO NOT USE they lie and borderline on harass you",
          "Contenu": "They are shady as all get out. They told me they could assist with proper filing and they couldn't. They can't answer these questions legally. I requested a refund since they never filed my LLC paperwork and never did anything and they refuse to do anything other than half a refund and store credit. I told them that I don't want store credit and they are refusing to issue a full refund. I also had to tell them 4 times to stop calling me about filing my LLC after I had stated I don't want this service and requested a refund. I ended up going through my bank and am not even sure I will get my money back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Knox",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T06:25:14.000Z",
          "Titre": "Ending up creating more work for me",
          "Contenu": "Jose was a representative that called me when I was exploring launching my LLC and tried to walk me through things but even from his cautious and friendly tone I could tell they must have trust issues from customers... The first issue I found is that a number of things priced are automatically double the actual cost listed, because in their fine print they say that there are 2 charges of the same exact amount that will happen for more than one service. Expect to pay more but get less value anticipated. The website builder they have looks cool, but so far is buggy and I can't get it to save my changes so I've wasted 30-40 minutes working on it so far and then having to go in and redo my work. I submitted a website ticket."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "kamran hassan",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T10:19:18.000Z",
          "Titre": "useless service and look like scammer",
          "Contenu": "I dod not wanted to write this review even though they have terribly scammed me in a way it's very diplomatic, they called me yesterday the person was great actor he was so nice and was answering my all questions untill i have not paid for their service one that done he keep saying i am not your legal advisor even though i was not asking their advice i was asking information to know if we are on same page. when i forced them he started to say give me some time i hold you then let you know ge was doing that for my every question so i get tried and try to proceed quickly. it seems like they are not gonna do everything they just hire someone else who do their stuff.stay away from them I have filled refund they are not even caring to reply. i have 2 invoices i am paid for one is 5397075 (334 usd) other is 5397096 (150 usd)"
        },
        {
          "Note": 1,
          "Lieu": "MA",
          "Pseudo": "omar cherkaoui",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T03:50:12.000Z",
          "Titre": "Urgent Refund Request for Unavailable Services - Pin Code 54735685",
          "Contenu": "I am writing to express my disappointment after discovering that the LLC creation and U.S. address with mail forwarding service I was expecting from Tailor Brands are not available. I registered under the belief that these services were offered, only to find out they are not included. My Pin Code is 54735685.Since I cannot use the service I paid for, I urgently request a refund. I urge the Tailor Brands support team to address this request quickly and efficiently to ensure customer satisfaction and maintain the company’s reputation.I look forward to your prompt response and a satisfactory resolution to this matter. Thank you for your understanding and cooperation.Omar Cherkaoui"
        },
        {
          "Note": 1,
          "Lieu": "PE",
          "Pseudo": "Waikiki20000 Waikiki20000",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T18:10:32.000Z",
          "Titre": "Tailor Brands do all wrong with my EIN",
          "Contenu": "Tailor Brands do all wrong with my EIN, this company wants to give me back my money but I must spend that money with them in other services. The correct is to give back money to me and I can get other company to do the job that they were ubable to do, so they try to cheat again. If this happend to me, then probably they will do the same to other people.Tailor Brands writes soemthing NOT TRUE the money is NOT in my bank account. the money is back in the account that I have inside their website as credit to spend with them in other services ...I want my money back in my bank account You lie to me and the public"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marlon Martin",
          "Nb_Reviews": 3,
          "Date": "2023-12-03T21:08:09.000Z",
          "Titre": "I paid $400 of my cash to Tailor Brands…",
          "Contenu": "I paid $400 of my cash to Tailor Brands for my \"LLC\" as well as my vehicle / motor  \"Authority\" license  I have a Us Dot Number I need my Mc ( motor carrier) numbers , mc (motor carrier) numbers only !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Megahn Rineman",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T13:12:20.000Z",
          "Titre": "They never did what they were supposed…",
          "Contenu": "They never did what they were supposed to and after a year I am still going back and forth with discontinuing my account. You can do half the stuff they offer for free. Wish I knew this prior to the start of my business that never actually started that they keep charging me for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Miriam Hejazi",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T15:48:50.000Z",
          "Titre": "WORST EXPERIENCE EVER",
          "Contenu": "Honestly, where do I start? I put my phone number in for a quote and not even two seconds later someone called me and was trying to upsell me a million things. On top of that she wouldn’t let me hang up even though I stated CLEARLY 4-5 times that I was not interested. Then I email the company and they have nothing to say except we’re sorry. BUT here’s the kicker. Right after the email I sent where I was discussing what I did not like specifically about them calling me immediately; they send me a survey request - it says on the email: “  I was happy to see that you had a good experience with us :)” are you serious? Does anyone know what’s going on in that company? Outrageous pricing, bad customer service, no internal communications; completely just ridiculous to be honest. Do not use this company unless you want to be bombarded by them and never get a moment of peace. I asked them TWICE to remove me from all emails and they notified me they did and then they sent me an email AGAIN about my ‘great experience’. Thank you for saving me the hassle of emailing again. I hope others find this review helpful."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dissatisfied Customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T22:47:34.000Z",
          "Titre": "They are constantly trying to upsell…",
          "Contenu": "They are constantly trying to upsell you as you try to set up your company. Even after paying them, they send you emails daily trying to get you to pay them more for information you can get for free if you just put a little work into it. My biggest gripe is that I let them know that I didn't plan on doing business for a few months and was still convinced to sign up even though this costs me a minimum of $800 in tax liabilities for having an LLC one month (December) of the year. I found this out and called the company back in less than an hour. They said they would hold off sending in my application, but then I received a notification in the early AM that my application was sent in against my wishes. I would not recommend this company to a friend or an enemy. Look into doing this yourself and save lots of money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephanie  Mordica",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T15:56:51.000Z",
          "Titre": "I signed up for Taylor brand which I…",
          "Contenu": "I signed up for Taylor brand which I will be canceling tomorrow.I went with the package that was 129 because that’s all my business needed. I had my EIN number well, when I woke up the next morning, Taylor Brand had charge my account again for 199. If you pull the call I have declined everything not only one but several times with him trying to push items on me. Everything that I did not mean please be careful allow them access to your account."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "lisa- grated",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T11:42:59.000Z",
          "Titre": "I actually paid for all the upgrades and nothing works",
          "Contenu": "I keep paying for all these upgrades, but can't access the features that come with it. I can't use automated emails in my store because it tells me to upgrade to advance store. I can't include subscriptions because it keeps telling me to upgrade to advance store. I have spent so much money with y'all and still can't use these features. I'm starting to feel scammed because absolutely nothing is working. I can't even publish my site when I'm ready to. I'm pissed and need someone on the troubleshooting and technology side to fix whatever the issue is. It's been well over a year that i have been emailing about this and they still can't fix it. I have take to support for over a year now. Please beware of this company. It's still happening today. Support is a joke and they won't solve anything"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jammal w johnson",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T22:26:28.000Z",
          "Titre": "First of all I paid for something that…",
          "Contenu": "First of all I paid for something that I didn't even receive. I paid for my stuff to be processed in 3 days and apparently I'm still waiting to get the information I need to know something like 25 days later. You applied for a licenses and permits for my business but yet you can't tell me which permits you applied for? Even though I paid for a 3-day processing. To be honest this is more of a headache and a hassle then help. And when I asked for them information I was told we have to wait till it processes and this was 20 days."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "R. L. Gregory",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T02:58:22.000Z",
          "Titre": "Marian was wrong",
          "Contenu": "I was filling out the online forums while I was on a phone call.  Marian called me 3 times, THREE times back to back to back.  I finally answered and asked why they were calling me 3 times back to back while I was on a work call.  I got another work call on the phone with her and asked her to call me back in 5 minutes.  No call ever came.  I called them 2 hours later, they said she was on the phone and would call me back in 10 minutes.  No call ever came, I called back an hour later, they told me AGAIN she was on the phone and would call back in 10 minutes.  No call ever came.  I called back an hour or two after that and wouldn't you know it she is unavailable to take my call and I would have to call the customer service line the next day during regular business hours.  Marian was wrong for calling me 3 times back to back to back and I let her know she was wrong for it and now she's too petty to talk to me again.  If I can do anything about it tomorrow on the phone I want a full refund to give my business elsewhere.  Seriously who calls someone 3 times back to back to back and expects them to be happy about it?  Sounds like spiteful children on the phone when I call to me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Taylor J",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T21:22:22.000Z",
          "Titre": "Scammers, stay far away",
          "Contenu": "These people are scammers and do not care about you or your business. STAY FAR AWAY. I was naive in believing they were being helpful when they called. THEY ARE JUST TRYING TO SELL YOU WITH NO REAL VALUE PROVIDED. Most of their services can be done yourself for free. Don’t be like me and please do your due diligence in knowing what it takes to set up a business. Most you should have to pay is the state filing fee. You can find operating agreements and articles of organization online. I paid for an EIN service and they still have not gotten back to me after almost a week.  The process only takes 2 minutes. I ended up having to do it myself yet they refuse to give a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Monique",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T23:01:58.000Z",
          "Titre": "False charges to your account",
          "Contenu": "In 2021 I had them make a website for my business which they didn’t even do. And I couldn’t get in contact with them. I paid thousands to them and I never got a penny back. They have been charging my account hundreds of dollars a month and still won’t completely respond to me. It’s 2023 almost 2024 and they are still charging my account. Not the bank is involved and I’m sure a law suit is coming after. They are scam artist."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nis",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T19:45:03.000Z",
          "Titre": "Do not do business with these people",
          "Contenu": "Do not do business with these people, they are scammers, the only thing they do is take money from people, they make misleading advertisements for offers which are not true. They told me that the cost for my LLC and EIN number would only be 199 and every day they charge me more money. Until now they have charged me more than 2,000 dollars. I told them to return my money and they do not want to return my money without giving me the service completely. Don't fall for these people."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Melissa",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T00:14:01.000Z",
          "Titre": "Product utter garbage - refusing to refund",
          "Contenu": "While the logo design piece was ok, I ordered business cards from them and they are complete crap and unusable, and they are refusing to give me a full refund. They are cut wrong, and the overlay is peeling away right out of the box. DO NOT USE THEM for anything other than logo creation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julie Eiler",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T18:57:09.000Z",
          "Titre": "This is a scam",
          "Contenu": "This is a scam!  I paid $99.00 for a business license report that was incorrect and after contacting customer service several times this still has not been resolved.  Last night I received emails saying all of the subscriptions I paid (way too much) for had been cancelled, and this morning I can't get in to their website.  I reached out to customer support through chat and all they were able to tell me is that someone would get back to me.  I am in the process of disputing all of the charges which total up to around $1,400.00."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sarah Schull",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T19:53:32.000Z",
          "Titre": "Don't give them your phone number they'll spam you",
          "Contenu": "Went through the steps with both LegalZoom and Tailor Brands. Each site wants to add on costs which makes sense, but the pricing is crazy and renews annually. I decided to hold on the process and source opinions from friends. However it's been less than an hour and I've already been called and pestered by TWO different CSA reps from Tailor Brands. They call BACK TO BACK and text you. That's not customer service, that's sales tactic calling that gives me the ick. I screened the calls and told me to remove my number/stop calling but they won't. It's giving \"we really want your money\"."
        },
        {
          "Note": 1,
          "Lieu": "MY",
          "Pseudo": "Robert Axryd",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T04:18:39.000Z",
          "Titre": "This is a scam company",
          "Contenu": "This is a scam company. Do not under any circumstances give them your credit card details. They will keep adding charges without reason or authorisation."
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "Noel",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T15:51:24.000Z",
          "Titre": "COMPLETE SCAM / AVOID!",
          "Contenu": "COMPLETE SCAM / AVOID!Don't trust them to establish your LLC, they are a clever and complete scam on their website and especially on the phone.They'll call you straight after you start your application by \"helping\" you but they actually rip off your credit card without your consent. I've never experienced such a nasty scam before. Here's how to make it yourself for much cheaper:\"LLC\" registration: they're using another agent: Registered Agent Solutions Inc, it costs only 99$ if you do it directly with them. TB charges you 298$ for that... \"EIN\": you can do that online for free: IRS website (tailorbrands will just forward you an incomplete pre-filled PDF file, which you'll have to fax yourself anyway, and they'll make you pay 300$... just for the SS-4 form which you can download for free on IRS!!\"License guidance\"; completely useless, approx 99$\"Legal documents\" 119$ just a few Word file templates which you can get for free after 1min search online (service agreement, non-compete agreement, marketing agreement etc.)And still they'll try to sell you a tax compliant scheme for min 600$.So basically if you do it yourself it might cost around 99$. They charged me 800+ and I'm so upset getting scammed by them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donald Simpkins",
          "Nb_Reviews": 3,
          "Date": "2023-12-04T08:19:19.000Z",
          "Titre": "Stay away from this company",
          "Contenu": "As I was filling out the information they were requesting, they called me, acting very anxious.  My bank declined to pay them.  I find out later they tried to debit my card 15X. I truly believe they are scammers."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Alistair J McMurdo",
          "Nb_Reviews": 6,
          "Date": "2023-11-06T10:43:34.000Z",
          "Titre": "Print colours not accurate",
          "Contenu": "Ordered business cards and they came back with the grey panel much lighter than the images shown online, there was almost no definition. After raising this with TB they advised I should order a “white card as the ones supplied are marginally cream” Tried to do this but there was no white option when trying to reorder. Contacted TB again and they advise that “it wasn’t an option” but they could make my logo darker to show up. 1) You don’t mess around with your corporate colours 2) the logo was fine as it was 3) the logo wasn’t on the grey area I was complaining about. They refunded the cost as a gesture which didn’t solve my problem. I’m now reluctant to order any more marketing material in case the colours are not accurate. * It is worth noting the adviser did their very best and was just relaying back what they were being told. It’s the company to blame. Disappointed customer."
        },
        {
          "Note": 1,
          "Lieu": "PE",
          "Pseudo": "Waikiki20000 Waikiki20000",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T14:31:45.000Z",
          "Titre": "I applied for a CCL and EIN",
          "Contenu": "I applied for a CCL and EIN and when I supposed to getb my EIN  number they told I must call myself. I called this company and they told ; is your lawyer to dom that etc...all wrong VERY BAD"
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Nicky Kruger",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T10:13:12.000Z",
          "Titre": "I would not recommend using them for an…",
          "Contenu": "I would not recommend using them for an international company.With every email that I sent trying to figure out how to get my EIN, they just reply with \"sorry for the inconvenience\" they can't assist me. I spent so much money hoping that their service would give me the opportunity to register a LLC without hassle but I would have been better off registering for a local company.So disappointed and regret the money that I lost."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mathew  Adetoro",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T07:17:24.000Z",
          "Titre": "He was not professional at all,,before…",
          "Contenu": "He was not professional at all,,before we start the LLC,,I ask him how much am I to spend on the LLC and he told me all I need is 800 to finish everything but this man make sure I spend over 1000$ on the process and still keep going not until I stop him and told him I ask you a direct question before we start and you end up with all this additional fee and he his about his how to get money out of me I really don’t like his service at all because my friend that introduced me to tailor brand only spend 800$ but he keep going going going..am a new business owner and I have plan for what I want to spend..I was really frustrated by him."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Remi Carlioz",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:10:31.000Z",
          "Titre": "What a mess, and an expensive one",
          "Contenu": "(1) said they would register my LLC and didn't because of a 'technical issue'(2) said they would credit my account and didn't(3) I paid $334, then they made me pay two times $99 for the same service (EIN) for nothing so far,(4) and I still don't have an LLC, or credit on my account."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Tom Reed",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T19:15:19.000Z",
          "Titre": "Pathetic customer care",
          "Contenu": "I have emailed and called their customer support team. I have a working business online store with these people my case number is 2074891 my store has been closed for maintenance for no reason since Friday 03.11.23 and it’s still down. This has cost me over £1000 of sales and untold amount of brand damage. I have to wait over a day for a reply from any of your team. I have upgraded my account 3 months early spending £163 and the I call their customer service line to try and get it resolved to no prevail. Instead a £70 phone bill as their call cents is in America. I pay you people for website security and you can fix my store issue that you have caused in less that 2 days!? The customer service and support is atrocious."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Jesselyne Douglas Barberia",
          "Nb_Reviews": 2,
          "Date": "2023-10-13T08:18:52.000Z",
          "Titre": "Very disappointed. Careful with the \"trial\"",
          "Contenu": "I am very disappointed. I found a discount on my account of 60 euros and when I checked I realized that it has been coming for quite some time. I used this service many years ago as a trial and after that I never received a notification that I would be charged annually. It's something I wouldn't recommend to anyone because it really feels like a scam when out of nowhere they charge you without telling you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alycia Cordova",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T21:16:44.000Z",
          "Titre": "I should have submitted my LLC…",
          "Contenu": "I should have submitted my LLC application directly to the state myself. The hassle of getting a hold of someone who knows what is going on with your application is annoying. I purchased the Elite package but turns out that everything that is “included” comes with an additional fee to actually use. Also, the logo options are not good. Check out Canva instead."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "de cee",
          "Nb_Reviews": 15,
          "Date": "2023-10-13T17:59:22.000Z",
          "Titre": "Won't stop contacting me",
          "Contenu": "I have been shopping around for an LLC I went on Taylor brands online and I couldn't finish the app because I didn't have money in my account well ever since then they have been texting me six times a day a few times was past midnight and they have been emailing me one after the other even after I asked them to stop. So be aware if you go on their site they are going to be relentless at trying to get you to sign up. Don't sign up with them you will regret it"
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Juan",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T15:22:23.000Z",
          "Titre": "They charge much more than the advertised price",
          "Contenu": "I ordered a one month access that costed around 7€ for downloading a logo. It was clearly mentioned that it was only for one month and that it was a one time payment of 7€. When looking at my bank account, I saw they charged me 59,88€. I received an email with the receipt. These methods are not honest, I do not recommend this site."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris Daigle",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T17:38:33.000Z",
          "Titre": "Go anywhere else to seek help",
          "Contenu": "Go anywhere else to seek help- or do it yourself! It’s easy to set up an LLC in most states. Figured I’d be lazy and save time paying someone else to do it for me but over two weeks later I’m still waiting on my EIN which should take 24-48hours. Always making an attempt to be upsold on countless services you can get free onlineAnd did I mention the horrible customer service? After being told my EIN was denied because I’m not a US citizen (I am) I promptly started emailing to get this resolved. With a 24 hour response guarantee I figured we would get this resolved asap. Over a week later and a few more emails, still  waiting for a reply!still hasn’t been sent to the state so I requested my money back. Denied. ‘Sorry we can’t do that once processed to the state’"
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Val Simonini Yoshida",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T16:57:49.000Z",
          "Titre": "It´s difficult to communicate in…",
          "Contenu": "It´s difficult to communicate in english, would be much easier in portuguese. Also I didn´like that I paid the  domain through Tailor Brands, but I can´t use my email because I have Google email and my Premium Tailor Brand subscription has expired. And can I use my site or without premium subscription I can´t? Sorry about my english..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dee",
          "Nb_Reviews": 3,
          "Date": "2023-10-25T13:12:41.000Z",
          "Titre": "I would never recommend this…",
          "Contenu": "I would never recommend this organization to anyone. Try reaching customer service and you get someone reading from a script to you.  Tried cancelling my accounts and services, only to not have it done and my charge cards being charged."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Raheem",
          "Nb_Reviews": 3,
          "Date": "2023-10-22T18:30:00.000Z",
          "Titre": "Worst Experience Ever",
          "Contenu": "Do not waste your time. I canceled my subscription and these crooks continued to charge me. I placed this matter in the hands of my credit card company. Buyers beware!!!!I placed this entire fraudulent matter in the place of my credit card company. That's the only time Tailor \"crook\" Brands decided to contact me. My email and everything is in your database so go play with somebody else. The facts are the facts: Tailor Brands is a fraud so buyers beware!"
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Lada",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T09:52:14.000Z",
          "Titre": "This company is a SCAM",
          "Contenu": "This company is a SCAM. I purchased an LLC formation from them. Immediately after the purchase I received a sales call from them during which they aggressively tried to upsell me for more products. I DID NOT authorize a transaction, yet, they charged my PayPal. When I noticed that I immediately requested a full refund - less than an hour from the initial purchase. They refused to refund me, claiming that instead they can provide a store credit. I filed a complaint with PayPal and will go forward and publish articles about the scam activities of this company"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Adam Jackson",
          "Nb_Reviews": 3,
          "Date": "2023-09-27T12:26:52.000Z",
          "Titre": "After a year have been charged for no reaosn.",
          "Contenu": "After a year, with no use of their services and no agreement to renew next year, i have randomly charged me for something that i can't even figure out what it is for.Checked through my account to see if they had access to any payment information and there is nothing there.Have sent a message to them last week and have heard nothing back.Avoid."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T18:33:17.000Z",
          "Titre": "Poor unsubscription experience",
          "Contenu": "I would really recommend being very careful managing your subscription with this company. They make it quite difficult to unsubscribe. I found out that my subscription was still on after more than 3 months of not using the app at all. Despite the fact that I did not even log in during all those months, they would refuse to refund the money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Austin Foreman",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T14:42:25.000Z",
          "Titre": "Imagine being ripped off by a company…",
          "Contenu": "Imagine being ripped off by a company who promotes helping small businesses! Welcome to Tailor Brands! Customer service, none. Honestly about products, none. Support for small business owners, none. Pay $300 for advice that isn’t helpful, absolutely have that at wonderful tailor brands. Experience your first time being conned out of money by Tailor Brands! Enjoy!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lucy Morningstar",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T06:28:53.000Z",
          "Titre": "No one has contacted me yet",
          "Contenu": "No one has contacted me yet, I never said I was happy, try sending this once you all have contacted me. Till then it’s 1Star as it’s been days with no oneContacting me and you all still charging my card even more money. It’s like your system is glitching. You all charged me $240+ dollars and still trying multiple times a day to charge me another $73 or $74 dollars for what?? I don’t know cause I was only to be charged $37 to start with not $240+"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T19:42:39.000Z",
          "Titre": "Their fast and easy claims were false",
          "Contenu": "Their fast and easy claims were false. I used Tailor Brands to create an LLC in Delaware and do my EIN with expedited processing. Their process took weeks longer than if I were to do it myself directly. They have no effective means of escalation. Most of their phone extensions tell you boilerplate information and then hang up. Chat is a message only just like email so no live agents. After almost 4 weeks I still did not get what I paid for. They offer a horrible experience and can't imagine a worse company to help."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Taylor Parkinson",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T19:40:12.000Z",
          "Titre": "If I could give 0 stars I would",
          "Contenu": "If I could give 0 stars I would. This is how much I am disappointed with this company. They literally upsell you on everything. They put all the charges in fine print and they basically complete your LLC so quickly before you you can even realize there is a yearly cost to even have a LLC with them plus a yearly cost for the registered agent that I didn’t even choose yes too. Everything they charge you for. This company is a complete scam. I feel bamboozled and they won’t refund me for anything. I 100% don’t recommend. There are many companies that create LLC’s w/o a yearly cost."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Boyang Li",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T15:35:30.000Z",
          "Titre": "I purchased the Business License…",
          "Contenu": "I purchased the Business License Service (which is a joke) under the wrong information that was provided by the sales team.The sales team told me, this Business License service will help to file all the necessary licenses for me. But this service gives me a useless report.I requested full-refund for the service. But now, they are not willing to refund my money.I tried to contact the support team, about 10 plus time. the support teams were just copy and paste messages from template."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Unhappy",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T17:54:24.000Z",
          "Titre": "Terrible Company",
          "Contenu": "Don't know why you sent me an email saying you were happy I had a good experience.  I am going on a week and a half and none of your people can figure out what is wrong with my LLC dashboard.  Basic reading and comprehension is lacking throughout this company and they are not at all helpful.  Want me to do the work and give them personal information that is not needed to fix the issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Miz Uniq",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T18:42:22.000Z",
          "Titre": "I requested a full refund",
          "Contenu": "I requested a full refund. Sloppy company action have delayed my business. I had to figure it out on my own. Now,  you have my credit cards tied up as well as holding my domain name hostage because I no longer want to do business with you. Please process my full refund and release my domain name ASAP So I am not  forced to publicize my horrible experience  with your company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kayra P",
          "Nb_Reviews": 2,
          "Date": "2023-08-02T13:01:28.000Z",
          "Titre": "I would not recommend letting an…",
          "Contenu": "I would not recommend letting an “expert” build your website for the price offered. The feedback I provided after each draft was not being implemented in its entirety. Now that the experts have completed the website, there is so much work I am deleting/editing. The finished website looked a mess. There were inconsistencies everywhere. Definitely not as easy as just uploading your content or products after they’ve created the site. The only pro to this is having someone create a foundation for you to edit, but I’m sure anyone could just figure that out on their own and avoid the frustration."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jessica Fain",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T22:29:08.000Z",
          "Titre": "A nightmare I never expected",
          "Contenu": "This had literally been the absolute worst experience I have ever had spending my money on something I have been trying to build. I have had little to zero help on the website I have emailed them multiple times for information on why every time I have purchased something from their website it won’t download to any of my devices. Why I can’t get copies of anything I have purchased yet he keeps prompting me to purchase something something else from their site. I have been working to get the 600$ worth of products I have spent on this site downloaded to me yet NOT a SINGLE answer to any of the questions that I have or why I haven’t received what I purchased. This site has literally been a nightmare to my mental and my bank account. I don’t know what to do."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donald Cox",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T22:04:22.000Z",
          "Titre": "Waste of my time and money, and now more of my time.",
          "Contenu": "I hired them to set up to register a business for me and they happily took money of $299.  I paid for the expedited process and then after two weeks of not hearing from Tailorbrands, I began to ask what was going on.  I was told oh, \"It's in process\" on several calls and emails.  After two more weeks, I broke down and called the state to find out what the problem was.  The state had actually denied my application before I ever called Tailorbrands the first time to find out what the hold-up was.  I ended up spending several hours writing emails, waiting on hold, speaking with representatives, being told someone would call me back, and when they did call me back they said that someone else was looking into the matter for me and would call me... I never received a call back explanation, it was always pass the hot potato.  Now that I had called the state and found out my name was too close to my previous business name I knew why there was a hold up.  It actually took them a while to figure it out and it wasn't until I started asking for a refund did they bother to come up with an excuse to state some policy that they cannot give me my money back.  No one in their customer service department has any authority to work with the customers, and their managers must have been instructed to not work with the customers and to delay or pass off any responsibility to billing which has no number per the managers.  The real kicker for me was when I was told \"I want to make sure that your concern is taken care of, so I've sent your email to our relevant team for a closer look and they'll be in touch with you soon to help you out.\"  What the Heck-Fire is a \"Relevant Team\"?  Let that sink in.If your business set up has any complications getting set up, Good Luck."
        },
        {
          "Note": 1,
          "Lieu": "RS",
          "Pseudo": "Marina Maksimovic",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T09:40:05.000Z",
          "Titre": "WARNING! Do not work with Tailor Brands.",
          "Contenu": "I rarely write reviews, but when I do, it is usually when I am extremely pleased with the services. However, this time I feel the need to warn people so that they don't encounter the same problem I did. Tailor Brands is a company that makes many promises and uses a lot of words, but when it comes to taking action, they respond with the statement 'we are not able to give you legal advice.' Essentially, they become unresponsive when you need help. However, they will persistently call you to sell you additional products that they claim you absolutely need. It is important to note that their prices are competitive. So, when you see their appealing price of only $300 for opening your LLC, be prepared to add another $400 to it. I have requested a full refund because they charged me for providing help with obtaining my EIN number, but no one actually assisted me. As a result, it is impossible for me to have an LLC without an EIN. On top of all this, it has been over a month, and I have been patient. This is a scam! Additionally, when paying for their services, be cautious of discounted prices. You will ultimately be charged the full price. For example, when I purchased the EIN service, which was supposed to cost $50, I was surprised to be charged $100."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gabriel Harris",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T15:55:08.000Z",
          "Titre": "Scam",
          "Contenu": ". I’ve been waiting to be approved for over a month just to find out the Secretary of State has approved my LLC.  They over charge for “expedited processing” and it still took me twice as long as it would if I filed myself. And I still don’t have my EIN number. Save yourself the trouble and go through secretary of states processing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Domingos Fernandes",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T18:23:05.000Z",
          "Titre": "Tailor Brands is a Corrupt Company",
          "Contenu": "Tailor Brands is a Corrupt CompanyThey have many liars and bad employees that lie and try to exploit clients to take away your money.They are so despicable.I try to use their services to register an LLC within seconds after I submitted my info someone used my card info and made additional purchases without my consent. It is such a hard time to try to contact the company and request a refund. They give you all kinds of excuses to get out of the door; their supervisor is never available. Very abusive... In America!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Halloween lover Khadra",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T15:28:57.000Z",
          "Titre": "Actual scam artist",
          "Contenu": "Actual scam artist. Stay away from this company. Back in March of 2022, I realized a charge hit my account from Tailor Brands I wasn't expecting. I requested a refund and cancelation of the service ,they said no I paid $47.88 for basic next day after I canceled it,  found charges on my PayPal and other credit card not saved, in Tailor Brand account even , be careful don't use this service."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "James Bulmer",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T22:38:58.000Z",
          "Titre": "Terminated account was hibernating and moved to activate billing",
          "Contenu": "I thought my account was terminated but instead they marked it has hibernation. For no reason it was moved into active billing and run up charges for a product I was not using. When I discovered this problem, it took me three attempts to terminate the account. This was due to the use of miss leading buttons directing you to keep the account, and required feedback forms. Think twice before using this service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bill Shirley",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T15:56:00.000Z",
          "Titre": "Customer service is non existent",
          "Contenu": "Customer service is non existent. All I received was stock emails urging my patience, blaming me, or just wait while I look into this. Calling was even worse. I suggest Tailor Brands needs to hire and train some real customer service personnel not continue to use a call center that cannot help in any way."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "balachander nandagopal",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T16:38:31.000Z",
          "Titre": "Worst customer service",
          "Contenu": "Please look for another company for any of your LLC or EIN services. I asked for delay in the service and there was no proper communication. I disputed part of the money for the LLC service for the credit card provider since I did not wanted the service. they removed my access to the site and never provided access to my documents."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Never Mind",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T14:44:11.000Z",
          "Titre": "Do not use this company",
          "Contenu": "Do not use this company, they are just there to grab your money, no physical presence or office, just a call center in India. Once they get your money, they leave you handing, do not register your LLC with them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-07-07T19:54:06.000Z",
          "Titre": "Bad Customer Service",
          "Contenu": "Bad Customer ServiceAfter spending lots of money with them, they formed my business but did not provide an EIN number even though I paid $99 for one. Useless customer support responses after reaching out every day 5 times a day. Horrible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Traeger Grill Buyer",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T19:40:11.000Z",
          "Titre": "No refunds even within one hour of…",
          "Contenu": "No refunds even within one hour of purchase. Expect immediate calls from overseas, upselling, pressuring, saying you need a \"business forms\" package without questioning if you really need them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T17:48:02.000Z",
          "Titre": "Tailor Brands may scam you",
          "Contenu": "Tailor Brands will scam you out of money with additional upsells, some from them and some from partners, and after you purchase it you will not get any value. They will hold you money hostage and make you accept their rules or you won't get money back. The simple process of 3 days may take you months, don't risk it."
        },
        {
          "Note": 1,
          "Lieu": "CO",
          "Pseudo": "Mario Gutierrez",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T18:49:12.000Z",
          "Titre": "Crooks!",
          "Contenu": "After making the purchase to form an LLC, it turns out that everything is handled as an add-on, so from the $199 plan they offer, you end up paying more than $1000 in add-ons just to finally have your company registered and with an EIN number, it's seriously dishonest advertising! Now I'm asking for a full refund of my money and they want to give me store credit, it's been 2 emails with the same message. I DON'T WANT TO DO BUSINESS WITH YOU, JUST ISSUE THE REFUND!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ELSA ADVANCED SCIENTIFIC",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T23:07:49.000Z",
          "Titre": "I wish there was an option to get you…",
          "Contenu": "I wish there was an option to get you ZERO star!!!Your services are Awful and it is my worst experience ever in my entire life to see the company and services Awful like this, I want refund for all I have paid or get my issue resolved quickly!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom Walsh Music",
          "Nb_Reviews": 2,
          "Date": "2023-06-19T17:39:02.000Z",
          "Titre": "The logo was nice but they trick you…",
          "Contenu": "The logo was nice but they trick you into ongoing residual charges .  I’ll be canceling my contract. Then… they use language that says … i cant post on social media if i cancel? They might have rights on their logo, but not on my business or life.  So if they want to deal with the two attorneys in my family and the attorney general?,,"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jessica Owthwaite",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T07:47:18.000Z",
          "Titre": "BUYER BEWARE",
          "Contenu": "BUYER BEWARE I have had the most FRUSTRATING experience dealing with this company. I paid $1,000.00 to give them the full chance to streamline my business and it was THE BIGGEST WASTE OF TIME AND MONEY. I couldn’t even access business email and this has been a series of ongoing problems since APRIL 10- present - which is June 14th. I am having physical reactions due to the stress of dealing with this joke of a company."
        },
        {
          "Note": 1,
          "Lieu": "SN",
          "Pseudo": "fatoumata wade",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T00:29:42.000Z",
          "Titre": "Everything went wrong",
          "Contenu": "Everything went wrong. Poor service support. Always asking the same questions but never get an answer. Subscribed for the standard plan and was charged 19.99$ but still, my subscription was cancelled before its term. I asked for an explanation but i did not get any. I will never recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew Gillian",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T00:44:51.000Z",
          "Titre": "SCAM!",
          "Contenu": "I was on the phone with someone who claimed their name was “Nick” I tried to buy the zero dollar plan with just the state fee for $128 after I press submit you get a call asking for you to buy more services, and it will not go through unless you buy more services. Don’t SPEND ANY MONEY. ITS A SCAM"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elijah Callands",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T01:03:22.000Z",
          "Titre": "I am without words",
          "Contenu": "Dates July 8th, 2023. I am without words, I've paid over 450 dollars in September. Two separate payments were made. The 1st payment was for the logo and the 2nd of 374 dollars was for llc set up.  This company even referred me to Next insurance after I paid for my setup. Turns out, the company still has insurance, but my llc is nonexistent, according to Tailor Brands there's not even a record of my payment.   So I've been thinking this whole time my company is legit and although i have insurance, Wortman compensation and guess what - it's not an LLC, at all. I mean how could I gain the referral to Next insurance if my initial setup for the llc was not paid. This is the worst, and the background laughter, wow"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Lisi",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T21:40:04.000Z",
          "Titre": "SCAM SCAM SCAM.... Tailor Brands needs to be sued!",
          "Contenu": "I was charged for a service their website couldn't perform and when I asked for a refund, they offered a \"store credit.\" Tailor Brands charges you up front and when they can't deliver, they refuse to refund you.They also tried a \"retaliatory\" charge on my card which ended up closing my card out due to fraud.This company is an absolute SCAM!"
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Codemodifiers",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T07:11:38.000Z",
          "Titre": "Third class service I got",
          "Contenu": "Third class service I got. What they do is they will ask you for the initial amount and later on they will charge more and more they will ask for this amount once you paid. The initial one was such a fraud I lost my 330 USD after that 330 USD They ask me to pay more than 200 and then ask me to pay more 99 they really suck and even don't give my money back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joshua Cheatwood",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T20:28:09.000Z",
          "Titre": "I appreciate the company initiating my…",
          "Contenu": "I appreciate the company initiating my LLC, but they have since been predatory and over charging for services they are no longer needed for. I will be requesting for a refund of recent charges. It is obvious from other responses that their reply is the same. Bogus company, they don’t offer refunds upon cancellation of service and all they want to do is threaten what you will lose…..honestly, losing is absolutely nothing but your money! STAY AWAY! The services offered can be done individually and for so much less money without predatory responses from this company!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Joe Pearson",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T01:13:12.000Z",
          "Titre": "Point proven",
          "Contenu": "Point proven, just rated how bad your support is and just received a email saying how happy you are with the review and glad you can help.Shocking and looking forward to changing to another company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lane Ramey",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T16:49:24.000Z",
          "Titre": "SCAM",
          "Contenu": "They do not include the things they say they offer. I paid $359 for the elite plan and it did not include anything. Everything came at an extra cost. $359 did not include licensing (Which they used scare tactics to make me buy into the licensing.) It did not include an EIN. It did not include a business email, website, domain, digital business cards, etc. I asked for a refund which is allowed by their own website. I was transfered 3 times and each time they tried to keep my money. The last one said they would credit the money back to my tailor brands account instead of my card. SCAM website. Contacting my bank to file a dispute and possibly contacting a lawyer about false advertising. -100 out of 10 experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rasheed Aziz",
          "Nb_Reviews": 5,
          "Date": "2023-09-27T18:29:01.000Z",
          "Titre": "If I can just spend some telephone time…",
          "Contenu": "If I can just spend some telephone time with a designer I could get all my concerns addressed. This back and forth on chats and trying to get it right is very frustrating."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeffrey Maness",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T03:27:17.000Z",
          "Titre": "This site is a gimmick",
          "Contenu": "This site is a gimmick, in my opinion. The site tried getting me to buy services I didn't need. When all was said and done with the LLC application on their website ($50 in Missouri), there were several add-on suggestions that would have cost me $600-$700. When researching, I found that a lot of these services are free if you do it independently. They used fear tactics to offer me things I didn't need for my business. THEN, an agent called me to \"make sure I didn't make a mistake.\" In my opinion, the call was really to pressure me into buying the things I already declined. This was unsolicited advice, which is really annoying."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "M.p.",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T15:03:18.000Z",
          "Titre": "Too many sneaky practices",
          "Contenu": "The concept is great, the extra services are overpriced. You can get a registered agent fir $35. They charge you 199. I selected no to this option and it took me through a series of questions and after the app was submitted they still charged me $199 and they said I selected yes fir the registered agent.  They refuse to refund and told ne it was my fault.  Also the license guidance service is a joke. After they charge $99, they sent me licensing guidance fir the wrong industry."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicole L.",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T20:40:05.000Z",
          "Titre": "THE WORSE COMPANY EVER",
          "Contenu": "THE WORSE COMPANY EVER! Terrible customer service. Pay for services that they promised and not do. They don't care about your needs or provide the support you need to help start your business but will add stress to the process instead. Don't recommend them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tailor Brands = Waste of Money",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T17:41:09.000Z",
          "Titre": "Auto-renewal scammers...",
          "Contenu": "Auto-renewal without advance notification. Still active despite canceling everything else. Support says cannot cancel and doesn't offer refunds, but then cancels and gives credit to use on the website. Shady business practices, run for the hills."
        },
        {
          "Note": 1,
          "Lieu": "PE",
          "Pseudo": "Jose Robles",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T00:52:11.000Z",
          "Titre": "LLC process is a scam",
          "Contenu": "LLC process is a scam. They trick you into believing that the process is completed however when you asked for your EIN they only tell you that they can't help you with that even though they advertise that they will take care of all steps and provide you with a EIN number you can use to open a bank account."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "val",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T10:30:39.000Z",
          "Titre": "WORST COMPANY EVER",
          "Contenu": "The biggest mistake of my life hiring this company. Ripped off, scammed, trying to reach help support, and none. They are the biggest scammers I´ve ever seen. They decide what to credit your money, make invented supscriptions of no service at all. I´m trying to make a complaint to legal but I haven´t been able to reach no one."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Denis Fedorov",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T21:49:28.000Z",
          "Titre": "Not recommended",
          "Contenu": "This LLC formation service, unfortunately, falls short of expectations. Despite paying $301, I received no discernible service, and their hidden fee strategy is disconcerting. They charged me 'X' upfront, then demanded 'Z' separately to proceed, a practice that appears misleading. Furthermore, my refund requests went ignored, raising concerns about the integrity of their operation. This experience feels more like a potential scam.Moreover, their aggressive upselling tactics, including incessant calls, can be off-putting."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jen Amison",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T14:27:10.000Z",
          "Titre": "Scam and doesn’t want to resolve anything",
          "Contenu": "Isn’t it funny that your company claims to have reached out to everyone complaining about you and you didn’t make contact with them! Once again proving what a scam you are! I have texted, talked to three people via phone and emailed- no response or willing to try to resolve this. I’ve asked for a refund and of course I’m getting the run around about that too. No one wants to talk to us. I’m wondering if there is enough for a class action suit.I’ve been responding to them and have now been ghosted by the person. They won’t respond. So don’t believe any of their responses to reviews."
        },
        {
          "Note": 1,
          "Lieu": "KE",
          "Pseudo": "Harry Ongalo",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T20:09:21.000Z",
          "Titre": "This is the biggest scam ever",
          "Contenu": "This is the biggest scam ever. I paid the amount required then they tell you they cant get you EIN number neither can they refund the amount. Refund is kept on their platform to re-use on the bogus services of web design and logo creation. To get EIN i had to purchase it additionally for $100. Guess what will happen after paying the $100. I havent paid that yet since they give you a disclaimer after that they dont deal with legal issues and refer you to legalinc another scam that will go for the kill. Im at peace with my loss but if i can prevent anybody else being scammed im here."
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "Dmytro Dovzhenko",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T18:34:34.000Z",
          "Titre": "I'm was ordering 1-month plan",
          "Contenu": "I'm was ordering 1-month plan, but they charge my card with full year membership, they scam you showing small price and then just steal money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tiffany Z.",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T18:45:06.000Z",
          "Titre": "Absolutely the worst",
          "Contenu": "Absolutely the worst. I paid well over a thousand dollars. They are supposed to help you. Their logo generator is TRASH please use canva instead. What sold me was their tax and accounting help. I have reached out to Avalara and gotten NO RESPONSE from them. It's pretty much diy so WHY DID I PAY SO MUCH!? Please, do yourself a favor and just look into taxes on your own and file for your own LLC and business banking. Their options are limited, did not meet my needs and the third-party tax assistance is ridiculous. I have already had to pay late fees multiple times because I was not aware that I would have to file monthly. I am now figuring it out on my own and wish SINCERELY that I had not spent all this money on this CRAP. The steps are as follows:1. Find information about taxes both local, state, and federal (speak with your local SBA they can assist). 2. File for your LLC or sole proprietorship (there are many online options like Legal Zoom)3. Find a domain name and hosting package you like. Make it simple if you are a retailer and go with shopify from the start. 4. If you want branded stuff or need to design your logo etc. Go with Canva. Overall, your cost will be MUCH lower and your results MUCH higher."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Marly",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T18:04:08.000Z",
          "Titre": "Useless call center",
          "Contenu": "Useless callcenter, 0 help / advise if you create LLL from abroad, they charge you money in 2 sec, but they provide you solutions in 2 years.I have already talked with +6 people in the customer center and poor people they are not trained.They charged me for my EIN $99, to later say that they are unable, but never get the money back.Please skip this company if possible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Pease",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T18:46:02.000Z",
          "Titre": "Awful and unhelpful",
          "Contenu": "Awful and unhelpful. Charged me over $600 for them to constantly tell me they can't give me any form of advice for the mounds of tax questions they throw at you. Would never recommend them to any up and coming small business owners"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin R.",
          "Nb_Reviews": 2,
          "Date": "2023-08-08T14:34:27.000Z",
          "Titre": "Tailor Brands will continue to charge after you cancel",
          "Contenu": "Tailor Brands has now illegally charged my card multiple times over 2 years. You sign up, can't cancel, and it is impossible to get anyone to respond to you. Last year I had them issue me a refund after charging me for a full year instead of the one month I signed up for. After fighting with them, they refunded me. That was one year ago. Account closed! Then exactly a year later they charged me again for an entire new yearly subscription. They didn't notify me, i didn't have an active account, and when logging in (no paid account) I could see the charge and invoice, but again no subscription. I notified them and they told me I did have an account and told me with instructions how to cancel. Again, there was no \"cancel\" button shown since the account wasn't active. I had to notify PayPal since I assume Tailor Brands was making it impossible for me to cancel so they could charge me again next year. Total scam! Stay away."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chanti chiru hits",
          "Nb_Reviews": 3,
          "Date": "2023-05-11T00:26:19.000Z",
          "Titre": "Worst company to work with for forming LLC",
          "Contenu": "Worst company to work with to form LLC. Submitted application on Apr 28, with the updated name, but no update on revised application and still waiting to see what application they have really submitted to the state. Spent almost 40mins in the call with Legal team and couldn’t even get the name that they submitted in the application"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kayla Leonardi",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T17:41:03.000Z",
          "Titre": "Don't use Tailor Brands. Do it yourself",
          "Contenu": "I wish I wouldof did more research. Tailor Brands is a 3rd party company that chargers 3x the amount then doing it your self. It's easier than you think. They charge $99 for a EIN that's free on the government website that only takes 5sec to file."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robin  Kurtz",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T00:22:26.000Z",
          "Titre": "Scammed $1300.00 from my cc.",
          "Contenu": "Scammed $1300.00 from my cc.I was \" accidentally \" charged $298.00 TWICE.I have been dealing with these scammers, thieves for 21/2 weeks.They keep giving me the run around and speaking with customer service, they tell you to email support team. Noone actually will talk about a return, only email you. I emailed back, SEVERAL TIMES. TB says they didn't receive my emails????????I'M a single new business owner, brand new, this is absolutely been horrific for me. I would never spend thirteen hundred dollars!!!! I needed help with LLC only. I would never ever recommend this company, the are reported to my bank, BBB.Hey TB, RETURN MY MONEY TODAY!!!!!!!!!!! It's been 2 1/2 weeks, I canceled everything under 24 hours. And now you go dark? SCAMMERS, there will be consequences. I work with 20 other individuals at another job, And they were waiting to see how my experience went,THEY WILL NEVER USE THIS COMPANY!!!!RETURN MY MONEY TO MY CC IMMEDIATELY!!!!!!!FUTURE BIZ OWNERS, RUN, YOU WILL BE \"ACCIDENTALLY\" OVER CHARGED, IGNORED, AND SCAMMED. TAILOR BRANDS WILL HAVE THE PLEASURE OF MY EXPERIENCE TO SHARE WITH OTHERS DAILY UNTIL YOU RIGHT YOUR WRONG!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kia Marsh",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T05:49:43.000Z",
          "Titre": "Do not trust this company",
          "Contenu": "Do not trust this company, that have fraudulent practices and are way overpriced. Do not waste your time"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "carlos h",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T16:29:36.000Z",
          "Titre": "Scam…",
          "Contenu": "This company has the worst customer service. At the end of June 2022 paid almost $1000 for services after making multiple attempts to contact them for assistance we canceled in October 2022. We call spoke to a customer rep. She stated that they would not be charging us anymore and that our subscription would be canceled at the end of the year since we had already paid for the full year. We asked for a confirmation email and never received it. We asked for a cancellation notice and never received it, but we were told that there was nothing else we needed to do. Yesterday they charged us three separate transactions against our consent. When we call to dispute it and ask them why their solution was to give us back 50% of the money that they took without permission. This seems to be a reoccurring situation if you look at the Better Business Bureau report , that being said they are also not registered with the Better Business Bureau. Unfortunately, this appears to be just another scam or people are taking money for doing nothing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-07-12T21:32:53.000Z",
          "Titre": "Stay away from them",
          "Contenu": "Stay away from them. They never sent me any reminder of renewal and charged my credit card without my confirmation. Their policy works for them but their customer. Stay Away from them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Harrison B.",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T04:00:10.000Z",
          "Titre": "Bait-and-switch... Cannot recommend",
          "Contenu": "I should have probably read the negative reviews before going ahead with Tailor Brands, but lessons learned... I needed an LLC quickly with the EIN. I opted for the express service and paid what I thought was the total price of ~$275 for everything that was listed. After completing the payment, I had to fill out additional information. The form did not allow me to use a 3rd party agent, which I intended to do, because it is cheaper than paying Tailor Brands to do it ($49/year versus $199/year from Tailor). After I submitted everything, I was then charged an extra $99 for the EIN... Which I was under the impression that I had already paid this. I would not have moved forward if I had known this $99 was going to be tacked on after I paid.Finally, the LLC has been formed and as I'm going through the operating agreement, I see it's a generic template with NONE of my actual information put into it. What a joke.You're better off taking the time to do this yourself or go with a company that's not going to bait-and-switch you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DRE Wise",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T13:00:47.000Z",
          "Titre": "My rent is due I go to pay it and this…",
          "Contenu": "My rent is due I go to pay it and this company went into bank account and took $227.  I call and tell them that that is part of my rent money and I was not contacted before the payment ran.  Taylor Brand refused to refund the money .Very bad business and they didn’t care about my living situation.  How will you get the money next year if I’m homeless and the bank account . I don’t recommend them to anyone.  Very bad experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kohl Westveer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T18:18:15.000Z",
          "Titre": "Uneasy experience",
          "Contenu": "She was very pushy and presumtious. There was also alot of background noise in the call as well. I felt rushed in alot of these very expensive decisions"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dustan Mason",
          "Nb_Reviews": 5,
          "Date": "2023-11-29T05:55:16.000Z",
          "Titre": "The experience was just OK. Could’ve been better, but maybe my experience is not typical.",
          "Contenu": "Overall, I accomplished my goal to form an LLC, the proper way. However, they were certain things about the process. That kind of rubbed me the wrong way. There was a constant sense of an upsell throughout the process. That so much isn’t a big deal because most companies do that. But it was the way in which it was done as well as the pricing of those upsell that rub me the wrong way. Some of the more essential services were very very expensive and as a starting out business, a small time entrepreneurs simply don’t have that kind of money laying around.  a company dedicated to helping businesses reach their potential should take in consideration when presenting their services for sale."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kathy Lattimore Cocus",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T21:29:28.000Z",
          "Titre": "Multiple requests to get answers",
          "Contenu": "Upsell is their end game. After attempting to work with them for a year, I've cancelled my subscription. It takes multiple emails for them to understand questions. The website oversight is not ideal. It adds layers not necessary for management. Just use shopify or something similar. If it's something you think you'll need for your business, they are happy to assist for more funds.AVOID>"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rebekah Roemer",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T00:26:42.000Z",
          "Titre": "I had been charged 2 mos even though my…",
          "Contenu": "I had been charged 2 mos even though my company not valid any longer,  I had not recovered my refund yet but will check again.  I believe in all honesty this might be a good service if over charging wasn't involved🙄"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alfred",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T04:26:17.000Z",
          "Titre": "Be ready to pay A LOT",
          "Contenu": "Be ready to pay a lot. A lot more than advertised. Between super agressive upselling techniques, complete lack of transparency, multiple spam emails and agressive phone calls, credit card charged multiple times, you’re going to end up with a very hefty bill."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T04:20:38.000Z",
          "Titre": "Just be careful",
          "Contenu": "The basic service is quick and efficient. Just be really careful. The prices are really opaque. They’re trying so much to upsell, it’s very agressive. Many phone calls, multiple emails, sometimes to sell you packages that you can find for free on the Internet. And agents become really rude when they realize you won’t buy all of their options."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Braeden Webb",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T21:04:29.000Z",
          "Titre": "I couldn’t understand what she was…",
          "Contenu": "I couldn’t understand what she was saying most of the time. She talked almost like a robot and slow. I didn’t realize I was going to have to pay more and more and more money through our conversation."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tamisha Taylor-Munroe",
          "Nb_Reviews": 2,
          "Date": "2023-10-06T12:24:34.000Z",
          "Titre": "The finished results are not compatible…",
          "Contenu": "The finished results are not compatible with the brand(MUNROE Rentals LLC) my website that you built shows a limo company instead of the Rental car company.This needs to be fixed ASAP"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dr. Robert James McGill  Jr.",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T22:39:58.000Z",
          "Titre": "The language barrier made it difficult…",
          "Contenu": "The language barrier made it difficult for us to understand and I believe the agent could hear the rhythmic tone in my voice which triggered her prejudice and she began to speak to me in a sophomoric undertone. Little does she know my education level, but I digress. I’m just not fluent in formations of companies and I feel I was taken advantage of when using your website. There were fees I didn’t want to pay (i.e. expedited mailing) we said no, but we were charged it anyway. It’s looking more like a money grab than a service for the public."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Teri Schindler",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T08:49:08.000Z",
          "Titre": "Not happy and very frustrated.",
          "Contenu": "Actually, my experience with you was great at the beginning. I was registering an LLC with you and you were sending it on to the state for approval. I even paid extra, for it to be expedited. That was nearly 3 weeks ago. True, you did give me the link where I can go into the state and see where my LLC is, however, that’s what I paid the extra for for you to keep track of it and make it their top priority. I’m just really frustrated right now. I wanted to start my business ASAP."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sammy",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T05:45:02.000Z",
          "Titre": "Good idea, bad customer service",
          "Contenu": "What I like - The concept. I think it’s a good idea to have a one stop shop for numerous business needs. What I dislike - The customer service experience can be poor. Tailor Brands makes me feel like I have to jump through hoops to get assistance when an issue arises. For example, you can’t call customer support and speak to someone, you have to write them an email and wait for someone to get back to you. Don’t even get me started on the “verification process” when doing so. It feels very tedious and not catered to the client."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Clay III",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T06:14:13.000Z",
          "Titre": "Was not knowledgeable at all really…",
          "Contenu": "Was not knowledgeable at all really didn’t know what she was saying. Try to rush me off the phone rush me to my questions didn’t like that could not answer any of my questions could tell that she was reading everything to me wasn’t a pleasant experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JAROD PEAY",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T02:10:58.000Z",
          "Titre": "This is Confusing"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cheyenne C.",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T21:00:28.000Z",
          "Titre": "This experience was utterly stressful",
          "Contenu": "This experience was utterly stressful. My intentions for selling a book were completely blown out of proportion and I was pushed into buying all sorts of things that I don’t have any knowledge about. The reps that were on the phone with me spoke so quickly that I couldn’t get a clear idea of what was going on. They charged my card seven times in two days and I don’t have a business. I’m so grateful that I got the chance to speak with another rep who was a bit more accommodating with my feelings but the same issue progressed where I was called everyday after creating the business profile for them to charge me for more things that I didn’t need at this time. I froze my card so that they would stop charging me for things.I’m currently being taken care of with all transactions being cancelled so for this I am happy. But the pushy and fast talking is what caused me such confusion, frustration, and unbeknown/unneeded products for me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Laura Jean Clark",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T17:03:05.000Z",
          "Titre": "I didnt like how the entire process was…",
          "Contenu": "I didnt like how the entire process was so confusing and everything just felt like an upsell. I dont like how when I spoke to someone on the phone it was as if I was speaking to a robot or AI. No help at all, impersonal and rude."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Desiree Padilla",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T14:11:14.000Z",
          "Titre": "Very upset",
          "Contenu": "Very upset. I submitted my information to obtain my LLC and it was submitted incorrectly to state and I’m unable to make corrections over the website. Bank will not provide me a checking account until it is updated. This was not my error and I should not have to make additional payments on my end to have it fixed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T17:40:59.000Z",
          "Titre": "Refused request for refund after auto renew w/o any reminder",
          "Contenu": "I used this company to set up a website and logo. I did not realize at that time when I paid for the hosting and website service, there must have been some auto renew clause. As it turned out we never used the website as intended and I did not get any proactive notice of the auto renew. I contacted Tailor Brands after the auto payment went through to ask for a refund, and they told me basically “too bad, it’s in the terms and conditions, too bad for you” and refused to issue a refund. That is a terrible way to treat customers and run a business. We will never use Tailor Brands again in the future. Buyer beware."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Britt M",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T15:34:03.000Z",
          "Titre": "Be careful! Renews Without Notice!",
          "Contenu": "Update: After a few more emails and expressing my dissatisfaction, the company gave me a partial refund and has closed that account since I no longer have access. Original Review: Be careful! They won't tell you that you're account is going to renew and they just charge you. They WILL NOT give you a refund if you don't cancel before the renewal and if you don't know the renewal is coming you don't know to cancel! I asked for a refund and after spending a good amount of time going back and forth through email giving them all the info they said they can't refund. WHY THE HECK DID YOU ASK ME FOR ALL THE INFO THEN! What a waste."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Inez Lee",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T12:55:00.000Z",
          "Titre": "No help.",
          "Contenu": "My issues were when they first opened they did not have any representative to help lead you to ensure that you get the right l l c ... I needed my l l c separate from my name and i'm not sure if it's even set up like that.. Because there was no help and no one to talk to everything will do with yourself."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ItsMoe UAMG",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T22:45:41.000Z",
          "Titre": "Could of been 1 star!!",
          "Contenu": "Process was very simple which is why its a 2 star rating and not a 1 star. They lack communication, I submitted my LLC over a month ago and I am still waiting! I submitted a 2nd LLC without Tailor Brands directly with my state and it was approved within a day!They are only looking to upsell you! never again"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tanner Kurrasch",
          "Nb_Reviews": 3,
          "Date": "2023-08-17T23:59:43.000Z",
          "Titre": "The reason why I give 2 out of 5 us…",
          "Contenu": "The reason why I give 2 out of 5 us because my first interaction with the company was so good being told the hole 404 would be for everything listed need less to my knowledge that wasn't the case. Being told before processing that it's all included to be told the day you submit that its not. I would like to know ow if there is any means to fix this. But all and all the lady I spoke with today was trooper she needs a rais she was more transparent with about my business from the get go I have hard time understanding something but she made it to were I can full understand what all the charges are and what was included with the 404.Update they did lie about the 404 the state charg is included in the 404. But after 7 to 8 Phone calls and lie after lie im just gunna give them till monday to stop the bs or i will do a charge back and claim fraud on the company"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christopher Harriman",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T13:24:19.000Z",
          "Titre": "Sneaky Wording for paid services",
          "Contenu": "I created an an LLC with the PAID option to have expedited filing. Now there is a expedited filing with my state where it takes 1-2 business days to be processed. My status has been in state processing for more than 2 weeks. They will lie and tell you that this is out of their control. However, if they weren't sneaky and used expedited filing as it seemed to be worded when I bought it, I wouldn't be here leaving this review. My guess is that the \"Expedited filing\" was just through Tailor Brands side, and basic filing through state.After this review, they agreed to give me the expedited filing refund. They are quick with customer service on that aspect. But this shouldn't need to go this far to get a refund with this reasoning, adding an extra star because I stand by my opinion but thank them for refunding and hope they make a change to that expedited filing section."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T20:41:14.000Z",
          "Titre": "Paid Lesson learned",
          "Contenu": "You can't charge someone expediting fees when you can't expedite the deliverables.  Got charged Agent Fee first day, another amount for obtaining an EIN, got charged for setting up a mailbox that never worked, literally. Yet, I had to paid for (Elite Plan) to expedite (what a laugh) and all the other addons and I am still in the same place from where I started a week ago... Had to cancel the service w/n refund for a pointless service. Paid for a report that explains whether a company needs a licenses, etc. and going into another week and received nothing... Logo's can't be created on HiRes so the end product looks less than desirable... I just don't know - should have just went with Northwest or LegalZoom. at least they can justify the $1000 which they provide embosser seal tool, quality binder too. don't bother getting a hold of customer service... they are clueless.  what they are on top of is getting one to add Trademark service as the cherry on top. quite frankly... they need a reset.  I should have checked the reviews on Trustpilot first... because elsewhere they were being talked up..."
        },
        {
          "Note": 2,
          "Lieu": "AW",
          "Pseudo": "Angela Ungaro",
          "Nb_Reviews": 2,
          "Date": "2023-05-31T17:29:35.000Z",
          "Titre": "Not worth it",
          "Contenu": "2 transactions totaling $547.Llc name had the word gifts put it in even though the name I requested was available. Now I will have to file amendments with the state to correct. Used taylor for convenience but wish I would have done it thru rhe state site for just small fees."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Guestino Kintaro",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T14:43:14.000Z",
          "Titre": "I had my subscription on autopay pay but…",
          "Contenu": "I had my subscription on autopay but my email and website were unaccessible due to \"no payment received\". I lost some important emails and probably potential customers for my business. I would look for another host elsewhere."
        },
        {
          "Note": 2,
          "Lieu": "CD",
          "Pseudo": "Esther",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T10:13:50.000Z",
          "Titre": "Just a review",
          "Contenu": "I wrote to get help on my request regarding the inclusion of e-commerce on my site but it took more than 3 days to get a feedback. It only when I wrote back complaining that I was well taken care of"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ishmael Sumaila",
          "Nb_Reviews": 2,
          "Date": "2023-10-01T12:35:21.000Z",
          "Titre": "I just need a State certificate to…",
          "Contenu": "I just need a State certificate to prove that my LLC has been registered and approved by the State of South Carolina. That’s it!"
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "Andrés Mechali",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T13:47:21.000Z",
          "Titre": "SCAM.",
          "Contenu": "This is a total scam. I advice everyone not to subscribe to any service from Tailor Brands. Once they get your credit card, they start charging for stuff you never ordered, and then refuse to give you a refund. At most, they offer you \"credit\" on their store, which you don't need.As soon as I subscribed for creating an LLC, before even finishing the process, someone called me and offered me a tax advice service. I declined. The next day, I woke up with a $660 charge on my card for the annual subscription, and not even the cheapest plan.I sent them 4 emails, and every response was either something like \"I will forward this to [xxx] department, but are you sure you don't want it?\" or \"I understand your frustration, having a business is hard. We don't do refunds for your purchases but in this case we can offer store credit\".After writing this review, the company finally issued me the refund, so I edited from 1 to 2 stars. I am still leaving this review because I firmly believe that this compulsory charging is how they operate, and I find it unacceptable. I'm sure some people end up accepting the service instead of complaining. The only reason they accepted to refund me was due to this review, which should have not been necessary on the first place."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kitbash Federation",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T23:37:05.000Z",
          "Titre": "I am not a customer",
          "Contenu": "I am not a customer.  I get the feeling I should be thankful for that.  After beginning the process, putting in my desired company name and all, I received a phone call from their customer service.  I was taken aback by that since I just put in my phone number only a few moments prior to the call.I don't know the first thing about starting a business but I can tell when someone is too eager.  I let him know he was being aggressive and he let me go with an offer of availability to talk when I'm ready. Were it not for this site, I would not know about the high percentage of 1 start reviews.  A good company shouldn't have the second highest review stat @ 1 star.  A healthy company would have a sharp cascade from 5 to one.  Thank you all for your reviews, especially Sam.  Your eloquence speaks volumes.P.S.  I wonder what rubber stamp rely I'll get ? =]]"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Farmin Dank",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T15:32:57.000Z",
          "Titre": "There's better",
          "Contenu": "It will get the job done but you will experience numerous website glitches, store builder glitches, billing issues and support will take a long time to respond. You will also have domain issues and issues losing your logo completely or it being hidden or replaced with another"
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Sachin Chiramel",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T02:47:19.000Z",
          "Titre": "Very frustrating experience dealing…",
          "Contenu": "Very frustrating experience dealing with customer service. If your application is simple with no complications then Tailor Brands is fine, otherwise avoidUpdated my review to two stars from one star only because one customer service executive (Laurie i think her name was) went above and beyond to find and resolve the issue - the resolution was to get me a full refund. Still wouldn't use Tailor Brands again but grateful for Laurie's service"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Angie",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T13:43:50.000Z",
          "Titre": "Overpriced services and web site…",
          "Contenu": "Overpriced services and web site applications that aren't easy to use for those who may not be technically inclined. The worst part of the experience was the difficulty I had to go through to get a refund of money for a service that although it wasn't cancelled before the due date, it was one day after AND it was for a mailbox that was inaccessible anyone. The plan subscription was cancelled timely, the domain expired therefore a refund for the mailbox should be automatic. As a new online business owner I have learned to be more careful jumping into service agreements especially for yearly subscriptions. Tailor Brands is in the business of making money, just as I am but you need to be clearer and more upfront about your cancellation and refund policies. Your reviews are terrible regarding these issues. Thanks for the experience. I've learned better and I'll be more cautious moving forward in my decision making.Yulisa Benitez (Tailor Brands)Jul 11, 2023, 19:44 GMT+3Hi Angie,Thank you for your reply, this is Yulisa from the LLC team. Normally, when someone buys a Business Mailbox from us, it can't be refunded. But, it's great that you reached out to us so quickly because we can cancel Mailboxes up to 5 days after they were purchased.  I see that that is the case here, so I can cancel the purchase for you and apply store credit to your Tailor Brands account with the amount you paid.  You can then purchase a new Mailbox or a different service from us using this credit. Just let me know as soon as possible if you'd like me to proceed with the cancellation.  I'm here to make things as easy and stress-free as possible for you!Best,YulisaTailor Brands Solutions TeamTailorbrands.com"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Trevor Denton",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T04:08:19.000Z",
          "Titre": "I got no help setting anything up",
          "Contenu": "I got no help setting anything up. But yall had no problem taking my money but after that I got no help with settingthings up."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Josh Rentz",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T15:00:02.000Z",
          "Titre": "Well I was charged for my LLC on the…",
          "Contenu": "Well I was charged for my LLC on the paperwork going to that but unfortunately the payment for my ESN was rejected so now my LLC is being held up and I can't get it I went in for and got my lo my ein myself no waiting to hear back from them so I can either go with somebody else get my money back or you know they can proceed to move forward and get my LLC"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T17:07:31.000Z",
          "Titre": "I'm unhappy that this reoccurring issue…",
          "Contenu": "I'm unhappy that this reoccurring issue has happened in the first place. The first time this happened they fixed it quickly. The second time however, they didn't fix in a timely hour and this problem affected how my business runs. I had several people purchase items from my website that were not in stock. This caused me to have to email each customer and refund them for the items that were not in stock. Had this issue never occurred or fixed in a timely manner, I would have not had to deal with these issues. Hopefully I don't have to deal with this issue again."
        },
        {
          "Note": 2,
          "Lieu": "PK",
          "Pseudo": "usama jabbar",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T12:32:17.000Z",
          "Titre": "I order my LLC since 25 nov and it’s…",
          "Contenu": "I order my LLC since 25 nov and it’s still being in process really not satisfied with the time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William w Macharia",
          "Nb_Reviews": 3,
          "Date": "2022-11-09T18:22:02.000Z",
          "Titre": "Was promised a call or meeting by one…e commerce expert",
          "Contenu": "Was promised a call or meeting by one of the experts still waiting. Tailorbrand keeps replying using same format to different problems this will never solve the problem my website just needs alittle more twiks and it's done if I could get an expert who can be available we can conclude"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "vinivadavici smith",
          "Nb_Reviews": 2,
          "Date": "2023-06-09T00:19:47.000Z",
          "Titre": "The one thing that I do not like is…",
          "Contenu": "The one thing that I do not like is that Taylor Bank can help you get a domain and a business address but can't help you get a business email that right there you have to do on your own you have a section for it but when you run into problems with it you can't help me that's what I don't like about it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "April Howell",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T05:05:58.000Z",
          "Titre": "Need help.",
          "Contenu": "Things go by really slowly and it's impossible to get to talk to someone when you have a question."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William w Macharia",
          "Nb_Reviews": 3,
          "Date": "2022-11-01T06:30:51.000Z",
          "Titre": "Nothing went wrong but turn around time…",
          "Contenu": "Nothing went wrong but turn around time is too long and questions I asked weren't answered. Although I like the website I feel the delay caused also affects the business if we could get the business running then I would give tailorbrand more business."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tory Williams",
          "Nb_Reviews": 3,
          "Date": "2023-07-18T14:19:23.000Z",
          "Titre": "My trademark I paid for I haven't been…",
          "Contenu": "My trademark I paid for I haven't been reached yet to finish my trademark"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joseph Winters",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T18:00:53.000Z",
          "Titre": "Everything…it is documented and don’t…",
          "Contenu": "Everything…it is documented and don’t want to rehash."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christopher Anoruo",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T22:21:39.000Z",
          "Titre": "I had a bad experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stanley Roberts",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T16:31:46.000Z",
          "Titre": "You put two different names on my…",
          "Contenu": "You put two different names on my paperwork"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shatara T",
          "Nb_Reviews": 2,
          "Date": "2022-09-28T22:06:00.000Z",
          "Titre": "No bang for the buck",
          "Contenu": "I am all for up-and-coming brands. I first purchased a logo and then a 2-year domain and website. I paid for an expert website builder and got basic support. Never used my store! Then I cancel the subscription a day before renewal and they still charged me because I did not deactivate the page. BOOOOOOOOO. All money is not good money. keep the $155.88, I will never do business or recommend you all for any business."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marie",
          "Nb_Reviews": 3,
          "Date": "2022-10-06T15:23:37.000Z",
          "Titre": "Make sure you cancel on time…",
          "Contenu": "Make sure you cancel otherwise you will have a very difficult time getting your money back. It was the worse experience having to beg for a refund the same day they put a charge through. You can create a logo, but it’s not free. And once you do sign up, constant emails about this and that for a business. Wanting to sell you a domain to registering your company. Can’t be mad about them trying to make money, but the effort I had to put in to get my 9.99 back was astonishing considering they had just charge the card a minute before I emailed to cancel."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Mclarnan",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T04:44:59.000Z",
          "Titre": "Lady seemed to be rushing me over the…",
          "Contenu": "Lady seemed to be rushing me over the phone. I didn’t care for that"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bryce  Neilson",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T04:46:34.000Z",
          "Titre": "Wanted extremely more money then was…",
          "Contenu": "Wanted extremely more money then was agreed upon"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Yemayah El Ra",
          "Nb_Reviews": 1,
          "Date": "2022-09-17T17:14:53.000Z",
          "Titre": "I HAVE NO LEGAL DOCUMENTATION FROM THE…",
          "Contenu": "I HAVE NO LEGAL DOCUMENTATION FROM THE STATE OF NEW YORK REGARDING MY BUSINESS REGISTRATION. NOT ONLY THAT NOTHING FROM THE IRS WITH MY EIN. THIS IS SO DISAPPOINTING. I PAID FOR A FULL SERVICE AND BASICALLY GOT NOTHING."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julie Kahoopii",
          "Nb_Reviews": 2,
          "Date": "2022-06-15T12:12:33.000Z",
          "Titre": "Upgrade",
          "Contenu": "Very dissatisfied with the upgrade I made to the 12 month plan at 71.88. You are not able to get a refund either. This was the only thing I wanted to make and I am out 71.88 and still have no business card! I tried to reach out for help, I did not get any response. If you are thinking about using this company, please please please read all of the TERMS and CONDITIONS! Would not recommend at all and will be writing to the BBB."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Joseph Fursdon",
          "Nb_Reviews": 1,
          "Date": "2022-06-23T04:24:50.000Z",
          "Titre": "Payment Issues",
          "Contenu": "The Service itself was good, the logos worked well and im happy with that side of it. The billing was quite manipulative. I was presented with two options, yearly subscription for 3.99 a month (total $47-48 a year) or a $9.99 a month subscription, which is what i chose as i just needed to use the tool short term. Once i clicked pay and signed it up to my paypal subscription service, i was charged an annual service at 9.99 a month, a total of $73 USD. The company doesnt have a live support tool either so i'm waiting nervously for news of a refund. Happy to change this review if the refund is smooth."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Abraham",
          "Nb_Reviews": 1,
          "Date": "2022-05-14T17:23:39.000Z",
          "Titre": "I pay for the yearly subscription",
          "Contenu": "I pay for the yearly subscription, and have business cards printed. Not the best quality. Then they ask if my logo looks blurry and I have the option of paying more for a detailed version of the logo I already own. Not impressed, if I had known, I would have gone with a different company."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Chinyere Ngozi",
          "Nb_Reviews": 1,
          "Date": "2022-02-20T11:56:27.000Z",
          "Titre": "Decent products but hidden charges",
          "Contenu": "UPDATE: I ended up being able to communicate by email with two team members/AI to discuss my problems and received a 50% refund on a product that automatically renewed without my say so. I think that’s a decent outcome and I’m happy to update my review from one star to two.###You can’t contact this company easily. Terrible creeping up of auto renewal with no clear way to stop it. Insincere signposting of where to ‘contact customer support’ - there is not a clear way to contact Tailor Brands. I’ve only seen a contact email here on the replies to the bad reviews."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andi Pattison",
          "Nb_Reviews": 1,
          "Date": "2021-07-13T17:46:47.000Z",
          "Titre": "Subscribe and forget",
          "Contenu": "Beware of the 'subscribe and forget' business practices. By the time you catch on that you had a subscription TB will have charged you a few months and refuse to refund. They do not provide notifications of upcoming charge / renewal like any other decent company does. I give them two stars for this reason, but I did end up creating a logo however I will not use it. The platform does have limited designs once you slot yourself into a category."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tiffany",
          "Nb_Reviews": 1,
          "Date": "2022-06-05T07:41:20.000Z",
          "Titre": "I purchased a year subscription and…",
          "Contenu": "I purchased a year subscription and keep scheduling appt to have help to build my website but nobody actually calls. It seems to be a waste of time and money so far. If someone can reach out, that would be great"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Colin mazyck",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T21:02:27.000Z",
          "Titre": "Taylor brands is geared toward getting…",
          "Contenu": "I wrote a very bad Review and then I decided to delete it even though it was true because I don't need the bad karma. Use at your own risk"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dev Hobson",
          "Nb_Reviews": 1,
          "Date": "2021-05-08T12:53:58.000Z",
          "Titre": "The logo design is beautiful and easy…",
          "Contenu": "The logo design is beautiful and easy to use so I give you another star. What gets me is advertising. Why say you only are going to charge for the month of 9.99, AND THEN charge ANOTHER $50 again on top of that? What's the purpose of paying for the month???? That's false advertising and bad business and honestly, I don't think I'll be using them in the future if they cant uphold their end of the deal."
        },
        {
          "Note": 2,
          "Lieu": "EC",
          "Pseudo": "Carlos Perez",
          "Nb_Reviews": 1,
          "Date": "2021-01-24T14:55:06.000Z",
          "Titre": "Me cobraron de manera ilicita los…",
          "Contenu": "Me cobraron de manera ilicita los 71.88$ ya que solamente deseaba por un mes pero me salio un correo de confirmacion sobre ese valor directamente a descontado de mi tarjeta de credito, deseo mi devolucion de este servicio, por favor. They illegally charged me $ 71.88 since I only wanted for a month but I got a confirmation email about that value directly discounted from my credit card, I wish my return of this service, please."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2020-04-18T00:24:33.000Z",
          "Titre": "Very poor service",
          "Contenu": "Very poor service. Rude customer service. Expensive. VERY hard to cancel subscription. No reminder when direct debit was going to be taken to allow option to cancel. The actual logos are ok but the rest of the package- customer service, option to cancel, the 'subscription' feature is all about making money with little regard for customers. I would avoid- I wish I had."
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "Roman Weis",
          "Nb_Reviews": 1,
          "Date": "2021-08-09T12:39:54.000Z",
          "Titre": "Scam! I thought this bad practice is dead, but apparantly, it is not!",
          "Contenu": "It is defacto standard, that if a customer clicks on a button that just says \"Upgrade\" without any further information, then the customer expects to see a price list first and then maybe buys the product. IT IS NOT EXPECTED that the site just charges my credit card without with some random amount without further questions. EDIT: customer support came back and did refund the full amount. I won't get back my time, though. Any website that does not provide transparency on prices should be banned, it would be only fair to companies that act lawfully."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mr E & T",
          "Nb_Reviews": 1,
          "Date": "2020-02-21T10:44:21.000Z",
          "Titre": "Don't make payment until you've read all the T&C'S!!!!",
          "Contenu": "It clearly stated that amendments can be made after purchase to certain aspects. It would not let me even change a colour or font as stated. Customer services very poor, did not utilise the logo purchased and walked away a few British pounds lighter. A real shame as the logo only required a few tweaks.Update; I contacted Tailor Brands with my details, but they choose not to reply."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Aaron Thompson",
          "Nb_Reviews": 4,
          "Date": "2021-04-21T11:28:32.000Z",
          "Titre": "On the fence",
          "Contenu": "On the fence. It seems that they wanna help yet try and sell you the highest package going. After reading most reviews on here it seems the majority of \"5 star\" reviews have been invited which I can only assume they have been paid for or given Free Access. Sounds shady"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jake Nolte",
          "Nb_Reviews": 1,
          "Date": "2019-11-10T01:12:47.000Z",
          "Titre": "automatically charged forever.",
          "Contenu": "I created a logo using tailor brands  (that was nice) and somehow managed to enroll in a monthly subscription.  I have tried to change it for a year. I send messages every month begging to be cancelled- no response. No way to access my account.  Every month the 9.99 comes out. I have been charged over $100 at this point that I have no ability to cancel."
        },
        {
          "Note": 2,
          "Lieu": "DK",
          "Pseudo": "Natasha",
          "Nb_Reviews": 33,
          "Date": "2021-03-02T15:58:32.000Z",
          "Titre": "They charge for a service you didn't subscribe to",
          "Contenu": "Like many others, I was also charged an annual fee, that I didn't sign up for. They did refund me, but they didn't want to admit that there is a bug in their signup flow, and the refund was missing almost a dollar. No big deal, but really does make the company very untrustworthy."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Love Conquers All",
          "Nb_Reviews": 1,
          "Date": "2020-07-17T00:21:10.000Z",
          "Titre": "Nice Design But Untrustworthy Platform",
          "Contenu": "The design was nice. What I thought was a one time purchase somehow turned out to be a recurring charge. I have been charged for the last 2 months and just noticed it this month. When i reached out to them it took longer than the 24-48 hours they say it will take for a response and they did not address my refund at all. Unless you want to keep paying for something months after your use of it, even with no activity on your account, I would look elsewhere. I dont trust Tailor Brands and wouldn't recommend them to anyone."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Jill",
          "Nb_Reviews": 1,
          "Date": "2017-10-03T04:00:18.000Z",
          "Titre": "I've paid for Premium",
          "Contenu": "I've paid for Premium, but am getting no response to emails so I can get things up and running. It's fine to say there's a 24-48 hour turnaround time, but that's too slow for my purposes. I wanted a month's membership, but could only buy a yearly subscription. I took it because I liked the logos, but disappointed with this outfit. I'd look elsewhere in future."
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "Daniel Einat",
          "Nb_Reviews": 2,
          "Date": "2021-10-26T16:11:29.000Z",
          "Titre": "i didn't understand what i am buying…",
          "Contenu": "i didn't understand what i am buying and it doesn't seem that you had the interest of me really knowing what I am buying.it makes me sad. hope you will explain to your customer in plain English what they're subscribing to."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Rev",
          "Nb_Reviews": 1,
          "Date": "2022-05-30T17:02:07.000Z",
          "Titre": "Beware Tailorbrands sneaky subscription…",
          "Contenu": "Beware Tailorbrands sneaky subscription auto-renewal. They wont work with you to refund the fees after the fact. Greed>Customer serviceThere are better tools out there..."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Noiram008",
          "Nb_Reviews": 2,
          "Date": "2022-04-11T11:55:57.000Z",
          "Titre": "A 'read the small print' customer support",
          "Contenu": "The product is alright (hence 2 stars) - but the customer service is annoying. Asked for a refund as they charged me for another year although didn't use the product. Had no idea, noticed in the statement (know that feeling?).... The customer support team pointed to 'unfortunately our company policy' and to read the small print. No refund. Only after sharing the UK Consumer Rights link they decided to offer a 90% refund (kept one month..). 1. Offer a refund without the threat if you care about your customers.2. Offer a refund if clearly someone is not using the service but the subscription was not cancelled!!3. Treat your customers as if you want them to recommend you and come back to use your product.4. Move to a 'We're not di*ks' company policy."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Martin",
          "Nb_Reviews": 1,
          "Date": "2018-12-21T17:11:05.000Z",
          "Titre": "Their design tools lack the freedom of creativity needed in branding.",
          "Contenu": "I am a customer of theirs and decided to create my logo on their website. Their customization tool lacks versatility, customization and autonomy. It forces you to choose from automated font options that refresh every time you choose a new style. Your basic \"Bold\" \"Underline\" \"Italics\" options are not available for you to use on your OWN logo. It's very hard to believe that a company who's selling point is their logo design tools does not include the basic properties of digital design. I would not recommend them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Veronica Muniz",
          "Nb_Reviews": 1,
          "Date": "2019-12-01T17:01:19.000Z",
          "Titre": "Cancel your auto renewal",
          "Contenu": "I created a logo using tailor brands (that was pretty cool) and somehow managed to enroll into a yearly auto renewal  subscription. I attempted to cancel only a few days after my card was charged and ask for a refund. They refused to give me my money back. I understand that your a subscription like Spotify, pandora and other companies. However, they take care of there customers and do what’s right. Not stand firm behind a sentence. Customers services isn’t just a timely response, great content but understanding And listening to your customers. Beware and cancel your subscription!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dante Dieguez",
          "Nb_Reviews": 1,
          "Date": "2020-08-11T17:02:58.000Z",
          "Titre": "Total Scam artists",
          "Contenu": "Sure, it works. But when I tried to order a one month subscription on the most basic plan available, they automatically bumped me up to a one-year long membership for literally no reason. When I emailed them (because apparently you can't call them for reasons unknown) they said that they'd \"be happy to change me over to the basic plan\" but I've been waiting for my refund and switch to the month to month for about 2 weeks now and nothing has happened. Now I'm out $70 that I didn't have and they're taking their sweet time. I'll say this once and only once. DO. NOT. USE. THIS. SITE. Total scam."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Courtney Henley",
          "Nb_Reviews": 2,
          "Date": "2021-06-25T15:04:28.000Z",
          "Titre": "Great logos but a waste of money for everything else",
          "Contenu": "Great logos and I love mine. However, DO NOT WASTE YOUR MONEY on the other services. It is unnecessarily hard to set up a basic landing page and you are better to just get hosting with GoDaddy or another company and hire someone from Fiverr to set up a landing page. The business deck templates that are supposedly branded often use weird versions of your logo. And you only get one choice of deck presentation while I feel you should get at least 5. You cannot use your own domain for your business email which makes no sense. I bought my domain elsewhere before I created the logo with Tailor Brands. So I can't use their business email. I basically paid $50 just for the logo when I could have paid $33."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Tara",
          "Nb_Reviews": 1,
          "Date": "2017-11-11T13:01:01.000Z",
          "Titre": "I have tried to make contact with …",
          "Contenu": "I have tried to make contact with company about my files but haven't received an email back with reassurance.Paid monthly expecting logo to be in my hands.I like the site and they have great ideas. Communication is a fail so far to resolve my issue."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mattdg",
          "Nb_Reviews": 2,
          "Date": "2021-02-10T18:51:24.000Z",
          "Titre": "I signed up for a basic package through…",
          "Contenu": "I signed up for a basic package through Tailor Brands today . I recieved an invoice for a basic package to my email . i then get an email with an invoice for a premium package and my card has also been charged. I didn't sign up for a premium package and if i clicked on a feature that wasn't included in the basic package it didnt warn me and say it would charge me more for using that particular feature. I've sent the company an email and am awaiting a response.Update - they refunded me immediately and the customer service was good . I have a feeling they act in bad faith generally though and upgrade an account without the account holders knowledge and see what upgrades stick ."
        },
        {
          "Note": 2,
          "Lieu": "DO",
          "Pseudo": "Tania Tania",
          "Nb_Reviews": 3,
          "Date": "2020-06-29T14:58:46.000Z",
          "Titre": "Hi The Tailor Team!",
          "Contenu": "Hi The Tailor Team!I wrote you guys for help as Tania, I explained you situation and set you the invoices. Waiting for your response, I would like to highlight i want the subscription for 1 month not for the year  Thanks.."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2017-09-19T21:47:07.000Z",
          "Titre": "Im very frustrated with this company",
          "Contenu": "Im very frustrated with this company, i signed up for the premium logo package and immediately had problems i can not even login to my account. i can not download my logo i cant do anything inside of my account. i never received anything in my email even confirming my purchase! i keep getting a \"design break\" error message every time i try to login and when i was logged in i received the exact same error message.  i have reached out to customer support and have not received a single email back. i was very excited about my logo and really need it ASAP i am extremely upset that i payed $130 and have nothing to show for it!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eric Gregory",
          "Nb_Reviews": 1,
          "Date": "2018-01-21T21:18:42.000Z",
          "Titre": "Decent Product/Horrible Customer Support",
          "Contenu": "Decent product but customer service is HORRIBLE.  Nearly every one of their competitors offers real-time chat customer support, yet Tailor Brands has an email only support that can take an entire day or more to hear back on.  Insane."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tatia A. Mahaley",
          "Nb_Reviews": 2,
          "Date": "2020-11-13T03:47:48.000Z",
          "Titre": "Not happy with D no full name",
          "Contenu": "So I’m in the process of my website and I’m not happy it’s been nearly 2 weeks and “D.is very sketchy on his copy and paste skills and returning emails I feel like my project is held hostage. I’m not happy"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ummyusuf Sahar Abdus Sabur",
          "Nb_Reviews": 3,
          "Date": "2022-03-05T20:50:03.000Z",
          "Titre": "Limited to no communication",
          "Contenu": "We used this company to develop our logos. While the automated logo generator was pretty easy to use to get a logo, it is limited in its ability to correct the logo. Minor mistakes could not be fixed because the program hadn't been adjusted for it. In our case, one of the logo letters was lower cased even though we capitalized it when typing. We couldn't fix it because the program would not correct it and there was no one to actually speak to at tailor brands to correct the mistake. This was why we gave the company 2 stars. It is very hard to reach a human at this company. Chat is a bot that cannot deal with any specifics. No person. I also had a billing issue and could not get in touch with any humans. Very bad business practice. If you offer a service, especially in customizations, customers should be able to speak to someone if they need help."
        },
        {
          "Note": 2,
          "Lieu": "DK",
          "Pseudo": "Anne Sofie",
          "Nb_Reviews": 29,
          "Date": "2020-04-21T21:25:14.000Z",
          "Titre": "They took a bit more money than I…",
          "Contenu": "They took a bit more money than I thought I agreed toAnd when you bought the design, it was not a lot you could do with itA bit disappointing when you pay for a service like that"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Cheung Mark",
          "Nb_Reviews": 1,
          "Date": "2020-08-27T06:36:42.000Z",
          "Titre": "Good tools for making a brand but i got…",
          "Contenu": "Good tools for making a brand but i got scammed with their subscription services. Bought a single month and they upgraded me to a year sub without my knowing or consent."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Felicia Cheers",
          "Nb_Reviews": 1,
          "Date": "2022-12-04T17:08:02.000Z",
          "Titre": "Horrible customer service",
          "Contenu": "Horrible customer service. There seems to be no sense of urgency to resolve issues. I’ve experienced issues with the shopping cart on my site twice 1) the cart disappeared from the mobile site 2) when customers click the cart on the mobile, tablet and desktop site it takes them to the homepage instead of the cart. The second issue is ongoing. So, at this time my customers are unable to complete their order. It would be nice to have a phone number for support. Sending emails causes a  delay with getting issues resolved. When support has a question and you reply, it takes hours for them to respond to your reply. No orders completed = money lost for my company.Date: December 4, 2022This is a response to Tailor Brands comment below. The support team has not provided a solution. When I reached out yesterday for an update I was told they are still investigating."
        },
        {
          "Note": 2,
          "Lieu": "AE",
          "Pseudo": "olumidemichael Mide",
          "Nb_Reviews": 1,
          "Date": "2021-07-08T06:37:24.000Z",
          "Titre": "They try to reap you off once you link…",
          "Contenu": "They try to reap you off once you link your card to the site, Tho the app is great but they charge you for what you never requested and tell you no refund."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kern Saechao",
          "Nb_Reviews": 1,
          "Date": "2017-09-08T21:56:18.000Z",
          "Titre": "A handful of disappointments",
          "Contenu": "I recently upgrading to the premium plan thinking I would be able to change up my logo colors and whatnot only to find it keeps redirecting me to a \"design break\" page no matter what I am trying to change. I've been emailed back several times to no avail about fixing the problem. When I upgraded I tried to redeem an August50 code that would give me 50% off the regular price and I checked my bank account only to be charged the full price. The person who emailed back said the code was not redeemed and that she could apply that code to the next year's premium charge. Smh. Is this a joke? I end up paying $90 for the full premium plan only to be ripped off with technical issues that cannot be resolved. I would advise anyone, who were to ask me about this company, to \"redirect\" themselves to a different, more reliable branding website. Now I'm thinking I should have went with my first option of a branding website instead of my second. Utterly diasspointed."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Etid",
          "Nb_Reviews": 1,
          "Date": "2018-02-10T15:04:25.000Z",
          "Titre": "warning:unrequired subscription activation",
          "Contenu": "The design of the logo war fair, but i ended up with an unrequired monthly subscription to a unrequired service. very bad conduct!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charles Mathies",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T01:45:57.000Z",
          "Titre": "Wrong zip code on my stamp twice"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charles Dove",
          "Nb_Reviews": 1,
          "Date": "2018-11-17T23:09:12.000Z",
          "Titre": "OVER CHARGING MY ACCOUNT",
          "Contenu": "OVER CHARGING MY ACCOUNT, I use the logos but after some time they keep charging and you cannot unsubscribe on site"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Special Blend",
          "Nb_Reviews": 1,
          "Date": "2021-01-17T19:06:21.000Z",
          "Titre": "Hidden fees, not for all customers",
          "Contenu": "All I wanted was the logo that I created. Tailor Brands offers all other kinds of services, but for the logo they advertise is $9.99 for a 1 time fee- fair enough. Then, within a matter of hours I was charged an ADDITIONAL $61.89! I didn’t sign up for anything. I reached out to the company and got 2 responses that it was my fault for \"upgrading\" thats why I was charged more money.  Computers can be weird so I thought sure, maybe it was me. So I went back through the checkout process, twice, to see where I went wrong and to find the \"Upgrade\" option. That didn't exist. I emailed back and forth to finally get someone to agree to refund my money that was blindly tacked onto my order. The other weird thing was, the next day, my banks fraud department called me to ask if I placed that charge.. I explained the situation and they said they would watch it for a few days to see if I got the refund. They refunded me... $0.43 and my bank confirmed there was no further initiated refund. So we did what we had to do. Hope your experience is better than mine!Update 1/6/20: Thanks for your reply, Tailor Brands. I did email you back quite a few times, not sure why you said I didn’t. You also said you’d refund my money and you sent me a refund invoice for $0.43.. not $61.89. Looking forward to your reply."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Bonanni",
          "Nb_Reviews": 1,
          "Date": "2019-07-28T17:01:00.000Z",
          "Titre": "Management Challenged",
          "Contenu": "Good quality product, good delivery.TERRIBLE and nearly NONEXISTENT cancellation policy."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Holly Rickard",
          "Nb_Reviews": 1,
          "Date": "2017-08-08T22:02:56.000Z",
          "Titre": "Total rip off",
          "Contenu": "Total rip off. Designs are dated and careless. Don't provide editable artwork files."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "tyron hardeman",
          "Nb_Reviews": 1,
          "Date": "2021-10-19T08:23:02.000Z",
          "Titre": "I am really in love with my logo",
          "Contenu": "I am really in love with my logo. It's extremely professional."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jason Gellings",
          "Nb_Reviews": 1,
          "Date": "2017-08-22T18:36:16.000Z",
          "Titre": "Poor experience overall -- deceptive business practices",
          "Contenu": "Bad experience overall.    Deceptive renewal process.  Product itself is average.  The best you can hope for is an OK image.  Image widgets are all cookie-cutter stuff.  You cannot move on without \"accepting\" the design and then you can't make changes.   Image creation requires a subscription, which is essentially your actual fee for your image, since you are paying them for a non-service.  This allows them to market on legal websites as a free service add on when you're creating your company.   Since the subscription isn't your image fee, you don't get anything for free.  The (free) image fee is like $3 and the subscription is $40+   Documentation states that you can cancel at any time if you are no longer interested in the service, but my experience was very different.  From all appearances, they just sat and waited and hoped that you don't cancel your subscription. They will automatically renew you after your service term with no warning and they will not refund.   $80 a pop for an automated design...not good value.  If you get this referred to you as a free product from somewhere else, BEWARE.....  (****DID ISSUE REFUND AFTER NEGATIVE REVIEW****)****UPDATE****  After writing the negative review above, which I have also voluntarily softened, I was refunded my renewal money in full and offered a full year of service free of charge, so in the end, Tailor did make things right, and they did so politely and without placing any customer-facing blame (which is credit-worthy and difficult to do!!!).  It earned them another star, but it shouldn't have to be that way.   I do not intend to use the free service, as I would be holding them hostage.  Done is done."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Jack Cooper",
          "Nb_Reviews": 1,
          "Date": "2020-02-28T11:34:35.000Z",
          "Titre": "Watch out for their subscriptions as they renew without warning",
          "Contenu": "I loved my logo and subscribed to their service; life went on the venture didn't work out.Haven't used this company for the good part of a year and without any warning have been charged for my yearly subscription.I understand that this is how a subscription works but pretty much every other subscription service gives you a renewal email or warning stating that money is about to be taken out of your account as your subscription is about to be renewed.I Asked for a refund within the same day as their terms and conditions state a refund after 14 days. I also told them I had cancelled my subscription and asked if they terminate my account could I get a refund instead of having access for a year.Their support team told me that it's a subscription service and gave steps on how to cancel which I had already told them I had done. So I reiterated that I wanted a refund and that my subscription had been cancelled.A day went by with no reply, so I send a follow-up email the next morning and they respond offering me a 50% refund. I don’t see why a full refund would be an issue, they just state “Understand that we show the subscription nature of our site at all times”. Yes, I knew it was a subscription I was just asking for a refund as I’m in a difficult place and would have cancelled if I knew the £190 was about to be taken from my account without warning.The customer service is like pulling teeth, slow and painful. The product itself isn’t bad but nothing special.  But the company seems to just use this subscription service to profit off unexpected customers as a lot of other reviews on here state.UPDATE:They've come back to me and given me a full refund which I'm happy about. I feel like a lot of these negative reviews could be avoided if you sent out a renewal email."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aisha Gray",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:34:24.000Z",
          "Titre": "I did like the honesty and Dan was…",
          "Contenu": "I did like the honesty and Dan was helpful with explaining things. My issue is not with Dan, per say. However, I do feel that TailorBrands can throw less of a sales pitch and not require employees to do so, and allow it to happen naturally."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevon Jenkins",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T17:14:22.000Z",
          "Titre": "The rep wasn't as informed as I would…",
          "Contenu": "The rep wasn't as informed as I would have liked her to be, just seems like her main objective (which it Def seem like it was) was to just get u to pay and get other services. She couldn't really answer any questions or expound on anything on the site I was reading. But she was pleasant and patient I guess. But she couldn't even say when I would be updated then just gave me a number and say call them about the website and stuff. Which I think the team would have called me or something"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Greg Ford",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T02:50:33.000Z",
          "Titre": "Seemed a little rushed at times and…",
          "Contenu": "Seemed a little rushed at times and scripted; however, the information provided was accurate.  I had to listen really hard because it didn’t sound like English was her first language."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Parker Lydeen",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T00:44:08.000Z",
          "Titre": "The guy who helped me was very kind",
          "Contenu": "The guy who helped me was very kind. He seemed a bit flustered at times, perhaps I asked some questions he wasn't ready for. And perhaps it was because I applied from my phone and not a computer, but I did feel pressured to buy sertain services sometimes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kat Ketter",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T00:09:29.000Z",
          "Titre": "The customer service really misses the…",
          "Contenu": "The customer service really misses the mark. Agents will call you repeatedly while they were also texting you and asking you to pick up the phone. They don’t bother to ask for a preference as to how you’d like to be contacted or when you would like to be contacted. If I try to call into the customer service line, the self-service options are rather useless, and do not allow you to connect with an actual person. It’s pretty clear that a lot of their customer service help is probably outsourced."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LaRae Hens Bryant",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T18:25:28.000Z",
          "Titre": "Willing and able to help.",
          "Contenu": "The agent was very pleasant and willing to help me. However, he wasn't very knowledgeable probably because he was new."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:02:24.000Z",
          "Titre": "She was very patient with me",
          "Contenu": "She was very patient with me. I did not like how pushy she was trying to get me to purchase things."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Shafer",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T16:56:45.000Z",
          "Titre": "Absent support",
          "Contenu": "Update: After posting this I got an email back with an update on my LLC. A little disappointing that's what it took to get any attention, but they did provide an update.--I have been asking for updates on my LLC. I get friendly emails from the company saying \"we received your email and we care\" but no actual answer from anyone. It all seems very fake and automated. I have been told \"we're reaching out to our LLC team and someone will contact you soon\" but no one does. Service and support was very good when I first started and Tailor Brands was trying to get me to pay for various services. It has been basically absent since I had them submit my LLC application."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alicia Duff",
          "Nb_Reviews": 4,
          "Date": "2023-05-17T20:39:14.000Z",
          "Titre": "Would not use for first-time LLC creation",
          "Contenu": "They are slow to respond and do not make things very clear for someone who doesn’t really understand how to start an LLC or handle other legal issues. They also have an auto-response to emails that gets very frustrating because different people will send the same response."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "La Belle Vie Charcuterie LBVC",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T18:03:46.000Z",
          "Titre": "Could've been better.",
          "Contenu": "I didn’t really feel like all of the information throughout the process was well explained. I couldn’t understand the people when they spoke and they were pretty confusing. I felt like they constantly tried to upsale me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andria",
          "Nb_Reviews": 5,
          "Date": "2023-06-19T17:36:06.000Z",
          "Titre": "It's a good start",
          "Contenu": "It's like a one stop shop which makes it a novel idea but it can be hard to access sometimes because of antivirus software, it sometimes reads the site as spam or high risk although I've never had any issues like those and this site. It's also unconventional because it doesn't have any phone number to contact support everything is done though chat or email and I have mixed feelings about that. Overall it's a good site to start a business for someone whose just getting started"
        },
        {
          "Note": 3,
          "Lieu": "NG",
          "Pseudo": "Gary Roland",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T17:37:38.000Z",
          "Titre": "It’s a hassle that the customer care…",
          "Contenu": "It’s a hassle that the customer care agents don’t have all the information to help customers I.e legal info. Another thing I noticed is you may have to pay for your EIN separately if you file an LLC being a non American citizen not very convenient and this adds to the cost of the overall documentation. I think a 3 star is fair"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DreaB",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T21:25:29.000Z",
          "Titre": "Be careful to read the fine print",
          "Contenu": "Be careful to read the fine print. The platform is fairly easy to use is the one plus. The negatives include no live person to speak with pertaining to business and the company is not fully transparent as to billing. A lot of the services autorenew and there is no notification prior to the actual auto renew date. In addition, you have to go to several different pages in order to cancel separate parts of the subscription .And apparently there are no refunds.I would say it is very misleading."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Katrina Bradley",
          "Nb_Reviews": 3,
          "Date": "2023-05-25T00:27:19.000Z",
          "Titre": "I definitely like how easy it was to…",
          "Contenu": "I definitely like how easy it was to purchase and set up the LLC. At times I felt communication was lacking especially because I am a new small business owner. I wanted to be able to talk with someone over the phone and not have to do a “live chat” as sometimes what I was trying to relay to TailorBrands representatives weren’t understood. However, I do like the logo that I was able to create on the user-friendly webpage."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Suzanne Patras",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T02:30:46.000Z",
          "Titre": "Rep annoyance",
          "Contenu": "The customer service rep was extremely hard to understand, she kept mispronouncing my name and was very pushy. When I said no the first time that didn’t mean ask me 4 more times. The idea of the service is great, but the call before I was even done going through the forms to purchase it was not ok. I was in the credit card purchase screen and they were going to try and sell me on the phone or web no matter what. I did not like this process I should have had the option after I was done to call somebody not for somebody to talk at me, not listen and try and upsell me on every last thing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lisa Fernandez",
          "Nb_Reviews": 2,
          "Date": "2023-05-04T20:45:31.000Z",
          "Titre": "Relentless and dishonest upselling",
          "Contenu": "Relentless and dishonest upselling.  They repeatedly try to tell me not buying more stuff is not compliant with my state's laws.  Luckily I know better but I fear for people who don't.Edit to add on 5/3/23:  Their response below says I didn't get back to them.  You want to know when they sent this message that i didn't get back to?  36 MINUTES AGO.  On what planet is that giving me enough time to respond?? Dudes.  Please re-evaluate your whole customer service approach.  Harassment does not get the results you want. I promise.ETA 5/4/23:  They refunded me so we're good.  Just some (unsolicited) parting words of advice:  if your customer service department could come close to matching your marketing in terms of quality, you guys would be unstoppable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Renee Henry",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T04:01:28.000Z",
          "Titre": "Technical support",
          "Contenu": "It's harder to understand how to design the website by myself. I'm so discouraged because I haven't been able to make website be what it needs to be to help my business and I don't have the money to pay for the design services that you offer. I also haven't been able to access my business email even with the instructions that you provided."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James  Farmer",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T01:41:10.000Z",
          "Titre": "You really don't want to know how I…",
          "Contenu": "You really don't want to know how I feel about my experience. Because I'm really feel like. I got took for a ride."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kristina Molitor",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T21:03:04.000Z",
          "Titre": "Rep was pushy… trying to oversell felt."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bernard Bagayan",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T18:09:32.000Z",
          "Titre": "Website Builder",
          "Contenu": "Yonatan H provided outstanding 5-star service, and I want to thank him for that. But my experience with the website builder is 3 stars. The website builder was more complicated than I had anticipated. There should be more e-commerce template options in the website builder. Editing the website is difficult for me, especially when it comes to adding new products or advertisements."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "bfapgmail.com",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T12:08:52.000Z",
          "Titre": "I still have not received my paperwork…",
          "Contenu": "I still have not received my paperwork for my first LLC and I can’t find it anywhere either on your site or in the mail. All the platforms are staying that they cannot verify it with the state,"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patrice Bishop-Young",
          "Nb_Reviews": 4,
          "Date": "2023-02-09T15:13:22.000Z",
          "Titre": "I had a hard time getting through to a…",
          "Contenu": "I had a hard time getting through to a rep using the numbers I have. I decided to reach out via email and was able to resolve the issue and continue the process to secure my LLC application acceptance. I feel that the phone numbers should be utilized more. It's more convenient. But I'm grateful for the email as it provides digital proof of communication."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "nofreebeezyahoo.com",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T17:14:36.000Z",
          "Titre": "tailor brands made easy!",
          "Contenu": "tailor brands made this whole experience great and simple. would have gave it 5 stars but it always has more and more hidden fees . Other then that the whole set up was simple and easy. Great platform !"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "kevin palma",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T21:48:56.000Z",
          "Titre": "Not the best experience.",
          "Contenu": "Be prepared to spend somewhere in the tune of $1000 to start. This means getting all the legal paper work out of the way, custom domain, website etc. As i began my journey with Tailor brands it felt as if i was being upsold the entire time through a series of funnels. Why they advertise on youtube that getting set up with tailor brands is faster than making an omlette is beyond me needless to say that is not the case. I must admit I did get buyers remorse mostly because of the reviews i saw online and their false advertisment.  6 hours later, I emailed tailor brands to cancelled everything and naturally i asked for a refund. After two 30 minute on the phone, several emails which included 3 different reps denying my refund i finally got it.. I figured if its this frustrating getting a refund i cant imagine their customer service. Tailor brands i hope you are reading this and know that training your reps to lie to customers who experience buyers remorse into bullying them to stay with your services is wrong. Do better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Willing  Daniels",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T23:58:05.000Z",
          "Titre": "The agent didn’t understand a lot of my…",
          "Contenu": "The agent didn’t understand a lot of my questions?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alexander B Mercer",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T22:51:02.000Z",
          "Titre": "I’m glad it was convenient to process…",
          "Contenu": "I’m glad it was convenient to process all the paperwork and such, but your business development after launch doesn’t allow for creative professionals to input their own logo into your templates. I already have a brand and image I want to use but it won’t let me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Natalie Leone",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T23:06:42.000Z",
          "Titre": "I constantly receive calls and emails…",
          "Contenu": "I constantly receive calls and emails trying to upsell me on items I said I already had. The one service I needed was great and easy. The constant upsell attempts are not appreciated."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kalvin Webb",
          "Nb_Reviews": 2,
          "Date": "2023-06-27T02:33:47.000Z",
          "Titre": "Nothing spectacular",
          "Contenu": "Nothing spectacular I just paid for a service. Services was complete and I got all these free do it yourself items to finished building and branding my company."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "B Stone",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T14:49:12.000Z",
          "Titre": "Subscription service is questionable",
          "Contenu": "Paid $7.99 for a logo and branding for a family members birthday party. Think step and repeats and napkins type stuff. Small things needing logos and branding but made it more fun. Signed up with Tailor Brands, paid the $7.99 knowing it was a subscription and I’d cancel it the next month after the opening month charge and if I forgot I’d be out $20 total ($9.99 a month) the next month. Well, 15 months and $150 later found out they don’t notify you via email like every other major subscription service (Netflix, HBO, ISP’s, etc). So you continue to get charged and don’t know.  According to their customer service they notify you in the notification center within the website only. They don’t send you anything after you sign up and just wait for you to figure it out. Tried multiple times with them to get any type of partial refund and NO is all they say. The email I signed up with didn’t have a login and their password reset link didn’t work so I didn’t even have access to the notification Center where I was supposedly told I was still paying for the subscription. When I asked to cancel the subscription, they didn’t. Had to talk to another person who finally cancelled it and then told me the opposite and said they do send emails to the members direct email but when I told them I never received any such emails was still told no. Do not work with this company. They bank on people forgetting it’s a subscription and make it difficult for you to be aware you’re even being charged. The way it was handled makes me believe this is how they operate purposely. Look on other review sites. I’m not the only one. Once they get in, they want to keep their charges under the radar til, like me, years have gone by.Update….., they’ve refunded my money only since I submitted this review. Unfortunate it had to come to this but they assured me there are emails on subscription renewal sent to your main email."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sean Crowne",
          "Nb_Reviews": 2,
          "Date": "2023-09-02T01:49:05.000Z",
          "Titre": "The responses are automated and ignore…",
          "Contenu": "Edited* after I posted my review a customer service rep reached out to me and actually helped solve a lot of the problems I had with my service.( see below) but since then the company has been much better. I have to say the trademark department . In particular called and really made sure to walk me through the process answer questions and get everything in a timely manner. I’ve raised my rating from 1 to an 3, I want to say 4 but…That said I do believe they need to make the expediting process more clear. When they say do it in 4-5 business days they mean that they will submit it in that time, versus them taking 4 weeks to submit the form you already filled out and could very easily submit yourself in less time , this is still the main reason that one star is missing because it literally makes zero sense. The reply team should also be more attentive and pay attention to what is written to them. * originalThe responses are automated and ignore anything you write. The page is unclear and misleading, you WILL be overcharged and for things that are  redundant. They will then ask you to review or ask how service was then ignore you. My review went from 6 to 1 after the service was rendered because of the customer support team being ridiculous and ignoring everything I asked or said. If they actually listened it would be a great company and service but it is just a robotic reply machine."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kiana Washington",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T15:26:26.000Z",
          "Titre": "You helped me get my LLC but I have to…",
          "Contenu": "You helped me get my LLC but I have to pay for more stuff and I though I was done paying for things because I paid you guys . So it’s like I paid all this money for you guys to help me find a place to pay moreMoney"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda  Jones",
          "Nb_Reviews": 2,
          "Date": "2023-07-28T01:27:48.000Z",
          "Titre": "She very helpful and well detailed in…",
          "Contenu": "She very helpful and well detailed in information about my needs and what I wanted to accomplish in starting my own business."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sailorboy",
          "Nb_Reviews": 2,
          "Date": "2023-05-25T17:53:13.000Z",
          "Titre": "All paperwork was wrong",
          "Contenu": "All paperwork was wrong Couldn’t open bank accounts About to dissolve and start over with the florida website Also would like a refund"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Diane Champagne-Bedard",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T10:36:54.000Z",
          "Titre": "Website choices and website…",
          "Contenu": "Website choices and website consultation never happened. Not enough help for the cost"
        },
        {
          "Note": 3,
          "Lieu": "PT",
          "Pseudo": "Esquadria Gglr",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T23:09:40.000Z",
          "Titre": "more so",
          "Contenu": "the site is good, we can do a lot of stuff in it. its easyt o work with. i think the only thing that is not so good is your costumer help, you take tooo long to respond a request, and when it is not solved and we respond to you e-mail you take even longer. i think you should improve that aspetc."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Angel Jones",
          "Nb_Reviews": 3,
          "Date": "2023-06-01T12:00:56.000Z",
          "Titre": "My EIN is not recognized as a LLC. It can not be verified on Amazon and through TickTok shop",
          "Contenu": "My ein is not recognized. I had to set all my online channels up manually using my name and not my LLC. From there I will have to transfer everything to the LLC. So, I wasted a lot of money so far."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dylan Ragan",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T15:29:11.000Z",
          "Titre": "I'm trying to get a refund from my llc…",
          "Contenu": "I'm trying to get a refund from my llc service that I can't use and nobody is listening to me. Please help me.Update- I got a refund in a timely manner.Thank you for that at least"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jose Molina",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T00:49:25.000Z",
          "Titre": "Forgot to mention a few things",
          "Contenu": "Forgot to mention that is not just an LLC you're buying there are also a bunch more of extra expenses involved like buying a poster Osha permit and one more or two more items I forgot to name mandated by the state that need to be taken under consideration."
        },
        {
          "Note": 3,
          "Lieu": "BD",
          "Pseudo": "the bong gue",
          "Nb_Reviews": 2,
          "Date": "2023-04-08T20:11:51.000Z",
          "Titre": "Yes I like the company very much and…",
          "Contenu": "Yes I like the company very much and the company will do better in the future and will be in a better position."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jumau Wilcox",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T17:02:44.000Z",
          "Titre": "I asked for someone to call me to…",
          "Contenu": "I asked for someone to call me to assist with my business info filling still have not received a call. I have been emailed but not called"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sabrina F. Salters",
          "Nb_Reviews": 2,
          "Date": "2023-05-23T11:30:03.000Z",
          "Titre": "What I dislike was not being clear…",
          "Contenu": "What I dislike was not being clear about the price for trademark the logo."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Adrian Mathura",
          "Nb_Reviews": 2,
          "Date": "2022-10-26T23:05:51.000Z",
          "Titre": "Seamless Sale & Design, but Up-Selling too Much",
          "Contenu": "I found your design and sale process seamless, but was overwhelmed by the numbers of ADD-ON Costs and Services for the LLC Registration, including the $49 Tailor processing cost; which was not made explicit in the Sale of the Annual Subscription package (which included LLC set-up).  So somewhat disappointed, and may cancel after the 1st Year - TBD."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joel Wright",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T03:32:47.000Z",
          "Titre": "A little more transparency on the…",
          "Contenu": "A little more transparency on the website would be nice."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Derek Short",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T14:37:28.000Z",
          "Titre": "OVER charging customers.",
          "Contenu": "Why am I getting charged $72 dollars when signing up for the $10 monthly fee. awful.EDIT: They refunded me, be careful when you are signing up because it is VERY misleading as I chose the 9.99$ option and then get you last second without knowing that they want you to sign up for the yearly. Thanks for the refund but still make your website more clear to its customers so this mistake doesn’t happen to more folks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vivian Arias",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T18:49:58.000Z",
          "Titre": "I wanted multiple members in my LLC",
          "Contenu": "I wanted multiple members in my LLC.  your help says that I had a choice to do that after purchase?  where do i do this?????"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "essence scott",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T21:12:43.000Z",
          "Titre": "Better help with my llc rich ladies…",
          "Contenu": "Better help with my llc rich ladies boss store and rstore new york"
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Edgar Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T17:11:38.000Z",
          "Titre": "The only thing i dislike is that…",
          "Contenu": "The only thing i dislike is that ....the page don't have other ways to pay"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nicole Aikens",
          "Nb_Reviews": 1,
          "Date": "2022-10-15T16:29:36.000Z",
          "Titre": "There is not an actual live chat or…",
          "Contenu": "There is not an actual live chat or customer service that can be called and talked to. My problem was resolved but I had to wait until the next day. Not being able to talk to a live person is frustrating"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cicero Caston",
          "Nb_Reviews": 2,
          "Date": "2022-11-14T18:41:08.000Z",
          "Titre": "I hates that it's take a week or more…",
          "Contenu": "I hates that it's take a week or more to get the paperwork sent out to Us!?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TopDog Pet Sitting",
          "Nb_Reviews": 1,
          "Date": "2022-09-12T18:01:01.000Z",
          "Titre": "Crossing my fingers",
          "Contenu": "I’m becoming a bit skeptical of this website now that I have read more, I am waiting daily for my LLC information to come through. I really hope it’s just the state that is taking a long time and I didn’t waste time and get ripped off! *Fingers crossed* I got insurance through this site and it was incredibly easy to do, and extremely affordable.I still have not recieved my LLC now it says that the date it inapplicable there is no way for me to send you my email because you guys don’t have a real person to contact. My email is topdogpetsittingservices@gmail"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mrs Ani",
          "Nb_Reviews": 5,
          "Date": "2022-06-22T06:59:41.000Z",
          "Titre": "Designing my label was straight…",
          "Contenu": "Designing my label was straight forward! The design came out out perfectly as o expected. Buying the Premium package doesn’t cover all expenses, you will still be required to pay for an additional amount e.g domain name, even though it’s supposed to be covered in you package."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Jeffers",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T22:59:26.000Z",
          "Titre": "Not for me",
          "Contenu": "I guess he explained as best he could your methods of operation , do I have confidence? No would I buy more of your products? No , am I aware of the status of my current LLC? No"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Seth Bell",
          "Nb_Reviews": 3,
          "Date": "2022-08-22T19:15:18.000Z",
          "Titre": "The logo designer is great",
          "Contenu": "The logo designer is great. Fast and easy to use.The rest of the website is pushy sales tactics, unnecessary services with increased pricing and slow customer service responses."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Amir",
          "Nb_Reviews": 1,
          "Date": "2022-01-09T19:43:11.000Z",
          "Titre": "Helpful support but buggy service",
          "Contenu": "The service is declared very unclear. I didnt know for example that I cant change the logo for my company once i created one. But the Support is quite helpful. But I still need to see somewhere what is included in every plan. The website is also a little buggy. I cant download the logo for instagram neither on phone nore on PC."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Windy F.",
          "Nb_Reviews": 1,
          "Date": "2022-02-02T13:13:19.000Z",
          "Titre": "Something Shady going on with this site. do not buy",
          "Contenu": "Original:I love my new logo for my fresh, budding business.POST EDIT:It's true, initially I gave it 5 stars, now I would give it ZERO stars if I could. They are scammers. I clicked on the button for $10/month but they bill me for $71.88. What the fudge. Their site also says no refunds, so I am going to get my bank to sort this out. It's not Tailor Brands it is Tailor BANDITS. Go suck a ----.POST POST EDIT:Ok, they fix my problem and I got my money back. So 3 stars for the inconvenience."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Aroa Fernandez",
          "Nb_Reviews": 1,
          "Date": "2021-11-18T22:51:27.000Z",
          "Titre": "I love the logo design feature",
          "Contenu": "I love the logo design feature. However, I try to pay 13 pounds for the standard plan, and at the last moment, it appears a message and my plan changed to 47! I don't know what's included... Please, can someone contact me? I wish to stay with the standard plan by 13 pounds. In case I like I will upgrade"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carly Clemons",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T20:54:39.000Z",
          "Titre": "It’s not very user friendly",
          "Contenu": "It’s not very user friendly, and not exactly transparent about what they charge you. But maybe I’m just stupid. I’m also on an iPad, maybe the desktop version is easier to use. I’m hoping so. But it did help me create a beautiful logo and it was easy to lock in the domain for the website. It’s just not easy to edit the website. All in all, it’s good not great."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mat Bednarski",
          "Nb_Reviews": 8,
          "Date": "2021-03-25T17:28:35.000Z",
          "Titre": "Only signed up for one month paying…",
          "Contenu": "Only signed up for one month paying £6.99. Then, they have suddenly taken £49 off my credit card charging me for an annual subscription!!!! Without my consent!!!I am disputing the matter with my credit card company. AVOID AVOID AVOID!Uodate 25.3.21:The company has replied to my complaint, apologised and provided me with refund."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "A F",
          "Nb_Reviews": 8,
          "Date": "2021-01-07T08:23:57.000Z",
          "Titre": "Unclear fees",
          "Contenu": "I've since changes this from 1, to 3 stars. They were quick to resolve the issue (though I' still waiting for a refund), but I maintain that the pricing structure is unclear and it encourages you to spend more that necessary, which I don't find entirely 'fair' for customers"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jessie Hicks",
          "Nb_Reviews": 1,
          "Date": "2019-02-04T15:34:04.000Z",
          "Titre": "An  update to  I was led to believe…",
          "Contenu": "Tailor brands resolved the issue the following day and I am using them but I am not completely satisfied with the functionality of what I purchased but on their behalf I have not had the time to contact customer support to see if I can get some of the help that they claim to offer. So with that in mind I will give them the benefit of the doubt, over all I like the look of the logo they designed for me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jaimie Shaw",
          "Nb_Reviews": 1,
          "Date": "2018-01-17T15:50:26.000Z",
          "Titre": "Email only customer service is problematic",
          "Contenu": "The designs are great; however, reaching customer service is problematic. They are only available via email and their given response time is 24-48 hours. Trouble shooting technical issues via email is problematic in that I was told in the response email to “use Chrome and disable ad blocker” as if I wouldn’t have tried these solutions on my own. As a result, I have to email again and wait another 24-48 hours. Meanwhile, I’m trying to run a business... again, good product if you never need their actual support."
        },
        {
          "Note": 3,
          "Lieu": "GH",
          "Pseudo": "Samuel Hughes Mensah",
          "Nb_Reviews": 1,
          "Date": "2021-10-27T10:47:05.000Z",
          "Titre": "My Fee has been refunded to me.",
          "Contenu": "The TailorBrand team has refunded my fee and apologized for the error. Moving forward they are to stop automatically converting Monthly plans to Annual Plans.Once a user clicks on Monthly Plan, the user must be billed so."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MichaelJ",
          "Nb_Reviews": 1,
          "Date": "2021-09-28T13:53:05.000Z",
          "Titre": "Beware Shady Billing Practices!!!!",
          "Contenu": "Be very aware what you do with this site.  Last year I tested it for a logo, and ended up paying $71 for a logo I didn't use.  I didn't know at the time they also signed me for an \"annual subscription\". 2 days ago I see a charge for $71.88.  I wrote to ask for that to be refunded and they refused.  Haven't used the service cancelled account and still they refused to refund my money.  Don't use these folks, they will find some way to take your money in ways you hadn't thought of.  Stay safe out there! UPDATE:  After posting this review TB did escalate my ticket and indeed did finally refund the $ in question, in full.  Never too late to do the right thing. Thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marylin Braxton",
          "Nb_Reviews": 1,
          "Date": "2022-07-09T14:59:21.000Z",
          "Titre": "The site is very basic",
          "Contenu": "The site is very basic. There isn't different website templates to choose from. It will do the job for just starting up. It just needs more variety."
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Eldric Chew",
          "Nb_Reviews": 2,
          "Date": "2020-11-01T08:24:32.000Z",
          "Titre": "Had to make slight changes to the…",
          "Contenu": "Had to make slight changes to the company name however I wanted to keep the design. however it will not generate the same thing if i go back to change the name nor could i make changes to the existing logo at the point of choosing."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Aleks",
          "Nb_Reviews": 2,
          "Date": "2020-10-26T21:32:53.000Z",
          "Titre": "Customer service? Are you there??!",
          "Contenu": "I am  no still waiting for customer support since Friday. I need my DNS details changed to link the domain to my email. It’s useless making my website live if the email link doesn’t work!The logo and website builders are great."
        },
        {
          "Note": 3,
          "Lieu": "DK",
          "Pseudo": "Thomas",
          "Nb_Reviews": 12,
          "Date": "2021-11-02T08:28:06.000Z",
          "Titre": "Needed a logo for a t-shirt",
          "Contenu": "UPDATE: Following my review, Tailor Brands reached out and offered to solve the matter for me in an effective way. This was a great rebounce of an otherwise less than optimal experience. I ended up with receiving the service that I needed. Thank you.ORIGINAL REVIEW: Needed a logo for a t-shirt. Found this page that promised a free logo. When logo was designed, you cannot do anything without subscribing. I decided I would subscribe - you need to sign up for a full year. I did under the promise of an upgrade making it possible to download the logo for printing. Once I paid, i found that only low res download was available unless I upgraded to an even more expensive sub, which would allow me to download the vector graphic file that I needed. Total hoax."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Trust the truth",
          "Nb_Reviews": 9,
          "Date": "2017-09-18T13:19:54.000Z",
          "Titre": "Hi i had a problem downloading some of …",
          "Contenu": "Hi i had a problem downloading some of the items but was of no fault of tailor brand. For some reason my laptop was not downloading the item on the right software. However. after one month they tried to charge again when I specific told them I only wanted the Logo as it was included I created some social post but now am not allowed to access the previously created designs... I liked the design but I do not think they are clear about their services. I would advise them to have an option to buy only the logo without anything else rather then trying to charge the client then blocking access to what they already created ;("
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Bunny",
          "Nb_Reviews": 1,
          "Date": "2020-02-15T15:43:47.000Z",
          "Titre": "Great apps",
          "Contenu": "Great apps. The majority of the system is fine. I've read the review of some thanks to them I've managed to save myself from an auto deduction, even when my subscription was only for a month. They attempt to charge it again for the price of a month.Whoops, your payment failed.Let's fix it.We need your help!Unfortunately our recent attempt to charge the amount of $19.99 towards your Tailor Brands subscription has failed.Thanks to Paypal I managed to remove and unsubscribe all the auto payments that I did not want it to happen. Great Apps I love it. To those who want to try it out and reading this review hope it helps if you are just trying out for a month."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William w Macharia",
          "Nb_Reviews": 3,
          "Date": "2022-09-28T09:54:21.000Z",
          "Titre": "Have been waiting for my website to be…",
          "Contenu": "Have been waiting for my website to be complete so far haven't had any updates for a week."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lezlie Scott",
          "Nb_Reviews": 2,
          "Date": "2021-02-26T03:06:38.000Z",
          "Titre": "Discount for 1 thing they mention add on later and don't offer monthly plan payments that sucks for the poor guy or gal.",
          "Contenu": "You only give a discount for one plan and the add on are misleading and now I still have to pay something monthly. Im just getting started I need help not pulling my pockets.  They are already empty."
        },
        {
          "Note": 3,
          "Lieu": "KR",
          "Pseudo": "SangWoo Yi",
          "Nb_Reviews": 1,
          "Date": "2020-12-28T19:23:44.000Z",
          "Titre": "Well",
          "Contenu": "Well, I really appreciate that you still are concerning of my feedback. One thing I would like to complain about your service.1, It is difficult to modify as I like it from your design sample I choose, to the amateur like me. For example, if I want to change square angle to the round, no idea how to simply change it and also to change the colors, confused.2, payment, it is better to the one time user if you prepare the payment system for one initial design how much, peoples will hesitate to pay monthly base. I will choose to buy one design base if it is slightly expensive. 3, Especially, it is good and simple to choose initial design what I want from your AI idea but it is complicated how to buy it immediately and modify it as I like.  That is my opinion~~~ Regards."
        },
        {
          "Note": 3,
          "Lieu": "KE",
          "Pseudo": "Shirley",
          "Nb_Reviews": 1,
          "Date": "2019-07-31T09:27:04.000Z",
          "Titre": "I am a new user of TailorBrands and I was…",
          "Contenu": "I am a user of TailorBrands and I was quite impressed by the output of my logo and brand. However I have the following issues post purchase that are inhibiting my trust;1. I accidentally paid an annual subscription for the wrong design and I wrote emails to their team to help rectify. Its taking a bit long for me to get a clear answer. The correct design is under a monthly subscription and I would like if this was considered for the paid annual subscription instead of the wrong one.2. I had my card deducted for this month without any notification. If we users could easily find a place in our accounts to cancel our subscriptions it would be great. 3. Can the team put more effort on a support team that addresses post purchase challenges?"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Tians Marie",
          "Nb_Reviews": 2,
          "Date": "2020-03-19T15:22:43.000Z",
          "Titre": "refunded My subscription charges. Thank you.",
          "Contenu": "They have an auto renew subscription which is an annual charge.   Mine renewed without ever having an email to inform me it was about to and then I cancelled it immediately and they wouldn’t refund the money even though I literally cancelled my subscription on DAY ONE of the renewal. Finally someone said they will only refund 50% of the $60 I was charged. They need to have a courtesy email to tell people the subscription is about to renew because clearly this happens a lot. Or at least have it expire and remind people to renew if they want to. After going back and forth a few times they decided to refund the entire amount. I’m satisfied with this and hopefully they can adjust their policies to stop having angry customers in the first place.  Thanks for the refund."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "steven",
          "Nb_Reviews": 2,
          "Date": "2022-02-22T19:33:15.000Z",
          "Titre": "Very disappointed with this company",
          "Contenu": "Very disappointed with this company. 1) Automatically registered for subscription service although only wanted the service for a single year to try them out. 2) I received so many emails from company, but conveniently (for them) no email regarding renewal of  service. I find that dishonest, but thats my opinion. 3) two days after renewal i message customer service regarding refund. I am advised thats not in company policy. So i should pay $200 dollars for a service i do not want.Honestly, I'm very disgusted by companies without morals and conscience. This is one company i think you should avoid.***update I was offered a 50% refund, which i accepted. Customer service was quick and did their best to assist. I would only recommend to the company that transparency builds trust. It is better to inform your customers of upcoming obligations,   if you have a good product they will stay. But i understand its about business."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian Chambers",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T07:11:36.000Z",
          "Titre": "The extra charges not known is…",
          "Contenu": "The extra charges not known is annoying. The timing and getting the work accomplished is slow. I am having just a decent experience but could be better"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brandy M. Miller",
          "Nb_Reviews": 2,
          "Date": "2022-04-25T17:14:15.012Z",
          "Titre": "Disappointing, but you get what you pay for.",
          "Contenu": "The logo building part was great, but the social media post generators were terrible. Not at all impressed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Orawan Turner",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T17:51:27.000Z",
          "Titre": "I get good help but website needs some…",
          "Contenu": "I get good help but website needs some work"
        },
        {
          "Note": 3,
          "Lieu": "MZ",
          "Pseudo": "David Júnior",
          "Nb_Reviews": 1,
          "Date": "2020-12-27T16:41:29.000Z",
          "Titre": "I like the logo but the promotions was…",
          "Contenu": "I like the logo but the promotions was not really, you didn't reduce anything, the price is the same from last time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robbie  Barsh",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T16:17:36.000Z",
          "Titre": "Have your money right",
          "Contenu": "They tell you is free if not free"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Julie A Gallardo",
          "Nb_Reviews": 1,
          "Date": "2022-02-05T05:42:58.000Z",
          "Titre": "In between",
          "Contenu": "Prices are misleading, platform is a bit limited as far as logo creation and design options."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aaron J.",
          "Nb_Reviews": 7,
          "Date": "2023-01-20T13:29:20.000Z",
          "Titre": "Customer service is really bad",
          "Contenu": "Customer service is really bad. Website is rarely working making it difficult to log into my account.***Update*** A representative from customer satisfaction did contact me and issued me a refund. They did address my issue so I will re-rate my experience from 2 stars to 3 stars."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amy Enman",
          "Nb_Reviews": 1,
          "Date": "2019-03-12T20:48:17.000Z",
          "Titre": "I really do want to give it 5 stars... but",
          "Contenu": "MAN!  I want to give this service 5 stars.  I do!  BUT the information on the support site is not complete and there is no way to get a simple question answered.  I paid for 1 year of premium services and I am totally frustrated with having a hard deadline to get a horizontal version of the super whami-dyne  vertical logo I designed there and not being able to get the algorithm to spit out the proper font or edit the logo I own into a different configuration!  Yes, I sent the appropriate email to customer support (which warns you that if you send more than one you get bumped to the end of the line every time) but waiting up to 48 hours for a simple answer of \"You can't do that.\" or \"Oh, go here!\" is truly peeving me.  A serious lack of customer support.  For a company that has the computer generate the logo selection and requires minimal staffing, Tailor brands could add the human element into the experience by having a phone number for guidance.  The support pages are not very clear on editing your purchased logo and from other reviews I am reading now it seems I am not the only one who has experienced this."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Devashis Sarangi",
          "Nb_Reviews": 4,
          "Date": "2019-12-10T18:01:19.000Z",
          "Titre": "Bad experience, customer service addressed it.",
          "Contenu": "10th December Update:-------------------------------------------The company reached out to me and offered to refund half and subsequently refunded me the full amount. I wish I did not have to go through the process. Suggestion to tailorbrands, you have a good product and it is equally important to manage the customer experience. Thank you for the refund!-------------Initial Review--------------I wish I had seen the trustpilot reviews before getting on to this site for building my logo.Victim of subscription game. I was charged 19.99$ recurring. I reached out asking for a refund and cancel the service. No response. I reached out to paypal and paypal declined my request since there is a billing agreement somewhere.Helping customers make them come back... nailing them, nails the brand. Learn to manage your own branding before trying to manage brands for customers.Good luck!Some other details: Even though they say, pay us and we will let you modify your logo, they truly dont. For the 2 times I had to change my logo, I had to reach out to customer care and their response was more like, we will let you make a change as a favor.Stay Away!!!!!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Gareth Williams",
          "Nb_Reviews": 2,
          "Date": "2019-06-11T09:26:22.000Z",
          "Titre": "This rating might have been higher had…",
          "Contenu": "This rating might have been higher had I not decided to build a website on their site. If you find a logo and branding that you like then go for it but don't sign on for more features as thats where the headaches begin.There is no instant customer service just an email which isn't the slowest response time but makes it more frustrating when you have follow up questions to then have to wait a day.My issue I have reached is attaching an external domain to my website on tailor brands it just wont connect i asked customer service what information i needed to give my provider to connect the two and was sent a generic step by step thats on the help centre for connecting a tailor brand site to a tailor brand domain. I also asked how to use my SSL certificate but this along with my actual question was ignored based on the response i would was the CS person just sent a generic response without reading the contents of my email.Their logo design system is simple and easy to use the marketing tools and step by step they have for creating your brand is really user friendly but in terms of using them to host or use their web builder use an alternative well established provider."
        },
        {
          "Note": 3,
          "Lieu": "JM",
          "Pseudo": "Kept Homes Cleaning Services",
          "Nb_Reviews": 1,
          "Date": "2021-10-21T20:11:51.000Z",
          "Titre": "It was quick and easy",
          "Contenu": "It was quick and easy. Would love to have the ability to move things around on the logo"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mario Torres",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T18:08:23.000Z",
          "Titre": "Very informative,"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charlene Talley Gwin",
          "Nb_Reviews": 1,
          "Date": "2019-07-29T18:59:52.000Z",
          "Titre": "TAILOR BRANDS LOGOS needs to do better job up front",
          "Contenu": "EDITED - UPDATE 7/29/19:Tailor Brands has now issued a refund for the $39.99 charge.They need to offer a logo ONLY option without SUBSCRIPTION.I specifically asked about more charges and was told in a chat box that there would be no more charges beyond the initial charge and that the logo files would belong to me.Evidently, elsewhere on their website (but NOT on the logo design pages) they indicate that they sell subscriptions.  It felt very misleading that info on subscriptions was not disclosed on any of the web pages that I was utilizing to choose the logo design.I think if they offer the logo ONLY option that their reviews will improve.  They do not need to trick people into a subscription.  I am sure there are lots of people that will want and appreciate the subscription option.~~~~~~~~~~~~~~~~~~~~~~~~~~~I paid $29.99 for a single set of logo files on June 18, 2019 with Paypal.Today, July 18, I got notification from Pay Pal that Taylor Brands has charged me another, $39.99 that t I did not agree to, did not want. Of course there is no phone number on their website.There is not even a way to log in to delete an account that I do not have in the first place.I sent an email to Tailor Brands and have disputed the charge with Paypal.original [DO NOT TRUST THIS WEBSITE OR COMPANY.]"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KingV",
          "Nb_Reviews": 1,
          "Date": "2021-12-27T19:34:29.000Z",
          "Titre": "Love the ideas and designs",
          "Contenu": "Love the ideas and designs! As well how everything is well set. Great job."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mario R.",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T19:58:36.000Z",
          "Titre": "Try to sell add ons."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jordan Deren Smith",
          "Nb_Reviews": 1,
          "Date": "2020-02-27T15:10:28.000Z",
          "Titre": "I initially really enjoyed the product",
          "Contenu": "Edit: Was a one star. I ended up getting a refund. My client is happy with the logo. I still don't know if I would ever use this service again. It doesn't feel as fluid as I would like. Sometimes you are in your account and other times you are not. I genuinely dislike the whole subscription service. I'd prefer to have an option to by the one logo I wanted to create. Even if it was a higher price. I am a developer and the fact that I \"accidentally\" signed up fir the upgrade should show you how risky this is. Definitely am canceling my subscription as soon as my client is work is done. I initially really enjoyed the product. I bought the one month subscription. Showed my client the logo and asked for a tagline to be included. So went to edit it and add a tag line. I was able to add one but not change the text. So I was looking into creating another one. The page continued to redirect me out of my account to create (and buy) a new one. I wasn't a fan of that. So I looked at my plan to see if upgrading it would allow me to change a simple tagline font...Then I saw I had a 12 month subscription. I looked at my account and saw that after my $9.99 was charged. There was a $38 charge on my bank account the moment after I was charged $9. This is unacceptable. Had I not had client feed back I don't think I would have noticed the additional charge."
        },
        {
          "Note": 3,
          "Lieu": "TR",
          "Pseudo": "Murat T",
          "Nb_Reviews": 2,
          "Date": "2022-04-12T11:36:19.000Z",
          "Titre": "Expensive",
          "Contenu": "Thank you. It would be better if there would be a more options."
        },
        {
          "Note": 3,
          "Lieu": "CM",
          "Pseudo": "Compte Online",
          "Nb_Reviews": 1,
          "Date": "2019-12-07T04:06:26.000Z",
          "Titre": "GOOD MORNING LZ I WANTED TO CORRECT THE…",
          "Contenu": "GOOD MORNING plZ I WANTED TO CORRECT THE WRITTING OF MY LOGO IN TAILOR BRAND"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cory  Davaz",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T20:33:48.000Z",
          "Titre": "Ann tailorbrands"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alex Paul",
          "Nb_Reviews": 2,
          "Date": "2019-06-20T14:22:14.000Z",
          "Titre": "As the costumer: better study up on domains, websites, IoT, etc... else your expectations might be in for it, no one can make it that easy.",
          "Contenu": "Everything looked promising until I needed to connect my domain to my website. Both of which you create through Tailor Brands Business Guide Process. I follow their \"Help Center\" which tells me to change a few things in the DNS Domain settings. Then, it tells you to contact Tailor Brands Support, which I did...repeatedly, and they don't do anything other than ask what I need help with.   I also sent pictures of the steps I taken. When you go to publish your website it asks for your url/domain, which I put in, and it says it's a licensed site(my site). Then, it publishes the website using an irrelevant url anyway.    Hard to reinforce my branding, make my website easier to recall, or convey what the website is all about if the url doesn't make sense. They keep telling me to repeat things and say that their FAQ is wrong. In the end, I have to forward with masking which didn't make sense, considering how pointless their Step-By-Step guide is that makes you \"Select\" your domain, then forwarding to your \"free\" website domain. Why am I paying for a domain when they make your website publish/connect to a free alternative?  They tell you to change some CNAME and A settings that point to the heroko design website. When I type in my domain, it brings me there. This is telling me I should be able to connect my actual website, but Tailor Brands is avoiding the issue. Update: They tell me more things to do that I already tried. My domain is useless since publishing to it doesn't do anything. I don't want to mask since it makes the site look less transparent. Oh well, at least the customer service is nice about it and \"seem\" to be making an effort.Updated Conclusion: Customer Service is decent and the services are okay, but the outcome isn't as expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keyon Antoine",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T22:41:05.000Z",
          "Titre": "The customer service was exceptional",
          "Contenu": "The customer service was exceptional. John, clarified everything for me and was very patient in the process. The only downside was the unexpected cost and that you get charged for setting up free things like EIN’s and Business emails."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KGregory",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T04:32:57.000Z",
          "Titre": "I can't believe I have a business now!",
          "Contenu": "Everything happened so fast, it's a bit of a blur. I am happy to have had someone walk me through the application process and answer my questions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Neff",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T06:24:04.000Z",
          "Titre": "Gee was very helpful",
          "Contenu": "Gee was very helpful. I appreciated that she wasn’t overly pushy with the sales and let me make the best decision for my business"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nicholas Beach",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T23:15:59.000Z",
          "Titre": "The simplicity of the site made it easy…",
          "Contenu": "The simplicity of the site made it easy to set everything up. But the constant phone calls and language barrier made it difficult to understand the person that called."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Trenell Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T19:49:33.000Z",
          "Titre": "They are really helpful",
          "Contenu": "They are really helpful! Plenty of tools and services for new and existing business owners! It’s definitely a creators service!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "FRANKO BUDJET",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T18:27:08.000Z",
          "Titre": "Business Registration.",
          "Contenu": "They helped me complete my Business Registration.  And Chris who spoke with me was Nice, Friendly and was Patient enough to explained what I didn't understand."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Punya Saleekul",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T23:18:09.000Z",
          "Titre": "Helpful but felt like i was being… sold to hard and not enough of what i needed",
          "Contenu": "Helpful but felt like i was being pushed to buy the packages and less of what is best for me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Helene",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T07:21:12.000Z",
          "Titre": "Mae was very professional",
          "Contenu": "Mae was very professional, attentive and helpful to my questions specifically for my first time talking about starting a business."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jeremy",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T03:03:13.000Z",
          "Titre": "Summer was very informative and was a…",
          "Contenu": "Summer was very informative and was a big help in making my decisions. She answer every question I had and was looking out for my best interest. Very helpful and Patient Only complaint, options for  certain decisions were not shared in a way that is comfortable for the client. At times felt pressure to make decisions that I was not comfortable making or couldn't make at the moment even though she came across with her view point in my best interest."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terrance Henry",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T05:15:01.000Z",
          "Titre": "This was easy.",
          "Contenu": "This was the easiest way of creating my LLC. I would recommend Tailor Brands to everyone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cecil N",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T07:00:21.000Z",
          "Titre": "Flexible in helping customers",
          "Contenu": "The company seems flexible when it comes to helping customers. On the other hand, it would be better to know ahead of time that one will be charged many other services during the registration process and know what those services are. That's better than discovering them during the registration process of my company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jonathon Garvin",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T05:57:59.000Z",
          "Titre": "Most everything went well and smoothly…",
          "Contenu": "Most everything went well and smoothly however, I was not quite prepared to design my logo and website and for a short time they were very pushy in trying to get me to go ahead even though I was not ready. To be fair after about 2 weeks they stopped with the pressure. Maybe a once a week or once every couple weeks may be a better approach to reminding someone about what is left to be completed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim B",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T23:26:37.000Z",
          "Titre": "Drinking from a firehose",
          "Contenu": "Helpful phone call to get everything going.  Overall, the process was decent, albeit a bit like drinking from a firehose as soon as you submit your phone number, because they will call you that moment to start moving forward with everything.Lots of additional services during the setup process, but I knew this was the business model up front.Buckle up, you'll have a company before you know you started."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kwil",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T01:14:34.000Z",
          "Titre": "Representative helpful, Taylor Brands surprising costs",
          "Contenu": "Annabelle was great! very helpful. However the costs with Taylor brands and the explanations of the services leave much to be desired. I feel at every click there is an unexpected fee where my focus on my first business start up was to Trademark my name"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Samia Silver",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T01:36:10.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Walked me through every part of the experience!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tigarhead LLC Tamara Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T18:40:36.000Z",
          "Titre": "All my questions were answered",
          "Contenu": "All my questions were answered, I feel more confident working with Tailor Brands and their agents. Thank you Anabelle and Ivan for all your help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Oscar C",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T02:08:04.000Z",
          "Titre": "I would like to give Tailor Brands 5…",
          "Contenu": "I would like to give Tailor Brands 5 stars, but I can't get answers on making my LLC a Veteran owned business.I shouldn't have to pay the TX state fees.  I think I'm gonna have to deal with this matter on my own.I really want my Texas Veteran Business Owned Logo, but I'll figure it out.Everything else seems to be running good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Maynor",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T01:43:17.000Z",
          "Titre": "Service a respect.",
          "Contenu": "Kyle was very knowledgeable and informed me every step of the way. I didnt need some of thenservices which he said would still be available for a small feeif i needed them in the future. Application was easy to complete. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NINA  GYAMFI",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T05:01:42.000Z",
          "Titre": "It was a really good experience and…",
          "Contenu": "It was a really good experience and great working with Tailor brands, immediately you sign up for the services. They literally call you and go through every single thing this year so don't worry if you have trouble there will help you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T17:06:26.000Z",
          "Titre": "The experience with this representative…",
          "Contenu": "The experience with this representative was good. I have chosen to leave Tailor Brands for a few reasons. Getting my website developed was very challenging and O received little help from Tailor when I had a question. Emails tale 3 to 4 days to get a response.and there is no phone number to call for assistance. I have experience frequently that no one is available via chat I have had to leave a message only to get a response that is delayed and leaves me with additional questions that then take 3 days to finally get all my answers. The lack of customer support is highly disappointing and disruptive to my business."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Calvin Nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T16:59:22.000Z",
          "Titre": "As it turned out Tailor Brands is very careless... but they do their best to resolve the problem.",
          "Contenu": "This is an update to my previous ratings...Sometimes, problems occur and Tailor Brands does its best to resolve them. Although I'm okay now that the problem was solved, yet, some problems should not have happened if they had been handled with care and precision. In my case, it was the miscommunication and the misfiling of an LLC with the S Corp election."
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "Dbitroz Global",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T16:14:08.000Z",
          "Titre": "DBITROZ GLOBAL ❤️TAILOR BRANDS",
          "Contenu": "Hi Tailor Brands AM saleh bin Abdullah Alamri Founder and CEO DBITROZ GLOBAL CO., LTD I thank you for your interest in your customers, and this indicates your advanced success There are some important suggestions, I hope he listens to them, very important. Best SALEH"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Oakley",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T21:37:30.000Z",
          "Titre": "Logo maker was simple and easy to use…",
          "Contenu": "Logo maker was simple and easy to use but does not ihave the ability to create complex 3D layouts for icon placement. But in the end I created a design very quickly that I love! Now that I think about it that is better."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nathan Ogden",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T22:14:49.000Z",
          "Titre": "Great Product, Confusing Presentation during sign up",
          "Contenu": "I initially came here upset with confusion I had over fees and confusion. I am upgrading my rating as Customer Support is being attentive and working on the issue. My only feedback at this point is that when signing up, the offers can be a bit overwhelming and its hard to know what you need and what you don't. If there was a way to personalize or change the way these are offered, it might cause less confusion and cases like this."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tara",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T02:08:05.000Z",
          "Titre": "Professional service",
          "Contenu": "I was treated with respect and kindness. Operator listened to my concerns and explain all the details of the service clearly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KA",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T19:50:48.000Z",
          "Titre": "Surprising!",
          "Contenu": "I came across Tailor Brands through an instagram ad, and next thing you know, I had a business going.  The only complaint is that the UX is a little confusing - so confusing that a rep called me before I even hit submit to walk me through the process.  At least they were proactive!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aminah",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T17:58:57.000Z",
          "Titre": "Jana answered all my questions and was…",
          "Contenu": "Jana answered all my questions and was very helpful guided me through this process as a newbie"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "silviastradiconsultinggroupllc",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T19:46:46.000Z",
          "Titre": "Site easy to use",
          "Contenu": "Site easy to use.  Easy instructions. Would have liked more color options for business cards, more ability to design business cards and other collaterals. Also liked to one-stop shop, meaning the features sold support full services for a launch of a new business. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "StevenAnthony - Photography an",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T14:37:19.000Z",
          "Titre": "Good for the most part",
          "Contenu": "Good for the most part, but didn't like the pressure to keep upgrading to purchase additional services. Additionally, was disappointed that there is no \"modification service\" after an LLC is submitted. I ended up researching and finding the form to use to do it myself. I would think a company such as Tailor Brands (who has been in this business for over 5 years) would offer what I feel is should be one of the most basic of services.Edit: No thank you Tailor Brand, you have made it clear you do not offer those services and there is nothing you can do at this time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dazairian Foster",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T00:23:08.000Z",
          "Titre": "Everything was brief and broken down…",
          "Contenu": "Everything was brief and broken down well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Moses McBride",
          "Nb_Reviews": 2,
          "Date": "2023-05-31T17:46:36.000Z",
          "Titre": "Mostly the platform is a great way to…",
          "Contenu": "Mostly the platform is a great way to start your LLC. This was very easy using Tailor Brands. What I have found confounding is the continuously added fees for services that are directly related to creating your LLC. While it would seem very cost-efficient to use Tailor Brands at first glance, these fees (services) can quickly add up to $1000 or more. Many of the functions offered by Tailor Brands can be done for free or much less cost, if you choose to contact the needed agency or company yourself."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joshua Buchanan",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T04:56:09.000Z",
          "Titre": "Has a lot of additional fees",
          "Contenu": "Tailor Bands seems like a very well put together consolidation service to aid with LLC, start-up companies.I hope everything goes as smooth as it was to apply. My only feedback for improvement would be an outline of suggested or estimated total cost of this service at the beginning of the application. I found each following page for Tailor Brands application offered more and new \"surprise\" fees for offered benefits and services. I would have just liked to see a synopsis of what to expect up front."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christina Heath",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T00:14:44.000Z",
          "Titre": "Tailor Brands Effective All In One Tool, But Everything Is An Add-On",
          "Contenu": "Tailor Brand has everything you could want to start your business, I was very stressed about having to file the paperwork with my state, as a lot of their online tools were outdated and hard to find the correct documents, I was glad to pass that stress over to Tailor Brands and they filed for me quickly and effectively. My biggest con is that everything is an add-on, and it can get quite pricey. They are a bit misleading when they use phrases like \"Starting at $0\"."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debora Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T02:13:37.000Z",
          "Titre": "The services rendered by Tailor Brand…",
          "Contenu": "The services rendered by Tailor Brand seem very attractive and comfortable. However, the fees are expensive The sales person Annabelle is good in her job. She knows how to convince the customers and exercise great patience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rachelle S.",
          "Nb_Reviews": 3,
          "Date": "2023-05-21T16:58:43.000Z",
          "Titre": "Great overall",
          "Contenu": "Really seamless; every tool is in one spot, the people I worked with were very easy to communicate with in terms of my vision. I wish the LLC service was available when I launched, I ended up going with another company. The only thing is I wish there was the option to discuss or resolve issues over the phone."
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Anna Faber",
          "Nb_Reviews": 2,
          "Date": "2023-07-04T17:35:53.000Z",
          "Titre": "Refund made possible",
          "Contenu": "I want to give a shout out to Oscar who listened to me and tried his best to accommodate. I signed up for a service a year ago and only made use of the logo creation at that point. I missed that this was a yearly subscription and that it would renew automatically again this year. I cancelled it 5 days too late, but reached out as I was a bit disappointed that I did not get a heads up about the renewal via mail (as most services do). Oscar said there was nothing they can do first, but after a few mails back and forth he looked into it more and at least returned 50% of the price that I paid. Thanks for accommodating Oscar!"
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Moreno Costa",
          "Nb_Reviews": 2,
          "Date": "2023-07-28T08:30:28.000Z",
          "Titre": "Get more performance",
          "Contenu": "Well, as the CEO of my company, I don't regret the experience, I only think because of the price we pay for the domain and it's very limited, the templates can only be used for 6 to 8 photos and it's very simple. service and what I think.there’s to many domain offering more and the same price and they do the same services"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mariah Batts",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T21:48:42.000Z",
          "Titre": "Love the experience working with you…",
          "Contenu": "Love the experience working with you guys. I even got the opportunity to email the CEO . Support was amazing and I loved working with you guys the only reason I didn't give 5 star is because tailor brands is for people who have money to invest in their business along with build it and i would say tailor brands is more in the middle of the range for price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angelina",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T04:18:47.000Z",
          "Titre": "Helpful to a point",
          "Contenu": "Helpful to a point. She didn't understand my questions. She seemed like she was rushing me and was relatively impatient, but, she did help me through the process ultimately."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Iris Air",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T15:18:13.000Z",
          "Titre": "Everything about Tailor Brands is…",
          "Contenu": "Everything about Tailor Brands is helpful. Only problem Ive is just the timeframe from the state to reciveve all of my documents and EIN. if the turnaround wait was better i would advise everyone to use Tailor Brands"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Logan Everett",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T05:03:05.000Z",
          "Titre": "Slight problem simplifying but overall helpful and friendly",
          "Contenu": "Very friendly and very helpful guidance through the steps, slightly lengthy and didn’t simplify things very good at time but still helped me understand what each step meant and what it did for me"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Juanita B.",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T03:44:03.000Z",
          "Titre": "It Was Easy 😆",
          "Contenu": "I was guided through the process and it was made easy. I feel like it was a great business investment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "john Davis",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T03:05:41.000Z",
          "Titre": "Great product",
          "Contenu": "So far everything with Tailor brands has exceeded my expectations. The logos the website came up with look great. The website is very user friendly and I have enjoyed cycling through all the different options offered. A couple of suggestions for improvement might be follow up for website design. That is not a strong suit for me or my company yet. I would like to see more clothing options, unless I missed something all I see is t-shirts. Maybe partner with another website that offers more options."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ACD GROUP",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T15:04:14.000Z",
          "Titre": "The website looks great but the process needs work",
          "Contenu": "We were super impressed with the website that was built, it looks amazing.  However, the method used to communicate to the web designer needs to be updated.  And you should also get a copy of the requests that you make so you can ensure that everything was done correctly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Riley Flores",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T20:12:05.000Z",
          "Titre": "Amazing",
          "Contenu": "Tailor Brands was a very open and distinct website and had an amazing experience. They were always reaching out to me and trying to improve what they were doing, and it felt like they genuinely cared about my design. This is kinda ironic since I made the design as a joke, but I still enjoyed how they cared so much about this. Overall, a very good website."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Apumarode Turnah",
          "Nb_Reviews": 3,
          "Date": "2023-02-22T18:20:00.000Z",
          "Titre": "High quality self service for those…",
          "Contenu": "High quality self service for those starting a new business to get all support needed to hit the ground running. All the essential support needed by new businesses are provided at cost effective rates.Will do even better to establish timely two-way communication with clients needing help in the process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Myra  Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T01:46:01.000Z",
          "Titre": "She was great at explaining everything…",
          "Contenu": "She was great at explaining everything but was a bit pushy and impatient in my opinion."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Garrett Luchaco",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T08:19:52.000Z",
          "Titre": "Interface is fun and easy to use!",
          "Contenu": "While the Interface is easy to use and the Logo Creation is fun and engaging. The pricing is regrettably so far off that the Logo itself is not worth it.The advertised price is \"Monthly\" and $9.99, the Actual cost is Yearly and $71.88. When I contacted customer service I was disappointed by the fact they don't have a physical person I can contact.It's e-mail only and they don't actually resolve their issues' they use an automated system that takes weeks to respond.If you want a standard Logo that doesn't cost you a arm and a leg, please go elsewhere. If you like paying high prices for the fun of it, this is definitely the place for you 😂"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jammal w johnson",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T00:48:29.000Z",
          "Titre": "The employee was knowledgeable and able…",
          "Contenu": "The employee was knowledgeable and able to help me through the process of starting my business Kylle was so helpful"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shaneaka",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T17:16:59.000Z",
          "Titre": "I love how easy it was for me to fill…",
          "Contenu": "I love how easy it was for me to fill out my application for a LLC, and the step by step instructions on building a buisness.I did however feel as though there could be more templates for building a website and making it more user friendly with what makes a good website and what goes into building a website."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brent Anderson",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T21:35:27.000Z",
          "Titre": "I wish I could have edited the Capitalization",
          "Contenu": "I wish I could have edited the capitalization of the lettering, that would be the only thing I would change."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Simon Free",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T18:28:50.000Z",
          "Titre": "Good Experience",
          "Contenu": "Rhean did a good job talking me through the process. The website could do with better validation as i had issues stopping me from proceeding that were not being highlighted and i had to hunt for the issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Uri Novelo",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T02:31:21.000Z",
          "Titre": "Great Ken Smith and Chris Nazareno",
          "Contenu": "Great Ken Smith and Chris Nazareno —- Both Tailor Brands professionals rock!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brittney  Gowan",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T02:46:45.000Z",
          "Titre": "It was good",
          "Contenu": "It was, but the person was not very knowledgeable on the questions on the website and wasn’t able to explain everything to me quickly or advise me what I should put by knowing what I would need the most given that I’m a brand new entrepreneur, but Chris with all-around nice pleasant and patient I forgot to be with everything else I needed. He may just need to be retrained on the website otherwise"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J.Swift",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T03:59:34.000Z",
          "Titre": "Incorrect business name",
          "Contenu": "Update: Tailor Brands was able to get the name corrected, thank you for taking the time to make this right. I emailed support to have an extra LLC typo removed from the business name and was told that the second LLC would not show up. However, the second LLC was still part of the business name on each part of the process. I asked again for this to be corrected and was told it was too late now because the app was already sent to the state office and could not be changed. Reaching out to tailor brands to help with a business start-up has not been the best experience so far."
        },
        {
          "Note": 4,
          "Lieu": "RW",
          "Pseudo": "Didace Nsabimana",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T12:07:12.000Z",
          "Titre": "Great support"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hilda Gurley",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T03:13:54.000Z",
          "Titre": "Everything you need to do to start your…",
          "Contenu": "Everything you need to do to start your business is made simple.  Could use a little more flexibility in creating logos, such as modifying fonts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "nourishoriginalgmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:29:44.000Z",
          "Titre": "I will be waiting to see you how the…",
          "Contenu": "I will be waiting to see you how the website turns out"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Garrett List",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T00:56:01.000Z",
          "Titre": "Support was great",
          "Contenu": "Support was great, Jana was very helpful, phone call did not have the best connection"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ernest Ke",
          "Nb_Reviews": 3,
          "Date": "2023-01-05T11:21:42.000Z",
          "Titre": "I am just starting 3K Exotic Foods.",
          "Contenu": "I am just starting 3K Exotic Foods.I was looking or a company to file an LLC, but I discover so many marketing and management tools. I really appreciate to shop so many tools in one place."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Derrick Douglas",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T20:58:36.000Z",
          "Titre": "Anabelle was very informative on the…",
          "Contenu": "Anabelle was very informative on the subject and and questions that I had if for the ones she wasn’t too sure about she got the answers from her supervisor promptly"
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "Márcio Resende",
          "Nb_Reviews": 2,
          "Date": "2022-12-05T14:53:18.000Z",
          "Titre": "now i'm very satisfied! ;)",
          "Contenu": "at the beginning there was a small unforeseen, delay in publishing the site, but that was promptly resolved by a very available team, at this moment I am very satisfied with Tailor Brands.  thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J. Red",
          "Nb_Reviews": 2,
          "Date": "2023-08-02T23:05:04.000Z",
          "Titre": "Live Customer Service",
          "Contenu": "Kate did a very good job working with me! We had a few system problems! To many nickels and dimes fee! Received Ready Available Customer Service!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LaTeciara Gordon",
          "Nb_Reviews": 1,
          "Date": "2023-05-07T07:22:32.000Z",
          "Titre": "The chat agent did well but",
          "Contenu": "The chat agent did well in what they could do however I think the company can improve on advertisement as I feel EXTREMELY mislead. Especially considering that the chat agent could only offer a 50% refund less than 24hrs from purchase of product. The LLC formation is on hold yet they couldn’t allow him to cancel the whole order and issue a refund. I’ve been a chat agent before so I can’t blame the service but I’m disappointed in this company as it was highly reviewed. The fees were not laid out in an easy to understand manner and I feel scammed. I worked hard for my money.. I’m heartbroken.Edited to add: The company reached out immediately so I have moved the rating from 3 to 4 stars. The only reason it’s not a 5 is because of the hassle for a refund however I do think if you have the budget this is a good service. Just read everything CAREFULLY and know what you need for your LLC"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Antwan Brown",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T20:03:10.000Z",
          "Titre": "The Rep that was helping me was very…",
          "Contenu": "The Rep that was helping me was very knowledgeable, and really wanted to make sure I understood the available products and resources. It was great to have a live person helping me along the way."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Veronique Handal",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T20:10:49.000Z",
          "Titre": "Jannelle was great at helping",
          "Contenu": "Jannelle was great at helping, the only reason why i give 5 stars is because of all the unexpected fees that come after paying for the llc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "cshammanika williams",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T21:09:53.000Z",
          "Titre": "Great starter up",
          "Contenu": "Everything about Tailor Brand is perfect but the prices could be a little better but overall it's great programming for start up businesses"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aladim Services",
          "Nb_Reviews": 2,
          "Date": "2023-04-25T20:19:36.000Z",
          "Titre": "Domain Subscription",
          "Contenu": "It took longer to fully address my issue due to the holidays, and I am grateful it is resolved. The original request was made on April 13.Thank you to all who were involved in resolving this."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Riveigh Finch",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T23:00:41.000Z",
          "Titre": "Simple and Nice but a bit expensive",
          "Contenu": "The people were really polite and I appreciated how simple the website was. However, the fees and payments I had to make were rather expensive."
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "Karen Escalona",
          "Nb_Reviews": 2,
          "Date": "2023-07-20T15:36:54.000Z",
          "Titre": "Good…",
          "Contenu": "Hi it was a pretty easy experience everything can be done with a click. There is room for improvement however it can be a good way to start your business."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Austin Stegemoller",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T00:48:40.000Z",
          "Titre": "Deceptive policies and procedures",
          "Contenu": "Update 4 star: they finally refunded my money  only after emailing 4 times with supporting documents and creating this review. Ultimately it was this review that got them to refund my Money. I let them know that I would update my review accordingly but would not take it down- I want to be transparent when it comes to these companies and their practices/ policies. Original review 1 star : I attempted to terminate my subscription previously and believed it had been successfully canceled. However, I received an email on the 14th notifying me that my subscription would be renewed on the 15th. On the same day, I responded to the email, explicitly expressing my non-authorization for the renewal and reiterating my request for cancellation. Contrary to the information provided in their email, my credit card statement indicates a deduction of $170.99 on the 14th.Subsequently, I sent another email with supporting evidence, highlighting the unethical nature of their practices, and requested a refund along with the immediate cancellation of my subscription, as previously communicated. Regrettably, the responses I received appeared automated, expressing apologies for any confusion and hoping it did not cause significant inconvenience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tiffany Christy",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T16:15:36.000Z",
          "Titre": "He was very friendly and patient",
          "Contenu": "He was very friendly and patient. I wish there was a little more explanation though otherwise very good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alphonso Hargrove",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T09:13:36.000Z",
          "Titre": "You made a promise and you fulfilled…",
          "Contenu": "You made a promise and you fulfilled your duties"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dominic Brown",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T03:26:18.000Z",
          "Titre": "For the cost",
          "Contenu": "For the cost, I am fairly satisfied with the service provided. There were a couple delays but could have been my own cause. Either way, approval was achieved and I am one more step closer to operating my business"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Oliver  Singleton",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T17:40:40.000Z",
          "Titre": "Zoey was clear spoken an very patient…",
          "Contenu": "Zoey was clear spoken an very patient also thoroughly helpful"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mailani",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T17:48:55.000Z",
          "Titre": "This is a great company for beginners…",
          "Contenu": "This is a great company for beginners and they really help you threw the process of starting your business"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kiari Williams",
          "Nb_Reviews": 4,
          "Date": "2023-01-25T16:44:13.000Z",
          "Titre": "Would recommend",
          "Contenu": "Although it was a rocky start with the information and documents I needed for my business I can say that this company is really great. Even though I dealt with a few bad reps that doesn't reflect the whole company. The owner of the company as well as the leader of customer satisfaction have been working diligently to resolve my issue. Even though it is a technical issue that is beyond their control they responded quickly and gave all the information I needed and validated my concerns.  I appreciate the effort and would definitely recommend this company to anyone starting a business."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tracy Allen",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T20:35:57.000Z",
          "Titre": "The rep was excellent she the plans…",
          "Contenu": "The rep was excellent she the plans were a little confusing I just needed the basic requirements for the llc in my state and that got confusing with all the extras add"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barry Silverman",
          "Nb_Reviews": 3,
          "Date": "2022-11-23T19:30:54.000Z",
          "Titre": "Just started new company (LLC)",
          "Contenu": "Just started new company (LLC).  Too many things to finish application. Can't get my Digital business card contact info not coming up right.  Do not want to useskype.  my bottom button not working."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Damian S",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T22:53:11.000Z",
          "Titre": "I think it's worth the money",
          "Contenu": "Very timely and very nice. Was super helpful during the call and doing their best to help us make an informed decision"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ramon Bonilla",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T20:34:05.000Z",
          "Titre": "Janelle did a great job being patient…",
          "Contenu": "Janelle did a great job being patient and getting my information but at times she seemed to go a little to fast with the information she was providing me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Timothy Pulley",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T03:28:30.000Z",
          "Titre": "I was really ingaged of how they built…",
          "Contenu": "I was really ingaged of how they built my logo I excited and very proud they only thing I wish was to create a design with a wheel or truck representing my business but overall I'm satisfied"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elliott Barnes",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T20:59:03.000Z",
          "Titre": "I don't want to give negative feedback…",
          "Contenu": "I don't want to give negative feedback the process was quick but I'm still trying to set up my business"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hey There",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T21:26:39.000Z",
          "Titre": "service follow up",
          "Contenu": "The service follow up was awesome, helped me greatly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T22:59:33.000Z",
          "Titre": "Knowledgeable and able to help navigate…",
          "Contenu": "Knowledgeable and able to help navigate the process. Kind and patient while I gathered information."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gaza Sqreech",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T21:56:16.000Z",
          "Titre": "Pretty easy formats to choose from and configuration",
          "Contenu": "Pretty awesome platform just take some getting used to but nevertheless wide ranges of options to build your desire"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sarra Caplice",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T22:07:42.000Z",
          "Titre": "It was mostly easy to understand just…",
          "Contenu": "It was mostly easy to understand just had a couple problems that customer service handled"
        },
        {
          "Note": 4,
          "Lieu": "SV",
          "Pseudo": "Grengo Hemp Co.",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T21:22:12.000Z",
          "Titre": "Good",
          "Contenu": "It took a couple of days to get it fixed but the staff is friendly and helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "S.C.",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T22:41:40.000Z",
          "Titre": "This service was helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mackendy.cyahoo.com",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T04:21:23.000Z",
          "Titre": "I love it because they helping me get…",
          "Contenu": "I love it because they helping me get exact what I need for my business 👨‍💼 so excited 😆"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph GAYLEARD III",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T22:51:04.000Z",
          "Titre": "Annabelle was very helpful in setting…",
          "Contenu": "Annabelle was very helpful in setting up the llc"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bernard Zachary",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T09:52:13.000Z",
          "Titre": "I haven’t had the experts",
          "Contenu": "I haven’t had the experts, cause I wasn’t able to utilize which I had to offer in order to start a business"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ernest Ke",
          "Nb_Reviews": 3,
          "Date": "2023-01-06T19:03:02.000Z",
          "Titre": "Since this morning I can’t reach you…",
          "Contenu": "Since this morning I can’t reach you for a payment collected twice for the same package by your company.$298.00 on 22/18/2022 by Janua by debit card$298.00 on 01/05/2023 by paypal"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Derrick",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T12:49:57.000Z",
          "Titre": "Fast and easy",
          "Contenu": "It was quite easy all I had to do was sit back and wait every was taken care of by tailor brands I mean everything"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Burks MK",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T20:08:21.000Z",
          "Titre": "Tailor Brands helped me create an LLC…",
          "Contenu": "Tailor Brands helped me create an LLC and keeps me aware of everything I need to do to keep it up to date.  I have my website through them as well as other resources.  It is a one-stop type of shop for this dream."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Colin Shurland",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T18:31:09.000Z",
          "Titre": "Personal Brien Manlagit was very…",
          "Contenu": "Personal Brien Manlagit was very helpful of providing me with all information I needed about my transactions with Tailor Brands.Colin Shurland"
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Saimondas Lukosius",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T18:28:07.000Z",
          "Titre": "Prompt Support with Room for Enhancements",
          "Contenu": "Thank you to the Bluehost team for their prompt and efficient assistance with my account and domain-related issues. I'd recommend enhancing the system interface with AI-driven recommendations and tools, as well as providing access to 24/7 live assistant support. These improvements would minimize hiccups and further enhance the customer experience. I look forward to seeing these enhancements in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T04:36:46.000Z",
          "Titre": "Unlocking doors.",
          "Contenu": "Unlocking doors.The team was easy to work with and was Very;  intrigue about the project"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karl Hayes",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T18:18:31.000Z",
          "Titre": "John was very helpful ad prompt with…",
          "Contenu": "John was very helpful ad prompt with answering questions and finishing the steps with me"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terreka Jackson-Adams",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T15:52:05.000Z",
          "Titre": "Tailor Brand made everything a breeze",
          "Contenu": "Tailor Brand made everything a breeze. You basically fill in the blanks and Tailor brand does the rest. Literally what more can one ask for. Keep up the good work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel  Mercado",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:53:44.000Z",
          "Titre": "The agent was very helpful",
          "Contenu": "The agent was very helpful, y informative as to what each service included. Made the process very easy to go through. As a first time business owner I can say this relieved some if the stress of setting up my LLC."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terrance Dorsey",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:23:57.000Z",
          "Titre": "Zoey was extremely patient and good…",
          "Contenu": "Zoey was extremely patient and good with explaining everything! Extremely nice as well!! Made me confident in the process!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Rios",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:24:43.000Z",
          "Titre": "Robert is a very professional…",
          "Contenu": "Robert is a very professional individual. Knowledgeable on it what he is doing. This makes it easy to get information from Robert. I personally enjoy speaking to Robert when I call for any situation I have."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angel  Sepulveda",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:53:38.000Z",
          "Titre": "Zoey was great!",
          "Contenu": "Zoey was great in explaining the products, she was so courteous and made the whole process feel pleasant."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Felipe Murrieta",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T14:26:12.000Z",
          "Titre": "The step by step guidance on the phone…",
          "Contenu": "The step by step guidance on the phone with Nass while simultaneously online on the Tailor Brands website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Gilhuly",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T02:47:23.000Z",
          "Titre": "Thank you my assistant was very patient…",
          "Contenu": "Thank you my assistant was very patient with me getting me through the process of application. I appreciate everything he has done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stacy G.",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T17:26:27.000Z",
          "Titre": "Tailor Brands",
          "Contenu": "Tailor Brands is incredibly responsive. In fact, before you know it, you’ll have bought way more than you need. They call instantly to offer support but in many cases, they did not help with my trigger happy purchases for my LLC. I persisted and finally, over email, Jonathan H. Reached out and instantly provided intuitive, understanding customer service, immediately granting me credit so I could use it when I was more prepared."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Casanova",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T06:17:01.000Z",
          "Titre": "They were a real help",
          "Contenu": "They were a real help, no doubt. I had this odd situation where I'd submitted my application to the Department of Commerce, but it was radio silence for months, despite paying the NY State fee. So, out of impatience, I reached out to Tailor Brands. They walked me through the whole application process, which surprisingly went pretty smoothly.Given my circumstances, they waived the $199 registered agent fee for a year, which was a good deal. Also scored a holiday discount, making it even better. So far, I'm satisfied with how things turned out thanks to their assistance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mario Arana",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T16:04:25.000Z",
          "Titre": "Zoe was wonderful help me to fill it…",
          "Contenu": "Zoe was wonderful help me to fill it out my application completely thank you thank you Zoe you're great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marlene McGhee",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T04:54:33.000Z",
          "Titre": "Great Service",
          "Contenu": "Erica is a pleasant and very knowledgeable. My experience was great. I look forward to working with Tailor Brands."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lyman Peterman",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T22:09:20.000Z",
          "Titre": "Dan was very helpful in answering my…",
          "Contenu": "Dan was very helpful in answering my many questions. I feel comfortable now going with Tailor Brands and went with the silver package."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken Decker",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T03:41:06.000Z",
          "Titre": "Tailor Brands is my GO TO for my business!",
          "Contenu": "I have been using Tailor Brands since 2017. Through  that time I have made websites for colleagues, clients, and myself. There is no better place to build a business as a startup. They have everything you need to get started and maintain your business moving forward."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Driving with No Worries",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T21:46:53.000Z",
          "Titre": "Who sees who!",
          "Contenu": "I liked how my logo caught the eye of the very creator of this company and that just made my day. I shared with my mom that the CEO, saw the first draft of my logo, and it just made me want to do business and now I'm on your team! Sincerely, ~ Royal Express Driving Vehicles"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Neyland",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T23:03:40.000Z",
          "Titre": "Khate was great",
          "Contenu": "Khate was great, guided me through the process and informed me on what I could get and how it would help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Martinez",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T02:54:23.000Z",
          "Titre": "Super simple",
          "Contenu": "Melanie made everything super smooth and simple. She was very knowledgeable and understanding of what i needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephan McFadden",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:06:26.000Z",
          "Titre": "Summer has done great explain and…",
          "Contenu": "Summer has done great explain and walking me through the process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ibrahim Diallo",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:53:17.000Z",
          "Titre": "Good Service",
          "Contenu": "The agent, Gee, was very helpful and patient while guiding me to complete the application."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ditter Notary, LLC",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T14:05:57.000Z",
          "Titre": "A company that stands behind its services.",
          "Contenu": "Tailor Brands is a company that stands behind its services and has EXCELLENT customer service.  Yonatan H was especially helpful and very quick to respond to my emails and questions.  As a new, first-time business owner, there were several services that I did not understand, nor did I know what I needed.  The representative walked me through the process until I had everything I needed to get my LLC and EIN up and running."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Celeste Pillows",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T23:11:38.000Z",
          "Titre": "Anabelle was very helpful and proud to…",
          "Contenu": "Anabelle was very helpful and proud to be my agent and assist me. Grateful to have her."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Washington Moreira",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T00:23:51.000Z",
          "Titre": "Jana was amazing she was helpful and…",
          "Contenu": "Jana was amazing she was helpful and very amazing and explaining straight forward very good to follow up with me since November, thank you Jana"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LolaFour",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:40:17.000Z",
          "Titre": "Gee was very informative and beneficial…",
          "Contenu": "Gee was very informative and beneficial to my increased knowledge.  Thanks Gee.  She made in easy to understand and clear on how to operate a functioning business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yarlardo L Henderson",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:59:05.000Z",
          "Titre": "Romeo walked me through the process",
          "Contenu": "Romeo walked me through the process. He was patient, didn't try to oversell when I told him I had somethings in place.  Great experience and process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Acquivya Simmons",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T00:03:02.000Z",
          "Titre": "Raven Helped Me But I’m Very Dissatisfied",
          "Contenu": "Raven Helped Me Sort Out Things And Get Things Started Along. I Just Don't Understand Why I’m Being Charged For Something I Didn’t Even Finish Or Use After All This Time. The LLC Wasn’t Even Formed So I Shouldn’t Be Getting Charged Anything. And I Need My Refund NOW. Or I’m Definitely Letting People Know Not To Use This Site. It’s Honestly Giving Scam Due To The Fact That Never Finished Anything Yet I’m Being Charged Like I Have Completed The LLC. I Could’ve Sworn I Cancelled It Months Ago, And I’ve Been Being Charged For Something I Don’t Even Use. This Is Beyond Ridiculous."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christian W",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T01:04:48.000Z",
          "Titre": "Chana was Great!!!",
          "Contenu": "Chana (I hope I spelled her name correctly, I forgot to ask for the spelling!!! Apologies if incorrect) was a great help, she answered all of my questions and we set up a time for her to call me back to get me further situated with my business! I appreciate her kindness and patience during this process. She deserves a raise :)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yaw Parry",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T20:20:29.000Z",
          "Titre": "Dan was helpful and considerable on the…",
          "Contenu": "Dan was helpful and considerable on the phone. He showed that he cared and was willing to do what it takes to help me get starting on building a website for my business. Great customer service! thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oliver Dominguez",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:15:17.000Z",
          "Titre": "Romeo was very helpful and helped me…",
          "Contenu": "Romeo was very helpful and helped me understand all the options."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Quiriat Jimenez",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T02:14:10.000Z",
          "Titre": "It is a very good experience",
          "Contenu": "It is a very good experience, this application has never seen anything like this"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Belachew Ermeyas",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T04:15:45.000Z",
          "Titre": "This has been a truly excellent…",
          "Contenu": "This has been a truly excellent experience from start to finish."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darrell  Barnes",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:18:53.000Z",
          "Titre": "The young lady was patient and thorough…",
          "Contenu": "The young lady was patient and thorough with the whole process!!🫡👏🏾🙏🏽"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lakeisha Davis",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T14:20:24.000Z",
          "Titre": "Great Experience!",
          "Contenu": "My customer service was able to walk me through the full process and provide thoughtful insights to the questions I was asking. He made me feel comfortable and purchasing this product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamescitha  Mery",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T18:11:47.000Z",
          "Titre": "The 5 star review",
          "Contenu": "The experience was amazing. At first we was a little lost but when we received a text message from John we knew it would be best to call him. He helped out a lot, explained everything to better help us understand, he was patient with us, and overall an amazing helper."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adriana Duarte",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T06:45:51.000Z",
          "Titre": "Great service",
          "Contenu": "Matt from  customer service helped me to set up my new LLC, and I was impressed by his exceptional assistance. He guided me through the entire process with clarity, addressing my questions promptly and ensuring all necessary steps were covered. His expertise and friendly demeanor made the experience smooth and stress-free."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Dcruz",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T21:54:25.000Z",
          "Titre": "Worth it in the end",
          "Contenu": "There are many companies out there to get this work done and some maybe even cheaper but the reason I went with Tailor Brands is thanks to Lawrence and his exceptional customer support, I took some time to make my decision and go ahead with the registration of my business but he was patient with me and also took follow-ups, to add on he walked me through the full process as well and I appreciate the time and effort."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie  Sabby",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:28:53.000Z",
          "Titre": "Was very knowledgeable and helpful with…",
          "Contenu": "Was very knowledgeable and helpful with explaining the program available for me in starting my business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Damon",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T18:37:51.000Z",
          "Titre": "I had a great experience with Tailor…",
          "Contenu": "I had a great experience with Tailor brands,keeping me updated with all changes and upgrades to the brand. I was pleased with the response time ,of the representative that I spoke with and knowledgeable about upcoming events that can impact my company. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leslie Kennon",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T22:10:00.000Z",
          "Titre": "Absolutely helpful in explaining all of…",
          "Contenu": "Absolutely helpful in explaining all of the different products that will enable me to have peace of mind over my business finances!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ICON ELITE FITNESS",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T01:36:31.000Z",
          "Titre": "Outstanding Service!",
          "Contenu": "Erica provided great customer service and provided assistance for throughout the entire LLC filing process. I highly recommend Tailor Brands for your business needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Kolar",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T16:38:40.000Z",
          "Titre": "Dan made my experience great",
          "Contenu": "Dan made my experience great!  He was patient and informative. If anything he was too thorough.  I was very pleased working with him. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:34:00.000Z",
          "Titre": "Knowledgeable and Answered all of my…",
          "Contenu": "Knowledgeable and Answered all of my question."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "alexandra dumitrascu",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T09:49:08.000Z",
          "Titre": "Best customer service in the world",
          "Contenu": "Best customer care in the world. Prompt replies and solutions given to any issues that might come up. Thank you Karla and Aida !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tearra Goines",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:32:11.000Z",
          "Titre": "Very knowledgeable and helped me with…",
          "Contenu": "Very knowledgeable and helped me with all of my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Michael",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:55:58.000Z",
          "Titre": "He was very clear and direct on…",
          "Contenu": "He was very clear and direct on answering all of my questions. I give him a five-star rating. Michael camp"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Esther  Nguessan",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:36:45.000Z",
          "Titre": "The understanding and also explanation…",
          "Contenu": "The understanding and also explanation of the plans really greatly done"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kevinanderson.gmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T05:01:00.000Z",
          "Titre": "Rep was very respectful and called me…",
          "Contenu": "Rep was very respectful and called me back the next day since I was busy when she called. She helped me out with different options and made the process simple"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pasquale Tedesco",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T20:20:14.000Z",
          "Titre": "Customer service rep offered great…",
          "Contenu": "Customer service rep offered great guidance and explained every step in great detail. 10/10"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harold  Brown",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:41:00.000Z",
          "Titre": "Great experience with Zoey",
          "Contenu": "Great experience with Zoey. Very detailed and polite."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Breanna Tate",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T19:26:01.000Z",
          "Titre": "Jana was very professional in her…",
          "Contenu": "Jana was very professional in her information provided to my partner and I while starting our LLC. She was very patient and kind with expert knowledge. I will highly recommend this company because of her!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angel Vilches",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T00:25:01.000Z",
          "Titre": "Tailor brands gave me a clear…",
          "Contenu": "Tailor brands gave me a clear understanding of what all I needed to get my business up and running"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Gilliam Sr",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T18:01:16.000Z",
          "Titre": "Zoey has Great customer service skills",
          "Contenu": "Zoey has Great customer service skills, very knowledgeable, and fulfilled all my expectations..A+ she was very helpful and polite..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lucas Han",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:52:48.000Z",
          "Titre": "John was patient and extremely helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "paul lewis",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T16:37:52.000Z",
          "Titre": "It was easy well explained I was told…",
          "Contenu": "It was easy well explained I was told about other services I could take advantage of friendly pleasant service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron Looney",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T18:35:37.000Z",
          "Titre": "The guy Chris he was awesome he…",
          "Contenu": "The guy Chris he was awesome he answered all my questions and helped me out of a issue I had"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela B.",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:50:40.000Z",
          "Titre": "Rhean was very helpful and patient with…",
          "Contenu": "Rhean was very helpful and patient with answering questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Prinny",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:08:38.000Z",
          "Titre": "Very informative and has alot of…",
          "Contenu": "Very informative and has alot of patient. All my questions was answer promptly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cesar Barrera",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T23:35:38.000Z",
          "Titre": "John explains the process step by step",
          "Contenu": "That John explained to me step by step the application process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maketia Haralson",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T03:19:44.000Z",
          "Titre": "The walk-through was a great experience…",
          "Contenu": "The walk-through was a great experience because it took the frustration and anxiety of information completely out of my head. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craton Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T01:43:55.000Z",
          "Titre": "Jana was great",
          "Contenu": "Jana was great. She was very kind and informative. She answered all my questions and explained the programs well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andy De La Rosa",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T01:48:31.000Z",
          "Titre": "Melanie was an amazing person having me…",
          "Contenu": "Melanie was an amazing person having me understand things that I didn’t understand and was patient with me throughout the process. I appreciate her customer service ability and the experience. Thank you so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Griffin Goodman",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:18:57.000Z",
          "Titre": "Summer was hands on",
          "Contenu": "Summer was hands on, polite and knowledge"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "L Ramos",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T06:45:52.000Z",
          "Titre": "Quick and easy",
          "Contenu": "Mae was patient and efficient in explaining all services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Irene Onuonga",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T18:55:17.000Z",
          "Titre": "Chris",
          "Contenu": "Chris was very understanding and He was able to explain everything I needed.  He is the best.... I truly appreciate all ur hard work 💪.  Be blessed always 🙏🏿 He needs to be promoted."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kellie Napper",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T00:32:53.000Z",
          "Titre": "Mae walked me through the process and…",
          "Contenu": "Mae walked me through the process and was very patience with me and I am very greatful and happy and looking forward to starting my new business…"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brianna Ramer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T03:25:20.000Z",
          "Titre": "Heart was very helpful",
          "Contenu": "Heart was very helpful, and guided me through my experience with the formation of my LLC and made the process so smooth and easy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frandy  Joseph",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T07:54:10.000Z",
          "Titre": "Setting up  the business  was so easy …",
          "Contenu": "Setting up  the business  was so easy  with  tailor  brands"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T20:36:37.000Z",
          "Titre": "best service i get this Agancy i much…",
          "Contenu": "best service i get this Agancy i much appreciated Zoey how she help me very professional"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leia Martin",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:11:37.000Z",
          "Titre": "Thank you Dan for answering all of my…",
          "Contenu": "Thank you Dan for answering all of my questions in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mhsdistributionyahoo.com",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T00:15:45.000Z",
          "Titre": "Gee was very helpful and patient she…",
          "Contenu": "Gee was very helpful and patient she inform me  of all the guide lines and guide me through all the steps"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KJ",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T00:10:16.000Z",
          "Titre": "Jana made creating my LLC seamless",
          "Contenu": "Jana made creating my LLC seamless. Great service!!!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yovani Patino Perez",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:25:58.000Z",
          "Titre": "Great / clear service/ patience very…",
          "Contenu": "Great / clear service/ patience very good !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose Buitron",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:27:30.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Very well spoken. Polite and concise with all information. Answered all my questions and concerns and was patient throughout the process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathi Handy",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T00:39:36.000Z",
          "Titre": "Thank you Mike for all the help you…",
          "Contenu": "Thank you Mike for all the help you gave me on getting my new business set up, you were great and very patient with me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elease McBride",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:33:01.000Z",
          "Titre": "Dara was very nice and super informative"
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "anouar ED-DAMI",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:16:29.000Z",
          "Titre": "the faster answers and the problem…",
          "Contenu": "the faster answers and the problem solutions"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keairah",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T22:31:29.000Z",
          "Titre": "Zoey has awesome customer service",
          "Contenu": "Zoey has awesome customer service! Helped me through the complete process and made everything clear to understand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Ide",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T01:52:49.000Z",
          "Titre": "Very good explanation about what was…",
          "Contenu": "Very good explanation about what was needed to get LLC started. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Chudi",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T02:12:51.000Z",
          "Titre": "John was very helpful and patient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jessica law",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T18:29:04.000Z",
          "Titre": "Rhean was very helpful and informative…",
          "Contenu": "Rhean was very helpful and informative with the entire process"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jarrett Haynes",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T06:40:25.000Z",
          "Titre": "Gee was amazing",
          "Contenu": "Gee was amazing, consistant,and extremely patient with me.She's the best,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:47:29.000Z",
          "Titre": "Miles was good",
          "Contenu": "Miles was good, and respectable. Helped me walk through the whole process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jayjonezfemalegmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T18:44:32.000Z",
          "Titre": "He didn't give up on my issue",
          "Contenu": "He didn't give up and just change things. He actually stayed with me until my issues were fixed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Audra",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T22:33:28.000Z",
          "Titre": "John was beyond helpful and…",
          "Contenu": "John was beyond helpful and informative!!! Thank you so much for this service and the help, John!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Evelyn Avelar",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T21:44:58.000Z",
          "Titre": "Janelle along woth website was so…",
          "Contenu": "Janelle along woth website was so helpful to start my very first LLC!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn Hopkins",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T02:02:21.000Z",
          "Titre": "Was helped through the process fairly…",
          "Contenu": "Was helped through the process fairly easy and straightforward."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kassie RIzk",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T06:56:51.000Z",
          "Titre": "Gee was so good",
          "Contenu": "Gee was so good. She even called before I even started filling up. I though it was a scam but all good. Thanks for the service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Shepa",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T04:05:20.000Z",
          "Titre": "LLC help",
          "Contenu": "She helped me with everything I need help with creating my llc."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vickie Hubbard",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T21:26:09.000Z",
          "Titre": "Very knowledgeable and had Patience…",
          "Contenu": "Very knowledgeable and had Patience with me through the whole process"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anissath Ibikounle",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T19:54:16.000Z",
          "Titre": "Chris really help with the LLC…",
          "Contenu": "Chris really help with the LLC application"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan Pasion",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T07:16:18.000Z",
          "Titre": "Thank you Erica for walking me through…",
          "Contenu": "Thank you Erica for walking me through the process and answering my many questions.  Thank you againJuan"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlos Amaya",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T01:07:45.000Z",
          "Titre": "Very knowledgeable and Kat was patience…",
          "Contenu": "Very knowledgeable and Kat was patience and friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T07:00:38.000Z",
          "Titre": "Great and prompt service",
          "Contenu": "Great and prompt service. Answered all my questions and was very friendly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kervince Jean Louis",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T03:50:37.000Z",
          "Titre": "Great agent",
          "Contenu": "Great agent. Talk me through the process with ease"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcus Joyner",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T20:10:58.000Z",
          "Titre": "Awesome service very respectful and…",
          "Contenu": "Awesome service very respectful and helped me through the process easily."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NK",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T00:22:29.000Z",
          "Titre": "Very thorough and detailed",
          "Contenu": "Very thorough and detailed. Great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andre Smith",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T23:59:54.000Z",
          "Titre": "Great job very knowledgeable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judy Ann Pasiona",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T00:51:44.000Z",
          "Titre": "CJ handled the issue very…",
          "Contenu": "CJ handled the issue very professionally in no time. Very excellent job!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "antona.mariangmail.com",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T23:21:36.000Z",
          "Titre": "Dan - awesome customer service",
          "Contenu": "Dan is patient with all my website questions. Also accommodating on my aggressive timeline."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Biran Ndiaye",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T22:19:10.000Z",
          "Titre": "I am was very happy with Kate customer…",
          "Contenu": "I am was very happy with Kate customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alison Schoenfeld",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T00:22:11.000Z",
          "Titre": "Maddison was a great help"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Isha Logistics Dispatch",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T22:37:20.000Z",
          "Titre": "They are attentive in their approach to support and assist customers",
          "Contenu": "They have very good customer servise"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darryl White",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T23:32:45.000Z",
          "Titre": "QUIBNB Easy!!!",
          "Contenu": "Taylor Brand team made it easy to do and answer all  my questions."
        }
      ]
    }
  ]
}