{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "tecisoft.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laura Miller",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T18:55:43.000Z",
          "Titre": "Not able to return items",
          "Contenu": "I was not aware that my purchase could not be returned if I was not satisfied with the product. I would have ordered from another vendor that would allow me to return the item OR not ordered this item had I know it could not be returned. The item in not defective, it's just a poor design that does not work for me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeanette Jordan",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T15:02:38.000Z",
          "Titre": "Buyer beware",
          "Contenu": "Buyer beware.  I placed an order with 2-5 business days shipping.  On the fourth day, noticing the order had not shipped yet, I contacted the company to be told the item was on back order and would not be shipped for 2-3 weeks.  IMO that information should have been available during checkout or on the website like many other sites provide. At the very least, a courtesy email would have been appreciated.  It's a shame I had to find out about the delay the way I did.  I cancelled my order and will find a more reputable source."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris Webster",
          "Nb_Reviews": 3,
          "Date": "2023-04-07T02:11:00.000Z",
          "Titre": "2 weeks later canceled my order!",
          "Contenu": "I ordered a laptop cooler. I waited about 2 weeks and contacted them. Tecisoft responded by saying that that that item was a minimum order of 2, and refunded my payment. So why let me order and then make me wait 2 weeks? There was no mention or nothing of it being a minimum order of 2. So they wasted my time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ROBERT KLINGLESMITH",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T19:33:40.000Z",
          "Titre": "Going on 2 weeks and still waiting for…",
          "Contenu": "Going on 2 weeks and still waiting for a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dj Tiger",
          "Nb_Reviews": 1,
          "Date": "2022-12-26T02:06:18.000Z",
          "Titre": "Said it came with everything, then sent half and admitted that it didn’t after purchased and would not send the parts that stated came with the item",
          "Contenu": "Before I purchased speakers from Tecisoft I contacted them and made sure my price was correct, and that all items I needed were included. They assured me via text communication that everything was included. I received the partial of the items in about a week. The parts I specifically asked were not with what I was sent. I contacted them the same day and 3 days later they write me back and say it was my fault those items were not included. Instead of sending me the items that I paid for that they assured me came with it they wanted me to return and not honor their word. It’s horrible communication after you purchase an item. They don’t answer the phone, or call you back. I have screenshots of the entire conversation from Tecisoft to back up my review."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ray Holt",
          "Nb_Reviews": 3,
          "Date": "2021-12-28T22:17:14.000Z",
          "Titre": "i bought two new H110 ASRock boards and…",
          "Contenu": "i bought two new H110 ASRock boards and they did not come in new packaging. The screw was missing for the SSD card. If you are going to sell something other than new you need to say so in your advertising. Its called False Advertising."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MICHAEL JOHNSON",
          "Nb_Reviews": 1,
          "Date": "2021-12-30T21:57:44.000Z",
          "Titre": "You cancelled my order for the Full…",
          "Contenu": "You cancelled my order for the Full Tower computer case. Without any reasonable explination. I did get my refund. Not sure what that was all about but I will not order from you again!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NOT A VERIFIED RESELLER",
          "Nb_Reviews": 1,
          "Date": "2022-09-10T02:15:17.000Z",
          "Titre": "Had to file a complaint with my credit…",
          "Contenu": "Had to file a complaint with my credit card for a refund. Also notified Axis that you are not a good seller. Axis told me you are not a verified reseller."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Glenn McCall",
          "Nb_Reviews": 2,
          "Date": "2021-09-02T10:47:14.000Z",
          "Titre": "Poor communication",
          "Contenu": "Asked for review and haven t received product.Asked if it was a new motherboard and told it was until after I ordered it then changed to used.Shipping showed to be a few days not a week or two.Waiting to see when I receive product and I what condition it’s in"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joshua Garcia",
          "Nb_Reviews": 1,
          "Date": "2022-03-05T01:08:42.000Z",
          "Titre": "Motherboard I received is faulty and…",
          "Contenu": "Motherboard I received is faulty and they still haven’t gotten back to me!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MARY HENSON",
          "Nb_Reviews": 1,
          "Date": "2021-11-26T15:10:26.000Z",
          "Titre": "I still haven’t received the product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Hatfield",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T00:27:03.000Z",
          "Titre": "Slow but made up for it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T06:26:18.000Z",
          "Titre": "Order was cancelled and refunded",
          "Contenu": "I ordered an AIO CPU cooler. A few days later my order was cancelled and refunded. On one hand, I'm happy that they let me know and took care of it relatively quickly. On the other hand, not sure why my order was canceled or why the product was even listed if they were out of stock."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chaz",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T18:35:27.000Z",
          "Titre": "While the price was good",
          "Contenu": "While the price was good, it should have been stated on the website that the item was on back order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Runa Toura",
          "Nb_Reviews": 1,
          "Date": "2021-08-11T07:33:00.000Z",
          "Titre": "Slight glitch with the installation",
          "Contenu": "Slight glitch with the installation, but everything is working fine now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Barthen",
          "Nb_Reviews": 2,
          "Date": "2022-10-25T13:52:57.000Z",
          "Titre": "Order took longer than expected, but TeciSoft addressed my concerns an followed through.",
          "Contenu": "I was reluctant to use Tecisoft because they were new and there weren't many reviews. I decided to try them based on the small amount of feedback that I had seen. I placed an order with them on 9/21/2022 for a Kingston SD card and reader. The item expected to ship within 2 to 3 weeks. After 10 days, I hadn't seen any status updates and I had been charged for the item. I personally don't like when companies take payment weeks before an item is shipped. Tecisoft understood my concerns and reversed the charge and said they would still follow through with the order. On 10/17/2022, I finally received my order. This was slightly longer than the estimated shipping window, but I did get my order with the correct items. Tecisoft seems to be a reputable company that I would order from again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JB",
          "Nb_Reviews": 1,
          "Date": "2022-06-07T22:40:41.000Z",
          "Titre": "Great website to get a discounted rate",
          "Contenu": "Great website to get a discounted rate. I purchased the MicrosoftOffice for Mac much cheaper than I could find anywhere else. When I first purchased, I was accidentally sent MicrosoftOffice for PC so it wouldn't activate; however, customer service resolved the problem without issue and sent me a corrected activation code for Mac. I would order again to save the money!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JamesJK",
          "Nb_Reviews": 2,
          "Date": "2022-04-27T23:55:46.914Z",
          "Titre": "Great price and the merchandise works."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Isatou Banaba",
          "Nb_Reviews": 2,
          "Date": "2021-08-18T11:01:16.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service. Will use Tecisoft again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie Kirby",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T12:35:58.000Z",
          "Titre": "I purchased a traveling case from…",
          "Contenu": "I purchased a traveling case from Tecisoft. This item was intended to be a gift for my spouse, however, it was not suitable due to its size. Contacting Tecisoft requesting an RMA was swiftly responded to and granted within 24 hours. The staff of Tecisoft was both polite and quick in addressing the situation. We will definitely consider making future purchases from Tecisoft."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean Marsh",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T14:55:47.000Z",
          "Titre": "Tecisoft is our go-to supplier",
          "Contenu": "Tecisoft is our go-to supplier. Price is not the primary concern for us; rather, we value the stellar service they provide. Our account manager has established a trusting relationship with us, and has reliably addressed our needs every time. He has saved us from difficult situations on numerous occasions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jade Jenkins",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T04:51:02.000Z",
          "Titre": "With a business account and a dedicated…",
          "Contenu": "With a business account and a dedicated representative at my service, I am ensured of the best possible service. I am able to access a wide range of resources, that would otherwise be unavailable to me, and I can obtain the necessary products with ease. Highly beneficial for my business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cameron Miller",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T20:43:15.000Z",
          "Titre": "Chat support provided prompt and…",
          "Contenu": "Chat support provided prompt and effective answers to all my queries prior to purchase. I was highly satisfied with my entire experience with Tecisoft. Little delivery issues but they were attended to swiftly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kai Lynch",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T08:48:23.000Z",
          "Titre": "Tecisoft has consistently provided the…",
          "Contenu": "Tecisoft has consistently provided the best price for the last 3 years and I have been very satisfied with their customer service. They are committed to providing customers with the best deal possible."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Isaac Mills",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T06:58:48.000Z",
          "Titre": "Good For Emergency",
          "Contenu": "Lightning struck the dish, damaging the DVR unit and CyberPower - Battery. Without the protection of the battery, the computer could have been destroyed as well. To prevent future damage, it's best to be prepared ahead of time, especially in lightning-prone Central Florida."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Caleb Loera",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T21:01:02.000Z",
          "Titre": "I bought a TPM from this site and then…",
          "Contenu": "I bought a TPM from this site and then ended up needing to return it. They refunded me and just told me to keep it. Great customer service 👍🏻"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elijah Carter",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T06:07:21.000Z",
          "Titre": "Great price, item as described",
          "Contenu": "Pretty easy to order online. Sourced a router at Tecisoft that has reached end of life or discontinued by the Manufactuer and out of stock at other places. Also fast shipping and the router came well packaged. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leon Morrison",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T17:46:56.000Z",
          "Titre": "Title Great Price",
          "Contenu": "An optimal choice for budget-conscious professionals and business users, the 24 inch Viewsonic monitor offers a sharp Full HD display and solid color accuracy. Though it lacks advanced ergonomics and USB-C, its essential features and affordability make it suitable for productivity tasks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Willis",
          "Nb_Reviews": 3,
          "Date": "2023-09-21T16:05:55.000Z",
          "Titre": "A Very Fair Company To Do Businees With",
          "Contenu": "I had hastily ordered an adapter to complete connection to new computer, but later realized the part could not arrive in time for my project deadline.  After explaining the circumstances to the company, they cheerfully refunded my purchase and couldn't have been nicer people to deal with.  When you deal with this small business, you get personal service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Rasmussen",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T12:34:57.000Z",
          "Titre": "Proactive company",
          "Contenu": "Initially, there were some issues with my order being delayed due to item being on backorder. I knew this when placing the order. A customer service rep reached out to me proactively after a few weeks as the item was still on backorder. They were able to help me with the order and kept me updated on when the item was back in stock.Can highly recommend Tecisoft for your equipment needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T17:42:14.000Z",
          "Titre": "OOS hiccups, great customer service",
          "Contenu": "Placed an order of OOS item. Only handful of places had it in stock. After a few weeks of waiting, emailed for support and was given an ETA. Item arrived on time. Glad customer service was able to provide an accurate timeframe as I needed this to complete some in-wall wiring I was doing before Christmas."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jaden Bowlin",
          "Nb_Reviews": 1,
          "Date": "2022-03-19T16:57:48.000Z",
          "Titre": "About shipping.",
          "Contenu": "Took forever for the shipping, waited more days than usual till I had to contact support to get them to ship my package. I’ve later received an email about the apology waiting longer than usual, and I just might order from tecisoft again sometime. They were very nice and hope they wouldn’t have to deal with any more issues again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacob Bart",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T07:28:08.000Z",
          "Titre": "Good Price",
          "Contenu": "Have been using my new dell laptop for about a month and so far so good. It's lightweight and compact, perfect for travel, performance is decent and the price was right. The computer starts up fast and battery life seems to be pretty good. The only caveat I have is it didn't come with a bag and that seems to be extra."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Corona",
          "Nb_Reviews": 4,
          "Date": "2022-06-13T23:14:18.000Z",
          "Titre": "Great price, Awesome product & Super fast delivery !",
          "Contenu": "The Thule DOP Kit was priced better than anywhere else and it arrived sooner than expected ! (and as for the Thule DOP kit, Which I'll be using as a airplane travel accs for battery back-up, Cable caddy & more it's perfect !)Thanks !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Hunt",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T20:05:44.000Z",
          "Titre": "Tecisoft fixed a UPS screw up",
          "Contenu": "UPS delivered my Windows 10 package to a place that was not discovered for 2 weeks.  UPS does not take a picture of the delivered package.  Tecisoft resent the package, using USPS, and I received the package.  Tecisoft made it right, though UPS made the mistake."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Miller",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T21:26:30.000Z",
          "Titre": "Shipping was super quick",
          "Contenu": "Shipping was super quick.  The product was what we needed and arrived in perfect condition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margie",
          "Nb_Reviews": 2,
          "Date": "2021-10-01T14:50:37.000Z",
          "Titre": "Very well pleased with purchase of APC…",
          "Contenu": "Very well pleased with purchase of APC Pro UPS.Arrived sooner than expected in great condition,and it works GREAT - been tested many times sinceinstalled!Just wish my smaller UPS would have gone out at sametime as bigger one; would have ordered two!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronald Gruner",
          "Nb_Reviews": 1,
          "Date": "2022-01-06T16:48:58.000Z",
          "Titre": "Very Pleased",
          "Contenu": "I decided to return my purchase of an unopened Windows 10 license after I no longer needed it. Tecisoft provided a refund, no questions asked."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jemar Brooks",
          "Nb_Reviews": 2,
          "Date": "2021-08-24T18:36:10.000Z",
          "Titre": "I would refer anyone to tecisoft",
          "Contenu": "I would refer anyone to tecisoft, package was delivered on time, in great condition.. Great company!! No problems with order, Thanks so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phil F",
          "Nb_Reviews": 1,
          "Date": "2022-07-27T22:36:06.000Z",
          "Titre": "Prices and customer service were great…",
          "Contenu": "Prices and customer service were great and email responses were also very prompt !!  Shipping was incredibly fast !!  A+ transaction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam J",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T21:33:05.000Z",
          "Titre": "First experience with Tecisoft and I…",
          "Contenu": "First experience with Tecisoft and I have found a new place to shop. Competitive price, great quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "cutomer one",
          "Nb_Reviews": 1,
          "Date": "2022-04-15T23:41:45.000Z",
          "Titre": "Happy customer",
          "Contenu": "Was not sure about Tecisoft having never used them before, but they came through. Good price and timely shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keegan Schabbing",
          "Nb_Reviews": 1,
          "Date": "2021-11-05T18:41:44.000Z",
          "Titre": "My windows 10 boot drive worked flawlessly!",
          "Contenu": "My windows 10 boot drive worked perfectly,as did the windows key that came with it! And as a first time PC builder this helped me out a lot!! Would 100% recommend!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 4,
          "Date": "2023-09-01T03:56:34.000Z",
          "Titre": "Discontinued product hard to find",
          "Contenu": "Discontinued product hard to find - price was great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-03-21T16:32:15.000Z",
          "Titre": "Printer",
          "Contenu": "Ordered a printer came sooner than expected. Was exactly what ordered. No comments"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Byron Elmore",
          "Nb_Reviews": 2,
          "Date": "2023-08-19T21:45:54.000Z",
          "Titre": "Very good product",
          "Contenu": "Very good product!  The \"Tripp-Lite\" works as advertised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BW",
          "Nb_Reviews": 2,
          "Date": "2021-12-26T12:59:46.000Z",
          "Titre": "Good transaction",
          "Contenu": "Item arrived quick, no shipping damage, product exactly as described."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim M.    Bend, Oregon   July",
          "Nb_Reviews": 2,
          "Date": "2022-03-09T07:42:24.000Z",
          "Titre": "Package arrived on time and sealed",
          "Contenu": "Package arrived on time and sealed.   Tracking was excellent by company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan Hocherman",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T08:34:43.000Z",
          "Titre": "Great Experience, no issues",
          "Contenu": "Good packaging and support via chat was very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sinisa",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T07:24:44.000Z",
          "Titre": "Customer support from Ismaila is above…",
          "Contenu": "Customer support from Ismaila is above and beyond. Thank you for providing excellent customer support!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Martin",
          "Nb_Reviews": 1,
          "Date": "2022-03-30T10:09:00.000Z",
          "Titre": "Prompt delivery of order parts",
          "Contenu": "Prompt delivery of order parts, they were the parts I requested."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "rudy diaz",
          "Nb_Reviews": 1,
          "Date": "2021-09-01T23:07:58.000Z",
          "Titre": "easy transaction--ordered my item",
          "Contenu": "easy transaction--ordered my item, and it arrived a few days later!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martin Regan",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T16:38:43.000Z",
          "Titre": "Product was as advertised and delivered…",
          "Contenu": "Product was as advertised and delivered as promised. Thanks a lot."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenton Ackerman",
          "Nb_Reviews": 1,
          "Date": "2021-08-16T17:04:49.000Z",
          "Titre": "Excellent Choice",
          "Contenu": "The price, transaction, product, and shipping exceeded expectations...very well done!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Irl Green",
          "Nb_Reviews": 11,
          "Date": "2022-03-16T09:43:59.000Z",
          "Titre": "Great site",
          "Contenu": "Great site. Easy to navigate. Listings are everything I needed. Easy to download the products. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Catherine Potts",
          "Nb_Reviews": 2,
          "Date": "2021-11-05T15:44:47.000Z",
          "Titre": "I am excited about the press",
          "Contenu": "I am excited about the press.  I am new to this craft and the machine works wonderfully well.  Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aisha",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T08:42:08.000Z",
          "Titre": "We had it installed and it works as…",
          "Contenu": "We had it installed and it works as expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ArchTerran",
          "Nb_Reviews": 1,
          "Date": "2021-08-09T12:38:12.000Z",
          "Titre": "5 star",
          "Contenu": "The 1st usb didn't work but they sent me a 2nd one so I'm all good to go."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Marc Primeau",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T00:06:50.000Z",
          "Titre": "Great communication and timely…",
          "Contenu": "Great communication and timely responses."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Bomboy",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T14:49:34.000Z",
          "Titre": "Great prices",
          "Contenu": "Great prices, fast service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Loida Cotto",
          "Nb_Reviews": 1,
          "Date": "2022-06-05T18:09:17.000Z",
          "Titre": "Greatest order & receive op ever!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Essinam A",
          "Nb_Reviews": 1,
          "Date": "2021-08-31T11:18:27.000Z",
          "Titre": "Fast delivery",
          "Contenu": "Product came well packaged and arrived promptly"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Dawda Kolo",
          "Nb_Reviews": 1,
          "Date": "2021-09-08T17:56:04.000Z",
          "Titre": "No Issues",
          "Contenu": "Arrived on time. Product as described"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Wegner",
          "Nb_Reviews": 2,
          "Date": "2021-08-31T10:52:22.000Z",
          "Titre": "Solid company",
          "Contenu": "Solid company. Will use again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tata Z.",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T04:20:21.000Z",
          "Titre": "Good inventory and products received in…",
          "Contenu": "Good inventory and products received in perfect condition!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mike Gallegos",
          "Nb_Reviews": 2,
          "Date": "2022-04-26T15:10:05.833Z",
          "Titre": "Great Support and Flexibility.",
          "Contenu": "Great Support and Flexibility.Looking forward to continue doing business with Tecisoft."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis A.",
          "Nb_Reviews": 1,
          "Date": "2022-07-26T14:21:46.000Z",
          "Titre": "Reliable",
          "Contenu": "Trustworthy site."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred Dawson",
          "Nb_Reviews": 1,
          "Date": "2021-09-08T18:38:22.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. Very fast shipment and delivery. Excellent pricing."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Musa C",
          "Nb_Reviews": 1,
          "Date": "2021-08-10T14:04:58.000Z",
          "Titre": "As described"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Vlasov",
          "Nb_Reviews": 1,
          "Date": "2022-04-25T19:01:50.697Z",
          "Titre": "Windows 10!",
          "Contenu": "It's definitely Windows 10. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Realann Odsigue",
          "Nb_Reviews": 1,
          "Date": "2021-08-16T15:08:02.000Z",
          "Titre": "Ships very fast",
          "Contenu": "Ships very fast. Would love to do business again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cristal Charlez",
          "Nb_Reviews": 1,
          "Date": "2021-12-07T20:53:35.000Z",
          "Titre": "Fast shipping thank you so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "corey",
          "Nb_Reviews": 6,
          "Date": "2022-03-06T14:33:22.000Z",
          "Titre": "All good",
          "Contenu": "All good, solid seller."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maximo Wullich",
          "Nb_Reviews": 2,
          "Date": "2023-06-28T22:04:30.000Z",
          "Titre": "All great",
          "Contenu": "All great, thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Huong Nguyen",
          "Nb_Reviews": 1,
          "Date": "2022-03-30T23:50:04.000Z",
          "Titre": "Friendly",
          "Contenu": "Friendly, reliable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Wegner",
          "Nb_Reviews": 2,
          "Date": "2021-08-17T10:41:31.000Z",
          "Titre": "👍🏻",
          "Contenu": "👍🏻👏🏻👏🏻👏🏻👉🏼😺🙀💋✊🏾✊🏾✊🏾✊🏾"
        }
      ]
    }
  ]
}