{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "teletracnavman.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Sean O' Keeffe",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T11:26:28.000Z",
          "Titre": "Absolutely terrible service",
          "Contenu": "Absolutely terrible service. Paid upfront to have Teletrac put cameras on our vehicle las week. The people who were employed to do it didn't finish the job and informed us that they couldn't go back as they were now on other jobs. Teletrac were unable to help as the person who was dealing with it was not in the office! we have been withourt a vehicle for a week and still no sign of a resolution. Don't use Teletrac!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Dan Norvell",
          "Nb_Reviews": 3,
          "Date": "2023-09-04T15:48:52.000Z",
          "Titre": "Do yourself a favour find someone else for tracking",
          "Contenu": "Would love to give it a zero but no option. 3 tractor units all stopped tracking. Teletrac have \"logged it\" 2 weeks to get an engineer out. No response about any kind of credit for lack of service. Just one in a long list of poor service and arms length customer service that is good at logging stuff, but unable to resolve anything."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "AndyB",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T16:19:28.000Z",
          "Titre": "Very bad service",
          "Contenu": "Very bad service , had new trackers fitted 3 weeks ago but can not get them added to our tracking screen******* UPDATE **********Still no contact so we have had no option but to cancel any payments due, We have been advised by citizen advice that we can have the trackers removed and return along with the invoice for removal ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stacie Feller",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T18:35:51.000Z",
          "Titre": "NON RENEW NOW",
          "Contenu": "My fleet decreased and they have ZERO terms for reduction or cancellation.  I have to continue to pay $471 per month for 36 months.  I never expected them to just let me out, but did think there was some option (was even willing to pay a cancellation fee).  They auto renew and you are just STUCK."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A disappointed customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T01:04:27.000Z",
          "Titre": "There are better GPS tracking websites/services out there",
          "Contenu": "Since I signed up with Teletrac Navman I've had a constant stream of problems, some of which have been resolved and some not. I've had issues with the tracking devices not tracking mileages accurately; I've had issues with not being able to calibrate our vehicle's mileages on the website; I've had issues with getting tracking devices installed in our vehicles; I've had issues with not being able to edit the users on the website in spite of being the site Admin. Those are just a few of the many problems that I've had. The customer service has been fairly helpful, but their response times are hit or miss. When our contract runs out I will not be renewing with Teletrac."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Marcos Smaniotto",
          "Nb_Reviews": 18,
          "Date": "2022-08-26T22:44:19.000Z",
          "Titre": "Careless installer",
          "Contenu": "This review is for the installer. Cannot comment on the tracker functionality. Installer left my van dirty, with scratches and a dent in the passe ger door. Did not tell anyone, just dropped the keys and went out. Very poor care with other people's properties. Just because it is a working van, doesn't mean can be treated like that!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Loni Richardson",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T02:24:36.000Z",
          "Titre": "THIS IS A HORRIBLE PRODUCT!",
          "Contenu": "We started dealing with Navman in June of 2022.  If I had it to do all over again- I would never have made the call.  At first everyone we spoke with was nice but as time went along and we started calling in with the issues we were having, no one ever returned our calls. In the last 6 months we tried emailing and calling both to get an address to return the unused boxes and have had no reply.  We even told them we were going to stop paying for the contract and still no reply.  These eld boxes are a joke.  They do not work as far as tracking you and the locator was never correct. Also, they sold me these on the pretext that there was IFTA reporting capabilities and then tried to tell me that was only if i input all mileage manually. We had a driver get an HOS violation due to the eld - we are still not sure why because he had done everything exactly as he should have."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Yahire London",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T14:59:15.000Z",
          "Titre": "Still no update a Month later.",
          "Contenu": "Still no update a Month later.Requested new trackers, raised a complaint, called multiple times. No update given, a joke"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Alan",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T15:05:31.000Z",
          "Titre": "Avoid if you can",
          "Contenu": "A few issues are still outstanding raised over 2 months ago. Communication with our account manager and customer support is hard. Not answering calls or replying to emails. I have tried to schedule a meeting with account manager and support team management to gain an understanding on what can be done to resolve reported issues and ETA's- 4 weeks on, still no meeting scheduled. Currently, we will not be offering any further work to Teletrac Navman until services and relations improve. Referring to TN360- Website advertised functions do not work as advertised or communicated during sales appointments."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kevin",
          "Nb_Reviews": 18,
          "Date": "2022-08-28T20:09:21.000Z",
          "Titre": "Technology is poor.",
          "Contenu": "I bought the package that includes a key fob that you need to be in the car with you when driving.  I’m am now on my third set in 12 months as they somehow keep being disconnected from the tracker system.  Today the third set also gave up so I assume set 4 is on the way!  I have a three year package.  I wonder how many fobs I’ll have before my subscription expires?  At this rate it will be around 9.  Still they are very good at sending new ones when there hardware fails.  Again."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Lol",
          "Nb_Reviews": 24,
          "Date": "2022-09-05T18:48:58.000Z",
          "Titre": "Deserves No stars",
          "Contenu": "Deserves No stars. We have a 2018 van that has a Teletrac Navman satnav system which came with the new van.  In June we had a reminder for the renewal of £99.00 to keep using which we paid.  Today we called them to ask how we update system to show new roads, was told NO you cannot do that as they do not update the maps.  When asked what we do about all the new roads we were told, well they have the main roads on!  What a Joke this company is, if they had told us that we could never update the system we would not have renewed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T18:23:26.000Z",
          "Titre": "I wish I could give them -100 stars!",
          "Contenu": "I wish I could give them -100 stars! You are never able to talk to anyone above a customer service person. My issues have been going for 2yrs and allI hear is we will have to escalate your issue. Just went through an IFTA audit and almost every month there is a problem with miles tracking and or start and finish mileage is not adding correctly! All im told is we have to escalate your issue. I email them daily telling them my equipment doesnt work, their plug and play units to 4G do not work with my PTO's or Cameras and they want me to pay to upgrade and install all new equipment. I have never seen such a useless management team. Now when I call customer service to check to see if they have any new information for me I'm told I need to talk to technical support when I'm transferred to technical support they tell me it's a customer service issue then transfer me back to customer support. Then I'm told they will have to escalate this. I tried cancelling but they want me to buy out the rest of my contract for thousands. I resigned a contract 24 months ago and my equipment has never worked correctly since day one! STAY AWAY!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Neil",
          "Nb_Reviews": 2,
          "Date": "2023-03-12T13:25:08.000Z",
          "Titre": "Terrible",
          "Contenu": "If I could give this company zero rating I would. The Trackstar service and technology is absolutely terrible! The tags never work. I have had mine replaced multiple times and they are continually giving me false alarms. You can not speak to someone in customer service, they only give an email and then never respond to requests. There seems to be no complaint process. When you do speak to a service rep they are very unhelpful and argumentative. When I requested new tags I received the instruction in bold to return the faulty tags or you will be charged which sums up the view of the customer with this company! What about if you get zero customer support and your technology never works properly we will be happy to compensate you and have that in bold! The problem I feel is because of the deal this company has done with BMW etc. you have their technology when you buy the car and it’s not easy to change. This creates complacency within the company and no desire to improve. Certainly when I buy a new car in the future I will check if this technology is installed and this will heavily influence my decision to purchase the car or not."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "JTR",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T19:45:58.000Z",
          "Titre": "Do not recommend.",
          "Contenu": "I'm on my second set of fobs after just over a year. The first set lasted 2-3 months before the alarm went off every time I got in the car. The second set have lasted around 9 months and once again, the alarm is going off every time I get in the car.I replaced the batteries as requested. Alarm goes off every time I get in the car.Their response, when it finally arrived via e-mail as they don't seem to have a customer service line only a chat bot...Take it back to your BMW dealer.Dreadful, would not recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MA",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T19:11:40.000Z",
          "Titre": "Would give it a zero if I had the…",
          "Contenu": "Would give it a zero if I had the option.   Non existent customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Brewster",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T00:01:07.000Z",
          "Titre": "The company stopped offering service but continued charging us!",
          "Contenu": "The company stopped offering service for the units we had installed in our vans back in February of 2022. We were never notified that service would not be ending but we were continually charged the monthly service. We contacted them in July when we noticed that it was not tracking our vehicles. We were then told we would have to upgrade to the new version 4G units so the systems would work. if we agreed to pay for the units and signed a new contract we would be credited for the past charges going back to February 2022.  We agreed and waited for an email  with a new contract. We never recieved an email but were charged the following month for service and we have been charged every month since. We have contacted them every month and have been told a different story each time. We reached out again today 1/24/2023 to try and get credited and new units. We are giving up and going to our credit card company in hopes of having the charges credited. If you are thinking of tracking for your fleet vehicles. DO NOT USE THIS COMPANY AS THEY ARE SCAMMERS!case# 01091645"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rhonda W",
          "Nb_Reviews": 1,
          "Date": "2022-06-21T23:26:49.000Z",
          "Titre": "No desire for problem solving or customer retention",
          "Contenu": "What a disappointment.  We have had Teletrac in three of our work trucks for several years.  We lost communication with our vehicles on 6/7/22. We needed to add a new work truck to our account as well, so I called. There was a migration from 3G to 4G that required new equipment in our existing vehicles, that's why no service.  To add the new truck there was no charge for equipment and a 3 year contract.  We paid $139 per vehicle for the 4G upgrade with no contact extension on the existing vehicles.  We received plug and play equipment that we had to SELF INSTALL.  Seems that this isn't the best equipment for tampering, but the self install is above my pay grade.  I was told I could pay $179 per vehicle and wait 2-3 months to have the upgrade installed.  I asked how could it be that I could order equipment for our new vehicle at no charge and only pay the monthly fee for software reporting and have it installed in 8 calendar days - and yet it would be $318 per vehicle for equipment and installation done within 2 months for vehicles that we have been paying the monthly fee for, for years.  I was met with a canned response that the company \"tried to do it the best way they could\".  No concern that we have been customers for years.  I was given the email address to write my cancellation to and told that I may still owe for the contracts that were never extended.  No regard for our business, no desire to retain us as customers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JMK",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T18:09:32.000Z",
          "Titre": "I was given a series of links- I…",
          "Contenu": "I was given a series of links- I appreciate extra information- but no answer to my question- only a series of links."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Chamberlain",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T10:09:12.000Z",
          "Titre": "Get a better system because I'm always…",
          "Contenu": "Get a better system because I'm always having problems logging on its always non responsive"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Zac Leslie",
          "Nb_Reviews": 2,
          "Date": "2023-06-13T12:26:11.000Z",
          "Titre": "Great software but i've had better…",
          "Contenu": "Great software but i've had better customer service from a mugger."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T17:41:29.000Z",
          "Titre": "Not helpful",
          "Contenu": "Not helpful and asked really irrelevant, borderline dumb questions."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Vicky",
          "Nb_Reviews": 1,
          "Date": "2021-12-17T11:57:30.000Z",
          "Titre": "The worst customer service",
          "Contenu": "The worst customer service.  On my 6th attempt to sort new contract and cancel/send back unused trackers and no one answering my emails.  When you call they tell you to email, which they don't answer and tell you they haven't received any email?  Now on hold waiting to cancel the whole contract.  After 15 minutes I decide to call them back to speak to someone else."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Robert Garner",
          "Nb_Reviews": 24,
          "Date": "2021-09-06T16:27:55.000Z",
          "Titre": "Careless and sloppy security and procedures",
          "Contenu": "I keep getting alerts that my car is being driven without the tracking fob. In all cases this has been incorrect so a new fob was dispatched (very promptly) to an incomplete address which could have easily lead to somebody else acquiring it.No instructions with it either as I presume/hope (for security reasons) it needs some form of ID to activate it."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "marty hanks",
          "Nb_Reviews": 2,
          "Date": "2021-08-04T13:08:57.000Z",
          "Titre": "Poor customer service.",
          "Contenu": "I paid £49 renewal for camera speed warning. this did not work so I was told it would be rebooted,this also did not work,I was then told my older system was no longer supported and I should ask for a refund by email.this I have done twice.Allmost one month now and not even recognition of receipt of my email.Poor show."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2022-02-18T11:16:03.000Z",
          "Titre": "Been trying to cancel for 6 months and…",
          "Contenu": "Been trying to cancel for 6 months and all we get back is you have to pay the 3 year contract in full even though we never asked for it to be renewed.System stops working on a regular basis we don’t even report it anymore.Would never use them again."
        },
        {
          "Note": 1,
          "Lieu": "JM",
          "Pseudo": "Tim C",
          "Nb_Reviews": 3,
          "Date": "2021-12-21T12:52:51.000Z",
          "Titre": "I can see why Teletrac has bad reviews",
          "Contenu": "I can see why Teletrac has bad reviews.  Teletrac's tech is not as advertised.  Promises do not add up to what they can provide.  When pressed for a demo, the Director of Sales said that she cannot send out less than 30 units which must be under contract....and then required a contract for 200 units.  We use thousands of GPS units, but needed to demo and review their product further because of discrepancies in what different sales reps said their product could do.  Other companies provide a demo, and we've found that there are several companies whose tech actually works."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Richard Edwards",
          "Nb_Reviews": 6,
          "Date": "2021-03-18T09:29:54.000Z",
          "Titre": "FURTHER TO MY FIRST REVIEW",
          "Contenu": "FURTHER TO MY FIRST REVIEW, DON'T USE THIS COMPANY AS THEY DO NOT RETURN FUNDS WHEN YOU SELL A VEHICLE. THEY ALSO MAINTAIN THAT BY REPLYING ( ON TRUSTPILOT) TO YOUR BAD REVIEW THAT THEY WILL LOOK INTO IT (HAVING GIVEN INVOICE NUMBERS AND DATES) - STILL WAITING TO HEAR FROM THEM TWO WEEKS LATER. THERE ARE BETTER COMPANIES TO DEAL WITH OUT THERE!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brent",
          "Nb_Reviews": 1,
          "Date": "2020-09-02T13:35:02.000Z",
          "Titre": "Avoid",
          "Contenu": "I have been trying to get a buyout price from this company for almost 2 months... no one answers or returns calls and don't even think about emailing... that message most likely gets sent straight to the trash folder. All I am hoping for is a buyout price so our company can never cross paths with Teletrac ever again. Hopefully this review gets a response since my last one from 2018 DID NOT."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Israel. G",
          "Nb_Reviews": 1,
          "Date": "2020-08-24T15:06:34.000Z",
          "Titre": "I was really exited about switching to…",
          "Contenu": "I was really exited about switching to new service , but not anymore . When the service got sold to me it was brilliant and really promising, so far I’m really disappointed. I am still waiting for “somebody” to contact me to show me how to use and set up my app. So far my verizon connect that I was switching from is working better and GPS app features offer more. I am thinking of canceling your service."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Invoicing Tedsveg",
          "Nb_Reviews": 1,
          "Date": "2020-11-13T09:52:32.000Z",
          "Titre": "Aslong as they have there money, they go quiet",
          "Contenu": "Having problems resolving an ongoing issues with ATS trackers. Company more then happy to take the money. Agreed on a return and refund but 30 days later, no one seems interested. Still being charged for 8 units we do not have and that did not work. Hopefully this prompts a response from someone in there management team. Other then that. The vehicle trackers we have installed on our fleet with perfectly. Few teething problems but apart from that. All Good"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Dean",
          "Nb_Reviews": 5,
          "Date": "2020-09-17T12:46:25.000Z",
          "Titre": "Teletrac navman bunch of cowboys…",
          "Contenu": "Avoid teletrac navman bunch of cowboys charge for extras and even want paying when out of contract... which they just renew themselves with out any warning try to get you to sign upto 3 year contract when only a 1 year contract was agree (please read small print with these guys) they should be wearing masks total rip off merchants AVOID AVOID AVOID"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Teds Veg",
          "Nb_Reviews": 4,
          "Date": "2020-11-17T14:26:53.000Z",
          "Titre": "Posting until someone actually calls and sorts this problem",
          "Contenu": "Having problems resolving an ongoing issues with ATS trackers. Company more then happy to take the money. Agreed on a return and refund but 30 days later, no one seems interested. Still being charged for 8 units we do not have and that did not work. Hopefully this prompts a response from someone in there management team."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Steve Donna Kelly",
          "Nb_Reviews": 3,
          "Date": "2021-04-08T05:54:52.000Z",
          "Titre": "What a crap Company.",
          "Contenu": "I have had a Teletrac Navman for 3 years now, I have had nothing but trouble with it. I recently sent the screen back to them for a replacement and they sent the new one to the wrong address so I still have no service, I have emailed the 3 times now and get no replies. what a crap company."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Teds Veg",
          "Nb_Reviews": 4,
          "Date": "2020-11-18T18:26:29.000Z",
          "Titre": "Is anyone going to contact me",
          "Contenu": "Having problems resolving an ongoing issues with ATS trackers. Company more then happy to take the money. Agreed on a return and refund but 30 days later, no one seems interested. Still being charged for 8 units we do not have and that did not work. Hopefully this prompts a response from someone in there management team.Day 5, promise of someone contacting regarding this issue and still nothing. * The correct people I need to speak are not available via calling them, they apparently need to call me*"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicholas Delguidice",
          "Nb_Reviews": 1,
          "Date": "2020-02-03T21:45:28.000Z",
          "Titre": "Seriously lacking in billing and customer service…",
          "Contenu": "Lacking in billing and customer service Not able to send addresses to drivers thru the mobile app for the last 3 years. Advised them several times and still no change. Billing.... do not expect to receive any refunds or price adjustments if out of contract or cancelled lines and they make the error on updating.Move on"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cathy Roscher",
          "Nb_Reviews": 1,
          "Date": "2018-11-05T18:19:36.000Z",
          "Titre": "The only reason I gave them one star is…",
          "Contenu": "The only reason I gave them one star is because there is no spot for NEGATIVE stars!    Their customer service is HORRID!!   Our ELDs do not work,  I have contacted them at least 6 times on this issue and they have STILL not created a work order to have someone come out and fix them.  I even sent an email to the president of the company, and still, our issues are not resolved!   Stay away from this company!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Dean Mitchell",
          "Nb_Reviews": 8,
          "Date": "2020-01-16T17:00:33.000Z",
          "Titre": "Tele trac",
          "Contenu": "I have bought a Citroen Berlingo enterprise van with Teletrac navman installed, the van was ten months old , now it has just turned one year old , teletrac stopped working, hard to contact teletrac using the pa button, and have had a call back from a reception lady who took my details, she said I should have a reply with in 24 to 48 hours , four days now and no reply, my sat nav was never registered from new probably because the previous owner had similar problems. So not impressed."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Dave Legault",
          "Nb_Reviews": 2,
          "Date": "2019-01-23T18:31:44.000Z",
          "Titre": "E-mail me your phone number for an honest review!",
          "Contenu": "I am so upset with the customer support at Navman, that if you e-mail me your phone number, I will personally call you and give you 100 reasons why you should avoid this company at all cost!Dave.Legault@ Johnnystowing.com Do yourself a favor, and read the reviews before signing up, there are many customers on many sites with many issues.  DO NOT GET INVOLVED"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr Scott Logan",
          "Nb_Reviews": 8,
          "Date": "2019-06-25T11:54:09.000Z",
          "Titre": "By far the worst customer service I…",
          "Contenu": "By far the worst customer service I have ever dealt with by a huge margin, very rarely get any response from sales, wait for ever for replacement units, can never get them fitted, they can never get invoicing correct, we are based less than a mile away from Keele offices, we have been a customer for 15 years with over 200 cubes and mnav units. We will be leaving this company end of contract they have no interest in us as a business so we now feel the same."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew Peterson",
          "Nb_Reviews": 1,
          "Date": "2019-03-12T23:08:49.000Z",
          "Titre": "Turned our company over to a collection attorney",
          "Contenu": "Turned our company over to a collection attorney after a year of interrupted service. Attorney said our company owed 3500.00. We were under the impression that our account was set up as auto pay which turned out it wasn't. We were unaware. No interruption in service and no phone call or letter from Teletrac for over a year. We found out from a attorneys phone call. HORRIBLE customer service. NEARLY IMPOSSIBLE TO CANCEL CONTRACT WITH THEM BEWARE!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jamie - Marbill Coaches",
          "Nb_Reviews": 1,
          "Date": "2018-09-20T09:19:03.000Z",
          "Titre": "Terrible Business Attitude.",
          "Contenu": "I don't even know where to start with this company - UK TeletracNavman*Customer Service = Zero*Sales = Zero (Mis-Sold Products)*Repairs = Zero*Terms - 90 days to resolve any problems.Breached Terms and won't terminate contract under their own terms.Emailed Head of Operations UK, and also Head of Finance UK - Zero Response. Terrible Business Attitude."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David King 9136365830",
          "Nb_Reviews": 1,
          "Date": "2018-06-06T14:32:41.000Z",
          "Titre": "Terrible Customer Support",
          "Contenu": "Customer support cannot handle any situation other than a quick troubleshoot. They will then proceed to open a support ticket. When finally contacted on the more difficult matter, I missed their call and they closed the case the following Monday after 2 months of waiting for a response! My unit has been down this entire time, and I'm just praying DOT doesn't stop my vehicle. DO NOT USE THIS COMPANY."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Trojan Scaffolding Ltd",
          "Nb_Reviews": 2,
          "Date": "2019-05-29T09:04:46.000Z",
          "Titre": "Customer service is very poor",
          "Contenu": "Customer service is very poor, communication and responses are extremely slow or non existent. The sales rep did not point out clause 6.2 of the T&C's (my error for not reading the 5 pages of small print) so be very aware and cautious of using this company. I will not be recommending any of our clients or colleagues to use them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Parrish",
          "Nb_Reviews": 1,
          "Date": "2018-03-28T15:59:53.000Z",
          "Titre": "Worst service!",
          "Contenu": "Worst service!It has now been OVER 3 months since the request for service was made with no appointment or date of service.My company has been a long time customer for years. I have stayed on hold for hours over the last several months, sent countless emails and all I receive is a case number with the false claims of being contacted soon. We are now shopping for a new carrier.WORST SERVICE EVER!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gerald Gossman",
          "Nb_Reviews": 1,
          "Date": "2018-03-13T21:56:14.000Z",
          "Titre": "Made several calls cannot get a…",
          "Contenu": "Made several calls cannot get a response always promised a technician would call us back none of this equipment works we cannot get anyone to help us nor tried to fix the situation We been 4 months now trying to get it to work we cannot get it fixed nor get any help to have a solution or a resolve to this issue It keeps coming on with ELD malfunctioning revert to paper logs 3 out of the 3 on ELD"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Melanie Hines",
          "Nb_Reviews": 3,
          "Date": "2019-08-16T16:16:36.000Z",
          "Titre": "The software issues are beyond…",
          "Contenu": "The software issues are beyond ridiculous, I have not had properly working equipment for Six months, Lori Herrera is the only one so far that has been able to fix any of our issues, she is incredible, the software and equipment issues are still a problem even though she continuosly fixes them then something else goes wrong."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Craig Ward",
          "Nb_Reviews": 7,
          "Date": "2018-12-06T10:30:38.000Z",
          "Titre": "Teletrac ignore cancellation requests for over 2 years!!!!",
          "Contenu": "I have been a customer for a number of years and the product is good. Staff are always polite however when you try to cancel a subscription for vehicle tracking this company is frustratingly awkward. I have a vehicle that we have been trying to close a subscription since May 2016!!! Communication has been poor and nobody seems able to get this sorted after yet more phone calls and emails this week. Please sort this out and process my refund in good faith."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Damien Sanchez",
          "Nb_Reviews": 2,
          "Date": "2018-10-02T20:05:27.000Z",
          "Titre": "Horrible company to work with",
          "Contenu": "Horrible company to work with, when you initially sign up you think you are signing a 36-month contract, if you add a device they create a new contract on the date you add it, so its impossible to cancel all your devices.  On top of this, we spent 6 months trying to cancel, and nobody would call us, outrageous.  Never do business with this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christine",
          "Nb_Reviews": 1,
          "Date": "2018-03-06T17:39:02.000Z",
          "Titre": "Your equipment sucks horribly!!!!!!!!!!!!!",
          "Contenu": "I deal with a about 5 techs that are totally amazing. The so called service manager in charge of our account doesn't exist.  Not one bit of communication.  I get more response out of our sales rep. The main issues I have is the equipment sucks.  I am constantly having to call and get repairs.  I get replacements and they don't work.  With the new DOT regulations the pathetic equipment is going to get everyone in trouble."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ella Kaletnik",
          "Nb_Reviews": 1,
          "Date": "2018-01-17T00:42:43.000Z",
          "Titre": "ELD Devices are horrible since the …",
          "Contenu": "ELD Devices are horrible since the first day we received them, they are constantly freezing up and having more issues. My drivers started getting violations because of those devices.This company is horrible to work with.Customer service sucks!!!! NOT HELPFUL UNPROFESSIONAL Can never get ahold of the management! PEOPLE BE AWARE WHAT YOU GETTING YOURSELVES IN TO"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jim Roberts",
          "Nb_Reviews": 8,
          "Date": "2018-04-01T05:38:53.000Z",
          "Titre": "Absolutely awful customer service!",
          "Contenu": "Absolutely awful customer service. Repeated official complaints ignored by several different people. Requests for settlement bill ignored. No help with system. No communication. My advice - Stay well away!! UPDATE - nobody answered the customer care no. listed in their reply below. Had already made 9 months of calls and emails before resorting to this bad review."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Beachey",
          "Nb_Reviews": 2,
          "Date": "2019-06-05T14:16:29.000Z",
          "Titre": "WORST ELD PROVIDER",
          "Contenu": "After 6 weeks with unit down and no resolution in sight, we had to park our truck for CSA week as we did not want any violations for their HORRIBLE product.  Have had so many issues since day 1 it’s ridiculous.  And as others have commented, you are stuck in a three year contract.  HORRIBLE company... read the reviews ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rena Erickson",
          "Nb_Reviews": 1,
          "Date": "2019-07-20T13:17:10.000Z",
          "Titre": "Taggart Transportation Account set up not complete",
          "Contenu": "The person helped with my log in and account with the company, but the driver logs are the only part that showed up, I have no vehicles in my sign in account. The drivers did not show up on the rest of the administrations login accts.Our entire account needs to be brought up to the new standard. Please fix ASAP."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom Karnemaat",
          "Nb_Reviews": 2,
          "Date": "2017-05-22T21:25:36.000Z",
          "Titre": "Teletrac is the worst expience that I …",
          "Contenu": "Teletrac is the worst expience that I have every day and if I could get out of my contract I would in a heart beat. From the price savings that never happened to the continual logging in problems to the not being able to trac  my guy's from my phone to the inability for my guys to use the system because of the inconvenience of it. I couldn't be more unhappy!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jesse Chavez",
          "Nb_Reviews": 2,
          "Date": "2017-05-16T18:02:48.000Z",
          "Titre": "Teletrac is the worst vendor I have …",
          "Contenu": "Teletrac is the worst vendor I have ever had. We have been loyal customers for over 20 + years. Can't seem to get any help with our fleet tracking issuesWE ARE MOVING ON..their customer service skills are horrible. We've been told Verizon-Network Fleet run a good ship, and are half the cost. With a 30 vehicle fleet we need someone we can depend on. They are not it.Jesse ChavezPresident / OwnerBerkel MidwestChicago, IL"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Diana Jane Carroll",
          "Nb_Reviews": 2,
          "Date": "2019-11-20T14:14:57.000Z",
          "Titre": "Dreadful customer service",
          "Contenu": "Dreadful customer service. Need them to come out to correct problems? That will cost you. Meanwhile the cameras are hanging off the windscreens as the equipment is poorly (and as cheaply) fitted as possible. Avoid at all costs. Appalling service from the start. And plainly nobody there actually cares."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Terri",
          "Nb_Reviews": 7,
          "Date": "2017-12-14T13:21:12.000Z",
          "Titre": "WARNING!!!",
          "Contenu": "unfortunately the customer service has been terrible i would also seriously advise people to read the ts+ cs carefully. We were unhappy with the service and wanted to change companies. But to buy out of around 10 trackers they told us it would cost 30K to cancel.I would strongly recommend to be careful and where possible to avoid completely"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Raquel Briseno",
          "Nb_Reviews": 2,
          "Date": "2019-12-11T21:21:27.000Z",
          "Titre": "VERY BAD CUSTOMER SERVICE TODAY",
          "Contenu": "VERY BAD CUSTOMER SERVICE TODAY. NO ONE WAS ABLE TO HELP ME WITH MY ISSUE. NO STRAIGHT ANSWER. SPOKE TO JOEL ID#6451 HE WAS VERY RUDE. I ASKED TO SPEAK TO SOMEONE ELSE AND TOLD ME THAT IF I WANTED TO SPEAK TO SOMEONE ELSE TO HANG UP AND CALL BACK AGAIN. HE REFUSED TO LET ME SPEAK TO HIS SUPERVISOR."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Aussie Andy",
          "Nb_Reviews": 6,
          "Date": "2018-12-09T01:03:20.000Z",
          "Titre": "I desperately wish they would stop harassing us!",
          "Contenu": "I feel really disappointed that I have to write a public review on a company that I’ve never dealt with, however... on New Years Eve I bought the Assets and Goodwill of a business that had been a Teletrac Navman customer and notified the company very soon after the takeover.Since then I have been bombarded with Invoices and Statements that are meant for the previous Owner, I have called, emailed and written but they are so ignorant! God help anyone who actually has an account with them!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Liz",
          "Nb_Reviews": 1,
          "Date": "2015-05-26T13:33:54.000Z",
          "Titre": "Purchase of a new unit for Vehicle WM58 GDX",
          "Contenu": "Awful process from start to finish.  The original order was lost/mislaid by Adam Lamont. I ordered it on the 30th March.  To date, the PTO unit of the Navman has never reported data.  After many emails and phone calls an engineer is allegedly attending tomorrow - the 27th May 2015.\r I have escalated this matter to my MD and we are looking to move all the account as a result of the way this order has been managed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony Cappalli",
          "Nb_Reviews": 1,
          "Date": "2018-01-26T17:54:54.000Z",
          "Titre": "I have been waiting 2 full weeks for a …",
          "Contenu": "I have been waiting 2 full weeks for a response. I have left messages for 5 separate people including the vice president of this company who has 3 messages from me.  NO RESPONSE form anyone. We have been a customer for 2+ years and our system has an integration issue that prevents it from functioning properly. By far the worst customer service I have ever experienced. Hopefully someone higher in this organization actually reads these reviews and I can actually get a response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2018-04-17T15:37:50.000Z",
          "Titre": "Very poor customer service!!!",
          "Contenu": "Do not use!!!!  We have been trying to get someone to answer basic questions since December of 2017.  I start sending emails again in March and finally someone responds and he can't help me because he is in the retention department.  He forwards to our account mgr.  It's been another two weeks and our assigned account Mgr. has not responded.  This company uses delay tactics when it comes to cancelling services.  Emails go an answered for months at a time.  Very disappointing!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tracy Belcher",
          "Nb_Reviews": 1,
          "Date": "2018-02-07T15:43:37.000Z",
          "Titre": "Absolutely awful customer service",
          "Contenu": "Absolutely awful customer service. Repeated official complaints ignored by several different people. We have filled out on line about 2 different issues. With no response. I was promised call back. Didn't happen. I was gave a number that was our customer rep 817 323 1469. Ha! I tried that number. What do you know...it's no longer a working number.  I have been a customer over 10 years. I am done with the lies and run around. No communication. My advice - Stay well away!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Kassi Renders",
          "Nb_Reviews": 1,
          "Date": "2020-01-31T20:13:53.000Z",
          "Titre": "Would be great if all of my GPS's…",
          "Contenu": "Would be great if all of my GPS's worked, and didn't constantly leg. I have multiple trucks with screens that don't work and for three weeks now I've been told by the tech department that \"were working on it\" or \"I'm sending this up the ladder to another department\". Telling me to turn off and turn on the screens or make sure they are charging. This has been an issue since Navman did a system update: it knocked 14 of my trucks offline and 6 trucks screens all stopped working at the exact same time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Diana Clarke",
          "Nb_Reviews": 2,
          "Date": "2018-03-14T20:11:52.000Z",
          "Titre": "When I was getting information on the…",
          "Contenu": "When I was getting information on the devices sales person was excellent. After we signed he stopped answering emails. I asked for a supervisors name and gave me a number that mailbox was full couldn't leave a message. I emailed no response. I still haven't received my devices after 2 weeks of signing so beware!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Bala",
          "Nb_Reviews": 1,
          "Date": "2018-08-10T15:32:01.000Z",
          "Titre": "They do not care about their customers..",
          "Contenu": "If you are considering buying a Smartnav system from Teletrac Navman and you want good customer service DO NOT BOTHER. I've been a customer of Teletrac for over 10 years and recently had a new system installed. I have been trying to contact their customer service for over two weeks with a problem on my new Smatnav, even leaving messages for a manager call back and had absolutely no response. This is not what you expect from a company. They care more about selling products than their customers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim Stinson",
          "Nb_Reviews": 1,
          "Date": "2018-03-30T23:51:23.000Z",
          "Titre": "I am not pleased at all with the…",
          "Contenu": "I am not pleased at all with the customer service from Teletrac.  It usually takes 45 minutes to an hour on hold to get in touch with anyone .  I have called my account manager and left voice mails, sent emails....nothing ever happens.  The person I spoke to the last time I called was very helpful although the equipment that  I was supposed to receive hasn't shown up.  I was then transferred me to my account manager and of course nothing...crickets.  Very unimpressed with the customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Neil Lowe",
          "Nb_Reviews": 2,
          "Date": "2018-01-23T18:26:54.000Z",
          "Titre": "Absolutely junk!",
          "Contenu": "Absolutely junk!Logs me off while driving 5-6 times a day. I waste time every day trying to stay in compliance. It's unsafe to me because I'm always stopping on roadside to fix it !It's lilable to cause a accident because of malfunctions.. and demands it requires to get working properly..Junk!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laura Benoit",
          "Nb_Reviews": 2,
          "Date": "2018-05-11T16:00:44.000Z",
          "Titre": "This is a follow up",
          "Contenu": "This is a follow up!  I am still getting bills from this company and they never delivered the product!  It was never installed and never delivered but they keep telling me I have to pay anyway....  I can't wait to see them explain this in a courtroom when they take me to collections!  Stop Billing Me.  They respond on complaints, but no one follows up.  Run do not use this company - if you ever needed anyone to help with an issue you would never hear from them again, except through your monthly billing!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Karl",
          "Nb_Reviews": 6,
          "Date": "2018-04-06T21:44:02.000Z",
          "Titre": "Cheap bits of plastic with less…",
          "Contenu": "Cheap bits of plastic with less technology than a 1980s calculator, for which they charge £60-£80 a time; unhelpful staff passing the buck between themselves and dealers; instructions that look like you’re running the lunar landing project; appalling communications, sporadic, relying on email. And to top everything they take money from your bank account for cars you don’t even own.I’d try anyone but these people. Goodness knows why Range Rover have them as approved suppliers. They should move on."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank.t Trejo",
          "Nb_Reviews": 1,
          "Date": "2018-01-11T00:41:22.000Z",
          "Titre": "Very crappy service you will not get …",
          "Contenu": "Very crappy service you will not get ahold of nobody had done but problems I have a fleet of 15 trucks all the e-logs are on UK time cannot get ahold of nobody at this company all they tell you is they're working on it if you could get out of it get out of it very shity service stay away from this company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Danny Clay",
          "Nb_Reviews": 1,
          "Date": "2020-09-07T18:38:10.000Z",
          "Titre": "the worse of the worse.I get alert or…",
          "Contenu": "the worse of the worse.I get alert or notification 48 hours later, when my driver already speed or Ideal  or others. costumer service is the worse, no one can solve ur problem. bad English speakers..poorer quality,,,lower standard..( I'm AAA carpet cleaner.)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Linda Wilk",
          "Nb_Reviews": 1,
          "Date": "2018-02-05T23:54:05.000Z",
          "Titre": "I had been a long term user of Teletrac …",
          "Contenu": "I had been a long term user of Teletrac when I had to get their upgraded units.  I upgraded my company vehicles to their latest version after they assured me they had an app that work. I was assured I could follow the vehicles on a cell or Ipad.  This product never worked!  They do not stand behind their promise of the app working and now I am forced to pay for a contract that I have not used for over two years.  If I could rate them zero I would.  There is no way I should have to pay for devices that do not work!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2019-10-23T08:08:20.000Z",
          "Titre": "Let down by very bad service",
          "Contenu": "Very poor experience from start to finish.Teletrac either failed to send the SD card for the dashcam or the engineer they sent to fit it lost it. This took several months to resolve. Customer support were very poor at responding to get this fixed.Upon requesting to cancel the system, an extra year seems to have been added to the contract despite having only signed up for a 24 month period. Despite still having to pay for another 8 (or 20!!) months, Teletrac have now switched off my system. If I am paying for a service, sure I should be able to use this??"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maarten Verwey",
          "Nb_Reviews": 2,
          "Date": "2019-02-02T00:32:09.000Z",
          "Titre": "Worst company. Stay away unless you want a headache",
          "Contenu": "We have been a customer for over three years. Worst experience ever I-10 rating. We are in need of a tracking system  but this company is the worst customer service and they are very disorganized and disconnected from all departments we are still waiting to be updated to a new were platform the units are not working correctly.  We have placed over 100 phone calls and emails over the last six months and they cannot get this resolved so we have no other option then to remove all the units and go with a different company. Maarten.Fence World"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vince P",
          "Nb_Reviews": 1,
          "Date": "2019-07-09T07:09:28.000Z",
          "Titre": "There a lot better choices",
          "Contenu": "Been running system for awhile. Doing edits it very frustrating and does not always take. Had unit malfunction where driver was unable to change statues and log out of system for days. Was unable to force driver logoff or even edit drivers log. There system always slow and gets bad reception. It's a pain in rear both for us in office and for drivers. Have use different ones in past with other companies and they are all better than Teletrac .Looking at getting more trucks and will be staying away from Teletrac. Have not been happy with them for years."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Watts",
          "Nb_Reviews": 2,
          "Date": "2018-03-01T13:14:28.000Z",
          "Titre": "Terrible Product Terrible Company",
          "Contenu": "We have had three people in our company try to get help from this company. I have called and emailed and explained that their product does not work. My phone calls and emails have been ignored. Most recently I have emailed and called one of their reps, who has not responded either. We are trapped in a three-year contract with a product that doesn't work, with a company that doesn't respond or care to correct their defective product. I gave them a one star because zero is not an option. Don't consider this product!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Leanne Clark",
          "Nb_Reviews": 4,
          "Date": "2022-02-02T11:58:15.000Z",
          "Titre": "Worst Customer service ever experienced…",
          "Contenu": "Worst Customer service ever experienced and take weeks to respond. Ongoing problems. Conned into renewing our contract and do not care that we are unhappy as a customer as long as they get our money."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Geoff",
          "Nb_Reviews": 1,
          "Date": "2016-03-15T16:21:36.000Z",
          "Titre": "Awful service",
          "Contenu": "Lots of faults with trackers. Painful dealing with the service department, it takes many conversations with many different people before anything happens and then it happens very slowly. We  can't face dealing with them any longer so we will be moving to another system once the contract ends."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Multi Hire Power Tools",
          "Nb_Reviews": 4,
          "Date": "2019-04-05T06:37:22.000Z",
          "Titre": "2 Incidents",
          "Contenu": "2 Incidents. Theft of generator, v unhelpful with deciphering the signals, more interested in CYA and so recovery was delayed. Eventually recovered but minus the trailer.Theft of van. Thieves found and removed the GPS aerial but no alert was sent. Totally ineffective."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jesse Cryns",
          "Nb_Reviews": 1,
          "Date": "2019-08-05T22:49:36.000Z",
          "Titre": "We have had an awful experience overall…",
          "Contenu": "We have had an awful experience overall with Teletrac Navman. The reporting does not work, we can't get our rep to train us, the system does not allow for easy use and tracking as promised and the hardware is outdated and has to be installed in each vehicle and is not easy to move to another vehicle if you need to due to a sale or breakdown. They lock you into a 3 year contract and you have no way to get out or change once you are in, No good driver reports, no vehicle maintenance alerts, tracking is hard to find and navigate, just the whole thing has been a waste of 3 years."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Arleen Smith",
          "Nb_Reviews": 1,
          "Date": "2021-06-27T15:56:47.000Z",
          "Titre": "If I could give this company a ZERO I…",
          "Contenu": "If I could give this company a ZERO I would.  Customer Support is horrible - Technical Support is just as bad.  All customer support is based in Mexico which we were never told that.  I was told today “YOU CANNOT HAVE ANY USA BASED CUSTOMER SUPPORT UNLESS YOU ARE A HIGH PAYING CUSTOMER OF OVER $10K PER YEAR”.  Wow!  Takes weeks for a technician to come out if you are having problems.  You can never speak to the same person - and plan on being on the phone for a minimum of 1 hour anytime you call!!!  I would never recommend this company for any business looking for GPS installation.Update: After reading their response, it has been 5 days and no one has reached out to me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2018-01-10T22:46:32.000Z",
          "Titre": "Horrendous customer service",
          "Contenu": "Horrendous customer service.  Have to wait days for assistance.  Not what we signed up for.  Switching from paper to ELD has been a nightmare.  Trying to keep up with it and we are a very small fleet.  I can only imagine what the problems a big fleet would have with this.  If we could get out without paying the penalty, we'd be gone.  Not  working right now on an issue of the ELD disappearing from a driver's unit.  We finally got it back after several days.  Went to try to update the ELD and now driver has all kinds of violations.  Utterly ridiculous."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Shane Wells",
          "Nb_Reviews": 3,
          "Date": "2019-07-13T11:08:21.000Z",
          "Titre": "A truly awful company to deal with",
          "Contenu": "A truly awful company to deal with, avoid avoid avoid.Sneaky contracts, awful hardware, non-existent support and nobody to complain to.I've learnt the hard way, please don't make the same mistake and get tied into a 3 year contract with these guys."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dissatisfied customer.",
          "Nb_Reviews": 1,
          "Date": "2018-12-06T20:23:12.000Z",
          "Titre": "Over 4 months for an install...",
          "Contenu": "It took over 4 months for us to get everything to install a unit in one of our trucks. Everyone we spoke with always passed the buck to someone else. Very dissatisfied with the service we received. We have nearly 100 of these units total. Ever install gets worse."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Darran Walker",
          "Nb_Reviews": 2,
          "Date": "2018-09-19T10:07:08.000Z",
          "Titre": "Slick sales operation but no customer service",
          "Contenu": "Migrated to new system over 12 months ago. Van has tracker onboard but I have no way to connect with tracker. Have been asking Teletrac to sort this out for 12 months but customer support is non existent. Still insist on invoicing for a system that I cant access."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Craig Sumrall",
          "Nb_Reviews": 1,
          "Date": "2019-09-06T16:56:29.000Z",
          "Titre": "CRAP SERVICE ALL THE WAY AROUND!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!Sometimes hard to get a CSR that speaks…",
          "Contenu": "Sometimes hard to get a CSR that speaks English well enough for me to understand them. Guess I need to learn Spanish so I can communicate with the CSRs. Also, when I am able to understand the person on the other end, there are times that it sounds like there is a fiesta going on due to the noise in the background. Been trying to get our system completely changed from AOBRD to ELD for a few months now to no avail. ELD website is always having issues. Some tasks that are needed to be done are not always available. Have to log out and hope that it is not the next day before I can check/change whatever I need to do."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Joseph Chadd",
          "Nb_Reviews": 3,
          "Date": "2017-10-02T11:52:54.000Z",
          "Titre": "These guys are fraudsters.",
          "Contenu": "These guys are fraudsters.They have not installed dour trackers, are charging us for a product we are not receiving & are not answering telephone calls, returning emails or returning voicemails.AVOID THESE FRAUDSTERS. I HAVE REPORTED TO TRADING STANDARDS."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dan Post",
          "Nb_Reviews": 3,
          "Date": "2019-02-27T17:32:57.000Z",
          "Titre": "Terrible response to a very unhappy…",
          "Contenu": "Terrible response to a very unhappy customer!    I am incredibly surprised to find any company today that, when things go terribly wrong, will send a reply that basically says \"TOUGH! You are stuck in a contract\".  After repeated failed attempts to get problems with our equipment (installation issues) and poor tracking performance corrected during an eleven month period, we told Teletrac we were done.  They told us they would not allow this unless we paid the balance of a three year contract.  So, now what!?  My fleet dealer can't even service my new trucks.  What a joke!  Avoid this company!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Barry T",
          "Nb_Reviews": 1,
          "Date": "2020-12-11T06:35:30.000Z",
          "Titre": "Don't get involved with this company",
          "Contenu": "Don't get involved with this company.  They take WEEKS to reply to emails, and if you ever want to get out of the contract they tie you up, so you have to pay THOUSANDS!  Very unreasonable, difficult company to work with."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cyma Transport",
          "Nb_Reviews": 1,
          "Date": "2018-05-11T03:31:34.000Z",
          "Titre": "Customer Services is really really bad",
          "Contenu": "Customer Services is bad, the programs gives errors, the eld gives errors, the errors gives errros... its been 3 months of nightmare and to make things worst, they charge me to send someone to fix their own equipment... like what? STAY AWAY!Carlos M"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paul Nichols",
          "Nb_Reviews": 1,
          "Date": "2019-10-28T16:50:47.000Z",
          "Titre": "A year ago my wife and I bought a brand…",
          "Contenu": "A year ago my wife and I bought a brand new motorhome that came fitted with a tracker supplied by Teletrac Navman. About 6 weeks ago, the Geofence facility stopped working. This is a very important part of the service, as how else are you going to know your vehicle has been stolen? Otherwise you are going to have to wait until you get home to find it gone. And that could be way too late! Our subscription just came up for renewal (£168 for 12 months!). Despite the tracker not working as it should, no discount was offered nor any solid idea of when it would start to work properly again. Customer services is awful. AVOID AVOID AVOID."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Beachey",
          "Nb_Reviews": 2,
          "Date": "2019-03-04T23:27:07.000Z",
          "Titre": "BEWARE... WORST ELD EVER",
          "Contenu": "Worst decision I ever made choosing this company.  Has been nothing but PROBLEMS!!!  Dealing with them for 1 1/2 years has been horrific!  Had one unit that was down from installation for 6 months!!! Currently have had a unit down for over 4 weeks.  Trying to get parts from them is a joke!!  Please be Advised, I DO NOT RECOMMEND THEM!!!!  As for a previous review, they will not allow you to get out of contracts, even if the unit has been involved in an accident, totaled, and is not being replaced.  So now we are paying for service that we cannot use.  And somehow they think I will be a customer following the 3 years... NOT!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amy (Karl) Hoeppner",
          "Nb_Reviews": 1,
          "Date": "2018-04-25T16:54:59.000Z",
          "Titre": "We have 5 older teletrac units which…",
          "Contenu": "We have 5 older teletrac units which work great, always have.  The 3 new units we have now have been a problem since day one.  My drivers have been having trouble logging in, logging breaks, and just communicating with the units period.  Some of the issues have been fixed but on the way to the fix I had been calling in at least 3-5 times per week, and spending anywhere from 30 minutes to 2 hours on hold, just to get through to a csp and not get any results....this has been very, very frustrating as I am sure you can imagine.  Now the biggest question is, do these new tablets and the new director page communicate with FedEx Ground????"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "ian parris",
          "Nb_Reviews": 1,
          "Date": "2019-01-23T08:26:20.000Z",
          "Titre": "I've been trying to contact them for…",
          "Contenu": "I've been trying to contact them for months and they are now on their 4th or 5th rep for our area, but still completely lacking in forthcoming information. Going to cancel our account and move to an alternate tracking provider"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Dalvinder Badial",
          "Nb_Reviews": 4,
          "Date": "2020-06-19T10:39:41.000Z",
          "Titre": "Dont support this business",
          "Contenu": "I am the owner of a Wedding Car company called Direct Wedding Cars LTD. I have trackers installed in four of my vehicles.As we all know we are in a pandemic and all large gatherings including Weddings have been cancelled.So after asking Teletrac Navman for a payment holiday or some help with the issue, they have finally come back to me.They have given me 2 options. I either pay the outstanding bills (which I have explained, we have no money in the business as we haven't had a inwards payment for 4 months) orOption 2 - they will be taking me to court for the payment.I wouldnt support this business by giving them your trade, as they will not support you when you need them.RegardsDal Badial"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Blackstone Construction",
          "Nb_Reviews": 1,
          "Date": "2019-08-06T23:03:41.000Z",
          "Titre": "Without notice no tracking for 6 devices",
          "Contenu": "Without notice, my tracking for 6 devices was inactive for 16 days during my peak construction season in which we work 6 days per week. 98% of the tracking we rely on the app for truck scheduling in the field. After 4 phone calls and one misdiagnosis, the tracking was back up and running and was told, only after I asked, it may have been a billing error. No apology or motion to try to make it right. My small business severely suffered during those 2 weeks and my invoicing in turn is delayed without the ability to check reports.However, I have been with Teletrac for several years with no issues other than shotty installations by local subcontractors of Teletrac that were corrected."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Yazza Shah",
          "Nb_Reviews": 1,
          "Date": "2022-02-18T16:14:06.000Z",
          "Titre": "Been on the orientation for 3 hours to…",
          "Contenu": "Been on the orientation for 3 hours to speak to the satnav team been first in the queue for 2 hours absolutely appalling waste of time. In the end terminated the call"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Anthony O",
          "Nb_Reviews": 7,
          "Date": "2021-04-12T20:19:46.000Z",
          "Titre": "Doubled Disappointment",
          "Contenu": "I recently wrote a review for very poor service and lack of responses to numerous calls for help to take over the account for the Teletrac Navman connected to my vehicle. Having written the poor review I was contacted with promises to follow up and ensure that i would be connected and that I would be registered as a user with full connection and support. I was informed that I would be contacted after giving details for registration for the sixth time. True to experience so far with this company there has been NO reconnection and NO follow up contact from the company representative. Disappointed is an understatement for the integrity of the company if the apologies and promises are not a true and genuine attempt to remedy a customers request for service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "T Covin",
          "Nb_Reviews": 1,
          "Date": "2017-12-01T18:58:33.000Z",
          "Titre": "Worst customer service we have ever …",
          "Contenu": "Worst customer service we have ever experienced. They were extremely helpful with making false promises and getting us to sign a contract on 19 units almost a month ago. We were told they would be shipped out within 4-5 days. 7 days later, no units had arrived. We have been calling everyday to get an update on our order for  2 weeks now and cannot get ahold of anyone on the sales team that made the order, because according to their customer service team- those sales people that helped us are the only ones who can check status of our order. Hopefully something happens soon, otherwise we will be screwed for this ELD mandate that starts in 2 weeks. I would highly recommend NOT using this company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer John Hanik",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T14:02:55.000Z",
          "Titre": "lost the trucks on my computer and…",
          "Contenu": "lost the trucks on my computer and could not track them, after getting it settled, now I can only see a handful ?"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 15,
          "Date": "2023-02-24T13:31:57.000Z",
          "Titre": "Account Managers never get back to you and the online shop clearly doesn't work",
          "Contenu": "We have been a customer of Teletrac Navman for several years and have just purchased a new van which needs a tracker fitting. I used the online shop in our account to request one and it advised our account handler would be in touch, this was over 2 weeks ago. This week I called customer services who said there was nothing on their system they emailed Bobby who apparently is our account manager, I have not heard this name before. Still not heard anything so yesterday requested it again on the online shop and still nothing.Would not recommend using them and we will not be once our current contract ends, we want to give them money with a new tracker and they still cannot be bothered getting in touch"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "My Reviews",
          "Nb_Reviews": 65,
          "Date": "2022-06-21T13:44:10.000Z",
          "Titre": "Not entirely convinced at the service.",
          "Contenu": "Not entirely convinced at the service.Was originally with another well known tracker service with my old car but offered this via BMW and the pricing was good.- Support is often painful to get through to, long waits- The blue fobs constantly break and need replacing (never needed one replacing with the previous company)- Car often shows in a location where it isn't on the app. Right now it shows somewhere it hasn't been for days. - App is awful. Can't view a single journey overall, you have to watch a stupid replay of the journey instead and then it just stops - not very useful at all. - Suffering with the above, then you're not allowed to login and view the journey becuase they tell you to use the app.I'll certainly not be getting another one and will go back to the previous supplier, who had their own issues but certainly the product and app were far more reliable.**Despite the \"we'll be in touch\". They were never in touch."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nikki",
          "Nb_Reviews": 1,
          "Date": "2020-09-22T18:32:39.000Z",
          "Titre": "We have never had all units working at…",
          "Contenu": "We have never had all units working at one time. Half of the time the people we call do not know how to fix the issues. Issues may get fixed but then something else will go wrong. Issues with ELD, tracking, screens going blank, and truck/trailer reporting. We are literally paying for something that may or may not work with no compensation for these issues. We have actually been charged for repairs on the units that we have when they are no fault of our own. Not to mention we are stuck in a contract with this."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Ian Bullough",
          "Nb_Reviews": 6,
          "Date": "2019-09-19T09:27:56.000Z",
          "Titre": "Six months after buying vehicle and…",
          "Contenu": "Six months after buying vehicle and using the service the unit snapped off. As we had found that the teletrac services were't relevant for our business I emailed the company to exit the contract. It took them about 4 months to eventually answer my question. They said that I had entered into a 3 year contact and so I was stuck with the expense for the next 2 years. I had not been made aware that it was a three year contract when signing up. Nor was there any early exit process in place so BEWARE"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Billy",
          "Nb_Reviews": 3,
          "Date": "2018-05-24T19:50:14.000Z",
          "Titre": "If my first experience with Teletrac…",
          "Contenu": "If my first experience with Teletrac had been today, I would have given them 5 stars because the support person I had today (Sam) was excellent!!!  Unfortunately, the past experiences (and there have been many the past two weeks) the support service of Teletrac was horrible.  No responses to emails, no calls back when I have left messages, etc."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "frances padilla",
          "Nb_Reviews": 1,
          "Date": "2018-07-10T19:13:00.000Z",
          "Titre": "they always give you the run around",
          "Contenu": "they always give you the run around, i have been trying for months now to return gps that are not being used, but keep getting charged for! all they tell me is to email some email and they open a case! what for? its stupid. we just want to ship unused gps back to them and for them not to charge us anymore...how complicated is that!!!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Not what we expected",
          "Nb_Reviews": 1,
          "Date": "2015-04-30T11:42:29.000Z",
          "Titre": "Poor Install, Frustrating No reply accounts",
          "Contenu": "Install had to take place over 2 different weekends, lots of parts missing from the first install. Difficult to get all vehicles back on site.\r Paid a lot of money upfront and still no reply from the ignorant people in the accounts section, still waiting for copy paperwork for all the monies we have paid. No reply after several attempts.\r Sales as usual got the sale now not interested"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julia Salgueiro",
          "Nb_Reviews": 1,
          "Date": "2020-09-25T20:41:07.000Z",
          "Titre": "The tech who finally solved this deserves 5 stars..",
          "Contenu": "The two stars is because I am disappointed that this was not resolved with my first call; the first technician clearly is new to support and the product itself.Mario Rodriguez deserves 5 stars and all of the credit - he resolved my problem quickly and efficiently."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard Bailey",
          "Nb_Reviews": 1,
          "Date": "2014-04-03T21:59:07.000Z",
          "Titre": "unimpressed",
          "Contenu": "Was excited to try a new system but have thus far been disappointed with quality of service & features. Tablets are 3 inch, making messages hard to read. Can only save 20 favorites, not the system I would recommend for companies servicing the same addresses. have experienced a lot of down time were units are not registering. notifications for service intervals don't seem to work. looking for a different service"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Tim",
          "Nb_Reviews": 2,
          "Date": "2015-08-18T12:02:06.000Z",
          "Titre": "It all sounded so promising.",
          "Contenu": "We are a new customer to Navman, fitting it into 51 HGV vehicles. Difficult fitting agent, but we got there in the end.\rThe system has failed us several times now and is offline as we speak, and has been for several hours. Navman just blame the Vodafone network which isn't much good when you've got vehicles sat waiting. The helpline just seem to say 'its not our fault'.\rIf only they could get the thing worked properly it would be great."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "VICKI TRUSSELL",
          "Nb_Reviews": 1,
          "Date": "2018-01-25T15:28:50.000Z",
          "Titre": "QUICK TURN AROUND TO INSTALL",
          "Contenu": "QUICK TURN AROUND TO INSTALL. SALES REP WAS VERY HELPFUL. HOWEVER THERE HAS BEEN 2 ISSUES THAT I CALLED IN AND RECEIVED CASE NUMBER, NO CALL BACKS. CUSTOMER SERVICE TOLD ME IT COULD BE MONTHS ON A UNIT THAT DOES NOT WORK. I NEED TO RUN THE TRUCK. POSSIBLY THE WORSE CUSTOMER SERVICE EVER. I GAVE THE STARS TO SALES."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mr Lees",
          "Nb_Reviews": 2,
          "Date": "2018-04-24T09:03:20.000Z",
          "Titre": "No response by email at all. Gave up trying to call too.",
          "Contenu": "We have had this this system for about 5 years now. The email response is non existent. We have had issues downloading it to a new computer and trying to get help as proved fruitless. We do not even know who our account manager is so next week we have arranged someone else to come in and give us  a quote."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Allen Van Volkinburgh",
          "Nb_Reviews": 1,
          "Date": "2019-12-17T21:13:39.000Z",
          "Titre": "When it takes over 30 minutes on hold…",
          "Contenu": "When it takes over 30 minutes on hold to get a hold of a company that is pathetic customer service....  Now I have a unit that is not working properly and the Metro Mobile people say they can't come out and fix it until the middle of January???  How is that possible...."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "John\tTaylor",
          "Nb_Reviews": 8,
          "Date": "2019-07-24T16:28:48.000Z",
          "Titre": "Poor Customer Service",
          "Contenu": "Hopefully somebody from Teletrac Navman will see this and come back to me about the accounts queries I have raised with a so called account manager in addition to the 3 e-mails I have sent and the person in accounts I spoke to on Tuesday who said somebody would call me back. That was 2 days ago and still waiting - on verge of pulling plug and moving to another supplier. Customer service has gone south since they decided, like most organisations these days, that its cheaper to run everything through the website than deal with your customers in person."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cooke's C",
          "Nb_Reviews": 1,
          "Date": "2017-05-16T18:07:08.000Z",
          "Titre": "It can take a while to get the correct …",
          "Contenu": "It can take a while to get the correct data and then to print out past logs. It only works with Internet Explorer on our computers. The quicker view does not print easily and is sometimes missing crucial information such as: vehicle was stopped for 45 minutes, driving for an hour and 15 minutes etc."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "AHB",
          "Nb_Reviews": 1,
          "Date": "2015-08-11T07:56:26.412Z",
          "Titre": "Automatic renewal beware!",
          "Contenu": "I wanted to move the couple of vehicles that I had with teletrac to a much more efficient system we are using with Quartix.  I have just been informed that they have an automatic renewal policy and that they want a fee per vehicle to release me from the contract.  I had negotiated a 12 month deal as I had said that I didn't want to be tied in for 2 years.  At no time was it mentioned that renewal was automatic and no notice of pending renewal is given to their customers.  I will make sure that I don't use them again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "George P. Goodrich",
          "Nb_Reviews": 3,
          "Date": "2019-11-02T13:24:32.000Z",
          "Titre": "I like the old system better, except the part where I was always losing signal, right when I needed it.",
          "Contenu": "I like the old system better.  This one requires you to be (not driving ) to goto Where to?  to view a message.,  to check a log for time , or  location.  I don't stop therefore I don't use.  EDLs do nothing to improve safety, they actually do just the opposite  by forcing drivers to, \"race against the machine.\"  (This includes speeding in construction zones, tailgating left lane cruisers, passing on the right,  running stop signs, and more)  I wish they'd just let drivers use \"common sense\" like they do in Europe.  I guess American drivers are too stupid, and don't really care ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dennis Streif",
          "Nb_Reviews": 1,
          "Date": "2017-05-19T22:06:21.000Z",
          "Titre": "Reliability is job one",
          "Contenu": "Reliability is job one, too many devices not working in our fleet. Too much time working on said devices. Too many phone calls, and too much time holding on the phone to discuss problems. Granted our devices are three years old, but they've always been unreliable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gloria R Pratt",
          "Nb_Reviews": 2,
          "Date": "2018-05-04T12:45:42.000Z",
          "Titre": "We've had and are still having so many…",
          "Contenu": "We've had and are still having so many issues that it's hard for me to keep up with the problems and driver errors. We really need technical support that can fix the issues and not have me as an individual with 10+ trucks trying to fix your problems."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Fred Estrada",
          "Nb_Reviews": 3,
          "Date": "2020-11-22T17:31:44.000Z",
          "Titre": "I have been dealing with tech support…",
          "Contenu": "I have been dealing with tech support for more than six months obviously your short on staff and or the product is just not performing the way it was presented. On a scale 1-10 I’m at 3-4 and ready to try another company"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jessica Ogle",
          "Nb_Reviews": 1,
          "Date": "2019-12-11T12:45:50.000Z",
          "Titre": "Not happy with the service",
          "Contenu": "Not happy with the service.  There are a lot of issues with communication with the tablets. Drivers should not have to spend so much time on the phone with the service department to get their tablets functioning properly.  Our office and drivers have spent many hours trying to fix the systems and the technical staff are never on the same page. It should not take 24 to 48 hours to receive advice. If Teletrac really knew what it was like being a truck driver on a time limit for a day they would do a better job servicing them or developing a better system so they wouldn't have to go onto paper logs every other day.  It really is ridiculous!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shawn Runcie",
          "Nb_Reviews": 1,
          "Date": "2018-01-19T15:08:24.000Z",
          "Titre": "If you want anything done make sure you call them.",
          "Contenu": "The customer service I received over the phone was great, but this was only after I called them. I put in a ticket for a tablet problem back in September and a ticket for a problem running reports in November but never received and response back."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jimmy Fisher",
          "Nb_Reviews": 1,
          "Date": "2019-07-24T18:18:40.000Z",
          "Titre": "Serigo does a great job in trying to…",
          "Contenu": "Serigo does a great job in trying to help. He is very professional and knowledgeable. However; he does not have much to work with as the equipment is old school and very problematic. Modern technology has left this system behind."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Warren Zumbrum",
          "Nb_Reviews": 1,
          "Date": "2020-02-17T15:27:23.000Z",
          "Titre": "I was switching from one fleet name to…",
          "Contenu": "I was switching from one fleet name to another fleet name. This took several week to get set up. My ELD were not working for that amount of time. I don't think this shou;d have been as difficult as it was."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tom Rhoads",
          "Nb_Reviews": 1,
          "Date": "2017-12-11T17:30:24.000Z",
          "Titre": "The only reason I gave two stars …",
          "Contenu": "The only reason I gave two stars instead of one is because the Teletrac support team has never been rude. I would NOT recommend this ELD system. When it works, it's fine, but if it goes down, good luck at getting technical help. One of our units has been acting up for over two months. Technician has been out twice, still actiing up. I've called technical support on three occasions, had to wait in excess of 20 minutes to have someone tell me they have made a case # and will call me back. Have not had ONE call back yet. If it were in my power, I would run away from this incompetent company as fast and as far as I could. The only thing they've done for me is get my blood pressure raised."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2018-05-11T17:43:03.000Z",
          "Titre": "We have had 5 tablets and fleet…",
          "Contenu": "We have had 5 tablets and fleet director in service for 2 years and the system has served its purpose. In January I had 2 more units installed. The tablets have not been able to connect to the units since day one (they don't show up in the Bluetooth list on the tablet). I have entered multiple tickets and made many phone calls with no resolve. Today I did reach a representative George who really was trying to help by having me install an update. Thinking this fixed the problem the ticket was closed. I am back to square one with 2 trucks that are running interstate illegally because they won't connect AND I have been paying for these since installation. All I want is for them to fix this issue before we get a DOT stop!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tisha Jaurez",
          "Nb_Reviews": 1,
          "Date": "2019-07-29T20:41:51.000Z",
          "Titre": "for our customer service helper Karla…",
          "Contenu": "for our customer service helper Karla L. I give her 5 starsbut for the total over all rating is a 2the system is constantly crashingthe contract and value of the system is not worth the $"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rhonda Bauer",
          "Nb_Reviews": 1,
          "Date": "2019-09-10T17:03:18.000Z",
          "Titre": "This work order took two visit for…",
          "Contenu": "This work order took two visit for installation, I always use this tech, they are great. But going thru Teletrac to update the work order so they could come back took some time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rick Runyon",
          "Nb_Reviews": 4,
          "Date": "2020-08-07T19:27:35.000Z",
          "Titre": "The first line of support doesn't seem…",
          "Contenu": "The first line of support doesn't seem to be able to think outside of the box, one solution for each problem. The software as well as the hardware seems to be riddled with problems. The TM480's don't seem to track properly, I believe that is due to the antenna being built into the black box and placement could also effect this as the TM470 had an antenna that stuck to the bottom of the dash board. Resolving issues takes way too long. There are many many great people at Teletrac that I feel are victims of circumstances. They had no part in building the software or hardware but continually have to deal with unhappy customers trying to solve problem that won't seem to go away. One scary issue is the Promiles for IFTA taxes, the Promiles platform seems to be solid but the information downloading into it from Teletrac has some serious issues."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris Caiazza",
          "Nb_Reviews": 1,
          "Date": "2019-10-09T20:08:26.000Z",
          "Titre": "The tech support guy I talked to…",
          "Contenu": "The tech support guy I talked to yesterday wanted just to talk and not listen to my problem. It was annoying and I hung up on him. I still dont have my unit fixed"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Adriana Lopez",
          "Nb_Reviews": 1,
          "Date": "2018-02-01T01:01:50.000Z",
          "Titre": "We have had so many issues with these …",
          "Contenu": "We have had so many issues with these ELD we have called the help center they couldn't help me they told me they had to submitted a ticket and someone would call me back. I have submitted 3 tickets since Dec 15,2017 and still have not received a response. Logs keep going into violation. Truck was in the shop for three days driver was off the last 5 days. When the driver logged in today his ELD in the truck is in red status after driving 4 hours today. You can't  call to ask for help. They will tell you they have an over whelming amount of calls, no idea when they can have someone call you back. They will submit a new ticket.The rep that sold us the ELD's was outstanding. The service to get  them installed was very quick and friendly.The Rep handling the upgrade installation was great. You will just have to run with malfunctioning ELD if you have a problem. You have to figure out how to set them up."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Nottingham Electrical Transmissions",
          "Nb_Reviews": 2,
          "Date": "2019-04-24T14:50:26.000Z",
          "Titre": "Poor customer/after service",
          "Contenu": "Having been a customer for about 10 years, I was originally happy with the product & the tracking, but something has drastically changed. When we last had a problem with one of the brackets on a tracker, it took nearly 8 weeks before we were sent a new one (which meant we were without a tracker for all that time).Now we find that the location shown on line is about 10/15 minutes a drift from where you think your drivers actually are. The maps are also outdated on the system & often show you driving through fields or roads that don't exist. My drivers are constantly complaining about how bad the systems are to navigate you anywhere.I sent in a complaint asking for someone to contact me regarding my problems, and received an email back saying my account manager would contact me.... he never did.Now I have received another email saying my complaint is now resolved & closed!!!All I now what to know is how I can get out of this contract, so that we can move to a different company?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lucy Longwell",
          "Nb_Reviews": 1,
          "Date": "2019-07-31T17:02:52.000Z",
          "Titre": "can't seem to get a return phone call…",
          "Contenu": "can't seem to get a return phone call to return wrong product sent, that you are trying to charge me for that i wont pay for!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Donna Lothspeich",
          "Nb_Reviews": 1,
          "Date": "2019-07-17T12:03:55.000Z",
          "Titre": "Have to take specialize training to do…",
          "Contenu": "Have to take specialize training to do simple tasks.  Relates mileage in km guess what we are not in Canada."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2015-04-23T12:04:55.000Z",
          "Titre": "Poor Service",
          "Contenu": "As a Company i find Navman very poor.  Their customer service is terrible and they are overpriced for the goods."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gabriel Graciano - Safety Manager- Lizama Carriers",
          "Nb_Reviews": 1,
          "Date": "2019-07-22T16:46:22.000Z",
          "Titre": "Many bugs all over, very cheatable.",
          "Contenu": "Many bugs all over. A very cheatable system, you only need to remove the Garmin tablet from the mount and the status will be frozen, and even if they see the \"MDT Offline\" (they call it like that when the tablet is removed from the magnetic mount) they are unable to say if the driver did it or not (Case#00371323: \"Driver stuck on driving\"). After many years with this company, you have to see each driver logs to see if the driver used Personal Conveyance or Adverse driver condition in the wrong way to drive more, there's no way to see it in a report of any kind. No automatic yard move, like Onmitrac that have a geofence on your yard and all movement at your yard never trigger a driving status nor unassigned drive time. If the system gets jammed sometimes don't even report logs of any kind during the malfunction allowing the driver to drive more, very bad for safety.Tier one of Support, half of them will never see a Violation if is not showed as a Violation on their screen, no knowledge of HOS rules at all, great customer service but undertrained. I can remember many awesome guys in Tier 1, but they always have to make you wait until they ask your question to the Tier2. Tier 2 is very hard to find."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Michael Harrison",
          "Nb_Reviews": 39,
          "Date": "2019-03-28T16:38:29.000Z",
          "Titre": "You are expected to pay for repairs to Teletrac Equipment after 1 year",
          "Contenu": "Have 6 vans with Teletrac for about 18 months. have had issues with 2 of the trackers in that time. first issue took 3 engineers visits but was eventually repaired. A couple of weeks ago another tracker developed the same fault (ignition showing as off as vehicle is moving). I call up to arrange an engineer visit and am told that as the unit it over a year old I have to pay to fix their faulty equipment!?!I did not choose the equipment (and we haven't damaged it either) they supplied to provide the service I pay a monthly fee for and judging by the 33% failure rate I have experienced over the last 18 months these trackers were chosen on a cost rather than a reliability basis. I really cannot fathom the short sighted policy of a service company that expects their monthly paying customers to pay for the repair of equipment essential to the supply of their service. You would think a professional customer focused company would factor in any potential breakdown costs into their monthly service charge, but guess not.Customer service isn't bad its just really short staffed (I think another poorly thought out money saving measure)  and waiting 2-3 days for a reply to an email or a request to be actioned is not unusual."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Melissa L",
          "Nb_Reviews": 2,
          "Date": "2018-01-10T16:14:44.000Z",
          "Titre": "Poor Response time",
          "Contenu": "Waiting on the 'credit' issue to be resolved.  No one seems to be getting back with me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lee Larington",
          "Nb_Reviews": 1,
          "Date": "2019-09-05T20:43:30.000Z",
          "Titre": "Having connectivity issues",
          "Contenu": "Having connectivity issues, hardware issues, software or firmware issues offen."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott Arndt",
          "Nb_Reviews": 3,
          "Date": "2019-09-04T15:05:23.000Z",
          "Titre": "My last experience was better ,but only…",
          "Contenu": "My last experience was better ,but only because it was a simple fix."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Farren Flynn",
          "Nb_Reviews": 7,
          "Date": "2018-12-21T18:13:41.000Z",
          "Titre": "I have been waiting over a month for…",
          "Contenu": "Read update after initial review here. I have updated from a 1 star to a 2 star. I have been waiting over a month for them to fix issues with my eld units. I still have not received the parts needed. They keep telling me they are reprogramming my units to work. They assigned a new troubleshooter to me to help me resolve the issues. He just forwards my complaints to tech support who don't ever seem to get them fixed. I had 2 other bad reviews on her but navman got them removed as they don't want to fix the issues but they don't want anyone to know about it either. I am fighting the removal of the other 2 reviews. They asked for my account number which you put in the form at the bottom of the page. Their excuse for removal was they didn't know the account number. LOOK AT THE BOTTOM OF THE FORM NAVMAN. IT IS THERE ON EVERY REVIEW I WRITE FOR YOU TO SEE. I speak with your tech support line on a daily basis and they have no issue finding my phone number to return calls later in the day so if you are truly interested in contacting me please refer to my account number and dial the phone number listed for me. thanks.Update:My fixer Jeff finally got deeper involved. He totally agreed with me that my experience here is not acceptable. He did get tier 2 management involved and they have so far sent 2 of the 4 parts needed to fix my trucks. Still waiting on the other to to be sent. Nothing has arrived but I can see the shipping info on the first 2. Jeff is recommending that tier 2 be required to contact the customer before sidelining a suggested repair from tier 1 tech support. As it stands now tier 2 doesn't agree with the diagnosis they just cancel the case. This is where most of the problems of long delay occur."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bruce Kulski",
          "Nb_Reviews": 1,
          "Date": "2019-12-04T18:16:38.000Z",
          "Titre": "The software is not user friendly"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Anthony Exell",
          "Nb_Reviews": 5,
          "Date": "2021-03-05T00:58:25.000Z",
          "Titre": "Wasted 5 months of my life....",
          "Contenu": "I came in blind eyed to a company who had the teletrac system for tracking their vans, it all seemed well until I contacted them to cancel a tracker on one of our vans, ( we have 4 trackers in total) 2 x dating back to contract 2014 2 x dating from 2018 /2017 5 months or about,  it took me to speak to someone who knew what they were talking about! Repetitive back and fourth emails waiting for replies, useless staff,  receiving “if you don’t reply in 3 days we will cancel your ticket “ when I was still waiting for a reply.... The first man I spoke to was no help at all, he  told me we couldn’t pause/ stop the tracker ( which 5 months later I found out I could )he informed me that we were on one year contract that I believed to nearly be up for renewal....   he never got back to me and I again had to contact teletrac and open another ticket! The second man was no help again.I got no where and was still paying for a van that was off the road. I believe we have payed for 6 months worth of tracker that was sitting in an unused van ? I gave up with him in the end :( I then spoke to a woman who was much more helpful, however we didn’t get anywhere. I explained what had happen to which she apologised, and managed to cancel the tracker for us FINALY !!!! I also asked her to cancel another tracker, which she did!             ( these are for 90 day rolling trackers ) I then asked to see the original contract as I had just about had enough of the company and wanted to leave ASAP ! I found out that we were In a 5 year contract ?!?!? SERIOUSLY!!! I received the contract and it was signed in 2017... which meant one more year, I was so relieved! I was then told this was a MISTAKE ?!?! and they had made an error on the contract  ?!? They gave me a price to cancel the tracker with a £20 discount .... I just left the email conversation as I had had enough. I canceled our direct debit and emailed no more. For a company that we have been with since 2014 I am shocked at the service and lack of help! I would have thought with the times wasted  we have encountered, they would have honoured the cancelation of contract and apologised profusely! I am genuinely disgusted and wait to hear from them when they don’t receive their payment ( for unused trackers ) I am truly saddened that a world wide company only care about money and not their customers- especially loyal ones."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CORNENE SMITH",
          "Nb_Reviews": 1,
          "Date": "2019-08-20T19:24:18.000Z",
          "Titre": "bad navigation on website"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Allan",
          "Nb_Reviews": 1,
          "Date": "2015-04-23T11:39:50.000Z",
          "Titre": "not happy with the afterservice",
          "Contenu": "think the title says it all"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Wayne Green",
          "Nb_Reviews": 1,
          "Date": "2019-09-13T19:16:49.000Z",
          "Titre": "NOTHING TO SAY"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 7,
          "Date": "2023-04-26T17:21:02.000Z",
          "Titre": "much better than normal",
          "Contenu": "This was one of the first acceptable experiences that I had with Teletrac. Oscar was definitely the first good customer service rep. He was cordial, he listened, ultimately, he helped get the problem fixed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Broken Arrow",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T15:57:18.000Z",
          "Titre": "Very helpful"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-27T17:01:54.263Z",
          "Titre": "1062895",
          "Contenu": "Customer service( Ceaser F )  was good , quickTo troubleshoot and identify the problem and was able to fix within few mins. Seemed to be very knowledgeable"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Leticia Aguirre",
          "Nb_Reviews": 2,
          "Date": "2022-04-21T20:54:42.719Z",
          "Titre": "Struggled for +/- 6 months in obtaining…",
          "Contenu": "Struggled for +/- 6 months in obtaining upgrades, supervisor nor manager would return calls or emails."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sun Power Diesel",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T18:57:23.000Z",
          "Titre": "Reference number 1057201 Ceasar F",
          "Contenu": "Reference number 1057201 Ceasar FWas very helpful in a timely manner"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom H.",
          "Nb_Reviews": 4,
          "Date": "2020-06-08T15:40:18.000Z",
          "Titre": "New unit not working",
          "Contenu": "i have multiple tracking units. Just got a new truck had another installed. My problem is unit is not working. Install tech said it might need a day to upload. All  other trucks reported as soon as they were installed. Now i have to take van out of service and have them come back to troubleshoot. Also all other trucks have a hard mount for the Garmin unit this one they send window stick on. Lets see how they handle the issues i have."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 7,
          "Date": "2020-02-10T16:04:32.000Z",
          "Titre": "Teletrac Navman",
          "Contenu": "Teletrac Navman, overall, has been difficult and problematic. A lot of the assistance required due to system (software) and hardware problems has been quite poor. I generally don't get good service. This last problem, although it took a lot of time and more than one phone call, ultimately ended up at the desk of Lori. She was the best. She listened, paid attention, had all the information, and was the most helpful so far."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "HVAC IT",
          "Nb_Reviews": 1,
          "Date": "2020-09-11T15:38:05.000Z",
          "Titre": "Lacking",
          "Contenu": "Lacking Mario was helpful and did resolved the issue we were having on a vehicle, but was unwilling to actually resolve the issue on all of our vehicles and instead suggested that we call back in, wait on hold or try to contact him via his extension, every time we need to have the correction made on all 95 of our vehicles. We paid Teletrac for the cables and are doing the install our selves there is no reason why I should have to call to get them functional. I paid for them to be functional."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Allied Technical Services, Inc",
          "Nb_Reviews": 3,
          "Date": "2019-07-19T13:06:04.000Z",
          "Titre": "Well while the people I spoke to were…",
          "Contenu": "Well while the people I spoke to were friendly I was given incorrect information. The resolution took longer than what I thought it should and during the time I waited for the resolution no one contacted me to  let me know they were still working on it. Therefore I wasn't sure that the issue was going to be resolved at all. Finally I did get a call that the issue was fixed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bobby Strickland",
          "Nb_Reviews": 1,
          "Date": "2018-10-18T13:05:02.000Z",
          "Titre": "Installer with bad attitude",
          "Contenu": "Every thing was very smooth with tue exception of the attitude of the installer, he was visibly upset because he had to travel to the seperate locations of the vehicles, he kept shaking his head i told him i asked if they will be installed at the work locations and was told yes the installer said they just assume that he will. I at one point told him you dont need to install them at all i dont care!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JNM",
          "Nb_Reviews": 1,
          "Date": "2019-08-30T13:47:12.000Z",
          "Titre": "The company that came out on behalf of…",
          "Contenu": "The company that came out on behalf of Teletrac and serviced the Teletrac Navman did an excellent job and deserves 5 stars.Teletrac themselves could not troubleshoot nor solve the problems we were having until they decided through painful trail and error and significant delays (months) to replace all components...very frustrating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ryder",
          "Nb_Reviews": 2,
          "Date": "2018-09-19T17:48:00.000Z",
          "Titre": "Honesty Is Best Teletrac not duck & cover...",
          "Contenu": "Well their system crashed early on in the ELD Mandate left many many trucks w/o service and no answers. While they claim to have recovered from the crash the effects are still lingering around. Of course the 1st level support tells you everything is good but in reality it is not. Frequent tablet screen failures, wiring shorting out or burning up in some cases. Tout their NEW Tablet, which is a discontinued version of Garmin"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris Johnson",
          "Nb_Reviews": 3,
          "Date": "2021-03-17T07:58:09.000Z",
          "Titre": "3 STARS FOR TELETRAC BUT 5 STARS FOR CESAR.",
          "Contenu": "If you'd asked for my rating concerning the Teletrac Navman  Tech Support Representative that assisted me yesterday I'd give Cesar F.  5 BIG STARS. Super nice guy and very professional. As far as there product......well 3 stars is all I'll give them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kristi Ogaz",
          "Nb_Reviews": 1,
          "Date": "2018-01-25T17:28:39.000Z",
          "Titre": "It takes me way too long sometimes to …",
          "Contenu": "It takes me way too long sometimes to get a representative on the phone and after filing a claim, the technical rep never called back.  The tutorial for administrators should have a step by step guide on how to add drivers and what needs to be done first.  I had to call twice to find out why I was getting so many errors.  I finally got a rep on the phone today who fixed everything and was great!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bojan Radojicic",
          "Nb_Reviews": 4,
          "Date": "2019-09-19T20:42:17.000Z",
          "Titre": "Customer Support was helpful and…",
          "Contenu": "Customer Support was helpful and personable, however they did not verify equipment was working properly before closing the case.Originally called because the tablet kept show a thermal warning, the representative recommended a software update. However, after the update the ELD was not properly updating GOS location"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nick B",
          "Nb_Reviews": 2,
          "Date": "2018-08-31T03:36:49.000Z",
          "Titre": "I like the functionality of the system.",
          "Contenu": "I like the functionality of the system, the service has been difficult to get questions answered and for it to be properly configured. Scheduling the install with their 3rd party wasn’t very efficient. Waited over a week and never heard back from them, reached out to them again and was able to get scheduled. The actual installer did a fantastic job."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sunnie Delacruz",
          "Nb_Reviews": 1,
          "Date": "2019-11-21T19:56:51.000Z",
          "Titre": "one of the things i called about was…",
          "Contenu": "one of the things i called about was reports normally sent to me on a daily basis have stopped and these reports are necessary to do my job. the gentleman i spoke to created the report i needed and emailed it to me but was unable to figure out why im not receiving them anymore. im confused as to what he meant when he said \" the reason might be because you are in the process of being switched to director and its not finished switching you all the way\" what does that mean and why/who switched us?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Scott Norton",
          "Nb_Reviews": 2,
          "Date": "2019-05-06T13:10:54.000Z",
          "Titre": "Some issues with unit asking drivers if…",
          "Contenu": "Some issues with unit asking drivers if they would like to go on duty as they are driving down the road. Even though units are hard wire a lot of time the cable goes bad and needs to be replaced. Also would be nice to have an East cost help desk calling early in morning and getting Mexico is sometimes hard to understand."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Toni Harper",
          "Nb_Reviews": 1,
          "Date": "2017-11-06T17:44:25.000Z",
          "Titre": "I'm a new user and have had a lot of …",
          "Contenu": "I'm a new user and have had a lot of technical issues with you guys so far.  NOT A HAPPY CAMPER!!  But out of all the times I've called, Sam seems to have been able to help me the most.  He seems like he has more knowledge of the ELDs system than most.  He was able to \"logically\" troubleshoot the driver issues with me."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Rich",
          "Nb_Reviews": 1,
          "Date": "2019-11-18T17:28:35.000Z",
          "Titre": "Service currently received over the…",
          "Contenu": "Service currently received over the passed couple of weeks being offered by others at Teletrac has been somewhat below par hence the 3 stars, however the agent that has resolved our issues I would give 5 stars to if I could on here. Hopefully all has been resolved now and we can move on."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CES",
          "Nb_Reviews": 1,
          "Date": "2014-02-27T20:02:45.000Z",
          "Titre": "Our Rep, Sue Natali did a great job trying to match the features to our needs",
          "Contenu": "Our sales rep Sue Natali did everything in her power to work with us to get the system that would best fit our needs. She went above what would be expected from a sales rep to make sure the system worked to our benefit. We had several issues with Teletrac service center and the contract company that Teletrac used to install the equipment in our trucks. This resulted in us dropping some features of the program."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Darold McKinley",
          "Nb_Reviews": 1,
          "Date": "2019-07-31T12:20:29.000Z",
          "Titre": "The person I talked with was not that…",
          "Contenu": "The person I talked with was not that familiar with the system and had to ask for help.  He was able to figure out the remedy, but after hanging up I found that the system was not working properly to get the information I needed.  I called back and the second guy seemed like he just want to get off the phone and give me a case number.  I had to get him to stop and listen very good to the problem I was having.  He finally was able to duplicate the problem (once again not know the system very well) and said he would call back with a solution."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nancy Henry",
          "Nb_Reviews": 4,
          "Date": "2019-11-21T14:50:22.000Z",
          "Titre": "Today hopefully my two cases are being…",
          "Contenu": "Today hopefully my two cases are being addressed and replacement parts are coming.  Previously reported back on Sept. 23 and have gone back and forth with customer support with nothing being solved.Also they leave messages trying to reach me after hours on the east coast.  I am not in the office 24/7 and advise them of that with no response.Today I spoke with Gabriel in support and he completed the cases by requesting parts be sent so I can have these units working.  In the future it would be helpful if they do not close cases without issues being resolved."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Terry Hill",
          "Nb_Reviews": 1,
          "Date": "2019-02-19T12:38:17.000Z",
          "Titre": "Very difficult to speak to the right person",
          "Contenu": "Very difficult to speak to the right person, have not spoken to the account manager at all only through E Mails with no reply's.Only assistance received was from Lauren Baker - Hawes, Sales Executive Team Leader who was very good and also Amelia in Customer Support Tier 2"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bill Neimond",
          "Nb_Reviews": 1,
          "Date": "2018-10-01T11:41:49.000Z",
          "Titre": "The installers do a good job but the…",
          "Contenu": "The installers do a good job but the communication between them and the tech support team lacks. It doesn't seem to be a thorough process.  Our unit was installed but not configured properly when the tech left.  It has taken more phone calls to get the job completed correctly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alan Schmidt",
          "Nb_Reviews": 1,
          "Date": "2019-08-02T10:57:33.000Z",
          "Titre": "Took several days to reconnect with…",
          "Contenu": "Took several days to reconnect with agent at the time vehicle was available, part my fault on second day then just hard after that for timing. Agent was able to repair system without vehicle being on site and I was able to check operation the following day."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "E. Savre",
          "Nb_Reviews": 1,
          "Date": "2014-02-27T17:15:11.000Z",
          "Titre": "On the Fence",
          "Contenu": "It has been nearly two months since initial installation and we are still not able to take advantage of the full functionality that we were expecting.  The Teletrac team appears to be actively trying to fix all the bugs.  Service has been good, but the implementation has been painfully slow."
        },
        {
          "Note": 3,
          "Lieu": "DZ",
          "Pseudo": "Lars Nelson",
          "Nb_Reviews": 1,
          "Date": "2016-12-09T15:03:09.000Z",
          "Titre": "Easy to use but yet basic functions",
          "Contenu": "We had to use their services (for old version last 4 years) we had been impressioned by their uptime, but when looking elsewhere we find teletrac a lot outdated comparing to other companies solutions.do we need to get back to theme to try the new solution ??? i think no"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Moti Galil",
          "Nb_Reviews": 1,
          "Date": "2015-03-27T17:01:27.000Z",
          "Titre": "Could be better, I expected more",
          "Contenu": "I can't get a report of where the vehicle was at a specific time.  What I get is that the vehicle was NEAR one of my points.  A driver could be near a point for 20 minutes while he/she actually drove the whole time.  There is too much guessing on my part when I need this info."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Phil Heckman",
          "Nb_Reviews": 3,
          "Date": "2019-10-01T17:04:31.000Z",
          "Titre": "Frustrating",
          "Contenu": "This was a very frustration process for this issue. It required more phone calls than typical. The case number changed many times. My hold time on the phone was also more than normal after the call was answered. Different associated seemed to be running the same reports and telling me to try the same problem resolution steps. I recognize when the trouble is beyond some of the typical issues. There seemed to be a rush to close the case when the unit functioned for short periods of time. There seemed to be some trying to convince me the unit was operating normally when the driver activity was not posting correctly. Glad it is done at this point."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Jody",
          "Nb_Reviews": 1,
          "Date": "2015-05-06T07:06:55.000Z",
          "Titre": "Happy with the product, experienced installation issues..",
          "Contenu": "The M800 unit itself is a very handy tool with useful features. However we have experienced a few hurdles working with JRH around arranging installation dates, we were originally advised our hauliers would be contacted directly which didn't happen. Myself and Duncan worked together with Suzanne to arrange all installation dates. On the whole the process did pick up speed but we did have a couple of appointments which were missed due to the engineers partner being taken poorly (no communication received) Suzanne has been very accommodating when we needed to amend location of appointments etc."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kenneth Hyslop",
          "Nb_Reviews": 1,
          "Date": "2018-01-13T17:43:06.000Z",
          "Titre": "The video tutorials are not thorough",
          "Contenu": "The video tutorials are not thorough and customer service is hard to get at this time because of explosive call volumes due to companies last minute implementation. But once you reach customer service they're are helpful enough."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jesus Ayala",
          "Nb_Reviews": 4,
          "Date": "2020-07-09T20:51:28.000Z",
          "Titre": "We have been encountering several…",
          "Contenu": "We have been encountering several issues with GPS units not reporting properly.Most of these have been resolved in a timely matter but it is still causing problems with my overall Navman reports."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maggie",
          "Nb_Reviews": 1,
          "Date": "2018-11-20T12:21:14.000Z",
          "Titre": "The tool itself is great",
          "Contenu": "The tool itself is great. It is easy to use and the pricing is average. Customer service is not great. If there is an issue with a unit or bill you must call several times before your issue is resolved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vicki Buzzell",
          "Nb_Reviews": 1,
          "Date": "2019-10-09T20:11:54.000Z",
          "Titre": "Very disappointed that the wrong piece…",
          "Contenu": "Very disappointed that the wrong piece was sent.  Last year this had happen a couple times, I hope that is a sign of what is going to happen this time.  JAY with the INSTALL COMPANY is awesome!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Scott Arndt",
          "Nb_Reviews": 3,
          "Date": "2019-08-28T16:16:02.000Z",
          "Titre": "This experience was improved ,But as Paul Harvey would say now for the rest of the story !",
          "Contenu": "My experience we fairly smooth this time. But since I have to call on a  daily  basis about the same problem it has become very frustrating. At this time I would not recommend Teletrac Navman ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dan Reichert",
          "Nb_Reviews": 1,
          "Date": "2020-01-15T22:32:14.000Z",
          "Titre": "We have be conflicted with problems…",
          "Contenu": "We have be conflicted with problems since we tried to switch to the ELD system. However our account rep Lori has been doing a great job  in trying to solve the problems."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kayla R.",
          "Nb_Reviews": 1,
          "Date": "2019-08-27T19:47:08.000Z",
          "Titre": "Fine but not great.",
          "Contenu": "The GPS system works fine, but the customer service is lacking. I have spent time and money bringing in trucks for diagnostic for repairs, not to mention my own time on the phone and did not receive calls when promised. At the end of the whole ordeal I was told that the entire fleet needed to be sent updated software but that wasn't the department of the person I was speaking to so I would have to call in if my fleet experienced issues. I had to press them to update our entire fleet's software. Why is that? Shouldn't software be updated automatically if needed? Or if they see that 4 trucks aren't working properly shouldn't they opt to update the whole fleet? Very annoying and lacking in customer service. One tech named Mario actually called me back and helped with my issue to that is why there is even 3 stars here."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "sara",
          "Nb_Reviews": 1,
          "Date": "2014-02-24T22:54:59.000Z",
          "Titre": "Out standing company.",
          "Contenu": "We just recommend Teletrac GPS system. We like that we can see where our drivers are located at all times. Over all it is an excellent program and would recommend it to any company."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason Gray",
          "Nb_Reviews": 1,
          "Date": "2019-07-23T13:08:07.000Z",
          "Titre": "Been having a lot of issues lately",
          "Contenu": "Been having a lot of issues lately, no hos, miles not  being reported for ifta, still waiting for new device delivery. Everything seems to be taking longer to get done."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Justin Lewis",
          "Nb_Reviews": 1,
          "Date": "2019-09-11T19:46:27.000Z",
          "Titre": "IN THE PAST CUSTOMER SERVICE HAS BEEN…",
          "Contenu": "IN THE PAST CUSTOMER SERVICE HAS BEEN TERRIBLE, JUST IN THE LAST COUPLE OF MONTHS HAS IT IMPROVED TO WHEE WE GET OUR PHONE CALLS AND EMAILS ANSWERED AND GET SOME HELP"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew Beckford",
          "Nb_Reviews": 1,
          "Date": "2018-01-09T13:52:00.000Z",
          "Titre": "the ticket was opened over 2 weeks ago …",
          "Contenu": "the ticket was opened over 2 weeks ago and I have yet to receive a call. I had to call in to the support team this morning . the agent that assigned me was great today"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jennifer Unger",
          "Nb_Reviews": 1,
          "Date": "2020-02-19T14:50:57.000Z",
          "Titre": "Billed for more than contracted amount",
          "Contenu": "Adding the new unit was easy however, we are getting over billed per the contract amount and I can't get anyone to return my emails regarding this issue."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "keith riggs",
          "Nb_Reviews": 1,
          "Date": "2014-02-06T21:11:03.000Z",
          "Titre": "flint store kriggs road runner store",
          "Contenu": "I like using it because it show me where my drivers are located or truck at any time\rday or night tell me it the truck is in my yard just sitting and running or moving"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jack Miles",
          "Nb_Reviews": 1,
          "Date": "2020-03-16T13:40:21.000Z",
          "Titre": "Issues in process but did fix issues we were having.",
          "Contenu": "Issues with getting connected to correct personal when calling in. Over all they did fixed the issues we were having but did take longer than expected."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sherry Wheeler",
          "Nb_Reviews": 1,
          "Date": "2014-02-11T21:10:06.000Z",
          "Titre": "When it works, it works well.",
          "Contenu": "We have used Teletrac for several years, and when it works properly, it works well.  We are able to locate our trucks & assist them in finding job sites."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karla",
          "Nb_Reviews": 7,
          "Date": "2020-01-24T13:29:24.000Z",
          "Titre": "Tier 1",
          "Contenu": "Tier 1, Tech Support is a crap shoot.  Joel does a good job.  He knows what he is doing and doesn't try to mislead you just to close cases."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Yehezkel Yosef",
          "Nb_Reviews": 1,
          "Date": "2017-10-25T14:24:19.000Z",
          "Titre": "Giving another chance...",
          "Contenu": "Before signing in a contract, the company was very attentive and responsive. Upon signing, we had to wait for the equipment for 2 weeks. Out of the 13 units, 2 were wrong and I had to ship back. It has been 6 weeks and countless phone calls and we are still waiting for those units. I am blind to the where about of my trucks. What if the ELD law was in effect? My trucks would have been down this whole time? What if your phone would brake and 6 weeks later your carrier wouldn't be able to provide you with a replacement? Update:I managed to reach several people in managerial position. It look like they solve this problem in a matter of a day. In all honesty, all the people in this company I spoke with striked me as good, intelligent and caring about their brand. I don't know where was the break in communication, and I believe it is not acceptable. I also know most people are only taking the time to write review when they are upset and not when all is going smoothly. I hope this will get better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tim Enlow",
          "Nb_Reviews": 1,
          "Date": "2019-09-05T15:01:41.000Z",
          "Titre": "since changing to a E-log from your…",
          "Contenu": "since changing to a E-log from your onboard there has been deafferents from one driver's log to another driver's logs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ladona Chancellor",
          "Nb_Reviews": 1,
          "Date": "2018-04-03T19:08:05.000Z",
          "Titre": "The wait times are extremely long",
          "Contenu": "The wait times are extremely long, this was actually helpful and the person i spoke with was very professional"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-21T22:53:40.000Z",
          "Titre": "Ordered parts and waited for them to…",
          "Contenu": "Ordered parts and waited for them to come in. They arrived today in 3 days, no issues."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cynthia Nell",
          "Nb_Reviews": 1,
          "Date": "2019-12-23T19:45:58.000Z",
          "Titre": "Unit 96 went down before Thanksgiving",
          "Contenu": "Unit 96 went down before Thanksgiving, the replacement unit came in today the 23 of Dec."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Janine Haertter",
          "Nb_Reviews": 3,
          "Date": "2019-12-04T14:42:11.000Z",
          "Titre": "updated to ELD and had the call into…",
          "Contenu": "updated to ELD and had to the call into call center for Teletrac to transfer it the ELD."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bryan Thompson",
          "Nb_Reviews": 1,
          "Date": "2019-12-05T20:14:20.000Z",
          "Titre": "Service was good but the hold time was…",
          "Contenu": "Service was good but the hold time was bad. Waited 15 mins for someone to pick up."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Miguel Munoz",
          "Nb_Reviews": 4,
          "Date": "2019-11-05T18:13:50.000Z",
          "Titre": "Great salesmen",
          "Contenu": "Teletrac Navman uses some of the latest technology out there on ELD's."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-23T19:18:19.000Z",
          "Titre": "Help was excellent",
          "Contenu": "Help was excellent.  Wait time for getting help was terrible."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 2,
          "Date": "2019-07-17T19:32:44.000Z",
          "Titre": "very difficult to get ahold of customer…",
          "Contenu": "very difficult to get ahold of customer service and technical suppport"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "erika paine",
          "Nb_Reviews": 1,
          "Date": "2017-04-14T13:41:37.000Z",
          "Titre": "Poor Service",
          "Contenu": "We signed up with Teletrac 3 years ago.  Since 2014 we have had an issue with online reports.  Come to find out that there is a \"work around\" hmm.  You would think that the technical team would know this.  Instead, I would get an email from the technical team once in a while telling me that they were \"still working on it but had no resolution.\"  Frustrated with the poor service and needing a better system I shopped around.NOTE : After the initial 3 year contract Teletrac renews!  You need to be careful to cancel before that happens.  Not what the sales person told me but hey it's in the small print, right!  I attempted to cancel my account before the actual renewal date (not within their time though) because there are cheaper, friendlier programs out there, that are much easier to use with exceedingly better service.  The would not cancel my account since I had not contacted them 90 days prior.  Sent 4 emails and left messages with several different people early in January.  It took them more than a week to return my emails and calls.  If you are a small business like me, do not hire these people   They are only interested in your money, not in providing you with good service.  I will wait until my term expires and cancel.  Don't get caught like I did!Update 04/14/17:After this review, they did cancel my account yay!  I have been pleased with the service I got from their retention department.  So for that reason I'm changing my 2 star rating to 3."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric Schambach",
          "Nb_Reviews": 1,
          "Date": "2020-01-24T21:18:55.000Z",
          "Titre": "I'm not very happy with teletrac…",
          "Contenu": "I'm not very happy with teletrac navman, but Joe was helpful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Micheal Summers",
          "Nb_Reviews": 2,
          "Date": "2019-08-16T00:03:18.000Z",
          "Titre": "The customer service has improved but…",
          "Contenu": "The customer service has improved but still can be much better!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alejandra Calderon",
          "Nb_Reviews": 1,
          "Date": "2019-07-24T16:13:30.000Z",
          "Titre": "Problem was not solved",
          "Contenu": "Problem was not solved. We still can't pull up any reports."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Powersports NW",
          "Nb_Reviews": 1,
          "Date": "2018-10-12T17:13:07.000Z",
          "Titre": "acceptable experience but with some…",
          "Contenu": "acceptable experience but with some difficulties along the way."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Phil Heckman",
          "Nb_Reviews": 3,
          "Date": "2019-11-25T18:44:18.000Z",
          "Titre": "No communication on update",
          "Contenu": "No communication on update, no idea what was being updated"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mac Minton",
          "Nb_Reviews": 1,
          "Date": "2019-09-27T01:03:51.000Z",
          "Titre": "Still learning the system but so far so…",
          "Contenu": "Still learning the system but so far so good!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Terry Mills",
          "Nb_Reviews": 2,
          "Date": "2019-10-06T02:28:59.000Z",
          "Titre": "Sales0",
          "Contenu": "Not getting return phone calls from people."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Manuel Desouza",
          "Nb_Reviews": 1,
          "Date": "2020-01-14T22:55:16.000Z",
          "Titre": "Still needs work the ELD that is!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Parker",
          "Nb_Reviews": 2,
          "Date": "2019-12-19T17:19:30.000Z",
          "Titre": "Took to long to get system updated"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Parker",
          "Nb_Reviews": 2,
          "Date": "2018-09-28T17:13:00.000Z",
          "Titre": "Telectrac not working correctly"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cindy Peer",
          "Nb_Reviews": 1,
          "Date": "2016-10-19T15:19:13.000Z",
          "Titre": "SYSTEM FAILED TO WORK NOW BEING SUED FOR $3000.00",
          "Contenu": "We had three tablets installed on 9/3/2015. On 9/15/16 I sent an email to Norman informing him the system does NOT perform as promised. The “salesman” was well aware of the prior system we had been using (Nextraq) and he stated TeleTrac would do the same thing for less money each month. The TeleTrac system does NOT provide the same service. Norman replied saying he would send this matter to the “implementation team”.  I called Norman numerous times thereafter to ask about the software being adapted so the system would perform as promised by TeleTrac’s agent.  I finally received a telephone call the beginning of 2016 from the software development department informing me they could not write a program that would fulfill my needs as set forth in my 9/15/15 email to Norman – they breached of the lease. On 11/20/15 I sent an email stating two of the tablets had quit working. I received an email 11/23/15 stating the firmware would be updated. This did not work so new tablets were sent out and received on 12/3/15. On 12/4/15 I sent an email informing TeleTrac that the tablets still did not work and requested the contract be canceled due to non-performance and a credit for the months we hadn’t been able to use the system but had paid anyway.  Jan agreed to credit our account which was never done. On 12/9/15 we received replacement chargers but these didn’t work either.  I sent another email on 12/17/15 once again asking for a credit as that was never done.  Finally, on 2/12/16 I sent another email saying the one tablet was once again not working (the other one never worked). My small, family owned plumbing company has paid a total of $698.05 for one tablet that worked for maybe four months (the other tablet NEVER worked) with no credit given.  TeleTrac’s Subscriber Agreement sets forth we are being charged for use of their “data, software and added value options”. We have NOT used any of TeleTrac’s software since February 2016 and we will not pay for something we are not and cannot use.  I believe the $698.05 is overpayment for a system that didn’t work and the software was misrepresented to me as it did not fulfill our needs. Now Teletrac is threatening to sue my business (I'm a woman) that I own with my son for $3,000.00!!UPDATE: This review prompted Teletrac Navman to contact me. They zeroed out our account and even refunded the company all of the money we had been charged. He explained they had hired new management to work out the issues with the hardware and system and apologized for everything we had gone through."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David T.",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T18:34:27.000Z",
          "Titre": "Cesar addressed the issue quickly",
          "Contenu": "Cesar was able to address the issue quickly, but it is the same issue that appeared two months ago; the organization may want to look into the root cause."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rene Rocha",
          "Nb_Reviews": 2,
          "Date": "2022-08-29T20:24:04.000Z",
          "Titre": "False U-Turn",
          "Contenu": "Video had been created showing a U-Turn when it was only a sharp curve in the road, this was a False Positive. Teletrac was able to set up a Geo Fence to keep the system from producing another event. I would like to have the ability to create my own Geo fence to have better controls, the reason for 4 star."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BORG COMPREESED STEEL",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T17:33:24.000Z",
          "Titre": "THE NEW SETUP WITH CHECKING ON CUSTOMER…",
          "Contenu": "THE NEW SETUP WITH CHECKING ON CUSTOMER AND DOUBLE CHECKING ABOUT APPOINTMENT IS GREAT. STILL NEED HELP IN THE BEING ABLE TO TALK WITH YOUR ACCOUNT REP TO FIND OUT INFORMATION"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T19:14:03.000Z",
          "Titre": "Cesar F is great",
          "Contenu": "Cesar F is great! Very helpful and patient! I do have issue with the Teletrac Navman as a whole. They lack the organizational skills to make the process from purchasing to using seamless. They need to work on assigning a representative to walk customers from the purchase to installation to onboarding then training."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T19:20:59.000Z",
          "Titre": "I became an admin!",
          "Contenu": "I needed to become an admin, not just a driver. I called in the morning to set it up, but I was missing some features. I called again in the afternoon and was able to get the problem fixed. I needed a whole new account, but it seems to be working fine now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-22T17:02:36.000Z",
          "Titre": "Jose was very helpful getting one of…",
          "Contenu": "Jose was very helpful getting one of our trucks to show back up the administrative side after upgrade to 4G took place"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Timothy Wendler Texas Material",
          "Nb_Reviews": 2,
          "Date": "2022-10-20T23:40:58.000Z",
          "Titre": "We did all we can do",
          "Contenu": "We did all we can do. It is a software problem on the back end. I been doing this for 8 years. Platinum was helpful. Navman is working on a fix."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T06:37:33.000Z",
          "Titre": "Service Rep was very helpful",
          "Contenu": "Cesar was very helpful, and I appreciated him calling back to confirm our unit was up and running."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "FSM America for Global applian",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T21:06:38.000Z",
          "Titre": "Be able to solve my problems",
          "Contenu": "Be able to solve my problems. The quick follow and customer service. Cesar did a great job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-27T15:19:17.396Z",
          "Titre": "Support was very helpful",
          "Contenu": "Support was very helpful, just wish it didn't take 5 days for them to call.  But once they did, we got unit up and running."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janine with Equipment Depot",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T17:48:36.000Z",
          "Titre": "We are on our 4th GPS but the team has…",
          "Contenu": "We are on our 4th GPS but the team has been quick to try & fix our problem. Hopefully this last one was the charm."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-25T00:06:24.000Z",
          "Titre": "Had to be on hold for a few",
          "Contenu": "Had to be on hold for a few.  Than got a guy said wasn’t the right number. But he transferred me to someone that helped me the number we had it is fixed now"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-04T21:32:38.000Z",
          "Titre": "The service desk works hard to make…",
          "Contenu": "The service desk works hard to make everything right for the customer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-12T18:21:26.000Z",
          "Titre": "Bus driver for Holiday motor coach new…",
          "Contenu": "Bus driver for Holiday motor coach new device was installed on11-10-21. On 11-11 still not working I called it in and agent tracked it while I was still driving and got it working. Then called me back when he noticed I was off duty. Thanks for the help. I just talked with Jose and still having a issue with engine dionostics being in the red and communicating"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Towne",
          "Nb_Reviews": 3,
          "Date": "2021-11-08T13:40:57.000Z",
          "Titre": "Teletrac has worked good for us for the…",
          "Contenu": "Teletrac has worked good for us for the most part. The customer service people has always been curtius when we have issues with the products and programs.I believe that the staff could be a bit more knolledgable about some issues such as drivers log issues and being more informative to the drivers when a log issue accures."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-14T20:38:52.000Z",
          "Titre": "The technicians I deal with registering…",
          "Contenu": "The technicians I deal with registering new devices are great,the quality of the cables in the kits we receive to install is poor at best.I cannot figure why your company cannot make these units work out of the box with no modifications!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tammy Voorheis",
          "Nb_Reviews": 1,
          "Date": "2020-11-18T20:11:28.000Z",
          "Titre": "I had two requests in for assistance at…",
          "Contenu": "I had two requests in for assistance at the same time and was very pleased my call was taken right away and my question answered in one call.  Customer Service has improved drastically since last year.  My second request is still pending but is being addressed and I have been kept in the loop.  Keep up the good work, you have no idea how much it is appreciated!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karla",
          "Nb_Reviews": 7,
          "Date": "2020-05-14T13:55:14.000Z",
          "Titre": "Mario was very helpful today",
          "Contenu": "Mario was very helpful today.  I had very little information on the original malfunction with the tablet.  He did all the research and let me know what the driver had called on in April. We had just gotten the truck back from the shop and I had misplaced my notes from the original calls. He then went through all the checks on the system and made sure that it was operating correctly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dina Thompson",
          "Nb_Reviews": 3,
          "Date": "2020-02-12T20:53:42.000Z",
          "Titre": "I would suggest a more customer…",
          "Contenu": "I would suggest a more customer centered approach to Customer service that gives specific group of agents that would handle the calls from a limited group of customers.  So that you would get to know the customers and their specific needs and not so many handlers that are not as familiar. Perhaps it would be less confusing with so many Case #'s. However, I do get problems resolved most of the time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna Gilbert",
          "Nb_Reviews": 5,
          "Date": "2019-12-16T19:51:22.000Z",
          "Titre": "Work Around for Co-Driver 30 min Break on Federal",
          "Contenu": "There is a work around for the issue I reported about the 30 min break for co drivers, but in my opinion, the company should have thought about the issue before instituting the programming.  Perhaps they will have a fix that will be in an upgrade in the future.  The associate was able to answer my question, and gave me the work around that I had asked the drivers to complete already."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Iain Little",
          "Nb_Reviews": 6,
          "Date": "2019-10-09T10:45:10.000Z",
          "Titre": "Customer Success Team",
          "Contenu": "I have now worked with Alexandra for the past year and found her to be very efficient  and professional in her work and customer service. On occasions she can become very frustrated by the internal teams failure to understand what the customer requires as was evident with the recent install programme but once alexandra got involved the issue was sorted to our satisfaction."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "daisy holman",
          "Nb_Reviews": 4,
          "Date": "2019-09-09T08:43:34.000Z",
          "Titre": "Navman were being used by the company I…",
          "Contenu": "Navman were being used by the company I work for long before I joined and since working with them I can see why! They have proven to be reliable, professional and have regularly helped where they can to achieve fleet compliance. Alexandra Mooney is our Customer Success Specialist and is always happy to help with any queries and issues that we have faced. Fab all round!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Gordon",
          "Nb_Reviews": 6,
          "Date": "2019-09-04T16:01:02.000Z",
          "Titre": "My current experience with Teletrac…",
          "Contenu": "My current experience with Teletrac Navman, in particular Ben, was a breath if fresh air compared to my numerous experiences with Teletrac. Ben was very attentive to our current situation and was also very helpful in recognising my previous frustrations in dealing with Teletrac.Ben has certainly eased any trepidation I may have in dealing with Teletrac in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Tijerina",
          "Nb_Reviews": 2,
          "Date": "2021-04-28T17:56:42.000Z",
          "Titre": "Working with CS Reps.",
          "Contenu": "I have been working with several of your CS Reps, 50% of your Reps are very good and helpful, the other half will hang up on you, if they can don't know how to fix or we will hear your problem is a quick fix to tell us or the drivers to go to paper logs with out checking what is wrong and maybe able to fix it. another problem is that some of my driver ask to be talk to in Spanish yet the CS reps talk to them in English and the drivers gets upset and hangs up the phone, I've been in several calls with this problem and the CS Reps don't give there name."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Rosichan",
          "Nb_Reviews": 2,
          "Date": "2020-01-16T17:55:28.000Z",
          "Titre": "Over the last 2 years we've had…",
          "Contenu": "Over the last 2 years we've had Teletrac Navman I've had to call customer support on numerous occasions.  On this occasion, the technician was quite knowledgeable and helpful and, not only did he solve the issues I was having, he went above and beyond to provide me with some tools to help what I was trying to do."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Renee Ruiz",
          "Nb_Reviews": 2,
          "Date": "2019-12-18T14:12:50.000Z",
          "Titre": "Our issue was addressed and handled to…",
          "Contenu": "Our issue was addressed and handled to our satisfaction, however we are not clear on how the issued happened and don't have a clear answer.  Also, at first the gentleman who helped me got defensive and I then let him speak with Peter, who is the person who implemented the system and then things were handled much better."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Serjio Castrellon",
          "Nb_Reviews": 2,
          "Date": "2021-03-17T21:26:37.000Z",
          "Titre": "Thank you",
          "Contenu": "Their customer service is personally the best I've seen from any company. They are helpful and extremely patient with the needs demanded from our fleet units. While their product has reoccurring issues they always ready to work with us to correct any technical errors."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rich Roda",
          "Nb_Reviews": 2,
          "Date": "2020-02-11T21:58:39.000Z",
          "Titre": "Very good troubleshooting",
          "Contenu": "Overall I have great experiences with Teletrac. Most agents are very thorough and cordial. They seem to know that, as a Ryder employee, I have little time to spend on the phone and they take care of issues promptly! Those few times where there was more troubleshooting needed, theres no hesitation to stay and help!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Larkrith",
          "Nb_Reviews": 1,
          "Date": "2019-12-06T19:07:44.000Z",
          "Titre": "Vehicle Nuber Needed In Teletrac Navman",
          "Contenu": "I needed help with placing a Number of the Vehicle in Teletrac Navman.  The Customer Service Rep was very helpful showing me how to complete my task.  It was a little concerning for me because the Customer Service Rep was a bit hard to understand do to the accent however after a bit back and forth everything worked out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ivo Araujo",
          "Nb_Reviews": 2,
          "Date": "2019-08-23T17:51:44.000Z",
          "Titre": "Good Service",
          "Contenu": "We had an issue with a vehicle not able to log in the driver.Customer support tried to resolve the issue but were unable to and transferred me to a Tier 2 person. This person was able to help me in less than 5 minutes.Would only suggest that initial customer support would have transferred me earlier in the week.Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "April Adams",
          "Nb_Reviews": 1,
          "Date": "2020-04-01T16:12:54.000Z",
          "Titre": "I appreciate the technicians candor…",
          "Contenu": "I appreciate the technicians candor while he was on site.  However, he took quite a long time to repair what he called \"simple\" issues.  He stated that the units were swapped and not installed properly.  However, all trucks were installed the same way, by the same individual, and only 4 out of 13 trucks had issues.  He was able to get them fixed.  I received no paperwork on this while the technician was on site.  I would really like a full understanding of what happened if I am being billed for this repair."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David King",
          "Nb_Reviews": 1,
          "Date": "2019-08-13T20:11:24.000Z",
          "Titre": "We have been using Teletrac for several…",
          "Contenu": "We have been using Teletrac for several years now. Initially they had some issues with getting support on downed devices but have really started turning things around. They were able to help me relatively quickly and was able to get the case resolved. BIG turn around for the company in terms of support and assistance."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "cderoo",
          "Nb_Reviews": 1,
          "Date": "2021-03-17T19:05:22.000Z",
          "Titre": "At one time we were at the point of…",
          "Contenu": "At one time we were at the point of researching other ELD providers because of Teletrac's poor technical assistance and hardware problems. That has improved immensely and we have recently added solar trackers to our fleet. Please keep working on your customer support. It has greatly improved and we thank you for that. Look forward to increasing our fleet and partnership with Teletrac. I just had a good experience with Cesar Franco. He gave me excellent response, fixed my problem, even called me back when the connection went bad. Give him some recognition for great service. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debra Berth",
          "Nb_Reviews": 1,
          "Date": "2019-12-11T18:48:41.000Z",
          "Titre": "Mario rocks",
          "Contenu": "Mario rocks, always room for improvement but you can't get much better.  He is always helpful, polite and goes above and beyond. I have worked with him several times and look forward to get his service in the future.  He needs a raise or promoted. He would be a good canidate to train others."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Teresa Sanchez Y.",
          "Nb_Reviews": 11,
          "Date": "2019-08-06T17:42:05.000Z",
          "Titre": "No connection to VLU-solved",
          "Contenu": "No connection to VLU-solvedGabriel had knowledge on what he was doing and put us back on the road. One of our drivers complain about no connection with VLU so Gabriel solved the situation very well and we learned for future similar troubles how to request assistance: TBTprofileThank you,Tere Sanchez"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pat Sanders",
          "Nb_Reviews": 3,
          "Date": "2021-03-31T18:47:42.000Z",
          "Titre": "Speaking with a customer support team…",
          "Contenu": "Speaking with a customer support team member helped me find exactly what I was looking for. The only reason not to give 5 stars is the long hold time when calling customer support. We are always put on hold and must wait 30 - 60 minutes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa Fellows",
          "Nb_Reviews": 1,
          "Date": "2020-01-17T19:23:25.000Z",
          "Titre": "the tech was efficient but disappointed…",
          "Contenu": "the tech was efficient but disappointed with Teletrac for not contacting us to let us know of the problem with the update that had our trucks not communicating.  There should have been some notification to us not waiting for us to contact you to get things resolved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fred Estrada",
          "Nb_Reviews": 3,
          "Date": "2019-10-03T15:00:31.000Z",
          "Titre": "We have been having a lot of issues…",
          "Contenu": "We have been having a lot of issues with the Teletrac systems and the basic level of tech support did not meet my needs at all and after several calls and emails to the sales representative the advance tech support department got involved and was able correct all the issues. Basic tech support has to better trained there phone system has to upgraded(always a bad connection and back round noise during the call) and same day response as supposed to days later is a must. As I have said before the product is great when its working but when its not best to have excellent support!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin Wood",
          "Nb_Reviews": 1,
          "Date": "2019-12-10T19:35:26.000Z",
          "Titre": "Customer support today was very good",
          "Contenu": "Customer support today was very good, the reason for 4 stars is the fact that I was sent updated devices to put in our trucks that would not work properly. After a quick phone call to Teletrac I was informed we needed to preform an update on the updated devices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ben Newman",
          "Nb_Reviews": 2,
          "Date": "2019-07-30T17:36:50.000Z",
          "Titre": "The person who was helping me with my…",
          "Contenu": "The person who was helping me with my problem was professional and patient, working through each troubleshooting point until the problem was diagnosed. I wish I didn't have to be on the phone for an hour, but I don't think it could have been helped either."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shelly",
          "Nb_Reviews": 4,
          "Date": "2022-04-13T19:43:46.000Z",
          "Titre": "1052025",
          "Contenu": "1052025. keep watch on this to make sure it was tracking. So far so good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Missy Wells",
          "Nb_Reviews": 2,
          "Date": "2020-08-28T14:50:17.000Z",
          "Titre": "Hardware sent overnight",
          "Contenu": "Hardware sent overnight, perfect!Install sub contractors are delayed 4-5 days for install.I know Covid has played a part in this, but it always seems there is a delay in install.  Wish there wasn't.SubContractors do excellent work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-28T18:06:14.000Z",
          "Titre": "Your support department needs help overall…",
          "Contenu": "The gentleman I spoke to when I called tech support was able to help me. He seemed professional and curteous. However, I could only hear every other word. His phone continued cutting out the entire call. Not sure what the phone issue was. He took care of me though, after your support team yesterday messed up our vehicle reporting and I couldn't get a prompt reply back from my emails this morning I finally got fed up and I had no choice but to call tech support, which I hate having to do. We have not had good experiences lately with teletrac customer service with the exception of a few people who I have mentioned in reviews. This gentleman today was good, he was helpful, but needs to get better phone reception."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff Belkins",
          "Nb_Reviews": 2,
          "Date": "2019-09-06T15:48:49.000Z",
          "Titre": "I don't understand why we had this problem",
          "Contenu": "I don't understand why we had this issue. Service center switched from HOS to ELD on the Elog. Called us and asked us to add new profiles for 2 drivers, we did that.The fix should not have involved us at all, the Service center did not make the call to you to get this done behind the scenes. It should be a transparent endeavor.  Before Ryder does something like this they need to make sure the Service people know what to do AND Ryder needs to get 2nd shift support to Ryder Hartford for ELD issues after 1st shift.  IT guys and problem solvers after I spent over an hour on this with them were Great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alan Ramsay",
          "Nb_Reviews": 3,
          "Date": "2019-09-26T18:14:35.000Z",
          "Titre": "Setting up new vehicles",
          "Contenu": "The agent I dealt with, (Josh), was very helpful.  I needed assistance setting up two new vehicles on the account, Josh completed the work in minutes and took the time to make sure I was able to view the new records on my side. Much appreciated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susan Pratt",
          "Nb_Reviews": 1,
          "Date": "2019-12-24T12:07:49.000Z",
          "Titre": "The functionality of ‘Director’…",
          "Contenu": "The functionality of ‘Director’ software is great. The system is easy to use and the reports available are extensive. We have a large fleet so having the support of the Services Specialist and Installation Team has made the transition easy."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "TIM WALLER",
          "Nb_Reviews": 9,
          "Date": "2019-08-06T14:55:43.000Z",
          "Titre": "An excellent and professional operation",
          "Contenu": "This is my third tracker using Teletrac and on each occasion the staff/installers have been extremely helpful and professional in their dealings with me.The Installer arrived on time and telephoned me on each visit with an expected ETA."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Weidner",
          "Nb_Reviews": 4,
          "Date": "2020-07-29T14:33:29.000Z",
          "Titre": "I spoke with Mario over the last…",
          "Contenu": "I spoke with Mario over the last weekend about an issue with a few vehicles. He politely called today to follow up and to make sure the issue had been corrected. As of now the vehicle HOS seem to be working as it should."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keri Arriaga",
          "Nb_Reviews": 1,
          "Date": "2021-04-12T14:33:34.000Z",
          "Titre": "Cesar Franco has spent roughly 10 days…",
          "Contenu": "Cesar Franco has spent roughly 10 days in constant contact with me while we worked out connectivity issues with one of our vehicles. He is an invaluable employee and a great face for the Teletrac Tech Team."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric Barcelona",
          "Nb_Reviews": 1,
          "Date": "2020-02-10T19:26:31.000Z",
          "Titre": "I think it may be helpful if there was…",
          "Contenu": "I think it may be helpful if there was a diagram of parts and the correct terminology for the parts for vehicle tracking and ELDs. This would allow for us the customer to be on the same level when talking to the technicians."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pat Sanders",
          "Nb_Reviews": 3,
          "Date": "2020-01-29T19:14:16.000Z",
          "Titre": "Customer Support",
          "Contenu": "Over the last two years, I’ve had to call customer support on numerous occasions and was placed on hold for over an hour (or more), and several times technicians would drop the ball and not follow through as promised. Most of the cases had to be escalated to an advance tier 2 group and it sometimes took several days to resolve an issue. We have had many up and downs with Teletrac, but they have come a long way and have made a few changes to offer better customer support. On this occasion, Lori Herrera did an outstanding job to fix an issue that no other technician has been able to resolve for the past 5 months. She was quite knowledgeable and went above and beyond to solve the issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tammy Waddle",
          "Nb_Reviews": 3,
          "Date": "2020-07-01T11:00:21.000Z",
          "Titre": "Joel was very helpful in resolving our…",
          "Contenu": "Joel was very helpful in resolving our issue with a tablet that was not  working properly.  He followed up to make sure we were satisfied with the results.  He was very polite and professional to deal with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Schwickerts",
          "Nb_Reviews": 1,
          "Date": "2019-08-20T12:25:35.000Z",
          "Titre": "We recently had one of our trucks…",
          "Contenu": "We recently had one of our trucks stolen on a jobsite, and thanks to Teletrac we were able to locate the vehicle within hours of it being stolen and have the local police department recover it with minimal damage."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Benjamin Knox",
          "Nb_Reviews": 1,
          "Date": "2022-02-17T17:58:43.000Z",
          "Titre": "Great service, great people.",
          "Contenu": "The tech support is fantastic, and the service itself is the best we've seen. However, setup and migration is somewhat disorganized at times, so be aware."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 3,
          "Date": "2019-09-16T13:16:23.000Z",
          "Titre": "Unit not tracking",
          "Contenu": "It took just a little too long between the time of calling in the repair request and someone contacting me to schedule.  Other than that, the repairman showed up when scheduled and fixed the problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry Dawes",
          "Nb_Reviews": 6,
          "Date": "2019-07-22T20:41:02.000Z",
          "Titre": "Support is very good and responsive",
          "Contenu": "Support is very good and responsive. Carlos and Shelton are great to work with!The only challenge I have is with the reliability of the QT 200 units. Carlos is very familiar with my concerns."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "BRS",
          "Nb_Reviews": 4,
          "Date": "2019-08-18T20:33:31.000Z",
          "Titre": "Having had an IT issue on my new phone…",
          "Contenu": "Having had an IT issue on my new phone I made contact with thecall centre and was lead through the whole process with patience and good humour.....the operator was a credit to your company"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shelly",
          "Nb_Reviews": 4,
          "Date": "2021-10-28T20:26:44.000Z",
          "Titre": "Track First then Call",
          "Contenu": "I am appreciative that they call me and verify and wait for the bus to be on the road before they track it to make sure it is good. Then follow up with me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer Bash",
          "Nb_Reviews": 1,
          "Date": "2020-03-18T15:16:15.000Z",
          "Titre": "Helpful customer service rep",
          "Contenu": "Odin was helpful when I called about an issue with a tracking unit.  He offered insight to the problem based on a report he ran, sent me the report, and we agreed on next steps."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matt Munger",
          "Nb_Reviews": 1,
          "Date": "2019-09-10T17:42:34.000Z",
          "Titre": "Very responsive",
          "Contenu": "Very responsive, but unable to resolve any of the issues while on the phone. Helped create (2) cases and directed them to my account manager. Hopefully good resolution to come."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-18T19:47:56.000Z",
          "Titre": "Referance 917584",
          "Contenu": "Referance 917584Called for several issues/questions on new Director platform, Cesar F. was very friendly, open and thorough in looking into a resolution for me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2021-11-10T17:23:08.000Z",
          "Titre": "Very helpful",
          "Contenu": "reference number – 1010091-JoeJoe was not able to fix a problem, but he gave me a number to contact and he gave me a lot of helpful information."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Arlene Jane Ell",
          "Nb_Reviews": 1,
          "Date": "2019-10-04T07:35:45.000Z",
          "Titre": "Really appreciate the help and time…",
          "Contenu": "Really appreciate the help and time your customer service rep Mabel Freytag has given us! She has been at hand throughout helping to sort out our requirements efficiently."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randy Elmore",
          "Nb_Reviews": 2,
          "Date": "2019-08-23T12:49:50.000Z",
          "Titre": "Original case had been closed",
          "Contenu": "Original case had been closed, although no contact had been made or the issue fixed.  The CSR eventually figured out the issue and escalated it.  The issue was then fixed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-08-06T17:52:11.000Z",
          "Titre": "Cesar F",
          "Contenu": "Cesar F. was very helpful in resolving issues for multiple cases and informative about troubleshooting down the line. Very professional and courteous."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Beverly Skinner",
          "Nb_Reviews": 2,
          "Date": "2019-09-02T17:48:10.000Z",
          "Titre": "Better than the other two telematics providers I tried.",
          "Contenu": "Teletrac has added customer support specialists within the last year. This has improved the customer support experience exponentially. They are basically your advocate to make sure any issues you are having get resolved in a timely manner. You can contact them directly and then they talk to any other departments that are involved in getting the issue resolved. It is a much better customer support system now. While Teletrac has been having issues with their new Director platform that they updated to in May, it is largely due to Nationwide cellular network issues because of the update to LTR. I tried two other companies over a period of two months and neither of them could give me a working system because of the LTE updates nor did they have the features that Teletrac has. I'm back with Teletrac and we are resolving the issues with our telematics system."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry Dawes",
          "Nb_Reviews": 6,
          "Date": "2022-04-20T13:04:38.526Z",
          "Titre": "Response was detailed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rika Essig",
          "Nb_Reviews": 2,
          "Date": "2020-01-22T18:07:35.000Z",
          "Titre": "The customer service staff is very…",
          "Contenu": "The customer service staff is very patient and helpful. We have had many ups and downs with Teletrac and I think they have come a long way with that piece."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karla Wright Hayden",
          "Nb_Reviews": 1,
          "Date": "2019-07-30T16:59:44.000Z",
          "Titre": "Good service",
          "Contenu": "Customer service agents are always polite and try to be helpful.  Unfortunately, it doesn't seem like there is a standard procedure for troubleshooting."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-08T17:57:16.000Z",
          "Titre": "Rep helped and fixes the issue",
          "Contenu": "Rep helped and fixes the issue.  very freiendly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karla Hicks",
          "Nb_Reviews": 1,
          "Date": "2020-01-30T14:08:17.000Z",
          "Titre": "Mario Rodriquez",
          "Contenu": "Mario Rodriquez (ext #6395) helped to access our problem and implemented repair quickly.Better service then we have received in the past.Thank You"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karla",
          "Nb_Reviews": 7,
          "Date": "2020-04-23T15:16:13.000Z",
          "Titre": "Sergio was excellent at keeping me in…",
          "Contenu": "Sergio was excellent at keeping me in the loop as he worked to resolve a problem that one of our partners were experiencing with their platform."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Beth Hyatt",
          "Nb_Reviews": 1,
          "Date": "2020-03-06T00:19:08.000Z",
          "Titre": "Assisted me immediately in solving my…",
          "Contenu": "Assisted me immediately in solving my issues.  All but 1 issue cleared up with first phone call, last issue cleared up within 1/2 of phone call."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "dennis bulger",
          "Nb_Reviews": 2,
          "Date": "2019-09-23T14:12:30.000Z",
          "Titre": "It took a few days of conversations via…",
          "Contenu": "It took a few days of conversations via email, but the issues I was having were resolved. Support was polite and knowledge and nice to deal with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ramon Ruiz",
          "Nb_Reviews": 3,
          "Date": "2019-09-02T17:36:51.000Z",
          "Titre": "I got a quick phone answer and after…",
          "Contenu": "I got a quick phone answer and after that the support person helped me according with my expectation.I felt comfortable with him Thank You !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debbie Warren",
          "Nb_Reviews": 1,
          "Date": "2019-12-20T18:37:17.000Z",
          "Titre": "The customer service reps are helpful…",
          "Contenu": "The customer service reps are helpful and answer any questions I have and have made sure I fully understand the answer before we end the call."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Weidner",
          "Nb_Reviews": 4,
          "Date": "2021-03-16T17:14:04.000Z",
          "Titre": "While systems are continually updating…",
          "Contenu": "While systems are continually updating and changing Joel was great helping me rectify the situation so our drivers remain compliant."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Paul Whittingham",
          "Nb_Reviews": 2,
          "Date": "2019-08-30T06:57:40.000Z",
          "Titre": "Navman shows me and the team exactly…",
          "Contenu": "Navman shows me and the team exactly what we need when we need it without any complicationsAn invaluable piece of technology for our industry"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dwayne Craig",
          "Nb_Reviews": 1,
          "Date": "2019-08-12T17:23:18.000Z",
          "Titre": "not connect to VLU",
          "Contenu": "They were quick to repair my issue. Only one thing to say. we tend to have the same issue keep coming back to keep use from  logging in. Why?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-08-30T18:23:21.000Z",
          "Titre": "Transportation foreman",
          "Contenu": "Very nice and helpful"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peter Putz",
          "Nb_Reviews": 3,
          "Date": "2019-08-05T19:44:33.000Z",
          "Titre": "I thought your operators were very…",
          "Contenu": "I thought your operators were very helpful and very knowledgeable and my issues were solved and thank you for your patience with us"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John Bowden",
          "Nb_Reviews": 1,
          "Date": "2019-08-02T15:26:49.000Z",
          "Titre": "Great help",
          "Contenu": "Great help, with a potentially tricky situation.  Answered all my questions and provided solutions for me and my team.. Great work"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jorge Mesina",
          "Nb_Reviews": 1,
          "Date": "2020-03-04T23:37:07.000Z",
          "Titre": "It would be great if someone could…",
          "Contenu": "It would be great if someone could communicate with me with the issue it was having so I can get it fixed next time it happens."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roberta Murphy",
          "Nb_Reviews": 2,
          "Date": "2019-07-31T14:59:35.000Z",
          "Titre": "Customer service Sam Holguin was…",
          "Contenu": "Customer service Sam Holguin was excellent in fixing the problem and doing follow up to make sure that there were no more issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jack Davis",
          "Nb_Reviews": 1,
          "Date": "2020-02-14T19:23:03.000Z",
          "Titre": "customer support",
          "Contenu": "Some customer support reps are hard to understand when trying to speak English. Would be five stars if communication improves."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephanie Fester",
          "Nb_Reviews": 1,
          "Date": "2019-09-24T13:24:46.000Z",
          "Titre": "Secretary",
          "Contenu": "I really appreciated the costumer service i received. The guy was very knowledgeable when it came to fixing my problem thanks!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna Gilbert",
          "Nb_Reviews": 5,
          "Date": "2019-10-04T14:10:20.000Z",
          "Titre": "I finally spoke with a technician that…",
          "Contenu": "I finally spoke with a technician that could explain what was happening with the error and why they are occurring.Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shawn",
          "Nb_Reviews": 2,
          "Date": "2020-01-17T19:16:26.000Z",
          "Titre": "Things have been progressing for us the…",
          "Contenu": "Things have been progressing for us the more we families ourselves with the equipment.  Good response time on the repairs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brad Cardinal",
          "Nb_Reviews": 2,
          "Date": "2019-08-26T11:55:16.000Z",
          "Titre": "Started off kind of rough",
          "Contenu": "Started off kind of rough. Slow response to issues, but they have greatly improved in response time and customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary Grace",
          "Nb_Reviews": 1,
          "Date": "2020-01-08T18:16:02.000Z",
          "Titre": "The Garmin ELD is good.",
          "Contenu": "The Garmin ELD is good.  It is user friendly.  Takes minimal training for our drivers to use it adequately.  We chose Teletrac because we were able to avoid having a carrier, like a phone company and having to depend on loss of service.  We like the satellite system that is attained by using the Garmin.  We've had a few issues, that needed to be handled.  The reason I'm giving 4 stars is that we like the product, however the customer service started out very rough.  Very long wait times.  That has improved, however, when call backs are promised they don't usually happen and I end up having to call them back.  I don't know where the ball gets dropped, but it does.  We do have trouble with the unit going OFFLINE.  Sometimes getting it back ONLINE takes a few tries and then wait time for all of the information, that has been stored, to be uploaded.  There are times we have to wait til next day to make sure the system has updated.  It doesn't happen often enough to warrant looking for another company.  All things considered, we will still stay with Teletrac."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Harbour",
          "Nb_Reviews": 1,
          "Date": "2019-12-14T22:49:29.000Z",
          "Titre": "Not happy about how long it took to get…",
          "Contenu": "Not happy about how long it took to get the help, but, Sara Identified the cause of the issue and knew how to fix it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jill Welch",
          "Nb_Reviews": 7,
          "Date": "2019-09-12T14:08:01.000Z",
          "Titre": "Process took too long for moving this…",
          "Contenu": "Process took too long for moving this truck from Navman to Rydesmart where it should have been in the first place."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "R.W. Burkett Trucking",
          "Nb_Reviews": 1,
          "Date": "2021-02-24T22:45:57.000Z",
          "Titre": "Case #00890919",
          "Contenu": "Joel was helpful in walking me through our Dash Cam issues, and scheduling replacement cameras as needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna Nepsa",
          "Nb_Reviews": 4,
          "Date": "2019-11-21T13:14:57.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Great customer service from Francine Katz. She is a true professional and knows how to service her customers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jesse Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2019-10-03T20:54:10.000Z",
          "Titre": "Mario did a great job of working…",
          "Contenu": "Mario did a great job of working through the various issues and will get back with me on the final question."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lift Service Inc",
          "Nb_Reviews": 1,
          "Date": "2021-10-13T17:28:47.000Z",
          "Titre": "Had problem reviewing our camera…",
          "Contenu": "Had problem reviewing our camera footage on our dashcam. Asked for help and got it quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Genevieve Taylor",
          "Nb_Reviews": 1,
          "Date": "2019-08-08T19:22:56.000Z",
          "Titre": "The system is amazing",
          "Contenu": "The system is amazing. The people are helpful. It takes far too long to resolve an issue with the system."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cindy Martinez",
          "Nb_Reviews": 1,
          "Date": "2019-10-03T17:48:25.000Z",
          "Titre": "techs",
          "Contenu": "tier 2 tech know your systemI wish I could talk with these tech all the time, and skip the tier 1 group"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roberta Murphy",
          "Nb_Reviews": 2,
          "Date": "2019-12-19T16:53:49.000Z",
          "Titre": "The customer support tier 2 agent…",
          "Contenu": "The customer support tier 2 agent Salome was very helpful in finally getting to the cause of the issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Kapteyn",
          "Nb_Reviews": 2,
          "Date": "2020-10-01T11:11:29.000Z",
          "Titre": "Ignition not detected",
          "Contenu": "Joel was very helpful and knowledgeable about the error I had on ticket # 00D6AfPBQ._5002GrqPGO:ref"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zulma Mitchell",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T18:03:57.000Z",
          "Titre": "Cesar was great listener to my issue",
          "Contenu": "Cesar was great listener to my issue, continued to keep in touch with me to let me know he was working on my issue.  Over all he was great in communitcating with me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T23:41:27.000Z",
          "Titre": "Cesar Franco was very nice",
          "Contenu": "Cesar Franco was very nice, helpful, and attentive. He made sure to check in and make sure my issue was resolved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T01:06:54.000Z",
          "Titre": "Cesar was very quick in responding and…",
          "Contenu": "Cesar was very quick in responding and resolving our issue of not being able to see our assets on the Director home page."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Crystal",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T14:57:07.000Z",
          "Titre": "Problem was solved quickly",
          "Contenu": "The tech was able to see what my problem was immediately and get it fixed in a timely manner. He was very helpful and polite."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Camron C.",
          "Nb_Reviews": 2,
          "Date": "2022-07-14T01:13:49.000Z",
          "Titre": "Couldn't see a truck and Axl was able…",
          "Contenu": "Couldn't see a truck and Axl was able to get it fixed very quickly. He's always polite and knowledgeable and my preferred help desk rep.  I believe they recently changed their phone tree and once we type in our account number we actually get routed to the correct department rather than being transferred multiple times, big improvement.Reference number 1087553-Axl"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sal Dominguez",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T19:07:19.000Z",
          "Titre": "Gps set ups with Cesar",
          "Contenu": "Cesar was able to walk us through the complete trouble shooting process and got our GPS going. He followed though the next day to make sure all our demands were taken care of."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T19:29:54.000Z",
          "Titre": "Ceasar LISTENED to my issues!!",
          "Contenu": "Ceasar LISTENED to my issues!!!  I have tried for 2 mths to get help with this issue and was told to call this number, email this person and NOT ONE SINGLE PERSON RESPONDED.Ceasar not only fixed my issue, he found other issues on my acct & fixed those.  He should be given a raise, name on newsletter and someone buy his lunch for a month!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RICK CRONHOLM",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T17:10:47.000Z",
          "Titre": "My frustration level was at its highest!",
          "Contenu": "reference number 1171039  CGGCecilia was ever so helpful in a problem that I was having in changing the names of my Drivers. I had tried everything and nothing was working!  She remedied my situation with the utmost accuracy and friendliness. Our Teletrac Navman is now up to date and working at its full potential!  1171039  CGGThank you Cecilia!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy, Onofrios Fresh Cut",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T19:07:59.000Z",
          "Titre": "Case #1138203",
          "Contenu": "Case #1138203, Cesar F was very upbeat and friendly, allways keeping me informed about what was going on while I was put on and off hold so he could fix the problem. This was the final step in getting this issue resolved that started in June. Cesar was very confident he could fully correct this issue today and he was correct. I am very happy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T17:50:37.000Z",
          "Titre": "Cesar F had good communication and…",
          "Contenu": "Cesar F had good communication and professionalism.thanks, Cesar, for your help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fleet Mgr",
          "Nb_Reviews": 1,
          "Date": "2022-05-02T16:11:25.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "We had a tablet that would not update no matter what we did (Reference 1063979, Cesar F).  The driver's hours and mileage was logging, but nothing was visible for him.  Your representaive was very helpful getting us a new tablet and ensuring that it was working.  He even called back the next day to confirm that everything was still working as expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T17:17:02.000Z",
          "Titre": "The service tech Graciela Ramirez was awesome.",
          "Contenu": "The service tech Graciela Ramirez was awesome. She followed up with calls and emails to ensure I received the tracker that was shipped. Case# 01240913"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laurie Heath CIC",
          "Nb_Reviews": 2,
          "Date": "2023-03-31T17:45:40.000Z",
          "Titre": "USER FRIENDLY",
          "Contenu": "Timely!  Knowledgeable! Friendly! Accurate!  Helpful! User Friendly! Overall a FANTASTIC tool for my drivers and I to monitor the safe driving behaviors and getting my drivers buy in by gaining knowledge on my own, and through your support when needed.  THANK YOU!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T17:14:16.000Z",
          "Titre": "Driver showing as offline in Navman",
          "Contenu": "Driver showing as offline in Navman, but tablet appeared fine. Cesar F. got back to me before end of day regarding this. He was very courteous and professional. He also helped me with a few other issues and quickly opened tickets for those and had them resolved with a couple hours."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa DiLorenzo - Fortune Metal",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T17:07:45.000Z",
          "Titre": "Axl Chairez was very interested in…",
          "Contenu": "Axl Chairez was very interested in resolving our issues with several trucks.  He also arranged service call, parts and followed up to insure everything was satisfactory.  Very pleasant and efficient.  Thank you!– (1122661-Axl)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stafford, Dawn",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T23:36:45.000Z",
          "Titre": "Cesar what verry polite and…",
          "Contenu": "Cesar what verry polite and understanding took time to speak to the driver and trouble shoot the problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laurie Heath CIC",
          "Nb_Reviews": 2,
          "Date": "2023-03-31T15:16:51.000Z",
          "Titre": "OUTSTANDING PERFORMANCE",
          "Contenu": "Cyntia Garcia (01162351, CG) was incredibly helpful with my inquiry.  She broke it down and made it so very easy to understand and even gave examples.  I am very pleased with the support I received for she gave me exactly what I needed in order to educate my drivers.  All of you have been AMAZING!  Have an incredible day!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T12:57:33.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Oscar was very professional and stayed committed to getting my connection problem fixed. As a truck driver we need systems and support to stay compliant with DOT regulations. Thank you for your help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Williams",
          "Nb_Reviews": 2,
          "Date": "2023-01-07T01:05:16.000Z",
          "Titre": "Mr Cesar Franco",
          "Contenu": "Mr. Cesar Franco  did an outstanding job in helping me  get my  boss lady Tina Wilson  logon credentials. Thanks for having an employee like Mr. Franco for having the patience and knowledge ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T21:24:56.000Z",
          "Titre": "Cesar got my ELD working automatically…",
          "Contenu": "Cesar got my ELD working automatically again. Very professional, polite and good to explain what he was doing and what needed done after he found the problem. Also quick to follow up. Thank you 😊"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy Henry",
          "Nb_Reviews": 4,
          "Date": "2022-06-14T18:39:06.000Z",
          "Titre": "I called and spoke with Cesar",
          "Contenu": "I called and spoke with Cesar, case # 1078525 and he was a tremendous help with my install, and helped with other issues I had.  I wish I could work with certain support people, it makes it so much easier.  Thank you Cesar appreciate all your help"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B Stephens",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T17:33:52.000Z",
          "Titre": "I am impressed with the quick response…",
          "Contenu": "I am impressed with the quick response from the support team. They know their stuff. Thet=y are quick to get results and I appreciate it greatly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg G",
          "Nb_Reviews": 1,
          "Date": "2022-06-10T16:36:55.000Z",
          "Titre": "Very Helpful!!",
          "Contenu": "My representative   was very helpful and courteous. He even went the extra mile to help me get some parts replaced right away. I appreciate the level of service and how helpful he was during our call."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-07-12T01:46:14.000Z",
          "Titre": "Easy support and resolution",
          "Contenu": "Easy support and resolution for my issue. Received my unit replacements by next day. Thanks again Cesar F.Case: 1202362"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica Pula",
          "Nb_Reviews": 2,
          "Date": "2022-05-18T16:30:04.000Z",
          "Titre": "Cecelia Gomez was the rep that helped…",
          "Contenu": "Cecelia Gomez was the rep that helped me today. She was kind, patient and knowledgeable. I appreciate how helpful she was and diligent in finding the solution. She is a great representation to your company!! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karla",
          "Nb_Reviews": 7,
          "Date": "2022-08-16T14:36:13.000Z",
          "Titre": "Technical Support Shines",
          "Contenu": "Teletrac Platinum support is awesome!  They contacted me daily during a recent problem with one of our trucks.  The problem was finally resolved with replacement of some faulty wiring and a tweek to the firmware."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Haley Pollock with MCK Truckin",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T17:06:16.000Z",
          "Titre": "I had a tablet that was going on-duty…",
          "Contenu": "I had a tablet that was going on-duty automatically. I asked Cesar to assist me in disabling the Auto On-Duty. He responded in a nice timely manner. It is a nice thing to know we can always count on that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cristy",
          "Nb_Reviews": 2,
          "Date": "2023-08-08T18:18:47.000Z",
          "Titre": "I was helped in a timely manner",
          "Contenu": "I was helped in a timely manner. I really feel like you have come a long way. I used to try and chat with you, and I could never get in contact with anyone. Now I get on there and someone is there almost right away, and everyone is super friendly and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brett Mcconnaughy",
          "Nb_Reviews": 2,
          "Date": "2023-01-18T00:10:09.000Z",
          "Titre": "The attitude from your company making…",
          "Contenu": "The attitude from your company making sure our issue was handled in a rapid manner.  The follow up was impressive along the way, the customer service representative stayed in contact with me several times.case- 31136354, support EG"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raymour & Flanigan",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T15:30:14.000Z",
          "Titre": "overall great experience",
          "Contenu": "overall great experience! My call was answered quickly and the agent Cesar Franco was professional, patient and very knowledgeable. He stayed on the line until the problem was resolved. First class customer service experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karla",
          "Nb_Reviews": 7,
          "Date": "2022-07-21T19:09:15.000Z",
          "Titre": "I worked with Cesar Franco to pair…",
          "Contenu": "I worked with Cesar Franco to pair about 20 trailers that we had installed trackers on last week. He paired all the trackers in a timely way so that we could update their data in our Director."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Teresa Sanchez Y.",
          "Nb_Reviews": 11,
          "Date": "2023-01-20T23:32:15.000Z",
          "Titre": "KNOWLEDGE OF HOS",
          "Contenu": "Customer service was excellent, Axl knew what we were talking and explain in detail what can be done and what not was not allow. Thank you for the advice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-11-17T19:33:22.000Z",
          "Titre": "The tech was very helpful at resolving…",
          "Contenu": "The tech was very helpful at resolving my issues. Case #1251719, Cesar F"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Foskitt",
          "Nb_Reviews": 9,
          "Date": "2022-06-22T17:35:15.000Z",
          "Titre": "Case#  1081260",
          "Contenu": "Case#  1081260 -   Cesar Franco was an amazing help!  He has helped me in the past too!  I appreciate his expertise and quick assistance for my customers.  Thank you for Cesar!!!!!!!!!!!!!!!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mike Smith",
          "Nb_Reviews": 3,
          "Date": "2023-11-03T13:55:27.000Z",
          "Titre": "5 Stars all the way!",
          "Contenu": "My sincere thanks goes out to Chelsea Bartlett, her professional manner and approach to her work ethic has helped me organise, secure & establish an efficient organised fleet, we were looking for additional security with existing trackers and now have the added benefit of forward & cab facing cameras which we have started to roll out with our recently added new vans, the assist with the transition and support from installation team was second to none, would highly recommend Chelsea to anyone looking new fleet options and the full customer service treatment... 5 Star all the way!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miriam",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T16:33:52.000Z",
          "Titre": "Caesar helped me with my issue and was…",
          "Contenu": "Caesar F helped me with my issue and was able to resolve it.Reference number 1237569"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chuck B",
          "Nb_Reviews": 1,
          "Date": "2022-05-23T16:18:29.000Z",
          "Titre": "Cesar was very thourough yet quick to…",
          "Contenu": "Cesar was very thourough yet quick to diagnose. He was aware of the stress of my day and definitely made troubleshooting the issues with my unit quick and painless.  Had a technician on site in less than 48 hours."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clayton Jackson",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T20:17:48.000Z",
          "Titre": "Cesar was very helpful",
          "Contenu": "Cesar was very helpful, and even stayed online with me while I checked and connected tablet to our truck."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T18:21:05.000Z",
          "Titre": "I loved the fact that he contacted me…",
          "Contenu": "I loved the fact that he contacted me until he was sure that my question and concerns were answered. He was kind, respectful and courteous."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2022-05-19T16:20:56.000Z",
          "Titre": "Help that actually helps",
          "Contenu": "As someone who is responsible for the maintenance of 100+ EDLs, teletrac's tech support is a life-saver.  The techs are competent and take as much time with you as they need to come to a resolution. One complaint: occasionally the phone quality is poor and I have a difficult time understanding, but usually my experience with Teletrac tech support is  100% positive"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Hidler",
          "Nb_Reviews": 1,
          "Date": "2022-07-15T17:15:24.000Z",
          "Titre": "Our rep Joni",
          "Contenu": "Our rep is Joni and she is always available to help regardless of the issue. Very knowledgeable and just a pleasure to work with. Thank you on behalf of El Paso Fox Xpress Joni!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RDC CARGO LLC",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T19:32:50.000Z",
          "Titre": "Oscar was very knowledgeable and…",
          "Contenu": "Oscar was very knowledgeable and prompt. He understood immediately my necessity. His attitude was completely friendly and I didn't have to wait forever."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rene Rocha",
          "Nb_Reviews": 2,
          "Date": "2022-12-01T20:33:30.000Z",
          "Titre": "The tech spent the time to include…",
          "Contenu": "The tech spent the time to include images as well as step by step action to ensure I would be able to complete the task at hand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T19:55:31.000Z",
          "Titre": "Ceaser is a true kind account manager.",
          "Contenu": "Ceaser is a true kind account manager.He took care of us so well with his great behaviors.Whole process went through with no stress."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryder",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:39:52.000Z",
          "Titre": "Good communication",
          "Contenu": "Good communication, knowledgeable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T21:30:27.000Z",
          "Titre": "Tech was able to resolve my issues in a…",
          "Contenu": "Tech was able to resolve my issues in a timely fashion and in a professional manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Harwell",
          "Nb_Reviews": 2,
          "Date": "2022-11-04T18:16:40.000Z",
          "Titre": "Axl Chairez is the go to guy!",
          "Contenu": "Axl Chairez helped me with case number (120997-Axl) with the utmost degree of professionalism and system knowledge.  Very good manners too!."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T17:46:08.000Z",
          "Titre": "New Tablet",
          "Contenu": "New Tablet I installed a new Samsung tablet in the truck and the ELD was not pulling through to the tablet. I called in and the tech that helped was helpful and was able to get the Bluetooth set up on the unit to where I could connect the tablet. Everything was now working for the driver and they were able to login and go about the day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T21:51:03.000Z",
          "Titre": "01067832 Joel",
          "Contenu": "01067832 Joel - He was very good in assisting us with our issue.  Joel was very responsive and stayed in contact with me throughout the whole process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Felix Sarmiento",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T16:44:01.000Z",
          "Titre": "AXL was great and understanding the…",
          "Contenu": "AXL was great and understanding the issue that I had and helping me find a solution. He is an overall great individual for the Teletrac Team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TNT Road Company",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T14:23:09.000Z",
          "Titre": "Cesar has been so pleasant and has…",
          "Contenu": "Cesar has been so pleasant and has great customer service skills. He has helped resolved our issues promptly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Equipment Depot - Karen Robiso",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T15:20:28.000Z",
          "Titre": "Very polite and prompt attention to my…",
          "Contenu": "Very polite and prompt attention to my request. Received a follow up call to make sure everything was resolved.  Very professional and knowledgeable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria De Leon",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T22:58:00.000Z",
          "Titre": "My experience  with Cesar was amazing…",
          "Contenu": "My experience  with Cesar was amazing he help me and my driver with every question we had. He call us to check that we weren’t having any more issues. Thank you so much Cesar"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Calvin Menegassi",
          "Nb_Reviews": 3,
          "Date": "2023-02-03T17:02:36.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service! I had an urgent, time-sensitive issue that was resolved in a friendly, timely manner. Thank you Navman support team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-05-18T23:59:20.000Z",
          "Titre": "Rep Cesar is great at getting my work…",
          "Contenu": "Rep Cesar is great at getting my work orders completed in a fast timely manner.  Amazing customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "San Juan Pools",
          "Nb_Reviews": 8,
          "Date": "2022-06-15T15:58:25.000Z",
          "Titre": "Ceasar - Great Employee",
          "Contenu": "Ceasar assisted me.  What a wonderful, friendly and upbeat person.He was able to resolve my ELD issue very quickly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laurie Deal",
          "Nb_Reviews": 3,
          "Date": "2022-08-04T21:45:46.000Z",
          "Titre": "Teletrac customer service is always so…",
          "Contenu": "Teletrac customer service is always so helpful. Axl Chairez solved my issue for me quickly today"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-11-01T22:34:23.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Great customer service,  Cesar helped me with all my concerns and did everything possible to help me with my issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-22T00:52:34.000Z",
          "Titre": "Had an issue with my account and…",
          "Contenu": "Had an issue with my account and Cecilia was able to help me out. She was professional, kind, understanding and communicated with me all the issues that were happening. Overall experience was positive and quick."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelly",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T16:51:05.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "I spoke with Cesar for an issue I was having. My Driver was not showing up as logged in. He quickly identified the issue and talked me through fixing it. He was polite and kind!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T20:35:34.000Z",
          "Titre": "Cesar was fantastic and effective",
          "Contenu": "Cesar was fantastic and effective.  Walked me through the entire process and resolved my issue in short order"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marco Chavez",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T17:42:04.000Z",
          "Titre": "Needed help with migration process and…",
          "Contenu": "Needed help with migration process and was helped promptly and completely. Cesar did a great job assisting me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neil's Lawn Service",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T19:00:48.000Z",
          "Titre": "super nice",
          "Contenu": "super nicethere was waiting involved and he kept messaging me to make sure I was there and that he was working on my request"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shelly",
          "Nb_Reviews": 4,
          "Date": "2022-08-18T18:14:03.000Z",
          "Titre": "Best Tech",
          "Contenu": "I called and got Axl Chairez. First, I want to say that the last few times I have contacted tech support, I have been upset with the results. I did not feel they truly tried to understand the issues or tried to help. It was more \"we are having issues and they should correct itself shortly\". And that was after being on hold for over an hour. Well, today, thinking I might have the same issue I was first surprised that the call was answered quickly, and I got Axl. I remember his voice from a few times I have talked with him before, a few months back. Well, he not only helped me, helped me understand what I am seeing, helpled me correct the issue and he followed up twice. Just to make sure I was good. This is not only the first time he has helped me completely. If I could have one tech assigned to me, I would request Axl. Thank you, Axl, for all of your help every time I got to talk to you."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Aminul Bablu",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T10:11:01.000Z",
          "Titre": "Teletrac Navman is far beyond its competitors",
          "Contenu": "Teletrac Navman is far beyond its competitors with innovative tools and technologies being introduced from smart display, data collection to AI. Sarah Jackson always shares ideas and innovative ways of looking at data to improve our service. This is an excellent company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T17:50:26.000Z",
          "Titre": "Joined the chat quickly and continued…",
          "Contenu": "Joined the chat quickly and continued to communicate with me with fast responses."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M. Schaab",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T23:07:13.000Z",
          "Titre": "Solved my issues of finding my user…",
          "Contenu": "Solved my issues of finding my user name, resetting my password and removing old units right away."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Distance Trucking",
          "Nb_Reviews": 4,
          "Date": "2022-12-06T19:00:26.000Z",
          "Titre": "Great experience",
          "Contenu": "As usual, Axiel was very helpful. He knows his job, and we always have good communication."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Camron C.",
          "Nb_Reviews": 2,
          "Date": "2022-08-11T23:37:12.000Z",
          "Titre": "I couldn't see several trucks and after…",
          "Contenu": "I couldn't see several trucks and after calling in the issue was fixed right away and I was up and running."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Celio",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T17:50:37.000Z",
          "Titre": "need help with ELD",
          "Contenu": "I need help with ELD user's manual, Cesar Franco explain every thing that I need to know about the ELD, them he send me Garman user guide for ELD.I m very happy with customer service. Thank you. Celio"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-06-13T21:08:18.000Z",
          "Titre": "Great customer support!",
          "Contenu": "The support specialist was very patient and made sure that my issue was resolved before leaving the chat."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Keith Tulsie",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T10:32:51.000Z",
          "Titre": "Great session from Sarah Jackson",
          "Contenu": "Great session from Sarah Jackson, showing our team how to use and get the best out of Director."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GENE S",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T16:46:43.000Z",
          "Titre": "WAY TO GO AXEL",
          "Contenu": "Axel was great he answered any and all my questions he was knowledgeable and patient with me in walking me through my issues he deserves some recognition for his attributes to your company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodney - AMS Ops Team",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T16:07:27.000Z",
          "Titre": "Cesar F was awesome!!",
          "Contenu": "Cesar F - 1128103 was awesome, actually helped resolve the issues with our driver's HOS"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T20:48:25.000Z",
          "Titre": "Follow till problem solved",
          "Contenu": "Follow till problem solved. I really like to ask each steps taken and the final call of the unit working properly ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T19:27:54.000Z",
          "Titre": "Cesar was a great help with our…",
          "Contenu": "Cesar was a great help with our problems today.  Once again he did an outstanding job helping me out, only if I could get Ryder to do the sameThanks again!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T17:57:17.000Z",
          "Titre": "Device Replacement",
          "Contenu": "Cesar did an excellent job of keeping me updated in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leo Francis, New Balance",
          "Nb_Reviews": 1,
          "Date": "2022-07-20T09:48:39.000Z",
          "Titre": "Ceaser Franco",
          "Contenu": "Ceaser Franco, was very pleasant and extremely  helpful with helping fix my Garmin."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Caroline",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T20:34:04.000Z",
          "Titre": "Cesar was very helpful",
          "Contenu": "Cesar was very helpful - he called and walked me through each step and was patient the entire time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T19:45:52.000Z",
          "Titre": "The agent was knowledgeable and fast"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Wilder",
          "Nb_Reviews": 2,
          "Date": "2022-09-15T18:11:41.000Z",
          "Titre": "Case 1105797",
          "Contenu": "Case 1105797 - The call dropped twice, but more importantly the long time issues were remedied thanks to Ceasar F"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Barker",
          "Nb_Reviews": 2,
          "Date": "2022-12-30T19:23:13.000Z",
          "Titre": "He was extremely helpful",
          "Contenu": "He was extremely helpful. Called to make sure package was delivered. Called back with follow-up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Ruccolo",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T18:19:31.000Z",
          "Titre": "1113820, Cesar F.",
          "Contenu": "Cesar was friendly, prompt and exact.  I was very impressed with his professionalism."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T17:12:46.000Z",
          "Titre": "i had an isuue where i couldnt log into…",
          "Contenu": "i had an isuue where i couldnt log into my account and no email for reset was coming through, so on speaking on the live chat the operater firstly couldnt find the account either , but then after a while and some investigation he was able to reset the account and sort me out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Javier martinez",
          "Nb_Reviews": 1,
          "Date": "2022-08-12T23:08:29.000Z",
          "Titre": "Person was good on answering all my…",
          "Contenu": "Person was good on answering all my questions and fix my problem with the teletrac"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Loretta",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T03:39:34.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. He helped us thu the process. He was amazing. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T02:17:30.000Z",
          "Titre": "Problem solved by Cesar",
          "Contenu": "Problem solved by Cesar, quickly and easilyincident #1175848, Cesar F"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T16:13:10.000Z",
          "Titre": "I had a unit that was not tracking",
          "Contenu": "I had a unit that was not tracking. Called Teletrac agent Cesar Franco and we had the issue resolved in less than 10 minutes"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T23:14:15.000Z",
          "Titre": "Cecilia Gomez was very helpful",
          "Contenu": "Cecilia Gomez was very helpful, quickly answering my question and providing a solution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dana Leccrone",
          "Nb_Reviews": 2,
          "Date": "2022-06-13T16:58:20.000Z",
          "Titre": "Ref # 1075810 was very helpful in…",
          "Contenu": "Ref # 1075810 was very helpful in troubleshooting the issue at hand and even though the problem seem to resolve itself whether it was an update our tech even followed up the next day to inform us that he continued to watch our trouble unit and follow up that it indeed was fixed and operational."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Ann",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T15:53:17.000Z",
          "Titre": "Cesar Franco did a great job resolving…",
          "Contenu": "Cesar Franco did a great job resolving our login problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Calvin Menegassi",
          "Nb_Reviews": 3,
          "Date": "2023-04-14T21:58:04.000Z",
          "Titre": "Great customer service",
          "Contenu": "Cesar was great to work with. He quickly solved my issue. Thanks, Navman!Case# 1169036CalvinCity of Portland"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Radtke",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T19:07:38.000Z",
          "Titre": "Tech support was polite and fixed my…",
          "Contenu": "Tech support was polite and fixed my problem quickly. Great overall experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T17:45:08.000Z",
          "Titre": "Walked me through setting up and even…",
          "Contenu": "Walked me through setting up and even gave a crash course on the program. Excellent work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryder Fort Lauderdale",
          "Nb_Reviews": 2,
          "Date": "2022-07-20T15:58:06.000Z",
          "Titre": "Very helpful, and easy",
          "Contenu": "They made the process very fast and easy to get the customer up and running. Awesome job"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "j clancey",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T22:18:00.000Z",
          "Titre": "Very quick to follow up and friendly to…",
          "Contenu": "Very quick to follow up and friendly to chat with Always  ready to help . It was like having a friend on the inside."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T19:45:24.000Z",
          "Titre": "Helped install Teletrac and was very…",
          "Contenu": "Helped install Teletrac and was very helpful and made it a very easy process"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cristy",
          "Nb_Reviews": 2,
          "Date": "2023-08-25T13:43:59.000Z",
          "Titre": "Cesar was amazing",
          "Contenu": "Cesar was amazing, he helped me so much and was very friendly and very helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T05:13:01.000Z",
          "Titre": "You guys are fast & very professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd",
          "Nb_Reviews": 1,
          "Date": "2022-05-12T16:33:43.000Z",
          "Titre": "Very helpful",
          "Contenu": "Very helpful . Was able to get new vt101 registered for our new customers truck ."
        }
      ]
    }
  ]
}