{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "termsfeed.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T07:22:20.000Z",
          "Titre": "Form doesn’t match business needs and…",
          "Contenu": "Form doesn’t match business needs and is minimally customizable.   Won’t work for us"
        },
        {
          "Note": 3,
          "Lieu": "RO",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T15:46:37.000Z",
          "Titre": "Good template but quite expensive",
          "Contenu": "I like the templates available as they are user friendly and come with good instructions but it's quite pricey for something that can be reused over and over again and you fill in yourself. It's also a massive document and I am wondering if it could be simplified looking at other privacy policies people have on their website."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sãeed Simmons",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T07:32:03.000Z",
          "Titre": "Terms Feed was able to have the legal terms I needed ASAP",
          "Contenu": "Terms Feed was able to have the legal terminology that I needed on a site ASAP, allowing me to move forward. I couldn’t really respect the fact that the must important terms that are state mandated, was the ones you needed to purchase, at a steep price. Personally I would have liked it all to be in one, an allowed me to pay for it all. But the site was a great and much needed service."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T18:29:09.000Z",
          "Titre": "I thought I could also generate Terms…",
          "Contenu": "I thought I could also generate Terms in German ... which I could not."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T14:18:12.000Z",
          "Titre": "The pricing structure could be…",
          "Contenu": "The pricing structure could be different. I payed less than I thought I was going to but because of how it was displayed I thought it was more. But overall my experience was good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sand Snow",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T18:55:55.000Z",
          "Titre": "Easy",
          "Contenu": "It was easy to create what I needed from TermsFeed. I feel relieved to have my policies in place on my website. Fees were minimal and I have the comfort of knowing I can revise and improve as I go."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T10:28:48.000Z",
          "Titre": "Very useful",
          "Contenu": "Very usefulGood to be able to have terms & conditions written for me without having to make an appointment. Would be better to have more options for what is required to be covered under the terms."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T15:40:23.000Z",
          "Titre": "Very good tools that are easy to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sheila Doerfler",
          "Nb_Reviews": 3,
          "Date": "2023-08-18T19:13:29.000Z",
          "Titre": "Purchased T+C and Privacy Policy",
          "Contenu": "I purchased T+C and Privacy Policy. The transaction was pretty easy. The breakdown of pricing per option chosen was helpful in knowing the price before check out. The resulting document is not quite suited for my service based healing business... so I will need to edit out bits that don't apply and make some other changes. Checking out and payment was not straightforward. The payment page only had a field for credit card number & expiration - no field for the 3 digit security code or address so my payment was rejected several times. I followed the trouble shooting directions for Google settings etc but it still didn't work. I finally went through PayPal, which I hate using because of extra fees & just ethical issues with them as a payment platform. So a better set up for your payment platform would have made that all easier & less time consuming. Also, there didn't seem to be a way to streamline purchasing 2 documents in one transaction... I had to create separate purchases in order to get all I needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles Maness",
          "Nb_Reviews": 1,
          "Date": "2023-05-14T22:46:55.000Z",
          "Titre": "Plan content and pricing considerations…",
          "Contenu": "The basic plan should be updated to comply with current legal case law. The premium plan should be one price membership vs. a cost for each product. You are near or have now exceeded what a membership plan costs annually."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Tom Hayward",
          "Nb_Reviews": 1,
          "Date": "2023-05-14T22:28:09.000Z",
          "Titre": "TermsFeed statement generator works well",
          "Contenu": "i used TermsFeed to obtain a privacy statement for our non-profit organization.  the process was quick and straightforward in completing the online form’s set of simple questions.  i only had to tweak the resulting privacy statement a bit to change the commercial term“Company” to the more suitable non-profit term of “Society”."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T15:53:47.000Z",
          "Titre": "Product is fine",
          "Contenu": "Product is fine, the constant harassment for a survey review is a bit much."
        },
        {
          "Note": 4,
          "Lieu": "RO",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T05:12:44.000Z",
          "Titre": "Straight forward and easy to use",
          "Contenu": "I needed a comprehensive international privacy policy covering multiple jurisdictions and Termsfeed was quick and easy to use."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T16:33:05.000Z",
          "Titre": "Good product",
          "Contenu": "Good product - only frustration is you need to reload all your details with every new agreement. That is inefficient"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roy",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T00:32:18.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good.  Easy website to get started.  Had a small glitch to make initial payment online.  Your support team quickly resolved. Thx."
        },
        {
          "Note": 4,
          "Lieu": "SI",
          "Pseudo": "Custom Er",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T15:14:05.000Z",
          "Titre": "Exactly what I need... but at a price",
          "Contenu": "+ Exactly what I need+ One time payment+ Modern (includes GDPR etc.)- a little bit pricey for a template"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T20:10:48.000Z",
          "Titre": "Had to go to another page but other…",
          "Contenu": "Had to go to another page but other than that no worries"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T23:26:38.000Z",
          "Titre": "Fairly easy to figure out how to apply…",
          "Contenu": "Fairly easy to figure out how to apply the documents to my website."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff W Welsh",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T20:51:37.000Z",
          "Titre": "Seems to be comprehensive and easy to…",
          "Contenu": "Seems to be comprehensive and easy to utilize."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Travis Archibald",
          "Nb_Reviews": 2,
          "Date": "2023-03-06T01:01:50.000Z",
          "Titre": "Easy to follow process and obtain the…",
          "Contenu": "Easy to follow process and obtain the required document."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marjorie",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T16:09:50.000Z",
          "Titre": "Simple",
          "Contenu": "It was simple."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BARRY GANT",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:55:55.000Z",
          "Titre": "7 Day Kitchens in Charlotte Updates its Privacy Policy",
          "Contenu": "My company, 7 Day Kitchens in Charlotte, needed a new updated privacy policy for our kitchen remodeling business. All of these new regulations are hard to understand but TermsFeed helped us with what we needed in order to stay in compliance. The process was super simple and easy - even for cabinet installer like me. They stand behind what they say and we plan to come back again once our terms need to be amended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Britt Riley",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:27:15.000Z",
          "Titre": "Wonderful customer service!",
          "Contenu": "Wonderful customer service!! I needed a simple change of my email address on my account and Max was so quick to resolve my request. I also thought it was amazing to have a follow up email making sure everything I needed was taken care of. Very proficient and professional. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Howard Richman",
          "Nb_Reviews": 5,
          "Date": "2023-12-19T22:42:47.000Z",
          "Titre": "Very helpful service",
          "Contenu": "This is a great service at a reasonable price. You covered many elements that I would never have thought of. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Curtis",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T19:24:26.000Z",
          "Titre": "Greatful",
          "Contenu": "Max at Termsfeed was a tremendous help in my time of need with my privacy policy for my website, that settled all my issues with another company associated with my business."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Alice",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T11:49:48.000Z",
          "Titre": "That was a truly good experience",
          "Contenu": "That was a truly good experience, quick and simple process of making all needed docs"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Brian Muldoon",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T01:10:11.000Z",
          "Titre": "TermsFeed was exactly what I was looking for…",
          "Contenu": "Super easy to use and covers all that bases for different countries, which is great for those who want to offer products and services outside of your country."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T06:49:04.000Z",
          "Titre": "Perfect just what I needed",
          "Contenu": "Perfect just what I needed. Fast easy reasonable price, export; hosting etc. would recommend to anyone. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Megan N",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T04:05:34.000Z",
          "Titre": "Works! Easy to Use",
          "Contenu": "Pay for what you need, easy to understand instructions as you build your policy for your page(s).  I would recommend if you are collecting personal data, or have no idea how to write a policy and you are setting up a website, ecommerce website."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T11:32:14.000Z",
          "Titre": "Very thorough and easy to use",
          "Contenu": "Very thorough and easy to use. Just what I needed for my site."
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "Quik Trenz",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T08:47:17.000Z",
          "Titre": "Quick and easy",
          "Contenu": "Platform is very user-friendly and the repsw response very quickly to enquiries. Extremely impressed with their service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T21:49:57.000Z",
          "Titre": "Nice thorough template but missing customization",
          "Contenu": "The process is very easy to go through. Unfortunately Google Play has added a requirement to cite \"photos and videos\" if an app collects them, and that choice isn't in the Termsfeed prompts, so we had to create the policy and then change it instead of leaving it hosted by Termsfeed. Still, a really good service and worth the money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DEBRA M",
          "Nb_Reviews": 4,
          "Date": "2023-09-27T21:50:06.000Z",
          "Titre": "Recommended to meet GDPR regulations",
          "Contenu": "I was just trying to meet the new Google AdSense requirements for General Data Protection Regulation(GDPR) and I needed a privacy policy that met all the new requirements. Your site was recommended so I used it. It was fairly easy to use and seemed comprehensive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian C.",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T01:58:59.000Z",
          "Titre": "Excellent Service",
          "Contenu": "We have been using TermsFeed services for years. This was the first time we needed support. The support was exceptional! Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tammy",
          "Nb_Reviews": 3,
          "Date": "2023-08-19T15:31:14.000Z",
          "Titre": "Easy",
          "Contenu": "Easy, affordable, and comprehensive. I needed online terms and conditions that covered major areas of liability, and I did not even know where to start. In less than 5 minutes, I was able to satisfy the requirements I needed and could customize it easily for my company. As a small business owner, this was a Godsend! Thank you."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Claudio",
          "Nb_Reviews": 2,
          "Date": "2023-08-02T10:27:36.000Z",
          "Titre": "The best in the world!",
          "Contenu": "The best in the world!! I had a problem with a payment, no cc transaction possible, so I asked data for a wire transfer payment!! They activated immediately my request and I had it free of charge. A real great behaviour!! Never found on the net. I'll be always proud of them!! Claudio Giannesi"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T19:37:50.000Z",
          "Titre": "Very fast, very straightforward and priced right.",
          "Contenu": "I used TermsFeed \"Terms of Service\" template and had exactly what I wanted in about 8 minutes.  I hit a bug on their website and left them feedback and support's response was within 30 minutes and *very* helpful.  Highly recommend this service - will likely be using their other products as a result of this experience."
        },
        {
          "Note": 5,
          "Lieu": "MK",
          "Pseudo": "Emilija",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T18:19:03.000Z",
          "Titre": "It was very easy to use",
          "Contenu": "It was very easy to use. The privacy policy generator helped us to gain more information about what our website need. The content is rich and comprehensive. We also loved that the software sends notifications to update the privacy policy in case of changes in the parent law or regulation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kat",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T08:39:08.000Z",
          "Titre": "Great",
          "Contenu": "Great! Excellent! So easy to use and explains well with each step, while including specific needs. Couldn't be better really...I meam $20-60 is nothing compared to lawyer feesThank you term feed for making my site protected!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tomesha",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T01:51:19.000Z",
          "Titre": "A few clicks and magic happens",
          "Contenu": "I needed to make some updates to my disclaimer policies. TermsFeed was exactly what I needed. By answering a few quick questions, I was able to easily customize my policies and get them up on my website in no time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T17:48:21.000Z",
          "Titre": "Great legal timesaver.",
          "Contenu": "This is an affordable solution to help keep small businesses out of hot legal water without spending too much time. Without this, you'd either have to consult a lawyer or attempt to rework similar terms and conditions to your needs."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Caleb Wood",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T04:50:08.000Z",
          "Titre": "Amazing Service... for free!",
          "Contenu": "I would like to say how wonderful it was to find a simple, easy-to-use policy generator. Keep it up guys!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Theresa L.",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T01:24:05.000Z",
          "Titre": "I'd give 10 stars if I could",
          "Contenu": "I had the pleasure of working with Max from TermsFeed, and I couldn't be more impressed with the level of support and dedication he provided. Max went above and beyond to ensure that we received timely assistance, which was crucial for our app approval process with Google. His professionalism and expertise were evident throughout our interactions, and he made the entire process seamless and efficient. I highly recommend TermsFeed team for their exceptional service and commitment to their clients. Thank you, Max, for your outstanding support!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T06:37:33.000Z",
          "Titre": "Simple process to get documents",
          "Contenu": "Simple questions to ensure correct information is in your required documents."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CJ",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T01:24:50.000Z",
          "Titre": "Easy to Use and Friendly for Individuals",
          "Contenu": "Termsfeed was easy to use, understand, and quick. Was setting up a website as an independent solo blogger so Termsfeed's system was perfect for someone like me (I REALLY appreciate that the form asks if you're a company or an individual. Most others, what I found, don't bother with that distinction)."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "LadyE Rose",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T00:43:12.000Z",
          "Titre": "Awesome!",
          "Contenu": "Perfect! I read the clauses just to get an understanding of the offers, and it is digestible. It gives a sense of transparency to website users where they understand the terms regulating it.It's worth the investment, but a lower Privacy Policy would be appreciated in the future."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T21:56:17.000Z",
          "Titre": "I will definitely use TermsFeed again.",
          "Contenu": "I now realize how great this service is. TermsFeed provided me with exactly what I was looking for in terms of privacy policy and TOC documents for my client's online business. I will definitely use TermsFeed again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T21:14:33.000Z",
          "Titre": "Termsfeed had exactly what I needed for…",
          "Contenu": "Termsfeed had exactly what I needed for my website, service was easy to navigate and download."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Twiin Liife",
          "Nb_Reviews": 2,
          "Date": "2023-03-17T23:12:17.000Z",
          "Titre": "Extremely easy to customize and…",
          "Contenu": "Extremely easy to customize and utilize. We have a small start up online clothing store and we wanted to make sure we were compliant with the most up to date privacy policy available to protect our customers."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "CanRank Marketing",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T17:17:44.000Z",
          "Titre": "Privacy Policy Generator",
          "Contenu": "We emailed TermsFeed with some questions regarding generating a Canadian privacy policy for a client and they responded quickly with simple, great advice which made generating the policy easy and efficient. Beyond that, when we had a bit of trouble with the verification process at payment, they provided exceptional service and went above and beyond. We will recommend TermsFeed to all of our clients for their privacy policy needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T21:12:27.000Z",
          "Titre": "Simple process",
          "Contenu": "Simple process, walks you through each question and then my documents are ready."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T15:35:32.000Z",
          "Titre": "Easy to use.",
          "Contenu": "Easy to use and navigate. The questions used for building the documents are pertinent and concise. The pricing for each option is clear. I am confident these forms are compliant for my needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SiliProducts LLC",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T17:01:47.000Z",
          "Titre": "Super easy to use.",
          "Contenu": "Super easy to use.The app guided me through a bunch of questions that I wouldn't have known how to answer in order to figure out what I needed to include in my privacy policy for my website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Bird",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T02:51:13.000Z",
          "Titre": "Awesome Service!",
          "Contenu": "Max was great to deal with. Quick responses, helped me achieve what I was looking for. Went above and beyond what he needed to do for the best customer satisfaction. Thanks again!"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "liquidocelot",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T23:47:23.000Z",
          "Titre": "TermsFeed Review",
          "Contenu": "I recently enjoyed using the services provided by TermsFeed. The standard of their service and customer attention truly amazed me. They gave me a comprehensive Terms and Conditions agreement that was specifically tailored to meet my requirements. In addition, they provide step-by-step instructions that take you through the entire procedure, making it simple to comprehend and control. The document's ability to be customised to my company's specific needs is its best feature. I wholeheartedly urge anyone in need of a trustworthy and excellent Terms and Conditions agreement to use TermsFeed's services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Megan Dunn",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T16:39:49.000Z",
          "Titre": "Great Proactive Service",
          "Contenu": "The User Terms of Agreements wasn't exactly what I was wanting. TermsFeed reached out to me to see how they could solve my issues. They were very proactive, and client centered. Great service!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Andrew Lloyd Hughes",
          "Nb_Reviews": 4,
          "Date": "2023-03-31T15:48:02.000Z",
          "Titre": "Excellent company and service!",
          "Contenu": "Excellent, so simple to use and unlike others, it’s only a one off payment. Had the pleasure in dealing with Max from the company with a query, he was so helpful and quick too. Great company. Looked at so many others, glad I found these guys"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T00:27:55.000Z",
          "Titre": "Most was about large companies.almost…",
          "Contenu": "Most was about large companies.almost useless for small company and way too expensive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyler Boudreau",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T05:55:58.000Z",
          "Titre": "Tried another provider first...",
          "Contenu": "Tried another provider before TermsFeed and bailed. TermsFeed did exactly what I needed to do in a way that's easy to manage. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T03:07:29.000Z",
          "Titre": "Using the website to generate my privacy policy",
          "Contenu": "Using the website to generate my privacy policy was pretty straight forward. I had to get clarification on a couple of items, but that really was related to my newness to all of this!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer SusiV",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T02:22:24.000Z",
          "Titre": "Quick, simple, all-inclusive",
          "Contenu": "As long as you know before selecting what you need, the terms are easy to set, and the list of privacy terms provided is broadly inclusive.  It was a breeze to gather and post."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Neuza Gomes Pereira",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T10:23:29.000Z",
          "Titre": "Straightforward to use",
          "Contenu": "It is a very straightforward application. It is very user-friendly, and the content generated is of a high standard. The content is also straightforward to download."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lyn Barrett",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T06:34:30.000Z",
          "Titre": "Easy as Pie",
          "Contenu": "It was easy for TermsFeed to generate a privacy policy based on the questions they asked and the answers I gave. I especially like the one-time fee."
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Farzana Asim",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T01:55:43.000Z",
          "Titre": "Exemplary Legal Documentation Solutions from TermsFeed",
          "Contenu": "Recently engaged with TermsFeed for our privacy policy, terms and conditions, and disclaimer needs. I must say, their service was exemplary. The team displayed meticulous attention to detail, tailoring each document to fit our specific requirements. Their commitment to upholding legal and privacy standards truly stands out. The timely delivery and professionalism throughout the process were impressive. I highly recommend TermsFeed to any business or individual seeking comprehensive legal documentation solutions."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Ceyhan Karacan",
          "Nb_Reviews": 2,
          "Date": "2023-07-04T09:32:24.000Z",
          "Titre": "Very efficient",
          "Contenu": "It’s very easy and cost effective if you need standard documents! I use it for all my sites unless I need a specialized documentation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T16:11:09.000Z",
          "Titre": "It was easy to get the Privacy Policy…",
          "Contenu": "It was easy to get the Privacy Policy made, and when I had trouble paying because of a glitch Max made it very easy!"
        },
        {
          "Note": 5,
          "Lieu": "ZM",
          "Pseudo": "Justine Chola",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T07:27:31.000Z",
          "Titre": "It made my work very easy. Thank you for your candid support",
          "Contenu": "When I was setting up my app, Google asked me to include a Policy Document which I gladly did with the help of your company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T18:53:21.000Z",
          "Titre": "Nonprofit policy",
          "Contenu": "The process was straight forward and I was able to generate the privacy policy and terms and conditions I needed for a nonprofit website."
        },
        {
          "Note": 5,
          "Lieu": "CY",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T16:42:54.000Z",
          "Titre": "The company does exactly what it says…",
          "Contenu": "The company does exactly what it says on the tin - very easy to use and customise to our requirements. Happy customer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug Lippincott",
          "Nb_Reviews": 2,
          "Date": "2023-06-25T14:19:30.000Z",
          "Titre": "Minimal work and money for maximum…",
          "Contenu": "Minimal work and money for maximum results.  Couldn't be happier.  html copied into Able Commerce page and formatted perfectly."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Paul Grogan and Associates",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T13:51:39.000Z",
          "Titre": "Really quick",
          "Contenu": "Really quick, accurate way to set up a policy document with all the information relevant to my needs as an SME"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T01:58:44.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use and modify to fit our website's needs.  Very affordable solution.  It's exactly what we needed."
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "Tanya Smith",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T05:48:12.000Z",
          "Titre": "TermsFeed - Exceptional Service !",
          "Contenu": "Everything was straightforward and a very hassle free experience. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T09:41:36.000Z",
          "Titre": "Never thought it would be this easy",
          "Contenu": "Never thought it would be this easy to generate my terms and conditions. Will definitely recommend TermsFeed"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "ftglass",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T06:00:40.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. Quick to establish, process and deliver."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jeff C",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T17:30:10.000Z",
          "Titre": "Take the time to know what you need",
          "Contenu": "1. Flexibility- can use as much or little as need at the moment2. One time price3. Easy to understand process and edit or change your mind at any time"
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Ali Boshehry",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T15:36:50.000Z",
          "Titre": "Amazing service and amazing response",
          "Contenu": "the team was able to responde promptly and resolve my issue. Highly appreciate the service and highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T22:24:40.000Z",
          "Titre": "Easy and logical from start to finish"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Krista Conlon",
          "Nb_Reviews": 2,
          "Date": "2023-08-01T16:45:06.000Z",
          "Titre": "The website was easy to navigate and…",
          "Contenu": "The website was easy to navigate and provide valuable information for free or low cost!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paula Orr",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T03:21:43.000Z",
          "Titre": "Thank you for keeping it simple",
          "Contenu": "I'm not the brightest person on the computer so going to TermsFeed I was a bit nervous but once I got there I was actually a bit relieved because it wasn't the nightmare I thought it was gonna be while trying to find my way around and getting what I needed."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Andy Parker",
          "Nb_Reviews": 31,
          "Date": "2023-04-16T22:43:00.000Z",
          "Titre": "Very comprehensive terms created within…",
          "Contenu": "Very comprehensive terms created within minutes.Great value for money and easy to use."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-01T22:37:13.000Z",
          "Titre": "All good",
          "Contenu": "All good, had document up and loaded in good time, and payment done without problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Business Owner",
          "Nb_Reviews": 2,
          "Date": "2023-05-08T20:36:45.000Z",
          "Titre": "Max and team are excellent",
          "Contenu": "Max and team are excellent, very responsive.  They are constantly improving the services and products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T15:01:52.000Z",
          "Titre": "Very easy to use",
          "Contenu": "Very easy to use and received my document much faster than anticipated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T22:53:17.000Z",
          "Titre": "Easy to use and affordable",
          "Contenu": "The software was easy to use and affordable. The ability to have an embedded code was a bonus."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erica Sails",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T14:28:47.000Z",
          "Titre": "Customer service was great",
          "Contenu": "Customer service was great! Max helped answer my questions and got me to the right products I needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ed",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T11:09:37.000Z",
          "Titre": "Beats trying to write my own privacy policy",
          "Contenu": "Relatively inexpensive, and beats trying to write my own privacy policy. I appreciate the checkboxes for easily listing common integrations like google analytics, but there should be more of them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T01:13:08.000Z",
          "Titre": "Just crushed it",
          "Contenu": "Just crushed it, I mean TermsFeed really gave it a good rogering. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T16:08:27.000Z",
          "Titre": "It was simple",
          "Contenu": "It was simple, straightforward. If you answer simple and direct questions it generates your terms and conditions almost instantaneously."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T05:32:21.000Z",
          "Titre": "easy to use",
          "Contenu": "easy to use. will continue to use in the future.  Learned about this from youtube"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Lacroix",
          "Nb_Reviews": 2,
          "Date": "2023-06-10T21:31:35.000Z",
          "Titre": "I really appreciate this service…",
          "Contenu": "I really appreciate this service because I needed a terms and conditions as well as a privacy document for my website and they walked me through it and these documents appear to cover all the bases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T11:48:00.000Z",
          "Titre": "Great product simple and straight…",
          "Contenu": "Great product simple and straight forward pricing."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T15:33:37.000Z",
          "Titre": "So Easy to Use",
          "Contenu": "Very easy to navigate and get the policies you need for your website.Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "Shanny",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T14:06:12.000Z",
          "Titre": "Max was very quick with his responses",
          "Contenu": "Max was very quick with his responses, clear, thorough and very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-07-29T03:44:51.000Z",
          "Titre": "Menu was very clear",
          "Contenu": "Menu was very clear. I immediately found what I was looking for."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T11:10:21.000Z",
          "Titre": "Easy to use and effective."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Edrod",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T20:19:26.000Z",
          "Titre": "The policy generators are easy to…",
          "Contenu": "The policy generators are easy to understand and to complete, job done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheri",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T19:00:44.000Z",
          "Titre": "Glad I did it!",
          "Contenu": "It was so easy to use and not too expensive and no monthly contract!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marc - Texas Premier Realty",
          "Nb_Reviews": 2,
          "Date": "2023-10-19T19:44:26.000Z",
          "Titre": "Super easy to get my Terms created."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Alexandra P.",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T15:22:02.000Z",
          "Titre": "It was so easy to set everything up",
          "Contenu": "It was so easy to set everything up and without so much technical knowledge I made it wright! it was amazing! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "CY",
          "Pseudo": "Marian",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T12:08:49.000Z",
          "Titre": "Fast Terms for a website",
          "Contenu": "I could get a draft for my website's terms and conditions very fast."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T21:51:09.000Z",
          "Titre": "Great experience and one-time purchase…",
          "Contenu": "Great experience and one-time purchase is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "L. Ramsey Designs",
          "Nb_Reviews": 2,
          "Date": "2023-09-09T16:27:21.000Z",
          "Titre": "Easy to navigate",
          "Contenu": "Easy to navigate, pricing up front."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mat C.",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T18:52:57.000Z",
          "Titre": "Very helpful",
          "Contenu": "Very helpful! Makes some very complicated issues much easier to comprehend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff L",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T01:31:01.000Z",
          "Titre": "I found the process to be very user…",
          "Contenu": "I found the process to be very user friendly and efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Crystal Plus",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T19:37:58.000Z",
          "Titre": "Very prompt!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T05:34:01.000Z",
          "Titre": "Very easy to use",
          "Contenu": "Very easy to use and the privacy policy created was very thorough."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Calix",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T13:37:24.000Z",
          "Titre": "Good i like it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T11:22:05.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, support answered all questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T16:39:24.000Z",
          "Titre": "Super easy to use and did exactly what…",
          "Contenu": "Super easy to use and did exactly what I was hoping for."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T16:32:10.000Z",
          "Titre": "One of the best Privacy Policy and T&C…",
          "Contenu": "One of the best Privacy Policy and T&C tools."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig McElroy",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T05:22:53.000Z",
          "Titre": "Great service",
          "Contenu": "Great service and did a great job on my terms and conditions."
        },
        {
          "Note": 5,
          "Lieu": "DO",
          "Pseudo": "Virdis",
          "Nb_Reviews": 2,
          "Date": "2023-08-13T02:55:33.000Z",
          "Titre": "The service is very fast",
          "Contenu": "The service is very fast. It is incredible!"
        },
        {
          "Note": 5,
          "Lieu": "DZ",
          "Pseudo": "Omar farouk",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T19:09:23.000Z",
          "Titre": "It was a good experience and the best…",
          "Contenu": "It was a good experience and the best is the ease of use"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack Jennings",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T16:30:41.000Z",
          "Titre": "Simplicity and speed of generating the…",
          "Contenu": "Simplicity and speed of generating the relevant documents; good reviews helped to provide confidence in the product quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T18:38:16.000Z",
          "Titre": "Experience was simple and cost…",
          "Contenu": "Experience was simple and cost effective. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T23:59:11.000Z",
          "Titre": "I was in a pinch and didn’t know what…",
          "Contenu": "I was in a pinch and didn’t know what to do on my own, this helped so much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-02-27T01:03:39.000Z",
          "Titre": "Helpful",
          "Contenu": "The TermsFeed team is always helpful."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T11:26:51.000Z",
          "Titre": "Good for other locale user."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Svitlana",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T15:18:04.000Z",
          "Titre": "Great time and mind saving tool",
          "Contenu": "Very easy, time saving and appropriate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ursula Gatchell",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T03:42:27.000Z",
          "Titre": "easy to follow",
          "Contenu": "easy to follow, pay only for what you need"
        }
      ]
    }
  ]
}