{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "text-em-all.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nikki",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T19:37:27.000Z",
          "Titre": "It worked great",
          "Contenu": "It worked great!  No hiccups at all"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Villa",
          "Nb_Reviews": 2,
          "Date": "2021-02-02T01:34:35.000Z",
          "Titre": "At first it seemed like a decent…",
          "Contenu": "At first it seemed like a decent company - but trying to draft a general email for responding to my customers became a nightmare.  All but one of my emails (this is the text-em-all side of the business) was rejected as spam by THEM - even though my customers reached out to me first and I was trying to respond to them all at once to save time.  That's all fine and I can accept that they do things a certain way, but on my 4th attempt to rewrite an email to fit their high standards - I received an email that I had cancelled my account. It was their way of parting ways with me after 2 hours.  They also kept my $90 dollars.  I had to dispute it with American Express to cover myself.  I clicked on an ad and ended up with them, but since then I've found better companies that are easier to deal with.  Don't waste your time or throw your money on them - It's amateur hour over there."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joanni Barreto",
          "Nb_Reviews": 1,
          "Date": "2019-04-17T14:01:41.000Z",
          "Titre": "Subscription of 50 phone number a month…",
          "Contenu": "Subscription of 50 phone number a month doesn't allow you to reach 50 number various time in a month."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cali",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T17:24:15.000Z",
          "Titre": "Not customer focused"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bob Gehman",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T17:13:12.000Z",
          "Titre": "We have been using Call-em-All for many years but...",
          "Contenu": "We have been using Call-em-All for several years and found them to be stable and reliable until about a year ago - with some of their enhancements and upgrades, the service has degraded to the point where we are no longer confident that we can continue to use the service in the future and are looking at alternatives.  Some of the issues may been internal to our own network security but we find the service to be slow, inadequate for legacy browsers and incapable of negotiating through changes to DST/EST. We also have experienced issues with permanently removing ex-employees from broadcasts.  When we work with the Call-Em-All technical staff, they are pleasant and quick to respond to our inquiries but overall, we are dissatisfied with the changes to their network as a result of their enhancements."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nathaniel Beard Jr",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T23:53:34.000Z",
          "Titre": "Only 320 Character per text"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tiffany Rappel",
          "Nb_Reviews": 1,
          "Date": "2019-04-16T19:51:59.000Z",
          "Titre": "I find the lag when we get mass replies…",
          "Contenu": "I find the lag when we get mass replies to hinder the needs of our business. It will post replies to the wrong text, or when scrolling through click the text to show it was read when actually it was not. When having to process through several messages Call em all can not keep up and we have to continuously reboot the program so that we can click on a message we need to review."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Court R",
          "Nb_Reviews": 2,
          "Date": "2018-12-12T05:59:50.000Z",
          "Titre": "Some malfunctions",
          "Contenu": "The call system does occasionally glitch. About one out of every 4 calls that I place through Call Em All does not correctly go through to each number on the list. But usually it works and it seems like a good price for the convienent service. It is easy to use their platform and navigate their system."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Woodraille Gilchrist",
          "Nb_Reviews": 1,
          "Date": "2019-06-06T15:49:32.000Z",
          "Titre": "Billing Feature",
          "Contenu": "Sometimes the pay feature doesn't work when you want to add credits. I was unable to add or change my card."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ryan Reyes",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T20:12:54.000Z",
          "Titre": "Better App for Phones",
          "Contenu": "Wish the app for cellphones was capable of letting me read \"conversations\" and also respond through my phone. I had to always go into my laptop or phone web browser."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christine",
          "Nb_Reviews": 1,
          "Date": "2019-05-13T16:47:04.000Z",
          "Titre": "Always works well for what I need."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric Miles",
          "Nb_Reviews": 1,
          "Date": "2018-11-27T04:01:10.000Z",
          "Titre": "I would have rated it higher but for…",
          "Contenu": "I would have rated it higher but for small churches with 100 or less members, the cost of basically 10 cents per message can be costly"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Diane Price",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T20:32:55.000Z",
          "Titre": "I would like the ability to make my…",
          "Contenu": "I would like the ability to make my text messages longer than the current constraints."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hattiesburg",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T16:37:46.000Z",
          "Titre": "Would have given more stars before the…",
          "Contenu": "Would have given more stars before the \"upgrade\" to the website"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kasey",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T17:04:45.000Z",
          "Titre": "Our non-profit organization uses this…",
          "Contenu": "Our non-profit organization uses this service all of the time. It is such a fast and efficient way to communicate to our ticket holders about important things they need to know before a concert, or to let them know any last minute changes. We use both the text occasionally--but mostly the voice message. The site is easy to use and straightforward. My only comment is that I would love to be able to create messages WITHOUT the contacts attached and keep as a draft until I am ready to add them. As in, adding the contact list being the last thing besides payment. That way, I simply would need to add it and make any scheduling adjustments before it sends."
        },
        {
          "Note": 4,
          "Lieu": "RO",
          "Pseudo": "Patrick McLaughlin",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T23:07:44.000Z",
          "Titre": "More features and improve the mobile app",
          "Contenu": "Quick Response made the experience good but as far as the software, there is no way to schedule to same text on multiple days quickly is disappointing. We use the platform to communicate woth company employees and ths would be a terrific benefit to be able to do. Also the mobile ap is dissapointing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nickey Mott",
          "Nb_Reviews": 1,
          "Date": "2019-04-16T12:22:37.000Z",
          "Titre": "I really love this program",
          "Contenu": "I really love this program. It definitely allows us to be in touch with our members who sign up for text alerts. The only downside is making our messages fit into the 160 characters without being charged another credit. I'd like to see that extended just a little."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tacjc Triumphant",
          "Nb_Reviews": 1,
          "Date": "2019-04-29T14:09:10.000Z",
          "Titre": "Great service except sometimes mesgs…",
          "Contenu": "Great service except sometimes mesgs aren't delivered at all or they are broken up into pieces and delivered into shambles.Call-em-all should have some sort of agreement with the cellphone companies so we don't have these problems when we use the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Norman",
          "Nb_Reviews": 1,
          "Date": "2019-05-07T12:12:25.000Z",
          "Titre": "Call-em-all has works great",
          "Contenu": "Call-em-all has worked great for our church to keep our members updated on prayer requests, death notifications, and reminders for special events! Call-em-all integrates well with our church membership software Church Community Builder to make mass phone calls to our members. We haven’t used the text message part yet but we plan to in the near future. The only draw back that we’ve had with Call-em-all is that the church membership software that we have doesn’t work on the app like it does on the website. However that may be an issue on our side because we’re using a legacy version of our software. I highly recommend that you give call-em-all a try! I think that you’ll be well pleased!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kristina Bolton",
          "Nb_Reviews": 1,
          "Date": "2019-08-27T15:05:50.000Z",
          "Titre": "I like the software",
          "Contenu": "I like the software. It is easy to use and pretty straight-forward with how to move between steps. I wish that on the contact list, that contacts with more than one number could be listed as the same contact instead of separately and that a number can be prioritized over the others. Otherwise great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lance Douglas Gutierrez",
          "Nb_Reviews": 1,
          "Date": "2019-04-19T01:22:59.000Z",
          "Titre": "A Great Service for Church Communications",
          "Contenu": "I am definitely pleased that this service is available.  It works well for communicating within a church family.  There are just a few minor things I would change if I could, but these things wouldn't keep me from being a user of the system."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dionne L Morris",
          "Nb_Reviews": 1,
          "Date": "2019-09-02T14:09:22.000Z",
          "Titre": "Very easy to use",
          "Contenu": "Very easy to use.  Would have given 5 stars had the ability to set up call for later be simpler.  If would be better if the same code number was associated with our account and used each time over a new number being issued each time.  This would make it easier for partners to use Call-Em-All"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Court R",
          "Nb_Reviews": 2,
          "Date": "2019-04-22T16:57:31.000Z",
          "Titre": "Easy to use, only occasional issues",
          "Contenu": "Occasionally my people will express that the recorded call did not come through correctly either live person or voicemail. However, most of the time it works very well. Their online and mobile format is easy to use. Calls are easy to record. I like this system."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary Cathey",
          "Nb_Reviews": 1,
          "Date": "2018-12-05T18:56:21.000Z",
          "Titre": "Overall Good",
          "Contenu": "Have had some reporting received call without a message, but have not been able to prove this.  Also sometimes instructions are a bit confusing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robbie Smith",
          "Nb_Reviews": 1,
          "Date": "2018-12-04T22:18:00.000Z",
          "Titre": "Its a great service for the money and…",
          "Contenu": "Its a great service for the money and are happy with the service.The one issue that i dont like is if i keep redoing the call...after the 10th try it says i have reached my limit and i have to recall and start over.  When we started the service in 2015...we could keep redoing the message until i was ready to send it unlimited times."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CHAD HARGRAVE",
          "Nb_Reviews": 1,
          "Date": "2019-12-04T01:00:24.000Z",
          "Titre": "GRAND KNIGHT",
          "Contenu": "THIS SYSTEM IS THE BEST WAY TO COMMUNICATE IMOPRTANT EVENTS THAT ARE COMMING UP. THIS IS A GREAT ASSET TO ANY ORGINIZATION TO GET THERE MESSAGE OUT TO ITS MEMBER OR ASSOICATES."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brookdale Atrium Way",
          "Nb_Reviews": 1,
          "Date": "2019-10-07T16:27:06.000Z",
          "Titre": "We are a retirement community and…",
          "Contenu": "We are a retirement community and Call-Em-All has been a great way to communicate with our residents and families about up-coming events. Since we are located in FL and deal with hurricanes, it has proved invaluable in updating our families about hurricane preparations, plans of action, etc.  I highly recommend this service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Helen Ruby",
          "Nb_Reviews": 1,
          "Date": "2019-04-19T14:15:36.000Z",
          "Titre": "I like being able to notify our members…",
          "Contenu": "I like being able to notify our members using call em all, but I find it frustrating that the format changes and I just figure out how to choose who I send messages too and then I can no longer do it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nicholas Hanges",
          "Nb_Reviews": 1,
          "Date": "2019-04-17T16:59:28.000Z",
          "Titre": "Great product and works well for…",
          "Contenu": "Great product and works well for communicating to our church. I wish they had a stand alone mobile app and integrations with Realm/ACS."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LaChelle",
          "Nb_Reviews": 1,
          "Date": "2019-07-12T17:16:07.000Z",
          "Titre": "Its great helps communicate with staff",
          "Contenu": "Its great helps communicate with staff. Wish we can use it for emails as well but still great communication tool."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen Haskell",
          "Nb_Reviews": 2,
          "Date": "2019-05-31T15:54:46.000Z",
          "Titre": "Call-Em-All saves me so much time",
          "Contenu": "Call-Em-All saves me so much time. I gave it a 4 star because I wish texts showed my number so people could respond back. However, I understand why it's this way."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Heather Ross",
          "Nb_Reviews": 1,
          "Date": "2018-12-05T14:17:05.000Z",
          "Titre": "Call-Em-All is a great tool",
          "Contenu": "Call-Em-All is a great tool. It is very user-friendly. The feature for text messaging seems a little intimidating at first glance."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rayesha Twilley",
          "Nb_Reviews": 2,
          "Date": "2019-07-16T22:17:33.000Z",
          "Titre": "Love Call Em All I'm a Playwright and…",
          "Contenu": "Love Call Em All I'm a Playwright and it's a great way to connect with my cast and keep them inform with any updates!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keeana",
          "Nb_Reviews": 1,
          "Date": "2019-04-15T15:05:08.000Z",
          "Titre": "Great Product",
          "Contenu": "Easy to use format. Could use some improvements in some areas but overall a good system to use to contact multiple people at one time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "secy0272 secy0272",
          "Nb_Reviews": 1,
          "Date": "2019-09-30T21:35:40.000Z",
          "Titre": "My experience was good and I have…",
          "Contenu": "My experience was good and I have little to say.  If I had anything, it would be that it remembered my user id on my computer"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brenda Kay Perry",
          "Nb_Reviews": 4,
          "Date": "2019-04-19T13:42:27.000Z",
          "Titre": "A good tool to have",
          "Contenu": "It's a good means in getting important message out to members."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gerry Moriarity",
          "Nb_Reviews": 1,
          "Date": "2019-04-25T22:06:15.000Z",
          "Titre": "Call em All is fantastic",
          "Contenu": "Call em All is fantastic! It makes getting the word out so simple."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry Jobe",
          "Nb_Reviews": 1,
          "Date": "2019-04-17T14:42:17.000Z",
          "Titre": "You should specify which timezone when…",
          "Contenu": "You should specify which timezone when setting times."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pamela Sheridan",
          "Nb_Reviews": 1,
          "Date": "2020-10-17T20:33:12.000Z",
          "Titre": "I have not been getting credit for…",
          "Contenu": "I have not been getting credit for every time I play..... what is up with that"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mollie White",
          "Nb_Reviews": 1,
          "Date": "2019-06-07T19:02:17.000Z",
          "Titre": "Have been extremely satisfied with the…",
          "Contenu": "Have been extremely satisfied with the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessica Paul",
          "Nb_Reviews": 1,
          "Date": "2018-12-03T17:39:15.000Z",
          "Titre": "Perfect medication reminder for elderly person",
          "Contenu": "It was just what I needed to set up medication reminds for my grandmother who was 102. The only downfall was that I had to manually type in each and every call even though they were daily repeats of the same message. At 4 calls a day...that meant spending over 2 hours setting up 120 calls each month. There needs to be a way to set up the same message to the same number over several days all in just one step."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles Thomas",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T22:41:23.000Z",
          "Titre": "We use call em all to distribute…messages to water users",
          "Contenu": "We use call em all to distribute messages to 100 residences in a rural water association. It transforms what would otherwise be an endless and thankless task of notifying people about interruptions in water service into a simple matter of maintaining a database of phone numbers, and preparing recorded voice messages. Once set up, it is intuitive and easy to manage."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Cussen",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T18:40:11.000Z",
          "Titre": "Everything works great -- any problems…",
          "Contenu": "Everything works great -- any problems were always handled quickly and efficiently - I wish they would send a reminder when credits reach a set pow point so that any additional credits could be added in a timely fashion.But - all said and done - when a shortage occurred additional credits were added quickly after contacting them"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jeanne lance",
          "Nb_Reviews": 1,
          "Date": "2018-12-04T00:58:19.000Z",
          "Titre": "I appreciate all that this service has…",
          "Contenu": "I appreciate all that this service has to offer.  There were times when the folks I sent messages to didn't get them but for the most part they did.  Also the repeat messages helped to let the people hear it again so they could get the cut off part of the message when they first picked up their phone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roger Carson",
          "Nb_Reviews": 2,
          "Date": "2018-11-26T21:24:22.000Z",
          "Titre": "Not totally pleased with latest update…",
          "Contenu": "We have been using Call-Em-All for quite some time, beginning with the IL Masonic Grand Lodge.  The system has been changed over the years, but we have not been thoroughly pleased with the latest update.  The commands can get confusing and some recipients do not stay on the line long enough with they are retrieving theirs via voice mail.  We have received calls saying that only part of the message was received, when they should have stayed on listening until it repeated again.  Also have not been overly pleased with the latest update to placing the original message."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "OSF",
          "Nb_Reviews": 3,
          "Date": "2018-12-03T22:14:25.000Z",
          "Titre": "Great product and service",
          "Contenu": "Great product and service.  It would be nice to have administator's rights so that other assigned users cannot change certain settings.  I use this in a healthcare setting, so this is not 100% conductive to healthcare, however it is close to."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jon Kolenchak",
          "Nb_Reviews": 5,
          "Date": "2018-11-26T17:56:21.000Z",
          "Titre": "Calls are sometimes truncated and/or…",
          "Contenu": "Calls are sometimes truncated and/or garbled.I also find the service a bit pricey when compared to the ease of sending a group text message from my own carrier. It's free."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marsha Brown",
          "Nb_Reviews": 1,
          "Date": "2018-11-29T16:53:17.000Z",
          "Titre": "Broadcast Code",
          "Contenu": "Don't like that you have to enter a \"code\" everytime you want to do a broadcast, you have to have to be at the computer to make a broadcast. To inconvenience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul M.",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T17:03:56.000Z",
          "Titre": "Good, but Glitchy",
          "Contenu": "A good tool, and very well-received by our church. Administratively, it has a few glitches, in my opinion. 1) There is no longer a character counter for texts being drafted. Instead, if the character limit is exceeded, the system notifies author that long texts may be fragmented. Reducing characters eventually causes the warning to disappear, giving one the impression that the message will not be fragmented. However, many texts get fragmented without warning. This is very annoying. Bring back the real-time character counter. 2) When viewing Contacts, only 5 or 6 are visible in a panel at one time. Choosing the 10 or 25 option does not make contacts visible in panel without scrolling. I would like to be able to view 20-25 contacts in one screen. 3) Broadcast time selection defaults to Immediately, which is never the case for me. I fear that this could cause a broadcast to go out prematurely."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 5,
          "Date": "2018-11-26T20:29:30.000Z",
          "Titre": "My only suggestion would be that when a…",
          "Contenu": "My only suggestion would be that when a call doesn’t go through or a busy signal is encountered, that it should be reattempted in 1 or 2 hours."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kisha Robertson",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T20:24:19.000Z",
          "Titre": "Good platform for disseminating group…",
          "Contenu": "Good platform for disseminating group information. Very user-friendly...just wish there was the band-width available to save more recordings."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Olivet Gospel Church",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T16:32:45.000Z",
          "Titre": "Call-em-all is simple to use with good features",
          "Contenu": "Call-em-all is simple to use. Creating broadcasts for voice, text, or both is simple. The integration with our church database reduce the overhead of managing groups since we create the groups in the database and connect directly to those groups from within call-em-all. One of the features that has proven valuable to us, is the graphical status display, where we can see who answered calls, which ones went to voice mail, and the ones that failed. Having the names of the recipients listed helps us keep our congregation information up-to-date. The next feature that is impressive, is seeing which phone numbers can receive text messages and which ones will not. Call-em-all relieve the headache of guessing and we can take advantage of text groups and call-only groups. The one feature we would like, and from recent communications, we understand will come fairly soon, is MMS messaging. Overall, we are having a good experience with call-em-all since we subscribed about two months ago."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "warren",
          "Nb_Reviews": 2,
          "Date": "2018-11-26T18:03:12.000Z",
          "Titre": "A bit of a struggle to fully understand…",
          "Contenu": "A bit of a struggle to fully understand the 'list' umbering. Did have a 'hang' experience although the process completed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Darla Van Rosendale",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T16:47:37.000Z",
          "Titre": "Call Em All works good for us to…",
          "Contenu": "Call Em All works good for us to communicate with our residents and staff when we need to send a message to a large group of people."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Victoria",
          "Nb_Reviews": 2,
          "Date": "2018-12-03T18:04:17.000Z",
          "Titre": "Call em all is a great resource",
          "Contenu": "Call em all is a great resource and I appreciate it very much.Only problem I have ever had is making sure the broadcast was saved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barbara Jordan",
          "Nb_Reviews": 1,
          "Date": "2018-12-03T17:37:29.000Z",
          "Titre": "It is very good but I wish there was a…",
          "Contenu": "It is very good but I wish there was a way to type in all the phone numbers on one page rather than hitting add to all the time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Children Family Services DHS",
          "Nb_Reviews": 1,
          "Date": "2018-11-27T16:45:58.000Z",
          "Titre": "Testing exercise for management",
          "Contenu": "Some recipients reported that the message started five seconds before the end. Most recipients did receive the whole message."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Onin AUST",
          "Nb_Reviews": 1,
          "Date": "2018-12-03T18:18:53.000Z",
          "Titre": "Texting and Mobile app limitations",
          "Contenu": "There are some limitations to texting and the mobile app but overall provides the basic functions needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lynn Yonts",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T16:38:47.000Z",
          "Titre": "It is a little too complicated",
          "Contenu": "It is a little too complicated. It would be nice if there were fewer steps to get to the broadcast."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sue Ellen Baye",
          "Nb_Reviews": 1,
          "Date": "2018-12-03T17:34:17.000Z",
          "Titre": "We are happy to use call em all",
          "Contenu": "We are happy to use call em all.  It serves as an excellent reminder for our local chapter events."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "michael willis",
          "Nb_Reviews": 1,
          "Date": "2018-12-03T21:21:49.000Z",
          "Titre": "The system sometimes will skip sequence…",
          "Contenu": "The system sometimes will skip sequence of actions. Otherwise I would give it a 5."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry Covey",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T16:40:49.000Z",
          "Titre": "Most of the time it works great",
          "Contenu": "Most of the time it works great. Sometimes only partial messages go through"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julia Garrett",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T18:23:49.000Z",
          "Titre": "2 Month Happy Customer",
          "Contenu": "Very user friendly and the price is reasonable. Has worked great for me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aaron Salazar",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T21:48:33.000Z",
          "Titre": "Easy to use interface",
          "Contenu": "Easy to use interface.  Customer service is professional and courteous."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Variety Guild",
          "Nb_Reviews": 1,
          "Date": "2018-12-03T17:27:14.000Z",
          "Titre": "Pretty good service",
          "Contenu": "Pretty good service.  Wish it wouldn't be so darned expensive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael  Cooter",
          "Nb_Reviews": 1,
          "Date": "2018-12-03T22:31:49.000Z",
          "Titre": "Like the program",
          "Contenu": "Like the program.  Looking forward when you can send a jpg file."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Star  City",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T16:38:15.000Z",
          "Titre": "Time was off last time i used it but…",
          "Contenu": "Time was off last time i used it but its been great otherwise."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dawn Horton",
          "Nb_Reviews": 1,
          "Date": "2018-12-04T17:12:36.000Z",
          "Titre": "It is a good inexpensive way to get a…",
          "Contenu": "It is a good inexpensive way to get a notification out there."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alpha Mu",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T21:03:08.000Z",
          "Titre": "The message keeps repeating even if…",
          "Contenu": "The message keeps repeating even if it's a live answer!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jane Dunn",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T16:18:36.000Z",
          "Titre": "Works well",
          "Contenu": "Works well.  Pretty easy to access and use.  Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Getsoian",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T19:28:21.000Z",
          "Titre": "Sometimes messages are cut short at the…",
          "Contenu": "Sometimes messages are cut short at the beginning."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Troop 906",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T16:26:53.000Z",
          "Titre": "Don’t like I can’t send out pics with…",
          "Contenu": "Don’t like I can’t send out pics with my texts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gene Menard",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T16:27:48.000Z",
          "Titre": "Great way to get messages to all…",
          "Contenu": "Great way to get messages to all members."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rafi Ahmed",
          "Nb_Reviews": 1,
          "Date": "2018-11-27T14:30:41.000Z",
          "Titre": "Ease of use and good customer service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer Lacher",
          "Nb_Reviews": 1,
          "Date": "2018-11-27T23:56:22.000Z",
          "Titre": "I occassionally experience glitches.",
          "Contenu": "I occasionally experience glitches."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Enterprise Alamo/National",
          "Nb_Reviews": 1,
          "Date": "2018-12-04T14:06:36.000Z",
          "Titre": "This is suitable for our needs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Todd Hilton",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T20:56:44.000Z",
          "Titre": "Works great for our church."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christy  Bollinger",
          "Nb_Reviews": 1,
          "Date": "2018-11-27T13:10:01.000Z",
          "Titre": "User Friendly",
          "Contenu": "Very user friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Church Secretary",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T17:48:58.000Z",
          "Titre": "Important Communication Tool",
          "Contenu": "This is a helpful tool that allows us to keep our congregation informed about current needs and events occurring in and around our church family."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Earnestine",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T16:16:37.000Z",
          "Titre": "System is easy to use",
          "Contenu": "System is easy to use, have the option to send messages via voice or text"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EP Music Min",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T15:53:14.000Z",
          "Titre": "Our ability to text and call our church…",
          "Contenu": "Our ability to text and call our church members in specific groups through the Community Church Builder integration is vital to our regular communications with our church members."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shanna",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T22:22:50.000Z",
          "Titre": "Very satisfied with this service",
          "Contenu": "Very satisfied with this service. Very easy to use. Have not had one issue. Been using text-em-all for almost 2 years to send out mass messages to over 100 employees."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HELEN",
          "Nb_Reviews": 4,
          "Date": "2023-10-17T05:58:37.000Z",
          "Titre": "Text-Em-All is a very reliable and…",
          "Contenu": "Text-Em-All is a very reliable and helpful company.I do robo calls for 2 clubs in my FL condo community. The calls are done when requested. The reports tell me which numbers were not reached and why.The customer service people are very willing to help and do so politely and patiently.Please do business with this excellent company.Helen, the condo caller from FL"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Human",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T16:23:28.000Z",
          "Titre": "Everything worked as expected!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HOLY TRINITY",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T08:09:47.000Z",
          "Titre": "Being advised of any new changes",
          "Contenu": "Being advised of any new changes; sending out messages as scheduled. I truly wish we had the ability to send more than 320 characters in the messages; suggestion,at least 350 characters per text message."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sue Smith",
          "Nb_Reviews": 1,
          "Date": "2019-04-24T14:40:43.000Z",
          "Titre": "Call-Em-All has been a great asset to…",
          "Contenu": "Call-Em-All has been a great asset to our church prayer chain notifications.  Most of our congregation receive by text message but our older members want voice messages.  Call-Em-All fits both these  needs perfectly.  It's very user friendly.  We are well pleased!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Swan Harbour Dell MHC",
          "Nb_Reviews": 1,
          "Date": "2019-04-18T13:43:25.000Z",
          "Titre": "As a property manager for three…",
          "Contenu": "As a property manager for three communities with over 300 residents, my staff and I have found Call-Em-All to be an invaluable tool. It has helped reduce costs of toner, paper, and logged hours which would otherwise be utilized passing out paper notices to everyone. Thank you for making my job easier!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard John Moore",
          "Nb_Reviews": 3,
          "Date": "2019-07-30T17:03:41.000Z",
          "Titre": "What a time saver for a small church…",
          "Contenu": "What a time saver for a small church with a one person staff. I can prepare encouraging messages in advance. When there is a prayer request, I can be assured that everyone gets the same message. Pastor Rich MooreEvangelical Covenant Church Sloan, IA"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Rowe",
          "Nb_Reviews": 1,
          "Date": "2019-04-15T14:48:19.000Z",
          "Titre": "Great, Personal Service and an Event Starter...",
          "Contenu": "The service is great and I have received many compliments from our congregation. We have greater turnouts for events because of reminders we can send. Group generated broadcasts lower listener burnout. Our prayer chain is now a team and we have increased our roll from 12 to 23 in the group! I believe this will increase over time! Options to broadcasts are convenient and you can even deselect certain people when you wish to plan a surprise birthday party! Reliable service and they have helped me whenever I needed help in a timely manner. Economical and convenience and I love the new mobile app! Keep up the great work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pat Broadstreet",
          "Nb_Reviews": 1,
          "Date": "2018-12-06T22:48:02.000Z",
          "Titre": "Flexible Call System",
          "Contenu": "It gives us a tool that allows us to keep in touch and keep informed all of our members in one call.  Being able to use it from anywhere or a cell phone really gives us flexibility.  The member can choose to opt out if calls are bothering them without contacting the office.  They can do it thru the call itself if they choose to stop them from coming."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laurie Langella",
          "Nb_Reviews": 1,
          "Date": "2019-10-08T14:23:07.000Z",
          "Titre": "Call-Em-All Saves the Day!",
          "Contenu": "This service is affordable, complete and easy to use.  We have used it mostly to contact employees about weather emergencies, but it also came through in a pinch when we were unexpectedly closed for the Presidential funeral last year...and we had a seminar planned for about 80 clients that evening.  We were able to contact them all in one fell swoop, and it saved the day!  I recommend Call-Em-All to anyone who needs a simple, cost effective communication tool."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer Norm Root",
          "Nb_Reviews": 2,
          "Date": "2019-10-07T15:50:49.000Z",
          "Titre": "consistant and a value",
          "Contenu": "Call em all consistently gets our messages to members and in both text and voice. We believe is is a quality value to the organization and the members.Thanks much..Norm RootCommandant Marine Corps LeagueNW Detachment 162Northvilke, MI"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debra Hill",
          "Nb_Reviews": 1,
          "Date": "2019-04-17T16:59:53.000Z",
          "Titre": "We have partnered with Call Em All for…",
          "Contenu": "We have partnered with Call Em All for more than 10 years.  We are able to communicate information about job opportunities to our employees within minutes.  This helps us to be more efficient and allows up to provide exceptional service to customers. Thank you Call Em All!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy Smith Mapp",
          "Nb_Reviews": 1,
          "Date": "2020-04-09T15:35:48.000Z",
          "Titre": "Very user-friendly and prompt followups…",
          "Contenu": "Very user-friendly and prompt followups on calls.  Call em all takes the frustration out of calling a large number of clients with a 30 sec message.  Its quick and easy to understand directions have kept me using this service for more than 5 years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samoset Church of God",
          "Nb_Reviews": 3,
          "Date": "2019-04-16T13:29:00.000Z",
          "Titre": "Awesome, inexpensive & Innovative",
          "Contenu": "Awesome, Inexpensive & Innovative!  They always send out our announcements in a timely fashion and streamline my workday.  Inexpensive - Good rate for all of the folks we keep in touch with.  Innovative - They keep updating their software and site to make it more user friendly and helpful to the consumer.  Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "VE",
          "Pseudo": "Bryan",
          "Nb_Reviews": 1,
          "Date": "2021-09-27T01:22:25.000Z",
          "Titre": "Muchas Gracias Volvere Prontoo",
          "Contenu": "One of the best websites in the world in terms of professionalism, skills and customer service. I bought the watch one day late, just 24 hours later it was shipped and delivered without any problem. Many thanks to Julia for the customer service and a big thank you to all the bullminers in general Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad",
          "Nb_Reviews": 3,
          "Date": "2019-04-17T14:28:30.000Z",
          "Titre": "This is a great communication tool to add to your toolbox",
          "Contenu": "This tool has made communicating with my organization members so much more efficient. I also love seeing the metrics too! For the price this app cannot be beat and I expect to be a long time customer. Although I haven't had to use their customer service very much, when i have called in they are very much on point. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julia Sewell Garrett",
          "Nb_Reviews": 1,
          "Date": "2019-04-23T01:24:50.000Z",
          "Titre": "Call-Em-All is Easy and Dependable",
          "Contenu": "I have been using Call-Em-All to send text alerts for my Live FaceBook Shows for several months.  It is so easy to use; it only takes a minute to broadcast and you can use a template that makes it even easier. They are VERY dependable. I have never had a problem; the text alerts always go out. But if you need assistance, they are always there to answer your questions. Very affordable and worth every penny."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gayle Giammarco",
          "Nb_Reviews": 1,
          "Date": "2019-04-17T18:07:46.000Z",
          "Titre": "The system works as advertised",
          "Contenu": "The system works as advertised.  It's easy to use and the reporting feature lets us know just what when on during the messaging.  Saves a lot of time during bad weather and our employees know what is happening."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "First Baptist Church",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T18:08:37.000Z",
          "Titre": "Easy!",
          "Contenu": "Text-Em-All is so easy to log on to and to use!  We use it whenever there is an important message for the congregation to hear and also to remind people of meetings."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2019-04-18T05:55:18.000Z",
          "Titre": "Give Call-Em-All a Try!",
          "Contenu": "We use Call-Em-All at our senior living community to promote special events to our residents and remind them of activities that they have signed up for. It is user-friendly and has improved our efficiency and resulted in increased attendance at our events. We have found it to be a very cost-effective resource that benefits both our residents and our staff. I encourage you to give Call-Em-All a try!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Clem Malot",
          "Nb_Reviews": 3,
          "Date": "2019-07-18T22:17:35.000Z",
          "Titre": "Ron, I need assistance.......",
          "Contenu": "Ron,I have been using the service for 7 months now and spoken with several other users. We are at a loss as to how to remove successfully the do not call folks and the invalid numbers. We generate our list from a Master list provided by the Grand Lodge of Pennsylvania. Do we need to edit that list? Thanks for your assistance.R. Clem Malotclem at pacodealliance dot com"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2019-04-17T17:10:31.000Z",
          "Titre": "The system overall has been a fantastic…",
          "Contenu": "The system overall has been a fantastic addition to our communication.  Managing over 85 drivers across the lower 48 states presented challenges to getting information to our drivers.   This completely solved our issues.   The technical support is top notch as well as the customer service.  I highly recommend using this tool!Joe CarusoSenior Logistics MangerRyder Integrated Logistics"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cathy Tracey Morrison",
          "Nb_Reviews": 1,
          "Date": "2019-04-17T00:11:02.000Z",
          "Titre": "This is a great company",
          "Contenu": "This is a great company!  Their service is affordable and their customer service is friendly, knowledgeable and very willing to help in any way they can.  This service has really improved the communication in our group and is easy to set-up and use (even if you are not computer savvy).  We LOVE it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 4,
          "Date": "2019-04-17T19:56:04.000Z",
          "Titre": "Great APP!",
          "Contenu": "I really really like this app! It is soooo helpful in assisting us to be able to correct or update info as we find messages that were not sent for any reason - and  we can find the reason too! I was able to make corrections before I sent the message so that I don't have wasted attempts/lost credits. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 4,
          "Date": "2019-04-17T19:51:57.000Z",
          "Titre": "Great App!",
          "Contenu": "I really really like this app! It is soooo helpful in assisting us to be able to correct or update info as we find messages that were not sent for any reason - and  we can find the reason too! I was able to make corrections before I sent the message so that I don't have wasted attempts/lost credits. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Felecia Rodgers",
          "Nb_Reviews": 2,
          "Date": "2019-04-20T15:19:13.000Z",
          "Titre": "Call-em-all",
          "Contenu": "This online app has worked great for our small church in keeping members aware of ongoing announcements.  We have used this app for more than 4 years and it is not something that we can do without."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marijoyce Campbell",
          "Nb_Reviews": 2,
          "Date": "2019-05-10T21:36:06.000Z",
          "Titre": "This is a very big help to our…",
          "Contenu": "This is a very big help to our organization.  Especially the break down of who get the message right away or voice message or if busy.  Will look for more updates and improvement that we may utilize."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "De Kei",
          "Nb_Reviews": 1,
          "Date": "2019-04-24T22:28:11.000Z",
          "Titre": "We trust Call Em All with our employee needed updates",
          "Contenu": "We trust Call Em All with our employee start dates and times. It's easy to use, and takes the work out of calling all our employees and trying to remember who we left messages with or need to try again. Thanks! We love it at Ark Temp Staffing! Great job. 5 stars highly recommendable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Carson",
          "Nb_Reviews": 3,
          "Date": "2019-04-17T19:12:26.000Z",
          "Titre": "Very useful service",
          "Contenu": "Very useful service. I use the text service more than the call. The texts go out in a snap. I can prepare them in advance, set the date and time and no worries.  Whether it's weather, event or reminders, Call-em-All has been wonderful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pamela Dulaff",
          "Nb_Reviews": 1,
          "Date": "2019-05-08T20:19:09.000Z",
          "Titre": "Such a time saver",
          "Contenu": "I need to send out 1 or 2 reminders each month to everyone in my Art Group about events going on. Call-Em-All has been fabulous enabling me to get the calls out to everyone quickly & easily."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Veronica Johnson",
          "Nb_Reviews": 1,
          "Date": "2019-04-15T18:27:48.000Z",
          "Titre": "Communication made easy.",
          "Contenu": "This is a great way to communicate with a large number of people in a short period of time. The system is very user friendly. What a difference this system has made with getting information out to my clients and their families."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis D",
          "Nb_Reviews": 1,
          "Date": "2019-04-17T16:59:04.000Z",
          "Titre": "It is working perfectly and my clients…",
          "Contenu": "It is working perfectly and my clients really like the ability to respond to texts when sent if they want to.  The company has been great to work with and I certainly would recommend Call-Em-All to anyone who needs to stay in contact with a group."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua",
          "Nb_Reviews": 1,
          "Date": "2019-04-19T16:28:59.000Z",
          "Titre": "This was one of the best decisions we…",
          "Contenu": "This was one of the best decisions we made as a staffing agency! So easy to use and great customer support! Call-Em-All helped us find a way to keep in touch with candidates on a regular basis! I highly recommend signing up with Call-Em-All!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George M. Dupree",
          "Nb_Reviews": 1,
          "Date": "2019-04-20T13:56:13.000Z",
          "Titre": "My experience with this company has…",
          "Contenu": "My experience with this company has been great and very timely. It makes my group contacts easier to reach and get information to them without making multiple phone calls."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erica Jones",
          "Nb_Reviews": 1,
          "Date": "2019-04-17T17:42:33.000Z",
          "Titre": "The website is easy to use and the…",
          "Contenu": "The website is easy to use and the customer service professionals are extremely helpful! Using this service has cut out hours of work for me every week and has allowed me to spend more time with my family."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Remelts",
          "Nb_Reviews": 1,
          "Date": "2019-04-18T11:58:35.000Z",
          "Titre": "Call-Em-All is great!",
          "Contenu": "our church had been using an in-house system for calling the congregation and it would tie up our phone line and our computer for an hour or more every time we used it.  Also, I had to be physically at the dedicated computer to set up a call.  With Call-Em-All I can set up a call from anywhere (I have even done it from outside the USA). And it's fast! About 90% of the people are called within 5-10 min.  I also like that we can pay as we go and we do not need to pay for a subscription to a service that we only need once in a while. We just buy more credits as we need them.I HIGHLY recommend Call-Em-All without any resrvation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John T.",
          "Nb_Reviews": 4,
          "Date": "2023-08-19T21:17:01.000Z",
          "Titre": "Text-Em-All is the Premiere Service!",
          "Contenu": "Text-Em-All is the premiere service and works flawlessly all the time. No glitches to deal with and great support personnel."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jimmy",
          "Nb_Reviews": 1,
          "Date": "2021-10-15T22:55:39.000Z",
          "Titre": "We have been inactive for a time but we're back!!",
          "Contenu": "We have been inactive for a time, because of moving to a new Church but Call-Em-All is the best thing since peanut butter married jelly. It's so easy to use and takes the pressure of of the small church staff. I make one call and they call-em-all for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Knighton",
          "Nb_Reviews": 1,
          "Date": "2019-04-15T21:51:36.000Z",
          "Titre": "Awesome service",
          "Contenu": "Awesome service, never have to worry about people at church getting the message. I like how you can view the report after calls go out with info about who answered and who's message went to voice mail."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Les",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T14:14:14.000Z",
          "Titre": "Awesome service",
          "Contenu": "Awesome service. This is a great system to notify our entire team simultaneously. Saves us a lot of time and effort."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marjorie Richardson",
          "Nb_Reviews": 1,
          "Date": "2019-05-14T14:55:42.000Z",
          "Titre": "This is a wonderful system",
          "Contenu": "This is a wonderful system! I love that I can see who answered who sent it to voicemail and who is engaged. I can also tell if people change their numbers so that I can either update it or remove it from my different lists. Very time saving and helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frederick Johnson",
          "Nb_Reviews": 1,
          "Date": "2019-04-24T16:03:39.000Z",
          "Titre": "As a teacher",
          "Contenu": "As a teacher, Call-em-all has helped me contact parents in an efficient manner.  I wouldn't be able to stay in touch with all my students' parents without call-em-all!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenda Eggert",
          "Nb_Reviews": 1,
          "Date": "2019-04-17T23:10:25.000Z",
          "Titre": "Works well, long time customer.",
          "Contenu": "After using this service for several years we are very happy with it. There have only been two times we've had a problem and those problems were corrected quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Crystal Riner",
          "Nb_Reviews": 3,
          "Date": "2019-04-16T21:48:47.000Z",
          "Titre": "This program is a wonderful program…",
          "Contenu": "This program is a wonderful program that saves us so much time.  I highly recommend this company to anyone who needs to get the same messages out to multiple people at one time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa Zezima",
          "Nb_Reviews": 1,
          "Date": "2019-07-01T12:47:39.000Z",
          "Titre": "As a Property Manager of a Co-op…",
          "Contenu": "As a Property Manager of a Co-op Community, it has been only an asset to both the residents and myself. The application is extremely simple, with both broadcasting a call and updating contact info.  In addition, the customer service team was helpful and friendly during set-up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stacy Cozart Bertrand",
          "Nb_Reviews": 1,
          "Date": "2019-09-05T21:48:32.000Z",
          "Titre": "I absolutely love Call-Em-All.",
          "Contenu": "I absolutely love Call-Em-All. It's very user friendly, and allows me to communicate with all my staff and/or clients with little more than a few clicks of my mouse. I can't recommend them enough."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Steve Watson",
          "Nb_Reviews": 3,
          "Date": "2019-04-15T14:30:23.000Z",
          "Titre": "Call-Em -All has been a great tool for…",
          "Contenu": "Call-Em -All has been a great tool for our organization.  We have been using it to send notifications to our membership for over 10 years.  It is easy to use and works very well.  Thank you Call-Em-All.  Steve"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Warner",
          "Nb_Reviews": 1,
          "Date": "2019-10-07T21:27:39.000Z",
          "Titre": "Call-Em-All works GREAT",
          "Contenu": "Call-Em-All has been providing great service to our company for over 13 years now and we have had great experience using their system. We use Call-Em-All services to notify our Water customers of pending and Emergency water outages with great success. Call-Em-All is a wonderful service that I would highly recommend.Tim WarnerMeter Service SupervisorRamona Municipal Water DistrictRamona, California"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cherie Dupor",
          "Nb_Reviews": 2,
          "Date": "2019-04-22T17:23:27.000Z",
          "Titre": "Our company has worked with Call-Em-All…",
          "Contenu": "Our company has worked with Call-Em-All for over 1 year now.  We are very satisfied with their service.  Whenever we have a question, the Call-Em-All team is always there to help us.  I highly recommend Call-Em-All."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pastor Phil Wyatt",
          "Nb_Reviews": 2,
          "Date": "2019-09-30T17:31:46.000Z",
          "Titre": "I have a lot of tools at my disposal…",
          "Contenu": "I have a lot of tools at my disposal but by far Call-Em-All is the best tool in my toolbox and the price for this valuable service is very reasonable. It has saved this pastor countless hours."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terence Jenkins",
          "Nb_Reviews": 1,
          "Date": "2019-04-17T17:32:45.000Z",
          "Titre": "Call-Em-All has been excellent for my…",
          "Contenu": "Call-Em-All has been excellent for my organization/fraternity. I've been a customer for almost 3 years now. It's easy to use, fast and efficient! Nothing but rave reviews. I would highly recommend this system."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Buzz Welling",
          "Nb_Reviews": 1,
          "Date": "2019-09-02T09:36:36.000Z",
          "Titre": "Wonderful Program",
          "Contenu": "Wonderful Program! The Very Best way to contact everyone at once. Perfect for when contact is ABSOLUTELY NEEDED! Don't know what we would do without the program!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ian Andre Howell Bramble",
          "Nb_Reviews": 1,
          "Date": "2019-04-22T19:07:35.000Z",
          "Titre": "Call-Em-All is GREAT!!!!",
          "Contenu": "i have used Call-Em-All with 3 non-profit organizations i've worked with, and found it amazing. Being able to update people via phone call and text is invaluable. i am hoping to implement it with another organization i work with, and am looking forward to further quality service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "norlyn van beek",
          "Nb_Reviews": 1,
          "Date": "2019-09-24T13:39:55.000Z",
          "Titre": "ive been using callemall for years",
          "Contenu": "ive been using callemall for years, at a previous job and now again.  And even though I dont use it as often as it used to be, the service and dependability has never waivered.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SHERIDAN SNYDER",
          "Nb_Reviews": 1,
          "Date": "2018-12-05T22:45:21.000Z",
          "Titre": "I believe the best reflection of one's…",
          "Contenu": "I believe the best reflection of one's opinion is whether or not you recommend a service to a friend.  I have sent callemall instructions to three separate entities and encouraged them to begin using it.  This service eliminates gray lines of interpretation and preferential treatment.  All recipients receive the same message, in the same tone of voice and without any chance of elitism in the originator.  It has been a God-send to our small congregation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Coffman",
          "Nb_Reviews": 1,
          "Date": "2019-04-25T16:57:36.000Z",
          "Titre": "I love Call-Em-All",
          "Contenu": "I love Call-Em-All! What at one time was a mess going from person to person and getting all mixed up is now one message to each individual person. It works great! And the support is awesome! Great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "contrice travis",
          "Nb_Reviews": 1,
          "Date": "2019-04-19T18:22:26.000Z",
          "Titre": "Call Em All has been a reliable…",
          "Contenu": "Call Em All has been a reliable resource for me and my company for years. I rely on it as a fast way to reach to out to small and large groups. I love that we can do a simple survey to get a response of \"yes\" or \"no\" as well as create our own unique message for listeners. The ability to see who answered and who was left a message is also very helpful. Love this service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WILLIAM",
          "Nb_Reviews": 2,
          "Date": "2023-04-30T06:28:17.000Z",
          "Titre": "The program is simple and easy to use",
          "Contenu": "The program is simple and easy to use, but comes with all the features we need for our church.  We are grateful to our Lord Jesus for this tool.  It has proven extremely reliable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrea Smith",
          "Nb_Reviews": 2,
          "Date": "2023-04-25T20:25:20.000Z",
          "Titre": "I love the simplicity of this app",
          "Contenu": "I love the simplicity of this app. I use it weekly and it has been a blessing to my ministry. It simplify the output of messages and I use it for meetings as well. Very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katrina Epperly",
          "Nb_Reviews": 1,
          "Date": "2019-04-17T16:57:33.000Z",
          "Titre": "Excellent for our church!",
          "Contenu": "Call-Em-All is a great program for our church. It lets me record one message and send it out to as many church goers as I like. It has been instrumental in running our office."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GRACE",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T16:09:29.000Z",
          "Titre": "Works as expected, would definitely recommend",
          "Contenu": "Works as expected, no worries or problems, really like the text to speech option"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joyce Fortney",
          "Nb_Reviews": 1,
          "Date": "2019-04-17T17:42:34.000Z",
          "Titre": "Call-Em-All is very user friendly",
          "Contenu": "Call-Em-All is very user friendly.  I have never had a problem.  Our organization is extremely blessed to have this to get messages to our members.  Thank you for a great job!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenna Hunt",
          "Nb_Reviews": 1,
          "Date": "2019-04-16T15:11:00.000Z",
          "Titre": "Excellent!!!!!!",
          "Contenu": "It is an excellent means of communication with a team! They can message back as needed. I really enjoy the ability to keep an open line to all of my employees and they with me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2019-04-17T16:54:40.000Z",
          "Titre": "We have a club of over 350 members",
          "Contenu": "We have a club of over 350 members.   Once a week we make announcements and call em all gets us to all of them in a few minutes.  This program replaced software we had form the 1990's that would take 6 hours to make 350 calls.    Now we get them all out in 10 to 15 minutes.   The service is easy to manage, easy to create messages for, and add new members too.  We're very happy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vinny",
          "Nb_Reviews": 1,
          "Date": "2019-04-17T18:19:55.000Z",
          "Titre": "Call-em-All is a great service",
          "Contenu": "Call-em-All is a great service.  very user friendly when we send out messages.  easy for our teammates to sign up.  customer service is always available to assist with any and all needs.  we could not be more happy/pleased with the service.  thank you for everything that you do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Murray Paul Gordon",
          "Nb_Reviews": 2,
          "Date": "2019-04-17T19:19:44.000Z",
          "Titre": "I've had a very good experience with…",
          "Contenu": "I've had a very good experience with Call-Em-All so far. Easy to use and it makes getting messages out to my parishioners easy. Thank you so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DrBridget D Weatherspoon",
          "Nb_Reviews": 1,
          "Date": "2019-04-22T14:43:16.000Z",
          "Titre": "Great way to connect with my…",
          "Contenu": "Great way to connect with my congregation. This service has helped to build relationships and keep the church members informed about upcoming events.  Thank you for this innovative way to connect and build relationships."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Shaun Cudmore",
          "Nb_Reviews": 1,
          "Date": "2019-04-24T19:28:45.000Z",
          "Titre": "We use this service to pass on important information about upcoming events",
          "Contenu": "We use this service to pass on information to our members and youth for our non profit youth organization.  Its a great way to effectively communicate with numerous people at the same time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Walker",
          "Nb_Reviews": 5,
          "Date": "2019-05-28T14:00:08.000Z",
          "Titre": "This has been very helpful",
          "Contenu": "This has been very helpful, I receive comments every month about how helpful the calls are at reminding them of events."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shirley Anders",
          "Nb_Reviews": 3,
          "Date": "2019-04-17T17:53:08.000Z",
          "Titre": "I think the Call-Em-All website is GREAT!",
          "Contenu": "I think the Call-Em-All website is great.  Very user friendly and we've seen a huge savings in both time and cost for our company.  Would highly recommend using this website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bobby Hudson",
          "Nb_Reviews": 1,
          "Date": "2019-10-07T16:59:06.000Z",
          "Titre": "Great way to reach out to my contacts…",
          "Contenu": "Great way to reach out to my contacts with one call, everyone knows my message in less than 10 minutes. Easy to use, add contacts, and make recordings."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russell von Frank",
          "Nb_Reviews": 3,
          "Date": "2019-04-18T19:36:04.000Z",
          "Titre": "Call-Em-All is a very useful tool for…",
          "Contenu": "Call-Em-All is a very useful tool for getting your message out to a large group of people with very little effort. The calls are made promptly as scheduled."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "St. George Foot Solutions",
          "Nb_Reviews": 1,
          "Date": "2019-04-17T17:29:05.000Z",
          "Titre": "Makes the customer notification process…",
          "Contenu": "Makes the customer notification process faster and easier than individual phone calls where you frequently get a voice machine or no answer.   Calls can be scheduled during time customers are most likely to answer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Carroll",
          "Nb_Reviews": 1,
          "Date": "2019-04-18T21:00:07.000Z",
          "Titre": "Very happy customer",
          "Contenu": "Easy to use website, fast and helpful online assistance, good reporting. This serves my business needs very well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick South",
          "Nb_Reviews": 1,
          "Date": "2019-05-30T20:15:15.000Z",
          "Titre": "Call-Em-All Review",
          "Contenu": "Our church has used Call-Em-All for over 7 years. It has been a tremendous tool for getting out information efficiently and effectively."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JillM",
          "Nb_Reviews": 2,
          "Date": "2023-04-22T15:31:18.000Z",
          "Titre": "Fast efficient service if needed",
          "Contenu": "Fast efficient service if needed, great product with features that save our team time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandy",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T20:42:54.000Z",
          "Titre": "System is very easy to use and customer…",
          "Contenu": "System is very easy to use and customer service is very helpful if we have any questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K. Moore",
          "Nb_Reviews": 6,
          "Date": "2019-04-30T00:09:42.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, relatively inexpensive.  I place recorded calls to our small church membership, it works well for our needs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Isaac Kelly",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T23:24:20.000Z",
          "Titre": "Best Choice for Texts Platform!",
          "Contenu": "Text-em-all is the best service and at the same time cost-efficient. It's exactly what we needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Teresa Graves",
          "Nb_Reviews": 2,
          "Date": "2019-06-06T14:24:16.000Z",
          "Titre": "Best Ever!",
          "Contenu": "Best Ever!I have worked with other calling sources and by far Call-em-All is the easiest, fastest, and most affordable!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TRH",
          "Nb_Reviews": 2,
          "Date": "2023-04-29T03:18:51.000Z",
          "Titre": "The ability to reach the entire Sunday…",
          "Contenu": "The ability to reach the entire Sunday School in one text or to send out grade level.I would love to learn how to include a picture w my texts!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laquita Stanfill",
          "Nb_Reviews": 1,
          "Date": "2019-04-25T13:21:30.000Z",
          "Titre": "This service is a great tool",
          "Contenu": "This service is a great tool to share important announcements and a time saver for busy organizations. Thank you for your service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Becki King",
          "Nb_Reviews": 1,
          "Date": "2019-04-22T14:52:27.000Z",
          "Titre": "Great, Reliable Program",
          "Contenu": "Call-Em-All is very easy to use, very reliable, and I appreciate the different pricing options. I've used other programs, but Call-Em-All beats the others hands down."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Regina Fink",
          "Nb_Reviews": 2,
          "Date": "2019-04-23T22:24:19.000Z",
          "Titre": "Our Pulaski SDA Church has been using…",
          "Contenu": "Our Pulaski SDA Church has been using it for at least 4 or 5 years and we have been blessed with getting our messages out to our members.  Thanks alotRegina Fink"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hattie Richardson White Hopkins",
          "Nb_Reviews": 1,
          "Date": "2019-04-18T14:54:37.000Z",
          "Titre": "We have used call-em-all for a few…",
          "Contenu": "We have used call-em-all for a few years now and are very satisfied with it. We would recommend the system to anyone. Saves us a lot of time, when we have to get a message to everyone! Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Walden",
          "Nb_Reviews": 1,
          "Date": "2019-07-15T16:40:16.000Z",
          "Titre": "Call-Em-Now was very helpful for…",
          "Contenu": "Call-Em-Now was very helpful for keeping in touch for my event and non-profit. I found it very affordable and my attendees really appreciated it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Belle Anita Sanders Dunn",
          "Nb_Reviews": 1,
          "Date": "2019-08-01T14:45:27.000Z",
          "Titre": "Great service",
          "Contenu": "Great service!  Allows for all messages to be delivered to various groups as requested and in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "nesanel Tober",
          "Nb_Reviews": 1,
          "Date": "2019-08-27T17:42:10.000Z",
          "Titre": "had a camp of close to 400 campers call…",
          "Contenu": "had a camp of close to 400 campers call em all came in handy quite a few times during the month really happy with their program theyhave verey competetive prices very goos customer service and top of all it is really clear and simple system use definatly will recomend them to friends and family"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Gerow",
          "Nb_Reviews": 1,
          "Date": "2019-05-01T23:57:50.000Z",
          "Titre": "All the call-em-alls that I have done…",
          "Contenu": "All the call-em-alls that I have done were very well received, and have never had any problems setting them up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy Jamie Hargrove",
          "Nb_Reviews": 1,
          "Date": "2019-04-23T12:54:28.000Z",
          "Titre": "This is a great product",
          "Contenu": "This is a great product. We  use it to notify people in our church all the events and occasional cancellations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Kebodeaux",
          "Nb_Reviews": 2,
          "Date": "2019-07-15T07:39:08.000Z",
          "Titre": "Quick and easy",
          "Contenu": "Quick and easy.  Over the past few years, they've made progressive enhancements to improve their service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T00:11:41.000Z",
          "Titre": "CHURCH COMMUNICATION MADE EASY!",
          "Contenu": "It is perfect for reaching our church members with updated services or prayer requests."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Duffy",
          "Nb_Reviews": 1,
          "Date": "2019-04-17T18:39:14.000Z",
          "Titre": "Great Product",
          "Contenu": "Using call-em-all is a life saver at work.  We have weekly meetings and need to reach members and others about the scheduling.  It's easy to setup."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jorge M. Plasencia",
          "Nb_Reviews": 1,
          "Date": "2019-04-18T00:37:26.000Z",
          "Titre": "Have used Call-Em-All for years and…",
          "Contenu": "Have used Call-Em-All for years and love it's simplicity and efficiency. Highly recommend it to all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicole Maison-Rocha",
          "Nb_Reviews": 1,
          "Date": "2019-04-17T21:52:12.000Z",
          "Titre": "Love that I can send out a general…",
          "Contenu": "Love that I can send out a general message to 1 or all of my employees! It’s convenient and easy to use!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marijoyce Campbell",
          "Nb_Reviews": 2,
          "Date": "2019-04-17T16:58:42.000Z",
          "Titre": "I have never had a problem using this…",
          "Contenu": "I have never had a problem using this service, The feedback we receive is very through and helpful.Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rhea",
          "Nb_Reviews": 273,
          "Date": "2020-06-18T16:22:24.000Z",
          "Titre": "Extremely great and friendly customer…",
          "Contenu": "Extremely great and friendly customer support. They are very helpful and easy to answers my inquires."
        }
      ]
    }
  ]
}