{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "textedly.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "N/A",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T19:35:21.000Z",
          "Titre": "I waited for months for my 10DLC to be…",
          "Contenu": "I waited for months for my 10DLC to be approved...All I received was a run around and more run arounds for months. They told me on 9/20/2023 that it would finally be looked at within 24hr's-2 weeks from that date and I heard and received nothing. The many staff members that I interacted with knew nothing and were extremely unhelpful. I asked for some sort of refund since the website said that texts were sent when I can 100% confirm that they were not sent and they said they would not refund me. Horrible, frustrating experience!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alli",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T01:15:11.000Z",
          "Titre": "I wish I Never Signed Up",
          "Contenu": "I used this service for a long time and the customer service is absolutely terrible. They’re difficult to get ahold of, support tickets are just ignored, and once you do get ahold of someone, they just send copied and pasted responses that are no help. It’s really unfortunate that you pay what you do and trust them with your business, to have such awful customer service. I personally cancelled my subscription because of it. I recently had a situation where my text to my list (for my biggest launch of the year) said it was sent and delivered, and nobody received it. Textedly support was no help. It was really an unfortunate situation and for all the reasons listed above, I no longer trust them with my business. I still haven’t been contacted back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DERRICK MARSHALL",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T20:47:33.000Z",
          "Titre": "Total Scam",
          "Contenu": "I can't log in to the account, emails are often ignored, and the phone number doesn't work; this is a total scam!!! Stay far, far away! The only thing that works to perfection is the automatic billing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T16:54:19.000Z",
          "Titre": "Unusable and Costly: A Nightmare for Business Owners",
          "Contenu": "Since becoming a Textedly customer, I've lost thousands in revenue due to the ongoing delay in approving my A2P 10DLC Sole Proprietor Campaign Registration. As a result of the approval holdup, it's been over 6 weeks since I've been able to send marketing alerts, sales events, coupons, discounts, announcements, and notifications to my customers. Not only have I been paying for a service I can't use but this delay is costing me potential sales and hindering my business growth as each day goes by.For fellow business owners considering Textedly, be cautious. My experience serves as a warning that the powerful features and efficiency promised on their site may not be the reality. Before investing time and money, beware of the potential roadblocks and delays that Textedly may cause. From my experience, Textedly is a poorly managed company that is incapable of delivering on its commitments. I strongly advise other business owners to avoid Textedly until they resolve their approval process issues."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "john",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T00:46:13.000Z",
          "Titre": "takes forever to be approved for phone number&use",
          "Contenu": "if you desire to go on their website, pay, and IMMEDIATELY get started then you will be VERY VERY VERY disappointed. it takes 24-48 hours to be approved to upload large amount of numbers. if you desire NOT to upload, but instead, add numbers manually,,,,then you are only able to add 10 single numbers. nothing more. then you ask yourself,,,well i would like to have a local number. yes they give you one free 10DCL with one caveat, you must wait 6-10 weeks for the approval of that number to be used by textedly. so then you assume, thats fine bc i will just use the free 1-855 number given to me by textedly. sounds great but then you default back to waiting to be able to add anything more than 10 numbers and again, that is a 24-48 hour wait. THEN to add insult to injury, when you have questions, do NOT expect them to be answered by the \"available representative\" online. they may answer one or two and then you get the generic statement that \"response will be available within a few hours\"....so if time is a luxury that you have, then this website is great-as long as you have some computer savvy to you. otherwise you will be watching a lot of youtube videos to figure out.one other caveat, if you plan to send MMS (picture or such) via text, they charge u three messages. if you plan to do simple text campaign the you get 160 characters for it to count as one text charge. plan accordingly for how much you plan to spend and use.  i do not recommend this website"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dale Akins",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T18:10:19.000Z",
          "Titre": "Textedly - MASSIVE FAILURE",
          "Contenu": "Textedly failed to \"authenticate\" our phone number or advise us to authenticate our phone number before new law in effect.  My log in shows several thousands texts as \"SENT\".  NONE OF THE TEXTS WERE SENT for our event recipients.  Total failure by Textedly.  Tech support doesn't seem to grasp the severity of problem and will not escalate to management.   This is day 5 with no resolution."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Doug b",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T10:06:56.000Z",
          "Titre": "Terrible platform",
          "Contenu": "Terrible platform.   1). There is no support, in your admin panel you are taken to a generic help center even though their website says live support. 2)  they automatically insert your company name at start of text which is very weird and thus you can’t personalize the message.  3).  You have no way to address a contact in your text by name, 4) you have no ability to create a texting journey, 5) they automatically put opt out language in outgoing text in a way that is weird, 6) they have a weird way of calculation usage as they use 3 messages if your text includes your logo. 7) since no support, no way to cancel, no way to reach customer service, I had to charge back to my Amex."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Local Nonprofit",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T23:36:28.000Z",
          "Titre": "Deceptive",
          "Contenu": "We are a nonprofit that has used Textedly for six years. Recently, our messages stopped being delivered to our recipient list. Textedly provided us this information in a support chat: \"The mobile carriers are slowly getting rid of short codes and all accounts will now need to use a toll free number. The quickest way to do this is to cancel your current account and open a new one with a free trial. We will be able to grandfather in your current pricing for this new account.\" Upon cancelling our account and establishing a new one, we were told that our existing rate of $10 a month would not be honored, because the plan no longer existed. When shown the message above, Textedly support replied that the representative who told us our rate would be grandfathered was \"misinformed\". Although the most basic plan is now $25 a month, we were offered what was referred to as a discounted \"blue ribbon plan\" for $20 a month.After several requests to escalate the issue to someone authorized to honor the promise made, we closed our account."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Trevor",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T18:35:10.000Z",
          "Titre": "This service is a complete joke",
          "Contenu": "This service is a complete joke. This software is NOT user-friendly at all and the staff at Textedly does not make things any easier. I have a total of 9 accounts with Textedly. 1 personal and 8 others that I pay for monthly for people that work for me. Everyone has been complaining about the service they have received from this software. We went with Textedy because it was cost effective. This is definitely one of those \"you get what you pay for\" scenarios. Do not expect much from this software. I do not recommend at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Philip Price",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T17:06:28.000Z",
          "Titre": "Awful service and non-existent customer support",
          "Contenu": "We purchased a plan on June 2, 2023 for a 3-day music festival so we could alert festival goers of events, weather info, pop-up concerts, etc. We were NOT told that the toll-free number would have to be approved before texting could start, and that the process of approval could take weeks. Didn't know that tidbit until day one of the festival! By the time the festival began, the number was STILL not approved and hence almost no texts got through to any of the festival goers. It was a total failure. We requested a full refund of the $1700 paid. They will not offer any kind of refund.We see this in the Terms: \"G. Refund Policy . All purchase transactions made through the Platform are subject to Provider’s refund policy in effect at the time of purchase. Currently, Provider’s refund policy is to NOT offer any refunds for any subscriptions purchased through the Platform, except in its sole and absolute discretion.\"In their 'sole and absolute discretion' they should do the right thing and give us our money back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph Hazimi",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T02:59:29.000Z",
          "Titre": "Absurdly fkin horribleeeeeeee",
          "Contenu": "Absurdly fkin horrible! I have spent 2 days uploading a csv file as the chat window lady continues to tell me do this do that do this do that-NOTHING FKIN WORKEDDDDDDDDDD- then she disables my chat window KNOWING they are closed all weekend-If I tell you how many times she made me sign on sign in clear cache etc etc you would throw up-DONT WASTE YOUR MONEY with this NON RESPONSIVE COMPANY-try to call them! try to email them! fkin scammer moochies! use REI Reply MUCH BETTER BANG FOR YOUR BUCK I WANT A FULL REFUND--till this day my chat window is not activated! and they are so cheap they upcharge everything"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sam Kleinman",
          "Nb_Reviews": 5,
          "Date": "2023-01-25T20:59:27.000Z",
          "Titre": "Once they charge you a monthly charge, they never stop don’t do business with them",
          "Contenu": "I registered to the company and they have been charging me $35 a month although I never use this and have complaint to them numerous times to stop charging me but they continue charging me playing stupid. This is over a year.It would be stupid of you to agree to pay them a monthly charge because they will never stop and I know plen to sue them in small claims court."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shanon",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T03:38:08.000Z",
          "Titre": "Find a different company…",
          "Contenu": "I started using textedly in January of this year. My sales started going down so I started asking some questions and found out that no one was receiving the text alerts even though my account shows that they were sent and received. When I contacted customer service to cancel my account and refund my fee, I was told it was non refundable and they suggested I use the account since I’d already paid for it. Good advice, if it actually worked but considering I was contacting them because their service doesn’t work, this was not a resolution to my problem. I guess I just donated to Textedly. Do not sign up for this service. There are other, more honest and ethical companies out there."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "EX-customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T07:20:45.000Z",
          "Titre": "I signed up for service",
          "Contenu": "I signed up for service - paid for a year of service in advance.  1) After signing up, they changed the terms and want me to pay for users that were INCLUDED in plan I paid for a year.  BAIT AND SWITCH!!  You can't trust companies like this - find another option.2) They refuse to call me back because I was \"rude\" in chat to them. 3) They did NOT tell me until AFTER new regulations went into play that I needed to send in information missing critical days to send texts.4) Link for form they sent to create webform does not work. 5) Agree with other reviewer, they are nice and helpful, UNTIL they get your money!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carlos D. Davis",
          "Nb_Reviews": 6,
          "Date": "2022-11-29T15:35:10.000Z",
          "Titre": "I’m very disappointed with this…",
          "Contenu": "I’m very disappointed with this company. I have used them for years and they dropped the ball for my Black Friday text blast. I sent out to 17k users and only 1% received the text. I have been trying to reach them to no avail to resolve the issue. Definitely would not recommend and would like my additional money back I paid for not delivering what I paid for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Milo Mancia",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T19:35:02.000Z",
          "Titre": "UNPROFESSIONAL",
          "Contenu": "Features are overpriced and with limits. I did not choose to complete the free trial and had a very disappointing customer service experience. They would not delete my information upon request or close my account. I also asked to be placed on a Do Not Contact list and was ignored. Unprofessional!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JustAnswer Customer",
          "Nb_Reviews": 3,
          "Date": "2023-04-05T17:22:01.000Z",
          "Titre": "DO NOT waste your time or money TRYING to use Textedly",
          "Contenu": "The first 3 months of using this service worked well. After the first months, Texedly is a complete waste of money and time. The initial number Textedly supplies you with will no longer be sufficient. You will have to purchase a 10 digit code which will takes weeks to become active. Textedly Chats are the only way to communicate about your account. Upon chatting with Emily she assures me the 10 digit code will work for my small business. I sent several Texedly massages and each time i would receive confirmation that each message was indeed sent. But yet no one would receive them. So yet another application for yet another method is suggested. After waiting WEEKS waiting for the service to work the messages are still not received from my customers, although Texedly assures me they are being sent. Textedly says they may be being intercepted as spam as they have no control over that. This service is a complete joke. Do NOT waste your time.  PS they also fail to mention the surcharges they charge monthly as well."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NeoMag",
          "Nb_Reviews": 1,
          "Date": "2022-10-13T17:39:53.000Z",
          "Titre": "Horrible experience.  Find another source",
          "Contenu": "My experience started by my original account expiring after some time passed before being able to set things up.  This shouldn't be a big deal but apparently there is no way for them to cancel out your information.  So I opened a new gmail account, found a different phone number and finally got an account set up.  A week later I go to log back into my account and it says my account needs activated and to follow instructions in a email I never received.  I reach back out to Customer Service and she informs me they have deactivated my account \"due to the nature of your business.\"  Apparently making accessories for military, LEO and govt agencies is against their policies.  But I never received any notice of the cancellation.  I would highly recommend looking into their competitors for text service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dianne Vielhuber",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T19:45:25.000Z",
          "Titre": "Not really interested in how they can serve my business",
          "Contenu": "I have used Textedly for several years. But recently, their commitment to customers and customer service has dramatically declined. They made recent updates to their platform and dramatically increased prices without contacting existing customers. The price of my existing plan increased a significant amount. I have requested that the messages I have purchased be made available to my business and they will not release them until a certain date. When I contacted customer support and ask for resolution, the staff do not answer my questions or offer alternative solutions. I have requested that my account be closed and a refund of the 11 months that I have not used. They will not work with me and only offer that I pay for a higher priced plan or purchase additional messages at a very, very high rate. Please do not use this company. They are no longer considering the needs of customers that have been with them for several years."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alta",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T02:45:13.000Z",
          "Titre": "My recent experience with Texetdly",
          "Contenu": "My recent experience with Texetdly, an SMS-based texting service, was a source of immense frustration and disappointment that caught me completely off guard. This one-star review is a vital warning for those considering utilizing their services.To begin with, attempting to connect with Texetdly's customer service proved to be an arduous endeavor. It appeared as though they had adopted a policy of actively avoiding customer inquiries, as they provided no discernible form of assistance. My emails and phone calls went unanswered, leaving me in a state of exasperation and a litany of unanswered questions. It was apparent that they viewed customer concerns as a mere inconvenience, rather than an essential part of their responsibility.Even if, by some miracle, I had managed to establish contact with their customer service, it is highly doubtful that it would have made a significant difference, given the pervasive disinterest and lack of willingness to assist that I encountered during my solitary interaction with them. The extent of their indifference was astounding, leaving me with the distinct impression that my concerns held no value in their eyes.Beyond the lackluster customer service, Texetdly's troubles extended to the functionality of their service itself. Messaging issues were frequent, with messages often arriving late or failing to be delivered entirely – a fundamental failure for any SMS service. It became evident that Texetdly fell short in delivering the reliability and functionality that customers have the right to expect.However, the most distressing aspect of my Texetdly ordeal was their billing practices. I had entered my card information with the understanding that I would be billed on a monthly basis, only to discover that they had charged me for an entire year. This practice is not only deceptive but also ethically questionable. Worse yet, disputing these charges turned out to be a cumbersome and aggravating process. To add insult to injury, the dispute negatively impacted my credit score, all thanks to Texetdly's mishandling of billing. This situation is utterly inexcusable, highlighting a severe lack of professionalism and integrity within this company.In conclusion, I cannot overstate my profound dissatisfaction with Texetdly. This company not only falls short in providing reliable and responsive customer service but also engages in deceptive billing practices that can wreak havoc on customers' financial well-being. My advice is straightforward: steer clear of Texetdly at all costs. Spare yourself the frustration and potential financial fallout associated with their subpar service. Awarding one star is far too generous for a company that exhibits such a degree of ineptitude and indifference toward its customers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shaq",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T02:44:05.000Z",
          "Titre": "My recent experience with Texetdly",
          "Contenu": "My recent experience with Texetdly, an SMS-based texting service, was a source of immense frustration and disappointment that caught me completely off guard. This one-star review is a vital warning for those considering utilizing their services.To begin with, attempting to connect with Texetdly's customer service proved to be an arduous endeavor. It appeared as though they had adopted a policy of actively avoiding customer inquiries, as they provided no discernible form of assistance. My emails and phone calls went unanswered, leaving me in a state of exasperation and a litany of unanswered questions. It was apparent that they viewed customer concerns as a mere inconvenience, rather than an essential part of their responsibility.Even if, by some miracle, I had managed to establish contact with their customer service, it is highly doubtful that it would have made a significant difference, given the pervasive disinterest and lack of willingness to assist that I encountered during my solitary interaction with them. The extent of their indifference was astounding, leaving me with the distinct impression that my concerns held no value in their eyes.Beyond the lackluster customer service, Texetdly's troubles extended to the functionality of their service itself. Messaging issues were frequent, with messages often arriving late or failing to be delivered entirely – a fundamental failure for any SMS service. It became evident that Texetdly fell short in delivering the reliability and functionality that customers have the right to expect.However, the most distressing aspect of my Texetdly ordeal was their billing practices. I had entered my card information with the understanding that I would be billed on a monthly basis, only to discover that they had charged me for an entire year. This practice is not only deceptive but also ethically questionable. Worse yet, disputing these charges turned out to be a cumbersome and aggravating process. To add insult to injury, the dispute negatively impacted my credit score, all thanks to Texetdly's mishandling of billing. This situation is utterly inexcusable, highlighting a severe lack of professionalism and integrity within this company.In conclusion, I cannot overstate my profound dissatisfaction with Texetdly. This company not only falls short in providing reliable and responsive customer service but also engages in deceptive billing practices that can wreak havoc on customers' financial well-being. My advice is straightforward: steer clear of Texetdly at all costs. Spare yourself the frustration and potential financial fallout associated with their subpar service. Awarding one star is far too generous for a company that exhibits such a degree of ineptitude and indifference toward its customers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Catherine Clock",
          "Nb_Reviews": 3,
          "Date": "2023-01-06T19:42:57.000Z",
          "Titre": "They are awful",
          "Contenu": "They are awful.  Many other options.  For the second year in a row I have told them NOT to charge my card for a renewal and yet they did it again this year.  When I finally got them to cancel it they CHARGED ME A FEE.  ARE YOU KIDDING ME!  They won't be in business for long.  CRM's are now offering this service for free and lack of any customer service there will be no loyalty."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brett Tubbs",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T22:15:49.000Z",
          "Titre": "Go with EZ Texting",
          "Contenu": "I requested a service cancellation prior to the start of the month and was still charged for this service. I requested multiple times to speak to someone over the phone and also illuminated several site glitches that causes me to purchase more \"keywords\" than I needed. All of those requests have been skillfully ignored. A few annoyances that had me unhappy with the platform prior to this unjust charge to my account:-The platform is not user friendly-Beware of unknowingly purchasing unnecessary keywords as they don't auto-populate in the system (that's how I racked up a total cost $40 more than the estimated monthly subscription)-Customer service is prompt but vague and will ignore your questions. I made a request via their website and the ticket was closed with no reply-Links within their customer service messaging system are broken, making communication on the same issue difficult-Though I have canceled my account, there is an upcoming charge still listed on my account for the end of the month...-You have to make a special request to upload your contacts into the system-To send a link to a website or video, you have to have your \"toll free number\" approved, which can take several weeksAside from the billing frustration, the service did not work for the task at hand, and we wound up working with EZ Texting. I highly recommend their service, it was seamless. No special requests for contact uploads. No unfair billing. No site glitches."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Oren Shrem",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T19:11:09.000Z",
          "Titre": "BAD customer service and tech support",
          "Contenu": "My toll free phone number is pending for more than a month and therefore I am not able to send texts that include links. Moreover, I discover it by chance as their system indicates that the texts were sent.I contacted Textedly and their chat support just \"ghosted\" me. I wrote an email to the support and for two days now they haven't reply. I also send an email to the customer success manager who replied: talk to support. After calling support over the phone, they have no clue how long it will take to approve my toll free number. They are saying it is 2-4 weeks process but in my case it has been almost 8 weeks and going.I asked for a partial refund as they are not able to provide the promised service.April 29th 2023I received the following email:You’ve written a review for Textedly, and they’ve asked for more details to better understand your experience.If you don’t respond, your review may be taken offline. I have no clue which other details Textedly are asking for. Since I contacted Textedly support I have not heard back from them. I also asked to be contacted by a manger or supervisor and they haven't done that. I asked for refund and they haven't replied as well.So, I am sorry but what other details do they need? maybe they should start with picking up the phone or sending an email to me..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sarah Portis",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T16:58:42.000Z",
          "Titre": "Definitely a scam",
          "Contenu": "Definitely a scam. Don't be the idiot I was."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christopher Harris",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T17:23:28.000Z",
          "Titre": "Customer service is HORRENDOUS and INSULTUNG!",
          "Contenu": "I have used textedly for nearly 4 years without issues. I have numerous accounts on this platform across various businesses I have in the sports and entertainment space. For the first time, I had an issue with their system going down (Friday night). I sent a message, and it didn't go through... I tried it again about 5 minutes later, and a 3rd time in another 5 - 10 minutes. Nothing went through to the phones. The textedly dashboard showed that I sent 3 sets of messages totaling over 1,000 messages (a high number due to # of users/subscribers to the keyword). This was at a critical time of the event where communication was key. My team had to scramble to utilize another way to communicate with our audience so we could continue the event.The next morning I attempted a new message but the system still wasn't working (7 am) but came back online around (9 am-ish). I then had to purchase more messages (about $100- $150 additional) because my monthly package allotment was used up due to their previous system malfunction. To make matters worse, one part of their website states they have customer service on the weekend, and the other part says they don't. Its ironic a text messaging service used for communication doesn't have clear communication. So now everybody gets back to work on Monday, and I get a message that they WILL NOT reimburse me for my additional spending or credit my account for the messages that didn't go through. To make matters worse, this is a message I have received from \"Emily\":\"Due to the nature of your business, we are unable to offer access to the Textedly platform. We are unable to provide any refunds here.\"I run a 100% legal business in the sports and entertainment segment. As i stated above, I've used this system the same exact way over 3 - 4 years. I have 4 businesses using this system in the same exact way... These accounts never had a problem, but as soon as textedly has an issue, their way to deal with it is to tell me I'm not being refunded, or credited, and that my account is going to be disabled.A true mark of a company is how they are when things are going wrong, not when they are going right"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julie Lopez",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T00:22:14.000Z",
          "Titre": "Textedly- Worst Customer Service I have experienced",
          "Contenu": "Textedly has the absolute worst customer service. They will not get on a phone call with you. I have attempted to resolve a matter with them for over 10 days with no response to even my emails. I cannot access my account, i cannot cancel, my emails to cannel have gone unreturned and they continue to charge my card. Future clients beware, they are great at the onset, very communicative, however, once they have your money, they stop communicating and won't have a phone discussion with you about anything. Will not recommend them in the future and will be seeking alternative action against them for resolution since they are unwilling to contact me directly to resolve."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Casey",
          "Nb_Reviews": 1,
          "Date": "2022-04-03T16:16:21.000Z",
          "Titre": "Worst customer service",
          "Contenu": "Worst customer serviceThey charged me for 7 months without my consentthey refuse to refund me and just ignore my emailsThey hung up the phone on me CEO doesn't even answer his emailsTheir agents cant answer a single question straight"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zachery Edquist",
          "Nb_Reviews": 1,
          "Date": "2022-04-03T18:13:50.000Z",
          "Titre": "Expressed my frustration with the…",
          "Contenu": "Expressed my frustration with the process of how to add subsribers. customer rep didnt appreciate that so she became short, misrepresented her actions saying she reach out multiple times with my answer. it was one time i didnt answer. then hung up on me after she verified the website even though i had more questions. her boss supports this behavior cause when i spoke with her instead of having a conversation she instantly lied and defended her employee, and refunded my account and blocked me. i used no profanity. No unnecessary statements. I have been in customer service at the manager level for over a decade and this was my worst experience as a customer and sad to see from someone in the industry."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Welcome Programs",
          "Nb_Reviews": 1,
          "Date": "2019-06-25T15:24:48.000Z",
          "Titre": "Service not working, poor customer service, use a different company",
          "Contenu": "Our text line hasn't been working for weeks and customer service isn't helping.  The responses are short, inadequate, and provide no help in getting things working.  We needed this service to work for many clients we promoted it to, and now we have to find another service and start over after spending tens of thousands of dollars in promotional material that included this service.  We do not recommend using this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Reah",
          "Nb_Reviews": 1,
          "Date": "2021-02-26T22:58:19.000Z",
          "Titre": "Do yourself a favor, use Twilio",
          "Contenu": "Do yourself a favor, use Twilio and save yourself the hassle. My experience was as follows: started a trial, was immediately bombarded with sales calls by a representative to upgrade. Was promised a zero-commitment, satisfaction guarantee trial period. Credit card was charged for the full amount of the plan despite being at the beginning of the trial period. Attempted to cancel and requested a refund (platform issues, missing features, buggy mobile interface etc.). Was not provided any support channels other than chat. Was declined a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Johnathan Molina",
          "Nb_Reviews": 1,
          "Date": "2021-11-24T19:47:28.000Z",
          "Titre": "Horrible",
          "Contenu": "Horrible! The manager Was a joke! The manager was a female, she is very rude and doesn’t provide clear answers on issues. I’ve been having issues and they don’t provide clear responses. Till this day they haven’t fixes my issues"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "HomeQwest Realty",
          "Nb_Reviews": 1,
          "Date": "2019-12-13T13:02:03.000Z",
          "Titre": "Waste of time",
          "Contenu": "Update: They will flag your account and shut it down without notice.Tech support is slow and clueless. A bunch of amateurs.Update 12/13/19Your response below just proves my point. You're a bunch of amateurs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vanie Poyey",
          "Nb_Reviews": 2,
          "Date": "2020-10-30T00:26:16.000Z",
          "Titre": "This company is not forthcoming with…",
          "Contenu": "This company is not forthcoming with their charges nor are they responsive when you're not happy. I signed up for the free trial but there isn't much you can do to actually try the service. So I signed up and paid for the Bronze plan only to find out each feature is extra $ to activate. This is not disclosed before signing up in their monthly plans. When I contacted support to refund me immediately after signing up, the ignored my messages even though upon signing up, a support member called to see if I have any questions. Furthermore, their contract states you can cancel anytime in settings but it's not obvious how to without contacting support and asking them exactly where in settings you can do so. Since their team is ignoring me, I'll have to dispute the charge."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-04-20T02:18:34.000Z",
          "Titre": "The continuous emails asking to review…",
          "Contenu": "The continuous emails asking to review your company has become very annoying especially since I requested to unsubscribe a while ago. This is tiresome. Leave me alone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rebecca Williams",
          "Nb_Reviews": 3,
          "Date": "2021-07-21T21:43:54.000Z",
          "Titre": "Buyer Beware",
          "Contenu": "This company has been sending me spam emails every day 3 times a day. I asked to be removed and they just keep spamming me. Buyer beware!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gabe Salinas",
          "Nb_Reviews": 1,
          "Date": "2021-04-22T17:28:32.000Z",
          "Titre": "If I could give zero stars I would",
          "Contenu": "If I could give zero stars I would.  Not for the service itself, but for the lack of customer service and integrity.Our company has used this service for over a year, and when we tried to cancel, they made some super shady moves!  You can not simply call in to cancel.  Oh No! If you do that, they tell you they CANT do anything over the phone.  You have to email them and then wait for someone to call you back.....which they don't! We did as instructed and still got charged for a service we supposedly canceled per their instructions!  Another call was made and low and behold, the same thing happened.  Cant help you.  You have to email us.  What a joke!  For the little amount of work we captured using the service, you are better off paying someone to call your customers for you.  Don't waste your time or a dime with Textedly!Now I get to call my credit card company and dispute the charges!  Good thing I record all my calls!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NN",
          "Nb_Reviews": 23,
          "Date": "2021-01-26T16:09:32.000Z",
          "Titre": "Hard to Cancel",
          "Contenu": "They make it really hard to cancel. We paid for a month. We don't want this service next month. Normally, you cancel and enjoy the service till the end of the month you paid for, but they'll erase your data the moment you cancel even if it's just a few days into your month :( It is NOT possible to cancel the service and still use it till the end of the month you paid for. I find it shady and unfair.UPDATE: Instead of addressing the cancelation issue, Textedly flagged my review as being fake. I sent a screenshot of my account with them and a receipt to Trustpilot. I'm sure Trustpilot will keep my review, but this is another reason to not use their service.UPDATE: My review was verified by Trustpilot per your request (see “verified” next to my name above). Your response is ridiculous and just proves that you’re are a scam. Also - do you use teenagers to respond to reviews? What’s up with the language? This is really hilarious. You guys are a bunch of amateurs"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bret Bordwell",
          "Nb_Reviews": 1,
          "Date": "2022-02-10T15:50:42.000Z",
          "Titre": "Textedly has horrible support",
          "Contenu": "We worked with Textedly for nearly 3 years. We used 2 Keywords, posting general messages to our members and posting BINGO open/closure/jackpot info.I don't know if this company went WOKE, or what. For 3 years, no issues. Then a couple of weeks ago, we got a short and abrupt cancellation notice for violating rules. There was no clear definition of what rule we violated. A search of their site shows no rules forbidding BINGO or gambling messages.For 3 years, posting bi-weekly jackpots, along with open/closure notifications. No warnings, or other way to tweak what we are doing to stay compliant.For the past 2 weeks, I have attempted to contact Textedly via Chat, email, live phone etc with zero reply back. I am being ignored. I assume they have no answers to why, or they simply do not care. not sure. About the most un-professional way of handling this issue I have encountered by a private company in a long time.So, to sum up my complaint: Stay away form this service if you value your customers. You may be shut-down with zero means to correct or resolve. Don't count on anything."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deregister Illinois",
          "Nb_Reviews": 1,
          "Date": "2020-10-25T16:02:30.000Z",
          "Titre": "Textedly huge interface + searching + customer service problems",
          "Contenu": "Textedly was a fairly straightforward SMS service. I had used one other service and Textedly was slightly better. Then, the application started to change. It started having bugs. They started changing the interface so that critical information was more hidden (like the INBOX!). And it could not be accessed at all from an iPhone screen anymore. We did a lot of texting “in the field” so this cut out half the reason we needed the app. Textedly also stopped allowing most of the fields to be searchable. [You used to be able to search subscribers by company, city, and other fields, but they then only allowed searching by “tags.”] This halted our workflow and ability to communicate with customers. [We used tags but did not make every piece of data into a tag.] Worst of all, they didn’t seem to understand what they had done so they denied it for weeks/months. Their customer service is like a bot. It might actually just be a bot. We finally reached someone by phone and asked for a refund and cancellation. We had already paid the entire year. They promised to refund and back to us and never did. Unless you enjoy wasted time and opportunity, and being ignored and frustrated, do not use Textedly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-04-10T22:34:34.000Z",
          "Titre": "FIND A DIFFERENT COMPANY",
          "Contenu": "FIND A DIFFERENT COMPANY.  I highly recommend you go with someone else.  As a reference point I am tech savvy and have common sense so that's my background.  First day of having the service, no one showed up for my scheduled webinar demo.  Then two days later the entire site went down.  They don't have customer service available on weekends.  But they also don't have customer service available during the day on the weekdays.  The entire Monday that just passed it said customer service was closed.  Then I just hit them up at 3:30pm on a Wednesday and they're closed.  I typically don't need help that much from customer service but there site is not consumer friendly.  For three days, I've needed to print my receipt and the payment tab has been frozen.  Also, I sent some campaigns over the weekend and it wouldn't send them so I kept hitting send and of course it was having a glitch and sent people four texts so of course they were mad.  And of course I had to pay for all of those incorrectly sent text messages.  I needed to export my unsubscribe list to cross reference to another program and you can't do that.  You can only get the WHOLE list.  These are just a sampling.  I've only used them for 2 weeks and the list of issues is ridiculous."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Medicine Counter",
          "Nb_Reviews": 3,
          "Date": "2020-06-23T14:46:22.000Z",
          "Titre": "The worst decision ever",
          "Contenu": "The worst customer service ever. Your credit card will be charged even after your subscription is ended and they will not issue the refund even after multiple requests.________________________________________________________Hi Customer (my name removed due to privacy policy) ,We're writing to let you know that your subscription to Textedly has been canceled and your card will no longer be charged.Did you know that Textedly plans are month-to-month, and that you can come back and cancel at any time you want? We hope to hear back from you soon.Very best regards,Textedly_____________________________________________________Dispite this email, they charged my creditcard and would not issue refund after so many request, the person who kept promising me to issue refund was Texedly employee ***** ***** (employee name removed due to privacy policy). Call the company and ask to speak with her to see if she is a legit employee or not!_____________________________________________________As you can see how unprofessional this company is, trying to turn my review fake even if it is 100% legit. _____________________________________________________SIGN UP ONLY IF YOU WANT TO BE DISAPPOINTED BY Textedly._____________________________________________________MOST POSITIVE REVIEWS ABOUT Textedly is probably written by their own employees, in my opinion!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "mike landers",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T15:30:38.000Z",
          "Titre": "This was a great service until recently…",
          "Contenu": "This was a great service until recently when they made it mandatory to 2 party authenticate. It's a burden and not worth the time.  It is too be opt in but now you have to. I'd look at others that don't require this if you have to log in multiple times a day."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ezzy Zulkarnain",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T21:37:25.000Z",
          "Titre": "Double charged but won't get refunded",
          "Contenu": "There are couple things:1.I changed the plan \"Upgrade\" after signing up for the 1st plan \"I believed the same day\" they double charged on my 1st plan, I did the upgrade. It charged my credit card again. I called the customer service, they are unable to refund the first plan I already signed up2. I couldn't find the successful and unsuccessful report, couple of guests texted us saying they did not get the picture we sent but they got the text."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T16:03:05.000Z",
          "Titre": "I love using Texedly when it works",
          "Contenu": "I love using Texedly. I logged in yesterday and spent hours trying to send a message that no one received. Plan on speaking to Customer service today about my issues."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "PAC",
          "Nb_Reviews": 1,
          "Date": "2022-07-20T20:06:36.000Z",
          "Titre": "Difficult to cancel -- don't get overcharged!",
          "Contenu": "We had a frustrating experience. It's really hard to cancel the service once you get started. There's no options presented anywhere to \"cancel\" -- instead you have to reach out to a real support person and request that they enable the option to cancel your plan. We completed this process, then kept getting charged for 4 more months. I contacted support to complete the entire cancellation process AGAIN, and request refund for the incorrect charges, but they would not complete the refund. They assured me that I won't keep getting charged, but I guess we'll see if I have to keep coming back to cancel a 3rd time!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rob New",
          "Nb_Reviews": 1,
          "Date": "2021-05-06T19:28:36.000Z",
          "Titre": "Happy until trying to cancel",
          "Contenu": "Liked the tool but when you cancel they make it very hard. You can only find it by reaching customer support. Even then, when you go to the cancel page, you have to refresh the page to see the cancel button. When I told the lady on the chat box about this, she just ignored me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "K Mcleod",
          "Nb_Reviews": 9,
          "Date": "2020-05-10T00:38:06.000Z",
          "Titre": "This is a review of their cancelation…",
          "Contenu": "This is a review of their cancelation process. I emailed them the first day I ordered and got no response.  I then attempted to cancel online and at the time could not find the area to cancel. Anyhow I was told now that I am getting  a refund.  I prefer trials without automatic billing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pat Wright",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T22:50:18.000Z",
          "Titre": "Am I \"special\" or is the least…",
          "Contenu": "Am I \"special\" or is the least intuitive system in the world? Customer support has been decent, and friendly. But I've been trying to get a blast out most the day and I think I'm such a pain in the ass I'm being ignored"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-18T05:22:11.000Z",
          "Titre": "Text doesn’t always go through",
          "Contenu": "Text doesn’t always go through. Sometimes I wont Receive text for months then it suddenly works again. Has happened with a lot of our customers. Our acct keeps changing without our input. Just stopped using link shrinkage so it’s very hard to send texts now within my character count."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Club officer Miami area",
          "Nb_Reviews": 4,
          "Date": "2020-09-27T16:58:20.000Z",
          "Titre": "Easy to use, bur pricey at anything other than the lowest volume senders",
          "Contenu": "Easy to use for small organizations, low price point, but rather pricey.  Customer service is \"iffy,\" as there's no way to get a quick answer to problems.  The FAQs are not well-considered: perhaps Textedly should hire someone to come up with answers to questions an actual user might have, as answers to the most basic questions continue not to be answered on the website.  Either you have people on hand to answer questions, or have good FAQs.  Not having either is not good.  That said, once you get ahold of a person, they seem to be nice enough.  I'll continue to recommend Textedly to senders with a relatively low volume of short messages, but will search for a more-affordable solution for higher-volume senders."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lisa Huey",
          "Nb_Reviews": 1,
          "Date": "2021-09-07T20:00:49.000Z",
          "Titre": "Not impressed",
          "Contenu": "Just signed up with Textedly and sent out my first mass message campaign. Pros: Simple to upload a list of contacts and send out a mass message from a desktop. Competitive pricing. Cons: Once uploaded, you cannot delete any contacts. You can only manually unsubscribe one by one. They say that they skip landline numbers, but it's not true. They charge credits and attempts to send messages to all numbers (mobile & landline) and shows \"delivered\" despite landlines not being able to receive messages. (I used mine as a tester, and it came back as 100% messages delivered, even though my landline cannot receive text messages) Basically they'll charge you regardless of whether or not your message gets delivered.Overall, I think it's okay, but am not too impressed. Good thing I selected M2M instead of the annual plan so I can decide whether or not to keep this service next month."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-12-14T17:47:57.000Z",
          "Titre": "I’d like more  the program if...",
          "Contenu": "I like the program, but it would be much better if I’d be able to add Tags without needing to call for technical support every time I need to do it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mario",
          "Nb_Reviews": 2,
          "Date": "2019-08-04T22:12:08.000Z",
          "Titre": "My Opinion",
          "Contenu": "Well, wish you could have unlimited auto-confirmation message every time keyword is texted. Like some of the other Texting companies. Mario"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-26T14:47:59.000Z",
          "Titre": "Very difficult to get a hold of…",
          "Contenu": "Very difficult to get a hold of support. Then once you’ve gotten a hold of them, it takes a long time for them to respond to any queries."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hilltop AA",
          "Nb_Reviews": 1,
          "Date": "2019-09-30T14:38:40.000Z",
          "Titre": "Runs OK",
          "Contenu": "Service runs fairly smoothly and the dashboard is very intuitive. There have been a couple of down times that were very annoying."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-06-06T12:45:11.000Z",
          "Titre": "Good for the price",
          "Contenu": "Good for the price. Double texting numbers is my only complaint. No enough keywords, removing unsubscribers"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lawrence B",
          "Nb_Reviews": 1,
          "Date": "2021-09-16T16:49:34.000Z",
          "Titre": "Updated review... bumped up to 3-Stars!",
          "Contenu": "UPDATED REVIEW! After reading my original 1-Star review, customer support contacted me. They were eager to make things right, which they did, with a 100% refund of the fees I paid. If that would have come sooner and not predicated on changing my review, they would have earned 5 Stars. Things can, and will, go \"South\" when they do handling them unconditionally is a best business practice that earns authentic admiration and rave reviews. PREVIOUS REVIEW The customer service is non-existent. I've left emails and voice messages for our rep, left requests for help through their online chat. Nothing. They say the average response time is \"A few hours\" what a joke. I called the sales line and got a Iive person. They transferred me to the support desk after assuring me they would pick up. It went to voicemail. That was 10 days ago. We haven't been able to send a text for 2 weeks. They also hit you up with \"one-time\" fees that should be part of the regular monthly cost e.g. personalizing your message with a \"name\" field from your subscriber list. Personalizing your message should be a standard feature after all you're sending your message to subscribers. This is a company that sets a new low bar for standards."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elizabeth and Anthony Gibson",
          "Nb_Reviews": 1,
          "Date": "2019-08-09T14:29:15.000Z",
          "Titre": "Short Codes",
          "Contenu": "My husband and I own a business and were trying to start another line with Textedly and get a short code. We were chatting with someone online and were simply told we would have to get a 10 digit code for 30 days before they could submit a request to get it changed. We explained we were already a customer with them and had another account. The person online said simply sorry they couldn’t do anything. We said we wanted to cancel our account then and got no response. We then called in and were told we couldn’t speak to anyone because they have a “limited phone staff” but someone would call us back. A man named Ivan called us back and we were told that the laws changed two months ago but since we had an account established long before this change he would send our info to his procurement team and there shouldn’t be an issue getting us a short code once they check our account. He was informative and very helpful. This is why I’m giving 3 stars vs 1. We have yet to get this short code. We did however get a response later in the day from the person we were speaking to online about cancelling our account with no guarantee of our money back. I would hope by Monday we will get a short code otherwise we will be calling again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-10T01:46:20.000Z",
          "Titre": "my long code number disappeared from my…",
          "Contenu": "my long code number disappeared from my account. no help desk over the holiday weekend."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frustrated User",
          "Nb_Reviews": 1,
          "Date": "2020-04-08T14:35:59.000Z",
          "Titre": "The platform should be more user…",
          "Contenu": "The platform should be more user friendly.  It has many hiccups and challenges."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jill Dudzinski",
          "Nb_Reviews": 1,
          "Date": "2020-01-21T21:13:38.000Z",
          "Titre": "Customer Service",
          "Contenu": "**update** one month after initial review. Their customer service agent reached out to me and wanted to make this right. I am open to hearing what they will do and will continue to update on progress from the company. They offered my free services to make up for their customer service and training for their staff. They had days off for the holiday and I mentioned that they needed to have an away message or something on their chat so customers knew that at first. I appreciate the reach out and will continue my service and will update you at the end of the year. **Original post** At first, their service was great and for a great price ($10/mo.). I had no issues until I needed to increase my messages. I called in to get no response for two days. In a panic because I hadn't heard back from a phone message OR their chat, I ordered more messages through the web-app before Black Friday to go out on Thanksgiving night. I got a confirmation that my text was supposed to go at 8pm on Thanksgiving day. It did not go out until early the next morning and confused my thousands of customers. In an effort to contact them to downgrade back to my original $10/month service, no one seems to answer the phone and you only can reach them in chat. They are NO HELP, NON APOLOGETIC, and RUDE! Give your money to a company that actually LIKES their customers. I own a boutique and know better than to TREAT ANYONE like this. They claim they can't get me back to my $10 a month and there lowest plan is $29 or something. SCAM SCAM! Yes, I am a real paying customer. But not for long. I can't wait to switch providers and have the world hear what I have to say for these cowardly scam artists! They'll treat you like dirt, then charge you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Felicia",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T02:03:51.000Z",
          "Titre": "Extremely Responsive Customer Care",
          "Contenu": "The customer care/ personal touch means the world to me. Even though this is a tech company, they have done a great job of making my experience feel warm and welcoming. I didn't feel like another number while they were assisting me through the process. Some companies only extend support when you are a paying customer. But Textedly was extremely responsive before I became a paying customer and I appreciate that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kurt Belding",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T17:57:51.000Z",
          "Titre": "We use Textedly on a regular basis",
          "Contenu": "We use Textedly on a regular basis. Text messaging is very important to our company and its important to have a reliable company on your side."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 8,
          "Date": "2023-05-09T21:06:02.000Z",
          "Titre": "Affordable and Reliable",
          "Contenu": "Some problems with the newest build in adding contacts.  But the previous iteration is still working as great as ever.  Easy way to communicate with our league and more affordable than any other similar service.  We've used for 8 years."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stew Segura",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T05:15:29.000Z",
          "Titre": "It works very well but some features…",
          "Contenu": "It works very well but some features like export are lacking, it can be done by asking the chat staff but it should be standard. Occasionally I'll send a text and it won't work yet I'm still charged the texts. They'll refund me but it's happened twice, I just wish I knew why. Overall it's a great experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "UCP of Central Florida",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T14:49:36.000Z",
          "Titre": "Great customer service!",
          "Contenu": "Great customer service!we have been using Textedly for over a year to communicate to our parents and team members.   It's been a cost efficient solution for us and generally easy to use.   Some features are not quite intuitive to use (especially if you don't use them regularly) but customer service is extremely responsive and helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "North Street",
          "Nb_Reviews": 1,
          "Date": "2022-12-04T20:05:56.000Z",
          "Titre": "Great tool",
          "Contenu": "Great tool. The free trial helps to figure out of the service is what you need for your business. Better than the previous text messaging app I was using previously. I've referred others to Textedly as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sarah Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T18:34:53.000Z",
          "Titre": "Amazing customer service and support",
          "Contenu": "Our company has never worked with another company with this level of customer service before. We subscribed to Textedly and worked for a week trying to see how the software and platform features could work for our company and while the features are not quite as intuitive, comprehensive, or efficient as other platforms we've used in the past, the customer service is unparalleled. Nicole G. spent hours on the phone with me walking through every process and trouble shooting anything that came up. She was patient, helpful, and so experienced! In addition, the live chat feature connected me with a knowledgeable, competent representative almost instantaneously. I've been so impressed with the support that it does make up for the faults/outdated systems in the technology. The data tracking tech is very useful and more comprehensive than the other texting platforms we partner with. We will continue to be Textedly customers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A & A",
          "Nb_Reviews": 2,
          "Date": "2023-03-03T17:15:26.000Z",
          "Titre": "Customer for 2 years",
          "Contenu": "My company has been using Textedly for the past 2  years.  We are extremely happy and our experience has been great. Textedly is user friendly and the pricing is competitive. Would highly recommend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shelli W.",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T19:56:35.000Z",
          "Titre": "Good for scheduling messages",
          "Contenu": "I like how I can schedule the text messages for a different time and date. I also like how it shows a preview of what the text will look like before it’s sent. I wish it didn’t take off word count for pictures. I wish there was an easier way to select numbers to send the text to when you don’t have the option to send to “all”."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Monica Clean, LLC",
          "Nb_Reviews": 2,
          "Date": "2023-04-25T19:10:27.000Z",
          "Titre": "Not in love with the NEW platform",
          "Contenu": "Textedly's staff is nice and Textedly is very affordable. The old platform was more user friendly than the new one. The new one looks AWESOME, but it's functionality is iffy to us because we didn't get a heads up or \"how to\" instruction. When we originally purchased Textedly 5 months ago, we had a person help us and walk us through how to use it via phone call. We are not techy, but need this for our business. When things changed, we couldn't use i textedly for a while. It was frustrating and time consuming. We asked for help this time and got a link to a video that did not help. In your defense, the very nice rep that sent us the video also sent a link to use the old platform, which we know and are familiar with, just how long will that link work? Wish we were able to speak to a human in real time about the new functions and how to use certain features."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennie Boucher",
          "Nb_Reviews": 2,
          "Date": "2023-04-17T15:13:44.000Z",
          "Titre": "Textedly is easy to use!",
          "Contenu": "Textedly was so easy to set up and our customers have responded it to it wonderfully.  We are now able to serve our customers more efficiently.  Thank you, Textedly!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Phi Beta Sigma",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T04:58:48.000Z",
          "Titre": "I like the ease of platform and the…",
          "Contenu": "I like the ease of platform and the preview editor.  I dont like that you cannot use shortlinks in text messages anymore, but it is not textedly fault."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Levy from Last Mile.",
          "Nb_Reviews": 1,
          "Date": "2023-03-26T20:24:39.000Z",
          "Titre": "If you're looking to improve your…",
          "Contenu": "If you're looking to improve your communication process and recruitment efforts, I highly recommend Textedly. At Last Mile Driver Recruiting LLC, we use it for our truck driver recruiting business, and it's been a game-changer. Textedly's personalized messaging lets us send SMS campaigns to specific groups of drivers based on their qualifications and location, which has helped us engage with the right candidates and significantly improve our recruitment efforts. Plus, the automation tools have saved us time and resources while increasing our productivity and creativity. And the analytics have given us valuable insights into our campaigns' performance. In short, Textedly is a powerful tool that can help any business improve its engagement and recruitment process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Owner",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T03:29:51.000Z",
          "Titre": "I like the customer service and it…",
          "Contenu": "I like the customer service and it works every time I use it.   All of my questions are returned in a timely manner,  They work with us to my satisfaction."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T19:53:43.000Z",
          "Titre": "Easy to set up and use!",
          "Contenu": "Easy to set up and use!!  Allows us to consistently communicate with our community."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T23:50:51.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, only trouble I've had is uploading contacts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AfriQue Events & Marketing",
          "Nb_Reviews": 1,
          "Date": "2022-12-19T22:18:55.000Z",
          "Titre": "Great app for text blast",
          "Contenu": "Great app for text blast, I have been using this software for 4 months and I love it!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2022-09-12T02:55:13.000Z",
          "Titre": "Textedly Is an Asset",
          "Contenu": "Textedly has been a huge asset to our community college grant program.  It has allowed us to connect more effectively with our students.  The product is wonderful. My only suggestion would be that they should provide one-on-one training sessions for using the product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Todd Youse",
          "Nb_Reviews": 1,
          "Date": "2022-03-18T02:20:56.000Z",
          "Titre": "Great Product and Great Pricing",
          "Contenu": "For the most part, this is an extremely easy platform to use.  The only thing I wish they had was the ability to assign a phone # to a user rather than just have to pick them from a drop down.  Great dashboard and great pricing though so I will let it slide. :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-18T23:00:16.000Z",
          "Titre": "We have loved Textedly for Church…",
          "Contenu": "We have loved Textedly for Church communication! It has been very functional and user friendly for us. We would love to see an app come out some day to make it more accessible and easy to use... as well as a clearer view of consecutive messages back and forth between us and subscribers....but it has been a great investment for our Church -- especially during these trying times!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Darrell Wright",
          "Nb_Reviews": 2,
          "Date": "2022-09-29T00:14:46.000Z",
          "Titre": "Useful Service",
          "Contenu": "This platform is something i want to use to launch my business and reach out to potential clients looking to sell homes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sarah Kerr",
          "Nb_Reviews": 1,
          "Date": "2020-06-04T18:41:17.000Z",
          "Titre": "Great software, very useful.",
          "Contenu": "Great software, very useful. I had a very rough time getting the account set up properly, but since I was offered a free year's plan for the trouble I can only assume this is uncommon. One star lost because their customer service team was hard to get ahold of, but very helpful when I did. The app is very useful and well organized once it's set up correctly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "K. Peterson",
          "Nb_Reviews": 1,
          "Date": "2020-09-15T22:07:42.000Z",
          "Titre": "My experience with Textedly so far has…",
          "Contenu": "My experience with Textedly so far has been pretty great. The overall value is pretty great and I loved that the plans were straight forward and based on my usage. The add on options I've used so far have been fairly priced and effective and I'm excited to use some of the integrations they have on tap. It's a great service!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-08T20:20:01.000Z",
          "Titre": "Easy to use (maybe a little too easy!)",
          "Contenu": "As an academic research study, we use Textedly to send out survey reminder texts to our participants. Textedly is definitely easy to use and makes it easy to reply to participants in a timely manner. We liked that we were able to purchase a number with our city's area code. We also liked that we can upload contact information directly from a csv file. A downside is that it is potentially too easy to use- it is possible to send out a batch of texts to everyone on your subscriber list with a couple clicks so you have to be careful! We were told there is not a way to turn this feature off after a mishap."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-29T14:16:10.000Z",
          "Titre": "It would have been nice to know that…",
          "Contenu": "It would have been nice to know that inbound texts count against the number of texts and that there was a character limit.  Also, the rate changed the day we went to set up an account and the old rate was not honored so we took our business elsewhere.  Otherwise, the service worked well and was reliable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barb-Keep Alliance Beautiful",
          "Nb_Reviews": 1,
          "Date": "2020-07-23T18:59:29.000Z",
          "Titre": "Textedly is great",
          "Contenu": "Textedly is great. It is very easy to use. The only complaint I have is if a subscriber goes off and then wants back on (after a long period of time) it is very difficult to get them back on because it say a subscriber with that number is already in the system. I have been putting them in with a different keyword."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lydia Robison",
          "Nb_Reviews": 1,
          "Date": "2019-09-11T13:06:26.000Z",
          "Titre": "Great for business.",
          "Contenu": "great platform that can be a little confusing when you first start using. However, the customer service team is great at responding to your needs and in a timely fashion. Wish that there was another way to view the campaigns. Ex: when I leave my office I have to check on my phones browser or on my computer to see responses. Wish I had an app for this."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scorpion Data",
          "Nb_Reviews": 1,
          "Date": "2020-10-20T21:18:05.000Z",
          "Titre": "The Textedly Product is great and would…",
          "Contenu": "The Textedly Product is great and would of been 5 stars if they had App for Android.  I am very pleased with service and there customer service is outstanding., you never have to wait to get a full and complete answer.  I would strongly recommend this service for any mass marketing needs.  Jeffrey"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marie A Fischer",
          "Nb_Reviews": 2,
          "Date": "2019-02-18T16:40:25.000Z",
          "Titre": "Best texting service",
          "Contenu": "Textedly has great customer service and onboarding.  You treat customers as if they were your employees.  Your dashboard is simple and straight forward.  The only reason I gave 4 stars is that I wish you had a mobile app so I could send texts to our members as soon as possible.I have used and tested several different services and I am now recommending all the organizations that with witch I work to switch to yours."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Satisfied customer",
          "Nb_Reviews": 1,
          "Date": "2019-10-22T15:43:21.000Z",
          "Titre": "Very good texting resource",
          "Contenu": "Very good texting resource, was a little difficult while learning to use it. Would be nice to have a little more training on how to set up for the first time. The only problem we have had is the number for our keyword was changed & we were not notified. It did not affect current subscribers, it only required us to change the number on our advertising and notification. It is very nice to have a communication tool that is quick and effective. Thank you Textedly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-10T20:55:11.000Z",
          "Titre": "User Friendly Service",
          "Contenu": "We have been using Textedly for about 2 years and the service has been great. The system is easy to use, very user-friendly.  It helps to reach those customers that might not check their emails on a regular basis and gives you the option to schedule a message to go out at a later time during the day."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-08-19T00:04:51.000Z",
          "Titre": "We are really loving this service so…",
          "Contenu": "We are really loving this service so far! Have had a 100% delivery rate on messages sent! The interface is easy to understand and to navigate. Only cons i have run across is that their advertising says you can send pictures, but you actually can't. Would also love an app with dashboard rather than using a computer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charm Cuisine Inc",
          "Nb_Reviews": 1,
          "Date": "2021-02-06T15:42:16.000Z",
          "Titre": "Think it's a great way to reach…",
          "Contenu": "Think it's a great way to reach consumers. Also a fun way. Who's not texting, mostly everyone!!! It's not the cheapest out there, but I like the product. Still learning some things about it, that's because I need to take the time out to learn."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T15:01:52.000Z",
          "Titre": "I LOVE Textedly",
          "Contenu": "I LOVE Textedly. The only thing I wish that it was a little easier to add a member back in after the accidentally opt out. But otherwise it services a great purpose and has great functionality."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-20T19:52:53.000Z",
          "Titre": "Ease of use and generating instant results",
          "Contenu": "Textedly provides a great service, especially to those who are learning to better navigate digital platforms.The product is very easy to use.My only suggestions would be the following:-allow subscribers the ability to increase monthly frequency instead of locking that in as those new to texting products may not know at first glance-allow users to choose \"special numbers\" vs random long numbers-provide an add on app that verifies if a number is a cell vs landline I'm extremely happy with our results to date and would recommend this to others in any marketing role."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Club officer Miami area",
          "Nb_Reviews": 4,
          "Date": "2019-12-18T01:43:38.000Z",
          "Titre": "Textedly is a Godsend, but the instructions could be clearer",
          "Contenu": "I got Textedly for my club and it was a Godsend in sending announcements and hurricane info to our members, so we have our own emergency alert system.  In another club I’m in, I actually had to copy and paste messages to our members.  Textedly works best for shorter messages.  On the negative side, the dashboard is less than intuitive, and when we opened the account, we wasted about 250 messages because the Textedly online instructions are not well written.  They need to spend a tiny bit more money on good technical writers to develop step by step instructions.  Here’s hoping!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-02T15:20:41.000Z",
          "Titre": "As a first time user of Textedly",
          "Contenu": "As a first time user of Textedly, we are still getting used to the different way the platform can help our business. So far we haven't tested the whole functionality but we have received good feedback from our clients for staying in touch with them even with the first message. Pros: Friendly team, willing to help, potentially long term customer if it helps our company.Cons: They have a good support team but we think they are swamped with the number of customer call requests - so would like to see more people on the support team for a faster response. We will post another review after 3 months of using the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronald Cruz",
          "Nb_Reviews": 1,
          "Date": "2020-07-08T18:03:47.000Z",
          "Titre": "Very good at what it does if you can afford the plan for your subscriber-list size",
          "Contenu": "Easy-to-use interface, and fast! The ability to send out test messages to yourself is great. You can upload phone numbers in batches.Feature suggestion: Would be nice to have a way to search your contacts so you can comment or delete individuals.It can be a bit pricey which is my one caveat. We have 2,200 subscribers and it can get pricey to send to them due to the 160 character limit. You can up this to 306 characters for the equivalent of 2 messages, and you can get a MUCH longer message out with an image for the equivalent of 3 messages. If you have a smaller list of subscribers than ours, then the cost is more manageable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "coloradohealthworker",
          "Nb_Reviews": 1,
          "Date": "2019-11-13T18:40:50.000Z",
          "Titre": "Excellent text messaging software",
          "Contenu": "Excellent text messaging software. The portal is user-friendly, the cost is reasonable. The only bummer is some messages do not deliver if someone's carrier blocks the message, and it doesn't always tell you whether or not the message was blocked. I know they say below the issue is resolved but I spoke to support about the issue and they said they couldn't do anything about it. Perhaps they have resolved it by now.Also, the inbox alerts don't seem to work so you have to make sure to check the dashboard frequently for incoming texts. It would be nice to receive those notifications in your email!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LKing",
          "Nb_Reviews": 1,
          "Date": "2020-07-06T18:31:12.000Z",
          "Titre": "Excellent Tool For Communicating to your Masses",
          "Contenu": "If you are looking for a way to communicate to the masses via text, this \"fee for service\" solution is a great service to help you get there. Many service levels, easy to use and organize and administrate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer S.Moreno",
          "Nb_Reviews": 1,
          "Date": "2021-02-11T16:06:29.000Z",
          "Titre": "First initial week of using Textedly…",
          "Contenu": "First initial week of using Textedly and I really like it.  I am an insurance company recruiter and sent out a messages to licensed agents in our area to schedule interviews.  This was a much faster and more effective method than cold calling.  I sent out 400 messages and received 18 interested applicants.  There is a bit of a learning curve for the software, but I was assigned Nikki as a customer service rep to guide me through the initial steps, and can call on her for guidance on some of the more advance features.  Best part of Textedly was being able to quickly handle multiple conversations with subscribers, and book my interview sessions quickly!Looking forward to see how this company grows and adds more features!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason A.",
          "Nb_Reviews": 1,
          "Date": "2020-11-30T20:03:56.000Z",
          "Titre": "Textedly is a great service",
          "Contenu": "Textedly is a great service. It has really allowed us to stay in touch with the community we've built through our event planning business. I've found it to be more effective than E-Mail marketing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2019-09-03T15:16:52.000Z",
          "Titre": "Textedly, is a wonderful program with a great price.",
          "Contenu": "I like this platform. I researched many other text services out there and Textedly seems to have the best features for a good price.  The Dashboard is very simple and intuitive. I like the referral program. They give you extra credits towards your next membership. The only drawback I would say is I wish I would have known more about uploading contacts. If you don't upload the contacts exactly how you want them in the system there's no going back and uploading them again. Once they are in the system you have to do everything manually. I wished there was more of an emphasis on that during my training. Otherwise get this program it's great, and I would recommend it to anyone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jimi",
          "Nb_Reviews": 2,
          "Date": "2020-01-23T04:19:20.000Z",
          "Titre": "New to Textedly",
          "Contenu": "I am new to Textedly and my overall impression is positive. The dashboard is fairly easy to navigate. Textedly's customer service is swift in responding to inquiries. And best of all the pricing is affordable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janis Johnson",
          "Nb_Reviews": 2,
          "Date": "2021-08-17T11:51:50.000Z",
          "Titre": "It helps to keep my customers informed…",
          "Contenu": "It helps to keep my customers informed for and to remind them of closings. The only thing I don’t like is trying to navigate the software and that it’s so difficult to add new customers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Victor Vasquez",
          "Nb_Reviews": 1,
          "Date": "2020-04-16T02:38:36.000Z",
          "Titre": "Excellent services with many options to…",
          "Contenu": "Excellent services with many options to store and upload information. I would say the only area of improvement is:1) faster approval times on \"tags\"2) mobile version app is needed Happy customer"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NDSSA",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T19:21:11.000Z",
          "Titre": "Textedly Review",
          "Contenu": "We have been using Textedly for almost 2 years now. Our members love our ability to keep them in the loop at a great price because of our limited budget as a non-profit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tierra",
          "Nb_Reviews": 1,
          "Date": "2020-03-25T15:43:52.000Z",
          "Titre": "I am a big fan of Textedly!",
          "Contenu": "I am a big fan of Textedly. It is the perfect platform for my business.  The staff is also very helpful and reachable. If you need a way to communicate with a mass group audience, I would recommend Textedly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sarah R.",
          "Nb_Reviews": 1,
          "Date": "2020-02-10T19:15:46.000Z",
          "Titre": "Textedly is working great for our mass…",
          "Contenu": "Textedly is working great for our mass text messages to current clients. The keywords are tricky if the client's status changes in our office so we have to periodically manually check our keyword list."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rob Marek",
          "Nb_Reviews": 1,
          "Date": "2019-06-13T23:54:06.000Z",
          "Titre": "Not giving 5 stars due to some service disruption that were not told me",
          "Contenu": "Not giving 5 stars due to some service outages but not telling the client.  I use my account to communicate with my staff of drivers of emergency situations and last week the service was out and I had no idea."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rowen Concrete, Inc.",
          "Nb_Reviews": 4,
          "Date": "2020-12-31T13:53:03.000Z",
          "Titre": "Great Texting Service",
          "Contenu": "My company has been using Textedly for almost a year now and it has been great!  Easy to use and our employees love that they get information via text.  Would recommend for any small business."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-27T22:00:12.000Z",
          "Titre": "Works well and does what it says it's…",
          "Contenu": "Works well and does what it says it's supposed to do. I think some of the paid upgrades should be included in the price automatically, but the basic features are good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Cummings",
          "Nb_Reviews": 2,
          "Date": "2020-02-24T14:21:15.000Z",
          "Titre": "Comprehensive, Affordable",
          "Contenu": "Textedly does offer a comprehensive service for an affordable price. Price was a determining factor in turning off our current service and moving over to Textedly. There is a somewhat extensive process to get verified and up and running before you can start sending out texts, I would say it took a week or a little longer to be able to start mass texting. The texts are sent out in an appropriate amount of time and is easy for the user to stop receiving them based on their preference. I would say the biggest drawback is when someone needs to be removed from your group, it's not easy to re-add them as the number becomes blacklisted for re-joining which requires that user to resend a message to reactivate. A little cumbersome. Overall, a good product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marshfield Farmers' Market",
          "Nb_Reviews": 1,
          "Date": "2020-07-21T20:15:20.000Z",
          "Titre": "Textedly provided exactly what we needed",
          "Contenu": "Textedly provided just the platform we needed at a price we could afford!  As a non-profit pricing is critical for us, especially as we use many messages in the summer and very few in the winter, so their flexibility offered is helpful.We are able to differentiate different groups for outgoing messages too, minimizing customer frustration.  The only wish I have is a capability to mark multiple customers with the same tag at once, right now it is one at a time and can be time consuming when you get many responses at once.  Our customer base is happy, so we are too.  I think when a few upgrades are made for ease of use this will become a 5 star rating.    Customer service was super helpful when I was researching the different companies and options so I feel good about this choice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T20:19:47.000Z",
          "Titre": "It is a good platform to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "matt kiefer",
          "Nb_Reviews": 2,
          "Date": "2019-02-18T13:31:44.000Z",
          "Titre": "This product is very simple to set up…",
          "Contenu": "This product is very simple to set up and use and an excellent value. We have been using it by having customers send us a keyword and then we respond back with a link to our payment portal."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-02T15:00:07.000Z",
          "Titre": "Textedly has been great with…",
          "Contenu": "Textedly has been great with communicating with my employees, especially during the pandemic. I wish it was a little more user friendly and would allow more characters."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-05-17T05:08:56.000Z",
          "Titre": "User Friendly",
          "Contenu": "Great platform and very user friendly. My recommendation for approval would be to have a button to select “all” subscribers in addition selecting by “all on the page.”"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Discover Lake Lanier",
          "Nb_Reviews": 1,
          "Date": "2021-05-28T21:38:15.000Z",
          "Titre": "Newbies use Textedly with ease",
          "Contenu": "My company is new to this platform. So far it’s been pretty intuitive and easy to use. We’ve also had great click through results on our text campaigns."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-20T00:58:54.000Z",
          "Titre": "Relatively easy to use",
          "Contenu": "Relatively easy to use.  Self explanatory software makes most things intuitive.  Not the best on some of the finer controls.  Definitely worth the investment"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-16T17:27:26.000Z",
          "Titre": "I like the service",
          "Contenu": "I like the service. I think the customer service can be quicker to respond and resolve issues, but the responses and resolutions have been thorough."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Satisfied Customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-19T00:57:16.000Z",
          "Titre": "Enjoying the service and getting great…",
          "Contenu": "Enjoying the service and getting great results from using it. I only wish there was a mobile app to easier interact with my community while on the go."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-07-17T06:22:27.000Z",
          "Titre": "Messages made easy",
          "Contenu": "Messages are very easy to send! Having a little difficulty uploading bill numbers- but otherwise everything is super straightforward and easy!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diana - Gold Canyon RV & Golf Resort",
          "Nb_Reviews": 1,
          "Date": "2020-06-11T20:28:13.000Z",
          "Titre": "I have problems with deleting residents…",
          "Contenu": "I have problems with deleting residents from the subscribers and not being able to put them back in, otherwise has been working great for us."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-01-14T19:19:25.000Z",
          "Titre": "In General the app is greta",
          "Contenu": "In General the app is great, I would like more flexibility in handling the people in your account. (enrollment, changes, editing, etc)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karissa",
          "Nb_Reviews": 1,
          "Date": "2020-04-24T18:28:04.000Z",
          "Titre": "It's good for what we need but…",
          "Contenu": "It's good for what we need but sometimes other texts, not from us are sent to clients then they stop texts.  An app would be helpful!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer Joe",
          "Nb_Reviews": 1,
          "Date": "2019-08-10T01:39:51.000Z",
          "Titre": "I’ve enjoyed reaching out to Textedly…",
          "Contenu": "I’ve enjoyed reaching out to Textedly customer service when I’m confused or unclear on how to do something, the are very thorough and patient"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-11T00:09:50.000Z",
          "Titre": "Customer inquiries are responded to in…",
          "Contenu": "Customer inquiries are responded to in a timely fashion. Very customer focused and friendly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Miles Chapel Bapt Church",
          "Nb_Reviews": 1,
          "Date": "2021-02-13T20:13:23.000Z",
          "Titre": "Simple process with all needed…",
          "Contenu": "Simple process with all needed information at your fingertips. Support stand ready to assist if needed but that won’t be often."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew C.",
          "Nb_Reviews": 1,
          "Date": "2020-02-07T12:53:42.000Z",
          "Titre": "Textedly has worked as they advertised…",
          "Contenu": "Textedly has worked as they advertised and has been a big help in our ability to keep our messages out to our customers with ease."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-02T13:14:35.000Z",
          "Titre": "Textedly was easy to use and efficient",
          "Contenu": "Textedly was easy to use and efficient.  I would recommend it as a new communication tool for any company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A & A",
          "Nb_Reviews": 2,
          "Date": "2021-07-11T15:23:17.000Z",
          "Titre": "Textedly has been extremely helpful",
          "Contenu": "Textedly has been extremely helpful. It is user friendly and convenient.  Would be excellent if there was an app."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-08T02:48:31.000Z",
          "Titre": "Overall I am pleased with the service…",
          "Contenu": "Overall I am pleased with the service but the portal should be more friendly user"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-23T14:46:36.000Z",
          "Titre": "Easy to use platform",
          "Contenu": "Easy to use platform.  Quick and efficient.  Our customers appreciate getting a notification from us."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony G",
          "Nb_Reviews": 1,
          "Date": "2020-12-21T23:54:23.000Z",
          "Titre": "Great product and service",
          "Contenu": "Great product and service. Lacking mobile app for text replies, and for this reason only I give it 4 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Butch",
          "Nb_Reviews": 2,
          "Date": "2019-03-15T00:48:47.000Z",
          "Titre": "Subscribe again",
          "Contenu": "I wanted to be able to subscribe back a telephone number that was unsubscribed. It does not allow me at this time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sally customer",
          "Nb_Reviews": 1,
          "Date": "2019-04-20T13:37:29.000Z",
          "Titre": "Pretty good experience",
          "Contenu": "Pretty good experience. The problem is I'm not techno savvy and found some of textedly hard to figure out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-07T17:53:15.000Z",
          "Titre": "Super easy to use!",
          "Contenu": "Super easy to use and schedule out messages! We use it a lot for ticket giveaways."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-08T02:13:30.000Z",
          "Titre": "Would be a 5 star",
          "Contenu": "Would be a 5 star - if there was an app to go along with it. Customer Service is awesome though!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adele Aurino-Leviton",
          "Nb_Reviews": 1,
          "Date": "2020-04-22T21:33:02.000Z",
          "Titre": "My problem was resolved",
          "Contenu": "Textedly did resolve my problem, but it took longer than expected, so Im giving 4 out of 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-06-23T23:29:39.000Z",
          "Titre": "They are very helpful and quick to…",
          "Contenu": "They are very helpful and quick to respond to questions. The phone call when you set up is great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2019-05-16T13:36:55.000Z",
          "Titre": "Sometimes we experience a delay in…",
          "Contenu": "Sometimes we experience a delay in receiving the email notification.Sometimes up to 24 hours."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-03T22:21:36.000Z",
          "Titre": "Textedly is easy to use and allows us…",
          "Contenu": "Textedly is easy to use and allows us to easily communicate to our participants."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2021-10-15T14:06:37.000Z",
          "Titre": "Easy to use.",
          "Contenu": "Easy to use.Easy to manage.Wasn't pleased with the recent increase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-02T05:23:16.000Z",
          "Titre": "Amazing company that allows the…",
          "Contenu": "Amazing company that allows the flexibility and resources my company needs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Juan Fabay",
          "Nb_Reviews": 1,
          "Date": "2021-04-01T17:51:00.000Z",
          "Titre": "Fast",
          "Contenu": "Fast. Easy to learn and quite convenient. always have room for improvement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry A,",
          "Nb_Reviews": 1,
          "Date": "2020-01-24T04:15:38.000Z",
          "Titre": "Great service at a great price",
          "Contenu": "Great service at a great price. Easy to use and requires no technical skill."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-06-05T17:30:38.000Z",
          "Titre": "Easy to use and works quickly",
          "Contenu": "Easy to use and works quickly! It has a majority of the features we needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-04-18T02:15:35.000Z",
          "Titre": "Great service!",
          "Contenu": "We’ve had minimal problems and I would recommend textedly to any friend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LivingWell Medical Clinic",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T23:44:11.000Z",
          "Titre": "Textedly is easy to use and works for…",
          "Contenu": "Textedly is easy to use and works for our needs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-07-27T15:23:41.000Z",
          "Titre": "I would love to see app integrations…",
          "Contenu": "I would love to see app integrations such as a scheduler, reviews."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-28T10:55:21.000Z",
          "Titre": "Business",
          "Contenu": "Great service, looking forward to doing business. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gerald",
          "Nb_Reviews": 2,
          "Date": "2020-04-06T14:38:31.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, quick customer service and quality product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-16T17:45:55.000Z",
          "Titre": "Easy to use",
          "Contenu": "Textedly has been a user friend texting service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-22T20:57:37.000Z",
          "Titre": "new to this all but great experience…",
          "Contenu": "new to this all but great experience thus far"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-14T16:45:03.000Z",
          "Titre": "Easy to use!",
          "Contenu": "Textedly's platform is very user-friendly!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Austin",
          "Nb_Reviews": 1,
          "Date": "2019-12-14T15:08:48.000Z",
          "Titre": "Great support and easy to use",
          "Contenu": "Great support and easy to use. Would recommend!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2022-07-15T18:00:10.000Z",
          "Titre": "easy to use",
          "Contenu": "easy to use, good company"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2019-10-31T00:37:40.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. Wish we could upload our members."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-01T19:01:05.000Z",
          "Titre": "Functions well",
          "Contenu": "Textedly gets the job done. No complaints."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NTL OF NYC",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T00:37:18.000Z",
          "Titre": "Texting clients has never been this…",
          "Contenu": "Texting clients has never been this easy and textedly has been the best solution of 2023. Their user interface on both mobile and desktop are truly what makes them unique. Really glad I was able to find this platform and it has 10X my business.... Keep up the good work 💪"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tess",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:24:13.000Z",
          "Titre": "Helpful and Reliable for our Business",
          "Contenu": "Helpful and Reliable for our BusinessTheir customer service is very responsive and their platform is easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abdulrahman Alshehari",
          "Nb_Reviews": 5,
          "Date": "2023-12-05T21:59:39.000Z",
          "Titre": "making communicating super easy",
          "Contenu": "Textedly is making communicating with my clients super easy and very trusted. this company helped me get more clients with great services.  Textedly team is extremely helpful and cooperate. I highly recommend this company to every kind of business.Abdulrahman Alshehariat Right Revenue LLC for Tax Services"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Restoration Church",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T21:10:54.000Z",
          "Titre": "We love textedly",
          "Contenu": "Textedly is a really great value compared to other mass texting services. It is robust in the services it offers but also simple enough that anyone can use it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cole K.",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T18:01:17.000Z",
          "Titre": "Easy way to keep everyone in the loop",
          "Contenu": "As a non profit we have to be very careful with every dime and Textedly give us the ability to multiply our reach and keep all our members / community in the loop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rone Lewis",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T15:55:15.000Z",
          "Titre": "Why I Use Textedly",
          "Contenu": "Before I chose Textedly, they fully answered all my questions.  They sent How-To instructions which were easy to follow.Textedly is very user friendly, and their tag system enables me to zero in on market segments with the right message.Finally, their service is the most cost effective way I have found to prospect and to stay in touch with my clients."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T20:18:32.000Z",
          "Titre": "My recruiters are very satisfied with…",
          "Contenu": "My recruiters are very satisfied with Textedly! It's easy to use once you set up your cvs template. I highly recommend subscribing to Textedly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ada",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T02:49:59.000Z",
          "Titre": "I really love Textedly and the…",
          "Contenu": "I really love Textedly and the toll-free number that connects with a personal number is amazing. The staff are very knowledgeable and helpful whenever I am in need of their assistance. I really appreciate you all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christa Williams",
          "Nb_Reviews": 3,
          "Date": "2023-11-17T18:08:44.000Z",
          "Titre": "Grow Your Business with Textedly",
          "Contenu": "I have been a Textedly Customer for 2 years and have had much success advertising with them. This company has really help my business grow in ways thar other more expensive forms of advertising could not."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katelynn L",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T01:42:27.000Z",
          "Titre": "Love textedly and highly recommend",
          "Contenu": "Love textedly and highly recommend! Great staff, really supportive, helpful and fast to respond always! Easy to use, upload contacts in seconds and high quality features within the app."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T21:02:00.000Z",
          "Titre": "Problems resolved!",
          "Contenu": "My messages were not being received and I was beginning to get frustrated with the process when textedly's IT dept determined that the problem was with the assigned 800 number.  After that Ashton, my service rep, jumped into action. She spent a significant amount of time over a 24 hour period helping me get my account in order and my first batch of messages out.  It's been smooth sailing since."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bison",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T15:23:44.000Z",
          "Titre": "Extremely easy to use!",
          "Contenu": "Extremely easy to use!! I use it to contact multiple customers for price updates and business hours. Saves me a ton of time and helps build business.I would recommend to anyone who has a large audience and wants to save time from messaging every person individually."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Krista",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T22:37:07.000Z",
          "Titre": "Outstanding Experience",
          "Contenu": "What has made our experience with Textedly outstanding is their clarity, attentiveness, and courtesy. The package best suited to our needs was clearly explained, follow-up and account set-up questions were promptly answered, and Olivia, and the technical team, were refreshingly courteous."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gwen",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T01:07:54.000Z",
          "Titre": "A great company to work with if you own a small business",
          "Contenu": "We own a small family business and tried unsuccessfully to set up an SMS campaign previously.  I found the process very confusing to put it lightly.  Textedly made the process simple for me, and we were able to get a local number much more quickly than anticipated.  Textedly's customer service is great. I had a hard time with uploading our contacts and someone helped me through that issue also."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill W - Summit Club of Flower",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T12:11:53.000Z",
          "Titre": "Textedly is easy and flexible to use",
          "Contenu": "Textedly is easy to use and set up groups via tags.  We use the tags to notify potential attendees about our events.Textedly has also become the most important vehicle to notify our members about meetings, volunteering and social events."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul L",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T19:40:20.000Z",
          "Titre": "Great service ease of use and platform with Textedly.",
          "Contenu": "The text messaging service we have enacted with Textedly has been going great for about a year. The customer service is easy to get a hold of via call or text. Rapid response. We are a small nonprofit entity with about 1000 subscribers. I recommend Textedly to my corporate friends. Price can't be beat. No regrets!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christina",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T17:17:28.000Z",
          "Titre": "Textedly is an asset to our company communications",
          "Contenu": "Textedly has been a very convenient Platform to use for our corporate communications! I love how fast their customer service team responds with solutions if there is a problem that needs correction and also everyone is very polite and professional! I’m so thankful that we found Textedly because we use this service very often to communicate with our Executive team all over the United States and sometimes we may have time sensitive messages! Messages go out right away and even when changes are made with the platform we have great support from the Textedly team! Thank you Textedly more business to come!Best Regards,ChristinaDreammation EFX Studios Inc."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Desiree Jordan",
          "Nb_Reviews": 2,
          "Date": "2023-10-31T04:03:15.000Z",
          "Titre": "I'm a big fan of this service that…",
          "Contenu": "I'm a big fan of this service that Textedly provides.   In an effort to communicate my art news with hundreds of people, Textedly has given me a chance to have a 1-stop shop for mass communication.  I would recommend this product to everyone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "QPS",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T15:38:35.000Z",
          "Titre": "By far best in their industry!",
          "Contenu": "I signed up for this service and there were issues with the carriers sending my messages. The whole team worked diligently to correct this and get my account running smoothly. The entire platform is user friendly and intuitive and has been a great way to get information out to my database. The pricing is cut and dry and the best in the industry. If you want to expand your reach and get into text message marketing there is no other company i would recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T23:44:21.000Z",
          "Titre": "Fast, Friendly Service",
          "Contenu": "As soon as our office realized there was an issue, we reached out to customer service and were assisted immediately. Our text messages weren't going through to our clients, so when they figured out what the issue was, and fixed it, they also credited our account back the \"used\" messages. Textedly even reached out a few days later to make sure that everything was still running smooth. Highly recommend their services!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Super efficient and productive",
          "Nb_Reviews": 3,
          "Date": "2023-10-08T19:12:06.000Z",
          "Titre": "A Top Notch Business Solution for Immediate Results",
          "Contenu": "Textedly has been the solution for customer outreach for me for years now. It is easy to use and only takes minutes to send out a promo, special information or photo/video to attract immediate business.  The customer service is top notch and always prompt, available and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Anderson",
          "Nb_Reviews": 2,
          "Date": "2023-10-11T17:55:47.000Z",
          "Titre": "TEXTEDLY is a great texting service",
          "Contenu": "TEXTEDLY was a perfect match texting service for our non profit. The price point was terrific. I was up and running in a very short time. Customer service was terrific in initial setup. Follow up questions were answered very quickly utilizing their on line chat. I highly recommend TEXTEDLY"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Diaz",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T16:09:56.000Z",
          "Titre": "An integral part of our outreach",
          "Contenu": "For over 2 years Textedly has been an integral part of our outreach campaigns. The platform is easy to use, reliable, and cost-effective and they continue to improve upon it.  A very satisfied client here."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AKA-AGO",
          "Nb_Reviews": 2,
          "Date": "2023-09-30T06:40:07.000Z",
          "Titre": "Textedly has helped increase our…",
          "Contenu": "Textedly has helped increase our communication. It’s easy to use and very effective communication tool. My members prefer text over emails. It’s an affordable marketing tool. I use the mass text feature with key words. We use the schedule text feature will ease."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hydromama",
          "Nb_Reviews": 2,
          "Date": "2023-09-10T16:07:36.000Z",
          "Titre": "Textedly is effective",
          "Contenu": "Textedly is effective.  I can monitor the return on investment and track sale codes used. It's easy to use, can set up separate phone groups for different stores. I just started using the image function & love it. Great marketing service for my small business. I highly recommend Textedly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris R.",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T23:32:53.000Z",
          "Titre": "World Class!",
          "Contenu": "I have used several other text messaging services in the past and always found that the cost / service ratio never matched until I was introduced to Textedly! The platform is easy to navigate, their customer service is world class all at a very competitive price! I highly recommend Textedly for all your businesses text services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay K.",
          "Nb_Reviews": 3,
          "Date": "2023-11-22T17:17:02.000Z",
          "Titre": "Textedly is an easy way to speak to your Clients",
          "Contenu": "Textedly is an easy way to speak to your Clients in the format they are most comfortable in. Most people like to hear from you on occasion!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T14:11:57.000Z",
          "Titre": "Awesome Application with an Equally Awesome Customer Service Team",
          "Contenu": "The platform is very easy to use and the customer service experience has been top notch. There are a few hidden fees associated with the service that were not truly highlighted during the sign up process, like the monthly recurring service charge, but those are minor grumbles to an otherwise awesome platform.The best thing is the ease of sending messages to customers and to collect inbound messages. You can schedule messages or send them instantaneously. Templates are available, but not fully customizable. I would totally recommend this platform for any business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T17:16:39.000Z",
          "Titre": "Homeschool Cooperative",
          "Contenu": "We are a small cooperative homeschool program but with enough families that having a text messaging system to keep everyone informed we thought would be essential.  We were right, it is easy to send out a mass amount of text messages to our community to keep them informed in quickly.  There is a small learning curve but over all quite user friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marvin Greer",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T19:17:05.000Z",
          "Titre": "New user to textedly.",
          "Contenu": "I recently signed up with Textedly after a fellow agent recommended them.  With Textedly I can now sent text messages from my computer to the leads I receive weekly.  I did not want to use my personal cell number to send texts so I was limited to calling and sending emails.  Textedly is easy to use and I am glad to now have this option to send texts to reach out to potential clients as many prefer receiving texts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hillel at UC Davis",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T20:56:25.000Z",
          "Titre": "We love using Textedly",
          "Contenu": "We love using Textedly. It has really helped our organization with both fundraising and student engagement. I'd recommend it to anyone who has mass messaging needs. Exceptional customer service and user-friendly interface."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack Wisdom",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T15:11:23.000Z",
          "Titre": "We researched several providers before…",
          "Contenu": "We researched several providers before deciding on Textedly.  Our account manager did a great job in answering our questions during the vetting process. She walked us through the onboarding and setup.  The online chat support assisted with technical issues in a very timely manner.   Our text campaigns are working flawlessly.  We are very happy with our decision to use Textedly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kateryna Titenko",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T18:33:20.000Z",
          "Titre": "It is a user-friendly platform that I…",
          "Contenu": "It is a user-friendly platform that I have been using for the past few years. The team consistently exhibits efficiency and responsiveness in addressing my support inquiries.However, I would like to suggest a change regarding one aspect. Currently, my massagers expire every month if I don't use them. I would appreciate it if these massagers could roll over to the next month, allowing me to utilize them at a later time. Over all I like everything.  UWRELLC/ Kateryna Titenko"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John B",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T17:43:42.000Z",
          "Titre": "Textedly is for business owners who like more sales",
          "Contenu": "Love Textedly. Allows for the most texting power we've ever had. Simple and easy to use. One of the key components to our lead generation and lead followup stragies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-25T04:58:17.000Z",
          "Titre": "Textedly Has changed our small business…",
          "Contenu": "Textedly Has changed our small business marketing. The simplicity of texting our clients monthly and getting real time business has been a game changer. We have been with Textedly for over three years and it has never been down or caused an issue. At first Choice Residential, we highly recommend it for small business owners and large."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Family First Life Soldiers",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T16:54:12.000Z",
          "Titre": "Textedly has been nothing but amazing…",
          "Contenu": "Textedly has been nothing but amazing to me and our team!  Without it we couldn't send out mass text and keep everyone on the team informed!  Thank you so much for your support!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Lappas",
          "Nb_Reviews": 2,
          "Date": "2023-06-08T16:43:53.000Z",
          "Titre": "Easy and effective for small business",
          "Contenu": "My small business has been using Textedly for a little more than two years and it's an easy way for us to build and maintain a network of customers and clients who want to hear from us by text. It's also been very user-friendly on our end, which is necessary because we don't have time to learn a complicated texting system."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim Arnold",
          "Nb_Reviews": 3,
          "Date": "2023-09-05T15:30:44.000Z",
          "Titre": "Very Reliable service",
          "Contenu": "Very Reliable service - Customer Service is easy to work with and fix any issues that may have came about weather it was my mistake or theirs. Nicole ChapmanParkwood GreenCommunity Manager"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KG Mills",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T13:47:55.000Z",
          "Titre": "Rep Alex Was Super Helpful",
          "Contenu": "I thought that I was tech savvy, but apparently couldn't quite set up everything properly. Representative Alex was super kind and helpful in guiding me to set up my account. Previously, I was using email contacts to send my messages. However, text messaging is the 2023 way to effectively reach people with messages. So my total 1st experience was 5 stars!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcia Bartol",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T15:31:20.000Z",
          "Titre": "REALTORS live on their phones",
          "Contenu": "REALTORS live on their phones, and Textedly gives my members immediate notice of important information available to them to help them succeed in their business. They love it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shania Cummings",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T01:28:22.000Z",
          "Titre": "I love this text messaging app for my business",
          "Contenu": "I love this text messaging app for my Travrl Agency business. It helps me to send out important due dates speacial announcements"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Kay",
          "Nb_Reviews": 2,
          "Date": "2023-04-10T19:41:30.000Z",
          "Titre": "Switched to textedly and love it!",
          "Contenu": "I switched to textedly from another messaging service cuz of better pricing, and learned that they also have many more features! Plus i like that i was assigned a personal customer service rep that i can actually call to ask questions and get help instead of random online chat reps (which they do also have and are very helpful). I am extremely pleased with textedly!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcia Bartol",
          "Nb_Reviews": 2,
          "Date": "2023-07-11T20:15:14.000Z",
          "Titre": "User friendly",
          "Contenu": "I have recently returned to Textedly and although there are some changes since my last subscription, the support staff is very helpful, and the platform is easy to use. I am able to text important updates to my contacts from either my phone or my laptop. Very valuable!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul L",
          "Nb_Reviews": 2,
          "Date": "2023-03-10T22:48:59.000Z",
          "Titre": "Very happy small non-profit organization…",
          "Contenu": "We are a small non-profit organization that sends out about one text a week to 1000 members. I am not tech savvy, but the Textedly customer service walked me thru the whole process, step by step. The pricing is flexible and the interface is easy to understand. They vetted the phone numbers as part of their service too. It has really helped us communicate with last minute info too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Claudia Wilkerson",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T22:03:20.000Z",
          "Titre": "We have been with Textedly for a year…",
          "Contenu": "We have been with Textedly for a year now, and we love the easy convenient way to communicate with our patients and clients. They have a variety of applications and features to offer any business. I have recommended Textedly to many others. Stoneview Injury & Wellness Clinic"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Non stop pizza",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T22:38:21.000Z",
          "Titre": "Textedly support was awesome",
          "Contenu": "Textedly support was awesome. Easy to setup and get started . The app has worked phenomenally well . Always recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael C.",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T03:09:56.000Z",
          "Titre": "Textedly is a top-notch SMS Platform",
          "Contenu": "Textedly provides great customer service as questions or issues arise and are dealt with quickly.  Setup is a breeze. ROI is worth the time, effort, and cost of use. It's a great setup for individual users, though.  The Textedly Team is responsive and easy to work with. I would like to see a master dashboard for corporate to track and monitor usage and data by our franchise managers under the same umbrella."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CCAME",
          "Nb_Reviews": 1,
          "Date": "2023-03-26T23:48:43.000Z",
          "Titre": "This texting service checks all the boxes",
          "Contenu": "Textly has a simple interface coupled with plenty of features for the average/new user. Because learning new software can be a challenge. But gaining skills and knowledge with Textly was easy to learn and quick to utilize. The option to schedule and send later messages is a plus.  I have never had such a pleasurable experience with customer service via email and chat since the pandemic! Follow up responses were simple, straight to the point with easy to understand directions plus solutions. I love that Textly reinforces member and future members engagement within minutes. This texting service checks all the boxes for reaching those quickly and effectively."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dr. Bailey",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T17:46:30.000Z",
          "Titre": "Just what my business needed",
          "Contenu": "Any time I have had questions or issues they have always been able to fix the issue or answer the questions. It's customizable and exactly what I need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Super efficient and productive",
          "Nb_Reviews": 3,
          "Date": "2023-03-20T19:35:59.000Z",
          "Titre": "By Far the most efficient",
          "Contenu": "By Far the most efficient, easy, affordable and effective marketing strategy. In a day and age where so many communications are by text.. Textedly allows us to stay up front with our customer/contact base giving us an advantage to our competitors. Love this program and I can truly say it has added business to our team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Iglesia \"Fieles Discipulos\". Buffalo, NY",
          "Nb_Reviews": 7,
          "Date": "2023-09-15T00:42:46.000Z",
          "Titre": "Textedly is a great company…",
          "Contenu": "Textedly is the type of company that takes good care of their costumer. Any time I have a concern and I have contacted their team the answer is fast and on point.Our church is very grateful for the help an support textedly has given us for the las 3 plus years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 5,
          "Date": "2023-11-07T14:26:32.000Z",
          "Titre": "They are responsive and the service is integral to out communicating with owners",
          "Contenu": "They are extremely responsive to any questions or issues. We have had an easy time implementing the texting platform with our owners who truly appreciate the real time communication"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CNG",
          "Nb_Reviews": 3,
          "Date": "2023-04-26T22:28:14.000Z",
          "Titre": "Our Experience with Textedly has been…",
          "Contenu": "Our Experience with Textedly has been great.  They helped us get set up after the other program we used for years said they could not longer service our needs and canceled our account with no warning.  The updated interface has been great as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony Klippel",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T18:25:27.000Z",
          "Titre": "From a business need to communicate…",
          "Contenu": "From a business need to communicate with people, the social media does not reach everyone. Using the operator friendly textedly and paying as you go with what you use is so beneficial to our small business. I would recommend this service to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "New Beginnings Mansfield",
          "Nb_Reviews": 2,
          "Date": "2023-03-10T15:27:03.000Z",
          "Titre": "If you're on the fence, go with Textedly!",
          "Contenu": "We have been with Textedly for several years now, and have never had a bad experience with them or their service. When we do have to contact customer service, they are always quick to reply and able to solve our issue immediately with a smile that can be discerned over the phone or the internet. I would give 10 stars if I could! They are awesome!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KWard",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T05:31:38.000Z",
          "Titre": "Another Satisfied Customer",
          "Contenu": "This company is user friendly and delivers messages on time. I like the flexibility of how I can schedule and send messages and don’t have to worry about it. There are so many features that I haven’t explored yet. Customer service always responds in a timely manner. Looking forward to continuing this service. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rowen Concrete, Inc.",
          "Nb_Reviews": 4,
          "Date": "2023-07-15T19:32:32.000Z",
          "Titre": "Our company has been using Textedly for…",
          "Contenu": "Our company has been using Textedly for 3 years now. It’s been invaluable to keeping in touch with our employees and keeping them informed of all our company news! Easy to use and highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marci",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T19:17:10.000Z",
          "Titre": "Extremely helpful!",
          "Contenu": "The support team was extremely helpful to me when initially setting up my account; also when questions arose they walked me through and helped with setting up my contact list. Any questions I had were answered promptly with expertise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "bawarchi indian cuisine",
          "Nb_Reviews": 2,
          "Date": "2023-04-10T21:35:51.000Z",
          "Titre": "The features are good and best way to reach customers",
          "Contenu": "The features are great where you can create multiple keywords, tags to seperate out the customer base.Also it lets you upload your existing customers lists which is a great benefit.Also at has integration with many industry social platforms."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CNG",
          "Nb_Reviews": 3,
          "Date": "2023-07-26T18:07:13.000Z",
          "Titre": "The system works incredibly well and…",
          "Contenu": "The system works incredibly well and was one of the smoothies transitions from one system to a new one.  Your product offers us the contact we need with customers and make the back and forth seamless.  The price is incredible for what we use it for."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Black Bird Barber Supply",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T16:46:19.000Z",
          "Titre": "Registration and set up was very easy…",
          "Contenu": "Registration and set up was very easy and the process of using Textedly has saved me so much time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R. Brace",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T19:10:51.000Z",
          "Titre": "Textedly is so intuitive to use",
          "Contenu": "Textedly is so intuitive to use and the online customer support is very personable and quick. It has been a great addition to my marketing outreach strategy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rolando Chacon",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T02:57:37.000Z",
          "Titre": "Friendly platform",
          "Contenu": "Friendly platform, allows clear and direct communication, is functional, it can be one of the most effective marketing tools."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Seth Browner",
          "Nb_Reviews": 2,
          "Date": "2023-03-16T01:51:02.000Z",
          "Titre": "Textedly is Amazing. Highly Recommend",
          "Contenu": "It's a great company to work with. They have amazing customer service. I always get a response quickly and effectively. They were very patient and provided great explanations when I was getting the account set up. Also, they offer great deals if you leave reviews and can get more message credits. They also offer great bargains for non-profits."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dewayne W.",
          "Nb_Reviews": 2,
          "Date": "2023-03-16T01:32:42.000Z",
          "Titre": "Textedly is an awesome site to use for…",
          "Contenu": "Textedly is an awesome site to use for messaging your subscribers. Its easy to use and straight forward. Customer service is fantastic if you have any questions. I have been using textedly for several years and would recommend it to any business!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T17:19:38.000Z",
          "Titre": "We were looking for a program to notify…",
          "Contenu": "We were looking for a program to notify our staff of emergencies and notifications.  But what we found through Textedly was so much more.  We now use it to communicate with our clients for appointments, send messages to youth living on campus, and follow-ups on services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Krewe of Armeinius",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T14:25:04.000Z",
          "Titre": "Textedly has made it possible to engage…",
          "Contenu": "Textedly has made it possible to engage our membership in the Krewes most important functions in record time. The tool itself is not only easy to use but makes direct contact with specific sectors of our team in rapid time. It has changed the rate and quality of membership engagement beyond our expectations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Megan Lundberg",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T20:48:43.000Z",
          "Titre": "Highly recommend! Easy to use",
          "Contenu": "I was searching for a texting service where I could simply input phone numbers and was so happy when I found Textedly! We took over a business that was still all on paper. To notify all the previous clients, we chose to text the phone numbers. It was easy to import all the phone numbers into Textedly and I was thrilled that Textedly automatically removed landlines and repeat numbers (removed ~400 numbers in our case). Very easy to create and send a message! It does create a toll-free number for you, and replies go to your Textedly account instead of your personal/business number. I wish it had gone straight to my business phone in my case, but I simply put our business number in the message I sent out. Highly recommend, Textedly saved me hours and hours of time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Harris",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T05:28:55.000Z",
          "Titre": "I found the information I needed easily.",
          "Contenu": "I was exploring the possibilities for a small non profit that my wife and I do some admin work for. We haven't started sending multiple texts yet but I think we will begin soon. I found the information I needed easily."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cornerstone Fellowship",
          "Nb_Reviews": 2,
          "Date": "2023-04-12T20:37:35.000Z",
          "Titre": "I absolutely love Textedly",
          "Contenu": "I absolutely love Textedly. I use it for my small church to send out alerts, updates, events, and prayer requests. Easily tag certain groups, pick only certain subscribers, and add / delete as they want. The pricing is great. The website is so very easy to use. When I do have a question, the customer service is second to none. I highly recommend Textedly for all your group texting needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-03-14T17:43:01.000Z",
          "Titre": "Boost sales",
          "Contenu": "Textedly is the best and most immediate way to increase sales with a single message. We love it! We can send instant messages or schedule messages to go out on weekends and earn money while we are enjoying family and friends. We have subscribed to this service for many years. Thanks, Textedly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Vaught DBA PCPCIn.",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T23:51:29.000Z",
          "Titre": "There is still a copany striving to be the best for their customer!",
          "Contenu": "Like no one else.  great support from the get-go and it has not slowed down since my first call....and I called them last....I'm very glad I kept looking for a company like mine, striving to be perfect!Joe VaughtHouston, TX"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Wright/ Agency Owner",
          "Nb_Reviews": 2,
          "Date": "2023-10-11T18:02:05.000Z",
          "Titre": "I was able to quickly send an important…",
          "Contenu": "I was able to quickly send an important message to my clients that was time sensitive.  A mailer would have been slower and costly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 2,
          "Date": "2023-03-27T14:32:49.000Z",
          "Titre": "Easy to use and set up",
          "Contenu": "Textedly has made it really easy for us to deliver communications to all of our employees in regards to company news.  The user interface is really easy to use and the setup of the service is quick.  The customer service provided is amazing and very quick to respond."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T17:40:00.000Z",
          "Titre": "Highly recommend",
          "Contenu": "Textedly has been very easy to implement and learn to use.  They are helpful throughout the entire process and are available to answer any questions that may come up.  Using textedly has helped improve our communication with our clients and customers. I highly recommend textedly as a communication platform."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steph - BOGC",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T23:18:56.000Z",
          "Titre": "Highly Recommend",
          "Contenu": "We've been using Textedly for over 2 years now at our golf club - user friendly / a reasonably priced and effective tool to communicate with our members.  Highly Recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Spray Foam Genie East Texas",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T05:38:45.000Z",
          "Titre": "Textedly > Fantastically Simple",
          "Contenu": "Textedly is simple to use, great looking interface, and one of our top choices having used other SMS Platforms."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Dennis Company",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T23:23:42.000Z",
          "Titre": "Textedly has been an excellent partner…",
          "Contenu": "Textedly has been an excellent partner in allowing us to inform our customers of new items or with changes in our hours due to inclement weather.  We are a small business and Textedly allows us to communicate in a timely and efficient manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T00:45:00.000Z",
          "Titre": "Such an easy and amazing platform",
          "Contenu": "Such an easy and amazing platform. It has increased my sales and keeps me in touch with my loyal customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stonewall County Senior Citize",
          "Nb_Reviews": 3,
          "Date": "2023-05-24T01:39:04.000Z",
          "Titre": "Textedly does a phenomenal job!!!",
          "Contenu": "Textedly does a phenomenal job!  We have been with them for a year and a half.  With over 40% participation of ourentire community and with ZERO COMPLAINTS!  We highly recommend the Textedly Program!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Candidate",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T18:05:01.000Z",
          "Titre": "Amazing Service!",
          "Contenu": "Textedly was super helpful and beneficial during our campaign. Easy to use tools and quick response times"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris DeWitt",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T17:40:39.000Z",
          "Titre": "Once your number is working its a great product",
          "Contenu": "It was a bit confusing with the phone number approval process, but they helped me along the way and it turned out great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Talented Tenth Agency",
          "Nb_Reviews": 3,
          "Date": "2023-07-10T19:00:30.000Z",
          "Titre": "I have been using Textedly for 4 years…",
          "Contenu": "I have been using Textedly for 4 years to run text message marketing campaigns for multiple clients. Of all the channels that we use to reach customers, text messaging is the most effective tool for timely communications and targeted promotions. Additionally, their customer service is awesome! I highly recommend Textedly to any business or agency that wants to experience substantial growth that is sustainable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AKA-AGO",
          "Nb_Reviews": 2,
          "Date": "2023-04-24T22:46:07.000Z",
          "Titre": "Excellent Communication Tool",
          "Contenu": "We have been able to keep our members up to date with the latest information - information can be sent easily, timely and can include flyers along with text information.  This is a cost effective way to send information and it’s very easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura Selis",
          "Nb_Reviews": 2,
          "Date": "2023-07-26T03:26:02.000Z",
          "Titre": "I needed a flexible texting service…",
          "Contenu": "I needed a flexible texting service that was easy to navigate and had great customer support. I've used Textedly before, and I'll be back!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Texmax Auctions",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T16:28:38.000Z",
          "Titre": "Great product!",
          "Contenu": "Textedly has been a great platform for our business. It has the best pricing and is pretty easy to use. Support is super nice and i would definitely recommend this to any business needing a text platform."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Wright/ Agency Owner",
          "Nb_Reviews": 2,
          "Date": "2023-04-07T21:31:28.000Z",
          "Titre": "Improved Communications",
          "Contenu": "Textedly and staff made the texting program an easy transition for our team. By its design, it answers some deficiencies we experienced in communications with our clients. I look forward to exploring with the staff on maximizing the potential. Thanks,The Allegiance Group"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lakewood Chapel",
          "Nb_Reviews": 2,
          "Date": "2023-04-17T23:21:30.000Z",
          "Titre": "We have been with Textedly for years…",
          "Contenu": "We have been with Textedly for years now. We are very happy with their service and would never consider going with anyone else. They are very professional and go above and beyond. John EllesonLakewood Chapel"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D. Adams",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T17:09:45.000Z",
          "Titre": "Textedly - Great customer service and price point",
          "Contenu": "Great customer service and price point.  Our nonprofit has used this texting service for about a year and it's been useful in communicating with our volunteers, notifying our supporters about events, and organizing our volunteer groups.  When we've had any problems, customer service was quick to help us with friendy service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T18:48:04.000Z",
          "Titre": "Great Service",
          "Contenu": "By using Textedly, my organization is able to community with our members in a timely fashion. We are able to reach our membership with a click of a button."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelly Jones",
          "Nb_Reviews": 2,
          "Date": "2023-08-19T01:23:29.000Z",
          "Titre": "I love Textedly",
          "Contenu": "I love Textedly! Great recruiting tool for reaching out to applicants looking for a job and to text current employees!! I would definitely recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T02:30:11.000Z",
          "Titre": "Customer service was outstanding",
          "Contenu": "Customer service was outstanding! I tried Textedly for a special project and they performed very well. The web site portal was very user friendly and easy to understand. I plan to use them again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victoria S.",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T06:51:05.000Z",
          "Titre": "We recently signed up for Textedly and…",
          "Contenu": "We recently signed up for Textedly and we were able to reach out to our entire client database in minutes with a quick text message that generated extra sales from a customized text."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jan D",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T15:20:40.000Z",
          "Titre": "Very easy to use",
          "Contenu": "Textedly is very easy to use, extremely costly effective. And if there are phone numbers that are no longer in service, Textedly filters them out and you don't get charged. Will definitely use Textedly again!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mikki M.",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T23:57:23.000Z",
          "Titre": "I have been VERY happy with Textedly",
          "Contenu": "I have been VERY happy with Textedly.  It functions extremely well, it is very easy, and best of all, it has vastly improved my customer service.When a client texts in, textedly alerts me and I can respond in an instant."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mar mhauro",
          "Nb_Reviews": 2,
          "Date": "2023-03-18T13:47:17.000Z",
          "Titre": "Additional features like images and scheduling",
          "Contenu": "It's  very easy to set up and the customer service is very helpful. Textedly offer additional  features like scheduling texts and adding images to your text."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LaToya",
          "Nb_Reviews": 2,
          "Date": "2023-03-26T17:49:41.000Z",
          "Titre": "HIGHLY RECOMMEND",
          "Contenu": "Textedly have helped me so much with giving my clients update on what is going on with the salon and appointment updates. I even recommend Textedly to other business owners."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda T",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T23:16:18.000Z",
          "Titre": "Great platform for businesses!",
          "Contenu": "Easy platform to use. Lots of new great features like reviews, integration into social media, QR codes for easy subscribe, great pricing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tewelde's Family Market",
          "Nb_Reviews": 3,
          "Date": "2023-07-21T12:48:42.000Z",
          "Titre": "Very easy to navigate",
          "Contenu": "Very easy to navigate! If you can post on Facebook you can easily use Textedly.  Setting up text to send at a later time is super easy. Would recommend to all!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "VFW Post",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T14:24:58.000Z",
          "Titre": "Great for communication!",
          "Contenu": "Great way to keep in touch with our members!  We can send a text to our more than 500 members at one time keeping them up-to-date on events at our location."
        }
      ]
    }
  ]
}