{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "theinverterstore.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank Hash",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T16:59:35.000Z",
          "Titre": "Fed Ex dropped shipment!!!",
          "Contenu": "No fault of The Inverter Store but Fed Ex dropped shipment from rear of truck -4 feet straight down to pavement!!! Have not unpacked,awaiting instructions. There is obvious damage externally, but extremly concerned regarding internal damage to batteries. Advise please."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Malone",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T01:11:35.000Z",
          "Titre": "Well what can I tell you",
          "Contenu": "Well what can I tell you, this company has this policy that the refund of your money can not start intell the product is returned. This is a good policy unless, you never got the product. FedEx held the package for over a week before even attempting to deliver it, by this time the person it was perchanced for made other arrangements leaving me with nothing no package no refund. When I tryed to explain this delivery problem to the woman who answered the phones she told me about the policy then hung up the phone. So say very bad customer service. As of this writing I still have not received my refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Brose",
          "Nb_Reviews": 3,
          "Date": "2023-06-27T03:11:33.000Z",
          "Titre": "Terrible customer service + ripoff",
          "Contenu": "Terrible customer service! I placed two calls in two separate days…. two days ago! and haven’t received a return call. I returned something that I was not able to use. Still in the unopened box! They charged me at 25% restocking fee?!? I don’t know… they didn’t explain. And the invoice never even states the model number of what you’re purchasing, just a description of what it is. They suck!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jet Boat Ride",
          "Nb_Reviews": 1,
          "Date": "2022-04-10T13:51:53.000Z",
          "Titre": "Awful customer service",
          "Contenu": "Awful customer service, do not ship anything back as they will claim it was damaged in shipping and will notRefund. Disposed of return before ups could come and inspect.  Lost 1600 . Warning buy from someone else.  I have bought 3 inverters from invertor store  and will never buy again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris D",
          "Nb_Reviews": 1,
          "Date": "2022-09-07T20:03:28.000Z",
          "Titre": "TERRIBLE CUSTOMER SERVICE",
          "Contenu": "Serena is the person that I had the misfortune of speaking with.  TERRIBLE CUSTOMER SERVICE.  Hung up the phone on me twice. She was unable to answer my questions and became very dismissive when I asked to speak with someone else. Apparently she's the only person that works the phones, and has no customer service skills."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marcial Villa",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T22:56:54.000Z",
          "Titre": "Still waiting to receive my RMA",
          "Contenu": "Still waiting to receive my RMA tag,after informing what inverter was going to be used for,wrong inverter for application received.Need a pure sine wave 5k at 12vdc.Plan on upgrading and paying the difference for correct inverter"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Albert Flores",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T20:47:57.000Z",
          "Titre": "Pros and Cons, but it is going back.",
          "Contenu": "Pros: The battery arrived much sooner than predicted, although this could have backfired on me if I had to been away on vacation.Cons: The AIMS 200Ah battery is defective, it will not either take or give electricity. I spoke to \"Skye\"? at AIMS he said just return it, may be a bad BMS. I may or may not get the same item as a replacement, not sure yet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Les",
          "Nb_Reviews": 3,
          "Date": "2022-06-09T17:52:51.000Z",
          "Titre": "Disappointed with Inverter Store customer service",
          "Contenu": "Upon unloading my new AIMS inverter/charger, I found a broken black terminal cover.  I called the Inverter Store to see about getting a replacement and was told I could be sent one but I'd have to pay for shipping.  The explanation given to me was it is highly unlikely the cover was broken until I broke it.  This is untrue.  This is the third inverter/charger I have received from the Inverter Store and the first I have found a broken piece.  I asked to speak to a manager and was transferred to that person's voicemail but never received a reply.  When I order an AIMS product for my next RV solar power conversion, it will not be from the Inverter Store of Reno."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "maor morgan",
          "Nb_Reviews": 1,
          "Date": "2022-05-06T20:54:44.000Z",
          "Titre": "I order an inverter",
          "Contenu": "I order an inverter, for my new sprinter vanThe next day I gotten an email from them saying that they canacel the order because they think it’s a suspicious activity or credit card fraud , so I spoke with them on the phone explains that the van is been converting at the shop , and it needs to be shipped there , she said ok send me your drivers love and credit card we will fix it and verify the transaction, then they told me that I can go head and reorder it and , so I did and they canacel my order again And will not ship to me"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Larry Hubbard",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T18:29:38.000Z",
          "Titre": "Defective Product, No Satisfactory Response",
          "Contenu": "Generator was received missing the choke lever, so was returned for a cost of $45 in shipping. The returned generator was received at the Technical Department 7 days ago, and today I received an email that it could be another week before they even look at the generator. Meanwhile I have no generator, and they still have my $$. Very disappointing. I’m hoping I can just get my $$ back.I received a refund Dec 21, and wish it had all turned out better. I’m only out the $45 I spend returning the generator to the manufacturer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pierre DeCine",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T21:00:54.000Z",
          "Titre": "CRAP company",
          "Contenu": "They just sell other peoples items, you must return anything you don't want to it's individual producer. However, the items do not tell you who makes them ???"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Louis",
          "Nb_Reviews": 2,
          "Date": "2022-07-28T15:35:40.000Z",
          "Titre": "I ordered a solar carport",
          "Contenu": "I ordered a solar carport.  They had me pay in full including freight.  I paid on Paypal.  Then they made excuses about the delivery address and finally they cancelled the order telling me they did not have the product (their web site indicated they had 3 in stock).  A week later and Paypal says my refund of $12,800.00 is \"pending\"  but no money available to me"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Rice",
          "Nb_Reviews": 2,
          "Date": "2022-01-05T18:06:11.000Z",
          "Titre": "No mounting bolts/nuts",
          "Contenu": "No mounting bolts/nuts, as well as no instructions came in my package.  Contacted customer service via chat-told to email pics.  Tried to email-states mailbox down for maintenance."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chuck Holmes",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T00:48:15.000Z",
          "Titre": "My 12v/24v aims charger stopped working…",
          "Contenu": "My 12v/24v aims charger stopped working after two days, tried calling and left a message, their message was that someone would get back to me, but they never did."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Gatch",
          "Nb_Reviews": 2,
          "Date": "2022-03-29T16:24:47.000Z",
          "Titre": "I ordered the solar carport",
          "Contenu": "I ordered the solar carport. Paid the 750.00 delivery fee. A week later I got an email saying that there shipping department didn't want to deliver it to my address,  and told me I could drive 136 miles to come pick it up.  BAD BUISNESS Jim"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Myers",
          "Nb_Reviews": 2,
          "Date": "2022-04-04T16:11:36.000Z",
          "Titre": "No customer service",
          "Contenu": "No customer service, told to leave messages.They apparently do whatever they want. They determine what and how much is refundableMade several purchases - NO MORE"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T04:07:15.000Z",
          "Titre": "Used your online chat service to…",
          "Contenu": "Used your online chat service to determine proper system for garage door opener. Bought exactly what was recommended. Inverter insufficient to power garage door opener despite providing you with specifications. Was willing to just upgrade inverter, until your return policy at 20% and lack of consideration from customer service decided for me to go elsewhere. Incidentally after two calls to your tech-support I have never received a return phone call The only people that would talk to me was the sales department when I accessed them through your phone.Resolve problems by going to Amazon and buying larger inverter."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2022-01-27T21:50:11.000Z",
          "Titre": "Frustrating",
          "Contenu": "Very annoyed with the sales team here. I wasn't informed that I needed to find my own broker to get my inverter across the border. FedEx had to call me to let me know and my package was stuck for a few extra days. When I called the inverter store to complain about this I was hung up on. Only reason I can give two stars is because I really like the inverter.Edit:Not a very useful reply. I will of course be checking with international sellers in regard to this in the future. However,  I have made many purchases internationally in the past and have never had this happen. So I recommend that in the future you make it clear to customers with international addresses that they will need to handle brokerage for their packages. Your reply also does not address my primary concern which is that someone on your team hung up the phone on me. Because of this I am lowering this review to 1 star."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jill   M.",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T19:32:06.000Z",
          "Titre": "I would not give any stars",
          "Contenu": "I would not give any stars.  This company is very unprofessional from the top down.  We were changing signers at the bank in the middle of a transaction.  We sent a check instead of a credit card and they refused to serve us.  The manager was rude and the staff were rude. I would NEVER deal with this company ever."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonah Nside",
          "Nb_Reviews": 3,
          "Date": "2022-09-07T20:20:18.000Z",
          "Titre": "Extremely poor communication",
          "Contenu": "Extremely poor communication. Sent a brand new unit with broken fan. Sent pictures with 0 response. Its all good until after you give them your money.Ask your head guy that was emailed. Andrew Frey was emailed on 7-21-22"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ty Kelius",
          "Nb_Reviews": 1,
          "Date": "2022-10-29T07:47:12.000Z",
          "Titre": "I ordered this inverter from you guys…",
          "Contenu": "I ordered this inverter from you guys based on a phone conversation from you guys and recommendation from a contractor that only uses aims inverters. After receiving the inverter I opened the box and got the manual out. The wiring diagrams didn’t look right so I called in. Tech support immediately knew I wouldn’t be able to use what I had. and I needed a 120v version. He told me to fill out the email and return it. And to order the this other one. The new one came and work’s good. Then I get an email from PayPal for the refund and see that I was deducted 20%. I called in and spoke was transferred to a guy who told me the return was all scratched up. (It was not even out of the box on my end) he said I had to email the returns department. Did that days ago and have not received a reply."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "william brown",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T01:48:35.000Z",
          "Titre": "I am not happy with what you guys did…",
          "Contenu": "I am not happy with what you guys did to me for me and buy me you sent my stuff to the wrong address I didn't receive my equipment yet and it's still 2 weeks out I'm not happy with you and you you really did me dirty"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Myers",
          "Nb_Reviews": 2,
          "Date": "2022-04-04T16:09:16.000Z",
          "Titre": "The worst customer service",
          "Contenu": "The worst customer service.  Told to repurchase and they would refund on the other unit.  spent $50 to ship back. They refunded $100 less than purchase.And neither unit will not switch with a load. Almost $ 1000 spent, but no answers.  Not done with this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alex camacho",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T01:09:10.000Z",
          "Titre": "My purchase was rejected by a 3rd part…",
          "Contenu": "My purchase was rejected by a 3rd party company who thought it was a fraudulent transaction. I found it easier to shop elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hung Nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T03:02:12.000Z",
          "Titre": "The order was made in the sometime in August of year 2022",
          "Contenu": "We ordered two items, one for the charger and the batteries but I only received only the battery and your still charge me for two item I try to contact your too many time never get the answer back so how many start I can give your here"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "willard richardson",
          "Nb_Reviews": 1,
          "Date": "2022-03-02T17:20:42.000Z",
          "Titre": "I STAND BY MY STATEMENT I received the wrong inverter for my…",
          "Contenu": "I received the wrong inverter for my application. I have made 12 attempts to return it and all attempts have failed I don't believe that I will ever do business with them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 3,
          "Date": "2023-04-17T20:30:46.000Z",
          "Titre": "Scammed!",
          "Contenu": "Skye never told me to expect a bill to get my old battery back, IF they determined it to be within spec. They probably feel entitled to do this apparently because of it being in some fine print somewhere. Skye had at least fifteen minutes to explain THAT to me during our phone conversation regarding how to fill out the complicated online ONLY return process, you know, in order to return the exact same battery which they conveniently sold to me over the phone. However,  Skye did somehow find time to tell me during this complicated \"warranty\" return process, that I would have to pay for shipping to get it to them for any \"warranty\" (the bait?). Nothing but crickets regarding a MUCH higher, or ANY return shipping costs to me in order to get my original battery back?!  Please don't blame me for being doubtful about the \"failed warranty\", or \"within spec\" test results at this point. Or,  for feeling scammed by what I consider \"the switch\".   Skyes' lack of transparency, and honesty regarding return to Owner shipping costs likely wasn't accidental, or inadvertent. This whole return, & so called \"warranty\" transaction was definitely not transparent, or honest... Therefore I do NOT recommend this business."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jerry Gilmour",
          "Nb_Reviews": 4,
          "Date": "2023-01-17T19:56:35.000Z",
          "Titre": "AIMS 3200W generator w/ auto start",
          "Contenu": "Let me first say that I have used AIMS inverters and other products for quite a while and have found the products to be second to none in terms of performance and reliability. I will also say that their technical support people are unbelievably knowledgeable, helpful and available. I purchased the AIMS 3200 watt portable generator based on that experience and because of the auto start feature on this generator. It was compatible with my inverter and pointed toward a solution I was striving to achieve. I purchased AIMS LiFePo4 batteries, which are awesome and rebuilt my entire power station based on the auto start feature of this generator. When I had the entire system rebuilt, I put it to the test. It failed the test. When the inverter told the gen to start, it tried to start but did not. I reset the test multiple times and it failed every time. When I spoke to tech support, they asked about the outside temperature and when I told them it was slightly below freezing, they indicated that the lower operating range was about 30 degrees for a start. Given that temperature had a lot to do with the reason for converting to auto start, this rendered the generator useless to me. Despite the issue, when I returned the generator for a refund, I had to pay shipping for the return, a 20% restock fee and their cost of the initial shipping, a loss to me of about $350. I have reviewed the descriptions of this generator and there is no mention of this shortcoming. Given that a portable generator has it's place in cold surrondings, winter RVers, mountain cabins, etc., this seems to be a appropriate issue to mention. I feel a bit ripped off by my loss of $350. I'll likely continue to purchase AIMS products (assuming one of my inverters ever fails) but I certainly would not recommend this particular product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Isaac Friedman",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T05:54:17.000Z",
          "Titre": "you should more patience to your…",
          "Contenu": "you should more patience to your costumers"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Isaac Friedman",
          "Nb_Reviews": 2,
          "Date": "2023-08-30T23:32:10.000Z",
          "Titre": "you  don't have Passions to your…",
          "Contenu": "you  don't have Passions to your costumers"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bradford Graham",
          "Nb_Reviews": 2,
          "Date": "2022-05-11T21:21:18.000Z",
          "Titre": "Sent me the wrong panel rack trying to…",
          "Contenu": "Sent me the wrong panel rack trying to straight it out thank you"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Lindholm",
          "Nb_Reviews": 4,
          "Date": "2023-07-08T13:58:33.000Z",
          "Titre": "Ordered 12in battery jumper cable and…",
          "Contenu": "Ordered 12in battery jumper cable and got a 7in cable"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bill Chaney",
          "Nb_Reviews": 1,
          "Date": "2021-06-30T16:51:27.000Z",
          "Titre": "Bought a brand new inverter",
          "Contenu": "Bought a brand new inverter. paid the asking price. Received a dead on arrival unit. Was told they would not help me and told me to contact the manufacurer. Had to pay shipping cost to return the dead unit.None of this is my fault, but cost ME a lot more money. Could have bought a pure sine for what I now have invested in a modified sine unit."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ivan",
          "Nb_Reviews": 4,
          "Date": "2020-12-09T16:41:06.000Z",
          "Titre": "I believe I have received used material…",
          "Contenu": "I believe I have received used material without any information on how to use it, owner manual or whatever else. After talking to customer service for a return or exchange, they asked so many questions and so much information and conditions that I did not have anymore time and patience to continue.  Customer service not friendly at all and no, I won’t recommend anyone to do business with them.  Look somewhere else.Ivan B."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "sam barcus",
          "Nb_Reviews": 1,
          "Date": "2021-03-25T18:10:26.000Z",
          "Titre": "Dishonest company, bad customer service",
          "Contenu": "I ordered the wrong inverter and shipped it back. There were minor damages from getting dropped by fedex but the inverter store claimed that there was $940 in damages. We did get a claim paid for by fedex, but the inverter store is not willing to refund the remaining $500 and will not even return a call or email. On top of I believe being dishonest about the amount of damage, they are goin to stiff us for the remainder of the cost. Plus waste months of time trying to get this resolved."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Erik Poppke",
          "Nb_Reviews": 1,
          "Date": "2020-08-03T20:59:08.000Z",
          "Titre": "I ordered a lot equipment for my…",
          "Contenu": "I ordered a lot equipment for my Sprinter van conversion.  It took time to get to each installation.  I realized I ordered the modified rather than the pure sine converter.  Your return policy is costly to me and a lot of hoops to jump thru.  I'm better off selling it on eBay. Good for you, bad for me.  I will not be replacing it with you nor will I recommend to visitors to my van conversion site.erik"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Working man who urgently needed a good Inverter",
          "Nb_Reviews": 1,
          "Date": "2020-05-29T00:17:28.000Z",
          "Titre": "Very good inventory of products but…",
          "Contenu": "Very good inventory of products but limited and strange credit card processing system. After accepting and processing my payment, security related email was received and order was cancelled before I even verified the details. After two attempts and a few back and forth emails I decided to just cancel the order and purchased the same item on Amazon $150 cheaper, with free and fast delivery ..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John King",
          "Nb_Reviews": 1,
          "Date": "2020-05-25T18:50:05.000Z",
          "Titre": "Purchased an Aims PICOGLF30W12V120VR…",
          "Contenu": "Purchased an Aims PICOGLF30W12V120VR 3000 Watt pure sine wave inverter for my motorhome. It lasted less than a year and has been accepted for warranty repair almost 3 months ago.  Technician says he is waiting for parts. I consider this very poor customer service.  If it can't be repaired in a timely manner it should be replaced or a refund of purchase price."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marc Weissbach",
          "Nb_Reviews": 1,
          "Date": "2020-03-24T17:03:06.000Z",
          "Titre": "Really bad experience with a product, even worse experience with the “customer service”",
          "Contenu": "Really bad experience with a product that never functioned properly upon delivery, followed up by some of the worst customer service I have ever experienced.There is nothing worse than a company that refuses to deliver customer service and breeds a culture that is combative.My recommendation to everyone is to seek a company that sells reputable products, that has reputable staff.  This company has neither; read reviews about the experience other customers have experienced"
        },
        {
          "Note": 1,
          "Lieu": "CY",
          "Pseudo": "steven",
          "Nb_Reviews": 4,
          "Date": "2019-04-19T04:02:39.000Z",
          "Titre": "Broken x4 7000 watt inverters in 4 years.",
          "Contenu": "I installed my off grid pv system in 2014 - over 4 years I went through four 48 volt 7000 watt inverters - either due to sensitivity to dust / damp conditions or just gave I up the ghost. I have moved onto a different makers now with transformer inverter much better and better performance. AIMS are probably ok for occasional use  and are reasonable value but would not recommend running daily for solar house production. Steve B"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "christian jorquera",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T00:21:13.000Z",
          "Titre": "I got an item that never worked",
          "Contenu": "I got an item that never worked, and the seller \"the inverter store\" does not give the return label, it must be paid for by the buyer.  (I suppose that this method of selling defective items is supposedly lucrative) by the way, the cost of resending is approximately 35% of the cost. !!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GBould",
          "Nb_Reviews": 1,
          "Date": "2020-03-26T13:41:25.000Z",
          "Titre": "A small time operation with less than…",
          "Contenu": "A small time operation with less than straight forward policies on returns.  Very slow to communicate, over charge on shipping if returns are necessary. Restocking fee is ridiculously high.Reccomend choosing a different brand of inverter. The first one failed much too soon. Poor quality, even poorer customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2019-11-25T21:39:01.000Z",
          "Titre": "bad customer service and tec support",
          "Contenu": "don't trust them they talk in circles will not refund your money charged restocking fee 20% even though unit on website is listed for full value will not return unit said it is already processed very unhappy never dealing with them again no my response is the same do not buy from them if you have trouble you get no help"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "23",
          "Nb_Reviews": 2,
          "Date": "2019-03-05T06:32:21.000Z",
          "Titre": "Save your self the trouble and buy from a store that wants to help you because you gave them thousands of dollars.",
          "Contenu": "I buy this nice big solar set, I tell them i need it for an off grid system so i buy what the recommend and instead of giving me the correct inverter they decided to give me one that is too small for the panels i purchased from them. So when trying to wire it together its a nightmare because they sold me the wrong equipment and refuse to fix the issue.. Save your self the headache and buy from a store that stands buy its inventory and sales people."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Merrill M.",
          "Nb_Reviews": 1,
          "Date": "2019-02-26T00:03:36.000Z",
          "Titre": "I was sent the Inverter I asked for but…",
          "Contenu": "I was sent the Inverter I asked for but it was not what I needed even after talking to them on the phone and asking them for help and advise... so I sent it back to be exchanged, it arrived damaged and NO ONE WOULD take responsibility for it. AS such, I'm out over $1,500.00 and I have nothing what-so-ever to show for it...Horrible..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony Wagner",
          "Nb_Reviews": 1,
          "Date": "2020-12-02T18:12:34.000Z",
          "Titre": "Bad product, worse service",
          "Contenu": "They sent me a faulty AIMS inverter/charger.  They then charged me a restocking fee when I returned it and would not respond to me emails on the issue.  I've stopped shopping with this company.Their response is below, so I'll respond to their response:  I have at least three follow-up emails that were never responded to.  Also, any damage the unit sustained while being returned to you has nothing to do with it being faulty when I received it.  The items you docked me for were aesthetic.  A simple functional test would have confirmed the issues I was having."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RICHARD TRIGILI",
          "Nb_Reviews": 3,
          "Date": "2019-07-09T01:03:53.000Z",
          "Titre": "RICHARD TRIGILI  I GAVE A GREAT REVIEW…",
          "Contenu": "RICHARD TRIGILI  I GAVE A GREAT REVIEW I'M TAKEING IT BACK I ORDED THE WRONG FUSE  I CALLED BACK WITHIN 5 MIN TO CANCEL AND TO RE ORDER THE RIGHT ONE THE LADY FROM THE INVERTED STOER SAID NO PROBLEM TODAT JULY 8 2019      I RECEIVED THE ORDER I HAD CANCELED  THANKS INVERTER STORE   BAD BUSINESS"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Spies",
          "Nb_Reviews": 3,
          "Date": "2020-04-29T01:10:08.000Z",
          "Titre": "What happened, guys?",
          "Contenu": "Ordered a $750.00 inverter charger and was deferred to Fed Ex store for pickup. It was supposed to be shipped to my home so I didn’t have to go out in public, (I’m 73yrs old and at high risk) I then ordered a battery temp sending unit and remote switch for the inverter/charger. Again the package had to be picked up at the FedEx store. When I opened the box the temp sending unit wasn’t with the switch. The Inverte Store sent me an email saying they were refunding the price of the sending unit, with no explanation. This is not a responsible way to do business. Bob Spies an unhappy customer!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "david hines",
          "Nb_Reviews": 1,
          "Date": "2019-02-25T22:19:43.000Z",
          "Titre": "Huge flaw with inverter not listed on…",
          "Contenu": "Huge flaw with inverter not listed on the website but the low voltage alarm comes on at 21 volts and the inverter shuts down at 20 volts, for lithium ion batteries like I have that can run all the way down to 18 volts, this inverter is practically useless $2,000 paperweight"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe A. Unhappy Customer",
          "Nb_Reviews": 1,
          "Date": "2019-03-12T04:50:35.000Z",
          "Titre": "Bought a 220 single phase inverter…",
          "Contenu": "Bought a 220 single phase inverter which failed for my well. Kept dropping out, It failed. Customer support not good. Said they don’t repair thise units. Bought a second one; same problem. Not happy. Son bought me a gridtie And happy now.Anyone want to buy these units?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Receiving",
          "Nb_Reviews": 1,
          "Date": "2020-10-22T22:05:32.000Z",
          "Titre": "They were totally unhelpful after my cc…",
          "Contenu": "They were totally unhelpful after my cc was declined. My bank said the charge was approved. They had no one I could talk to just asked me to repeat the order. Then the card was declined again. Order elsewhere with no problem."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Erik Jensen",
          "Nb_Reviews": 1,
          "Date": "2019-03-04T20:21:16.000Z",
          "Titre": "Poor product quality",
          "Contenu": "Poor product quality, poor customer service.  After two years gave up on the product after multiple returns and bought another brand.  Don't waste your money on this . There are better products on the market for about the same price"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Jansen",
          "Nb_Reviews": 1,
          "Date": "2020-06-16T17:17:36.000Z",
          "Titre": "I returned your product and didn’t even…",
          "Contenu": "I returned your product and didn’t even open it and I didn’t get a full refund! 🤬🤬👎👎. I was the one who paid to ship it back to you!! How can you deduct something you didn’t even pay for?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Pfeiffer",
          "Nb_Reviews": 1,
          "Date": "2019-03-23T16:52:27.000Z",
          "Titre": "The item I ordered was garbage!!",
          "Contenu": "The item I ordered was garbage!!! Ruined almost everything in my house that had a transformer or coil in it. Due to it surging sending 220v.I emailed the company and still haven't gotten any feedback. The item# was pwrig300024120s.\"The 3000 watt pure sine wave inverter\"The first thing I noticed was that the cycles per second were not correct either. My electric clocks ran slow even with the unit being set to 60 cycles.After the electrical disaster l opened the unit up to check the circuitry and noticed that on the high power slide some of the transistors were scratched out very questionable.Buyer beware if you have this unit return it..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chad Connor",
          "Nb_Reviews": 1,
          "Date": "2020-08-17T20:01:55.000Z",
          "Titre": "Well I couldn't order (2) 200 AH…",
          "Contenu": "Well I couldn't order (2) 200 AH lithium batteries from your store.   My billing address is a PO box and they can't ship lithium batteries to a PO box.   Your system wouldn't allow me to add a shipping address.   So I couldn't buy $3,000.00 worth the batteries.  I called in to customer service to see if they could do it manually.  Obviously that shouldn't be hard to do.   I was told to go to Amazon by a lady that was less than nice.   You guys had a code that amazon wouldn't recognize for 5% off.   I figured at that point I would look else where.    FYI - I'm looking to upgrade a brand new trailer with solar, inverter, batteries.....the whole works and I just can't see buying anything from this place"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2020-06-02T11:42:06.000Z",
          "Titre": "Disappointing customer return experience",
          "Contenu": "Purchased $100 worth of the incorrect gauge wire( my fault). The female returns clerk informed me that wire could not be returned because it was made to order, even though there is a picture of the wire, with connectors, length and price on the website.My definition of a custom order is something made to a customer’s specifications rather than a product selected off the shelf. Clearly the product could have been easily resold.There was no effort by the clerk, who failed to identify herself, to make an effort to solve my problem. Not even an offer to sell me the wires that I needed. She was polite, but she ended our conversation rather abruptly with no further offer of assistance.(Order 31091)Guess my business will go elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Lucero",
          "Nb_Reviews": 2,
          "Date": "2020-01-29T19:23:48.000Z",
          "Titre": "I didn't really like the salesman guy…",
          "Contenu": "I didn't really like the salesman guy and I ended up with an inverter I didn't really want because I was just sick of talking to this guy and wanted to just get it done so sorry but only one star"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jeffrey sieler",
          "Nb_Reviews": 1,
          "Date": "2021-07-30T02:43:11.000Z",
          "Titre": "The users manual said it could be…",
          "Contenu": "The users manual said it could be connected to a car battery right out of the box. This turned out not to be true. I was charged $60 for shipping to return the inverter and cables."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Randi Oury",
          "Nb_Reviews": 4,
          "Date": "2021-08-03T15:13:13.000Z",
          "Titre": "NOT FOR SMALLER SOLAR PANELS, DESPITE WHAT THEY CLAIM…",
          "Contenu": "Before ordering the Adjustable Solar Side Pole Mount Bracket – Fits 2 Panels solar panel mount I contacted the seller and gave my exact dimensions of my two small solar panels purchased from another vendor.  I was told explicitly that this unit should \"work nicely\" for my setup.  The unit came with Zero assembly instructions so I once again contacted the seller. They sent me an online diagram and I got it put together.  Bad news is:  It was NO WAY going to fit my small panels.  Returning the unit at my own cost was not an option.  I had to make cross struts as no small expense, and got them mounted.  This unit is extremely unwieldy and difficult to obtain correct solar angles, much less tring to do it alone!  Can't imagine doing this twice a year for optimum solar angle.  Would NOT buy again!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Benny F. Woodall Sr",
          "Nb_Reviews": 1,
          "Date": "2020-08-31T16:12:01.000Z",
          "Titre": "Compliant",
          "Contenu": "back in Early/ Late July 2020 I ordered an inverter/ charger and had to a end it back for repair _ sent back 4 Aug received by you on 10 Aug with signature from UPS! Raise Elias of repair (AIMS Power) who I called to see if repaired(almost a week later), she said she couldn't  find it! Told her since they couldn't find it,  legally  she should send another! I told her it goes in an airstream trailer  that I had sold , received the money and the purchase  person is anxious! She said she couldn't  send me another! In that we are experiencing  a problem, I ordered  another,  I now have about $ 1500 spent including shipping and insurance! UPS is clear,  they delivered@ I am in process of reviewing all this with my lawyer who will inform me as to what action to take"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Teddy Transou",
          "Nb_Reviews": 1,
          "Date": "2021-07-12T14:05:55.000Z",
          "Titre": "It came with a broken chord and I…",
          "Contenu": "It came with a broken chord and I haven’t received the replacement. the second replacement chord they sent me was the wrong chord also. will be calling again today"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Advanced Mobile Automotive Services",
          "Nb_Reviews": 2,
          "Date": "2021-03-17T21:58:55.000Z",
          "Titre": "Poor Quality Product With Poor Customer Service",
          "Contenu": "Received the inverter, inverter was defective right out of the box. Contacted technical support, was issued a RMA# to return inverter for them to repair. That's when i discovered we were responsible for the shipping cost to return their defective product back to them, as well as to have it sent back to us after they repaired their brand new defective inverter. So i replied back to Jay Jones who issued the RMA#. Stating that i don't see how we should be responsible for the cost to ship their product that is defective right out of the box, especially since it is due to no fault of our own. And if this is the case, i just as soon return the entire order for a refund. Cut my losses on the return shipping, and purchase an inverter from another manufacturer. That's when communication ended on their end, there has yet to be a response back"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jay Curlee",
          "Nb_Reviews": 1,
          "Date": "2020-05-18T09:15:39.000Z",
          "Titre": "This is one of the worst vendors I have…",
          "Contenu": "This is one of the worst vendors I have worked with. Neither Tech Support, nor customer dis-service have responded. I  purchased 5 items that work together. The inverter does not work. These scum have done nothing to replace their junk yet. I know they will (one way or the other), meanwhile I have no power.5/15/2020 - Aims reply is a flat lie. Neither Aims Tech Support nor its Product Exchange team have emailed me. TheInverterStore sales team referred my email to both Tech Support and the Product Exchange teams, but neither bothered to answer. The liars know my email because their sales team copied me on two referrals.5/18/2020 - I just checked my emails again, still nothing. You people are disgusting. Immediately send a replacement for my faulty inverter or I will reverse charges on all 5 items. That was a big order and the thanks I get is this?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J Pena Trucking LLC Pena",
          "Nb_Reviews": 1,
          "Date": "2020-01-23T00:17:23.000Z",
          "Titre": "Your inverter last 5 months !!!!",
          "Contenu": "Your inverter last 5 months !!!! I even called and send a mail to ask for warranty , never heard of you back , sucks as company !!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "john gordon",
          "Nb_Reviews": 1,
          "Date": "2021-02-05T14:28:23.000Z",
          "Titre": "you sent me a broke pos and if i had…",
          "Contenu": "you sent me a broke pos and if i had known i would of spent 30 more dollars and bought new from somebody else"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Johnson",
          "Nb_Reviews": 1,
          "Date": "2021-01-01T18:08:34.000Z",
          "Titre": "Inverter i bought lasted 3 weeks under…",
          "Contenu": "Inverter i bought lasted 3 weeks under little use.  Im attempting to return this piece of junk now"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A.D.",
          "Nb_Reviews": 3,
          "Date": "2023-06-23T05:43:47.000Z",
          "Titre": "They are crooks",
          "Contenu": "They are crooked lies and thefs"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "PO'd",
          "Nb_Reviews": 1,
          "Date": "2020-02-06T05:07:14.000Z",
          "Titre": "Dont waste your money.",
          "Contenu": "not happy at all with the inverter. It burns up more juice than it inverts. piece of #$)(."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bradford Graham",
          "Nb_Reviews": 2,
          "Date": "2020-02-06T00:52:10.000Z",
          "Titre": "Very unhappy they failed to refund me",
          "Contenu": "Very unhappy they failed to refund me. For las unwanted order even through I returned it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Davis",
          "Nb_Reviews": 1,
          "Date": "2020-07-16T22:22:42.000Z",
          "Titre": "Poor technical support, no customer service.",
          "Contenu": "Purchased a 6000 watt inverter charger through the inverter store.  Installed it in my boat and had several problems.  It took several calls to tech support and if you don't get someone just hang up and call back because out of 5 messages, never once was a call returned.  Had to go through customer services to get an RMA to send the until back for repair.  $209 out of my pocket in shipping cost to send it back and  when it got to them they said it was destroyed in shipping.  I agree it was destroyed, and I even gave the UPS store a printed copy of the packing instructions.  I told them that I still needed a replacement unit, as that was the heart of my electrical system because of the way it has to be wired in.  I got a link to there website as a response from technical support.  It wasn't even a link to the correct replacement product.  I found the correct product, and it is now $200 higher than my original.  So I bought their product, it broke, I had to pay over $200 to ship it back to get them to fix it.  They didn't have to do anything because of UPS and they want me to buy the same product for a higher price.  I would end up with the same product along with spending $400 more and they would make 2 sales where they should have made only one and fixed that broken product under warranty.  Turned out great for them, sucked for me.  That's the last sale they will ever get from me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Weidemann",
          "Nb_Reviews": 1,
          "Date": "2021-03-04T21:21:44.000Z",
          "Titre": "They sent me the wrong product!!!!!",
          "Contenu": "They sent me the wrong product!!!!!! Still not resolved 3 weeks later!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matt Kedryna",
          "Nb_Reviews": 1,
          "Date": "2020-09-30T21:19:51.000Z",
          "Titre": "Crooks",
          "Contenu": "Crooks ! Thieves ! Buy from anyone else but this company ! BEWARE !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2020-06-06T21:00:43.000Z",
          "Titre": "I cannot review the order because I…",
          "Contenu": "I cannot review the order because I have never received the product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lana Browneye",
          "Nb_Reviews": 3,
          "Date": "2021-05-02T22:06:38.000Z",
          "Titre": "Heat shrink was done like a bunch of…",
          "Contenu": "Heat shrink was done like a bunch of kindergarten kids did it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tomas e Pena",
          "Nb_Reviews": 1,
          "Date": "2020-02-26T04:48:44.000Z",
          "Titre": "All my orders decline amazon ok",
          "Contenu": "All my orders decline amazon okYou guys r bad"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeff wolfe",
          "Nb_Reviews": 4,
          "Date": "2021-10-26T04:10:18.000Z",
          "Titre": "Were is the product i ordered ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Forsythe",
          "Nb_Reviews": 1,
          "Date": "2020-11-28T10:38:33.000Z",
          "Titre": "Never received my order!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "EA BARBOUR",
          "Nb_Reviews": 2,
          "Date": "2020-08-05T23:50:51.000Z",
          "Titre": "STOP BOTHERING ME"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 2,
          "Date": "2021-05-02T14:03:16.000Z",
          "Titre": "does not work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jack Perdue",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T17:17:29.000Z",
          "Titre": "Poor customer service",
          "Contenu": "During the purchase process the help was great after the purchase I called with a concern and was treated very poorly like my business was no longer valuable."
        },
        {
          "Note": 2,
          "Lieu": "BS",
          "Pseudo": "Kirk Spearman",
          "Nb_Reviews": 1,
          "Date": "2022-03-18T12:26:28.000Z",
          "Titre": "Taking my business elsewhere",
          "Contenu": "Using the website, I placed an order and specified General Delivery to a post office since we were traveling.  I also paid for 2 day shipping.The website software dropped the General Delivery part and the item was never delivered.We were eventually refunded our purchase price, but not our 2 day shipping even though this was a website error.  The shipping cost almost as much as the item.We sent an email to ask about this but no one ever responded.Will not use this company in the future.UPDATE: You are correct. We should have reviewed the order information that was sent to us more carefully.However, you have misrepresented several of the facts and have been misinformed as to what was actually said.Also, I will be glad to forward the email we sent earlier if you would like to see it. It seems from your tone and attitude that this would not have made a difference anyway. We stand by our original review."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gregg Henry",
          "Nb_Reviews": 1,
          "Date": "2022-04-20T06:09:59.442Z",
          "Titre": "Poor customer service",
          "Contenu": "I’m happy with the inverter I purchased, but the customer service was very poor.  I ordered a remote with my inverter and they did not send it.  When I informed them of the missing part they said they would send it right out, but after another week I called again and they finally looked into it and figured out it went clear across the US in the wrong direction and finally got it turned around.  It showed up after my big trip where I needed it.  Their shop is only 3 hours away from me, but they couldn’t get me the part in time.  When I contacted them they could have cared less.  I gave them several chances to get it to me on time and they didn’t care."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T20:25:28.000Z",
          "Titre": "All's good until shipped",
          "Contenu": "All was good until my inverter was shipped. Truck freight inverter was shipped to my billing address (home) instead of work address with a loading dock. So I called the inverter store when I saw where it was going by tracking number. Customer service told me they would file for a change of destination with Fedex corporate. I continued to watch the tracking and still no change. I got a call from Fedex hub near me to verify because it was comming via semi truck so location was important, we live in the smoky mountains! I explained where it was supposed to go and they understood but the Inverter store must make the change but stayed in contact with me. I called the inverter store once again and explained to them it was not changed and I have the number and email for the Fedex hub where it is going. The inverter store told me they can't do that and will only refile with Fedex corprate (not very nice about it!) for a address change (which did not work the first time!). So I had to call the hub and arrange to leave work meet the driver in route because only the shipper can officially change the address. Seems to me they only cared about getting the sale and did not care about what happens to a 4000 shipment once its paid for. I build several home energy systems a year for folks with tiny houses and thought I would try them out. As of now I will not use them again so that is probably 10k worth of equipment I will purchase from someone else. Customer service is very important and was sorely lacking. Just my experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "A.D.",
          "Nb_Reviews": 3,
          "Date": "2022-05-31T18:36:23.000Z",
          "Titre": "Customer service is very rude will not…",
          "Contenu": "Customer service is very rude will not listen and could care less if you do business with them or not."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Josh Grass",
          "Nb_Reviews": 1,
          "Date": "2021-12-18T07:33:34.000Z",
          "Titre": "Bought a charger for my battery",
          "Contenu": "Bought a charger for my battery.  Installed it and it diddnt work.  Tech support had me test it and told me to ship it back for a warrenty. At my expence.  They messaged me back that it was working and wanted to bill me for return shipping. $21 when i paid $12 to send it back. I had to call them and explain how it was broken and they retested. Called me back and told me it was indeed defective and told me they would send me a new one.  Then got an email that they are on back order. Had to call again and ask for a refund.  They did refund me the cost of the unit. But did not refund the shipping.  $18.  They are getting a poor rating because there product was defective and i feel they should refund me the shipping and reimburse me for the return shipping.  So. Buying an aims product costed me $30 for a defective part and a waisted month of my Life. Thaks aims!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charles Pellham",
          "Nb_Reviews": 1,
          "Date": "2022-04-08T13:35:00.000Z",
          "Titre": "Can't get anyone tonteturn my calls."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "michele raymond",
          "Nb_Reviews": 3,
          "Date": "2019-02-25T20:06:23.000Z",
          "Titre": "Customer service is a joke",
          "Contenu": "I purchased the wrong inverter. Sent it back brand new, never used in the same packaging than they charged me a restocking fee for used equipment, after I paid for return shipping. Than you get the replacement wanted me to pay more shipping, yet each order is free shipping. Returning item was a major headache. I did not get a replacement and went elsewhere"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Phillip Alley",
          "Nb_Reviews": 1,
          "Date": "2020-10-16T16:47:29.000Z",
          "Titre": "Fast at getting me out the door but…",
          "Contenu": "Fast at getting me out the door but when I got home my inverter had definitely been used or damaged before, there was dirt and placed on the housing showing wear... I would have returned but I simply didn't have the time I needed to get on the road ASAP so I just installed it anyway."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "George Roefs",
          "Nb_Reviews": 4,
          "Date": "2020-05-03T14:28:37.000Z",
          "Titre": "More power !!!",
          "Contenu": "Off grid Learning curve , going from modified, toPure sine wave was like turning on a switch , with Aims 3000 watt charger / inverter and fm80 outback solar controller. Yes still small , but off grid ! a power house up and running May 2nd 2020 is going to be a new world Thank you George"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Donald Arnold",
          "Nb_Reviews": 1,
          "Date": "2020-03-20T15:33:14.000Z",
          "Titre": "Better off ordering over the phone.",
          "Contenu": "The web site is really good at telling about the products they offer and they're kits. But the ordering experience was probably the worst I've ever had. It's very vague about how the product is shipped and there is no place for any kind of delivery instructions of any kind. When I ordered my kit I changed the email where I wanted correspondence sent but the website changed the email back to the previous one which held up my order for almost a week. And then when I finally called to find out what was going on with my order they were rude on the phone. I haven't got my kit yet so I can't say what kind of quality it is yet."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ron Hill",
          "Nb_Reviews": 1,
          "Date": "2019-07-23T13:11:07.000Z",
          "Titre": "Ordered and paid for the inverter on a…",
          "Contenu": "Ordered and paid for the inverter on a Monday. Friday I was waiting for delivery and at 3P.M. I get a text saying shipment was cancelled. Called The Inverter Store and was told it was cancelled because of lack of payment. Checked bank account and the full amount had been deducted from my account 10 minutes after order was placed on Monday. Called back to The Inverter Store and was told they couldn't do anything for me. Asked to talk to the manager and was told that I was talking to the manager and they could do nothing for me but I could go online to order and pay another one. VERY POOR CUSTOMER SERVICE. If they hadn't waited a week to inform me I could have bought from somewhere else and still had it on time for a very important use."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Wanda Swan",
          "Nb_Reviews": 1,
          "Date": "2020-02-05T18:30:44.000Z",
          "Titre": "The Inverter won't carry both of my…",
          "Contenu": "The Inverter won't carry both of my freezers, as I was told it would.Also, called the help line, left a detailed message as I was instructed, never got a call back."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matthew Cook",
          "Nb_Reviews": 1,
          "Date": "2020-08-15T18:40:11.000Z",
          "Titre": "Inverter not able to deliver as specified",
          "Contenu": "The store's user experience, checkout and delivery was very smooth.The inverter I purchased is a \"2000 WATT PURE SINE INVERTER WITH AUTOMATIC TRANSFER SWITCH 12 VDC TO 120 VAC ETL LISTED\".  I installed the inverter in an application where I had previously been running a 1800W Xantrex modified sine wave inverter.The new, supposedly more powerful inverter, is unable to run my 1000w microwave oven (Emerson MW9113SS 1000 W Countertop Microwave Oven.  1000W O/P with 1450W I/P) which the Xantex 1800W modified sinewave inverter ran without issue.This is not an installation problem.  I am a certified Systems Engineering Technician.  I'm using 0/2 cables over about 8ft from my yacht's house batteries.  The inverter is being amply supplied.  It is simply not able to deliver what it is rated to.  I am now stuck with functionality well below where I was before I attempted to upgrade.  This has been a very disappointing experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jonathan Reynolds",
          "Nb_Reviews": 1,
          "Date": "2021-09-29T02:28:51.000Z",
          "Titre": "review before delivery",
          "Contenu": "Maybe you should deliver on a product before asking me to review the inverter that is on back order for two months."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Hahn",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T22:06:27.000Z",
          "Titre": "The demo battery I received was…",
          "Contenu": "The demo battery I received was defective.  According to the AIMSB bluetooth phone app, the battery shuts off at 60 % SOC.  This is less than half the rated capacity.I shipped the battery back to AIMS yesterday at my own expense.  I ask that the shipping charges be reimbursed.I will order a replacement battery.  Just not a demo.Since this is the second bad battery I have received, I would strongly advise checking these batteries for correct function before selling them.On the plus side, customer service  went above and beyond to keep lines of communication open and to remedy the situation. For that alone they should be commended."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles Huckaby",
          "Nb_Reviews": 1,
          "Date": "2022-04-30T12:28:24.000Z",
          "Titre": "First purchaser",
          "Contenu": "First purchase from them bought an invertor and a remote.shipping was prompt and merchandise packaged well.after a few weeks the power light on remote quit functioning called and got transferred to tech support left a message 5 days later I called back after no response from them.tech support finally returned my call and instructed me to visit website to submit warranty issue.Sales person was friendly on the phone tech support not so much"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bruce Cook",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T05:24:56.000Z",
          "Titre": "Bad LCD and bad support",
          "Contenu": "I installed my inverter without problems. However, the LCD screen, which I was charged $184 for, did not work properly. It showed load outputs that were way off what I was running. I called tech support, but they were of no help. I then called The Inverter Store and told them my problem, and they told me to return the item for possible replacement. I sent it back and was then notified that I needed to give them $13 for my LCD to be sent back to me. They never specified what was wrong, nor did they offer to refund the $10 I had to spend to send their defective product to them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "STEVEN",
          "Nb_Reviews": 2,
          "Date": "2023-04-25T23:20:34.000Z",
          "Titre": "I did not like the fact I had to wait…",
          "Contenu": "I did not like the fact I had to wait to get an RMA via email, a day later, to return a faulty unit.  Most places give one out over the phone within a few minutes.  Down time is important to my company.  This was an unnecessary delay."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Poplaski",
          "Nb_Reviews": 2,
          "Date": "2022-12-10T16:14:06.000Z",
          "Titre": "I like the product quality and looks",
          "Contenu": "I like the product quality and looks. I do not like the back order date, I understand you have no control over it please do the best you can to get me my inverter A.S.A.P.                                       Thank You, Mark P."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lawrence Hume",
          "Nb_Reviews": 1,
          "Date": "2022-12-31T18:21:24.000Z",
          "Titre": "I cannot get the inverter to work",
          "Contenu": "I cannot get the inverter to work. It keeps blinking that it is charging."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff wolfe",
          "Nb_Reviews": 4,
          "Date": "2021-12-09T02:33:05.000Z",
          "Titre": "Slow service might be do to covid…",
          "Contenu": "Slow service might be do to covid otherwise it was received in good condition ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2022-07-26T17:21:39.000Z",
          "Titre": "Took a few months to get it but",
          "Contenu": "Took a few months to get it but, isn't that the new normal?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dustin Ayers",
          "Nb_Reviews": 1,
          "Date": "2021-09-22T23:42:10.000Z",
          "Titre": "The products I purchased are of high…",
          "Contenu": "The products I purchased are of high quality. The only reason for 3 starts instead of 5 is I believe the prices are extremely high. Amazon has the same style batteries with great reviews for 1/2 the price of the ones I bought from the inverter store. I wish I would have done a little more research before purchasing but I had recently bought a house that is completely ran in solar, I was in dire need of batteries to be able to make the house function, and I was recommended the inventor store by the original solar installer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matthew Lewis",
          "Nb_Reviews": 1,
          "Date": "2021-02-10T17:17:31.000Z",
          "Titre": "it came to iron mountain and ronald…",
          "Contenu": "it came to iron mountain and ronald lewis went and picked it up there was no info as to how to put it up ..made it hard for older people to try and do it got it up finally and is working pretty good but they would love some info on it incase they ever need to do anything else..if youd like to do that for them send infor on inverter and how to do it and batteries..they need it always !!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 3,
          "Date": "2021-02-03T23:52:04.000Z",
          "Titre": "Still haven't finished install so can't…",
          "Contenu": "Still haven't finished install so can't comment on how it works, ordering process was moderately worrisome because sales people are reading from a script and technical people don't know sales and won't return messages left on the answering service, it's alot if money to spend on something since their last one only lasted 5 years for a stationary installation."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 1,
          "Date": "2020-11-24T04:51:30.000Z",
          "Titre": "I was hoping this 5000 watt 24v…",
          "Contenu": "I was hoping this 5000 watt 24v inverter would outperform my old 3000 watt 12v inverter. It does not appear to so far. Not sure what the problem is yet. This 5000 watt inverter was missing the plastic connector covers depicted in the web site pictures. I found out later that they are no longer available. Seems like a potential shock hazard. Built in outlets are each only good for 1500 watts according to the manual."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-08-18T23:02:53.000Z",
          "Titre": "Received 200ah 12v lithium battery with…",
          "Contenu": "Received 200ah 12v lithium battery with instructions about obtaining Bluetooth connection app on Google Play or iOS. But was unable to locate any such app. is why I only give 3 stars. Normally I don't participate in reviews unless I have a gripe. So be careful what you ask for, you've already got my money."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Randy Whitworth",
          "Nb_Reviews": 1,
          "Date": "2020-10-14T16:07:52.000Z",
          "Titre": "The unit I purchased did not work when…",
          "Contenu": "The unit I purchased did not work when I installed it. It took 3 tries calling to get in touch with someone to help me return the item. I was sent an RMA immediately and have returned the unit. They said it would take several days to credit me. It has been about a week and I'm still waiting for credit."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Raymond Christopher",
          "Nb_Reviews": 7,
          "Date": "2021-10-22T15:58:42.000Z",
          "Titre": "Mixing Different Wattage Solar Panels",
          "Contenu": "After contacting sales with a request for additional 265 watt panels was informed that they were obsolete and not longer stocked.  Sales stated that they had 275 watt that I could purchase.  What they did not state that you could not mix the two different wattage panels. After purchasing, receiving and installing them problems arose with the controller being damages.  At that point I had to revert to gird power as the system I have was off grid.  System was then useless.  Had to order a controller and pay for it as there was no warranty for this malfunction caused by AIMS Sales not informing me that you could not mix panels."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "K Turner",
          "Nb_Reviews": 2,
          "Date": "2019-03-06T02:13:41.000Z",
          "Titre": "Technical help was great",
          "Contenu": "Technical help was great! Ordered what was suggested spending almost $3,000. Never had a question about the transaction until today when FedEx contacted me and ask me to drive 1 1/2 hours 1 way to pick up 2 of the packages because they weigh over 150lbs????? I asked them if that was the case then how were they shipped from Reno NV??? Lady told me I had 10 days to pick them up or they would send them back. I went and picked up my packages and it was an absolute nightmare!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2020-03-13T21:45:08.000Z",
          "Titre": "Use a salesperson if you can.",
          "Contenu": "Liked the chat support.  However would have preferred a salesperson to help with the order. Ordered wrong cables and probably would have been better off with different parts Rather than thinking I understood from chat discussions.  Did not work out as I hoped but will make use of what I purchased."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rex Hewitt",
          "Nb_Reviews": 1,
          "Date": "2020-08-15T17:06:09.000Z",
          "Titre": "The price I paid for what I wanted was…",
          "Contenu": "The price I paid for what I wanted was very good but I was not told the truth about what I ordered.  The person I live chatted with apparently didn't know enough about what they were selling.  I'm disappointed so far because the company refuses to make this situation right. I've emailed multiple times and get no help.  As of right now, I'm not sure if I will do business with this store again unless they are willing to work with me and correct this situation. If they were to make this situation right then I could say they earned 5 stars but so far that isn't was is going on."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Duke Wedemeyer",
          "Nb_Reviews": 2,
          "Date": "2020-05-01T01:56:51.000Z",
          "Titre": "Haven't installed the inverter yet.",
          "Contenu": "Haven't installed the inverter yet.Arrived sooner than estimated shipping ETA. 5 Stars... I am a little disappointed that it was made in China- thought it was made in Reno! Will provide more feedback when unit is installed and working."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Solo Hans",
          "Nb_Reviews": 2,
          "Date": "2020-12-05T12:25:42.000Z",
          "Titre": "I'm looking forward to using it",
          "Contenu": "I'm looking forward to using it. Its seems well built and arrived quickly but my good deal lithium lifepo4 battery took a crap. I will update review as soon as I get the battery issue taken care of. Thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Curt",
          "Nb_Reviews": 1,
          "Date": "2020-10-30T00:33:38.000Z",
          "Titre": "Great merchandise, unhappy shipping experience",
          "Contenu": "I ordered twice, the first time being an inverter/charger and two 12 volt 100AH batteries, cables, etc.  Shipping was a little over $40.  The second order was for two more of the batteries and cables - shipping was over $60 for less merchandise.For the first order, which came on a pallet, the FedEx driver kindly delivered the pallet to my garage door.  The second order, not on a pallet, was unceremoniously dumped on my front porch, with not so much as a courtesy doorbell ring.  That's a FedEx issue, not Inverter Store.To say the least, I was not pleased by having to pay 50% more for a much worse shipping experience.The equipment and batteries definitely meet my expectations, very high quality."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "V.Stouffer",
          "Nb_Reviews": 1,
          "Date": "2021-01-05T13:59:19.000Z",
          "Titre": "Caveat Emptor",
          "Contenu": "I ordered a single solar panel rack mount from the Inverter Store. The description of the rack online did not give the dimensions, nor did it state what was in the box; there was only a picture.  The item was shipped via FedEx and arrived box open and torn; however, it did not appear pieces were missing.  I assembled the rack and it does not include a frame for the solar panel nor clamps for the pole, as shown in the web catalog picture.  I contacted Inverter Store requesting assistance.  It has been a week and I've not heard back from them.  The rack was $31 and I feel for that amount I should get more than a triangle and some screws.  This transaction was not the worst rip-off but was certainly far from stellar."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "kenny g",
          "Nb_Reviews": 1,
          "Date": "2020-07-20T20:54:07.000Z",
          "Titre": "Bad crimps on cable kit",
          "Contenu": "Ordered a complete inverter kit, cables,& remote on/off! Upon installing I found the crimps for battery post weren’t crimped fully and deep enough... still a great all in one kit..... Cheers"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "NateofArk",
          "Nb_Reviews": 2,
          "Date": "2019-02-25T21:59:23.000Z",
          "Titre": "To put it bluntly",
          "Contenu": "To put it bluntly, a modified sine wave is a piece of crap.It's either a pure wave or go home.You should not even have them on the site which is why you get 3 stars."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jimmy MITCHELL",
          "Nb_Reviews": 1,
          "Date": "2019-08-10T14:04:25.000Z",
          "Titre": "Everything was received in good…",
          "Contenu": "Everything was received in good condition, but I did not receive a schematic diagram as stated online.  Where/when/how do I get it?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff wolfe",
          "Nb_Reviews": 4,
          "Date": "2021-10-14T04:05:38.000Z",
          "Titre": "Need my voice not happy with the…",
          "Contenu": "Need my voice not happy with the service  maybe pandemic either way  just looking for some batteries ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Tuggle",
          "Nb_Reviews": 3,
          "Date": "2020-01-23T00:48:31.000Z",
          "Titre": "I only have used THE INVERTER STORE…",
          "Contenu": "I only have used THE INVERTER STORE before; but after my last experience I may look for a different vendor."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bill Schmall",
          "Nb_Reviews": 3,
          "Date": "2019-02-26T02:51:22.000Z",
          "Titre": "In happy with the cables I bought",
          "Contenu": "Un-happy with the cables I bought, ALL the ends came off. The inverter works great.The meter works great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patrick Garrett",
          "Nb_Reviews": 4,
          "Date": "2019-02-25T23:48:47.000Z",
          "Titre": "I think I bought the wrong inverter but…",
          "Contenu": "I think I bought the wrong inverter but when I wanted to talk to someone about exchange it I got no reply."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard Carlyle",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T20:37:50.000Z",
          "Titre": "Took WAY TO LONG to get!!!!!!!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian Pelascini",
          "Nb_Reviews": 1,
          "Date": "2020-11-05T20:10:29.000Z",
          "Titre": "Not very helpful when try to get…",
          "Contenu": "Not very helpful when try to get information about system designs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian McGowan",
          "Nb_Reviews": 2,
          "Date": "2019-02-28T16:52:04.000Z",
          "Titre": "Wish it was better. Improving",
          "Contenu": "02/28/19The replacement unit arrived yesterday a day before the scheduled delivery date which was very nice. The unit appeared to be a new one despite the fact that I originally ordered a used unit. Thank you for that.I installed the unit last night and it appears to be functional. We will see if there is enough sun today to see it work from my control automatically.The Inverter Store did contact me to say they were addressing the packing issue and the fact that I got no answer about getting a schematic so I could repair my unit so that is an improvement. They appear to be addressing the issues that they can and I thank them for that.I am now going to set about getting my original unit repaired so I will have a spare. I will call the manufacturer and if that is not successful I will set about repairing it on my own.02/25/19The experience started with my nearly 4 year old inverter quitting. That was OK but when I called to ask how I send it back to be repaired I was told they only repair their inverter chargers. Since the charger part of that doesn't charge to a high enough voltage for my batteries so I can never own one of those. Requests for schematics so I can fix it myself were met with Silence.I decided to purchase one of their used ones to keep me going until I could figure out how to fix my failed one. The used one arrived missing the AC terminal strip screws and with a bent mounting bracket and two of the screws broken off because the packing allowed the inverter to move in the box. They had me send it back and told me when they got confirmation that it was picked up they would ship out a replacement. We will see what that looks like when it gets here.A little cooperation would help here. I have been without a working unit for several weeks now while I deal with this."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Gonzales",
          "Nb_Reviews": 2,
          "Date": "2023-10-20T15:29:16.000Z",
          "Titre": "Everything and Everyone helpful, BUT!",
          "Contenu": "So, I want you to know that the Inverter Store is a great place to shop for our needs.  Angel on the tech side of Aims is helpful and knowledgeable and a pleasure to work with. BUT! Your customer service rep on the Inverter Store telephone has been one of the rudest and most unhelpful on your payroll.  I hate to even call her, she could really use some tact, she has none.  I couldn't even give you her name, because even when I ask for her name it isn't given. I have pushed for her name I think it is Christine? But not sure, I don't know maybe she could answer the phone with cheer in her voice and \"Oh by the way this is (whatever is her name) HOW can I help you!  But no, it is like pulling teeth with the attitude one gets from your customer help line. She really needs an attitude adjustment.Christen Devine-Gonzales"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 2,
          "Date": "2023-09-04T22:07:38.000Z",
          "Titre": "I got exactly what I ordered",
          "Contenu": "I got exactly what I ordered.  The batteries didn't fit my battery boxes, but it was my fault since I did not check and verify the measurements.  I was able to sell the batteries to another boater.  I wish they had the same rated battery in a group 24 size,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Davis",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T22:57:09.000Z",
          "Titre": "Quick shipping",
          "Contenu": "Quick shipping , product was as advertised, good communication. I prefer not to purchase products manufactured in China, the advisor told me which ones meet those requirements. Thank You. Will use this site again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Raymond Wright",
          "Nb_Reviews": 1,
          "Date": "2022-01-19T19:56:01.000Z",
          "Titre": "The AIMS 4000W Inverter purchased was…",
          "Contenu": "The AIMS 4000W Inverter purchased was quick and easy. They failed to know the LCD driver circuit was below spec and thus the LCD was unreadable. Better testing and verification will improve service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff wolfe",
          "Nb_Reviews": 4,
          "Date": "2022-08-16T17:01:14.000Z",
          "Titre": "Hello",
          "Contenu": "Hello          The 12000  watt system works good but like wind power there  is limitations . One other thing the solar panels do not put out rated wattage ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "larry shipley",
          "Nb_Reviews": 2,
          "Date": "2022-09-20T02:11:05.000Z",
          "Titre": "connected a bad display cord",
          "Contenu": "connected a bad display cord, lost the control board on a 12kw 48v they had me covered, still had to pay one way to return. Better than paying for a new one"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Charles",
          "Nb_Reviews": 3,
          "Date": "2022-04-13T02:33:42.000Z",
          "Titre": "The experience online",
          "Contenu": "The experience online was very easy to complete my perches. The shipping was a little off but that was where fedex dropped the ball a bit. Overall it was a good experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T14:48:45.000Z",
          "Titre": "Customer service was very responsive…",
          "Contenu": "Customer service was very responsive and helpful when we described how we intended to use the systems we purchased. When there was a potential problems identified with one of the products, they were quick to provide a replacement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valens Plummer",
          "Nb_Reviews": 1,
          "Date": "2022-08-12T16:54:55.000Z",
          "Titre": "Very responsive",
          "Contenu": "Very responsive. Worked with me to change shipping time after the purchase. Combiner box is working great for my solar strings!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bradley Olson",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T22:37:22.000Z",
          "Titre": "Only packaging issues in shipping.",
          "Contenu": "Only issue was packaging of initial delivery which was resolved well in second packing approach."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Cox",
          "Nb_Reviews": 2,
          "Date": "2023-05-13T00:11:17.000Z",
          "Titre": "Easy order came on time and best of all…",
          "Contenu": "Easy order came on time and best of all no pushy salesman trying to sell alot of crap u don't want"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Cyr",
          "Nb_Reviews": 1,
          "Date": "2022-11-20T15:26:25.000Z",
          "Titre": "Good company to deal with",
          "Contenu": "Good company to deal with, easy order,  shipped efficiently, only downside inverter was made in China, expected USA built 🤔, good warranty, works as designed ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna Higgins",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T20:24:13.000Z",
          "Titre": "I give you 5 stars your service was…",
          "Contenu": "I give you 5 stars your service was fine. The only bad thing was the shipping.  Need to get rid of Fedx and try someone else my experience was bad bad bad"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 3,
          "Date": "2022-12-06T23:48:18.000Z",
          "Titre": "The speed that I received my items they…",
          "Contenu": "The speed that I received my items they were in good condition thank you"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Nana",
          "Nb_Reviews": 1,
          "Date": "2022-02-14T21:33:31.000Z",
          "Titre": "Great product and quick response on…",
          "Contenu": "Great product and quick response on customer support."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kyle Chinn",
          "Nb_Reviews": 1,
          "Date": "2021-08-24T02:24:21.000Z",
          "Titre": "This is a great generator",
          "Contenu": "This is a great generator!  I’m using it to power my cabin.  We have a 240 split system so I needed a generator with a 240 option.  It’s very quiet and takes quite a bit of load to change idle speed.  It is the EXACT same DB rating or maybe quieter compared to my neighbors Honda EU6500.  Very happy I purchased it.  And, if you have a problem, AIMS is very easy to deal with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan Trott",
          "Nb_Reviews": 1,
          "Date": "2021-06-17T16:53:38.000Z",
          "Titre": "Timely, Discounted, Excellent Condition",
          "Contenu": "The inverter charger I bought as used and discounted works perfectly, it came within 3 days on the 10 day free shipping fee. I'm now able to refrigerate and power swamp cooler for my 110 degree Redding Ca. day, much appreciation! Will spend more there when able."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Manning",
          "Nb_Reviews": 2,
          "Date": "2019-02-26T20:59:10.000Z",
          "Titre": "Kit is complete",
          "Contenu": "Kit is complete. Comes with everything needed to install. Of course, electrical disconnects, panels, breakers, etc., are not included.Sometimes, it is a little difficult to reach someone for questions , but, otherwise, very happy with purchase.It would be helpful if The Inverter Store offered Hybrid kits, equipment and support. It was the one area I found lacking"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barrington French",
          "Nb_Reviews": 1,
          "Date": "2021-06-22T14:02:49.000Z",
          "Titre": "Purchased a refinished 2000 watt  AIMS…",
          "Contenu": "Purchased a refinished 2000 watt  AIMS inverter, ( Model : PWRI200012120S)The unit has performed as outlined in it's specifications. This is a 2nd unit( previous purchase was a 1000 watt AIMS model)  I've purchased  from this company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Duke Wedemeyer",
          "Nb_Reviews": 2,
          "Date": "2020-05-25T03:45:42.000Z",
          "Titre": "Purchased Aims 2000 watt inverter…",
          "Contenu": "Purchased Aims 2000 watt inverter online and it arrived on time in perfect condition.I have only recently installed it in my Semi truck and it has.performed flawlessly thus far. I am using it to power my 700 watt microwave and phone and tablet chargers.It is made in China."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amanda K",
          "Nb_Reviews": 2,
          "Date": "2020-09-19T22:09:48.000Z",
          "Titre": "Prompt helpful attention from tech support",
          "Contenu": "I bought a rebuilt inverter that didn't work upon installation. I was assisted via tech support in determining that it was indeed the inverter and not my system so I could mail it back to be fixed. I was so happy to receive it back within a week of my mailing it out. Meaning only one day turnaround once it arrived back at the store. It gave me confidence that I would have personal attention for this very essential component of my tiny house solar system and that the AIMS power inverter itself was a durable piece of equipment worthy of rebuilding and fixing. I am very much in favor of such durability in a throwaway world."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Manson",
          "Nb_Reviews": 1,
          "Date": "2020-05-26T17:55:30.000Z",
          "Titre": "If you need tech advice ask for Andrew",
          "Contenu": "If you need tech advice ask for Andrew. Very informative and patient. I’d give them five stars except the other tech was short and impatient. After that I just asked for Andrew. Did everything he said and my system works great. Andrew gets 6 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jacob Tarter",
          "Nb_Reviews": 1,
          "Date": "2020-04-26T22:02:48.000Z",
          "Titre": "Good quality product",
          "Contenu": "Good quality product.  I was pleasantly surprised to find it fit well under the solar panel when mounted. 4 stars because I found it slightly cheaper on AMAZON after I ordered it and I would like to see screw mount holes in it for a more firm mount."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Albert Degaeta",
          "Nb_Reviews": 1,
          "Date": "2020-10-14T17:46:10.000Z",
          "Titre": "The first Inverter that was shipped was…",
          "Contenu": "The first Inverter that was shipped was defective. The first teck person said it was the fuse wanted a picture of the hook up that was made by me. I informed him that they did the hook up. He insisted on sending the fuse.Finally after some time I got some person who was more knowledgeable !! I order a new Inverter paid for it as a new order and did finally get a refund on the defective inverter unit that I returned.. The reason for the 4 stars is that the Inverter store did finally do what it should have done in the first place but some of the personnel believe you do not understand what is going on and that the units are  never defective . The new unit works fine!!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Keller",
          "Nb_Reviews": 1,
          "Date": "2019-04-01T23:09:05.000Z",
          "Titre": "I ordered the 900 inverter and a meter…",
          "Contenu": "I ordered the 1200w inverter and a meter ,service was really slow it took over a week for me to get the parts and then when I did get them I called their service tech and he gave me no help at all.he told me get it electrician to hook it up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nini Anderson",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T01:43:26.000Z",
          "Titre": "The products were good,but the staff…",
          "Contenu": "The products were good,but the staff was not helpful. They didn't seem very knowledgeable  when we asked questions.  We even got answers like, \"It's company secrets\" when we asked questions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Swafford",
          "Nb_Reviews": 2,
          "Date": "2020-08-10T19:50:21.000Z",
          "Titre": "The Aims Power 4KW inverter is a great…",
          "Contenu": "The Aims Power 4KW inverter is a great product.  The only reason for four stars instead of five is the delivery was slower than expected.  The product was well packaged and arrived without damage."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Earl Roemer",
          "Nb_Reviews": 1,
          "Date": "2020-02-12T03:23:28.000Z",
          "Titre": "THE INVERTER STORE called me within…",
          "Contenu": "THE INVERTER STORE called me within moments of receiving my recent order to give me a number of technical inputs...MUCH APPRECIATED!! (Received my order within the stated delivery time!!) Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Confluenceadventures.net",
          "Nb_Reviews": 1,
          "Date": "2019-02-26T20:59:20.000Z",
          "Titre": "Local pick up",
          "Contenu": "I ordered online and was able to pick up my order the next day since I lived close. It was for an emergency back up system which has worked perfectly. Website was a little confusing"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dixon",
          "Nb_Reviews": 2,
          "Date": "2021-01-04T19:46:56.000Z",
          "Titre": "I enjoyed shopping and buying the 720W…",
          "Contenu": "I enjoyed shopping and buying the 720W system and the personnel I dealt with on the phone and chat system and the website. The order processed and shipped quickly!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry Dombrosky",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T21:03:47.000Z",
          "Titre": "Good",
          "Contenu": "I don’t write reviews thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Manuel Farinas",
          "Nb_Reviews": 3,
          "Date": "2020-02-25T20:34:24.000Z",
          "Titre": "Very easy to use this website",
          "Contenu": "Very easy to use this website. The only change I would like to suggest is a word on the chat window.  The verb \"chatea\" is not in the Spanish dictionary."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "G. E. D.",
          "Nb_Reviews": 1,
          "Date": "2020-10-27T00:29:19.000Z",
          "Titre": "The solar panels are great",
          "Contenu": "The solar panels are great.  The MPPT charger could use a few improvements but gets the job done.Return of an inverter / charger was handled promptly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Denis",
          "Nb_Reviews": 3,
          "Date": "2020-04-24T17:09:12.000Z",
          "Titre": "it was a little difficult when talking…",
          "Contenu": "it was a little difficult when talking to tec support but after I called back and described my situation then they were very helpful"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 3,
          "Date": "2020-08-04T19:49:10.000Z",
          "Titre": "Customer service is great they took…",
          "Contenu": "Customer service is great they took care of me and they were very interested in getting the correct information to me thanks again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pat",
          "Nb_Reviews": 1,
          "Date": "2020-09-20T17:34:41.000Z",
          "Titre": "Kit was supper simple and worked great",
          "Contenu": "Kit was supper simple and worked great. Roof rack is not worth the time and money no instruction on how it mounts to the pannel."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SRB",
          "Nb_Reviews": 2,
          "Date": "2020-09-11T00:37:38.000Z",
          "Titre": "Great experience",
          "Contenu": "Great chat feature.  Fully sorted.  Would be cool to have enclosure options for self sourced battery/inverter setups."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Theodore Shulsen",
          "Nb_Reviews": 1,
          "Date": "2020-07-14T14:52:09.000Z",
          "Titre": "A good place to buy inverters.",
          "Contenu": "AGreat service. A little exspensive. Good product. No loyalty for repeat customers. Great tech help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick Lose",
          "Nb_Reviews": 1,
          "Date": "2020-08-08T02:41:03.000Z",
          "Titre": "The bluetooth option is very…",
          "Contenu": "The bluetooth option on the Lithium battery is very intermittent does not work most of the time."
        },
        {
          "Note": 4,
          "Lieu": "LC",
          "Pseudo": "David Bristol",
          "Nb_Reviews": 3,
          "Date": "2019-02-25T21:48:39.000Z",
          "Titre": "simple ordering system.",
          "Contenu": "simple ordering system.only issue is no instructions on the mounting of the unit which is critical."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "muhiddin maro",
          "Nb_Reviews": 1,
          "Date": "2020-10-21T23:47:10.000Z",
          "Titre": "very good inverter quite working on…",
          "Contenu": "very good inverter quite working on lowest charge of the battery.am happy thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sidney",
          "Nb_Reviews": 1,
          "Date": "2020-01-30T14:11:31.000Z",
          "Titre": "Items arrived on time and in good…",
          "Contenu": "Items arrived on time and in good condition.  Customer service was helpful when needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lenuel E Ferguson",
          "Nb_Reviews": 1,
          "Date": "2020-03-27T12:21:09.000Z",
          "Titre": "would have given five star but left a…",
          "Contenu": "would have given five star but left a phone call message and no call was returned"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Phil Patterson",
          "Nb_Reviews": 7,
          "Date": "2020-04-03T15:54:16.000Z",
          "Titre": "With some extensive ‘hands on’ test…",
          "Contenu": "With some extensive ‘hands on’ test trial experience with Aims Inverters and Lifepo4 batteries, and cabeling, including ‘real-world’ heavy inductive motor loading, I would (otherwise) rate Aims a full Five Stars, with my single reservation being their Technical help Dept, where product knowledge is uber vague and, mostly ‘on-the-fly’ improvised at best, with several of my email tech inquiries gone completely unanswered...I couldn't help but feel my email inquiries were being avoided (intentionally??), while during a separate phone-in tech related matter, experienced very rude phone demeanor (non-answer answers, argumentative!...) as well, demonstrating a complete lack of knowledge and unwillingness to answer the specifics of my product inquiry (i.e. Charger algorithms, ‘Smart fan’ meaning)...Hopefully, Aims will find a way correct this lone glaring departmental inadequacy, because other than this sole issue, regular ‘Customer Service’ is uber responsive, helpful and most pleasant to deal with : ) and the Aims products I’ve used (whether owned by me or others) are both solid and robust and a fair value...Despite this one recurring discrepancy, I could still recommend Aims Products to others (as I continue to...), and for a bit of advance clarity, note that product manuals (though sometimes sketchy...) can be found on their website...Still a 4 Star fan of Aims Products..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ted Webber",
          "Nb_Reviews": 4,
          "Date": "2019-02-26T11:58:55.000Z",
          "Titre": "So far the inverter works fine. Today I am going camping to check it out further."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert W Vanderpool",
          "Nb_Reviews": 1,
          "Date": "2021-04-02T01:06:18.000Z",
          "Titre": "Not a very friendly customer service…",
          "Contenu": "Not a very friendly customer service lady that answers the phone!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Meyers",
          "Nb_Reviews": 7,
          "Date": "2021-11-08T20:47:41.000Z",
          "Titre": "quick ship",
          "Contenu": "quick ship, good products, multiple purchases."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Howard",
          "Nb_Reviews": 5,
          "Date": "2020-10-17T18:36:20.000Z",
          "Titre": "Great customer service And selection of…",
          "Contenu": "Great customer service And selection of Products"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Mann",
          "Nb_Reviews": 3,
          "Date": "2020-05-04T05:26:30.000Z",
          "Titre": "product as advertised",
          "Contenu": "product as advertised, slow delivery."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Doug 03/28/2019",
          "Nb_Reviews": 1,
          "Date": "2019-07-11T13:05:51.000Z",
          "Titre": "Good Pricing and good delivery time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Gagne",
          "Nb_Reviews": 2,
          "Date": "2019-03-06T23:20:03.000Z",
          "Titre": "got the parts really fast."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Adams",
          "Nb_Reviews": 1,
          "Date": "2020-02-08T01:02:43.000Z",
          "Titre": "Very helpful and honest."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jon Beckett",
          "Nb_Reviews": 1,
          "Date": "2019-07-01T16:21:36.000Z",
          "Titre": "easy enough to order",
          "Contenu": "easy enough to order, TY"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patrick Garrett",
          "Nb_Reviews": 4,
          "Date": "2020-02-12T03:05:03.000Z",
          "Titre": "Got what I ask for."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Customer Mr. Marianito A. Macasa",
          "Nb_Reviews": 1,
          "Date": "2019-03-05T02:45:28.000Z",
          "Titre": "Very Good Product"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alejandro Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2020-02-04T15:33:34.000Z",
          "Titre": "have not use it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Art Boyt",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T01:45:07.000Z",
          "Titre": "Good service with great value.",
          "Contenu": "The 3,500 W true sine wave inverter that I ordered came in on time and was exactly as described.  The Inverter Store has become my go-to source for electronics of this type."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Faremouth",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T20:14:09.000Z",
          "Titre": "31 Bertram",
          "Contenu": "Inverter arrived on time and is working great. Let's see how long it lasts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Hash",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T16:26:23.000Z",
          "Titre": "Easy order process and customer service…",
          "Contenu": "Easy order process and customer service helpful.  My order arrived damaged but not Inverter Store's fault"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Huff",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T23:20:14.000Z",
          "Titre": "Great Communication",
          "Contenu": "I called to discuss the failure of a inverter that I bought a few years ago technician needed information that I needed to email him before a thorough diagnosis could be made.With winter coming on and the prior inverter lasted for four years  and performed well I bought another while the failed one was getting repaired and would become a backup. Speaking to both the tech and sales lady everything went smooth. I recieved the inverter in three days by ground."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard K.",
          "Nb_Reviews": 10,
          "Date": "2023-09-11T23:26:00.000Z",
          "Titre": "Good inventory ready to ship as quick as you need it.",
          "Contenu": "When you need the right cable or fuse or main component of your solar system it's nice to know you're likely to find what you need online at the inverter store and they'll ship it out as quick as you need it.  Plus expert tech support is usually quickly available."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike ️ Sokhy",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T17:05:51.000Z",
          "Titre": "Technical support",
          "Contenu": "Technical support has been amazing. Both Andrew and Angel are very helpful and they will do everything they possibly can to walk you through your project."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Renan",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T15:59:56.000Z",
          "Titre": "Satisfied with my purchase"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark S",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T21:54:55.000Z",
          "Titre": "I had a solar panel that Fedex broke…",
          "Contenu": "I had a solar panel that Fedex broke during shipment. I bought it from the Inverter Store and they drop shipped from AIMS. After emailing a picture of the broken panel and shipping label, the InverterStore/AIMS sent out a new one without any issues at all. Super great customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phil Patterson",
          "Nb_Reviews": 7,
          "Date": "2023-09-26T05:28:10.000Z",
          "Titre": "This is my fourth purchase from The…",
          "Contenu": "This is my fourth purchase from The Inverter Store, and have always been pleased with the sales expertise and experience, products and value quotient… Phil P. Carson City, NV."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Turnquist",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T03:18:00.000Z",
          "Titre": "Solar upgrade",
          "Contenu": "The sales staff was excellent,  the only part that sucked was the Fed Ex was semi tractor trailer and they go 260 miles round trip out of thier way to get it here and it took more than 5 days. Fed ex freight only services the Forsyth,  Montana area on Tuesdays only 1 delivery day a week here, I don't know why they don't have a box truck, his trailer was practically empty and the driver wouldn't drive my road. I had to get my loader out and meet him on cherry creek rd. If I wouldn't have had the loader I wouldn't have been able to get my delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wayne Olson",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T02:32:01.000Z",
          "Titre": "I have done business with the Inverter Store for over a decade",
          "Contenu": "I have done business with the Inverter Store for over a decade, and for reliable equipment, equipment represented well, delivery and sales they are great.    I haven't dealt with their Technical group in the last three years, but to be able to contact their Technical group ( Aims Power ) three years ago was tough to get hold of a Technician. Back then, it was quite frustrating, since I run two 6,000 watt pure sine / stand alone projects here on my farm. One for our home, and one for my Garage with apartment and water wells.     We will see how this 'round goes.       Moscow, Idaho"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard K.",
          "Nb_Reviews": 10,
          "Date": "2023-05-20T17:34:15.000Z",
          "Titre": "I received great advice from tech…",
          "Contenu": "I received great advice from tech support, ordered the battery and in ten days time it was delivered and I installed it.  After two days running it was fully charged and held the same amount of energy as the former two batteries.  I trust the equipment made by Aims Power and the sales people at the inverter store are super at filling orders quickly, directing you to tech support when they don't have the answers and showing you where to find products at the online store."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Glass",
          "Nb_Reviews": 4,
          "Date": "2023-02-17T00:19:56.000Z",
          "Titre": "Bumpy road to Smooth sailing",
          "Contenu": "I purchased refurbished unit but had issues with it's operation. Tech support was top notch, tech was in USA and we had solid communication. Unfortunately my unit was unusable. I DID experience anxiety at the start of the RMA process; ALL was resolved.I purchased a brand new unit and returned the problem unit with my delivery driver.Product is 12KW pure sine wave inverter, charger, and transfer switch. Using on a home solar project.My new system works wonderfully!! No Regrets."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Bonnette",
          "Nb_Reviews": 4,
          "Date": "2023-11-15T03:08:18.000Z",
          "Titre": "I always buy from the inverter store",
          "Contenu": "I always buy from the inverter store, great products, great help & if anything is wrong they are on it ........ Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard K.",
          "Nb_Reviews": 10,
          "Date": "2023-03-25T05:16:55.000Z",
          "Titre": "Long relationship",
          "Contenu": "Choosing, buying, installing and finally using your solar system can be nerve racking.  Knowledgeable easy to understand technical support makes all the difference. Orders are processed quickly and the best part is, the stuff works.  After spending thousands of dollars on Aims Power products for nearly a decade I have few complaints and many complements."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Starlight Electric of Central",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T11:12:08.000Z",
          "Titre": "User-friendly website makes it easy to…",
          "Contenu": "User-friendly website makes it easy to see what’s available and compare products. Shipping was quick and very reasonably priced. Just installed my 12kw inverter and lithium batteries yesterday so time will tell how well everything holds up but everything seems to be high quality. The inverter was very easy to install, all the connections are well labeled and the instructions are helpful. I would definitely recommend this company to anyone looking for inverter power."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard K.",
          "Nb_Reviews": 10,
          "Date": "2023-06-26T16:35:56.000Z",
          "Titre": "The shipment came quickly after being…",
          "Contenu": "The shipment came quickly after being ordered.  All the contents were as promised.  The PV Combiner box door was easier to open and close with the locks than the first one.  However like the first PV Combiner box installing the negative output lead wire into place had difficulty clenching the wire as I turned the screw.  I had to insert the wire and try tightening it about fifteen times before finally I felt the screw holding the wire in place.  I cannot see the bottom of that insert without taking the box apart and have no idea what prevents the screw from finding and tightening down on the stripped wire end?  Maybe the third box will be different?  Otherwise all products worked well.PS. The panels are extremely even as my charge controllers tell me the input and output of both the first set and second set of panels I ordered are nearly identical.  Wonderful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 3,
          "Date": "2023-07-12T18:33:11.000Z",
          "Titre": "Perfect for our application",
          "Contenu": "We installed a 300 watt inverter in our RV to power our CPAPs off the RV batteries and not have to run a generator all night.  Works great!!The inverter was shipped and received very timely.Would definitely recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben Catanzaro",
          "Nb_Reviews": 3,
          "Date": "2023-03-02T19:34:42.000Z",
          "Titre": "Great products and very prompt!",
          "Contenu": "Great products and very prompt delivery. Also, quick to reply with email information on product questions. Have purchased several batteries and cables for a power backup project and have been very satisfied. I will most likely always purchase other items from the Inverter store in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bo",
          "Nb_Reviews": 2,
          "Date": "2023-05-16T17:06:03.000Z",
          "Titre": "The way it should be",
          "Contenu": "I placed my order and received confirmation right away.  My purchase was shipped a few days later and at my place in a timely manner.  My unit arrived undamaged due to excellent packaging.  Fed Ex however, did try to damage the unit.  When it arrived a large hole was found in the side of the box.  Due to the packaging, there was no damage.  I have yet to fire up the inverter and I expect no trouble. Fine piece of equipment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben Hughes",
          "Nb_Reviews": 4,
          "Date": "2022-04-25T15:46:07.807Z",
          "Titre": "Received the $2,900 of batteries I…",
          "Contenu": "Received the $2,900 of batteries I ordered in good condition & timely (12 days).  All 12 had a 6.4 volt existing charge.  The AIMS AGM6V225A were the least expensive per amp hour that I found out of 13 quotes.  I have questions about inverters & charge controllers that I will be discussing with them in order to get the correct ones."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leif Wilkinson",
          "Nb_Reviews": 2,
          "Date": "2023-08-16T20:58:10.000Z",
          "Titre": "The inverter works great at a really…",
          "Contenu": "The inverter works great at a really good price. I had started with lead acid batteries but switch to gel deep cycle and really like how it works with those batteries so far really like the inverter."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Garrett Lawrence",
          "Nb_Reviews": 4,
          "Date": "2022-06-07T17:44:38.000Z",
          "Titre": "The Inverter store is fantastic to work…",
          "Contenu": "The Inverter store is fantastic to work with!  They are very knowledgeable and willing to support.  I am particularly happy with their AIMS product line.  I recently Had a blown fuse on an AIMS solar controller.  After further investigation, I found that the fuses were soldered in place, making it impossible to replace them.  I contacted AIMS and they replaced the unit under their two year warranty free of charge with no hassle.  I will continue using the Inverter store for all my solar needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy Minner",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T14:17:19.000Z",
          "Titre": "Get your power here!",
          "Contenu": "The Inverter store is the best place to buy your power needs. They are fast, friendly as well as helpful. I will definitely be purchasing again in the near future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melody Jones",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T20:09:41.000Z",
          "Titre": "Very helpful sales associates",
          "Contenu": "Very helpful sales associates. Knew the answer to every question we had regarding solar panels.My husband and I  also purchased inverter and controller from Aims and we have been very happy. Their tech support is always very helpful and informative. We would recommend them to anyone buying a solar system."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monte Rathbun",
          "Nb_Reviews": 4,
          "Date": "2022-12-29T01:59:44.000Z",
          "Titre": "installed the battery in my Micro Mini Winnebago",
          "Contenu": "installed the battery, updated my charger to handle the Lithium battery.  Then downloaded the bluetooth app.  The battery was sitting a 50% SOC as promised.  Did a discharge to 20% and then charged it up to 95%.  Went very smooth.  It's running my Inverter and all my 12 volt  circuits.  Looks great.  Best price and highest quality.  I couldn't be happier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 4,
          "Date": "2023-10-05T17:38:16.000Z",
          "Titre": "On point",
          "Contenu": "Been getting inverters from these guys for our growing fleet for years, great equipment, company and fast shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Beggs",
          "Nb_Reviews": 1,
          "Date": "2022-03-22T15:25:00.000Z",
          "Titre": "Exactly as represented!",
          "Contenu": "Had to replace the \"extension\" cord going from the generator to our electrical panel in the house. Only used when we lose electricity. Received the cord super quick to say the least. Really impressed with the delivery time & the cord. Would highly recommend the Seller/product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marvin Barnes",
          "Nb_Reviews": 2,
          "Date": "2023-01-24T04:21:10.000Z",
          "Titre": "I called the Inverter Store looking for…",
          "Contenu": "I called the Inverter Store looking for an inverter to help run our pellet stove insert. I was looking for a 1000 to 1200 watt inverter. I had just been advised the I needed a pure sine wave inverter. The friendly lady on the phone directly me to the correct inverter that I needed. I had difficulty placing this order with accessories so this nice lady placed the order and I was able to get the order 2 hours later. We were part of the multi day power outage and having the inverter will enable us to use the pellet stove. Thank you very much!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-02-09T22:42:09.000Z",
          "Titre": "So far, so good!",
          "Contenu": "Delivered on-time, intact and unmolested, cranks up after a few pulls and puts out power as I'd expect. Didn't test at full rated output, but I can tell the eco mode works."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Earl",
          "Nb_Reviews": 1,
          "Date": "2022-03-26T18:56:35.000Z",
          "Titre": "Great Customer Service, AT LAST!!!",
          "Contenu": "I indicated that we needed this inverter ASAP and it was shipped immediately so that we received it in two days!!AIMS inverters for us, have been the very best on the market. However, in the past, the customer service received from the Inverter Store had been the WORST we received from any company. The high quality of the product has kept us coming back!However, someone must have been listening and customer service has improved dramatically! I would not hesitate now to recommend them to anyone now! I am truly glad that this has happened!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "russell hattal",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T07:56:19.000Z",
          "Titre": "More power than I was looking for and…",
          "Contenu": "More power than I was looking for and for the same price and an added benefit it also has a charger, Yall also had every thing to go along with it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Aalderink",
          "Nb_Reviews": 1,
          "Date": "2022-04-20T13:48:40.344Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. I had to replace my inverter because of a major lightning strike several years ago. At that time thy tried to repair my inverter but as time went on too many problems. I called to order a replacement and it arrived with in six days. Excellent service. P S at the time of the repair they told me they didn’t think it was repairable. It worked for a while but too much damage"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Bush",
          "Nb_Reviews": 5,
          "Date": "2022-08-05T20:05:45.000Z",
          "Titre": "Dealing with The Inverter Store is…",
          "Contenu": "Dealing with The Inverter Store is always the most efficient people with knowledge of their products. Their service is above all other suppliers. I have been in solar business for 15 years. Charles Bush.  Off Grid By Design"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ducky",
          "Nb_Reviews": 1,
          "Date": "2022-07-12T20:01:14.000Z",
          "Titre": "Product was as advertised and shipped…",
          "Contenu": "Product was as advertised and shipped on time. Happy with service. Ames 1000 wt with 25/55 amp charger. Installation was not difficult for licensed electrician. I hope this one last longer than the Magnum it is replacing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott M",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T18:15:46.000Z",
          "Titre": "Super helpful on troubleshooting…",
          "Contenu": "Super helpful on troubleshooting previous purchases.  Helped us find the best value solution to our problem. Friendly and knowledgeable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jeffrey brodeur",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T00:16:20.000Z",
          "Titre": "I needed a charger converter in a hurry",
          "Contenu": "I needed a charger converter in a hurryI tried ordering the unit from Amazon and the seller screwed up twice. I called aims and got one real fast before the ups truck left with  pickups. The aims charger converter is quality construction and performs great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ricardo Santos",
          "Nb_Reviews": 1,
          "Date": "2022-06-05T06:29:24.000Z",
          "Titre": "Aloha all",
          "Contenu": "Aloha all, Outstanding prices and unmatched service and follow up! This is a first cabin company and would recommend them for all your generator needs! Thank you!R. SantosMililani, Hawaii"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "james seale",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T16:35:17.000Z",
          "Titre": "Quality service and parts",
          "Contenu": "The item was shipped on time and was packaged well to prevent damage. Tracking info was provided and customer service was there to answer any questions I had about the inverter. I would buy from them again.Thanks inverter store !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Garrett Lawrence",
          "Nb_Reviews": 4,
          "Date": "2023-05-25T15:55:31.000Z",
          "Titre": "Customer service is amazing!",
          "Contenu": "The staff are extremely knowledgeable and helpful. Aims warranty service is top notch.  They stand behind their products better than any other products I’ve used."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Brown, Premier Sharpening",
          "Nb_Reviews": 2,
          "Date": "2023-09-22T18:07:07.000Z",
          "Titre": "I was in a pickle",
          "Contenu": "I was in a pickle.  My work van was down.  I ordered a converter at about 4:00pm eastern.  Paid the extra for overnight on a Friday. It was on my doorstep at 8:45am on Saturday.  That is service. Hats off to FedX for their role in making this happen!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Albert G Rudick",
          "Nb_Reviews": 2,
          "Date": "2022-07-14T17:51:26.000Z",
          "Titre": "Great knowledgeable company",
          "Contenu": "Great knowledgeable company with great service and delivered items promptly.Dealt with other companies for weeks and they could not answer basic questions so I could place an order…Well done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dwayne Wilcox",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T19:20:54.000Z",
          "Titre": "My first set of solar was from you,no…",
          "Contenu": "My first set of solar was from you,no problems. Got a charger that goes to float before batteries charge. Need help! 207 267 0210"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terri",
          "Nb_Reviews": 2,
          "Date": "2023-06-22T20:11:53.000Z",
          "Titre": "Great Customer Service!!",
          "Contenu": "Everyone who works there is very knowledgeable and helpful. We called with several questions and they could answer every one. Thank you for all your help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debby",
          "Nb_Reviews": 2,
          "Date": "2023-03-31T18:35:50.000Z",
          "Titre": "Solar",
          "Contenu": "The order came promptly and is what I was expecting.  The person delivering it was very helpful, to move the solar right were I needed it. I will order from the inverter store again and recommend it to my friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sonja",
          "Nb_Reviews": 2,
          "Date": "2022-05-20T17:48:01.000Z",
          "Titre": "Installed and working perfectly",
          "Contenu": "Installed and working perfectly.  It is very exciting to be getting so much power from the sun!  I did install the small on/off switch on the other side of the wall from the inverter.  I like using the switch but I did have to run to the hardware store and get one.  The switch was not included.  I bought two new 2000w deep cycle marine batteries for the front of my Jayco trailer and that was a good purchase for the system.  I do not know anything about electricity so I had my mechanic install it along with installing two outlets, front and back of trailer. It took him about 6 hours to do it all, inverter, new batteries, switch and outlets.  He thought it was a very good system.  Happy adventuring!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dixon",
          "Nb_Reviews": 2,
          "Date": "2023-02-12T14:57:38.000Z",
          "Titre": "Easy!",
          "Contenu": "Simple, thorough website with all specs readily available. Decent prices, delivered on time. Have ordered many times from theinverterstore"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "david cogen",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T01:45:39.000Z",
          "Titre": "They replied immediately when I…",
          "Contenu": "They replied immediately when I enquired as to shipping date. And it had already been shipped and would be delivered the same day! Everything received as requested, no problems!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David C",
          "Nb_Reviews": 4,
          "Date": "2023-08-15T17:09:27.000Z",
          "Titre": "Super products",
          "Contenu": "Good product! No expensive frills which makes a great price.  Easy to talk to a stateside customer representative."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "deniski",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T19:20:18.000Z",
          "Titre": "inverter order",
          "Contenu": "We ordered an inverter and received it two days later, even though we live in a remote area. Absolutely thrilled with the new inverter. It is running our whole off grid cabin."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Glass",
          "Nb_Reviews": 4,
          "Date": "2023-01-27T22:10:48.000Z",
          "Titre": "I am believing that I have a great solution",
          "Contenu": "I am believing that I have a great product. My system is 180# and I am in the process of having help to secure the system.Shipping time was OK and the packaging wasn't damaged.Hope I won't need it but lifetime support for a product made in USA works for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Butcher",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T18:15:05.000Z",
          "Titre": "The 5000 watt pure sine wave…",
          "Contenu": "I ordered the 5000 watt pure sine wave inverter on Tuesday and it was delivered in two days, on the following Thursday.Extremely good service and it is exactly what I want!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 4,
          "Date": "2022-09-13T20:40:46.000Z",
          "Titre": "I purchased a charge controller and a main shut off switch",
          "Contenu": "I purchased a charge controller and a main shutoff switch, The technical support was just a phone call away. The support team is very knowledgeable and happy to help.My items were delivered on time and well packaged.Thank you for your service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Charles",
          "Nb_Reviews": 3,
          "Date": "2023-01-07T00:13:36.000Z",
          "Titre": "My order was processed on the first…",
          "Contenu": "My order was processed on the first business day after it was submitted thank you. I was informed that the holiday was going to change my delivery date by 1 day so I was given the option of ground shipping and they would refund my 2 day shipping or I could wait until Tuesday and they would still do the 2 day delivery it worked out perfectly Thank You"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark S",
          "Nb_Reviews": 5,
          "Date": "2022-08-27T19:12:47.000Z",
          "Titre": "Great inverter that fit my need",
          "Contenu": "I searched for quite a while before finding the inverter I needed and the one I purchased fit the bill perfectly. Item shipped on time and arrived in good condition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug Faraday",
          "Nb_Reviews": 2,
          "Date": "2022-11-05T16:50:25.000Z",
          "Titre": "Dealing with a good company",
          "Contenu": "Dealing with a good company, inverter was well packaged for shipment. Easy to shop on web site, also lots of info. Will likely buy more from Inverter store."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 4,
          "Date": "2022-10-13T22:31:08.000Z",
          "Titre": "I recently purchased a charge controller",
          "Contenu": "I recently purchased a charge controller and a main shutoff switch.  I was able to talk to the technician and with that help I was able to figure out what I needed.  Great sales staff and a great tech staff.  The equipment seems top shelf. I'm a novice so these things are important to me.   Thank you Inverter Store"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kenneth Allen",
          "Nb_Reviews": 3,
          "Date": "2022-12-21T16:02:34.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service.  I emailed a few questions in regard to the setup I needed.  The team was prompt and spot on.  They were able to set me up with the right combination of battery and inverter."
        },
        {
          "Note": 5,
          "Lieu": "BZ",
          "Pseudo": "JOSEPH",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T14:57:56.000Z",
          "Titre": "Shipped Quickly and packed well",
          "Contenu": "Shipped Quickly and packed well, unit was shipped to Texas then to Belize in same packing, arrived in excellent shape. Thank You."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "david g",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T17:54:42.000Z",
          "Titre": "This review is for: 300 WATT PURE SINE POWER INVERTER 12 VOLT 120 VAC INCLUDES CABLES",
          "Contenu": "This review is for:300 WATT PURE SINE POWER INVERTER 12 VOLT 120 VAC INCLUDES CABLESOn sale $98.00Bought a Group Size 27 12 volt deep cycle marine battery to test the inverter.The inverter is fantastic. It puts out exactly what the house does, 122 volt. It is very accurate, with seemingly no noticeable variation in voltage. That may be important running a laptop, a modem and a router as in sensitive electronics. Where we live in se Texas, we experience an occasional power outage. Not looking to power the refrigerator, only small electronics such as computer equipment and charging phones and charging flashlights. Also run a few led lights. At 95 degrees in the garage, never once did the fan come on, meaning the whole operation is quiet, just like I like it.Kept it running all night, computer equipment with clamp lights and all, all night and it only took the battery down 15% in 12 hours running.Very low insufficiency at 10%I have a 2200-watt generator (inverter), but that is too much work for a 12 to 24 hours outage. It’s also too noisy, we have full house generators in our neighborhood, and they are way too loud.The 300-watt inverter is perfect for small things, and I don’t have to start the generator and mess with fuel for a 48-hour outage.Very handy, solid and easy to use.Single AC receptacle – USB PortAlso works great in the car, remember not to draw more than 180 watts when plugged into the cigarette lighter.The price includes two sets of wires.Enclosed DC battery connectionsConvenient cigarettes plug & alligator clips (To protect the vehicles wiring, the vehicles cigarette lighter adapter can only handle 180 watts, if you are going to use more than 180 watts you must wire inverter to battery)Continuous output power: 300 WattSurge power capability (peak power): 600 WattDC input / operating voltage: 10 to 15 VOutput voltage: 120 VOutput voltage regulation: +/- 3%Output wave form: pure sine waveOutput frequency: 60 Hz +/- 2HzDC amps: 25AC amps: 2.5Battery low voltage alarm: 10.5 +/- 0.5 VBattery low voltage shutdown: 10.0 +/- 0.5 VNo load power consumption: < 0.7 DC ampsFull load efficiency: 90%1/3 load efficiency: 95%No load minimum operating temperature: -15 degrees CelsiusFull load maximum operating temperature: 55 degrees Celsius (automatic shutdown)AC Output Socket Type: Type 2 -3 prongHigh input voltage protection: 15VLow input voltage shutdown: 10VProduct size (D x W x H): 7.25″ x 4.75″ x 2.125″"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "richard riggle",
          "Nb_Reviews": 3,
          "Date": "2022-08-07T16:13:18.000Z",
          "Titre": "Batteries i have 4 deep cycle still…",
          "Contenu": "Batteries i have 4 deep cycle still building up my power bank holds power well and runs what I need to run with my power awesomeness"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan Keil",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T15:07:28.000Z",
          "Titre": "I ordered some flexible solar panels…",
          "Contenu": "I ordered some flexible solar panels that had the wrong spec sheet. I liked the panels anyway and we worked out a good solution for both of us in short order. Would shop here again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DC",
          "Nb_Reviews": 2,
          "Date": "2023-05-27T21:09:18.000Z",
          "Titre": "Pricing (sale) and delivery as…",
          "Contenu": "Pricing (sale) and delivery as promised.  Haven't gotten the system fully hooked up yet, but so far so good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phil Patterson",
          "Nb_Reviews": 7,
          "Date": "2022-03-25T16:28:21.000Z",
          "Titre": "This was my second Aims lithium 200a/hr…",
          "Contenu": "This was my second Aims lithium 200a/hr battery purchase and couldn’t be happier - great service and tech support - so glad I ditched my former lead acid dinosaurs!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Geoff Smith",
          "Nb_Reviews": 4,
          "Date": "2023-09-01T05:28:29.000Z",
          "Titre": "The Sales team was response to all my…",
          "Contenu": "The Sales team was responsive to all my requests and gave me a great price on the batteries."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "moonmotor",
          "Nb_Reviews": 2,
          "Date": "2022-10-16T01:24:14.000Z",
          "Titre": "This is a backhanded review",
          "Contenu": "This is a backhanded review, but I ordered the wrong system and TIS was very accommodating and got my order cancelled before it shipped. I’m still configuring my system, but will order my components from TIS for sure!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marsh",
          "Nb_Reviews": 5,
          "Date": "2022-08-15T15:11:45.000Z",
          "Titre": "300W Pure Sine Wave Inverter 12VDC to…",
          "Contenu": "300W Pure Sine Wave Inverter 12VDC to 120VAC.Perfect for my application. No problems. Works as expected. Clear and concise documentation. I would recommend to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Manuel Morales",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T00:17:51.000Z",
          "Titre": "Their tech support is great as well as…",
          "Contenu": "Their tech support is great as well as their customer service. What more could one ask?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Gibbons",
          "Nb_Reviews": 2,
          "Date": "2022-06-26T17:34:50.000Z",
          "Titre": "Shopping was quick and easy",
          "Contenu": "Shopping was quick and easy. Delivery was prompt. However, there was no tracking data that I could find. If it was in there somewhere and I didn't see it, I apologize."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stan Cloyd",
          "Nb_Reviews": 1,
          "Date": "2022-05-14T09:08:17.000Z",
          "Titre": "It was very well packaged and shipped…",
          "Contenu": "It was very well packaged and shipped in a timely manner.  Their principle engineer has responded promptly to my concerns."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Davis",
          "Nb_Reviews": 1,
          "Date": "2022-08-21T15:34:05.000Z",
          "Titre": "Awesome",
          "Contenu": "Awesome, they have great prices, and delivery was fast. This is my second inverter from them and will definitely come back."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric S.",
          "Nb_Reviews": 4,
          "Date": "2023-10-26T18:00:48.000Z",
          "Titre": "Great quality products",
          "Contenu": "Great quality products. As described, delivered on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Baggett",
          "Nb_Reviews": 1,
          "Date": "2022-08-18T21:15:42.000Z",
          "Titre": "Received as ordered",
          "Contenu": "Received as ordered, timely service. Inverterstore had product when others sources were out of stock . Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dan willison",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T00:44:03.000Z",
          "Titre": "extremely awesome service",
          "Contenu": "extremely awesome service,  inverter arrived quickly,  ordered at 3 pm on Wednesday it arrived in south Carolina Thursday afternoon.  living off grid we need awesome support an supplier's like this."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Biertzer",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T19:59:09.000Z",
          "Titre": "Got everything in a timely manner",
          "Contenu": "Got everything in a timely manner. It was shipped to the house and even thou it was a heavier package Fed-ex dropped it off. Everything looks good. My electrican will be installing it in the next month and I will update then."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Wright",
          "Nb_Reviews": 2,
          "Date": "2023-03-02T17:10:05.000Z",
          "Titre": "Combiners are built well",
          "Contenu": "The combiner boxes are quality equipment, from the case to the internal components.  All wires look to be appropriate gauge for the application and all of the components are mounted securely.  Internal baffles make all of the internal connections secure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Kern",
          "Nb_Reviews": 2,
          "Date": "2022-04-14T12:24:55.000Z",
          "Titre": "We have used the Inverter Store…",
          "Contenu": "We have used the Inverter Store multiple times for our Mobile Dog Grooming business and the latest was upgrading our batteries to the Lithium 200 amp batteries.  As always, fast shipping, good customer service,  and they are always happy to answer my tech questions when I call about our inverter systems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Davis",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T16:56:39.000Z",
          "Titre": "I had made an error when I ordered my…",
          "Contenu": "I had made an error when I ordered my first inverter from The Inverter Store, they immediately shipped me a new correct one, fast service and so far, I have just bought the second one for my Toy Hauler and the service/delivery was very very fast and well packaged, good service, but I prefer to talk to a person when ordering (I am kinda old fashioned) and it has always been a great experience, the real deal, honest and efficient! Great supplier, and very honest!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Halco Testing Services",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T02:54:27.000Z",
          "Titre": "Highly recommended",
          "Contenu": "Highly recommended. Our previous inverter gave out desperately needed another to keep up with production. The inverter store delivered in time to help us out!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Teresa Carney",
          "Nb_Reviews": 2,
          "Date": "2023-07-27T22:47:38.000Z",
          "Titre": "Great place for your connection for a new inverter.",
          "Contenu": "Custom service is awesome and also tech support. Excellent pricing and shipping fast, plus updates."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Sembrat",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T17:18:08.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service. They worked with AIMS to solve a mistake made by me in ordering the wrong inverter."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Rockett",
          "Nb_Reviews": 2,
          "Date": "2022-04-07T15:38:58.000Z",
          "Titre": "Whenever I need an inverter I come to…",
          "Contenu": "Whenever I need an inverter I come to the inverter store they always have what I need Not to mention a quick turnaround in getting the product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Bowman",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T01:41:38.000Z",
          "Titre": "Easy to deal with, friendly knowledgeable people",
          "Contenu": "Friendly staff"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Hammond",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T01:12:36.000Z",
          "Titre": "Great inverter",
          "Contenu": "Great inverter, has no problems with running 20 to 25 amp items on the full power socket!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dana",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T21:57:49.000Z",
          "Titre": "Prompt delivery",
          "Contenu": "Prompt delivery.  Also, they gave me great technical advice prior to the sale.  Would buy from here again."
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "Christopher Sandlin",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T15:47:21.000Z",
          "Titre": "Super fast shipping and good packaging!",
          "Contenu": "Super fast shipping and good packaging!Would absolutely do business with again as needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Isaac Penn",
          "Nb_Reviews": 2,
          "Date": "2023-03-22T02:05:27.000Z",
          "Titre": "Product came on time and as described",
          "Contenu": "Product came on time and as described. We have installed both inverters and they are working great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "richard riggle",
          "Nb_Reviews": 3,
          "Date": "2022-05-06T16:52:14.000Z",
          "Titre": "Haven't hooked my system up yet but…",
          "Contenu": "Haven't hooked my system up yet but very satisfied on delivery came real quick"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nater Thiessen",
          "Nb_Reviews": 2,
          "Date": "2022-07-06T19:38:30.000Z",
          "Titre": "Great helpful sales staff",
          "Contenu": "Great helpful sales staff. Everything was well packaged, great quality products, awesome website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Peltier",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T22:07:26.000Z",
          "Titre": "Order the inverter",
          "Contenu": "Order the inverter, they shipped it, and we received the inverter in less than 2 days. Very appreciative of the fast shipping and great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Panagos",
          "Nb_Reviews": 2,
          "Date": "2022-07-14T20:12:05.000Z",
          "Titre": "The inverter is well made and the tech…",
          "Contenu": "The inverter is well made and the tech people were great in helping me determine which inverter I needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "richard riggle",
          "Nb_Reviews": 3,
          "Date": "2022-12-24T16:17:26.000Z",
          "Titre": "Great products I bought 4 100 amp…",
          "Contenu": "Great products I bought 4 100 amp batteries a 30 amp charge controller and a 1500 watt inverter to live off grid to back that system up I have bought a 2000 watt inverter generator to help system if needed or if there not enough sun love all the aims products I bought all matches 😀"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russell DePrima",
          "Nb_Reviews": 1,
          "Date": "2022-07-15T18:02:21.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service!  Very friendly crew. And a great inventory of Aims products.  I will be buying again from them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon Hawkins",
          "Nb_Reviews": 1,
          "Date": "2022-07-08T23:41:31.000Z",
          "Titre": "I am very happy with the cost and the…",
          "Contenu": "I am very happy with the cost and the fact it's size is smaller than most and easier to conceal it in a RV"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard K.",
          "Nb_Reviews": 10,
          "Date": "2023-10-21T19:43:28.000Z",
          "Titre": "Stick with what works",
          "Contenu": "The company and the products consistently fulfill expectations on time with helpful sales and technical support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Wilson",
          "Nb_Reviews": 6,
          "Date": "2022-08-10T13:23:19.000Z",
          "Titre": "Called the tech dept several times",
          "Contenu": "Called the tech dept several times, J was always helpful. He's a good service rep."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Alsop",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T23:16:07.000Z",
          "Titre": "Excellent advice from the support team…",
          "Contenu": "Excellent advice from the support team and I love the product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Yates Educators",
          "Nb_Reviews": 1,
          "Date": "2022-03-23T19:36:02.000Z",
          "Titre": "The woman who helped me over the phone…",
          "Contenu": "The woman who helped me over the phone was patient and knowlegable. She  is an asset to the company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zack Guinn",
          "Nb_Reviews": 1,
          "Date": "2022-03-24T12:47:43.000Z",
          "Titre": "The shopping process was quick and…",
          "Contenu": "The shopping process was quick and easy, the package delivered on time and packaged well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlie Kelso",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T03:42:21.000Z",
          "Titre": "Great little Generator",
          "Contenu": "The service on line was excellent, my questions ask were answered immediately, purchase was hassle free, delivery was the fastest, received and used to to charge some batterys up in equipment and in our camper, very quiet, we bought it to take it with us in our side by side on camping trips, we love it so far!"
        }
      ]
    }
  ]
}