{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "ticketmaster.ca",
      "Review": [
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Heather",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:53:34.000Z",
          "Titre": "I was unable to purchase 5 tickets",
          "Contenu": "I was unable to purchase 5 tickets, because there were only groups of three remaining for purchase. Due to their policy, you cannot orphan a seat, which means I couldn't purchase less than 6 seats. I thought considering there was no other option to purchase a group of 5 seats they would reconsider their policy for the sale. But they gave me the run around via email and phone for two days, I repeatedly asked to speak to someone who could help me book the tickets, but was sluffed off. I asked twice to speak to a manager and they never provided any contact for a manager and no manager contacted me. I give up, both of our losses they lose a 5 ticket sale, and we don't get to see the event. :("
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Alex S.",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T21:55:04.000Z",
          "Titre": "Too much work, too many hoops, too many added charges for no work on their part. I'm out. For good.",
          "Contenu": "I like that this prompt begins with the line \"Tell is what went wrong this time.\" Well, exactly. I'm used to dealing with Ticketmaster's arrogant, monopoly-driven, AI-reliant way of doing business, and their service charges for no work on their part, so I went in with my eyes open, fully expecting to be annoyed at some point but prepared to deal with it. Even I was surprised, though, by the sheer number of hoops their system demanded I go through — even demanding that I change my password at one point, then making it difficult for me to do that, and then blocking me from proceeding further. I will not be treated that way anymore. Goodbye Ticketmaster. I'm out. You're done. End of."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "TINA GRIERSON",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:55:07.000Z",
          "Titre": "Not worth the money.",
          "Contenu": "The seats were incredibly uncomfortable and it became quickly irritating to have to keep getting up and leaving the seat isle every time someone wanted to get through. The show itself was kind of lacklustre. The volume of the movie I felt wasn’t loud enough and the live orchestra, the part I was looking  forward to and obviously the reason why we paid a lot more money to see the movie, didn’t really add to the experience of the movie. I actually forgot there was a live orchestra playing because it just sounded like it was regular music from the movie. I get that the orchestra wanted to blend in with the movie but I had hoped that it would have been more obvious of a difference…and for me there wasn’t. We ended up leaving during intermission. I would never spend the extra money to see a movie with a live orchestra okaying again. I found there to be no difference and I walked away upset that I paid $150 to basically watch a movie."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "MATHILDA PRINSLOO",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:35:05.000Z",
          "Titre": "Booking was painful",
          "Contenu": "Booking was painful. I found the website difficult to navigate. I was kicked off the site twice & when I pulled up the site again it wouldn't load.And then all the instructions to view the tickets which I didn't do. That was a nightmare on the an actual day & I am  not willing to load more apps on my phone. I would have appreciated receiving the QR code like every other does where I buy tickets."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "JDI",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T15:59:18.000Z",
          "Titre": "It was extremely difficult to pick…",
          "Contenu": "It was extremely difficult to pick tickets from the map only to find out someone else had already claimed the seats.Then why was it shown as available on the map.this happened numerous times, very frustrating as you loose seats and time, especially when the tickets are selling out fast !"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "LESLEY GEDDES",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T18:12:58.000Z",
          "Titre": "I tested positive for Covid and was…",
          "Contenu": "I tested positive for Covid and was unable to refund or resell my ticket so I didn’t get to go. Even though I bet a lot of people were there with Covid because only ticketmaster and stubhub can resell tickets for triple the price. I would have done face value or less. Frankly I hate ticketmaster and hope you go out of business"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "CALI",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T22:29:07.000Z",
          "Titre": "I purchased 3 adult tickets by accident…",
          "Contenu": "I purchased 3 adult tickets by accident as I was bringing 2 girls, 11 & 12.    I contacted ticketmaster immediately but there were no help at all.   so I had to keep the adult tickets I had"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Ann Mitchell",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T20:14:55.000Z",
          "Titre": "No tickets from Ticket master",
          "Contenu": "Well I have a cell but do not use it often I purchased four tickets and could not give them away I had to go to Rama a four hour drive to get my ticket do you not realize not everyone has a phone or email ! I asked for the tickets to be sent by Canada post and they would not do this so this will be my last dealing with ticket master"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Timothy Kwiatkowski",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T02:20:12.000Z",
          "Titre": "Obstructed View Not Properly Labeled",
          "Contenu": "I bought tickets for my 84 year old mom to see her favourite show. I realized after I bought them that they were “obstructed view”,and it was indicated, however, the font is not obvious enough. In this day and age there should be a flashing window or something drawing your attention to this before you buy. Instead, you get stuck with tickets that can’t be refunded. Shame. You make enough money that you don’t need to push these tickets out with “no refund or exchange.”"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "LEON DUNN",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T19:33:03.000Z",
          "Titre": "Ticket master changed the seats I…",
          "Contenu": "Ticket master changed the seats I bought. I was not told this until after waiting in the rain with 2 daughters (one still an infant) for 20 mins to get in. The lady told me I needed to see the ticket window. Back in rain around the corner, match almost starting, told my seats have had to be changed, no reason given, still standing in rain, ticket window lady tells me I need to wait as her supervisor was in the bathroom, still waiting, 10 mins go by, this sucks, supervisor comes out and prints four new tickets, still no reason, back to waiting in rain to enter, 15 mins later we get in, our seats are on the opposite side of the field than the ones I specifically purchased for a reason. National anthems are played, missed yhem and kick off. Thanks ticketmaster, still waiting for a reason."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "HOLLY JAMES",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T00:53:28.000Z",
          "Titre": "Terrible experience",
          "Contenu": "Terrible experience. My daughters and I had looked forward to this concert for months. The sound was so off that we spent most of the first half covering our ears. Singers voices couldn’t be made out and were distorted or not heard at all. It was so loud the reverberation and drums were deafening. We ended up leaving after the intermission because we couldn’t stand it any longer."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "GARRY WEBSTER",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T16:26:24.000Z",
          "Titre": "These tickets re-sold through…",
          "Contenu": "These tickets re-sold through ticketmaster on November 9th and I am still waiting for the money to be deposited into my Verified account. You are ripping off your customers!"
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Martin",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T11:15:17.000Z",
          "Titre": "Could not retrieve the ticket",
          "Contenu": "The tickets were not visible with the link provided in the email. The app was not possible to download since you then need an apple id in canada. I am from eu.In the we had to go to the arena 2 hrs before and got the tickets finally"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "ROSLYN REYES",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:52:02.000Z",
          "Titre": "Unfortunately my son got Covid and we…",
          "Contenu": "Unfortunately my son got Covid and we were unable to attend."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "ZSUZSANNA",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T21:43:25.000Z",
          "Titre": "We love Cirques, but we were disappointed with this one.",
          "Contenu": "Well, we bought tickets thinking it would be like the Cirque's we've seen in the past; however it was came across more like a circus with not much new or exciting to watch in our opinion.  We felt it was like a show you might see for free while visiting Disney Land or Sea World. The male duo team was entertaining and impressive, otherwise, we were a bit disappointed with the overall experience.  Perhaps our fault for not doing our research on it before buying tickets.  I think kids would enjoy the show."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Shari",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T17:05:37.000Z",
          "Titre": "Our seats were triple booked",
          "Contenu": "Our seats were triple booked! We arrived 25 minutes early to find people were in our seats! While I was waiting to tell the usher I realized he was also dealing with people who were also inquiring about people who were in their seats (which were also my seats!!!). We ended up finding empty seats 6 rows above our original row. If this matter can be looked into we would appreciate it. Our tickets were section 13, row N, seat 4,5,6.  I’m very disappointed with the ticket master process. We now pay big service fees to ticket master to book….over booking should never occur!!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Tsharli",
          "Nb_Reviews": 3,
          "Date": "2023-11-28T00:44:59.000Z",
          "Titre": "Multiple Ticketmaster websites using same login but they're actually different",
          "Contenu": "1) fees are too high and make no sense (service fee is some percentage of the ticket price?)2) got emails from both Ticketmaster and Broadway across Canada regarding downloading my ticket. Both went to Ticketmaster sites (I didn't realize they were different) but only one had my ticket while the other one (despite using the same login) said I had no upcoming events. This was very alarming."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Carolyne Proulx",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T14:43:39.000Z",
          "Titre": "The show was rescheduled without notice",
          "Contenu": "The show was rescheduled, I never received any email about the new date. I showed up with my out of town guest to the venue (along with~40-50 other people who also did not get an email). I sought compensation from Ticketmaster for my guest's missed work and twice the fuel and Ticketmaster was not helpful putting the blame solely on me. (November 2, 2023 was the original date)"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "DEREK S",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T22:35:49.000Z",
          "Titre": "Lack of printing option is very…",
          "Contenu": "Lack of printing option is very inconvenient in the case of those without a phone, no data, or if battery dies. Having the phone option is great, however forcing everyone to use it is constrictive and leads to possible inconvenient experiences. Weird being \"ticketmaster\" without any physical tangible tickets anymore. Would be happy if both options existed, as of now there were too many hassles with getting through the gates even with all of us having phones and the app.. brand damaging."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Duncan",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T23:23:32.000Z",
          "Titre": "Ticketmaster and BMO Field need to do BETTER!",
          "Contenu": "Ticketmaster should have a vested interest in ensuring the venues have adequate capacity to get fans into the venue. Unfortunately, though arriving 30 mins before kick-off for the game, I wasn't able to get into the stadium until the game was already 25 mins into the half. That is to say, it took about 60 mins for me to get through the gate. I heard a lot of \"never doing this again\" in the line-ups about whether people would attend games. I would imagine that's not in Ticketmaster's interest. You need to work with BMO Field to get this issue sorted out."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "MARK STOKER",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T00:31:44.000Z",
          "Titre": "Last minute my wife couldn't make the…",
          "Contenu": "Last minute my wife couldn't make the concert and I was unable to sell her ticket. I actually wound up giving it away. I had asked for help from your \"chatbot\" and the next day I got a response saying things were busy and you were sorry for being unable to help me.If you want to help and there is a real person looking at this please tell me how much I originally paid for my two tickets and the date of the transaction...That would help"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "steve kretz",
          "Nb_Reviews": 5,
          "Date": "2023-12-13T00:16:24.000Z",
          "Titre": "Wasn't allowed to reduce the price of…",
          "Contenu": "Wasn't allowed to reduce the price of my extra ticket below the Ticketmaster set price,l which was rather high"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "MG",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T16:18:35.000Z",
          "Titre": "Research the venue and do your best to figure out what section is even acceptable for acoustics.",
          "Contenu": "This is probably my own fault: Saw Tool at Scotiabank Arena in Toronto. Was excited to finally see one of my favourite bands. Realized quickly that the section I was sitting in had absolutely horrendous acoustics. Tried with and without earplugs but no luck. I was extremely disappointed and left after 3 songs, (I couldn't believe I was doing that) deciding I'd rather not even see this amazing band at all than to see and hear them with such terrible acoustics. I read afterwards that it might be possible to go to guest services at the venue and change your seating but I didn't know that at the time. Again - a ton of blame on my end, but moral of the story, do your research on section seating where at all possible.Sat in section 119, Row 28"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "ROB BEVERLY",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T03:18:22.000Z",
          "Titre": "could not log into the wifes existing…",
          "Contenu": "could not log into the wifes existing account, she has not changed her password so we had to set up a new account under my name.the seats we tried to reserve through the angels foundation account got tied up and we had to wait until they were release again.overall the ticketmaster process took us over an hour to get the tickets, it was extremely frustrating."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "KAREN MCKINNON",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T15:25:36.000Z",
          "Titre": "Come From Away - Seating",
          "Contenu": "This was the most disappointing event, due to seating, that I have ever gone to.  I am new to the area so I called your Customer Service, before purchasing the tickets, was advised that Section 54 was a very good choice for seating.  We were so excited to go to see Come From Away.  We looked at the back of peoples heads the whole show.  I will never book another event that is being held at the Scotiabank Centre."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "ROBERT HUTSON",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T18:43:17.000Z",
          "Titre": "Will never purchase tickets through TM",
          "Contenu": "Will never purchase tickets through Ticketmaster. The worst experience ever. TM website has an average of 7.5-8.0 rating; I give it a BIG FAT ZERO. Too many links routed to scammers, especially when the scammer is asking for funds in US dollars. Let's get back to old school, just order your tickets from the place of the show, or pick them up at the venue's ticket office. It is that simple."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Fridge Upgrade Mom",
          "Nb_Reviews": 5,
          "Date": "2023-11-25T00:51:42.000Z",
          "Titre": "Line Up to get in was ridiculous.",
          "Contenu": "Arrived at 7:20pm at the entrance. Line up was so long we didn’t get in until half time. The stadium should have waited for a certain percent of the audience to be inside before starting game. So disappointing. Never had this issue before and we’ve been to sooo many games. Even the sold out CANWNT game in was not like this."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "JAMES RYAN",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T22:48:11.000Z",
          "Titre": "Should have option for paper/printed…",
          "Contenu": "Should have option for paper/printed tickets for old people like me."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "NEIL OWENS",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T18:01:16.000Z",
          "Titre": "Please allow re-entry for kids shows",
          "Contenu": "Please allow re-entry for kids shows - my daughter had to leave the venue briefly before the show started but we were not allowed back in, so we missed the entire show"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "RJ",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T16:02:45.000Z",
          "Titre": "Horrible experience",
          "Contenu": "The event apparently was a 19+ event but it was not clearly identified as such during the purchase process. As someone who does not purchase tickets all that often, they could have been a much better job identifying this to potential purchasers.We travelled 1.5 hours to get the event only to be told at the door it was 19+ only and with no recourse had to leave the event and be out of pocket, not see the band and then drive 1.5 hours back home.Horrible experience all around."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "ANNE MARTIN",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T22:32:24.000Z",
          "Titre": "We were very disappointed with our…",
          "Contenu": "We were very disappointed with our tickets for Pete Davidson.  We arrived 30 minutes early, the admission line took a very long time to get through. There needs to be a more effective way of admission.  The line up was so long we missed 25 minutes of the show despite arriving 30 minutes early.  It seems a bit unfair that we paid for our tickets, arrived on time yet missed the beginning of the show!"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Issmee",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T19:01:56.000Z",
          "Titre": "shame on ticketmaster...scamers!!",
          "Contenu": "Takes too long to get to your tickets on your phone... and ticketmaster are total scamers....tickets are out of price..it s freekin riddicilus....the government should seriously look into your resale policies....you are leading to a population more and more unable to have access to culture...."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "ANDREW",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T01:50:53.000Z",
          "Titre": "Ticketmaster is a monopoly on the…",
          "Contenu": "Ticketmaster is a monopoly on the industry and the only real way to get tickets to most major events in North America."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "MC",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T23:06:21.000Z",
          "Titre": "The description was not accurate",
          "Contenu": "The description was not accurate.  They played the movie with subtitles and the orchestra played along. No narrator, no introductions nothing super disappointing for the amount we paid."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "RoseAnne H.",
          "Nb_Reviews": 9,
          "Date": "2023-11-16T07:39:15.000Z",
          "Titre": "digital tix with no print option give ticketmaster license to sell the cell number",
          "Contenu": "The concert was fabulous, the venue perfect, the staff at the venue ideal.  My complaint is specifically related to the digital - and digital only - ticket policy.My cell 'phone use is limited in the extreme.  Yet, almost immediately after \"having to\" purchase a digital ticket with no print option, the junk and spam calls on my cell 'phone exploded.  Every week from time of purchase to concert day: anywhere from 8 - 15 attempts to contact me from people and companies I do not know and certainly did not have my number.You do the math."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Country Girl",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T14:53:02.000Z",
          "Titre": "The show influenced by crew bus…",
          "Contenu": "Show was day after bus accident. The impact of the accident evident through out the show. No introduction of band or crew. Sound quality not great. Seemed like a lot of lip syncing   Disappointed in show. Entry and exit into building -delays. Traffic management poor. Vendors and service at event great"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Pissed off",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T00:55:22.000Z",
          "Titre": "We should be allowed to resell tickets…",
          "Contenu": "We should be allowed to resell tickets we purchased for less than we paid for them.It is not scalping. The fact that when I tried to sell them, Ticketmaster would only allow a price higher than what I paid for them. I was not able to go due to a family emergency and wanted to offer them for less money so someone Gould go and enjoy the game. Disgusting!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "CATHY MCPHERSON",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T03:28:54.000Z",
          "Titre": "Advertised as concert",
          "Contenu": "Advertised as concert. Actually \"Movie with live music track and vocals, no live dance\" Waste of time and money. Prices kept dropping, feel sorry for those who paid full ticket price. Definitely misleading."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Ann Hartloff",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T21:56:56.000Z",
          "Titre": "Customer Service",
          "Contenu": "I purchased tickets to Charlie Puth in June, the VIP package, it is now November 14th and I still have not received my VIP merchandise.  Ticketmaster keeps advising me to wait to hear from them.   They will not refund me the cost of the merchandise.   All my friends that were at the show received their merchandise.  Ticketmaster Canada is awful and customer service!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "BASIL BABINEAU",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T00:38:35.000Z",
          "Titre": "You basically stole my ticket",
          "Contenu": "You basically stole my ticket Got them a month ago then my friend cancel so i had to put them for sale on your platform I try to cancel the sale maby 3h before the show because i found someone Everytime i try to cancel the sale “around 30 time “ there was a error on your side so basically drove to rogers place for nothing try to get it fix at your little help area at rogers place it was like my ticket did not exist Thx a lot"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "DAVE REAGAN",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T23:06:29.000Z",
          "Titre": "OBSTRUCTED VIEW SEAT NOT IDENTIFIED!!",
          "Contenu": "The one seat of the pair was almost completely obstructed. Should not have been sold unless this was in the description."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T18:59:38.000Z",
          "Titre": "Ticket Gouging",
          "Contenu": "Ticket prices (not re-sale) went much lower after I purchased my ticket. No full or partial refunds offered. Punished for being a fan."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Tina",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T18:24:51.000Z",
          "Titre": "Would not let me sell tickets in an emergency",
          "Contenu": "I buy many tickets through you.  This time my friend had to go to emergency and we could not go.  I was unable to put the tickets for resale, even for less than what I paid - so the tickets went to waste and we could not recoup anything.  Very disappointing."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Yeah right",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T22:12:17.000Z",
          "Titre": "Ticket master is great at their job",
          "Contenu": "Ticket master is great at their job, ripping off consumers and making it easy for people to gouge for floor tickets."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "TOM WALSH",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T19:31:55.000Z",
          "Titre": "The biggest disappointment was there…was no seating!",
          "Contenu": "The biggest disappointment was there were no seats, standing only. This SHOULD have been disclosed at point of sale!  Will never attend another event at this venue or any other sold by Ticketmaster."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "B. Prochnau",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T21:25:51.000Z",
          "Titre": "Awful",
          "Contenu": "Accessibility into the event was a complete and utter disaster. 45 minutes to get through security is a joke.Missed a lot of the Nickelback set since they were performing on the west side of the stadium, and we were on the east side, so we relied on the big screen to see them. Unfortunately for most of their set we were forced to see the Ticketmaster logo on the big screen. I realized you sponsored Nickelback but didn't you make enough on the event without force feeding us your corporate BS."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Andy Holt",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T17:03:51.000Z",
          "Titre": "Unimpressed",
          "Contenu": "I selected my seats. Your website would not allow me to pay for them. Time expired and I lost my seat selection. This happened with several seat selections. By the time your website would accept payment from me, my seats were much further back than my original selection. I still had to pay your administrative charge, despite the poor service. I also don't appreciate being *required* to download your app onto my phone in order to obtain eTickets."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "MATT",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T17:05:39.000Z",
          "Titre": "You have an insecure website with…",
          "Contenu": "You have an insecure website with expired certs. You charge exorbitant fees for an entirely self serve process. You strong arm venues and artists into using your services. Tick-tock, enjoy it while you can."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "RICHARD CORBIN",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T02:30:15.000Z",
          "Titre": "Scanner at the door would not scan my…",
          "Contenu": "Scanner at the door would not scan my tickets from my wallet.  They just let us in anyway.  You should go back to paper tickets for Halifax.  This also happened to me at the Casino scanned 4 of the 5 tickets.  Scanning of tickets does not seem to work.  I find that scanning of tickets slows down entrance into the venue."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "WYATT",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T00:48:36.000Z",
          "Titre": "Dont waste your money",
          "Contenu": "Been 100s of shows n this is the first show ive been too thats had a no picture or video rule implemented by a artist. They were throwing people out who paid 100s of dollers per ticket. Maynard hid in the back and all his comments of the 10 words he spoke were negative about Vancouver.  He clearly dosent care about fans money spent on overpriced tickets nor Vancouver.  Would not go again nor recommend them live."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "NICOLE DYKE",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T19:12:08.000Z",
          "Titre": "Ticketmaster failed to report my seats…",
          "Contenu": "Ticketmaster failed to report my seats were an obstructive view and my concert was ruined. The ushers tried to assist but the venue was sold out. I'm shocked a company as large as ticketmaster didn't ensure it had all the information for the venue they're selling tickets for. I'm really disappointed"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jess",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T14:24:44.000Z",
          "Titre": "Ticketmaster SUCKS",
          "Contenu": "Ticketmaster SUCKS. This is the only time I’ve managed to get tickets, and the experience was stressful. Why let me click on seats I want to purchase and then say “someone already chose these seats”. And the longer you try, the more the prices climb. It’s the worst system ever and ticket master should be ashamed of themselves. Your prices SUCK by the way. Never supporting again."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "DAMON MENZEL",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T16:48:28.000Z",
          "Titre": "Money Gouging as Always on Fees",
          "Contenu": "$100  charge on my tickets that is gouging 100%. No wonder no one can have afforded to go to anything when your company does this for what?? Emailing me a ticket , absolutely disheartening and unprofessional"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "KIMBERLY WILLIAMS",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T10:11:56.000Z",
          "Titre": "If General Admission- Don't go there is no seats!!!",
          "Contenu": "When buying the tickets I called to ask about seating asnit was listed as General Admission and was told it was not assigned seating. We arrived to no seating at all, no coat check, a mini bar. It was awful, eople were standing around or sitting on the floor with winter coats on their laps. We left after 40 minutes as I was in to much pain to stand anymore. Many walked I  and then turn around and left before the concert even started. Alot of people were mad at not knowing there would be no seats. This is a 55+ crowd, we need seats!!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Broke artist",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T16:59:47.000Z",
          "Titre": "Ticketmaster's monopoly has never flourished more than it does today",
          "Contenu": "Ticketmaster has a monopoly on initial ticket sales and has relationships with ticket resellers. Ticketmaster is soulless and its employees are complicit in making sure every major venue and event has a reliable ticket sales operation that puts profit above all. It's a vicious circle that results in the wealthy having access to arts and entertainment while the poor won't. Music and art is about money - ticketmaster ensures this will continue."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Stacey",
          "Nb_Reviews": 2,
          "Date": "2023-11-05T01:54:35.000Z",
          "Titre": "VIP let down (bad comunication)",
          "Contenu": "We bought vip tickets 4 tickets for the show and 4 vip tickets as 2 sets of 2 attached to 2 different emails and turns out our vip tickets was a huge waste of money as neither of us received notice as to when the vip part started and we completed missed it as when I asked about the vip I was told an hr before the show which would have been 7 as the show started at 8 so we showed up to the venue for 7 and waisted all that money and missed out on the whole vip experience. It was a HUGE let down. We were all very disappointed!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "False advertising",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T21:34:27.000Z",
          "Titre": "14 days since my ticket sold and still…",
          "Contenu": "14 days since my ticket sold and still no money from ticketmaster. When I asked to speak to a supervisor I got hung up on. I called back and was told there is no supervisor there, they will call me back in 48 hours! Ticketmaster has false advertising. Website says you will be payed 5-7 days! Not true!! Beware!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "larry b",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T17:40:23.000Z",
          "Titre": "2 tickets on phone only one could scan…",
          "Contenu": "2 tickets on phone only one could scan , 20 min later 2nd ticket scaned ofter numeroums times totext  phones . bring back option for paper tickets"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "SOAD fan",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T22:47:06.000Z",
          "Titre": "Ticketmaster Sucks",
          "Contenu": "I will never again buy tickets where I am not allowed to print them off for scanning.  The venue had horrible wifi and my connection would not work.  You are discriminating against those who do not want to use an e-wallet.  Shameful."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "JARRETT",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T22:06:40.000Z",
          "Titre": "Last minute announcements and poorly organized..",
          "Contenu": "For starters the communication about the event was not good. People travel for events like this and they left it very last minute to announce no whl game, no alumni game, the pregame concert, and fan venues for pregame experiences. Then we arrived at the venue an hour and 15 minutes early so we could wander and look at merchandise but it took all of that time just to get through Security and into the building. We just got to our seats which were right near the entrance we went in a few minutes before the national anthem started. Once in the venue we went down to use the washroom and the concourse was so jammed with people that you couldn't tell where lines were for anything and we didn't make it back to our seats until over halfway through the second period. All of this time was just trying to get through the jam of people to the stairs up. The game itself was good but just seemed very poorly organized and planned."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "greg",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T17:26:37.000Z",
          "Titre": "Some one forgot to update the address…",
          "Contenu": "Some one forgot to update the address details of the venue. The venue label was correct but the address detail (location) was incorrect and therefore we ended up going to the wrong place. We ended up missing half of the show because of that."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T18:05:34.000Z",
          "Titre": "Wouldn't update the price on my listing…",
          "Contenu": "Wouldn't update the price on my listed tickets. Lost $200"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Fkfees",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T14:39:14.000Z",
          "Titre": "Fees too high",
          "Contenu": "Your fees are absolutely ridiculous. Trying to recoup pandemic losses but your patrons all suffered too"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "ROBERT PRICE",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T02:06:04.000Z",
          "Titre": "Even though we are partial season ticket…",
          "Contenu": "Even though we are partial season ticket holders, we still missed out on meeting any player for an autograph because we were told it was to give the organizers an estimate of how many people would be there and people still lined up without a ticketmaster ticket starting at 730am. My wife felt sad for the second year in a row. Last year it was a different system. The best event in the past had to be when scratch tickets were given out inside the main gate that gave everyone an opportunity to visit atleast one player downstairs near the offices and elevators. Dan Charbeneau is our rep but no response from an email. I expect he is busy."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "DENNIS ORR",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T16:38:18.000Z",
          "Titre": "Unfortunately I ended up n the hospital…",
          "Contenu": "Unfortunately I ended up n the hospital and missed the show.  Your stupid requirement of needing the purchasing credit card and picture ID to pick up the tickets meant my friend couldn't access the tickets so we both missed the show.  Were print at home - or God forbid physical tickets - really that big an issue?"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Leanne Kypraios",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T22:50:55.000Z",
          "Titre": "VERIFIED RESALE = TICKETMASTER",
          "Contenu": "The verified resale......It's Ticketmaster jacking up the cost of tickets.  The greed is astounding.  The average concert-goer/fan cannot afford to go see their favourite artists anymore.  Travis Scott tickets went on sale at 10am.  10:01 there are verified tix on available.  Your telling me that 1 min after someone bought tickets they thought \"hey I can't go maybe I should resale them\".  Give me a break.  We need another option.  Ridiculous."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "A. Dinis",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T07:18:42.000Z",
          "Titre": "Stop allowing “verified resale tickets”…",
          "Contenu": "Stop allowing “verified resale tickets” on your platform! It drives up prices ridiculously and does not allow honest, hard working fans to take their families to games, events, etc. It’s absolutely incredible you profit both from the sale and then the resale of tickets. I believe this is a terrible practise on your behalf!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "LYLE MAKOSKY",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T21:35:30.000Z",
          "Titre": "Tickets only accessible via Cell phone - not tenable.hat only a mobile app…",
          "Contenu": "Your insistence that only a mobile app on cell phone would be able to receive and hold tickets is ridiculous, insulting and as far from a client service orientation as you can get. Then just try to contact TM, or reach anyone in a reasonable time, and then try to request an alternate ticket delivery and the result is a non starter and rude treatment. What on earth is someone supposed to do if they don't have a cell phone?....there are people in this world in that state....not that TM would appear to care about them."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "KIRSTY ALDOUS",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T22:29:30.000Z",
          "Titre": "Purchasing tickets was a frustrating…",
          "Contenu": "Purchasing tickets was a frustrating experience. With seats going in and out of availability, clicking on open seats only to then have them be already gone. Took over an hour just to get 2 seats together to stick and get through to pay! Ridiculous. There has to be a better way."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "MARK L",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T23:00:36.000Z",
          "Titre": "Ticketmaster Failed",
          "Contenu": "The event was phenomenal.Ticketmaster failed significantly. My app would not activate and open my tickets - I can screen print - so had to go to the box office and have them print.Disgraceful in this day and age."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "KAY BUCKLE",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T04:32:34.000Z",
          "Titre": "SOME OF US DO NOT HAVE CELL PHONES !!!!!",
          "Contenu": "Ticketmaster does not make allowance for those of us who DO NOT HAVE A CELL PHONEIt was impossible to get info from a LIVE PERSONHowever Scotiabank Arena box office staff were very helpful and understanding.Andre Rieu concert was WONDERFUL (once we actually were able to get in!)"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "David Poretti",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T18:16:50.000Z",
          "Titre": "Why are there 40% extra in fees?",
          "Contenu": "It it was possible to give 0 stars, I would. There is absolutely no reason for a company to change almost 40% of the value of the ticket in bogus fees. A $100 ticket should not cost almost $140 after fees. If I had a choice to buy my ticket elsewhere, I would. But unfortunately ticketmaster has a monopoly so they are able to get away with charging whatever ridiculous fees they want. It’s a terrible thing to do."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "MICHAEL FELLINI",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T18:39:08.000Z",
          "Titre": "Terrible seats",
          "Contenu": "Terrible seats!  Positioned behind two pillars.  We had to cock our heads left or right or look through the 3” between the pillars.  Shame on Ticketmaster for not making ticket buyers aware that seats are obstructed."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "RYAN CLASSY",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T23:11:45.000Z",
          "Titre": "Terrible",
          "Contenu": "The Fear Inoculum VIP Experience was poor.  I - along with everyone else I interacted with in the VIP Experience - felt ripped off."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "GUILLAUME PAQUIN",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T16:56:04.000Z",
          "Titre": "The sound wasn't good",
          "Contenu": "The sound wasn't good. The PA system was clipping and some distortion noise was there for the half of the show."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "PEMCO CONSTRUCTION LTD.",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T17:50:15.000Z",
          "Titre": "Promotional Code Did Not Apply",
          "Contenu": "I was provided a code for the event and it did not apply at time of purchase, no one on any side helped and just said too bad there is nothing we can do. The ticketmaster help chat sat idle for 4 hours"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "MIKE ROSS",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T20:10:44.000Z",
          "Titre": "Accessible seating being sold to people who don’t require accessible seats",
          "Contenu": "We needed an accessible seat and were told they were sold out in March.  Very odd since I had found one on the Ticketmaster website a couple days prior only to have an unexpected error come up and ended up losing the ticket and could not get it back.  Bought regular tickets and saw people in the the accessible seating not needing accessible seats as we witnessed people coming and going through that section.  Very upsetting"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "SAM",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T20:46:14.000Z",
          "Titre": "A number of things were frustrating",
          "Contenu": "A number of things were frustrating. We paid an ungodly amount for the tickets and were sitting next to people that paid half of what we did who also ordered through Ticketmaster and didn’t purchase last minute through another party. They were supposedly VIP tickets, but other people in the section did not know it was a VIP thing. It was also annoying that our tickets were left at will call rather than being sent electronically which just wasted us time on the day of. I would rather save the $15 on free merchandise and have that money to purchase something that I actually wanted from the tour."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "TeresaC",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T17:41:09.000Z",
          "Titre": "I don't like that I had to install the…",
          "Contenu": "I don't like that I had to install the app in order to show my tickets. I try to use Ticketmaster as little as possible and really don't want another app that I rarely use."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "RUDY H.",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T23:41:31.000Z",
          "Titre": "I hope Ticketmaster apologizes for their years of terrible service and gets out of the business",
          "Contenu": "Ticketmaster is by far the worse company I’ve ever dealt with. You gouge people with fees, have terrible customer service, make it practically impossible to get any kind of live support and to top it off, you can no longer get a printed version of a ticket (many of us have collected them for years). I cannot wait for Ticketmaster to die a painful death just like the pain you’ve caused your customers."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "MELISSA ESPIRITU",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T21:39:39.000Z",
          "Titre": "I was extremely disappointed to see the…",
          "Contenu": "I was extremely disappointed to see the cost of my tickets went from $135 /ea to $60 /ea closer to concert time. I reached out to the agent at the stadium and said at least move me to a seat that is equal to current value as they were available and was told no. Super dissapointed as I paid $270 for 2 tickets that went to $120. My friend paid just under $200 for the floor."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "LYNDA",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T17:34:43.000Z",
          "Titre": "Don’t tarnish your memories",
          "Contenu": "This was such a bad experience for anyone that likes and grew up with the Price is RightI actually find it hard to believe that they are really affiliated with the showThe ticket sales probably brought in 500K and they probably gave away maybe 10K in total. In the showcase final they showed a scooter, a couple of trips and a nice new red SUV  then the host said if you get the price right within 100$ you win it all. What a jokeI would never recommend this show don’t tarnish your Price is Right memories with a show that’s just a money grab"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Caroline Doucet",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T19:22:54.000Z",
          "Titre": "Billets disponibles au compte-goutte",
          "Contenu": "When I purchased my tickets in section 103, row A was supposed to be the first row. No tickets were available below A and that's exactly why I had chosen them. I had already bought tickets in a higher row and those in A were released later. I had to pay a fee which I wouldn't have had to pay if the tickets in A had been available as soon as the show went on sale. When I got to the venue, I saw that the tickets below us had just been released, so we ended up being in the 5th row. We would have gotten the tickets in row CC in the first place if they had been available. I think this is unfair."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Tg",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T16:50:08.000Z",
          "Titre": "Changed the concert after I bought ticket",
          "Contenu": "I didn't because I bought the ticket when it was supposed to be Exile tribe from Japan but ended up being someone I had no interest of. I got the insurance they offer to get my money back but I never got my money back."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "PAD",
          "Nb_Reviews": 2,
          "Date": "2023-10-31T17:38:04.000Z",
          "Titre": "Hands-down the worst customer experience ever",
          "Contenu": "Bought tickets for a show. Received tickets that said “restricted view” on them, which was never indicated when I was choosing the seats.I contacted Ticket MAster immediately. They wanted me to pay an additional fee to change the seats, which I refused to do. If they had merely changed my seats without trying to charge me more money I would’ve been happyI wanted simply cancel the order since they sent me restricted view tickets that I didn’t want. A few days of discussions back-and-forth and they still felt that this was an unreasonable request. They absolutely refused a refund.It was not possible to return the electronic tickets to Ticket MAster and they refused to refund my money, so I was stuck with them.Fortunately, VISA agreed with me that this was a ridiculous situation and refunded my money and will be collecting it back from Ticket MAster on my behalf! I never want to buy a ticket from Ticket MAster again for the rest of my life!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "App S. Uck",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T19:29:51.000Z",
          "Titre": "The app sucks so bad",
          "Contenu": "The app (you know, the one you now force all users to use to even access the tickets?) is truly one of the worst I've seen in my life. Can't connect, download or do anything without it crashing. Plus you have to start again once you manage to make it work, as it keeps logging you off."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Disappointed",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T13:18:07.000Z",
          "Titre": "Stop charging 35% service fee on…",
          "Contenu": "Stop charging 35% service fee on tickets. But you don't care because you still and will continue to do it."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Tsanger banger",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T17:02:17.000Z",
          "Titre": "Prices triple, No Refunds, 40% resell markup",
          "Contenu": "Ticket prices have tripled in the last 8 yrs. This is not due to performers or promoters, its because of Ticketmasters greed. Also, when reselling, TM marks up the price another 40%. This increase is not done by the reseller.And Scalper bots still get all the best seats. And the TM Fees are out of control! Add another 20-35% on for final price!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "DEB MILLS",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T19:00:19.000Z",
          "Titre": "Our seats were in handicapped session…",
          "Contenu": "Our seats were in handicapped session in under a overhang with a TV to watch as view from seat didn't allow viewing of game.I asked th change them and was given handicapped in the third tier.This was her first time and a 😖 bad experience."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Nad",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T00:17:05.000Z",
          "Titre": "Doesnt worth 250$, sorry NO",
          "Contenu": "2 hours pre-heat with random DJ on the stage and then just about 1 hour of the actual concert including breaks for t-shirt give-aways, this just doesnt worth 250$, sorry NO"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "JANICE",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T18:10:04.000Z",
          "Titre": "within 3 blocks of venue - stuck for over 30 min",
          "Contenu": "We got to within 3 blocks to venue at 7:40 pm and traffic stopped. It took until 8:25 pm to get to parking, only to be told parking is all full. We ended up parking at University parking (hoping we would not get towed) and got inside to show at 8:45 pm. The show was great! Hopefully we did not miss alot of the songs."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Amber",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T17:57:09.000Z",
          "Titre": "No Disability Accommodations or Customer Service",
          "Contenu": "Ticketmaster's monopoly has led to a complete lack of customer care and service, where no one in the company seems to know anything anymore.  I used Concert Cash to buy a seat for a show to downgrade myself from standing GA due to injury, with the plan of selling the GA to a friend. Because their system glitched, I bought a seat for the wrong night. Ticketmaster refused to allow me to swap for the identical seat on the correct night even though this would cost them nothing. They refused to issue me a gift card that I was happy to use ON THE PHONE to buy the correct seat.  Instead I was told I could have an exception refund and get new Concert Cash.... only whoops, sorry, turns out we can't.  So I was left with no ticket, no $50 off, nada.  Ended up not seeing the show at all since I still had to sell the GA.  Had they just been FORTHRIGHT I would have sold the mistake GA and bought the correct one?  I'm so tired of their misdirects and lies while acting like they're doing you a favour even allowing you, the lowly public, to have a ticket at all.  If we had a choice we'd happily go elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Smith",
          "Nb_Reviews": 4,
          "Date": "2023-10-24T21:09:38.000Z",
          "Titre": "Waste of time and gas",
          "Contenu": "Nothing wrong with Ticketmaster. But parking is impossible, even in a venue that only holds around 4,000. Even an hour in advance.  It is also impossible to find a map of downtown St. Catherine's, so if you park somewhere you may not find your way back to. At night. Female.  I found a parking lot,but they only allow cash plus some app I never heard of. Within half an hour it was pandemonium. Worse than old Quebec City.  I drove all the way back to Hamilton without seeing anything.The trick is to arrive at 6 and go for dinner, with a very long string. You won't be alone."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Mrs. French",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:16:12.000Z",
          "Titre": "My Review",
          "Contenu": "The gal who opened up, she literally talked for 20 mins (i timed her). I get it that she has to thank all that donated, but 20 mins? it dragged on too long and the guests surrounding me thought same.                               And I didnt realize David would only preform for 50 mins. I wouldnt have paid $167 x 2 tickets had i known. Sorry but you asked"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "BRENDA FISHER",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T21:10:42.000Z",
          "Titre": "Too many emails and notifications about…",
          "Contenu": "Too many emails and notifications about the game. I do not need multiple communication per day. Before and after thd game. Very annoying!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Sarah Kallay",
          "Nb_Reviews": 2,
          "Date": "2023-08-10T17:51:43.000Z",
          "Titre": "Resale tickets and peoples greed are…",
          "Contenu": "Resale tickets and peoples greed are ruining events for regular people.  Ticketmaster needs to put a stop to resale tickets or come up with a better way to do things.  It is getting to be ridiculous.  My daughter can't see T Swift because people want to line their pockets. This world sucks!!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "DARREN WILSON",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T20:47:14.000Z",
          "Titre": "Tickets couldn't be transferred for…",
          "Contenu": "Tickets couldn't be transferred for some reason so it was a pain to get all of my friends into the show. For all of the fees I paid I should at least be able to distribute the tickets to my friends easily."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "RAFF BRUNO",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T03:00:26.000Z",
          "Titre": "Traffic at the stadium was awful",
          "Contenu": "Traffic at the stadium was awful. The on-site parking was shut off due to royal winter fair. Parking was this impossible. My guests and I missed the entire first half."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "JASON REIMER",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T00:43:54.000Z",
          "Titre": "The seats I bought had an obstructed…",
          "Contenu": "The seats I bought had an obstructed view. And no where in the description of the tickets did it say anything about an obstructed view. You couldn’t see any part of the ice surface from the seats"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Shelagh Finnigan",
          "Nb_Reviews": 2,
          "Date": "2023-10-29T21:35:19.000Z",
          "Titre": "Lauryn Hills show was supposed to start…",
          "Contenu": "Lauryn Hills show was supposed to start at 8. It was about ten when she went on. She had a DJ and then came on, which was fine. But, it was beyond late at starting time. Then, she was playing ex factor at 10:55 or so and I hear Drake rapping. I was so excited, but it was a recording of Drake. So, it was mainly recorded music and the most exciting moment was a ruse."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "JEFF LINTON",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T19:37:46.000Z",
          "Titre": "The tickets could not be transferred.",
          "Contenu": "The tickets could not be transferred.The tickets were purchased and then could not be used by the intended user because their phone was not current enough. Then the tickets could not be transferred from one Apple Wallet to another (both current iOS) without having a ticketmaster account. Attempts to access your help system was not helpful in solving the problem. Spent a week trying to resolve the issue only to have to get tickets printed at the box office on arrival. It was a very frustrating experience!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "LISA G.",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T03:34:38.000Z",
          "Titre": "Poor choice of venue and shorter than expected",
          "Contenu": "Venue did not have good seating unless you were on the main floor. Seating price should reflect the obstructed views. The length of the show did not make it a valuable family outing; a longer show with an intermission would have been excusable for the cost."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "JIM CROSS",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T22:16:41.000Z",
          "Titre": "The show (Trans Siberian Orchestra) was fantastic!",
          "Contenu": "The show (Trans Siberian Orchestra) was awesome.  Loved it. Getting into the venue (Scotiabank Arena) however, was not fun.  The passageway from Union Station to the Arena was jam packed with people and you couldn't move.  Someone going from Jurassic Park to Union Station was faced with wall-to-wall people and had to fight their way through.  Is there a way to have people lined up in an orderly fashion that would allow people to walk through without a battle?"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "AM",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T21:38:35.000Z",
          "Titre": "App not working well",
          "Contenu": "The app was not working well for me. To begin, there were $13 in fees for each ticket that I bough which greatly increased the total cost. Then when I tried logging into the app it would not accept my password and kept saying error. After logging in online (with my same password) it then let me into the app (seems weird that I'd need to do it on my laptop first just to be able to use the app). When I got logged into the app, I clicked events and it was not showing me the tickets I had purchased, after trying again later, I could finally view the tickets but was unsuccessful in saving them to my Apple wallet. It was not until the day of the concert that I could actually get the tickets saved onto my phone. I'm just glad that in the end I was able to use it as intended, but it definitely should not have been so frustrating, especially since I'm paying so many fees."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "BRENDA GRIFFITHS-FORD",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T02:47:05.000Z",
          "Titre": "The TSO concert was superior",
          "Contenu": "The TSO concert was superior, couldn't have asked for a better group of extraordinarily talented musicians to watch and listen to. The issue was with the people who were responsible for getting us from the Go station into the  Scotiabank Arena, A NIGHTMARE. They were completely unprepared for us and it took over 40 minutes to get in, when it's a few minute walk from the Go. I've never walked in so many ridiculously long lines going no where, it was so poorly managed. Absolutely terrible. Then to add insult to injury, we were charged $10 for a bag of popcorn, $7 for a bottle of water and $17 for a beer...unforgivable! We will find other affordable music venues like Chudleighs in Milton who hosts great cover bands and charge $7.95 a beer. They want people to enjoy an affordable night and not feel pillaged like we did. There's no rationale to overcharge at the level this venue charges, it's beyond excessive."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "DAVID PETERS",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T16:51:39.000Z",
          "Titre": "Your site is definitely not senior…",
          "Contenu": "Your site is definitely not senior friendly. It took us two days to figure out your system and what happens when a senior doesn’t have a cell phone, they can’t attend any event as you cannot print out tickets?? Not everyone one is tech savy so you need to bring back actual tickets."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Amber U",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T17:05:11.000Z",
          "Titre": "The seats were horrible",
          "Contenu": "The seats were horrible. I purchased early and had a lot of choice. I would have expected Ticketmaster would have information on the configuration of the stage. I saw the side of a wall on the stage and was under the jumbo screens so saw nothing. It was very disappointing.  I could have chosen cheaper seats and had a way better view. I looked at Seattle tickets last night and the seats where you can’t see are sold out and the better seats that are cheaper are still available which tells me Ticketmaster doesn’t know the seats are completely inadequate. These seats should not be sold especially if the event is not sold out."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "JOHN STOKOE",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T00:48:26.000Z",
          "Titre": "I always have trouble navigating the…",
          "Contenu": "I always have trouble navigating the TicketMaster site and finding my tickets online.  I much prefer paper tickets."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Brenda lee",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T01:18:45.000Z",
          "Titre": "The fees are too expensive too many fees there…",
          "Contenu": "The fees are too expensive there gouging people to use their service shame on them Used to be reasonable, but it sure isn’t anymore and if I had another choice, I wouldn’t use Ticketmaster their fees are too high"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "DAB",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T08:09:19.000Z",
          "Titre": "The show itself was excellent",
          "Contenu": "The show itself was excellent, but the ticketmaster fees are ridiculous!  Nearly 1/5 the price of an already high priced ticket...and when I attempted to resell one ticket for someone that couldn't make the show, they keep the service fees but apply them again on resale?!  Absolute scam, I don't understand how the regulators allow this monopoly to continue."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Tim",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T00:17:07.000Z",
          "Titre": "I was finally able to get tickets to a…",
          "Contenu": "I was finally able to get tickets to a show I was interested in going to. I don't like how many verified resales instantly pop up right after something goes on sale. To me, this is not the way people who love to go to shows are treated. This is how people who want to make money off of people like me are favoured."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "PATRICK GLAUSER",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:47:25.000Z",
          "Titre": "App doesn't work",
          "Contenu": "Your app says to update chrome in order to access my tickets.Chrome is up to date.So essentially the app does not work.Both ticket master app and chrome app are up to date."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Drew",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T21:54:43.000Z",
          "Titre": "Ticketmaster overcomplicates the ticket buying experience",
          "Contenu": "The show was great but this is the first time I've used Ticketmaster in a long time and it was way too convoluted. You had to get an app or put in a google wallet. I just want to print my ticket. What if my phone died? I wouldn't be able to get in. Ticketmaster just make the whole process more difficult."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Spriff",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T00:17:16.000Z",
          "Titre": "Difficult site to navigate",
          "Contenu": "Very difficult site to navigate and follow. Likely due to too much info. I’ll choose a different way to buy my tickets next time."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "mp",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T02:11:01.000Z",
          "Titre": "premium parking ☹️",
          "Contenu": "I purchased the premium parking and didn’t know where to go for parking….I felt that I was sucked in as a consumer as I wasn’t able to use it. Perhaps consider providing parking location details."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "PIERRE-OLIVIER BLAQUIERE",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T03:56:47.000Z",
          "Titre": "Stop dynamic pricing and handling fees",
          "Contenu": "Handling fees (which are higher now that everything is computerized than when we had to go to a counter and deal with human beings) and dynamic pricing are a big reason why I go see less shows than I used to. It’s becoming way too expensive. Pretexting a way stop scalpers but making a platform on which Ticketmaster resells their tickets and taking additional fees on them is ridiculous.Ticketmaster being a monopoly is a huge problem and a nuisance to the industry.The shows themselves are good but Ticketmaster has really no input into that part."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T11:05:37.000Z",
          "Titre": "Purchase of tickets AND entry to the concert was a HASSLE!",
          "Contenu": "When purchasing the tickets, everything went smoothly up until the moment of payment where it didn't work because I entered a landline for the phone number. There was no indication that there would be a text message sent to this number in order to proceed and complete the purchase of the tickets. I entered the landline phone number to match the credit card of the person purchasing the tickets, but had no idea that the code required to complete the purchase of the tickets would be sent via text message to this number. So we had to go back and start the whole process over again and the second time the seats we had initially booked were no longer available. This was because those seats were not showing up as available due to OUR OWN previous order attempt for those specific seats. We were panicking since there were hardly any options with 4 seats together for our party of 4. After waiting several minutes with frequent refreshing (and having another family member helping us look for tickets on another computer), FINALLY our same seats that we had booked the first time finally popped up as being available again. The system for entry is finicky and discriminatory. The fact that people can't print out their tickets and bar codes in advance and that entry requires a smart phone is discriminatory. My husband dropped me off with our 2 kids (8 and 10) and went to park so we wouldn't have to walk so far and so we wouldn't be late because of all the traffic (pretty-much stopped). So we were entering separately from my husband, who had access to the tickets through his account. Such a hassle that I couldn't have printed out our tickets at home or that he couldn't just send me a screen shot of the bar code for us to enter, but he had to send me the link to his account AND send me his pw because I have to be actively logged in to his account to show a \"moving\" bar code. I only recently obtained a small amount of monthly data on my phone; I used to have NO DATA on my phone. What if this concert took place only a short time ago when I didn't have any data on my phone and therefore I couldn't enter on my own with our kids? We would've had to wait 20-30 min outside in the pouring rain for my husband to FIND US AND JOIN US (no easy task in a huge crowd outside the building)! I personally know people who don't have smart phones (only a flip phone with no data), and couples who share one cell phone between the two of them, and this system does not take into consideration these types of people. People might be coming from different locations than the other members of their party. Or what if the battery died on someone's phone? So many potential obstacles! As we were entering, we got stuck behind some people in line who were having trouble with bringing up some of the bar codes on their phone (scanned for only one member in their party but not the rest) while people in the other lines moved quickly ahead. Did I mention it was a torrential downpour and my phone is not waterproof either? I want to have my phone ready, with the moving barcode ready to go, but I also don't want my phone to die from getting wet in the rain. The concert tickets were a gift to our kids from the grandparents, but it's good we took them to the concert instead of the grandparents. I doubt the grandparents would even have been able to get in with all the fancy tech required for entry. Please take into consideration that not everyone who wants to attend a concert has the latest smart phone with all the bells and whistles and data to go with it."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "FRÉDÉRICK BOISVERT",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T19:42:26.000Z",
          "Titre": "Le son beaucoup trop fort au point…",
          "Contenu": "Le son beaucoup trop fort au point qu’on ne pouvait entendre les paroles."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Bill & Sherron",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T18:10:07.000Z",
          "Titre": "The music was too loud",
          "Contenu": "The music was too loud.  The main performer spent too much time in the crowd & a fan monopolized her far too long.  We went to enjoy the show & the performers not to listen all about this fan, etc."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RICHARD LOEWEN",
          "Nb_Reviews": 4,
          "Date": "2023-11-21T16:23:58.000Z",
          "Titre": "Ticket scalping should be illegal",
          "Contenu": "It is disappointing that Ticketmaster allows resale of tickets on their platform at highly inflated prices.  We used to call this scalping.  But it seems to be common practice today"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Richard Phillips",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T02:30:06.000Z",
          "Titre": "Nothing wrong with the show",
          "Contenu": "Nothing wrong with the show, any staff, or likewise.  I think my biggest gripe with ticketmaster is your inability to play fair, and by that I mean by selling tickets to other sites before they go on sale to the public, which allows those groups to sell those tickets at a much higher price."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Anon",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T16:45:03.000Z",
          "Titre": "Ticket scanning DID NOT WORK",
          "Contenu": "When I got to The Venue to have my ticket barcode scanned on the ticketmaster site, all I was seeing was black where the barcode should have been. The ticket person suggested turning dark mode off on my phone but that did not help. Had to go to the ticket office and they ultimately transferred my ticket to my friend who was with me. I wish I could have just had a PDF to print or show on my phone as an alternative. It took us 10 minutes to get into the venue once we got to the ticket person to sort out these technical difficulties. Using the Ticketmaster app instead it's not an option for me. I honestly wonder how people who don't have smartphones are expected to get into concerts these days. I was unable to find any solutions for people who don't have access to a smartphone to get into the venue."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "S DAVIS",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T03:51:49.000Z",
          "Titre": "Don't be pregnant if you are dealing with Ticketmaster…",
          "Contenu": "I had several problems getting the tickets online, I finally got them and realized after the purchase that the system had defaulted to the wrong section. Standing section and my pregnant daughter-in-law was one of our group. I called Ticketmaster and was told I would have to pay $40 in fees to get the tickets corrected.  Not impressed at all!"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Unhappy fan",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T21:26:06.000Z",
          "Titre": "Bought row 2 tickets in the upper bowl",
          "Contenu": "Bought row 2 tickets in the upper bowl. Didn’t realize that row 1 wasn’t sold at all in the upper bowl and people walked in front of us the whole game blocking our view. Then people came and sat in row 1 obliviously not their seat and chain smoked cigarettes the rest of the game. Ushers/security looked over and came by a bunch of times and never did anything about it. We even asked the usher to do something and then just laughed at us."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "CHARI NEVILLE",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T02:05:10.000Z",
          "Titre": "I have bought several tickets from…",
          "Contenu": "I have bought several tickets from Ticketmaster.  The hockey tickets for Scotiabank are the worst.  When you go to purchase 2 tickets in a row and there are 3 seats left; the program will not let you purchase the 2 tickets because there is a seat left open.  Not my problem, I just want 2 of the 3 seats.  You really need to fix the problem.  I had no problem getting tickets for Cirque."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "JOAN",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T17:38:42.000Z",
          "Titre": "Mixed message about wallet tickets.",
          "Contenu": "Followed instructions received in response to a question(System (Ticketmaster CA)Oct 12, 2023, 15:32 GMT+1(15:31:54) John Mark Verde Ceballos: Hi Joan, this is Mark. When you add your tickets to Apple Wallet it only shows one. However, you can tap it at the entrance 4 times because you have 4 tickets. Please be advised also that there would be no barcode for tickets in a digital wallet. If in case you are having difficulties accessing your tickets on the Day of the event, you may go to the Resolution Window located normally near the venue’s main entrance, for assistance on your mobile tickets. Just make sure to show them your credit card used in purchasing the tickets, Valid ID, and order number (44-54259/QUE).)but wallet only scanned once.  Had to step away with my friends and find the original tickets with bar codes before getting back in line to have them scanned.  At my age (83) this is especially annoying!"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "M Wight",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T01:14:21.000Z",
          "Titre": "My tickets arrived just in time",
          "Contenu": "My tickets did not arrive within 10-14 days before the event as Ticketmaster specified they would.  I attempted to use the ChatBot and all it did was repeat the information on My Tickets page.  I tried every day for a week.  I was finally connected to a real person (I think).  But all she did was reiterate what it said on the My Tickets page.  My tickets arrived 7 days before the event."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "GARTH",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T01:53:57.000Z",
          "Titre": "My passes for my Apple wallet were…",
          "Contenu": "My passes for my Apple wallet were disabled again, was refused entry until I went online and used the Ticketmaster website. Guess I’ll have to give up on the wallet from now on."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "ALEXANDRE DESROSIERS",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T14:57:37.000Z",
          "Titre": "Subcharge of 84$ for a kiss army…",
          "Contenu": "Subcharge of 84$ for a kiss army membership that I don’t need and give absolutely nothing it’s really frustrating."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Dejan",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T19:28:46.000Z",
          "Titre": "NFC ticket faulty",
          "Contenu": "Second NFC ticket did not work on the ticket scanner. Thankfully the venue person let the second person in despite this. Needing to get the tickets on phone (instead of any device) and not being able to share the nfc for other people beyond one phone did not help either. Please bring back screenshotable barcodes for people who have a history of not scalping or doing shady things.Also like a third of the final price is ticketmaster processing fees, which is a lot with respect to the foothold ticketmaster has on the market. Plus considering one ticket didn't work, technically I paid for processing of nothing for one of them."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "HEATHER",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T17:54:12.000Z",
          "Titre": "RHPS was Mediocre at best",
          "Contenu": "I know it wasn’t titled “festival”, but anything related to the Rocky Horror Picture Show should be obnoxiously over the top. This event was most definitely NOT that. It seemed under-planned and half-assed. The local acting folks didn’t even know their lines! Zero merch. Badly planned costume contest. No food. Made guests pay for “prop bags” for the show. Very disappointing all around."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "KS",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T00:26:51.000Z",
          "Titre": "Unhappy surprise…",
          "Contenu": "It was not apparent before I purchased a parking pass for my BIL that I would not be able to transfer it. I received less than stellar help from the customer service at ticketmaster who could not help me at all."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "CATHERINE NOVICK",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T18:12:32.000Z",
          "Titre": "My husband uses a walker",
          "Contenu": "My husband uses a walker. We had lovely seats at the theatre but parking was a nightmare. We paid $50 for ‘accessible parking. After 9 levels we finally found a spot, not accessible. Parking is in a separate building from the theatre and a very long walk. Then when we left the parking lot, the attendant at the exit said parking was free! Ticketmaster sold parking bundled with the event and it was misleading and most inconvenient."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "AMANDA BRADLEY",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T22:24:54.000Z",
          "Titre": "More information should have been…",
          "Contenu": "More information should have been available for the VIP meet and greet."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Akela Amaral",
          "Nb_Reviews": 2,
          "Date": "2023-10-29T20:37:22.000Z",
          "Titre": "Terrible acoustics, Challenging Visual, Frustrating Delays",
          "Contenu": "The acoustics were so distorted that I couldn’t make out the words, it was very hard to follow along at all.The show started 1.5 hours late and although there was a DJ mixing songs, I feel we should have been informed of the change in timing by the DJ. From my seats, I could not see the screen due to the big speakers placed in front. When you cant hear or see properly and you are waiting for 90 minutes, it made for a very frustrating night. I had spent 6 hours that day, travelling for this concert and I eventually was frustrated enough to leave early. If I hadn’t done so, I would have missed the last subway and my time would have stretched longer then 7 hours, I left being thankful of that but not happy about the concert at all."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "CP",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T22:42:17.000Z",
          "Titre": "Queen + Adam Lambert - Cable Obstruction",
          "Contenu": "Queen + Adam Lambert were great. I would love to see them again, but without any obstruction! When I purchased my tickets, I was not aware that there would be a giant cable that would be right in the middle of my view of the stage. The cable was hanging from a light scaffold extending to the control centre. I had brought my two daughters for the show too, and I was disappointed that their first experience at a concert at Scotiabank had this giant cable. It's too bad I can't include pictures in this review. I definitely will not be buying tickets in the future in section 303, Row 3."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "DY",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T17:16:13.000Z",
          "Titre": "I bought a set of four tickets and…",
          "Contenu": "I bought a set of four tickets and could not buy a fifth ticket adjacent to our seats without buying another set of four. There was no one sitting next to either side of us at the event and these seats could have been sold as a single ticket at least a day or two prior to the event date if there were no takers for a set of four leading up to the event dates."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "DONALD THOMPSON",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T05:07:17.000Z",
          "Titre": "Refunds",
          "Contenu": "I accidentally clicked on Quebec City rather than Toronto when ordering Andre Rieu tickets. I called to report it and the agent said \"Just resell them closer to the date\" But when the time came, Ticketmaster would not accept resales for that concert. Disappointing."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "STEPHANIE",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T11:45:52.000Z",
          "Titre": "False advertising",
          "Contenu": "My group was extremely disappointed in this musical, for the fact that it was advertised as an English play with portions in French. In reality, the entire musical was in French, with the exception of the songs. We did not understand anything that was being said, which made for a very boring performance. I heard the advertisement for this musical on an English only radio station, where it was promoted entirely in English. The description on the ticket was described in English, and no where in the advertising did it say this was a French musical. We were very mislead."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Mary Green",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T17:00:28.000Z",
          "Titre": "I would like to be able to print my ticket",
          "Contenu": "I would like to be able to print my tickets."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Derek F",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T21:28:35.000Z",
          "Titre": "Tickets were not pitch side as indicated when purchased",
          "Contenu": "When I purchased the tickets it indicated they were pitch side. At the ground it was apparent they were not, in fact about 30 rows up from pitch side!"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "COLE CORBETT",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T22:16:07.000Z",
          "Titre": "The seats sold to me were far better on…",
          "Contenu": "The seats sold to me were far better on paper. Once actually in the seats, it was clear to me that the whole section should have had the cover over top of the seats to block them out. Section 217 row v 1&2. Great for a soccer game, terrible for a concert."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "HILARY MARCOTTE",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T16:18:30.000Z",
          "Titre": "App was very glitchy",
          "Contenu": "App was very glitchy, was un able to transfer tickes, got repeated error messages."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "JEREMY",
          "Nb_Reviews": 3,
          "Date": "2023-10-20T16:39:24.000Z",
          "Titre": "I can never login to your app",
          "Contenu": "I can never login to your app for some reason.  I downloaded my tickets from your website to my wallet instead. Plus your service fees are garbage."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "sktruchan",
          "Nb_Reviews": 2,
          "Date": "2023-09-30T17:51:43.000Z",
          "Titre": "Ticket on my Phone???",
          "Contenu": "I'm a senior and I found it hard ordering tickets.  Then I found out that I had the tickets on my phone which I did not want.  It was difficult to find out how to work my phone to access the ticket.  I think it should be easier to see what sort of ticket you are actually ordering."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Natasha",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T19:47:12.000Z",
          "Titre": "Got to the venue and the doors were…",
          "Contenu": "Got to the venue and the doors were locked. Lined up at 6:45pm as the show was supposed to start at 7pm. The hall didn't start letting people in until 7:45 and it took forever. Security and ticket entrance was a complete mess. People were cutting in front of each other in line and there was no control from staff. By the time the show started it was 8:40pm"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "ARNICA M MAHOOD",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T23:31:06.000Z",
          "Titre": "The VIP was not very well explained I…",
          "Contenu": "The VIP was not very well explained I would not have paid $200 for the tickets if I known I was gonna be there for an hour and not seen Paul Brandt that was an extra hundred dollars that was not explained very well and there’s five of us in that position"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "JENNIFER GALATI",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T23:26:51.000Z",
          "Titre": "I was not given an email to let me know…",
          "Contenu": "I was not given an email to let me know that my VIP ticket would get me in at 5pm."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Dave Cunning",
          "Nb_Reviews": 3,
          "Date": "2023-11-25T00:34:58.000Z",
          "Titre": "Show was great but don’t appreciate…",
          "Contenu": "Show was great but don’t appreciate price fluctuations."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "MAURICE TURCOTTE",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T06:00:41.000Z",
          "Titre": "I don't have a cell phone and had to…",
          "Contenu": "I don't have a cell phone and had to rely on a friend to get us in with his cell phone- won't be attending another event at CTC - you guys make it too difficult to get tickets without a cell phone so I'm out."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "RANDALL KESLER",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T15:31:39.000Z",
          "Titre": "Prices should not changed day to day…",
          "Contenu": "Prices should not changed day to day based on demand it should be a set price no matter what. Winning the lottery to buy tickets also is not exactly fair."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "GARY SMITH",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T18:08:05.000Z",
          "Titre": "I would have just preferred an email…",
          "Contenu": "I would have just preferred an email with an attachment that I open that shows the tickets for entrance to the show. This would have been easier. Thanks, Gary"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Ontario folks",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T01:03:09.000Z",
          "Titre": "You sold me a seat that was occupied by…",
          "Contenu": "You sold me a seat that was occupied by the goal judge"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "JARRETT CARDINAL",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T20:01:49.000Z",
          "Titre": "Couldn't access tickets for the show…",
          "Contenu": "Couldn't access tickets for the show the night before. Had to buy them in the morning when it was working again."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Christy",
          "Nb_Reviews": 4,
          "Date": "2023-10-08T17:52:55.000Z",
          "Titre": "Too much fees for what",
          "Contenu": "It was all fine but honestly the prices and fees Ticketmaster charges is really ridiculous, I wish I didn’t have to go through Ticketmaster to buy tickets"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "LD",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T21:46:51.000Z",
          "Titre": "The show was a few hit songs and too…",
          "Contenu": "The show was a few hit songs and too many cover songs. Not worth the money spent."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "NICOLE LEVINE",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T07:36:12.000Z",
          "Titre": "It’s too expensive",
          "Contenu": "It’s too expensive. Ticketmaster fee is too high"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Don",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T03:23:34.000Z",
          "Titre": "The show is good, but not Ticketmaster's price",
          "Contenu": "The show was good. But the price on Ticketmaster is way more expensive than the price at the gate."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "CHERYL",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T17:46:17.000Z",
          "Titre": "The website is great",
          "Contenu": "The website is great, but I feel ticketmaster takes way too high of a commision"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "WAYNE COX",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T16:23:31.000Z",
          "Titre": "Ticket couldn'",
          "Contenu": "Ticket couldn't scan at arena"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T20:43:27.000Z",
          "Titre": "The Ticketmaster app is useless."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "DREW DUFFETT",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T22:20:29.000Z",
          "Titre": "Purchasing tickets is a nightmare",
          "Contenu": "Purchasing tickets is a nightmare.  Dynamic pricing should be illegal"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Bhaijan",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T18:11:13.000Z",
          "Titre": "The show was suppose to start at 7:00…",
          "Contenu": "The show was suppose to start at 7:00 pm. The doors to the venue did not open up till 8:30 pm. We were lined up outside in the cold. The show started at 9:00 pm"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "DANIEL SCHMEREGA",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T00:31:50.000Z",
          "Titre": "Not worth the money",
          "Contenu": "What a mediocre performance from a top notch comedian"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "doug grimston",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T22:16:17.000Z",
          "Titre": "Extra fees on top of my ticket price",
          "Contenu": "Extra fees on top of my ticket price. Terrible."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "MEAGAN BROWN",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T03:26:23.000Z",
          "Titre": "Too many emails",
          "Contenu": "Too many emails. Don’t make me download the app. Just send the tickets."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "DC",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T20:36:17.000Z",
          "Titre": "The sound was really really awful",
          "Contenu": "The sound was really really awful. Plenty of people smoking, vaping."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "CAROLE CHAPDELAINE",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T00:04:45.000Z",
          "Titre": "Floor uncleaned",
          "Contenu": "Floor uncleaned, sticky."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "DON GARDINER",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T00:49:30.000Z",
          "Titre": "Smooth as silk!"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Chris DeMarcus",
          "Nb_Reviews": 3,
          "Date": "2023-10-25T17:12:53.000Z",
          "Titre": "Service fee prices are too high"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "ms",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T18:16:39.000Z",
          "Titre": "Ticketmaster's monopolistic practices…",
          "Contenu": "Ticketmaster's monopolistic practices means that ticket prices are too expensive"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "WILLIAM STEWART",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T12:32:51.000Z",
          "Titre": "PRINTABLE TICKETS",
          "Contenu": "I want to be able to print my tickets"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "N AHMED",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T02:53:10.000Z",
          "Titre": "Too much in fees"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "LUCI NIDZGORSKI",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:29:52.000Z",
          "Titre": "Modernization doesn't always make things better",
          "Contenu": "I have been taking my kids and grandkids to the Nutcracker for over forty years. I have seen productions across Canada plus in Russia. The ballet artists were spectacular, I just had a hard time with how the production was made politically correct by removing the country themed costumes to match the music, removing the Arabian  women with vails, the Russian , Chinese and Spanish dancers. National costumes and dance are not offensive. You couldn't even recognize the sugar plum fairies in this production. The costumes are part of what made this  production special. Unless you were familiar with each piece of music you hand no idea of what was happening. This ballet dates back to 1892 and it is a shame to see it manipulated to match todays outlook."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "FRANCINE MOULDER",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T16:27:26.000Z",
          "Titre": "Our tickets would not scan",
          "Contenu": "Our tickets would not scan. They pulled us aside along with others that had purchased online and had physical tickets. They had to contact a supervisor, then they had to contact ticket master for verification of validity of tickets. Very dissatisfied with that.The concert was excellent. Just the handling of the tickets was not acceptable!"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Brit",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T05:26:39.000Z",
          "Titre": "The seating was very deceiving when…",
          "Contenu": "The seating was very deceiving when choosing where to sit.  We ended up being so far in the corner we couldn’t see half of the show the way the stage was angled."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "MITCHELL D'SOUZA",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T00:42:29.000Z",
          "Titre": "False Advertising of Stage View",
          "Contenu": "When I purchased my tickets, they were never advertised as “partial view” and then when my tickets appeared on my account 48 hours prior to the show, to my surprise they said “partial view”. Very annoyed about this, as the tickets should have been advertised at purchase as partial view."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "ROBERT WILKIN",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T23:32:54.000Z",
          "Titre": "My ticket would not scan at the event.",
          "Contenu": "My ticket would not scan at the event.It wouldn’t scan in my apple wallet or from my ticket master email. I was rejected entry, however I spoke with a hockey Canada official who agreed my ticket was legitimate. I then was permitted in. I hope this doesn’t happen at the prospect game in January in Moncton."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dmitri Varushken",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T08:07:21.000Z",
          "Titre": "Why is the venue cashless?",
          "Contenu": "Why is the venue cashless? That is unlawful. Businesses are not allowed to refuse cash. I will be boycotting this venue moving forward.I guess the ticket process needs to be secure, which is why no screenshots or printed copies. I don't really like it. What happens to those who don't have a phone? They can't go? That's crazy!"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "LYNN WILBUR",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T20:36:07.000Z",
          "Titre": "obstructed view",
          "Contenu": "I was very upset to learn that my seat selection was a partially obstructed view!  section 109, row 9 seat 1.  I could not see the full right hand section of the stage and, since Trans Siberian Orchestra is all about stage presentation and light show, it was extremely disappointing.  I would not have booked this seat if it had been noted on Ticketmaster that is was obstructed view.  I think that some compensation is in order."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "LYNDA SLATER",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T07:50:52.000Z",
          "Titre": "Great show, terrible floor seating",
          "Contenu": "The seating on the floor needs to be spaced out better. Everyone is stuck to each other, you can barely move. You can't put anything down without knocking it  or having someone else knock it over. We are all stuck together like a can of sardines, and it isn't very comfortable at all, especially for a 2 hour show."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "ALIYAH NUTE",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T17:20:29.000Z",
          "Titre": "Great concert! Presale code didn’t make tickets cheaper",
          "Contenu": "The actual concert was great but I think you guys need to not inflate ticket prices so high. actually give people a chance to get tickets.Also my presale code didn’t make my tickets cheaper at all. That being said I was happy I got a chance to get tickets for this show."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "STACEY GENDRON",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T00:25:02.000Z",
          "Titre": "Ticketmaster is great, there are just a couple of small details I wish were different",
          "Contenu": "I always have a great experience from Ticketmaster, the seats were good with a good price.  The only thing I wish is that we could buy more than 8 tickets at a time, for instance, I needed 10 tickets to this game because it was for a birthday, but I had to buy 8, and my husband had to get 2 using his account.  (even then it tracked us and wouldn't let him buy the tickets until he turned off wifi)  Also, I should be able to buy 3 tickets if i want to, I often see 1 seat left so it sucks that you can't buy 3 if you need 3.  That is the difference in 5 stars and the 3 I gave."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "MARY ULMER",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:30:43.000Z",
          "Titre": "I paid for parking but it appears…",
          "Contenu": "I paid for parking but it appears parking was free"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jane Doe",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T00:17:33.000Z",
          "Titre": "Would like a printable version of the…",
          "Contenu": "Would like a printable version of the tickets. One person in my party does not have a cell phone to transfer ticket."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jimmy",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T01:56:27.000Z",
          "Titre": "Poor refund policy",
          "Contenu": "Well, it's ticketmaster. Gotta love monopolized platforms with zero competition.  Prices at least being up front about fees finally are nice. Pain in the ass to get a refund though.  Unless there is something postponed or canceled with the event, there is no opportunity to obtain a refund.  I won tickets through a local radio show in the week leading up to the event, and wasn't able to sell my tickets to someone else.  Contacted ticketmaster and was told there was nothing they could do about it. Pretty poor experience on that front.  The agent I talked with was nothing but polite and helpful in explaining available options i could pursue.  Ticketmaster policies prevented a direct refund in this instance."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "carson kwok",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T00:16:39.000Z",
          "Titre": "the fees are high and discriminate",
          "Contenu": "the fees are high and discriminatewant the option of paper tickets, not just phone"
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "LD",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T19:30:04.000Z",
          "Titre": "Payment for sold tickets",
          "Contenu": "After buying tickets, I could not attend due to a family event.  I successfully shared two tickets with a friend.  Almost a month ago, I sold two tickets at cost but have not received payment.  I have completed your online tax and bank forms multiple times.  Not impressed."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "BP in Winnipeg",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T23:22:49.000Z",
          "Titre": "What happens if you don’t have the app?",
          "Contenu": "I cannot install the Ticketmaster app on my phone so I wasn’t sure if I could get into the show. I printed the email showing that I paid, hoping that would suffice. Fortunately, that venue (the Burton Cummings) had a cashier who quickly printed a paper ticket. I felt lucky that it worked out, but I didn’t appreciate worrying about it for days after buying the ticket."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "BB",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T18:30:58.000Z",
          "Titre": "The reminders for the event and easy…",
          "Contenu": "The reminders for the event and easy access to our tickets were great. Venue wasGood and parking well organized. The service fees per ticket are disappointing when families are calculating the cost of their purchase (misleading once they’re added in to base price). Wish these fees were lower."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "DOROTHY",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T22:05:35.000Z",
          "Titre": "It was a good show",
          "Contenu": "It was a good show, the guys could really sing.  HOWEVER, they have not yet become an act. They seemed awkward with one another and kept referring to the snow in Winnipeg.  There is no snow in Winnipeg, look out the window!"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "KIMBERLY WALCHUK",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T17:45:40.000Z",
          "Titre": "The seats we had purchased were not the…",
          "Contenu": "The seats we had purchased were not the “cheapest” seats available. We ended up with a completely obstructed view. Myself, my mother and daughter could not see the show. We had to go stand to watch the show. Very disappointing as there was no details during booking that stated obstructed view"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Kyle Cunnington",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T03:06:58.000Z",
          "Titre": "Doors open and start time of bands not…",
          "Contenu": "Doors open and start time of bands not listed on ticket face. Only 7pm on ticket without clearly stating doors or when band start. Missed first band (Whitechapel) because thought doors open at 7pm."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "MIKE R",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T01:40:42.000Z",
          "Titre": "Turned Away from the Free Merandise Queue with Platinum VIP Tickets",
          "Contenu": "The description of what is included with each tier of ticket is lacking. On November 5, 2023, we had 'Platinum VIP Tickets' and were not eligible for any free Merchandise. On April 7, 2023, same band (Depeche Mode), we had 'Silver VIP Tickets' and received a bag of free Merchandise. The perks of each level of ticket needs to be crystal clear prior to purchase."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Mcibaron",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T04:37:26.000Z",
          "Titre": "Would be a full star review but…",
          "Contenu": "Would be a full star review but the fees and rates that are added by ticket master (and ticket master only for the high rates and fees) are seriously insane. Overall good place to buy and resell concert/event tickets if not then from the original seller. 👍"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jj",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T23:36:47.000Z",
          "Titre": "Line ups were too long, unorganized",
          "Contenu": "Line ups were too long. Our tickets did not give gate entrances to enter and everyone seemed to enter in the main gate. Very unorganized"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "price",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T17:30:54.000Z",
          "Titre": "Beware of additional shows added and multply prices.",
          "Contenu": "The Come FromAway show was fantastic. However purchasing tickets months in advance on Ticketmaster was not easy. #1. We are in our seventies and not computer wizzards so NOT being able to print our tickets with bar codes (Compared to how easy it was before Ticketmaster) was discouraging and  time consuming and in my opinion, unecessasary. #2. Prices are inflated and everyone rushing to ensure a good seat just makes you accept a lesser seating arrangement only to find oiut a month or so later several new show dates have been added and some people got better priced tickets than us because it appeared only two seats were available together and they were on the floor ...that was for the matinee Nov 19....After many attempts to get tickets printed it was obvious we had to try another approach or not see the show....so through friends and several attempts we got our tickets on the phone and didn't feel comfortable until they were scanned at showtime.....According to friends who purchased their tickets for an additional show, they seem to have gotten a better deal...compared to our floor seats for $235. Not happy with whole process but The show was great because it was about our home province of Newfoundland."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "TIM YUSISHEN",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T00:55:25.000Z",
          "Titre": "Fairly good show but Ticketmaster should not false advertise",
          "Contenu": "Fairly good show, no stage video monitors to see band members.  Biggest disappointment was the lead singer of the Doobie Brothers was not on stage.Who I really wanted to see as shown in your ticket master offer / picture was not present"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "RHONDA MUELLER",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T08:01:35.000Z",
          "Titre": "Well the fact that the tour showed pics…",
          "Contenu": "Well the fact that the tour showed pics of the founder of the band Tom would be there was deceiving point blank. The band sounded good but the security? Needs to have various ethnicities involved not just one that is known to be disrespectful to the female gender. Two  run ins with an aggressive man threatening a sixty yr old woman if I did not step into the penalty box? Ya you should get I touch with me as it was unacceptable to be bullied by the staff."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "SCOTT HORSBURGH",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T16:34:59.000Z",
          "Titre": "There should be a standard processing…",
          "Contenu": "There should be a standard processing fee!!! Should not change with the price of the ticket.  I would not use ticketmaster if there were other options for the concerts I want to attend."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "LINDA DENIS",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T18:11:21.000Z",
          "Titre": "I liked the payment process and…",
          "Contenu": "I liked the payment process and uploading the tickets with QR code onto my phone.  I tried to transfer 2 of the tickets to friends who were caught in a traffic jam but she would not have been granted admission unless I went all the way to the entrance with my phone to get her scanned in off my phone.  I use a walker to get around and this was difficult.  Also it was very unclear about different rates for seniors and children.  I paid full price for 4 seniors and 1 child."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T16:30:26.000Z",
          "Titre": "When i transferred my tickets to my…",
          "Contenu": "When i transferred my tickets to my Apple Wallet, the Wallet app did not show a QR or UPC code, making the tickets unusable from that app.  I had to use the TM app to gain admission, which is OK, but it would have been good if the tech support people at Ticketmaster had been able to offer some useful assistance to get my tickets in the the Wallet app working right."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Natasha",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T00:50:46.000Z",
          "Titre": "A few gaps",
          "Contenu": "Like: seatsDislike: seats should be organized by what side you are cheering for. There is nobody who came around the stands with nuts, hotdogs  popcorn, drinks. Nothing was brought around at all."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "STAN WEBSDALE",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T19:44:28.000Z",
          "Titre": "great app sucks…",
          "Contenu": "What would be a great app sucks sometimes when using it, it prompts you to change password , then you can't login after successfully changing password. Making it frustrating when entering the venue and you can't login."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Angie Brown",
          "Nb_Reviews": 4,
          "Date": "2023-11-01T22:24:44.000Z",
          "Titre": "Just too dangerous",
          "Contenu": "It took 35 minutes to get in the gate, then we spent 40 minutes stuck (not moving at all) in the concourse trying to get to our seats.  We missed the players coming out, introductions, treaty acknowledgement, fly over, anthem and first and second goals of the first period.I had a panic attack in the middle of the concourse because bigger men were starting to push and we started getting squished into the people in front of us.  I'm 5'1\" and a lady beside me was well under 5'.   There were numerous seniors and small children that were pushed and squeezed as well.  It was truly terrifying.I will not be attending any other events at this venue as we still experienced lengthy wait times to get in the gates when attending Garth Brooks but no where near to the danger that we experienced last Saturday."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "CONNIE SWARBRICK",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T22:11:29.000Z",
          "Titre": "Ill-equipped to handle the crowd",
          "Contenu": "The entry to Commonwealth stadium was terrible, they were ill-equipped to run 55,000 people through security for a 55,000 seat stadium. Did they not know they were sold out? Concession were brutal, ran out of food and some beverages.The atmosphere and setting for the game itself was terrific."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "SUSAN RENAUD",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T19:47:15.000Z",
          "Titre": "It was east to book",
          "Contenu": "It was east to book. The problem was the ushers had a hard time scanning moving barcode. Had to call a supervisor over."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "DOUGLAS BARR",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T17:29:38.000Z",
          "Titre": "Muddled sound",
          "Contenu": "Muddled sound. The sound engineer created too much mid-lower bass boost on the drummers kick. This causes the mid and mid-high frequencies  to become overwhelmed and do not project forward.This band is known for their guitars and vocals...not a strong beat of the bass drum.It almost ruined my experience."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "DIANA MONETTE",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T02:42:13.000Z",
          "Titre": "Folsom Prison Revisited",
          "Contenu": "Would have been nice if the main singer knew the narrative better also ear phones fit him better, very distracting to see him adjusting continuously. Too bad there were technicians on stage during performance adjusting electrical. However the songs were very well done!!"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "NATHAN PROUDLOVE",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T03:18:57.000Z",
          "Titre": "Mobile authentication issues.",
          "Contenu": "Most things went well but I ran into trouble trying to transfer a ticket to my friend. The mobile authentication for the transfer kept failing and customer service told me to do the transfer on PC. That worked but the mobile experience is still lacking"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Lisa",
          "Nb_Reviews": 2,
          "Date": "2023-10-29T20:45:33.000Z",
          "Titre": "Cole Swindell at Rama",
          "Contenu": "Cole swindell , Nate smith and Avery Anna were all fabulous! The Rama theatre in Orillia was unbelievably hot and uncomfortable! Thousands of people on a warm night and no AC! For the price we paid I would expect a comfortable experience."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "LEONARD BARKER",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T23:48:42.000Z",
          "Titre": "What is going on in the parking lot",
          "Contenu": "What is going on in the parking lot! Arrive at game 200 level  [not cheap]. Told lot I have been going to forever is closed for prepaid only. Sent to back lot9 raining now no covered walkway. Now for the bigger inconvenience the lot takes no cash must download app? Really. Ended up paying a nice man in parking lot with cash machine. This is unacceptable.  Oh yeah my wife has mobility issues. Thanks for this experience lol."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Liz R.",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T06:50:39.000Z",
          "Titre": "Great fund raiser show !",
          "Contenu": "The venue was not the best for Acoustics. Also, the unfortunate part was that FarmFair had just happened and the lingering smell was not great 😞The performers were awesome !! 👍🏼"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "brittany",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T18:59:46.000Z",
          "Titre": "Skip the pre paid parking, and pull into any of the parking lots in the area for half the price.",
          "Contenu": "I loved everything except the parking at the bell venue, I pre paid 41$ for parking on ticket master, and when I arrived at the venue I spent 30 minutes attempting to get into the parking lot with no luck. I then paid 20$ to park in a different lot 3 blocks from the venue and walked to the show. Worst parking system ever."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "BRENT FISHER",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T18:09:20.000Z",
          "Titre": "Venue concessions were not prepared or…",
          "Contenu": "Venue concessions were not prepared or staffed correctly. Crowd control was non existent. Merch tables were in very bad spots for the size of crowds, should have been set up outside before and after the event"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "JACQUELINE GARRETT",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T17:53:08.000Z",
          "Titre": "Concert was great",
          "Contenu": "Concert was great, however the venue had no seating, except for a very small section for people with mobility issues. Most of the people at the concert were 50+.  Having nowhere to sit was very disappointing."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Barbie",
          "Nb_Reviews": 2,
          "Date": "2023-10-31T01:02:27.000Z",
          "Titre": "Billy Talent Saves The Night",
          "Contenu": "Billy Talent absolutely KILLED IT! They were amazing!! However, the rest of the night kinda sucked. It was hardly a \"Halloween Party\", more of a concert with people in costumes. It was really disappointing in that respect. The venue was great for the obvious reasons, location, parking, being able to go enjoy the casino. However, the staff there were absolutely terrible. I was asked for my ID at least 8 times throughout the night (I am 45yrs old) and it got ridiculous. I was asked for more identification than when I fly internationally! I understand AGLC has it's rules, but this was definitely overkill. So, the No Halloween Vibe, rude staff, and having to practically provide a DNA test to get through any door nearly ruined the night...but then Billy Talent totally saved it with an unbelievable performance. Thanks to them it was a fun night."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jack",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T22:17:11.000Z",
          "Titre": "I do not own a smart phone and…",
          "Contenu": "I do not own a smart phone and therefore it is extremely difficult for me to access tickets and must depend on someone else's phone."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Julie",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T16:29:43.000Z",
          "Titre": "Portable potties for bathrooms?",
          "Contenu": "Portable potties for bathrooms?? They were very dirty. No toilet paper and awful wash stations. This was the washroom option for floor tickets. Also had these types of washrooms on mezzanine level. When you pay $500/ticket, venue should offer at minimal, decent facilities."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Twyla Bode",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T17:02:01.000Z",
          "Titre": "I want PAPER tickets.",
          "Contenu": "I HATE that there is no option for a paper ticket.  This causes me great stress and then when we did get there, initially my daughters ticket on her phone wouldn't work and this took more than 20 minutes to figure out at the box office.  HATE!!"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "MONICA DE FREITAS",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T08:32:42.000Z",
          "Titre": "Encanto Live Band & Sing Along Experience",
          "Contenu": "It was nice to have a live band.  What could of made the experience worth the price paid for tickets was to have the disney characters performing the songs with the crowd to make the sing along more interactive.  The experience felt more like we were watching the movie. It wasnt worth the money spent."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Michelle",
          "Nb_Reviews": 4,
          "Date": "2023-11-01T22:15:53.000Z",
          "Titre": "Different but nice",
          "Contenu": "I found the show confusing.  I wasn't expecting to sit through the entire movie with a live band.  When the intermission came it was so sudden with no announcement that I wasn't sure if that was it or not. Although I now understand the premise, the end of the show where they sang and got people involved could have been the show itself if a few more songs were added in. I think most people felt the same as half of the venue cleared out as soon as the movie ended.  At that point I thought the last song was the the finale, but then they did a few more songs and a mash up.  The only reason I knew it wasn't over, was because the lights didn't come on.The performers were talented, no doubt.  But the show itself should have been laid out better or a program issued so we'd be aware of what was happening throughout."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "RANDALL BAKER",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T23:31:07.000Z",
          "Titre": ":) Easy to buy online.",
          "Contenu": ":) Easy to buy online.:( Too expensive.:( Only three seat options.:) Easy to have tickets on phone."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "QPXKZ JOZXYQK",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T00:44:02.000Z",
          "Titre": "If you stopped charging so much for…",
          "Contenu": "If you stopped charging so much for tickets I and millions more people would be happier"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "DEBBY SMITH",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T02:57:03.000Z",
          "Titre": "When I booked I do not recall that the…",
          "Contenu": "When I booked I do not recall that the seats I purchased were with an obstructed view - if this was stated somewhere it should have been I bigger print or required an acknowledgement fromme. The purchase itself was straight forward. I was surprised to read about the entry policy and bags - however I saw many folks entering with bags that were not see through and they were searched and went on their way. The directions to our seats were minimal with little signage - this could be improved."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "JOHN BODNARCHUK",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T16:15:46.000Z",
          "Titre": "Promotional codes",
          "Contenu": "I received an email solicitation from ticketmaster advising me of a discount using a promotional code (FIRSTDOWN).  Through the purchase process I did not see the opportunity to input this code and as a result did not receive the discounted price.  When I followed up with Ticketmaster I was advised tough luck - if you didn't enter it nothing could be done.  No problem it was my fault - I just don't understand the follow up in not honoring the offered discount."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T23:56:20.000Z",
          "Titre": "The acoustics weren’t good",
          "Contenu": "The acoustics weren’t good.  The music was too loud and Tyler’s voice was being drowned out.  Even when he was speaking, it was hard to understand what he was saying.  It could be because we were sitting in the upper balcony, I don’t know. Even though I loved his songs, I was disappointed with the quality of the sound."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "K.  LABRASH",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T05:52:45.000Z",
          "Titre": "Parking FIASCO",
          "Contenu": "Concert was excellent, very organized once inside the venue.*Would like to have the option of printing tickets via Ticketmaster.Parking situation was a nightmare at the Abbotsford Events Centre.  We arrived by car two blocks down the street from the venue an hour before the concert start time and it took over an hour to get into the parking lot from the street. We then had to eventually park in the furthest parking lot from the venue doors in the adjoining college.  Many people in this parking lot were confused as to where to purchase parking and how to walk to the venue from this location.  By the time we purchased a parking ticket and walked back to the doors of the venue, we missed the first 40 MINUTES of the concert , arriving in our assigned seats at 8:40pm. (Concert was scheduled to start at 8:00pm).We have been to events in this venue in the past and it has never taken this long to get into the parking lot and then park a vehicle.  In the past, the venue has had flag persons assisting vehicles on the road, and at the signal lights, into the venue parking lot to keep traffic organized.  There were many other attendees in this same situation. (The concert itself was excellent)."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Gary Richardson",
          "Nb_Reviews": 3,
          "Date": "2023-10-31T17:33:46.000Z",
          "Titre": "I want paper tickets back",
          "Contenu": "I want paper tickets back. This phone crap sucks. I have to conserve battery all day just so I can still gain entry to my expensive events. There is no way it's too expensive or bad for the environment"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Brekhna",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T03:14:19.000Z",
          "Titre": "A great vocalist who put on a great show",
          "Contenu": "I have grown up listening to Atif Aslam’s music since I was like 6, so finally being able to see him live was incredible.He’s an incredible vocalist with a vibe vocal range, who sung his heart out but was so groovy at the same time."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "DUNCAN MCCOLL",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T16:47:28.000Z",
          "Titre": "Unable to load my tickets into my…",
          "Contenu": "Unable to load my tickets into my wallet.  Your website said to contact ticketmaster but they were unable to assist.  Also very hard to find a phone number.  The chat box was useless."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "SOPHIE POULIOT",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T18:27:08.000Z",
          "Titre": "You should let people resell their…",
          "Contenu": "You should let people resell their tickets as low as they want. Especially when they upgraded and purchased crazy expensive Platinum tickets from you"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "JOAN AKER",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T21:33:48.000Z",
          "Titre": "It would be fantastic to be able to…Smooth service",
          "Contenu": "It would be fantastic to be able to phone for tickets. The whole process of buying tickets was painful. I didn't know my password for ticket master and had to get a new one. In the meantime the tickets could have sold out. Technology and so -called progress isn't always better. IT ISN\"T FASTER."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "CHRISTIAN",
          "Nb_Reviews": 3,
          "Date": "2023-10-18T14:45:38.000Z",
          "Titre": "Ticketmaster authorize resellers to buy…",
          "Contenu": "Ticketmaster authorize resellers to buy big quantity of tickets. And those people know how to do it.  They log-in long in advance. When I logged-in 5 minute prior the start I was 398 in line.  This can be OK if those 397 before me buy 2-5 tickets. But When it was my time there were no more tickets to sit my son and I near to each other.  A couple of minutes after, there were a lot of tickets available by the resellers at a higher price.  I understand that Ticketmaster is a business and it is marvelous to be able to get the commission twice on the same ticket, but this is not faire for the fans.  The NHL should use a different system for the tickets"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "RAEANE",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T17:31:05.000Z",
          "Titre": "Poor seating",
          "Contenu": "The show itself was great. But got an email beforehand saying they had “moved your seats to provide you with a better view”- we got moved from upper level first row and dead centre to upper level second highest row, last seats before the blocked off section. Had to sit with our heads rotated to see the entire show and left with a sore neck. Seats were not improved at all as they had suggested"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "nina pratt",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T22:21:39.000Z",
          "Titre": "Not being able to print the tickets",
          "Contenu": "Not being able to print the tickets is a pain  Not all people have smart phones and not all like or able to put in a wallet.  Heard many complaining about that hassle  Also if one person gets a group of tickets takes too much time to send to others  Old way is much better easier safer for purchaser and makes a much easier process  You do for other events why change for the Royal  enough thing dealing with a event down town TO let alone having problems getting tickets together so you can go with friends or family group"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Steph",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T23:25:51.000Z",
          "Titre": "Well I bought first row ticket on the…",
          "Contenu": "Well I bought first row ticket on the aide of thé stage for thé show. Then They nove thé stage to have more people… i wasn’t first row anymore and i have to pay $50 to change it.I was Really not happy. You should call to let us know or sens an e-mail and change it for free"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "JUDY LEWIS",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T19:19:54.000Z",
          "Titre": "The concert was supposed to start at 8…",
          "Contenu": "The concert was supposed to start at 8 pm; however we were atill in a long lineup outside at 8 pm. The show started before we even got to our seat. Being new to the venue I couldn't find my seat and no staff were visible in the hallway to help forect me. All the staff seemed to be at the doors still doing security checks. It was chaos in my opinion. The band however was great. I would have given a much higher score had it not been for the venue's problems."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "MARK POETKER",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T15:44:21.000Z",
          "Titre": "I don't know who hired the security for…",
          "Contenu": "I don't know who hired the security for the Arena for Tool but they stood with their heads in my way for a quarter of the show I asked them to move and they asked me if I wanted to get kicked out of the concert nice people you have working for you"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "DON LAI",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T18:26:18.000Z",
          "Titre": "Must fix overseas credit card issue.",
          "Contenu": "I am visiting from overseas. I managed to successfully buy a single Standard Ticket for Day 2 a day prior to the event by using my overseas credit card, and the process was smooth. However, on the morning of Day 3, I wanted to buy a Verified Resale Ticket but the system was not able to process my overseas credit card this time. As a result, I missed it out on Day 3, which was very disappointing."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Hannes De Beer",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T03:32:04.000Z",
          "Titre": "Seats got changed and not for the better.",
          "Contenu": "I purchased my tickets with very specific ideas. At the left end of the row in a section that had a straight view of the stage, not a side on one. We'll got there and they closed that section but upgraded our tickets to seats where I could not kick my left knee out, and where I had to kink my neck to look at the stage. That was very disappointed and defeated why I picked the seats that I did."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Kim M",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T00:07:40.000Z",
          "Titre": "My experience using ticketmaster was…",
          "Contenu": "My experience using ticketmaster was fine. I sat I hold and then purchased my tickets through you, you sent me my tickets. The band was fantastic - 5 stars. Ticketmaster had nothing to do with that."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "LUCILLE WILSON",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T17:46:31.000Z",
          "Titre": "Ticket time issue",
          "Contenu": "I loved concert, but unfortunately we missed half of the VIP show as both our tickets showed it starting at 8:10 and concert at 8:15...didn't make sense to me..but it was my first time at that location..so I thought I'd show up a bit early to be sure. The VIP had started at 7 and we showed the volunteers the time on our tickets . They felt bad.  Outside of the error on that side..the bands were awesome."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "JASON WOODHEAD",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T03:52:07.000Z",
          "Titre": "Needed help to complete order"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "PAUL MCMAHON",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T16:26:25.000Z",
          "Titre": "scanning the parking pass at the garage…",
          "Contenu": "scanning the parking pass at the garage didn't work.  I still had to pay a convenience fee.  Also, i think the online-pre purchase was $5 more than if I paid in person"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "KRISTINE KRISTIANSEN",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T14:34:57.000Z",
          "Titre": "The seats at Massey Hall were terrible",
          "Contenu": "The seats at Massey Hall were terrible! The speaker almost covered the entire big screen behind the stage so we couldn’t watch the big screen at all. The artists and MCs were mostly standing on the left side of the stage so we couldn’t see them either. We finally moved to standing room only were we could see everything but we paid for seats, not standing room."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "ROBERT SIDDALL",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T00:36:29.000Z",
          "Titre": "Can't add tickets to Apple Wallet",
          "Contenu": "There is something about my TM account that does not give me the option of adding my tickets to my Apple Wallet. That is a real nuisance. Last year it was fine so I don't know what happened this year."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "CHANTAL GUNTER",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T14:33:36.000Z",
          "Titre": "Angry that we could not transfer but sell thru Ticketmaster  only",
          "Contenu": "It was not well communicated at any point from time of purchase that  a family member could not buy the tickets and transfer them to another family member. It was very stressful to think that they might not get in if I did not accompany them."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "ED BAXTER",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T16:45:00.000Z",
          "Titre": "Too much 'fluff' on the scenes",
          "Contenu": "Too much 'fluff' on the scenes, makes it difficult to navigate site quickly!! Get rid of unnecessary promos!"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Robert K",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T17:16:10.000Z",
          "Titre": "Option to add tickets to wallet was…",
          "Contenu": "Option to add tickets to wallet was just prior to event, could that be changed to earlier?"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "HAROLD PICKEN",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T23:57:02.000Z",
          "Titre": "Your service fees are ABSOLUTELY…",
          "Contenu": "Your service fees are ABSOLUTELY RIDICULOUS!! I make every effort not to use you."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "GENEVIÈVE LANDRY.",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T20:50:47.000Z",
          "Titre": "Ticket not in the application...",
          "Contenu": "I dont Know why but our ticket were nit in the application but in a email That was send back in Setember. This was uwfull for the entrance at the venue. Nearly misses the VIP portion."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "BRAD DUNN",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T18:38:20.000Z",
          "Titre": "Concert was good/TM is bad",
          "Contenu": "Concert was good. Dealing with tickmater and thier over pricing and fees always sucks. Haven't seen a reasonable ticket price in 10 years."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "R. WELLS",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T15:23:17.000Z",
          "Titre": "The service fee per ticket is…",
          "Contenu": "The service fee per ticket is outrageous. Why a service fee if the ticket is delivered electronically. One more way to gouge the consumer."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Amie from Canada",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T18:07:55.000Z",
          "Titre": "Ticket process was easy, but it should include gate #",
          "Contenu": "Ticket process was easy. However ticket did not include a gate # which made it hard to figure out which line up to join. And also after lining up for a good 10 min we were asked To move to other line up closer  to our section."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "J L",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T00:42:28.000Z",
          "Titre": "The Danforth Music Hall has a strange…",
          "Contenu": "The Danforth Music Hall has a strange policy of not allowing rucksacks into the venue irrespective of size, while allowing tote bags, even large ones into the hall. This is a very strange and irrational policy given that all bags are searched. No alternative is provided and the security were unhelpful, even belligerent. A significant number of patrons were forced to find alternative places to store their rucksacks (at stores and bars along the Danforth). Clannad were wonderful; It is unfortunate that this unreasonable policy impacted the enjoyment of so many patrons."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "HOLLY CHARLTON",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T23:30:38.000Z",
          "Titre": "Line to slow",
          "Contenu": "Line to slowThe concert itself was great when we finally got in. We lined up at 6:50 and didn’t even get in til after the concert had started which was very disappointing. We missed the first couple of songs. It was so slow going thru the line. Also having TV screens so we could see at the back would have been great"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Alex Delany",
          "Nb_Reviews": 4,
          "Date": "2023-10-14T01:16:00.000Z",
          "Titre": "Surge Pricing is absured",
          "Contenu": "Bought the tickets on release day. I was outraged to see a “surge pricing” affect the cost after I had selected my tickets and moved to check out. Easy to use. But disgusted but the abuse"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T15:56:47.000Z",
          "Titre": "Band wasn’t all there",
          "Contenu": "Band wasn’t all there. They’re losing their focus on what matters. Won’t pay to see them again but hope they get it together to change my mind"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "ELIZABETH CHANDLER",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T22:14:08.000Z",
          "Titre": "Skate Canada Tickets were mailed out way too late",
          "Contenu": "Tickets were mailed out way too late.  I only received them 2 days before I left for Vancouver for the event.  This caused a lot of stress.  Why did we even need paper Tickets?  Why weren't they emailed?  Felt like a step back in time."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "GERARD BALCAEN",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T02:40:19.000Z",
          "Titre": "The music was mixed too loud",
          "Contenu": "The music was mixed too loud. The vocals were buried by the music. That’s unfortunate."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "J. Wish",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T20:55:30.000Z",
          "Titre": "The beer and food was expensive",
          "Contenu": "The beer and food was expensive. The pretzels and spaetzle was not edible but Zwicks did give us a package of pretzels to compensate, which was good. The musical choices were great."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T16:43:38.000Z",
          "Titre": "I didn’t think it was fair that seats…",
          "Contenu": "I didn’t think it was fair that seats were added closer to the date of the concert. That wasn’t fair to people who thought they were sitting close to the stage but actually were not."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "SHERRIE RICHARD",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T16:29:11.000Z",
          "Titre": "It was different than I expected",
          "Contenu": "It was different than I expected . Where were the vampires!!!!I lot of clown work .. that was unexpected..The acts were fantastic"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "SA",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T21:46:50.000Z",
          "Titre": "Easy to use, tough to buy tickets",
          "Contenu": "After getting the ticket everything was smooth - but buying tickets was a mess with changing prices by the time you try to pay, as well as seat availability changing within 30 seconds or so!"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "SANFORD HERSH",
          "Nb_Reviews": 2,
          "Date": "2023-10-24T22:21:41.000Z",
          "Titre": "It almost worked well.",
          "Contenu": "Everything worked well except for two niggles. The informational links in your mail only worked on my cell phone and did not work on my PC. The other was that, on the PC, it sometimes thought I was bot."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jo",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T18:14:16.000Z",
          "Titre": "Screens and Snacks",
          "Contenu": "Having the large screens would have enhanced the experience. Good and drink prices at Rogers outrageous."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "BRAD SHIGETA",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T17:56:20.000Z",
          "Titre": "I bought two tickets",
          "Contenu": "I bought two tickets.  When downloading, only one ticket downloaded.  At the door of the venue, I had to find my tickets and find the second ticket for entry."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Anonymous Human Gamer",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T18:03:07.000Z",
          "Titre": "Unable to transfer parking pass",
          "Contenu": "I wasn't able to attend the game so I transferred the tickets to a friend. For some reason I was not allowed to transfer the parking pass I bought, not sure why?"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "C. McC",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T03:59:37.000Z",
          "Titre": "I dislike the fact we pay so much extra…",
          "Contenu": "I dislike the fact we pay so much extra for fees! I get nobody works for free, but with how many tickets you dole out for events, how about $2?? Why so much? 😑"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Nolan",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T00:43:11.000Z",
          "Titre": "Unable to add to apple wallet",
          "Contenu": "I would love to be able to add the ticket to my Apple wallet. But it would not let me after trying countless different methods"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Ty",
          "Nb_Reviews": 3,
          "Date": "2023-10-02T18:12:32.000Z",
          "Titre": "Pricing",
          "Contenu": "Price for tickets is far too expensive. It is completely ridiculous sand should never be that high."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "GREG BLAND",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T17:47:30.000Z",
          "Titre": "You guys need to have live agents to…",
          "Contenu": "You guys need to have live agents to talk to so disappointing you got rid of live humans to talk to about issues"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "MARY ELLEN MCNAUGHT",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:44:29.000Z",
          "Titre": "The show was wonderful and entering was…",
          "Contenu": "The show was wonderful and entering was very easy with the app. However, I had booked the wrong day by mistake and early efforts ( a day later)  to change the tickets were met with a big \"No\" or \"you could sell them online\"Being a senior, I did not feel equipped to handle that challenge"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "KAYLA",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T23:47:11.000Z",
          "Titre": "Smooth experience; and an efficiency tip.",
          "Contenu": "Everything was fairly smooth, making it an enjoyable and easy experience for us to see Doja Cat. I have some feedback regarding the diff ticket types/tiers: perhaps the door staff can point the patrons to locations they should be aware of based on their ticket type/tier. I.e., if the VIP ticket includes a merch package to be picked up at a certain desk, it would be great if the staff noticed this when scanning our tix and pointed out the desk or other line/location. Would be efficient and save time for patrons to navigate through the crowded entrances."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "ROMAN ZAKALUZNY",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T01:30:30.000Z",
          "Titre": "The purchase of seat tickets and…",
          "Contenu": "The purchase of seat tickets and parking was straightforward as well as the transfer process. The only problem was that the parking could not be transferred and alternative means were required to show proof that the parking was prepaid. This needs to be rectified to make the transfer process seamless."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "SUNITA SINGH",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:22:17.000Z",
          "Titre": "It was a great experience 😊I really…",
          "Contenu": "It was a great experience 😊I really enjoyed the show, amazing performances Thank you"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "JOANNE PENDRAK-FLESHER",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T03:16:36.000Z",
          "Titre": "Awesome Crystal performance!",
          "Contenu": "Crew and performers with the Crystal performance were amazing.  So much talent!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "P.",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T19:44:38.000Z",
          "Titre": "Good but some changes can be made",
          "Contenu": "Ice was smaller than previous years so centre ice seats felt as though you were sitting too far back for prime seats. There was not enough of Mickey,Minnie, etc compared to previous shows. The two show hosts could not keep the audiences attention. The second part of the show was the best and really got the children's attention and excitement up.As for the venue, it is really distasteful that there is an explicit adult event occurring in the same building as a children's event. The seats are super scrunched with no leg room for tall adults."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lesley",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T21:37:48.000Z",
          "Titre": "It was a cute",
          "Contenu": "It was a cute, light play. The actors were great and it was a wonderful afternoon with friends.  The theatre itself is beautiful and worth seeing anything in that venue. Not a bad seat in the entire space."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "NANCE",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T19:20:33.000Z",
          "Titre": "Memorable",
          "Contenu": "Our experience was memorable because the concert was really good AND we were chosen by a Scotia Bank arena ambassador to move from nose bleeds to a VIP seating area.    Thank Goodness because for $158 plus transportation to and from, we were 2nd row from the top of the arena with the last two seats in the row.  FOR $158 !!!!.  So concert good, better seats, good, $58 in processing fees - NOT GOOD"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "JOAN MOSHER",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T16:25:32.000Z",
          "Titre": "My phone wouldn’t connect to your wifi…",
          "Contenu": "My phone wouldn’t connect to your wifi but Meaghan was wonderful.  She walked us to the box office so our tickets could be printed.  It bugs the heck out of me that we can’t print tickets, or at least collect them at the box office, prior to the event.  Not everyone has a phone and it’s not fair to be forced, as I felt I was, to get one just so I could enter a venue."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "M D",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T00:48:05.000Z",
          "Titre": "The show itself was excellent getting…",
          "Contenu": "The show itself was excellent getting into the arena was terrible. Over an hour on line to get in the show had started before many people managed to get in. The line up extended to front street. Would avoid this venue on the future. Really inefficient entry process."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "JENNIFER KUYPERS",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T03:30:58.000Z",
          "Titre": "One minor issue!",
          "Contenu": "There was simply one issue that turned this from a 5 to a 4 star. With being unable to screen shot the QR code it virtually made it impossible to scan. Underground parking with no service means no data usage. So despite the fact that it had been opened minutes before getting to the parking gate it would not come up. Thankfully I had screenshots of everything verifying that I had paid for parking."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "TATIANA GINDEA",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T06:38:39.000Z",
          "Titre": "Good service except tickets sharing.",
          "Contenu": "All the service was good except the sharing of the tickets with friends. I was strongly advised by the companu to share tickets, but despre my multiple requests for code to allow sharing of tickets, it did not worked. The company did not recognized the codes it sent to me by phone, call ora email."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "BUBSY",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T07:33:14.000Z",
          "Titre": "Tickets were tricky to find",
          "Contenu": "Tickets were tricky to find. After locating them, transfer and download to wallet worked well. Performance was fantastic!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Babs A.",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T07:14:15.000Z",
          "Titre": "Chat help was great!",
          "Contenu": "Tickets were in the app.  I got a new phone and could not get them back in the wallet.  I used the chat function and although we could not get the tickets back in the wallet, I was able to get instructions on how to use the tickets in the app. Great service."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "DEREK MARTENS",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T04:53:33.000Z",
          "Titre": "Nice venue, bar closed too early",
          "Contenu": "Musicians were great. Nice intimate theatre space. Unfortunately the bar closed before the break between the opener and main act, which caught many attendees by surprise."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "M L LARAMEE",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T22:57:42.000Z",
          "Titre": "My grandson Isaac is in the green group…",
          "Contenu": "My grandson Isaac is in the green group and it was a thrillto see the first show.  It was entertaining and a great message at this time of year.  The singing is phenomenal and loved the interaction of all the cast.Bravo!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "DAVIS",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T18:58:43.000Z",
          "Titre": "Purchasing the tickets was very easy",
          "Contenu": "Purchasing the tickets was very easy, although the seating charts are a little small. Still, we got excellent seats. The venue doesn't have WiFi and I don't have data, so we had to pick up our tickets at Will Call. Again, a little inconvenient but not horrible. There was no indication of where the swag was being sold and we didn't find it until the end when they didn't have the sizes we needed and that was very disappointing. I would say Ticketmaster did a great job but Core Entertainment let us down a bit.Also, the parking was horrid and the staff at the exit to the hall gave us very vague directions on how to get to it that weren't right. Again, not a Ticketmaster issue but Core Entertainment failed."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Robert Bouchard",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T23:49:12.000Z",
          "Titre": "Boney M was awesome",
          "Contenu": "Boney M was awesome. Opening act was not to our liking. They were definitely talented musicians but the songs were not what I would go to the concert to hear if they were the only attraction."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "MICHAEL ATLAS",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T17:33:12.000Z",
          "Titre": "Robert Klein is extremely talented but I don't like his politics",
          "Contenu": "Robert Klein is extremely talented and funny.However, my experience was marred by having to listed to his left-wing/Democratic political views. Highly inappropriate. He should not be dumping on Donald Trump during these terrible times for our people.. Israel has had no better friend in the White House. He should keep his political views to himself and stick to songs and jokes."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "MARIE-DOMINIQUE BÉDARD",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T00:42:49.000Z",
          "Titre": "Excellent spectacle, mais le son trop fort.",
          "Contenu": "Excellent spectacle, par contre, le son était beaucoup trop fort et l’effet de distortion était désagréable. Les sièges sont très tassés au Capitole…"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "CHRISTINE HOMONKO",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T02:07:43.000Z",
          "Titre": "It was very easy to purchase the…",
          "Contenu": "It was very easy to purchase the tickets and even easier to access them once we were at the arena."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "DON GERBRANDT",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T23:27:52.000Z",
          "Titre": "This was my 1st time using Ticketmaster…",
          "Contenu": "This was my 1st time using Ticketmaster so it took a bit of navigating to fiqure it all out but once that was done it turned out to be a great experience. More then likely the younger generation would have fiqured it all out in no time. Would use them again.One thing, it would have been nice to have the seat numbers at time of ordering so we knew a little better where our seats were."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jayeson Shaffer",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T23:05:11.000Z",
          "Titre": "Anthony was great",
          "Contenu": "Anthony was great! Wonderful performer. The opening act was for me poor, a grade F. Her squeaky voice was irritating; I could not relate to her. Vancouver has its own great comedians I’d rather have seen as an opening act. The 3rd floor bar was closed and that meant 2nd floor bar was more crowded. Oh well. Seats, site lines & acoustics are all great. All in all, a very worthwhile event once again at QE Theatre. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Melanie Thomas",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T00:08:15.000Z",
          "Titre": "Tool made the experience great",
          "Contenu": "Tool made the experience great, not Ticketmaster. The cost of tickets were outrageous. I paid $1300+ for non VIP seats, when some VIP packages were cheaper. The only thing that made my purchase worthy through Ticketmaster was the payment plan option."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Erik",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T05:13:26.000Z",
          "Titre": "I was able to get up front and close…",
          "Contenu": "I was able to get up front and close with the concert which is almost impossible to do without paying a ton of money for it. The auditorium the concert was at could've been bigger. The price was reasonable and the staff were very professional."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "SM",
          "Nb_Reviews": 4,
          "Date": "2023-11-25T18:51:22.000Z",
          "Titre": "The best thing for me was that I could…",
          "Contenu": "The best thing for me was that I could not use the virtual ticket because I do not have a smart phone, but we were given printed tickets at the box office.Could you please go back to the option of printing a ticket at home?"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jane",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T02:56:29.000Z",
          "Titre": "If you need to change your tickets I don't think there should be fees attached.",
          "Contenu": "Very happy with the Ticketmaster app for this year's Royal Winter Fair Horseshow.  One less thing to carry. Theatre tickets another matter, when trying to exchange them more fees apply and given the amount already taken in service charges, that's just not right."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "LAUREN",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T21:41:45.000Z",
          "Titre": "User friendly",
          "Contenu": "It was very easy to navigate the site with straightforward instructions provided.  Updates  via email were sent as the date approached.  As someone not used to using digital tickets I was a bit apprehensive not having a hard copy of my tickets but I was pleasantly surprised how easy it was to just scan my phone."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "KATELYN RIDING",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T17:48:13.000Z",
          "Titre": "The show was just what I thought it…",
          "Contenu": "The show was just what I thought it would be. Super engaging and interactive with the crowd"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Alan",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T20:19:03.000Z",
          "Titre": "Only 1 annoying ongoing complaint",
          "Contenu": "My ONLY complaint is that when I try to buy 2 tickets and 3 seats are left together, it prevents me from doing so as you cannot leave one seat.  Yet when I look around the stadium in various sections, single seats are plentiful so i don’t understand how that occurred if I cannot purchase seats leaving a single seat.Everything else is very easy to use on the Ticketmaster site."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "NOOSHIN DAHYA",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:53:33.000Z",
          "Titre": "Really enjoyed it",
          "Contenu": "Really enjoyed it. Thankyou.,"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Anonymus",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:22:04.000Z",
          "Titre": "Please fix the ticket scalping & give…",
          "Contenu": "Please fix the ticket scalping & give the artist more money."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Susan Kiely",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T23:38:48.000Z",
          "Titre": "He was hilarious but the opening…",
          "Contenu": "He was hilarious but the opening comedian Blair Socci wasn’t my cup of tea. Lots of noises and really didn’t get her style of comedy"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "RICHARD HURLEY",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T17:53:55.000Z",
          "Titre": "TesseracT Amazing. Sound Mixing Not So Much",
          "Contenu": "Band was 10/10 amazing and zero complaints. Venue organization and management was solid 9/10. Sound mixing was not good. 6/10 at best.Set list, to the best of my recollection:1. Natural Disaster2. Echoes3. Luminary4. King5. Of Mind - Nocturne6. Smile7. The Arrow8. Legion9. War of Being10. The Grey11. Juno12a. Acceptance - Concealing Fate Pt. 112b. Deception - Concealing Fate Pt. 212c. The Impossible - Concealing Fate Pt. 3"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Craig Richard meyers",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T03:12:55.000Z",
          "Titre": "the production of the show was top…",
          "Contenu": "the production of the show was top shelf. The supporting band was compiled of great musicians, the drummer was exceptional and was key in keeping the whole production tight and intact. The priniclple is a consumate professional interacting with the crowd between songs to keep them interested. The only unfortunate thing for me was that she has a limited register in her voice now and she is protecting it which affects her ability to deliver a top notch version of her many hits."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jackie",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T20:58:13.000Z",
          "Titre": "Easy to use system",
          "Contenu": "We purchased tickets with ease, had no problem adding them to our app for easy entry and no troubles displaying them for our entire group from one device. Access was a little confusing, with little direction, but once at the gate it was quick and easy to get thru and to our seats. Only thing to be aware of, is you have to go through a transfer process if you require others to carry their own tickets, paper and screenshots are not accepted."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "M.B",
          "Nb_Reviews": 3,
          "Date": "2023-11-14T19:52:41.000Z",
          "Titre": "Ticket Will Call",
          "Contenu": "I decided to pick my tickets up at will call. Which was done after that day I purchase this, and unfortunately the guy had to re-print them as he cannot find them. Not very organized. Linda Evangelista event was amazing, very open and honest and down to earth.Lots of stories about her day as a model, & present days"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "PATRICIA GOLAR",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T19:05:03.000Z",
          "Titre": "the venue and concert were fabulous, parking not so",
          "Contenu": "the venue and concert were fabulous. the parking scenario not so much. There were only 2 parking attendants at the entry to the venue. There were NO handicapped parking stalls (they were taken up by the trucks for gear for the band). So, we ended up parking at the neighbouring university parking lot. In fact, we were walking behind a woman with a walker, not okay for people with mobility issues."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "KD",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T23:21:53.000Z",
          "Titre": "- Excellent Concert",
          "Contenu": "- Easy purchase, great as someone put them back up for resale.- AMAZING Concert 💕 up there as one of my favourites!- Entrance to get into venue was BRUTAL (approximately 40 minutes), but at least our seats were close to gate we entered at.  Majority of people complaining worst they’ve ever experienced!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "LINDA M",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T23:17:04.000Z",
          "Titre": "Adam Sandler very talented…",
          "Contenu": "Adam Sandler very talented especially on his guitar and singing.   Wished he brought his movie regulars as his entourage but great seeing the other acts especially Kevin James.  Loved the tribute to Chris McFarley.  Touching"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "DEB MAY",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T17:55:50.000Z",
          "Titre": "When purchasing tickets it should be…",
          "Contenu": "When purchasing tickets it should be explained what is being included in the VIP package. We received a gift but arrived early and had to stand around waiting to get into the Theatre. We would have come later if we had known we had to stand around doing nothing."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "MIKE from Chelsea",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T20:51:40.000Z",
          "Titre": "The show was excellent",
          "Contenu": "The show was excellent. Very well organized and presentation. Sound quality was really good. As a suggestion it would good if there could be a message to other concert goers that holding bright phones up to take videos (which are otherwise on YouTube) is very annoying and distracting. It’s a bright light and blocks the view. Much appreciate the opportunity to provide feedback."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "JIN ZHENG",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T17:48:08.000Z",
          "Titre": "Good but too many scalpers",
          "Contenu": "Entire purchasing process is smooth. I like the transparency of having fees included in the ticket prices when we view them. My only issue is with ticket scalping and resellers. I think fans would appreciate being able to buy tickets at cost."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "JANIS TOMKINSON",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T13:49:03.000Z",
          "Titre": "Ticketmaster was easy to use",
          "Contenu": "Ticketmaster was easy to use.  I don't have a problem with e-tickets, however two of the people I attended with do not have a smartphone.  Therefore, if they wanted to go to a concert/event that I wasn't interested in, they're out of luck!  That's unfortunate. There are still people out there who work with paper.  I know this is also the Canadian Tire Centre's process/regulation of being paperless."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "TIFFANY PIERRE DE ANGELIS",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T18:12:01.000Z",
          "Titre": "Canadian NBA game",
          "Contenu": "As a basketball fan who’s been to multiple games including all the ones hosted in Montreal. The ticket price jump this year was uncalled for specially for pre-season. Other than that great experience and atmosphere. Would be nice if some people weren’t seating in others seats .. but love the energy and moment."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "PAUL WEST",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T00:42:56.000Z",
          "Titre": "We had a great time at the concert",
          "Contenu": "We had a great time at the concert, only problem everyone had was the start time. Ticket said 6 pm so everyone arrived early only to have to stand out in the cold"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "KJ",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T02:57:51.000Z",
          "Titre": "Shania was amazing",
          "Contenu": "Shania was amazing!  Lines to enter the venue and scan tickets were very slow.  Bathrooms were mot cleaned or maintained throughout the evening and were disgusting by midway through the night."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Christine Mach",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T21:47:38.000Z",
          "Titre": "Great Experience",
          "Contenu": "The show itself was excellent. What we found lacking was instructions on where to go and how to use our valet express entry. It was our first time at the Windsor Coliseum and we had no idea what to do. There ended up being a few steps we had to do to validate ticket etc. Maybe instructions on the ticket itself might be a good idea."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "KATHERINE CRAIG",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T17:31:09.000Z",
          "Titre": "The show was amazing",
          "Contenu": "The show was amazing! Can’t say anything but positive praise for the show. Great talent and was very entertaining. This was my first time at the Casino Rama venue and I didn’t find the seating to be comfortable and exiting the parking lot after the show took an extremely long time, nearly 30 mins."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "SUSAN GOETT",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T18:39:26.000Z",
          "Titre": "Once I could access ticket there were…",
          "Contenu": "Once I could access ticket there were no problems. Bit of delay being able to put tickets in my wallet but once I could very easy to enter venue. I like that system for all the tickets I purchase."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "JANICE WYCHERLEY",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T06:25:46.000Z",
          "Titre": "It was great and I had bought tickets…",
          "Contenu": "It was great and I had bought tickets several months ahead. I thought you could have released the final tickets more than a week or so before the concert, as I am used to handling physical tickets, I was getting a little concerned about that. Otherwise….all worked out!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "AA",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T06:07:49.000Z",
          "Titre": "It was wonderful!",
          "Contenu": "It was wonderful!Only downside is that nowhere on the ticket did it say anything about opening performers who took up 2 hours of the entire show. The show itself didn’t start until 9pm even though it was advertised to start at 7:30pm"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "EDUARDO ESPINOZA",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T19:51:34.000Z",
          "Titre": "Went to see Marco Antonio Solis at the…",
          "Contenu": "Went to see Marco Antonio Solis at the Coca Cola Coliseum in Toronto. Great production, nice stage and screens were perfect for enhancing a song and seeing the artists close up. Fantastic sound, and Marco Antonio Solis delivered all of his hits. The Coliseum however needs way more bathrooms, and entrances to get inside. It’s a tight squeeze to get into the main entrance with only a few doors. They should it up with more entrances to let the people in more smoothly."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "M Clarke",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T22:00:21.000Z",
          "Titre": "Cost of tickets is ridiculous",
          "Contenu": "Cost of tickets is ridiculous. Ticketmaster being a third party scalping site is obscene. You should be embarrassed"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "LISA WARE",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T14:28:56.000Z",
          "Titre": "Well I paid  over 1000 dollars for 3…",
          "Contenu": "Well I paid  over 1000 dollars for 3 tickets in august … it was half that in October.. I realize you have to sell the seats but I should’ve been given the option for better seats as the person beside me oaid half of what I did"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "MEGAN",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T02:13:17.000Z",
          "Titre": "it was a good experience",
          "Contenu": "it was a good experience, the website was legit and didn’t make it seem like i was getting scammed. buying the tickets, i wish that there wasn’t a timer to buy the tickets."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "HR",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T17:28:47.000Z",
          "Titre": "My tickets didn’t work on the app",
          "Contenu": "My tickets didn’t work on the app, also, it wouldn’t let me add my tickets to my Apple Wallet because I’m not in the cloud - that’s more secure than airplane tickets!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "KATHRYN CLOUGH",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T23:22:17.000Z",
          "Titre": "Talented performers with a sense of…",
          "Contenu": "Talented performers with a sense of humor.  However, the volume was a bit too loud.  Hard to hear the voices sometimes."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "JEFF WARD",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T02:37:54.000Z",
          "Titre": "Paul brant and Terri Clark",
          "Contenu": "The concert itself was great The venue was a smaller so there were no bad seats, the staff were more than accommodating"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Susan",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T13:18:31.000Z",
          "Titre": "Dancing in the Aisles!",
          "Contenu": "Andre Rieu was fabulous as usual except I found the concert over too quickly.  Probably because I didn’t want it to end.  We found the guest Gospel Choir went on too long…1-2 songs fine but we came to see and hear Andre, not them :/ The Rogers Centre was a better venue for him though…I saw him there last time and it was so much better than floor seats at scotiabank.  I wouldn’t buy them again.  If he plays a different venue next time I’ll go."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "PETE S.",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T23:48:19.000Z",
          "Titre": "E-tickets quick and efficient!",
          "Contenu": "This was my time using the ticket master app to download the 4 concert tickets to my iPhone wallet. Was a bit sceptical since the tickets are only available to download a week before the concert. Scanning all 4 tickets from my iPhone wallet at venue entrance was quick and efficient! The only downside is that there is no paper ticket as a keepsake."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "AMBER DODD",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T00:49:22.000Z",
          "Titre": "More ushers and signage on floor needed",
          "Contenu": "Well there was a lot of confusion on the floor with too few ushers- many times we were interrupted in our seats by people saying we were in their seats .   In fact, these people were not ushered in nor was the signage big enough for people to see their proper section on the floor.  But the lights and the sound were great!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "JOHN WHEELER",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T13:18:48.000Z",
          "Titre": "Loud concert!",
          "Contenu": "I grew up with these bands but haven't played their music in quite a while......until I saw the concerts.Helix did okay but Quiet Riot and Warrant, they were absolutely amazing!!  Apart from Quiet Riot having issues with the mic, it was a loud concert that shook the grandstand and had my ears ringing all night."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "DON COOK",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T16:16:14.000Z",
          "Titre": "Purchase ticket at regular price",
          "Contenu": "Purchase ticket at regular price. Will never use reseller. Need to eliminate resellers and higher prices."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Paula",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T18:57:18.000Z",
          "Titre": "Michelle was unreal/ ticket master needs to step up tho",
          "Contenu": "Michelle was unreal. She put on such a good show. Quality JFL comedian.I’m annoyed at the ticket master app and when going there was a woman with low/ no vision who the ticket checker could not assist. Watching this felt ignorant on ticket master’s part to properly train employees to help people with their app and not feel stress holding the line. It was hard enough for me to obtain my tickets last min through the app. I think this puts a damper on a light night."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Dm",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T17:12:26.000Z",
          "Titre": "Nice and easy process to get my tickets…",
          "Contenu": "Nice and easy process to get my tickets online."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "GUNTHER BACHMANN",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T06:38:36.000Z",
          "Titre": "2023 Heritage Classic in Edmonton",
          "Contenu": "My tickets were there for me, printed and ready to be scanned as we entered the stadium. The day was a bit cool so it took a couple of attempts to have them scanned. Eventually they had to type in the numbers under the bar code to get us through the turnstiles."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "RICHARD SADOWSKI",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T23:08:37.000Z",
          "Titre": "Great show and the seat location was…",
          "Contenu": "Great show and the seat location was magnificent. Just very slow getting out, as usual."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "ELAINE",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T18:10:25.000Z",
          "Titre": "ROCK ON",
          "Contenu": "Easy to use the chat with someone,  however I wish we could have printed tickets on paper because I was having a problem with my ticket master app and my tickets weren't showing. I ended up going back to my email and added to goggle wallet."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "ALVARO ENRIQUEZ",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T19:07:20.000Z",
          "Titre": "The band makes the magic happen",
          "Contenu": "The band makes the magic happen. But logistically everything was set perfect. Transportation was on point. I located my seats easily, there was food at the location. I would recommend to include more canned alcoholic beverages like apple cider."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "DEREK BUBNICK",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T01:45:47.000Z",
          "Titre": "Shania twain",
          "Contenu": "Shania twain putting on a good show. Seating for floor needs to be revamped somehow. Having to get in and out of aisle a 1000 times for drunk people is annoying as can be and takes away from the show.  God forbid you sit on the end of an aisle."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "TonyM",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T16:34:51.000Z",
          "Titre": "The good, bad and ugly.",
          "Contenu": "It's good that we have a place to go to buy tickets however I don't like service charges and hate when people buy all the tickets and then post them to resell at 3 times the price.  They have no intention of going but just make money.  There should be other companies to offer competition."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "CATHERINE DUFOUR RANNOU",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T02:38:06.000Z",
          "Titre": "I've been stopped at the entrance…",
          "Contenu": "I've been stopped at the entrance because I had a metallic water bottle. I understand that it could be dangerous in rock show, but it was a kid show... Also, 18$ for a popcorn it's exaggerated! Finally, it was very long to go out of the parking (30 minutes)."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Clinton Brisbois",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T16:15:57.000Z",
          "Titre": "Shania Twain/Canada Life Centre",
          "Contenu": "It was decent show, Canada Life Centre the main common area needs so better venting in that place, with all those little food stands in there it awful"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "JUSTIN KESSEL",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T18:25:39.000Z",
          "Titre": "Floor seats great",
          "Contenu": "Floor seats great, other then guest with out floor tickets standing in front of us the whole time until security kicked them out. But need better control of the floor"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "LARA FRENCH",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T17:16:53.000Z",
          "Titre": "Everything was straight forward very…",
          "Contenu": "Everything was straight forward very happy with your service.  I do have one comment though.  I had purchased these tickets for my parents who are in their 80's and are not great with cell phones.  I had tried to print off paper tickets, however I was told this concert was not eligible for that option.  This was a pain, not everyone is tech savy and I had to go with them to the door and had to write sticky notes for them to keep in their pockets with the details of their seats, so if they went to the bathroom they wouldn't forget.  Paper tickets should be available, especially for a concert like Andre Rieu that is an older demographic."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Phoebe",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T22:46:57.000Z",
          "Titre": "It was great seeing tv girl just some…",
          "Contenu": "It was great seeing tv girl just some of the people in the audience were ruthless trying to cut infront of people to get ahead and smoking in the crowd"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "KWAG",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T00:28:27.000Z",
          "Titre": "Beautifully choreographed",
          "Contenu": "Beautifully choreographed. However, only 3/4 of ice rink was visible to us."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "DOUG LARGE",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T22:42:35.000Z",
          "Titre": "The purchase was easy",
          "Contenu": "The purchase was easy, I really appreciated all the reminders. I missed out on some of the VIP experience when one of the ushers directed us in the wrong door. Argh."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "ALAIN LECLERC",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T20:56:52.000Z",
          "Titre": "Shouldnt have to download app",
          "Contenu": "Tool show was best show I've seen in a long time. Ticketmaster fees are ridiculous. Having to download the ticketmaster app to access tickets was annoying."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Kate Tomaszewski",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T05:35:05.000Z",
          "Titre": "In ‘n’ out out",
          "Contenu": "Small venue easy to access and exit love the fact everything is on line no hard copy papers to carry around"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "SHEILA SCHARMANN",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T16:31:11.000Z",
          "Titre": "Easy to use",
          "Contenu": "Ease of buying and accessing our tickets makes this site very good. Sometimes it’s hard to see exactly which seats you’re getting."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Doris, Winnipeg, MB",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T19:07:43.000Z",
          "Titre": "Easy to purchase tickets",
          "Contenu": "Easy to purchase tickets.  Ticketmaster sent emails reminding us of our event coming up."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "MH",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T13:30:09.000Z",
          "Titre": "The TicketMaster Experience",
          "Contenu": "The actual experience was fine and went off without a hitch. Still not crazy about ticket prices in general and especially your fees, as well as the availability of the better seats."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "One",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T17:25:17.000Z",
          "Titre": "Pussy Riot.                                                         Learned a lot about Russia which I…",
          "Contenu": "Learned a lot about Russia which I didn’t know and their performance was excellent. Another great evening out"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Fun Mom",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T23:01:56.000Z",
          "Titre": "The Wiggles are Here!!!",
          "Contenu": "The hardest part for me was purchasing the tickets.  I'm not tech savvy so I got booted out the first time because I didn't finish the transaction in the allotted time frame, but was successful on the second attempt because by then I knew what was needed in the way of credit cards, texting codes, etc.  I was afraid my receipt wouldn't print with my limited skills and was grateful to have Will Call (that's for us folks who don't have a smartphone) even though there was a fee for the service.  With all that said, we thoroughly enjoyed the Wiggles \"Ready, Steady, Wiggle\" tour performance in Hamilton.  These folks were awesome, and I was never so excited to sing \"Fruit Salad\" or \"Baby Shark\".   My kids, who are adults, loved seeing the live performance and enjoyed every minute of it singing along and doing the choreography.  It's way different being there than watching it online,  but now we have our very own experience to remember.   So much audience participation and interaction and the age of the audience was very mixed:  from young kids to grandparents."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "J Kealley",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T17:07:06.000Z",
          "Titre": "7 pm doors open or start time?",
          "Contenu": "7 PM was the doors open time and not the start time of the event this should be more clearly indicated on the tickets. Customer experience would have been better."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "JENNIFER HIRSCHE",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T18:50:03.000Z",
          "Titre": "The staff was very helpful and…",
          "Contenu": "The staff was very helpful and friendly. I was very disappointed and I know many people around me where upset to just watch it in the big screen. I honestly could of stayed home and watched it in my tv and not spend 150.00.  The band was very good. But defiantly upset I was expecting a live theatre."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Phatt Tony",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T01:47:47.000Z",
          "Titre": "First time user",
          "Contenu": "Buying, downloading, and scanning my tickets was super easy. App works great."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "GARY HORGA",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T03:49:41.000Z",
          "Titre": "Purchasing is easy",
          "Contenu": "Purchasing is easy. I still like a printed ticket but ticket on my phone from the app good too. Charlotte was great!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "LISE BUTLER",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T23:00:49.000Z",
          "Titre": "Everything was good but concessions…",
          "Contenu": "Everything was good but concessions were very expensive."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "MARC PATRY",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T23:56:53.000Z",
          "Titre": "Ticketmaster and Paking",
          "Contenu": "The show was great and it was easy to access the tickets to scan. The only downfall was their was no barcode for the parking and had to deal with the situation going in and leaving. Otherwise, had a really good time."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "ALISON",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T22:29:49.000Z",
          "Titre": "Getting into the venue was a mess",
          "Contenu": "Getting into the venue was a mess. Doors didn’t open until 7, ok I get that but the organization of where to stand and how things were going to go was not good."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "WALTER VAN DRIMMELEN",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T05:49:02.000Z",
          "Titre": "The tickets were great and the show was…",
          "Contenu": "The tickets were great and the show was even better. Ticketmaster was very good in their communications regarding the event."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "NANCY KRONOWETTER",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T18:15:22.000Z",
          "Titre": "Great seats",
          "Contenu": "Great seats, easy to find, mobile app was easier than I thought, however, still like the printed tickets for a keep sake"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "JOAN GRYKULIAK",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T22:11:17.000Z",
          "Titre": "Great experience didn’t realize they…",
          "Contenu": "Great experience didn’t realize they would actually play the movie and add a band in front of the screen."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "OLIVER THOMPSON",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T09:06:47.000Z",
          "Titre": "Great show",
          "Contenu": "Great show. Good experience, would like to have personalized email day of or day before when show starts"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "KEITH MARTIN TROLLAND",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T17:08:15.000Z",
          "Titre": "You're doing well",
          "Contenu": "You're doing well. The process is a fluid affair. Thank you for asking.    Mr. K.M. Trolland"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "MARK SOBIESKI",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T18:07:16.000Z",
          "Titre": "Tickets",
          "Contenu": "Easy to get to tickets on my phone and join with Canucks app.easy to resell or transfer tickets.  Prices are crazy."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "ANNE JORDAN",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T02:23:21.000Z",
          "Titre": "Staff doing security were thorough and…",
          "Contenu": "Staff doing security were thorough and very reasonable. I appreciated the level of security provided as well as the police presence."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "MICHAEL WALLER",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:53:39.000Z",
          "Titre": "Cirque du Soleil -Crystal",
          "Contenu": "This was our 3rd Cirque du Soleil show we’ve scene. The other 2 were in Las Vegas. Like all their shows they keep you on the edge on your seat. Very entertaining at a reasonable price. We will definitely continue to attend further shows in the future. Entertainment for all ages."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "JUDY MEADAHL",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:06:40.000Z",
          "Titre": "The dancers were superb",
          "Contenu": "The dancers were superb, the scenery and costumes spectacular.  The show had 100% of my attention throughout the show. I had seen the Nutcracker many years ago,but do not remember it as being as eventful as this production.  Will definitely attend it again at the first opportunity ."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Elle Vee",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T04:51:31.000Z",
          "Titre": "The line was massive as it was a sold…",
          "Contenu": "The line was massive as it was a sold out show but it moved very quick! Ticketmaster was so easy to use. From finding seats, to paying, to the reminders before the show, to scanning in at the entrance… it was all a breeze!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Douglas",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T05:46:29.000Z",
          "Titre": "The ticket purchasing process was very easy",
          "Contenu": "The ticket purchasing process was very easy and the follow-up reminders to the last day including the ticket attached. Also, it was nice to receive the heads-up, notifying us that traffic will be heavy due to Halifax city construction and road detours; all this wasw great service. The show was also amazing; Liz Mitchell and team did an amazing performance."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "CHARLOTTE",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T00:38:27.000Z",
          "Titre": "Shumka nutcracker",
          "Contenu": "After the initial ticket buying try which timed out, it all went well, including using the app at the event."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Alice",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T23:56:25.000Z",
          "Titre": "The app worked well",
          "Contenu": "The app was easy to navigate and worked quickly and easily. I liked the email a few days before the event with reminders and instructions."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "JIM JOHNSON",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:59:16.000Z",
          "Titre": "From placing order",
          "Contenu": "From placing order, to having tickets scanned at stadium, real easy, smooth."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "VICTOR CANJAR",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:25:23.000Z",
          "Titre": "Event reminder sent",
          "Contenu": "Event reminder sent, easy access to ticket if you have  phone."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Glenda",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T17:47:23.000Z",
          "Titre": "Great Christmas Show with Serena!",
          "Contenu": "Serena Ryder’s concert was fantastic. She has a wonderful voice and is a great and very engaging entertainer. It was the perfect Christmas experience because it seemed such a fresh way to sing all the old classics. Wonderful and I would go again next year!The Hailey’s were not my cup of tea and I didn’t enjoy them at all. They did their own songs for the most part and they all sounded the same and had the same theme. The two singers had good voices though."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Bell",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T00:34:37.000Z",
          "Titre": "I attended the concert recently",
          "Contenu": "I attended the concert recently, and it was hands down the best I've ever been to. Doja showcased incredible talent, keeping the audience entertained throughout with beautiful singing. Her outfit in Toronto was a personal favourite, adding a special touch to an already amazing experience."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "DAVID SHARP",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T16:45:07.000Z",
          "Titre": "The Legend was amazing!",
          "Contenu": "To see a true rock legend speak about his best selling book and give first hand accounts of his life on the road and during the origins of Rush was truly a once in a lifetime opportunity. Definitely a 5 star experience. Loved it!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Darren Watts",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T01:49:17.000Z",
          "Titre": "The app was very easy and convenient to…",
          "Contenu": "The app was very easy and convenient to use.Regular update emails arrived."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "AL GILSON",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T19:16:33.000Z",
          "Titre": "Adding tickets to my iPhone Apple…",
          "Contenu": "Adding tickets to my iPhone Apple Wallet was intuitive, easy and worked quick at the gate."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "ROBERT PAUL OUIMET",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T06:18:45.000Z",
          "Titre": "Having the mobile ticket on my phone…",
          "Contenu": "Having the mobile ticket on my phone was great and made entering the arena so much easier and faster than having paper tickets. Jeff Dunham was awesome and very funny.  Would definitely go again if he ever comes back to Calgary."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Straddler",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T21:50:09.000Z",
          "Titre": "Smooth Transaction",
          "Contenu": "I was able to see exactly where the available seats were, with the prices clearly indicated. I was able to pay online for the ticket I wanted, and it could be accessed electronically on my mobile phone for smooth entry into the venue."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "cjcanning",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T04:04:38.000Z",
          "Titre": "Little  to do with Ticket Master",
          "Contenu": "Little  to do with Ticket Master, but everything to do with the performers.  Fantastique!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "TOM ONEILL",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T17:18:01.000Z",
          "Titre": "The entire process was simple and easy",
          "Contenu": "The entire process was simple and easy. I also appreciated the reminders and tips to make it easy"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jen Rightmeyer",
          "Nb_Reviews": 3,
          "Date": "2023-11-28T04:58:57.000Z",
          "Titre": "Mariana's trench concert casino rama",
          "Contenu": "Concert was great. Lots of staff working and kept things organized and helpful with helping people find their seats. Staff were wiping floors up constantly/efficiently as some people dont know how to walk with alcohol without spilling it LOL will attend something else again next year!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "LH",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T04:46:16.000Z",
          "Titre": "It was easy to obtain tickets in this…",
          "Contenu": "It was easy to obtain tickets in this venue. No obstacles at show time."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "..",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:51:13.000Z",
          "Titre": "Best show the family & I have seen in…",
          "Contenu": "Best show the family & I have seen in years.Hopefully the revisit next year :)"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "ALDEN JACOBSON",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T21:07:07.000Z",
          "Titre": "Miracle Tour",
          "Contenu": "Amazing unplugged feel with excellent vocals, covering a wide range of classics.  Loved the stories.  It's great to see how well Terri and Paul worked together.  This is a good tour for Terri, who's had relationship problems, to be teamed up with a happily married Paul, who is also a Christian believer.  Call it a miracle tour."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "DIANE FILLINGER",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T00:17:23.000Z",
          "Titre": "The sets were absolutely remarkable",
          "Contenu": "The sets were absolutely remarkable. Loved the dancing, music, costumes and lighting! What a lovely Christmas kick off!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "SUSAN STILES",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T02:05:08.000Z",
          "Titre": "Shoe Review",
          "Contenu": "Purchasing tickets on line was easy and efficient, great venue, easy to get to and the light show was amazing. Seats are tight for people with long legs. Enjoyed the show and would recommend it for people who like rock music"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Michael Palermo",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T18:43:50.000Z",
          "Titre": "Great Show!",
          "Contenu": "Great venue, great bands, great staff – a pleasure as always!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "BC",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T16:41:37.000Z",
          "Titre": "Outstanding show -great performers",
          "Contenu": "Outstanding show -great performers, fabulous music and amazing dancing/choreography-  a must see - will go to see again this year and take friends"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Christian",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T00:58:14.000Z",
          "Titre": "The Perfect Holiday Show",
          "Contenu": "From start to finish this was the best time I've had at the theatre in years. I will absolutely be going back. Congrats to everyone who made this possible!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Steve W. Boily",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T01:36:31.000Z",
          "Titre": "Everything went well from checking to…",
          "Contenu": "Everything went well from checking to putvhaasing to attending the events using the ticketmaster app. Also liked th efact that Ticketmaster sent out the tixs via text on my phone."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Stephanie from Canada 🇨🇦",
          "Nb_Reviews": 4,
          "Date": "2023-12-15T19:26:39.000Z",
          "Titre": "Tickets were easy to access on the app…",
          "Contenu": "Tickets were easy to access on the app then went straight into my Apple wallet"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Gordon",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T23:43:56.000Z",
          "Titre": "Its was an unreal show",
          "Contenu": "Its was an unreal show.  Ticketmaster was uber greedy with their fees but everyone gets it....corporate greed is fairly common."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "KC",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T23:24:02.000Z",
          "Titre": "It was a great experience",
          "Contenu": "It was a great experience. Skyfall is my top “James Bond” film from the Daniel Craig era.  The orchestra did not disappoint with the soundtrack.   I would recommend the experience for other movies that have a memorable soundtrack."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "GARY CUREATZ",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T05:49:23.000Z",
          "Titre": "Best concerts ever.",
          "Contenu": "I have seen the T.S.O. every year since the started toperform at the Massey Hall since 1999.Very professional with their performances..The best concerts that I have ever seen in my lifeat 71 years of age. I have seen them also in Buffaloand Tampa. Great performance as always."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jacquelyn House",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T04:29:40.000Z",
          "Titre": "Everything",
          "Contenu": "Meeting Katie, Johnny Reid story telling, the high energy music, interaction, all of it"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Rob",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T04:23:50.000Z",
          "Titre": "The event was superb",
          "Contenu": "The event was superb. I loved the blend of music and performing acrobatics. Was good for all ages!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "RHONDA BERG",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T23:20:14.000Z",
          "Titre": "So easy to book tickets",
          "Contenu": "So easy to book tickets  love the reminders on event days"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Barbara S. Reynolds",
          "Nb_Reviews": 7,
          "Date": "2023-11-30T09:16:11.000Z",
          "Titre": "A magical night!…",
          "Contenu": "We had excellent tickets in the third row and were practically part of their family.  We really had a great view of the whole concert and enjoyed everything they performed. It was a tremendous show!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Lora",
          "Nb_Reviews": 3,
          "Date": "2023-12-04T23:20:54.000Z",
          "Titre": "I love their holiday shows and this one…",
          "Contenu": "I love their holiday shows and this one was fabulous!  A nice mix of their Christmas songs and their hits and even new songs from the new album! They sing to the crowd and have so much fun including everyone in. Highly recommend their concerts!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "K MCKENZIE",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T07:04:37.000Z",
          "Titre": "Liked the app",
          "Contenu": "This was my first time using the Ticketmaster app and phone to enter the event with no printed tickets and everything ran smoothly!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "VALERIE KOSMAN",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T22:07:37.000Z",
          "Titre": "It was easy to navigate the site and…",
          "Contenu": "It was easy to navigate the site and pick tickets.  Process to access tickets and get on wallet was easy and worked well."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Angela",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:27:44.000Z",
          "Titre": "Great experience",
          "Contenu": "We had a lot of fun. Great experience."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "SYLVIE MONFETTE",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T23:50:05.000Z",
          "Titre": "Cannot wait to go back next year!",
          "Contenu": "The presentation of the movie accompanied by the live music was a really nice Christmas activity. Everything went smoothly. Loved it!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dan Garrett",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T23:40:32.000Z",
          "Titre": "Spectacular show",
          "Contenu": "Spectacular show. Great sound and really effective visuals that showcased the band . The band really knows the audience and is great at playing to them.Definitely will see them again"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Yux",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T21:46:44.000Z",
          "Titre": "Such a great performance!!",
          "Contenu": "Such a great performance!!! Romeo is great at singing, interacting with audience etc. I really feel he put in full energy into this show!!! I definitely will go again!!!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Torontonorth",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T23:42:02.000Z",
          "Titre": "Easy process",
          "Contenu": "It was easy to order tickets and add to my wallet.  Ticketmaster email reminders before the concert were helpful.  The entire process from beginning to end was great!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "nataliep",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T20:06:33.000Z",
          "Titre": "Great show",
          "Contenu": "Great show, easy to purchase tickets."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "DEARMISSDEAR",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T00:34:00.000Z",
          "Titre": "Reaching Out To Touch Faith",
          "Contenu": "Ticketmaster had NOTHING to do with this experience, but this was one of the best concerts I've seen in years. Even 40 years later, and those boys still know how to deliver a stellar performance."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "EMMANUEL MONEGRO",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T22:04:27.000Z",
          "Titre": "One-man Show",
          "Contenu": "The concert actually took longer than agreed. He sand many songs the public requested LIVE. And interacted with the public on many occasions. DEFINITELY worth it. 10/10"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "BARB KALAR",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T22:57:46.000Z",
          "Titre": "The Ticketmaster site was easy to…",
          "Contenu": "The Ticketmaster site was easy to navigate and since I was a first time user and a senior I was nervous at the beginning.  10 minutes later I had my ticket displayed on my phone and was ready to head to the arena."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Leslie",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T20:40:50.000Z",
          "Titre": "The whole evening was amazing",
          "Contenu": "The whole evening was amazing!  Great seats (thanks to Sean and Paul), three excellent bands, fun waitress, running on time - and BIG WRECK!!  They were in fine form this time.  I've seen them many times and they did not disappoint."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Peggy  Dickie",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T23:39:43.000Z",
          "Titre": "Ease of purchase and process well…",
          "Contenu": "Ease of purchase and process well explained in preparation of event"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Bryan",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T19:10:17.000Z",
          "Titre": "Depeche Mode puts on such a great show",
          "Contenu": "Depeche Mode puts on such a great show. I appreciate the fact that I was able to buy seats directly from Ticketmaster rather than over-priced resale tickets."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "MICHAEL LANZ",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T19:48:49.000Z",
          "Titre": "Fantastic performer",
          "Contenu": "Fantastic performer.  He always does such a good job .   And tickets were very reasonably priced ."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "DAVE PETRIE",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T16:32:06.000Z",
          "Titre": "Improved technology",
          "Contenu": "Improved technology.  Managing tickets and parking passes is SIMPLE!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T04:17:32.000Z",
          "Titre": "He's such a talented person",
          "Contenu": "He's such a talented person.  We follow him.  Recommend this show fir great belly laughs.  Not for children."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "JOANNE CAMPLING",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T16:04:41.000Z",
          "Titre": "Easy online access",
          "Contenu": "Easy online access. Friendly to use. Frequent reminders of event and how to save tickets in various forms."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Gladys Vargas",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T16:34:11.000Z",
          "Titre": "The purchase of the tickets was fast…",
          "Contenu": "The purchase of the tickets was fast and easy. I loved the reminders that the show was coming! And the show itself was fantastic, I loved it"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "ANGELA MACARTHUR",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T23:17:05.000Z",
          "Titre": "Amazing concert",
          "Contenu": "Amazing concert!  first time seeing TSO, will definitely be going to see them again."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "DAWN MACDUFF",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T03:23:24.000Z",
          "Titre": "Easy Using Ticketmaster purchase",
          "Contenu": "Easy purchase, transfer of tickets to Apple wallet makes entry seamless."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "CARLA FERRO",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T00:59:22.000Z",
          "Titre": "Soultree",
          "Contenu": "Soultree.   Amazing band.  The main singer is  so much carismatic.   His daughters are great singers.   The trio is perfect together.   It was so so so so good.   No it was so  so so great.    Thank you for having this band.   I paid for 4 people.  My guests were very pleased."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "CAROL PETRUK",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:55:05.000Z",
          "Titre": "Good visuals to help choose our seats",
          "Contenu": "Good visuals to help choose our seats. Good guidance for loading our tickets as we are elderly and not the best with using our phones."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Cindy Loewen",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T21:51:44.000Z",
          "Titre": "Tenors were amazing!",
          "Contenu": "The line to get in was fairly fast.Employee were helpful and friendly.Had a wonderful evening!!The Tenors were amazing!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "FRANCOISE GUILLO",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T19:03:30.000Z",
          "Titre": "purchasing the tickets was…straightforward",
          "Contenu": "purchasing the tickets was straightforward. Ocie Elliot did a fantastic show, great music, great lights, great venue and great entertainment. Very calming music for these challenging times."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "JOAO RODRIGUES",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T23:07:06.000Z",
          "Titre": "I have been listening to Romeo Santos…",
          "Contenu": "I have been listening to Romeo Santos for the last 15 years even when he was with Aventura . Always wanted to see him never got a chance but wow one of my best concerts I been .!!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "TANIA DOMPIG",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T22:59:40.000Z",
          "Titre": "I had an amazing night and everything…",
          "Contenu": "I had an amazing night and everything was perfect to me. For so far my best show ever. I really loved the crowd, the stage and Romeo Santos himself was the best. When I purchased my tickets at Section 110 row 10 I was kind of scared about my view, but it was the best view for me. Literally beside the band and he came every time at the band side singing and dancing. Amazing. Ticket Master as well I want to thank for selling the tickets at a fair price. It was worth it. My husband and I had the best night of our live. 🙏"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "IgorC",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T20:09:54.000Z",
          "Titre": "What a great time !",
          "Contenu": "Liz is such a lovely person and great entertainer. Her voice as good as usual, she managed to keep people standing up all the time which is a rare thing these days. I would go again."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Pat F Vancouver Canada",
          "Nb_Reviews": 3,
          "Date": "2023-11-30T02:24:04.000Z",
          "Titre": "Well worth seeing",
          "Contenu": "The ease of purchasing tickets online was great. The voices of the Four Tenors is amazing. I don't think there is a bad seat in the house for this performance. My husband and I loved it from start to finish."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "BARBARA REALE",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T09:36:11.000Z",
          "Titre": "de soleil never disappoints",
          "Contenu": "Cirque de soleil never disappoints .Amazing performance, beautiful music, A+"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "TERRY",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T21:20:10.000Z",
          "Titre": "Awesome Doobie Brothers!",
          "Contenu": "So awesome to see the Doobie Brothers. Thanks Ticketmaster for bringing them to Calgary!Easy to select tickets and all went off without a hitch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KEDLER SYLVESTRE",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T21:56:15.000Z",
          "Titre": "Nice to see American basketball",
          "Contenu": "It is nice to get to see American basketball in Laval or Montreal. I think the more it happens, the more it will get popular."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "HELEN HO",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:13:23.000Z",
          "Titre": "Ease to purchase tickets",
          "Contenu": "Ease to purchase tickets, gets reminder & instructions on mobile tickets"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "KAREN DANDIE-WALKS",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T17:49:19.000Z",
          "Titre": "Super terrific concert at Ranchmans",
          "Contenu": "Super terrific concert at Ranchmans.  Drake is a wonderful singer with extensive voice range, personable, entertaining, versatile and  interacts with attendees.  I will definitely attend another of his concerts."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "RASHID SHEIKH",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:51:17.000Z",
          "Titre": "Great experience all staff nice show…",
          "Contenu": "Great experience all staff nice show wonderful"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "BEV TWIST",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T16:46:50.000Z",
          "Titre": "Very easy to purchase tickets and when…",
          "Contenu": "Very easy to purchase tickets and when going to show them at the door was also very easy"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Blair",
          "Nb_Reviews": 4,
          "Date": "2023-12-09T05:58:35.000Z",
          "Titre": "Buying",
          "Contenu": "Buying, using, entering all went really smoothly. Kiss concert was tremendous!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "DON PLEWS",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T22:04:29.000Z",
          "Titre": "Enjoyed everything about the venue and…",
          "Contenu": "Enjoyed everything about the venue and the performance. Sound was awesome."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "EVELYN GAUVIN",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T22:21:49.000Z",
          "Titre": "Awesome Experience",
          "Contenu": "Great experience from buying the tickets to actually seeing the concert. We have front row center seats with a meet and great."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "MARK ANDERLE",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T01:25:40.000Z",
          "Titre": "Great venue great band equals great night",
          "Contenu": "First of all commodore Ballroom never disappoints great venue and Big Wreck killed in they never disappoint either"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "ALEXANDRE BRAURE",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T21:00:17.000Z",
          "Titre": "They didn't play Monster :("
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "JESSICA KANTYMIR",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T15:46:14.000Z",
          "Titre": "When an Incredible show felt so…",
          "Contenu": "When an Incredible show felt so intimate for everyone highly recommend seeing ocie Elliot live"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "JACQUELINE DINELLE",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T01:42:35.000Z",
          "Titre": "Easy to buy tickets",
          "Contenu": "Easy to buy tickets store in your wallet to store, app works great also"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "SABRINA SHERIIEF",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T02:25:06.000Z",
          "Titre": "The concert was amazing but the sound…",
          "Contenu": "The concert was amazing but the sound guy ruined some spots the microphone was buzzing"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "SAMANTHA GOSLING",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T01:50:38.000Z",
          "Titre": "I loved the show",
          "Contenu": "I loved the show! They were an amazing show! Josh coming off stage giving a chance to dance with him join him in a song I loved this first experience at casino Rama!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "MICHELLE PENROSE-SINCLAIR",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T17:13:00.000Z",
          "Titre": "It was a great fundraiser and we were…",
          "Contenu": "It was a great fundraiser and we were happy to participate."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "DM",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T14:42:53.000Z",
          "Titre": "Excellent show",
          "Contenu": "Excellent show. Stees free online ticket redemption."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "CRAIG BARTLETT",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T23:25:42.000Z",
          "Titre": "JBLZE was OUTSTANDING!!",
          "Contenu": "Great show in a great venue!!Jason did his Dad proud!!Tight group hitting Led Zeppilin tunes out of the park!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "KEVIN MOYLE",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T04:33:16.000Z",
          "Titre": "Love the App",
          "Contenu": "Love the App. Tickets are accessible from the Lock-screen. Tickets are secure! Concert info is readily accessible!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Nat",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T20:27:25.000Z",
          "Titre": "Easy and fast",
          "Contenu": "Very easy to find and purchase tickets.I admit all the marketing add-ons are annoying though!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Maurice",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T00:13:15.000Z",
          "Titre": "Super 👍 Oui 👍"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "JC OSPINO",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T00:57:41.000Z",
          "Titre": "EASY TO USE APP",
          "Contenu": "The ease of use, and the reminders, i was just about to miss the concert cause i bought the tickets 7 months ago"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "DARIN SPEIGHT",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T17:01:45.000Z",
          "Titre": "Love Bond and this event brought it to…",
          "Contenu": "Love Bond and this event brought it to another level. Was an enjoyable evening experience."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "BRIAN BANYARD",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:47:55.000Z",
          "Titre": "Enjoyed the show"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "JEFF BROWN",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T01:24:01.000Z",
          "Titre": "Very easy to obtain and use tickets…",
          "Contenu": "Very easy to obtain and use tickets through the site. I will continue to use the service!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "GV",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T00:07:10.000Z",
          "Titre": "Amazing show",
          "Contenu": "Amazing show!  That man can sing!Opening DJ was also very entertaining."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "XIMENA CACERES",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T21:41:40.000Z",
          "Titre": "His yumminess",
          "Contenu": "His yumminess! His charisma! His interaction with his fan base. His serenading voice! All of him!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "DUNCAN PRESTAGE",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T23:22:16.000Z",
          "Titre": "Mobile Ticketing",
          "Contenu": "The mobile ticketing feature is fabulous. This includes the process of uploading your tickets to your mobile wallet, and expedient admission at the concert venue."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "NORMA JEAN",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T19:52:11.000Z",
          "Titre": "No issue with tickets",
          "Contenu": "No issue with ticketsWere in my CELL WALLTappreciated the update information prior to Concert event"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "AJ",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T03:48:53.000Z",
          "Titre": "Worth every penny!",
          "Contenu": "We bought our tickets to the Memento Mori Tour without any hitch.  We got the most A-OK seats and we enjoyed the concert so much!  Best birthday gift everrrrr!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "PAT MCPHERSON",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:57:22.000Z",
          "Titre": "The artist were all awesome"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "ERIC SMITH",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:28:59.000Z",
          "Titre": "Was an amazing Show"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "ABRAHAM RODRIGUEZ M",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T16:48:35.000Z",
          "Titre": "Great organization",
          "Contenu": "From the entrance all the way to the stage, the staff was very gentle and helpful, and everything was just about enjoying the concert. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Belinda",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T03:18:19.000Z",
          "Titre": "All round great vibe and an amazin set…",
          "Contenu": "All round great vibe and an amazing set by The Cat Empire. They played all the songs I love and more. The only criticism is I can’t get the tunes out of my head even days later."
        }
      ]
    }
  ]
}